{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"6_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 1,
				"body": "Отвратно видеть все эти гонения на фейсбук. Мы же знаем про слежку, все этим знанимаются. А тут получается что фейсбук во всех грехах виноват, а остальные как-бы непричем.",
				"added": 1522267734
			}
		],
		"4_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 2,
				"body": "Сбывается сценарий из Generation П.  К следующему сроку Putin точно будет с приставкой Deep.",
				"added": 1522267916
			}
		],
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": [
			{
				"comment_id": 3,
				"body": "Чтоб сразу организацию? Для начала неплохо бы сообщество, площадку. Сейчас никакого такого не имеется. Лор - сферический конь в вакууме существующий ради себя, у него нет каких-то целей и идеалов, он крутится вокруг типовых вариантов использования нескольких популярных дистров на десктопе и серверах, но не более того.",
				"added": 1522268558
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 4,
				"body": "Только Linux. Не думаю чтобы испытывал какую-то предрасположенность к никсам вообще. Linux тут исключение, по возможностям, популярности и поддержке оборудования. Тут скорее я принимаю что он к никсам относится как необходимый компромисс и легаси, так как выбора в общем-то и нет.",
				"added": 1522268943
			}
		],
		"1_1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL": [
			{
				"comment_id": 5,
				"body": ">Я считаю, что в подобных сетях ДОЛЖНА быть реализована возможность участия в управлении сетью пользователей. \n\nПока пример такой сети - Steemit. Да, для децентрализованного управления блокчейн - то что надо, но я не считаю хорошим подход, когда какие-то правила (кроме формата общения и других нейтральных вещей) навязываются всей сети. Принимают ли пользователи участие в управлении, или все определется комменческой организацией - результат примерно один. Причем управление толпой чаще хуже, чем при управлении ограниченным кругом лиц. Сравнить Steemit и Medium, и определить, что кому приятнее.\n\n Вот в федеративных сетях все куда лучше обстоит, узел сам определяет правила и цели для себя, люди могут выбрать себе подходящее место. Если в такой модели будут вовлекаться пользователи в управление отдельных узлов - даже лучше. Но тоже перегибать не стоит, должна быть защита и от тирании большинства, потому хорошо если узлы будут определять более менее ясно свою философию/цели и их придерживаться, а при участии пользователей в принятии решений они будут ориентироваться на изначальные цели, а не действовать хаотично и ситуативно. Но при достаточно независимых сообществах в сети - это должно отчасти происходить естественным образом благодаря присущей сообществам инертности, внутренней культуре.",
				"added": 1522269780
			}
		]
	},
	"comment_vote": {}
}