{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Nice post, just stopped by to state that ALSA allows to play many sound sources from different applications at the same time, you just need some configuration. Using its plugins like dmix and rateconverter you can make a device that all apps can use and it will work (now, note that there are many other quirks beyond just that, playing sources should match with rate and format for it to work, dmix can make some slight rate conversions but it isn't as good as pulse in that aspect.)\n\nI despise pulseaudio because of it's nature of being bloated (got rid of it and systemd a while ago), and tried setting with jack only but some of the apps I used didn't support jack and using workarounds for it using alsa wasn't working either as some depended on precise audio timing. I have to say though that both pulse and jack play quite nicely with each other if well set up.",
			"post_id": 9,
			"date_added": 1585924920
		},
		{
			"comment_id": 2,
			"body": "> [gitcenter](#comment_3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Well, even if ALSA supports several inputs, I think I don't want to have two places where connections are maintained -- ALSA config and JACK controls.\n> \n> This particular solution doesn't apply here because I wanted the action to be reversible (i.e., if JACK doesn't start for some reason, PulseAudio will still start as usual and work directly with ALSA). Also, I still need to start pulseaudio so using pasuspender won't work (I think).\n\nI was mainly commenting if trying to play more than one source at the same time in a system ONLY using ALSA (what I was doing), it is all set in $HOME/.asoundrc and most apps work (firefox too good to use alsa these days, it needs pulse to sound...).\n\nNow back to a pulse+jack setup, you don't really need to kill pulse and watch after race conditions for them to work, a proper setup would have pulse ALWAYS hand over the sound card whenever jackd starts, check the other modules listed in the [archlinux wiki](https://github.com/jackaudio/jackaudio.github.com/wiki/WalkThrough_User_PulseOnJack#redirecting-pulseaudio-to-jack)",
			"post_id": 9,
			"date_added": 1602942886
		},
		{
			"comment_id": 3,
			"body": "What we need is a zeronet core feature that could show tooltips about a given highlighted address; I'm always wondering which site a certain address belongs to when I'm browsing (and when playing with the zeronet data folder).",
			"post_id": 12,
			"date_added": 1604196960
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}