{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1598242145,
			"title": "So, if the CIA is now framing QAnons by manipulating the news...",
			"body": "Does this mean their movement will have to shift directions entirely? Will it now break down into its primary components? The Trump supporters, the anti-illuminati folk, the anti-human trafficking folk, the anti-pedophilia folk, the white nationalists, the \"woke\" folk... That's all that was done... Q unified these groups into a solidarity because it helped all of these individuals' causes... Before Q, all these people belonged to these groups already... Think about it...\n\nOh, and as Trump said recently when he was questioned about his support for the QAnon Movement, \"Is that a bad thing?\" Is it bad that Q Unified the American People?\n\n#FreeYourMind\n#ViresEnNumeris",
			"added": 1598242144
		},
		{
			"topic_id": 1598362059,
			"title": "We Are All Assange Now",
			"body": "#FreeJulianAssange\n#MakeAmericaFreeAgain\n#SheepNoMore\n\n152 lawyers and 15 legal associations have signed a detailed and scathing open letter condemning what they describe as the denial of Julian Assange’s ‘right to a fair trial before the UK courts’.Mr Assange, the co-founder of WikiLeaks, remains incarcerated in Belmarsh maximum-security prison as he challenges his potential extradition to the United States to face spurious charges under the Espionage Act, for his role in publishing classified US documents.The letter was sent to Prime Minister Boris Johnson, as well as the Home Secretary, Secretary of State for Justice, and Foreign Minister on 14 August 2020, though it was only made public on 17 August.The signatories, which include the International Association of Democratic Lawyers and the Association of American Lawyers, point to the potential conflicts of interest which Chief Magistrate, Senior District Judge Emma Arbuthnot, who ruled against Mr Assange early on during the extradition process, failed to disclose.The case has since been taken over by Judge Vanessa Baraitser, though as Chief Magistrate Judge Arbuthnot remains responsible for overseeing proceedings in the Magistrates’ Courts. Lady Arbuthnot: ’has been shown to have financial links to institutions and individuals whose wrongdoings have been exposed by WikiLeaks, the organisation which Mr Assange founded. This seemingly clear conflict of interest was, however, not disclosed by the District Judge.’They also note that: ‘Mr Assange has been denied time and facilities to prepare his defence in violation of the principle of equality of arms which is inherent to the presumption of innocence and the rule of law.’The examples they give include: the inability of Mr Assange to be able to properly consult with his lawyers (most recently his lawyers have complained that it has been 17 weeks since they were able to consult properly with their client).Judge Baraitser’s refusal to permit Mr Assange to sit with his lawyers during the substantive hearings and the delay of months before the defendant was provided a laptop to review the thousands of documents in his case which, once finally provided by prison authorities, remains unsuitable for his needs.Judge Baraitser’s refusal to address Mr Assange’s alleged mistreatment is also singled out by the jurists. One key example is when prison authorities, ‘handcuffed him 11 times, placed him in 5 different cells, strip-searched him twice, and confiscated his privileged legal documents’.\n\nThe letter also warns that 17 out of 18 of the charges ‘violate the right to freedom of expression, the right to freedom of the press and the right to know’. Any prosecution and extradition based on the current indictment would ‘gravely endanger freedom of the press, a cornerstone of European democracies enshrined in Art. 10 of the [European Convention on Human Rights]’.\n\n‘One of the most dangerous features of the Assange case is the idea that the US can seek to extradite any person, anywhere in the world, if they upset US interests.This extraterritorial reach is contrary to the rule of law and a dangerous attempt to undermine freedom of speech, a right all of us should cherish.’ said Former National President of the Australian Lawyers Alliance, Greg Barns who is among the signatories.Slovenian law Professor Andraž Teršek, who also signed the letter, argued that: ‘The case of Julian Assange is about political transparency, democratic legitimacy, free journalism and public media, which no individual should ever give up, and which no political institution, power or government should deny, prevent or punish. The trial’s implications are of great importance in modern society.’\n\nSignatories of the letter also warned that Mr Assange faces cruel and unusual punishment in the US and note with concern the fact that the UN torture expert and two other medical experts have recorded that the publisher has exhibited clear symptoms of psychological torture.\n\nThe documents published by Mr Assange revealed, among other things, war crimes and other criminality committed by US-led forces in Iraq, Afghanistan and Guantanamo Bay, Cuba. He faces up to 175 years in prison in the US if he is convicted on all of the charges in the indictment.\n\nhttps://europeansworldwide.wordpress.com/2020/08/21/we-are-all-assange-now/",
			"added": 1598362057
		}
	],
	"topic_vote": {
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": 1,
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1597908401_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": 1
	},
	"next_comment_id": 68,
	"comment": {
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 1,
				"body": "> [freemankind](#comment_23_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): EL6dXAIssLvBl-2RxfpTY1DpN1BlPggv8~~qi6ZYesg= [...]\n\n> [freemankind](#comment_22_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue_item_1+type:video\n\nThank you! :)",
				"added": 1597726026
			},
			{
				"comment_id": 3,
				"body": "> [c2vjcmv0](#comment_43_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): Her arrest is for her stealing a phone from her mother, and has nothing to do with the documentary: https://heavy.com/news/2020/08/millie-weaver-update-charges-arrest/ [...]\n\nPretty sure the OP here was just wanting to get people to start thinking more open mindedly as he said not try to influence opinions, but I could be wrong. I mean, I have read all the comments to this point and I have no reason to believe otherwise. If you want to let the video tell you what to think, fine. But, it seems like even if it is a bunch of fake news, then the key takeaway would be how to perform a type of PsyOp/Disinformation Campaign. Just saying...",
				"added": 1597743784
			},
			{
				"comment_id": 7,
				"body": "> [c2vjcmv0](#comment_44_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): Sure, but why use fake news when there are actual examples of manipulation through social media. Spreading fake news like this just makes everyone think that people who are skeptical towards the usage of social media are conspiracy nuts.\n\nI suppose that is true.\n\nKind of counter productive in that sense sure.\n\nHmm. Idk.",
				"added": 1597758971
			},
			{
				"comment_id": 10,
				"body": "> [thorburn](#comment_104_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): How about some fact? [...]\n\nOut of curiosity, where did you find all of that information?\nI would like to be able to quote a reliable source for my associates. Thanks!",
				"added": 1597841790
			},
			{
				"comment_id": 17,
				"body": "> [grouch0](#comment_2_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): How is getting it out there to millions of people retarded? YT is a steaming pile if shit but that's where the eyeballs are. I pulled my local copy from YT from the originating channel, as did many others. It had in excess of a million views before it was taken down, and the people who pulled it re-uploaded it on multiple platforms as well as YT, including translations. YT served a purpose by initially seeding the file and millions of views which is hardly retarded!\n\nYes. :)",
				"added": 1597887588
			},
			{
				"comment_id": 19,
				"body": "> [thorburn](#comment_106_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): My interpretation of events is formed on information from multiple sources, much of which came from the mouths of the parties concerned, as well as official documents as seen in links provided. The Toresays.com site has been destroyed, and that contained most if not all the podcast discussions and articles, especially the most recent relevant material. Afaik Tore has a new host and is trying to rebuild the lost data. [...]\n\nGot it. If need be I will be in touch. Thank you!",
				"added": 1597887676
			},
			{
				"comment_id": 20,
				"body": "> [itspecialist876](#comment_12_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG): Plandemic II is what you guys should be watching. It gives insight into what is going on now. Fake news can be used to discredit people who are \"woke\" or to confuse the masses so that they no longer care and just do their own thing.\n\nThat's been going on since I was born though.... Well actually probably WAYYY before that lol :P",
				"added": 1597887743
			},
			{
				"comment_id": 30,
				"body": "> [0mega](#comment_6_192xAupujZXB6jpoWqpwobPnEdQovAKiXc): Un-fucking-believable how stupid the average trumptard is. What are you cucks going to do when trump gets killed on live tv? I suggest you all gather and take long and hot baths with toasters. Fucking shit fly maga oxygen and space wasters....RL nobodies. Enough of ya\n\nLol why do you hate Trump so much?\n\nIs it because his policies do not work even 1/100th of a percent as well as they do for those of us who support him and what he stands for?...\nSeriously, I don't understand it if not...\n\nI was never for Trump until I figured out how to circumvent all censorship... Now, I tell myself how foolish I was and I realize everything he does as President almost mirrors the thoughts thoughtsI have always had with regard to what should be done to rectify the terrible issues that have plagued America for almost a Century now...\n\n#FuckTheNewWorldOrder",
				"added": 1597966842
			},
			{
				"comment_id": 31,
				"body": "Perhaps maybe you do not live in the US where you have been in constant threat your whole life due to a corrupt government.... Perhaps you do not understand how it feels to have a President who is actually helping you for a change...\n\nPerhaps you are simply an Anarchist or Socialist... Or even maybe a Communist... That would explain a lot too... Lol :)",
				"added": 1597967077
			},
			{
				"comment_id": 38,
				"body": "> [c2vjcmv0](#comment_61_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): Here, hold this iron E. [...]\n\nLol he seems like he was generalizing all of you into one group and basing his argument on the fact that one of you who was against him was rather dimwitted. He has got quite the temper! xD",
				"added": 1598092398
			},
			{
				"comment_id": 41,
				"body": "> [thorburn](#comment_113_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Lmfao, there certainly is such a thing as fact checking and sourcing, but you sure as hell don't bother to do either obviously! ShadowGate provides the Government payments website as a source. That source shows the fact that the companies mentioned were paid by the government. It also shows the data etc. is/was stored and managed outside of the American continent in Germany by a none governmental third-party. [...]\n\nSlippery likes snakes on a mutha fuckin' plane boi! https://www.amazon.com/Snakes-Suits-When-Psychopaths-Work/dp/0061147893",
				"added": 1598099090
			},
			{
				"comment_id": 42,
				"body": "> [kapec](#comment_26_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Zeronet is not your personal army.\n\nI think he was more so refering to the defenders of truth online. Its pretty standard and well known now that many individuals such as ourselves refer to the collective group involved in the movement to expose corruption within the US Government.\n\nDigital Warriors is used sometimes too.\nDonald Trump called us Keyboars Warriors a few weeks ago before just last week coming out and making statements to the press in our defense.\n\nI highly doubt a man or OTBTechnologies' stature considers ZeroNet of all places his personal army. The man is definitely not stupid based on what I have come to know of him. He may well have a personal army that he is keeping secret from the world for all I know! Haha :)\n\n#QArmy",
				"added": 1598110377
			},
			{
				"comment_id": 50,
				"body": "> [kapec](#comment_27_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I have strange suspicion that otbtech and wwg1wga are the same guy.They both follow similar mannerism and respond in similar timeframes.\n\nWhat are you a conspiracy theorist? Lol :)\n\nWelcome to the club bud.\n\nhttps://www.businessinsider.com/fbi-document-conspiracy-theories-domestic-terrorism-threat-2019-8\n\nLook what we can do! :)\n\nhttps://graphcommons.com/graphs/0a79deca-46a2-48e9-9d90-326b20aa6e9e\n\nThat's about as crazy as those people saying Donald Trump is Q Plus, or that he himself created the whole QAnon movement himself.\n\nSilly lad you are eh?",
				"added": 1598117082
			},
			{
				"comment_id": 52,
				"body": "> [qarmy](#comment_5_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe): Also, take into account that was well over 7 years ago... [...]\n\nDude what the fuck?!?!?!\n\nAre you the guy everyone has been talking about who reverse engineering the CIA?!?!?!\n\nHoly shit!\n\nBro!\n\nYou are a legend! ❤❤❤",
				"added": 1598237597
			},
			{
				"comment_id": 53,
				"body": "> [qarmy](#comment_4_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe): Feel free to inquire with the #FBI for more information regarding what was done to me... [...]\n\nThat would require me to file a Freedom of Information Act Request right?...\n\nhttps://www.foia.gov/faq.html",
				"added": 1598241226
			},
			{
				"comment_id": 62,
				"body": "Bump... ;-)\n\n#ThinkForYourselves\n#QuestionEverything\n#TrustNo1",
				"added": 1598280290
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 2,
				"body": "Use a clean SOCKS5 Proxy (they are cheap as dirt) or use a clean RDP/VPS... Either way is good.",
				"added": 1597730139
			},
			{
				"comment_id": 6,
				"body": "Why not just use 8Kun/8chan instead like everyone else is doing now?\n\nThey allow Tor and VPNs...",
				"added": 1597746348
			},
			{
				"comment_id": 22,
				"body": "> [otbtechnologies](#comment_63_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/  -  8Kun/8Chan [...]\n\nhttp://jthnx5wyvjvzsxtu.onion is the link for the centralized 8Kun which is what I was refering to, but those Zites are pretty interesting too...",
				"added": 1597918445
			},
			{
				"comment_id": 23,
				"body": "> [otbtechnologies](#comment_63_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/  -  8Kun/8Chan [...]\n\nhttp://jthnx5wyvjvzsxtu.onion is the link for the centralized 8Kun which is what I was refering to, but those Zites are pretty interesting too...",
				"added": 1597918478
			}
		],
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": [
			{
				"comment_id": 4,
				"body": "> [otbtechnologies](#comment_47_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): \"Every now and then a man's mind is stretched by a new idea or sensation, and never shrinks back to its former dimensions.\"--Oliver Wendell Holmes, Sr. [...]\n\nMakes sense. I feel like the best model is like that of Freifunk which is almost comparable to a federated network of sorts. https://Freifunk.com/en/ for more information on the model type that would be most readily adapted by modern consumers. From there a mobile device to mobile devise protocol can be put in place as a mesh network of its own to allow for faster data transmission using a dynamic network setup. Make sense?",
				"added": 1597745285
			},
			{
				"comment_id": 5,
				"body": "Oh! And there is actually a project similar to what I just described in South America (Columbia maybe?) that rewards users for their contributions to the network via cryptocurrency.\n\nIts a genius way to attract and keep the Network expanding. Everyone loves money right? :)",
				"added": 1597745460
			},
			{
				"comment_id": 8,
				"body": "LOL! Look at this here!\n\nI found the mesh network project I was refering to that was originally in South America!\n\nGuess what? Its now spreading to the USA! xD\n\nhttps://news.bitcoin.com/coronavirus-p2p-connectivity-crypto-meshnet-internet/",
				"added": 1597762373
			},
			{
				"comment_id": 9,
				"body": "> [edgelordofdecent](#comment_634_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Althea? Was that one created by artists?\n\nDefine art... ;-)",
				"added": 1597795033
			}
		],
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 11,
				"body": "> [itspecialist876](#comment_6_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG): DTube or bitchute is better than youtube if censorship bothers you. LBRY ain't bad either. Mewe.com is a greater alternative to facebook. The popular platforms are working together to destroy America by suppressing truth and fueling hate and other agendas.\n\nI agree with what all you have said, but I prefer Diaspora over MeWe though some on diaspora also use MeWe I prefer not to do so.\n\nhttps://diasporafoundation.org for more information on why it is actually far superior to Parler or MeWe or any other alternative at this time really. You get to choose the jurisdiction your data is in (Think Finland...) Also, it is federated so mass surveillence is extremely difficult. Anonymity is allowed. Almost no censorship on the best pods. Plus you can run your own pod. :)",
				"added": 1597846111
			},
			{
				"comment_id": 12,
				"body": "> [itspecialist876](#comment_6_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG): DTube or bitchute is better than youtube if censorship bothers you. LBRY ain't bad either. Mewe.com is a greater alternative to facebook. The popular platforms are working together to destroy America by suppressing truth and fueling hate and other agendas.\n\nAlso check out PeerTube as it is also federated so by nature it cannot be turned into a bullshit service like YT. Its like Diaspora where you choose what server you data is on and where. Also you can run your own instance even better yet! :)",
				"added": 1597847327
			},
			{
				"comment_id": 40,
				"body": "> [falken](#comment_3_15Eji3MdHu8BZaF2a9yTLJmKrUVTuHuumM): American here, hate this country but I hate every other country more\n\nThat makes no sense but ok lol :)\n\n#Panama is pretty inviting imo :)",
				"added": 1598092506
			}
		],
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 13,
				"body": "No. Censorship is bad. I will no longer promote Zeronet if this happens. As a matter of fact, I will tell people to shift to other similar alternatives instead if this happens. Terrible idea.",
				"added": 1597851931
			},
			{
				"comment_id": 14,
				"body": "I'm actually somewhat disgusted that you even brought this topic of discussion up... Smh...",
				"added": 1597852094
			},
			{
				"comment_id": 15,
				"body": "The whole point of ZeroNet is for users to be able to escape the exact same tyranny you describe having the desire to implement... \n\nSo, why would one want to do such?\n\nPower... Hunger for control and power...\n\nPower corrupts...\n\nIt will corrupt the moderators just like it corrupted our politicians... Shame on you... >:-|",
				"added": 1597852695
			},
			{
				"comment_id": 21,
				"body": "Lol OTB! :P",
				"added": 1597887796
			},
			{
				"comment_id": 24,
				"body": "> [thorburn](#comment_109_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Are you suggesting that I'm a ranker? Sorry about the lisp.  [...]\n\nLook idk what you do in your free time, and I do not CARE what you do in your free time man! xD",
				"added": 1597918653
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 16,
				"body": "> [itspecialist876](#comment_13_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG): Most ppl will gravitate towards other platforms instead of Zeronet because they aren't tech savvy. Eventually there will be a shift when the popular platform become more draconian.\n\nOr when a genius decides to set up a... \n\nNevermind.. :)\n\nI'll surprise you ^_^\n\n#HackThePlanet",
				"added": 1597887149
			}
		],
		"1597908401_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 25,
				"body": "> [c2vjcmv0](#comment_50_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): What is good? Well, it's subjective. [...]\n\nExactly. Some just suggested user moderation by vote and I brought this up. They claim they only want to moderate spam and CP for example. Thats how it starts then things get convoluted of course. Just like with any other form of government.",
				"added": 1597921329
			},
			{
				"comment_id": 26,
				"body": "> [c2vjcmv0](#comment_52_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): ...and user voting \"karma\" is not a grantee that the information that is up-voted is accurate. Just look at the shit storm that is reddit or hackernews.\n\nNo they want to force people to delete their content if the admin's appointed moderators downvote it though... Which is censorship...\n\n> [geekless](#comment_224_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): What's wrong if a person runs a site with some silly moderation rules? It's his/her choice and nothing forces you using it.Do you really think John Doe can establish a government to rule you?\n\nYes. Yes, I do. Look at America; a country of rebels that formed their own government aside from the English. These now deceased ancestors of the American people had formed their own government back in the 1700s which has become corrupt. So, now the people of America are in the process of overthrowing said corrupt government while simultaneously forming their own form of government as we all speak...\n\nSo, yes. Yes, I do think that to be entirely possible. :)",
				"added": 1597932286
			},
			{
				"comment_id": 28,
				"body": "> [geekless](#comment_225_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): What does this story have to do with such private property as a personal website? [...]\n\nnofish, being the owner of a Zite that is highly popular and is an introduction point for new users to ZeroNet holds more power as is and thus would be wise how he chooses to use his power.\n\nThat's all the more I am going to say...",
				"added": 1597948305
			},
			{
				"comment_id": 29,
				"body": "> [zerolady](#comment_21_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p): There's a special feedback.If porn content is flooded on Zeronet, then all the advanced technology will be wasted.See the interaction atUser-level moderation — Zeronet long term operation     [...]\n\nThat idea may serve the purpose without infringing upon human rights as many others such as OP and geekless are pushing to have happen. I can get on board with that idea; maybe call it \"alternative categories of discussion.\" That would accomplish the goal and keep away those seeking to destroy freedoms.",
				"added": 1597953813
			},
			{
				"comment_id": 33,
				"body": "> [geekless](#comment_226_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Censorship is bad unless it is nofish who censor you. [...]\n\nPutting words in others mouths is a cheap trick in the field of politics.... Lol :)",
				"added": 1597967370
			},
			{
				"comment_id": 34,
				"body": "> [freemankind](#comment_27_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): we dont need censorship heredont seed the zites you dont want to see\n\nExactly.\nFuck all the Socialist and Communists on here that say otherwise. Fr fr... :-S",
				"added": 1597967447
			},
			{
				"comment_id": 35,
				"body": "> [styromaniac](#comment_2525_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): An nsfw tag placed by the author. Correct tagging can bring more traffic.\n\nTrue as well.",
				"added": 1597967471
			},
			{
				"comment_id": 36,
				"body": "> [geekless](#comment_232_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Nice attitude to take ZeroNet down, by the way. [...]\n\nOkay. Now I am understanding more why this might be necessary. Thanks!",
				"added": 1598008930
			},
			{
				"comment_id": 43,
				"body": "> [kapec](#comment_25_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): If at all it should be done as an external plugin/addon in which the end user can tag inappropriate content/user to his/her individual liking and moral values. [...]\n\nI like this idea...",
				"added": 1598110495
			}
		],
		"1597577135_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 27,
				"body": "> [itspecialist876](#comment_15_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG): They want to go cashless so they can control our money.\n\nAnd track us and our purchasing habits.\n\nIt's illegal per the Universal Declaration of Human Rights though.... Smh...",
				"added": 1597937005
			}
		],
		"1598036610_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 37,
				"body": "> [bats](#comment_17_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): using facebook your role is to enjoy the banner at the top. learn to enjoy the banner and also the continual rape.\n\nLol... Can't wait until they all get put in the ovens :)",
				"added": 1598050613
			},
			{
				"comment_id": 39,
				"body": "> [marcusfinch](#comment_30_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): Then goodbye to her.  And nothing of value was lost.\n\nYep yep! :)",
				"added": 1598092445
			}
		],
		"1598242145_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": [
			{
				"comment_id": 54,
				"body": "Well what I found odd about it was that the only reason I found out about QAnon is because someone I know told me the things I taught them about the Illuminati about 10 years ago seemed to be the same type of things the QAnons were trying to bring light to as well. Once I studied the Movement, I determined that it did just as I said, unified the American people and helped expose the evil in this country along with the supporters of the evil powers. However, I wouldn't call non-Q supporters \"un-American,\" but rather that we hold different values on what is best for the future of the country. \n\nNow, if the anti-Q people did something unamerican, then I would be having some words with them. But, that is a seperate topic than the one I am trying to address. Is Q Anon bad?\n\nOr, did it unite (let me rephrase this for you) a bunch of individuals that shared the same objectives? The adherants of Q's constantly said, \"There's safety in numbers.\" Which is very true and also is Bitcoin's founding principle (Search info on SearX when you get a moment) for a fun fact lol. Now look back on ZeroNet where OTBTechnologies mentioned Q being Satoshi Nakamoto. Think about it.\n\nIt fascinating to ponder. No?\n\nBack to the topic at hand though, should the QAnons find a new leader and remain as unified as possible or should they dissamble into their core components as is happening now while the CIA continues to frame them as terrorists?",
				"added": 1598245431
			},
			{
				"comment_id": 55,
				"body": "> [adrenochrome](#comment_29_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): The most problematic part of the so called Q Movement is to educate it's followers to be passive: \"Don't do anything, we (Q) will fight the deep state. Q is our savior.\" It's like a cult. So there is a high probability, that Q is just a CIA PsyOp. [...]\n\nThat's very observant of you. :)",
				"added": 1598245477
			},
			{
				"comment_id": 57,
				"body": "In order to create a successful PSYOP the following must be established:\n\n1    clearly define the mission so that it aligns with national objectives\n2   need a PSYOP estimate of the situation\n3    prepare the plan\n4    media selection\n5    product development\n6    pretesting - determines the probable impact of the PSYOP on the target audience\n 7   production and dissemination of PSYOP material\n8    implementation\n9    posttesting - evaluates audience responses\n    feedback\n\nBefore these steps can occur, intelligence analysts must profile potential targets in order to determine which ones it would be most beneficial to target. In order to figure this out, analysts must determine the vulnerabilities of these groups and what they would be susceptible to. The analysts also determine the attitudes of the targets toward the current situation, their complaints, ethnic origin, frustrations, languages, problems, tensions, attitudes, motivations, and perceptions, and so on. Once the appropriate target(s) have been determined, the PSYOP can be created",
				"added": 1598246182
			},
			{
				"comment_id": 58,
				"body": "PsyOps conducted on the American people would be illegal though unless done Anonymously and with plausible deniability (which is a term coined by the CIA refering to a legal defense they came up with which would (in theory) protect the US President from getting in trouble for their illegal activities that we came to realize were happening when the term was coined...)\n\nhttps://nsarchive2.gwu.edu//NSAEBB/NSAEBB177/index.htm\n\nPlausible denial involves the creation of power structures and chains of command loose and informal enough to be denied if necessary. The idea was that the CIA and later other bodies could be given controversial instructions by powerful figures, including the President himself, but that the existence and true source of those instructions could be denied if necessary if, for example, an operation went disastrously wrong and it was necessary for the administration to disclaim responsibility. \n\nhttps://en.m.wikipedia.org/wiki/Plausible_deniability\n\n#PsyOp #PsychologicalOperations #Unethical",
				"added": 1598246666
			},
			{
				"comment_id": 61,
				"body": "Bump! :)",
				"added": 1598279963
			},
			{
				"comment_id": 63,
				"body": "> [bigbadbob](#comment_1127_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I don't really have any information to bring up. However I must wonder how may Q followers (Or people in general who get sucked deep into politics) are unemployed?  When I was unemployed I had enough free time to start thinking everything was wrong with everything.  But now I work all the time and don't really give a shit about the fact we will always be ruled by mediocrity or dwell on the fact slimy people exist.  I'm saving up for Dihatsu Hijet!  It's gonna be soooo Awesome! :D\n\nQ's following did in fact increase due to soaring unemployment as a matter of fact lol\n\n> [zaron](#comment_183_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Q is a troll. that's what it is\n\nQ was a troll of sorts kind of like the ones Israel employs, but then it became a PsyOp once it was determined his following was large enough to merit it by the US Government. Whether Military Intelligence or CIA run; doesn't matter.",
				"added": 1598348547
			}
		],
		"1598173642_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 56,
				"body": "> [bigbadbob](#comment_1126_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): The only thing Trump is a victim of is a bucket of fried chicken.\n\nI'm not sure I follow. \nVery interesting choice of words lol",
				"added": 1598245862
			}
		],
		"1598232523_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 59,
				"body": "I am actually working on turning it into a ZeroNet site when I have time. I wanted to have it up by now, but life's hectic you know? :)\n\nIts already widely distributed, but since it was written in 2019 I have a few things to tweak.\n\nZeroNet is the perfect platform for it to be distributed. I have tried distributing via Tor with success and also torrent with some success also. I want the even more indestructible of ZeroNet now though haha :)",
				"added": 1598262030
			}
		],
		"1598185671_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe": [
			{
				"comment_id": 60,
				"body": "Lol bump :)",
				"added": 1598262072
			}
		],
		"1598318322_18KYwT54HWsxnM6rz9umuhH8SnvNBx5Vdx": [
			{
				"comment_id": 65,
				"body": "You should read more and make one yourself instead of being lazy... Of course only use it for educational purposes only since most other uses are very illegal... Just my two cents dude...",
				"added": 1598437379
			}
		],
		"1596458821_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 66,
				"body": "Is this related?...\n\nhttps://en.wikipedia.org/wiki/Panama_Papers",
				"added": 1598456770
			}
		],
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 67,
				"body": "> [kapec](#comment_35_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I'd say you're not very intelligent to majority of us on zeronet. [...]\n\nHow many of you have Ph.D.'s again...? Lol :)\n\nFucking bitch boy... xD",
				"added": 1598566318
			}
		]
	},
	"comment_vote": {
		"22_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"23_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"103_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"24_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"32_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"20_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"47_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"14_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": 1,
		"102_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"104_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"6_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG": 1,
		"4_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG": 1,
		"61_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"24_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": 1,
		"15_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG": 1,
		"228_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"27_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"2525_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"28_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"111_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"181_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"30_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"113_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"25_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"28_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1125_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"29_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1
	}
}