{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 1,
				"body": "Автор почитай сначала что такое демократия в первоначальном смысле этого слова. Затем сопоставь с тем, что есть сейчас. Потом подумай правда ли все равны в правах? А в возможностях? Хотел бы ты что б тебя или твоих близких лечили демократические врачи?\nВот представь. У тебя закололо в правом боку. Вместо врача собирается электорат и начинает прения по поводу того, что это и стоит ли тебя лечить, и как. Один говорит, что надо приложить подорожник. Второй говорит что ты ударился третьей пяткой, и поэтому нарушился баланс жидкостей.Нужно срочно пустить кровь. Третий предлагает подождать, вдруг само пройдет. Они начинают голосовать по какому пути идти. И т.д. В результате вместо того что б обратиться к профессионалу, и вырезать воспалившийся аппендикс, ты будешь ощущать победу демократии.\nОно тебе нужно?\nИ да. Покажи мне хотя бы одно государство на планете Земля, где есть демократия. Только так, что б она была действительно демократией!",
				"added": 1562441602
			},
			{
				"comment_id": 2,
				"body": "> [if0](#comment_100_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А может, все таки, не будет самостоятельно лечить, а только утвердит большинством всем известного доктора, которому можно доверить лечение?\n\nА кто будет утверждать? Те кто в медицине ничего не понимают? Может выжившие, по воле случая, а не в результате профессиональной деятельности?\nДемократия сейчас хорошо распространена по одной причине. Человеческим мнением научились хорошо манипулировать. \nВ основе демократии заложено то, что все равны. Это в принципе невозможно. В природе нет равенства и в этом ее сила. Истинную демократию все забыли. Исторически демократия была - равенство граждан. Гражданином являлся человек имеющий свободу и власть. Под властью понимаю способность влиять на общество в котором он живет. Фактически это были те, кого сейчас принято называть олигархами. Именно они решали что и как делать путем голосования. И чем настоящая демократия отличается от любого другого политического мировоззрения?\nНеравенство это норма. Сильные всегда договариваются, иначе они становятся слабыми. Любой политический строй всегда скатывается к власти сильных. По убеждениям я технократ, но боюсь что и эта система рано или поздно скатится к делению людей на касты и власть будут делить, пусть путем голосования, но сильнейшие этих каст. Пожалуй это единственное что естественно.",
				"added": 1562513380
			}
		]
	},
	"comment_vote": {}
}