{
	"pages": [
		{
			"id": "f0163b80-9b4f-11e7-b320-33a2f78de26c",
			"body": "中国南部的一个[[特别行政区]]\n\nfrom wikipedia\n\n Hide\n Wiki Loves Monuments: Photograph a monument, help Wikipedia and win!\nThis is a good article. Click here for more information. Page semi-protected\nHong Kong\nFrom Wikipedia, the free encyclopedia\nThis article is about Hong Kong as a special administrative region of China. For other uses, see Hong Kong (disambiguation).\n\"HK\" redirects here. For other uses, see HK (disambiguation).\nHong Kong Special Administrative Region of the People's Republic of China\n中華人民共和國香港特別行政區\nA flag with a white 5-petalled flower design on solid red background\nFlag\nA red circular emblem, with a white 5-petalled flower design in the centre, and surrounded by the words \"Hong Kong\" and \"中華人民共和國香港特別行政區\"\nEmblem\nAnthem: \"March of the Volunteers\"[1]\n\nMENU0:00\nCity flower\nBauhinia blakeana (洋紫荊)\nLocation of Hong Kong within China\nLocation of Hong Kong\nStatus\tSpecial administrative region\nOfficial languages\t\nChinesea English\n[2][3]\nOfficial scripts[4]\t\nTraditional Chinese English alphabet\nEthnic groups\t\n93.6% Chinese\n6.4% others [note 1] [6]\nDemonym\t\nHong Konger\nHong Kongese\n香港人\nSovereign state\t China\nGovernment\tMulti-party system\n• Chief Executive\nCarrie Lam\n• Chief Secretary\nMatthew Cheung\n• Financial Secretary\nPaul Chan Mo-po\n• Secretary for Justice\nRimsky Yuen\n• Council President\nAndrew Leung\n• Chief Justice\nGeoffrey Ma\nLegislature\tLegislative Council\nHistory\n• British possession\n26 January 1841\n• Treaty of Nanking\n29 August 1842\n• Convention of Peking\n18 October 1860\n• Second Convention of Peking\n1 July 1898\n• Japanese occupation\n25 December 1941\nto 15 August 1945\n• Transfer of sovereignty\nfrom United Kingdom\n\n1 July 1997\nArea\n• Total\n2,755 km2 (1,064 sq mi) (unranked)\n• Water (%)\n59.8 (1,649 km2; 637 sq mi)[7][8]\nPopulation\n• 2016 estimate\n7,374,900[9] (100th)\n• Density\n6,544[6]/km2 (16,948.9/sq mi) (4th)\nGDP (PPP)\t2016 estimate\n• Total\n$429.652 billion[10] (44th)\n• Per capita\n$58,322[10] (11th)\nGDP (nominal)\t2016 estimate\n• Total\n$320.668 billion[10] (33th)\n• Per capita\n$43,528[10] (16th)\nGini (2016)\t53.9[11]\nhigh\nHDI (2014)\tIncrease 0.910[12]\nvery high · 12th\nCurrency\tHong Kong dollar (HK$) (HKD)\nTime zone\tHong Kong Time (UTC+8)\n• Summer (DST)\nnot observed (UTC+8)\nDate format\tdd-mm-yyyy\nyyyy年mm月dd日\nDrives on the\tleft\nCalling code\t+852\nISO 3166 code\tHK\nInternet TLD\t.hk\n.香港\n^ Cantonese is the de facto standard of Chinese used.\nHong Kong\nTE-Collage Hong Kong.png\nClockwise from top:Skyline of Hong Kong Island from the Peak, Tian Tan Buddha, Two International Finance Centre, Kennedy Town, Nathan Road, Avenue of Stars, Government House and Tsing Ma Bridge\nChinese\t香港\nCantonese Yale\tHēunggóng\nLiteral meaning\tFragrant Harbour,\nIncense Harbour[13][14]\n[show]Transcriptions\nHong Kong Special Administrative Region\nTraditional Chinese\t香港特別行政區\n(香港特區)\nSimplified Chinese\t香港特别行政区\n(香港特区)\nCantonese Yale\tHēunggóng Dahkbiht Hàhngjingkēui\n(Hēunggóng Dahkkēui)\n[show]Transcriptions\n\tThis article contains Chinese text. Without proper rendering support, you may see question marks, boxes, or other symbols instead of Chinese characters.\nHong Kong, officially the Hong Kong Special Administrative Region of the People's Republic of China, is an autonomous territory south to Mainland China and east to Macao in East Asia. With around 7.2 million Hong Kongers of various nationalities[note 2] in a territory of 1,104 km2, Hong Kong is the world's fourth most densely populated country or territory.\n\nHong Kong used to be a British colony with the perpetual cession of Hong Kong Island from the Qing Empire after the First Opium War (1839–42). The colony expanded to the Kowloon Peninsula in 1860 and acquired a 99-year lease of the New Territories from 1898. Hong Kong was later occupied by Japan during the Second World War until British control resumed in 1945. The Sino-British Joint Declaration signed between the United Kingdom and China in 1984 paved way for the transfer of sovereignty of Hong Kong in 1997, when it became a special administrative region (SAR) of the People's Republic of China with a high degree of autonomy.[15]\n\nUnder the principle of \"one country, two systems\",[16][17] Hong Kong maintains a separate political and economic system from China. Except in military defence and foreign affairs, Hong Kong maintains its independent executive, legislative and judiciary powers.[18] In addition, Hong Kong develops relations directly with foreign states and international organisations in a broad range of \"appropriate fields\".[19] Hong Kong involves in international organizations, such as the WTO[20] and the APEC [21], actively and independently.\n\nHong Kong is one of the world's most significant financial centres, with the highest Financial Development Index score and consistently ranks as the world's most competitive and freest economic entity.[22][23] As the world's 8th largest trading entity,[24] its legal tender, the Hong Kong dollar, is the world's 13th most traded currency.[25] As the world's most visited city,[26][27] Hong Kong's tertiary sector dominated economy is characterised by competitive simple taxation and supported by its independent judiciary system.[28] Even with one of the highest per capita incomes in the world, it suffers from severe income inequality.[29]\n\nNicknamed \"Pearl of the Orient\", Hong Kong is renowned for its deep natural harbour, which boasts the world's fifth busiest port with ready access by cargo ships, and its impressive skyline, with the most skyscrapers in the world.[30][31] It has a very high Human Development Index ranking and the world's longest life expectancy.[32][33] Over 90% of the population makes use of well-developed public transportation.[34][35] Seasonal air pollution with origins from neighbouring industrial areas of Mainland China, which adopts loose emissions standards, has resulted in a high level of atmospheric particulates in winter.[36][37][38]\n\nContents  [hide] \n1\tEtymology\n2\tHistory\n2.1\tPrehistory\n2.2\tImperial China\n2.3\tBritish Crown Colony: 1842–1941\n2.4\tJapanese occupation: 1941–45\n2.5\tResumption of British rule and industrialisation: 1945–97\n2.6\tHandover and Special Administrative Region status\n3\tGovernance\n3.1\tStructure of government\n3.2\tElectoral and political reforms\n3.3\tLegal system and judiciary\n3.4\tForeign relations\n3.5\tHuman rights\n3.6\tRegions and districts\n3.7\tMilitary\n4\tGeography and climate\n5\tEconomy\n5.1\tFinancial centre\n5.2\tInternational trading\n5.3\tTourism and expatriation\n5.4\tPolicy\n5.5\tInfrastructure\n6\tDemographics\n6.1\tLanguages\n6.2\tReligion\n6.3\tPersonal income\n6.4\tEducation\n6.5\tHealth\n7\tCulture\n7.1\tSports\n7.2\tArchitecture\n7.3\tCityscape\n7.4\tSymbols\n8\tSee also\n9\tNotes\n10\tReferences\n10.1\tCitations\n10.2\tSources\n11\tFurther reading\n12\tExternal links\nEtymology\nHong Kong was officially recorded in the 1842 Treaty of Nanking to encompass the entirety of the island.[39]\n\nThe source of the romanised name \"Hong Kong\" is not known, but it is generally believed to be an early imprecise phonetic rendering of the pronunciation in spoken Cantonese 香港 (Cantonese Yale: Hēung Góng), which means \"Fragrant Harbour\" or \"Incense Harbour\".[13][14][40] Before 1842, the name referred to a small inlet—now Aberdeen Harbour (Chinese: 香港仔; Cantonese Yale: Hēunggóng jái), literally means \"Little Hong Kong\"—between Aberdeen Island and the southern coast of Hong Kong Island. Aberdeen was an initial point of contact between British sailors and local fishermen.[41]\n\nAnother theory is that the name would have been taken from Hong Kong's early inhabitants, the Tankas (水上人); it is equally probable that romanisation was done with a faithful execution of their speeches, i.e. hōng, not hēung in Cantonese.[42] Detailed and accurate romanisation systems for Cantonese were available and in use at the time.[43]\n\nFragrance may refer to the sweet taste of the harbour's fresh water estuarine influx of the Pearl River or to the incense from factories lining the coast of northern Kowloon. The incense was stored near Aberdeen Harbour for export before Hong Kong developed Victoria Harbour.[40]\n\nThe name had often been written as the single word Hongkong until the government adopted the current form in 1926.[44] Nevertheless, a number of century-old institutions still retain the single-word form, such as the Hongkong Post, Hongkong Electric and the Hongkong and Shanghai Banking Corporation.\n\nAs of 1997, its official name is the \"Hong Kong Special Administrative Region of the People's Republic of China\". This is the official title as mentioned in the Hong Kong Basic Law and the Hong Kong Government's website;[45] however, \"Hong Kong Special Administrative Region\" and \"Hong Kong\" are widely accepted.\n\nHong Kong has carried many nicknames. The most famous among those is the \"Pearl of the Orient\", which reflected the impressive nightscape of the city's light decorations on the skyscrapers along both sides of the Victoria Harbour. The territory is also known as \"Asia's World City\".\n\nHistory\nMain articles: History of Hong Kong and History of China\nPrehistory\nMain article: Prehistoric Hong Kong\nArchaeological studies support human presence in the Chek Lap Kok area (now Hong Kong International Airport) from 35,000 to 39,000 years ago and on Sai Kung Peninsula from 6,000 years ago.[46][47][48]\n\nWong Tei Tung and Three Fathoms Cove are the earliest sites of human habitation in Hong Kong during the Paleolithic Period. It is believed that the Three Fathom Cove was a river-valley settlement and Wong Tei Tung was a lithic manufacturing site. Excavated Neolithic artefacts suggested cultural differences from the Longshan culture of northern China and settlement by the Che people, prior to the migration of the Baiyue to Hong Kong.[49][50] Eight petroglyphs, which dated to the Shang Dynasty (c. 1600 BC – 1066 BC) in China, were discovered on the surrounding islands.[51]\n\nImperial China\nMain article: History of Hong Kong under Imperial China\nIn 214 BC, Qin Shi Huang, the first emperor of a centralised China, conquered the Baiyue tribes in Jiaozhi (modern-day Liangguang region and Vietnam) and incorporated the area of Hong Kong into his imperial China for the first time. Hong Kong proper was assigned to the Nanhai commandery (modern-day Nanhai District), near the commandery's capital city Panyu.[52][53][54]\n\nAfter a brief period of centralisation and collapse of the Qin dynasty, the area of Hong Kong was consolidated under the Kingdom of Nanyue, founded by general Zhao Tuo in 204 BC.[55] When Nanyue lost the Han-Nanyue War in 111 BC, Hong Kong came under the Jiaozhi commandery of the Han dynasty. Archaeological evidence indicates an increase of population and flourish of salt production. The Lei Cheng Uk Han Tomb on the Kowloon Peninsula is believed to have been built as a burial site during the Han dynasty.[56]\n\nFrom the Han dynasty to the early Tang dynasty, Hong Kong was a part of Bao'an County. In the Tang dynasty, modern-day Guangzhou (Canton) flourished as an international trading centre. In 736, the Emperor Xuanzong of Tang established a military stronghold in Tuen Mun to strengthen defence of the coastal area.[57] The nearby Lantau Island was a salt production centre and salt smuggler riots occasionally broke out against the government. In c. 1075, The first village school, Li Ying College, was established around 1075 AD in modern-day New Territories by the Northern Song dynasty.[58] During their war against the Mongols, the imperial court of Southern Song was briefly stationed at modern-day Kowloon City (the Sung Wong Toi site) before their ultimate defeat by the Mongols at the Battle of Yamen in 1279.[59] The Mongols then established their dynastic court and governed Hong Kong for 97 years.\n\nFrom the mid-Tang dynasty to the early Ming dynasty (1368–1644), Hong Kong was a part of Dongguan County. During the Ming dynasty, the area was transferred to Xin'an County. The indigenous inhabitants at that time consisted of several ethnicities such as Punti, Hakka, Tanka and Hoklo.\n\nEuropean discovery\nThe earliest European visitor on record was Jorge Álvares, a Portuguese explorer, who arrived in 1513.[60][61] Having established a trading post in a site they called \"Tamão\" in Hong Kong waters, Portuguese merchants commenced with regular trading in southern China. Subsequent military clashes between China and Portugal, however, led to the expulsion of all Portuguese merchants from southern China.\n\nSince the 14th century, the Ming court had enforced the maritime prohibition laws that strictly forbade all private maritime activities in order to prevent contact with foreigners by sea.[62] When the Manchu Qing dynasty took over China, Hong Kong was directly affected by the Great Clearance decree of the Kangxi Emperor, who ordered the evacuation of coastal areas of Guangdong from 1661 to 1669. Over 16,000 inhabitants of Xin'an County including those in Hong Kong were forced to migrate inland; only 1,648 of those who had evacuated subsequently returned.[63][64]\n\nBritish Crown Colony: 1842–1941\n\nA painter at work. John Thomson. Hong Kong, 1871. The Wellcome Collection, London\nMain articles: British Hong Kong and History of Hong Kong (1800s–1930s)\nIn 1839, threats by the imperial court of Qing to sanction opium imports caused diplomatic friction with the British Empire. Tensions escalated into the First Opium War. The Qing admitted defeat when British forces captured Hong Kong Island on 20 January 1841. The island was initially ceded under the Convention of Chuenpi as part of a ceasefire agreement between Captain Charles Elliot and Governor Qishan. A dispute between high-ranking officials of both countries, however, led to the failure of the treaty's ratification. On 29 August 1842, Hong Kong Island was formally ceded in perpetuity to the United Kingdom of Great Britain and Ireland under the Treaty of Nanking.[65] The British officially established a Crown colony and founded the City of Victoria in the following year.[66]\n\nThe population of Hong Kong Island was 7,450 when the Union Flag raised over Possession Point on 26 January 1841. It mostly consisted of Tanka fishermen and Hakka charcoal burners, whose settlements scattered along several coastal hamlets. In the 1850s, a large number of Chinese immigrants crossed the then-free border to escape from the Taiping Rebellion. Other natural disasters, such as flooding, typhoons and famine in mainland China would play a role in establishing Hong Kong as a place for safe shelter.[67][68]\n\nFurther conflicts over the opium trade between Britain and Qing quickly escalated into the Second Opium War. Following the Anglo-French victory, the Crown Colony was expanded to include Kowloon Peninsula (south of Boundary Street) and Stonecutter's Island, both of which were ceded to the British in perpetuity under the Convention of Beijing in 1860.\n\nIn 1898, Britain obtained a 99-year lease from Qing under the Convention for the Extension of Hong Kong Territory, in which Hong Kong obtained a 99-year lease of Lantau Island, the area north of Boundary Street in Kowloon up to Shenzhen River and over 200 other outlying islands.[69][70][71]\n\nHong Kong soon became a major entrepôt thanks to its free port status, attracting new immigrants to settle from both China and Europe. The society, however, remained racially segregated and polarised under early British colonial policies. Despite the rise of a British-educated Chinese upper-class by the late-19th century, race laws such as the Peak Reservation Ordinance prevented ethnic Chinese in Hong Kong from acquiring houses in reserved areas such as Victoria Peak. At this time, the majority of the Chinese population in Hong Kong had no political representation in the British colonial government. The British governors did rely, however, on a small number of Chinese elites, including Sir Kai Ho and Robert Hotung, who served as ambassadors and mediators between the government and local population.\n\nFile:1937 Hong Kong VP8.webm\nHong Kong filmed in 1937\nIn 1904, the United Kingdom established the world's first border and immigration control; all residents of Hong Kong were given citizenship as Citizens of United Kingdom and Colonies (CUKC).\n\nHong Kong continued to experience modest growth during the first half of the 20th century. The University of Hong Kong was established in 1911 as the territory's first higher education institute. While there had been an exodus of 60,000 residents for fear of a German attack on the British colony during the First World War, Hong Kong remained unscathed. Its population increased from 530,000 in 1916 to 725,000 in 1925 and reached 1.6 million by 1941.[72]\n\nIn 1925, Cecil Clementi became the 17th Governor of Hong Kong. Fluent in Cantonese and without a need for translator, Clementi introduced the first ethnic Chinese, Shouson Chow, into the Executive Council as an unofficial member. Under Clementi's tenure, Kai Tak Airport entered operation as RAF Kai Tak and several aviation clubs. In 1937, the Second Sino-Japanese War broke out when the Japanese Empire expanded its territories from northeastern China into the mainland proper. To safeguard Hong Kong as a freeport, Governor Geoffry Northcote declared the Crown Colony as a neutral zone.\n\nJapanese occupation: 1941–45\nMain article: Japanese occupation of Hong Kong\n\nThe Cenotaph in Hong Kong commemorates those who died in service in the First World War and the Second World War.[73]\nAs part of its military campaign in Southeast Asia during Second World War, the Japanese army moved south from Guangzhou of mainland China and attacked Hong Kong in on 8 December 1941.[74] Crossing the border at Shenzhen River on 8 December, the Battle of Hong Kong lasted for 18 days when British and Canadian forces held onto Hong Kong Island. Unable to defend against intensifying Japanese air and land bombardments, they eventually surrendered control of Hong Kong on 25 December 1941. The Governor of Hong Kong was captured and taken as a prisoner of war. This day is regarded by the locals as \"Black Christmas\".[75]\n\nDuring the Japanese occupation of Hong Kong, the Japanese army committed atrocities against civilians and POWs, such as the St. Stephen's College massacre. Local residents also suffered widespread food shortages, limited rationing and hyper-inflation arising from the forced exchange of currency from Hong Kong dollars to Japanese military banknotes. The initial ratio of 2:1 was gradually devalued to 4:1 and ownership of Hong Kong dollars was declared illegal and punishable by harsh torture. Due to starvation and forced deportation for slave labour to mainland China, the population of Hong Kong had dwindled from 1.6 million in 1941 to 600,000 in 1945, when the United Kingdom resumed control of the colony on 2 September 1945.[76]\n\nResumption of British rule and industrialisation: 1945–97\nMain articles: British Hong Kong, 1950s in Hong Kong, 1960s in Hong Kong, 1970s in Hong Kong, 1980s in Hong Kong, and 1990s in Hong Kong\n\nFlag of British Hong Kong from 1959 to 1997\nHong Kong's population recovered quickly after the war, as a wave of skilled migrants from the Republic of China moved in to seek refuge from the Chinese Civil War. When the Communist Party eventually took full control of mainland China in 1949, even more skilled migrants fled across the open border for fear of persecution.[69] Many newcomers, especially those who had been based in the major port cities of Shanghai and Guangzhou, established corporations and small- to medium-sized businesses and shifted their base operations to British Hong Kong.[69] The establishment of a socialist state in China (People's Republic of China) on 1 October 1949 caused the British colonial government to reconsider Hong Kong's open border to mainland China. In 1951, a boundary zone was demarked as a buffer zone against potential military attacks from communist China. Border posts along the north of Hong Kong began operation in 1953 to regulate the movement of people and goods into and out of the territory.\n\n\nStamp with portrait of Queen Elizabeth II, 1953\nIn the 1950s, Hong Kong became the first of the Four Asian Tiger economies under rapid industrialisation driven by textile exports, manufacturing industries and re-exports of goods to China. As the population grew, with labour costs remaining low, living standards began to rise steadily.[77] The construction of the Shek Kip Mei Estate in 1953 marked the beginning of the public housing estate programme to provide shelter for the less privileged and to cope with the influx of immigrants.\n\nUnder Sir Murray MacLehose, 25th Governor of Hong Kong (1971–82), a series of reforms improved the public services, environment, housing, welfare, education and infrastructure of Hong Kong. MacLehose was British Hong Kong's longest-serving governor and, by the end of his tenure, had become one of the most popular and well-known figures in the Crown Colony. MacLehose laid the foundation for Hong Kong to establish itself as a key global city in the 1980s and early 1990s.\n\nA sky view of Hong Kong Island\nAn aerial view of the northern shore of Hong Kong Island in 1986\nTo resolve traffic congestion and to provide a more reliable means of crossing the Victoria Harbour, a rapid transit railway system (metro), the MTR, was planned from the 1970s onwards. The Island Line (Hong Kong Island), Kwun Tong Line (Kowloon Peninsula and East Kowloon) and Tsuen Wan Line (Kowloon and urban New Territories) opened in the early 1980s.[78]\n\nIn 1983, the Hong Kong dollar left its 16:1 peg with the Pound sterling and switched to the current US-HK Dollar peg. Hong Kong's competitiveness in manufacturing gradually declined due to rising labour and property costs, as well as new development in southern China under the Open Door Policy introduced in 1978 which opened up China to foreign business. Nevertheless, towards the early 1990s, Hong Kong had established itself as a global financial centre along with London and New York City, a regional hub for logistics and freight, one of the fastest-growing economies in Asia and the world's exemplar of Laissez-faire market policy.[79]\n\nThe Hong Kong issue\nIn 1971, the Republic of China (Taiwan)'s permanent seat on the United Nations was transferred to the People's Republic of China (PRC), Hong Kong's status as a recognised colony became terminated in 1972 under the request of PRC. Facing the uncertain future of Hong Kong and expiry of land lease of New Territories beyond 1997, Governor MacLehose raised the question in the late 1970s.\n\nThe British Nationality Act 1981 reclassified Hong Kong into a British Dependent Territory amid the reorganisation of global territories of the British Empire. All residents of Hong Kong became British Dependent Territory Citizens (BDTC). Diplomatic negotiations began with China and eventually concluded with the 1984 Sino-British Joint Declaration. Both countries agreed to transfer Hong Kong's sovereignty to China on 1 July 1997, when Hong Kong would remain autonomous as a special administrative region and be able to retain its free-market economy, British common law through the Hong Kong Basic Law, independent representation in international organisations (e.g. WTO and WHO), treaty arrangements and policy-making except foreign diplomacy and military defence.\n\nIt stipulated that Hong Kong would retain its laws and be guaranteed a high degree of autonomy for at least 50 years after the transfer. The Hong Kong Basic Law, based on English law, would serve as the constitutional document after the transfer. It was ratified in 1990.[69] The expiry of the 1898 lease on the New Territories in 1997 created problems for business contracts, property leases and confidence among foreign investors.\n\nHandover and Special Administrative Region status\nMain articles: Transfer of sovereignty over Hong Kong and 2000s in Hong Kong\nTransfer of sovereignty\n\nGolden Bauhinia Square\nOn 1 July 1997, the transfer of sovereignty over Hong Kong from the United Kingdom to the People's Republic of China took place, officially marking the end of Hong Kong's 156 years under British colonial governance. As the largest remaining colony of the United Kingdom, the loss of Hong Kong effectively represented the end of the British Empire. This transfer of sovereignty made Hong Kong the first special administrative region of China. Tung Chee-Hwa, a pro-Beijing business tycoon, was elected Hong Kong's first Chief Executive by a selected electorate of 800 in a televised programme.\n\nTung Chee-Hwa: 1997–2003\nSoon after Hong Kong's transfer to China, the territory has suffered coincidentally an economic double-blow: Asian Financial Crisis and the H5N1 avian flu pandemic. The then-Financial Secretary, Sir Donald Tsang, adopted a radical measure to make use of British Hong Kong foreign currency reserves and restored Hong Kong's financial stability. In December 1997, officials had to destroy 1.4 million livestock in order to contain the H5 virus from spreading.[69]\n\nDespite a recovering economy from the Asian Financial Crisis, mismanagement of Tung's housing policy triggered a housing market crisis in 1998, disrupting market supply and sent properties prices tumbling until 2002. This caused many homeowners to become bankrupt due to negative equity.\n\nIn 1998, Hong Kong moved its international airport from Kai Tak to an artificially-reclaimed island north of Lantau Island. Construction of this new airport began under the British Rose Garden Project and was completed in May 1998.\n\nChris Patten's democratic reform of the Legislative Council Election in 1994 was abruptly terminated when Hong Kong transferred to China in 1997. In 1995, China set up a parallel \"Provisional Council\" of pro-Beijing members in Shenzhen. This Provisional Legislative Council, lacking legislative or constitutional power, moved into Hong Kong and completed its term in 1999. The Legislative Council resumed its full function after the 1999 election under pre-reformed rules; one of the prominent tasks was to complete legislation of articles in the Hong Kong Basic Law, constitutional document of the territory.\n\nDespite the unopposed re-election of Tung in July 2002, distrust of China remained throughout Tung's first term as Chief Executive. In 2003, Hong Kong was gravely affected by the outbreak of severe acute respiratory syndrome (SARS).[80][81] The World Health Organization reported 1,755 infected and 299 deaths in Hong Kong.[82] Economic activities slowed down and schools were closed for weeks at the height of SARS epidemic. An estimated 380 million Hong Kong dollars (US$48.9 million) in contracts were lost as a result of the epidemic.[83]\n\nIn May 2003, the government's attempt to legislate Article 23 (National Security) of the Basic Law aroused strong suspicion among Hong Kong citizens. This Article would grant Hong Kong's police force right of access to private property on grounds of 'safeguarding national security', but without court warrants. Coupled with years of economic hardships and discontent of Tung's pro-Beijing stance, a mass demonstration broke out on 1 July 2003. This demonstration hastened the resignations of two government ministers and, eventually, that of Tung on 10 March 2005.[84]\n\nSir Donald Tsang: 2005–2012\nSir Donald Tsang, then-Chief Secretary for Administration and ex-official of the British Hong Kong government, entered the 2005 election uncontested and was appointed by Beijing as the second Chief Executive of Hong Kong on 21 June 2005. In 2006, Tsang introduced food safety procedures to Hong Kong in light of loose vetting standards, contamination and counterfeit food issues of mainland China.\n\nTsang went on to win a second term in office following the 2007 Chief Executive election under managed voting.[85] As a result of the 2008 Global Financial Crisis, Tsang's government rolled out a package of financial stimulus of HK$11 billion and a depositor guarantee scheme to safeguard Hong Kong dollar savings in bank accounts. Hong Kong narrowly avoided a technical recession from the ongoing crisis.\n\nIn 2009, Hong Kong hosted the 5th East Asian Games and nine national teams competed in it. The Games were the first and largest international multi-sport event ever organised and hosted by the city.[86] Major infrastructure and tourist projects also began under Sir Tsang's second term, including the Ngong Ping Cable Car, Tian Tan Buddha and the West Kowloon Cultural District. The most controversial, however, was the high-speed railway link connecting Hong Kong and neighbouring cities of mainland China; as of 2016, the project has suffered numerous delays, surging labour and material costs and dispute over immigration procedures.\n\n\n\"Hong Kong\" branded as \"Asia's World City\".\n\nOverlook Hong Kong Island north coast, Victoria Harbour and Central & East Kowloon from middle section of Lugard Road at daytime.\nDuring Tsang's second term, he initiated modest reforms in areas of education, environment and food safety. He concluded his term, however, when a local news media uncovered evidence of him receiving favours and hospitality from business tycoons on various occasions. This resulted in further discovery of bribery in Tsang's government; then-Chief Secretary of Administration, Rafael Hui, was convicted of corruption in 2014.\n\nLeung Chun-ying: 2012–2017\nMain article: Hong Kong–Mainland conflict\n3 candidates stood for the 2012 Chief Executive Election, including one from the Democratic Party. A selected electorate of 1,200 pro-Beijing members constituted the election committee; Leung Chun-ying won 689 votes and was appointed Chief Executive on 1 July by China.\n\nDuring Leung's term, the government completed legislation of Anti-trust and Competition Ordinance and introduced minimum wage in 2015. Political debates, however, have centred themselves predominately on universal suffrage and education reform. The government's proposed National Education curriculum in 2014 attracted polarising reactions across Hong Kong's public and a draft bill was eventually withdrawn. Reactions from China, including the 2014 White Paper on Hong Kong,[87] attracted worldwide allegations of Beijing's intervention into Hong Kong's high-degree autonomy.[88] The most contentious issue was China's outright disregard of its commitment to the 1984 Sino-British Joint Declaration in written text. This has fuelled up a number of mass protests and the most prominent one was the Occupy Central (later termed \"Umbrella\") movement in September to December 2014.[89]\n\nHong Kong's high-degree autonomy, along with neutrality of press and media, judicial independence and freedom of speech and publication, have at times been scrutinised. With continued distrust of Chinese government, notable events such as violent attack on journalists, increasing level of press self-censorship, alleged extraterritorial abduction of anti-China publishers[90] and covert intervention into Hong Kong's educational, political and independent institutions have posed challenges to the \"One Country, Two Systems\" arrangement. In the 2016 Legislative Council Election, there were reports of discrepancies in the electorate registry, which contains ghost registrations across constituencies, as well as political intervention to strip pro-Independence individuals of their right to stand in elections[91] and alleged death threats to election candidates.[92]\n\nSocial tension has heightened during Leung's term, with many Hongkongers believing that China increased their efforts to exert influence on everyday life in Hong Kong. The territory currently delegates control of Chinese immigrants, as well as issue of visitor permits, to Chinese authorities. On the first day of Chinese New Year 2016, riots targeting the police force broke out.[93] The most recent survey in 2016 (with a sample base of 573) in Hong Kong shows that 17.8% respondents considered themselves as \"Chinese citizens\", whereas 41.9% considered themselves purely as \"citizens of Hong Kong\".[94]\n\nGovernance\nMain articles: Politics of Hong Kong, Hong Kong Government, and Elections in Hong Kong\n香港候任特首林鄭月娥13.jpg\t政務司司長張建宗15.jpg\nCarrie Lam\nChief Executive\tMatthew Cheung\nChief Secretary\nStructure of government\nHong Kong's current structure of governance inherits from the British model of colonial administration set up in the 1850s. The 1984 Sino-British Joint Declaration states that \"Hong Kong should enjoy a high degree of autonomy in all areas except defence and foreign affairs\" with reference to the underlying principle of one country, two systems.[note 3] This Declaration stipulates that Hong Kong maintains her capitalist economic system and guarantees the rights and freedoms of her people for at least 50 years after the 1997 handover. [note 4] Such guarantees are enshrined in the Hong Kong's Basic Law, the territory's constitutional document, which outlines the system of governance after 1997, albeit subject to interpretation by China's Standing Committee of the National People's Congress (NPCSC).[95][96]\n\nHong Kong's most senior leader, Chief Executive, is elected by a committee of 1,200 selected members (600 in 1997) and nominally appointed by the Government of China. The primary pillars of government are the Executive Council, Legislative Council, civil service and Judiciary.\n\nPolicy-making is initially discussed in the Executive Council, presided by the Chief Executive of Hong Kong, before passing to the Legislative Council for bill adoption. The Executive Council consists of 30 official/unofficial members appointed by the Chief Executive and one member among them acts as the convenor.[97][98]\n\nThe Legislative Council, set up in 1843, debates policies and motions before voting to adopt or rejecting bills. It has 70 members (originally 60) and 40 (originally 30) among them are directly elected by universal suffrage; the other 30 members are \"functional constituencies\" (indirectly) elected by a smaller electorate of corporate bodies or representatives of stipulated economic sectors as defined by the government. The Legislative Council is chaired by a president who acts as the speaker.[99][100]\n\nIn 1997, seating of the Legislative Council (also public services and election franchises) of Hong Kong modelled on the British system: Urban Council (Hong Kong and Kowloon) and District Council (New Territories and Outlying Islands). In 1999, this system has been reformed into 18 directly elected District Offices across 5 Legislative Council constituencies: Hong Kong Island (East/West), Kowloon and New Territories (East/West); the remaining outlying islands are divided across the aforementioned regions.\n\nHong Kong's Civil Service, created by the British colonial government, is a politically neutral body that implements government policies and provides public services. Senior civil servants are appointed based on meritocracy. The territory's police, firefighting and customs forces, as well as clerical officers across various government departments, make up the civil service.[101][102]\n\nElectoral and political reforms\nThe grey dome and front gable of a granite neo-classical building, with a skyscraper in the background against a clear blue sky.\nOpened in 1912, this granite neo-classical building in Central used to house the Supreme Court. It became the home to Legislative Council of Hong Kong (dubbed \"Legco\") from 1985 to 2011, spanning across the British and the Chinese rule. However, as the Legco has moved to a new complex in 2011, the building will revert to a judicial function, housing the Court of Final Appeal from 2015 onwards.\nHong Kong's Basic Law, implemented in the territory on 1 July 1997, consists of outstanding articles which require bill adoption by the Legislative Council before becoming effective laws. Two of the most prominent articles include Article 23 (\"National Security\") and universal suffrage of Chief Executive elections. In 2002, the government's motion of an anti-subversion bill pursuant to Article 23, was met with fierce opposition and eventually dropped.[103][104] Reform bills on universal suffrage, however, have made partial progress in expanding the Chief Executive election's committee (from 600 to 800 in 2007 and to 1,200 selected members in 2012) and the Legislative Council (from 60 to 70 seats). These additional 10 seats are created through directly elected members of District Offices.[105]\n\nContinual debate between pro-Beijing and pan-democratic factions characterises Hong Kong's contemporary political landscape across the transition from the British Empire to China. Aside from clashes over a range of social, welfare, labour and economic policies, the most contentious topic has been universal suffrage. Ideological differences over the pace of democratisation have shadowed over the 2004 Bill of Political Reform \"District Council Model (District Office)\", 2009 Bill of Political Reform (passed 46–12) \"Consultation Document on the Methods for Selecting the Chief Executive and for Forming the LegCo in 2012\" [106][107] and the 2015 Bill of Political Reform (blocked 8–27).[108]\n\nLegal system and judiciary\nMain articles: Law of Hong Kong and Judiciary of Hong Kong\nblindfolded lady with sword in right hand held vertically down to floor, and a set of balance scales in her left hand held neck high\nThemis or Lady Justice, armed with sword and balance scales (Court of Final Appeal Building, Central, Hong Kong). She is the personification of justice balancing the scales of truth and fairness.\nHong Kong's current legal system, independent of the legal system of mainland China and Chinese civil law, inherits from British Common Law established before 1997. The guiding principle is an independent judicial system in which the Rule of Law, as opposed to Rule by Law, safeguards judicial courts from government intervention.[109]\n\nThe essence of British Common Law is the juror system: court judges (equivalent to British JPs) make case verdicts with the assistance of a group of eligible, court-appointed jurors who are members of the public. One feature of the Common Law system is the basis of legal precedent (stare decisis) in which judges refer to empirical evidence from previous cases of a similar category prior to handing out a final verdict. According to Article 92 of Hong Kong's Basic Law, judicial courts may refer to decisions which are rendered by courts of other common law jurisdictions as precedents[16][110] (England, Canada and Australia). Judges from these jurisdictions are permitted to sit as non-permanent judges of the Court of Final Appeal.[16][110]\n\nHong Kong's court system comprises the Court of Final Appeal (formerly HM Court of Final Appeal in the United Kingdom), the High Court (constitutes the Court of Appeal and the Court of First Instance) and the District Court (includes the Family Court).[111] Other adjudicative bodies include the Lands Tribunal, the Magistrates' Courts, the Juvenile Court, the Coroner's Court, the Labour Tribunal, the Small Claims Tribunal and the Obscene Articles Tribunal.[111] Judges are appointed by the Chief Executive on the recommendation of an independent commission.[16][112] The Court of Final Appeal has the power of final adjudication with respect to Hong Kong's Basic Law, as well as the power of final interpretation over local laws such as the power to strike down local ordinances on the grounds of inconsistency with the Basic Law.[113][114]\n\nThe Department of Justice is responsible for handling legal matters for the government. Its responsibilities include providing legal advice, criminal prosecution, civil representation, legal and policy drafting and reform and international legal co-operation between different jurisdictions.[109] Apart from prosecuting criminal cases, lawyers of the Department of Justice act on behalf of the government in all civil and administrative lawsuits against the government.[109] As protector of public interest, the department may apply for judicial reviews and may intervene in any cases involving the greater public interest.[115] The Basic Law protects the Department of Justice from any interference by the government when exercising its control over criminal prosecution.[116][117]\n\nForeign relations\nMain article: Foreign relations of Hong Kong\n\nOlympic Square, Hong Kong\nHong Kong's Basic Law (Article 151) delegates all diplomatic affairs to China's Foreign Ministry, but the territory retains exclusive rights in fostering external relations in international organisations, co-operation bodies and sports and cultural events. Under the alias \"Hong Kong, China\", Hong Kong maintains active partnerships with foreign nations in the World Trade Organization (WTO), the Asia-Pacific Economic Cooperation (APEC), the International Olympic Committee (IOC), the International Federation of Association Football (FIFA), and the International Basketball Federation (FIBA). Overseas Representatives of Hong Kong cover the fields of economy, trade, monetary finance, shipping, communications, tourism, culture and sports.[118]\n\nUnder the special condition of Hong Kong's high-degree autonomy, the territory is able to maintain an independent customs area and separate immigration policy from those of China. This separate exercise of customs and immigration, subject to conditional reviews, is recognised by foreign nations through their legislature, such as the United States-Hong Kong Policy Act. Hong Kong maintains an international border with mainland China across 5 border control stations by land, 3 entry and exit points by sea and the International Airport. Applications for entry permits are, however, handled by Chinese Embassies for Hong Kong.\n\nForeign representation in Hong Kong includes 59 Consulates-General, 62 Consulates/Embassies and 5 officially recognised international bodies, such as the Office of the European Union. A number of Consulate-Generals in Hong Kong, such as the United States and United Kingdom, operate independently of their embassies in Beijing, extend their areas of jurisdiction beyond Hong Kong to include Macau, and report directly to their respective foreign offices.[119][120][121]\n\nHuman rights\nMain article: Human rights in Hong Kong\nThe Hong Kong government generally respects the human rights of its citizens, and members of the Legislative Council of Hong Kong and the District Council of Hong Kong are elected into office by Hong Kong citizens. However, there are 27 ex officio members of the district council (the Rural Committee Chairmen in the New Territories) as of the fifth District Council Assembly, and roughly half of the legislative council seats are elected by 3% of the people in Hong Kong through the functional constituency. The imbalance of voting power in the LegCo has led to widespread criticism of its inability to represent Hongkongers' socio-economic needs.[122] In addition, the Chief Executive of Hong Kong is elected by 1,200 members based on their contributions to four different sectors of Hong Kong's society. This policy has received criticism from various political figures in Hong Kong, and led to the Umbrella Revolution. Plans to expand the voting population had begun to appear in the 2000s, and political figures liaised with the government to provide universal suffrage.\n\nThere are restrictions on freedom of the press and freedom of assembly.[123][124] 200,000 migrant workers cannot make complaints against their employers since they face deportation if dismissed from their jobs. A 2008 law against racial discrimination does not cover mainlanders, immigrants or migrant workers.[125] The police have been accused of using heavy-handed tactics toward protesters in public rallies,[126] and there is controversy regarding the extensive powers of the police.[127] Covert surveillance is another major concern.[128]\n\nHong Kong has a higher age-of-consent and harsher punishments for illegal homosexual acts.[129]\n\nInternet censorship in Hong Kong operates under different principles and regulations from those of mainland China.[130] In November 2015, the newly established Innovation and Technology Bureau pushed for the legislation of the Copyright (Amendment) Bill 2014, more popularly known as the Internet Article 23, which would severely limit the legality of derivative works[131] and other activities previously permitted on the Internet.[132] Supporters of the bill point to the fact that Hong Kong is lagging behind in the protection of intellectual property rights, but detractors state that creative work on the Internet should be exempt from legislation, and the ordinance would severely violate human rights.\n\nRegions and districts\nMain articles: List of cities and towns in Hong Kong and Districts of Hong Kong\nHong Kong comprises three geographical regions, which coincided with its historical expansion by the British colonial government: Hong Kong Island, Kowloon (1860) and the New Territories and Outlying Islands (1898). The first established settlement was City of Victoria on Hong Kong Island. Its area coincided with modern-day Central and Western District (#15 in map).\n\nSince the abolition of decentralised Urban and District Councils in 1999, Hong Kong is now a unitary territory subdivided into 18 districts. Each district is represented by a district council, who advises the government on various local agendas such as public facilities, community programmes, cultural activities and environmental policies.[133] There are a total of 541 district council seats, 412 of which are directly elected and another 27 are ex-officio chairmen of rural committees (families of landowners in the New Territories before 1898); the remaining seats are appointed by the Chief Executive.[133] The Home Affairs Department communicates government policies and plans to the public through the district offices.[134]\n\n\nHong Kong Island\n\nKowloon\n\nNew Territories\n\n18 Administrative Districts: 1. Islands, 2. Kwai Tsing, 3. North, 4. Sai Kung, 5. Sha Tin, 6. Tai Po, 7. Tsuen Wan, 8. Tuen Mun, 9. Yuen Long, 10. Kowloon City, 11. Kwun Tong, 12. Sham Shui Po, 13. Wong Tai Sin, 14. Yau Tsim Mong, 15. Central & Western, 16. Eastern, 17. Southern, 18. Wan Chai\nMilitary\nMain article: People's Liberation Army Hong Kong Garrison\n\nPLA Hong Kong Garrison arm badge\nSince July 1997, the responsibility of maintaining the military forces in Hong Kong has been transferred from the British Armed Forces to China's PLA Hong Kong Garrison under the Liberation Army. The garrison, consisting of units from ground, naval and air forces, reports its command to the Central Military Commission.\n\nThe Basic Law of Hong Kong protects all civilians and civil affairs against any interference by the garrison. All military personnel, while stationed in Hong Kong, must remain within barrack grounds. When such personnel leave their barracks, they are subject to Hong Kong laws. The territory's police, who are civil servants, are responsible for maintaining public order; under exceptional circumstances, however, the police force may ask China for assistance from the garrison in disaster relief.[103][135]\n\nIn January 2015, the People's Liberation Army sponsored the establishment of Hong Kong Army Cadets Association for children over 6 years old. The inauguration ceremony was held at a garrison's naval base in Hong Kong; but most media were excluded from this event except pro-Beijing press.[136]\n\nGeography and climate\nMain articles: Geography of Hong Kong, Ecology of Hong Kong, and Climate of Hong Kong\nTopographical satellite image with enhanced colours showing areas of vegetation and conurbation. Purple areas around the coasts indicate the areas of urban development\nAreas of urban development and vegetation are visible in this false-colour satellite image.\nHong Kong is located on China's south coast, 60 km (37 mi) east of Macau on the opposite side of the Pearl River Delta. It is surrounded by the South China Sea on the east, south, and west, and borders the Guangdong city of Shenzhen to the north over the Sham Chun River. The territory's 2,755 km2 (1,064 sq mi) area consists of Hong Kong Island, the Kowloon Peninsula, the New Territories, and over 200 offshore islands, of which the largest is Lantau Island. Of the total area, 1,106 km2 (427 sq mi) is land and 1,649 km2 (637 sq mi) is water. Hong Kong claims territorial waters to a distance of 3 nautical miles (5.6 km). Its land area makes Hong Kong the 167th largest inhabited territory in the world.[137] Less than 25% of Hong Kong's land area is built-up, while the majority is grassland, woodland, shrubland, and agricultural land.[138]\n\n\nHigher-altitude areas of Hong Kong are often dominated by grassland: Lantau Island during the dry season.\nAs much of Hong Kong's terrain is hilly to mountainous with steep slopes, less than 25% of the territory's landmass is developed, and about 40% of the remaining land area is reserved as country parks and nature reserves.[139] Low altitude vegetation in Hong Kong is dominated by secondary rainforests, as the primary forest was mostly cleared during the Second World War, and higher altitudes are dominated by grasslands. Most of the territory's urban development exists on Kowloon peninsula, along the northern edge of Hong Kong Island, and in scattered settlements throughout the New Territories.[140] The highest elevation in the territory is at Tai Mo Shan, 957 metres (3,140 ft) above sea level.[141] Hong Kong's long and irregular coast provides it with many bays, rivers and beaches.[142] On 18 September 2011, UNESCO listed the Hong Kong National Geopark as part of its Global Geoparks Network. Hong Kong Geopark is made up of eight Geo-Areas distributed across the Sai Kung Volcanic Rock Region and Northeast New Territories Sedimentary Rock Region.[143]\n\nDespite Hong Kong's reputation of being intensely urbanised, the territory has tried to promote a green environment,[144] and recent growing public concern has prompted the severe restriction of further land reclamation from Victoria Harbour.[145] Awareness of the environment is growing as Hong Kong suffers from increasing pollution compounded by its geography and tall buildings. Approximately 80% of the city's smog originates from other parts of the Pearl River Delta.[146]\n\nThough it is situated 128 km (80 miles) south of the Tropic of Cancer[147], Hong Kong has a humid subtropical climate (Köppen Cwa). Summer is hot and humid with occasional showers and thunderstorms, and warm air coming from the southwest. Typhoons most often occur in summer. They sometimes result in flooding or landslides. Winters are mild and usually start sunny, becoming cloudier towards February; the occasional cold front brings strong, cooling winds from the north. The most temperate seasons are spring, which can be changeable, and autumn, which is generally sunny and dry.[148] Snowfall is extremely rare, and usually occurs in areas of high elevation. Hong Kong averages 1,948 hours of sunshine per year,[149] while the highest and lowest ever recorded temperatures at the Hong Kong Observatory are 36.6 °C (97.9 °F) on 22 August 2017 and 0.0 °C (32.0 °F) on 18 January 1893, respectively.[150][151][not in citation given] The highest and lowest ever recorded temperatures across all of Hong Kong, on the other hand, are 42.1 °C (108 °F) at Waglan Island in June 1991[152] and −6.0 °C (21.2 °F) at Tai Mo Shan on 24 January 2016, respectively.\n\n[hide]Climate data for Hong Kong (Hong Kong Observatory), normals 1981–2010, extremes 1884–1939 and 1947–present\nMonth\tJan\tFeb\tMar\tApr\tMay\tJun\tJul\tAug\tSep\tOct\tNov\tDec\tYear\nRecord high °C (°F)\t26.9\n(80.4)\t28.3\n(82.9)\t30.1\n(86.2)\t33.4\n(92.1)\t35.5\n(95.9)\t35.6\n(96.1)\t35.7\n(96.3)\t36.6\n(97.9)\t35.2\n(95.4)\t34.3\n(93.7)\t31.8\n(89.2)\t28.7\n(83.7)\t36.6\n(97.9)\nMean maximum °C (°F)\t23.7\n(74.7)\t24.5\n(76.1)\t27.1\n(80.8)\t29.8\n(85.6)\t31.8\n(89.2)\t33.1\n(91.6)\t33.8\n(92.8)\t33.8\n(92.8)\t33.8\n(92.8)\t30.8\n(87.4)\t28.0\n(82.4)\t25.1\n(77.2)\t34.3\n(93.7)\nAverage high °C (°F)\t18.6\n(65.5)\t18.9\n(66)\t21.4\n(70.5)\t25.0\n(77)\t28.4\n(83.1)\t30.2\n(86.4)\t31.4\n(88.5)\t31.1\n(88)\t30.1\n(86.2)\t27.8\n(82)\t24.1\n(75.4)\t20.2\n(68.4)\t25.6\n(78.08)\nDaily mean °C (°F)\t16.3\n(61.3)\t16.8\n(62.2)\t19.1\n(66.4)\t22.6\n(72.7)\t25.9\n(78.6)\t27.9\n(82.2)\t28.8\n(83.8)\t28.6\n(83.5)\t27.7\n(81.9)\t25.5\n(77.9)\t21.8\n(71.2)\t17.9\n(64.2)\t23.24\n(73.83)\nAverage low °C (°F)\t14.5\n(58.1)\t15.0\n(59)\t17.2\n(63)\t20.8\n(69.4)\t24.1\n(75.4)\t26.2\n(79.2)\t26.8\n(80.2)\t26.6\n(79.9)\t25.8\n(78.4)\t23.7\n(74.7)\t19.8\n(67.6)\t15.9\n(60.6)\t21.37\n(70.46)\nMean minimum °C (°F)\t9.1\n(48.4)\t9.9\n(49.8)\t11.5\n(52.7)\t15.9\n(60.6)\t20.5\n(68.9)\t23.2\n(73.8)\t23.9\n(75)\t24.2\n(75.6)\t23.2\n(73.8)\t19.6\n(67.3)\t14.4\n(57.9)\t10.0\n(50)\t7.7\n(45.9)\nRecord low °C (°F)\t0.0\n(32)\t2.4\n(36.3)\t4.8\n(40.6)\t9.9\n(49.8)\t15.4\n(59.7)\t19.2\n(66.6)\t21.7\n(71.1)\t21.6\n(70.9)\t18.4\n(65.1)\t13.5\n(56.3)\t6.5\n(43.7)\t4.3\n(39.7)\t0\n(32)\nAverage rainfall mm (inches)\t24.7\n(0.972)\t54.4\n(2.142)\t82.2\n(3.236)\t174.7\n(6.878)\t304.7\n(11.996)\t456.1\n(17.957)\t376.5\n(14.823)\t432.2\n(17.016)\t327.6\n(12.898)\t100.9\n(3.972)\t37.6\n(1.48)\t26.8\n(1.055)\t2,398.4\n(94.425)\nAverage rainy days (≥ 0.1 mm)\t5.37\t9.07\t10.90\t12.00\t14.67\t19.07\t17.60\t16.93\t14.67\t7.43\t5.47\t4.47\t137.65\nAverage relative humidity (%)\t74\t80\t82\t83\t83\t82\t81\t81\t78\t73\t71\t69\t78.0\nMean monthly sunshine hours\t143.0\t94.2\t90.8\t101.7\t140.4\t146.1\t212.0\t188.9\t172.3\t193.9\t180.1\t172.2\t1,835.6\nPercent possible sunshine\t42\t29\t24\t27\t34\t36\t51\t47\t47\t54\t54\t51\t42\nSource: Hong Kong Observatory[153][150][151][154]\nClimate data for Hong Kong\nMonth\tJan\tFeb\tMar\tApr\tMay\tJun\tJul\tAug\tSep\tOct\tNov\tDec\tYear\nAverage sea temperature °C (°F)\t19.1\n(66.4)\t18.9\n(66.0)\t20.1\n(68.2)\t22.7\n(72.9)\t26.8\n(80.2)\t28.5\n(83.3)\t29.1\n(84.4)\t28.6\n(83.5)\t28.3\n(82.9)\t26.5\n(79.7)\t24.3\n(75.7)\t21.0\n(69.8)\t24.5\n(76.1)\nMean daily daylight hours\t11.0\t11.0\t12.0\t13.0\t13.0\t13.0\t13.0\t13.0\t12.0\t12.0\t11.0\t11.0\t12.1\nAverage Ultraviolet index\t7\t9\t11\t11+\t11+\t11+\t11+\t11+\t11\t9\t7\t7\t9.7\nSource: Weather Atlas [155]\nEconomy\nMain article: Economy of Hong Kong\nA brightly lit tall skyscraper at night\nThe Two International Finance Centre in Central, an integrated commercial development in Central\nFinancial centre\nAs one of the world's leading international financial centres, Hong Kong has a major capitalist service economy characterised by low taxation and free trade. From the second half of the 19th century and continuing into the first half of the 20th century, Hong Kong operated as a key command centre for the allocation of Asian capital in its broadest form. Hong Kong stature as an International Financial centre (IFC), gradually developed from the 1950s to become a key component of the island's economy.[156] It is an important centre for international finance and trade, with one of the greatest concentrations of corporate headquarters in the Asia-Pacific region.[157] The Hong Kong Stock Exchange is the seventh largest in the world and has a market capitalisation of US$3.2 trillion as of December 2016.[158] In 2009, Hong Kong raised 22 percent of worldwide initial public offering (IPO) capital, making it the largest centre of IPOs in the world[159] and the easiest place to raise capital. In the 2017 Global Financial Centres Index, Hong Kong was ranked as having the fourth most competitive financial center in the world (alongside cities such as London, New York City, Tokyo, San Francisco, Chicago, Sydney, Boston, and Toronto in the top 10), and second most competitive in Asia after Singapore.[160]\n\nThe currency, Hong Kong dollar, is the thirteenth most traded currency in the world as of 2016,[25] it has been pegged to the US dollar since 1983.[161] Hong Kong was once described by Milton Friedman as the world's greatest experiment in laissez-faire capitalism, but has since instituted a regime of regulations including a minimum wage.[162] It maintains a highly developed capitalist economy, ranked the freest in the world by the Index of Economic Freedom every year since 1995.[163][164][165] It is known as one of the Four Asian Tigers for its high growth rates and rapid development from the 1960s to the 1990s. Between 1961 and 1997 Hong Kong's gross domestic product grew 180 times while per-capita GDP increased 87 times over.[166][167][168] In 2008, the territory was named as a Nylonkong global metropolis and financial centre.[169]\n\nInternational trading\nHong Kong is the world's eleventh largest trading entity,[170] with the total value of imports and exports exceeding its gross domestic product. It is the world's largest re-export centre.[171] Much of Hong Kong's exports consist of re-exports,[172] which are products made outside of the territory, especially in mainland China, and distributed via Hong Kong. Its physical location has allowed the city to establish a transportation and logistics infrastructure that includes the world's second busiest container port and the world's busiest airport for international cargo. Even before the transfer of sovereignty, Hong Kong had established extensive trade and investment ties with the mainland, which now enable it to serve as a point of entry for investment flowing into the mainland. At the end of 2007, there were 3.46 million people employed full-time, with the unemployment rate averaging 4.1% for the fourth straight year of decline.[173] Hong Kong's economy is dominated by the service sector, which accounts for over 90% of its GDP, while industry constitutes 9%. Inflation was at 2.5% in 2007.[174] Hong Kong's largest export markets are mainland China, the United States, and Japan.[175]\n\nThe territory has little arable land and few natural resources, so it imports most of its food and raw materials. Imports account for more than 90% of Hong Kong's food supply, including nearly all of the meat and rice available there.[176] Agricultural activity—relatively unimportant to Hong Kong's economy and contributing just 0.1% of its GDP—primarily consists of growing premium food and flower varieties.\n\nTourism and expatriation\nIn 2014, Hong Kong was the eleventh most popular destination for international tourists among countries and territories worldwide, with a total of 27.8 million visitors contributing a total of US$38,376 million in international tourism receipts. Hong Kong is also the most popular city for tourists, nearly two times of its nearest competitor Macau.[177]\n\nAs of 2010 Hong Kong is the eighth most expensive city for expatriates, falling from fifth position in the previous year.[178] Hong Kong is ranked fourth in terms of the highest percentage of millionaire households, behind Switzerland, Qatar, and Singapore with 8.5 percent of all households owning at least one million US dollars.[179] Hong Kong is also ranked second in the world by the most billionaires per capita (one per 132,075 people), behind Monaco.[180] In 2011, Hong Kong was ranked second in the Ease of Doing Business Index, behind Singapore.[181] Hong Kong is also ranked No. 1 in the world in the Crony Capitalism Index by The Economist.[182]\n\nPolicy\nThe Hong Kong Government has traditionally played a mostly passive role in the economy, with little by way of industrial policy and almost no import or export controls. Market forces and the private sector were allowed to determine practical development. Under the official policy of \"positive non-interventionism\", Hong Kong is often cited as an example of laissez-faire capitalism. Following the Second World War, Hong Kong industrialised rapidly as a manufacturing centre driven by exports, and then underwent a rapid transition to a service-based economy in the 1980s.[183] Since then, it has grown to become a leading centre for management, financial, IT, business consultation and professional services.\n\nHong Kong financial centre matured in the 1990s, but was greatly affected by the Asian financial crisis in 1998, and again in 2003 by the SARS outbreak. A revival of external and domestic demand has led to a strong recovery, as cost decreases strengthened the competitiveness of Hong Kong exports and a long deflationary period ended.[184][185] Government intervention, initiated by the later colonial governments and continued since 1997, has steadily increased, with the introduction of export credit guarantees, a compulsory pension scheme, a minimum wage, anti-discrimination laws, and a state mortgage backer.[162]\n\nInfrastructure\nMain articles: Transport in Hong Kong and Water supply and sanitation in Hong Kong\nA map of the Mass Transit Railway network.\nThe Mass Transit Railway has more than 150 stations in its network.\n\nCityBus Alexander Dennis Enviro 400 10.5m-A double-decker in Hong Kong heading to Stanley\n\nHong Kong – Kowloon Star Ferry\nHong Kong's transportation network is highly developed. Over 90% of daily travels (11 million) are on public transport,[34] the highest such percentage in the world.[35] Payment can be made using the Octopus card, a stored value system introduced by the MTR (Mass Transit Railway), which is widely accepted on railways, buses and ferries, and accepted like cash at other outlets.[186][187]\n\nThe city's main railway company (KCRC) was merged with MTR in 2007, creating a comprehensive rail network for the whole territory (also called MTR).[188] The MTR rapid transit system has 152 stations which serve 3.4 million people a day.[189] Hong Kong Tramways, which has served the territory since 1904, covers the northern parts of Hong Kong Island.[190]\n\nHong Kong's bus service is franchised and run by private operators. Five privately owned companies provide franchised bus service across the territory, together operating more than 700 routes as of 2014. The largest are Kowloon Motor Bus, providing 402 routes in Kowloon and New Territories, and Citybus, operating 154 routes on Hong Kong Island; both run cross-harbour services. Double-decker buses were introduced to Hong Kong in 1949, and are now almost exclusively used; single-decker buses remain in use for routes with lower demand or roads with lower load capacity. Public light buses serve most parts of Hong Kong, particularly areas where standard bus lines cannot reach or do not reach as frequently, quickly, or directly.[191]\n\nThe Star Ferry service, founded in 1888, operates two lines across Victoria Harbour and provides scenic views of Hong Kong's skyline for its 53,000 daily passengers.[192] It acquired iconic status following its use as a setting on The World of Suzie Wong. Travel writer Ryan Levitt considered the main Tsim Sha Tsui to Central route one of the most picturesque in the world.[193] Other ferry services are provided by operators serving outlying islands, new towns, Macau, and cities in mainland China. Hong Kong is famous for its junks traversing the harbour, and small kai-to ferries that serve remote coastal settlements.[194][195] The Port of Hong Kong is a busy deepwater port, specialising in container shipping.[196]\n\nHong Kong Island's steep, hilly terrain was initially served by sedan chairs.[197] The Peak Tram, the first public transport system in Hong Kong, has provided vertical rail transport between Central and Victoria Peak since 1888.[198] In Central and Western district, there is an extensive system of escalators and moving pavements, including the longest outdoor covered escalator system in the world, the Mid-Levels escalator.[199]\n\nHong Kong International Airport is a leading air passenger gateway and logistics hub in Asia and one of the world's busiest airports in terms of international passenger and cargo movement, serving more than 47 million passengers and handling 3.74 million tonnes (4.12 million tons) of cargo in 2007.[200] It replaced the overcrowded Kai Tak Airport in Kowloon in 1998, and has been rated as the world's best airport in a number of surveys.[201] Over 85 airlines operate at the two-terminal airport and it is the primary hub of Cathay Pacific, Dragonair, Air Hong Kong, Hong Kong Airlines, and Hong Kong Express.[200][202]\n\nProviding an adequate water supply for Hong Kong has always been difficult because the region has few natural lakes and rivers, inadequate groundwater sources (inaccessible in most cases due to the hard granite bedrock found in most areas in the territory), a high population density, and extreme seasonable variations in rainfall. Thus about 70 percent of water demand is met by importing water from the Dongjiang River in neighbouring Guangdong province. In addition, freshwater demand is curtailed by the use of seawater for toilet flushing, using a separate distribution system.[203]\n\nDemographics\nMain articles: Demographics of Hong Kong and Hong Kong people\n\nSt. John's Cathedral, Anglican cathedral in Hong Kong, the oldest church building in Hong Kong\n\nThe Big Buddha, on Lantau Island, Hong Kong\n\nThe Wong Tai Sin Temple\n\nCathedral of the Immaculate Conception, Catholic cathedral in Hong Kong\nThe territory's population in mid-2015 was 7.3 million,[204] with an average annual growth rate of 0.8% over the previous five years.[6][205] The current population of Hong Kong comprises 91% ethnic Chinese.[6][206][207] 3 million British nationals form nearly half of the territory's inhabitants.[5] A major part of Hong Kong's Cantonese-speaking majority originated from the neighbouring Guangdong province,[208] from where many fled during the Second Sino-Japanese War, the Chinese Civil War, and the communist rule in China.[209][210][211][212]\n\nResidents of the Mainland do not automatically receive the Right of Abode, and many may not enter the territory freely. Like other non-natives, they may apply for the Right of Abode after seven years of continuous residency. Some of the rights may also be acquired by marriage (e.g., the right to work), but these do not include the right to vote or stand for office.[213] However, the influx of immigrants from mainland China, approximating 45,000 per year, is a significant contributor to its population growth – a daily quota of 150 Mainland Chinese with family ties in Hong Kong are granted a \"one way permit\".[214] Life expectancy in Hong Kong is 81.2 years for males and 86.9 years for females as of 2014, making it the highest life expectancy in the world.[175][215]\n\nAbout 91% of the people of Hong Kong are of Chinese descent,[6][206][207] the majority of whom are Taishanese, Chiu Chow, other Cantonese people, and Hakka. Hong Kong's Han majority originate mainly from the Guangzhou and Taishan regions in Guangdong province.[208] The remaining 6.9% of the population is composed of non-ethnic Chinese.[6] There is a South Asian population of Indians and Pakistanis; some Vietnamese refugees have become permanent residents of Hong Kong. There are also Britons, Americans, Canadians, Japanese, and Koreans working in the city's commercial and financial sector.[note 5] In 2011, 133,377 foreign domestic helpers from Indonesia and 132,935 from the Philippines were working in Hong Kong.[219]\n\nLanguages\nMain article: Languages of Hong Kong\nHong Kong's de facto official language is Cantonese, a variety of Chinese originating from Guangdong province to the north of Hong Kong.[220] According to the 2016 by-census, Cantonese is spoken by 94.6% of the Hong Kong population; 88.9 percent as a first language and 5.7% as a second language.[221] English is also an official language, and according to the 2016 by-census is spoken by 53.2% of the population; 4.3 percent as a first language and 48.9 percent as a second language.[221] Signs displaying both Chinese and English are common throughout the territory. Since the 1997 Handover, an increase in immigrants from mainland China and greater interaction with the mainland's economy have brought an increasing number of Mandarin speakers to Hong Kong.[222] According to the 2016 by-census, Mandarin is spoken by 48.6% of the population; 1.9 percent as a first language and 46.7 percent as a second language.[221]\n\nReligion\nMain article: Religion in Hong Kong\nHong Kong is a multi-faith society. A majority of residents of Hong Kong have no religious affiliation, professing a form of agnosticism or atheism.[223] According to the United States Department of State 43 percent of the population practises some form of religion.[224] According to a Gallup poll, 64% of Hong Kong residents do not believe in any religion.[225][226]\n\nIn Hong Kong teaching evolution won out in curriculum dispute about whether to teach other explanations, and that creationism and intelligent design will form no part of the senior secondary biology curriculum.[227][228]\n\nHong Kong enjoys a high degree of religious freedom, guaranteed by the Basic Law. Hong Kong's main religions are Buddhism, Taoism and Confucianism; a local religious scholar in contact with major denominations estimates there are approximately 1.5 million Buddhists and Taoists.[224] A Christian community of around 833,000 forms about 11.7% of the total population;[229] Protestants outnumber Roman Catholics by a ratio of 4:3, and smaller Christian communities also exist, including the Latter-day Saints[230] and Jehovah's Witnesses.[231] The Anglican and Roman Catholic churches each freely appoint their own bishops, unlike in mainland China. There are also Sikh, Muslim, Jewish, Hindu and Bahá'í communities.[232] The practice of Falun Gong is tolerated.[233]\n\nPersonal income\nStatistically Hong Kong's income gap is the largest in Asia Pacific. According to a report by the United Nations Human Settlements Programme in 2008, Hong Kong's Gini coefficient, at 0.53, was the highest in Asia and \"relatively high by international standards\".[234][235] However, the government has stressed that income disparity does not equate to worsening of the poverty situation, and that the Gini coefficient is not strictly comparable between regions. The government has named economic restructuring, changes in household sizes, and the increase of high-income jobs as factors that have skewed the Gini coefficient.[236][237]\n\nEducation\nMain article: Education in Hong Kong\n3-storey red brick building with gabled roof adjacent to 7-storey modern building with flat roof.\nUniversity of Hong Kong\nHong Kong's education system used to roughly follow the system in England,[238] although international systems exist. The government maintains a policy of \"mother tongue instruction\" (Chinese: 母語教學) in which the medium of instruction is Cantonese,[239] with written Chinese and English, while some of the schools (international schools) are using English as the teaching language. In secondary schools, \"biliterate and trilingual\" (Chinese: 兩文三語) proficiency is emphasised, and Mandarin-language education has been increasing.[240] The Programme for International Student Assessment ranked Hong Kong's education system as the second best in the world.[241]\n\nHong Kong's public schools are operated by the Education Bureau. The system features a non-compulsory three-year kindergarten, followed by a compulsory six-year primary education, a compulsory three-year junior secondary education, a non-compulsory two-year senior secondary education leading to the Hong Kong Certificate of Education Examinations and a two-year matriculation course leading to the Hong Kong Advanced Level Examinations.[242] The New Senior Secondary academic structure and curriculum was implemented in September 2009, which provides for all students to receive three years of compulsory junior and three years of compulsory senior secondary education.[243][244] Under the new curriculum, there is only one public examination, namely the Hong Kong Diploma of Secondary Education.[245]\n\nMost comprehensive schools in Hong Kong fall under three categories: the rarer public schools; the more common subsidised schools, including government aids-and-grant schools; and private schools, often run by Christian organisations and having admissions based on academic merit rather than on financial resources. Outside this system are the schools under the Direct Subsidy Scheme and private international schools.[244]\n\nThere are eight public and one private universities in Hong Kong, the oldest being the University of Hong Kong (HKU), established in 1910–1912.[246] The Chinese University of Hong Kong was founded in 1963 to fulfill the need for a university with a medium of instruction of Chinese.[247] Competition among students to receive an offer for an undergraduate programme is fierce as the annual number of intakes is limited, especially when some disciplines are offered by select tertiary institutions, like medicine which is provided by merely two medical schools in the territory, the Li Ka Shing Faculty of Medicine at the University of Hong Kong and the Faculty of Medicine of the Chinese University of Hong Kong. In addition to the public post-secondary institutions there are also a number of private higher institutions which offer higher diplomas and associate degree courses for those who fail to enter a college for a degree study so as to boost their qualification of education, some of whom can have a second chance of getting into a university if they have a good performance in these sub-degree courses.[248][249]\n\nHealth\nMain article: Health in Hong Kong\nThere are 13 private hospitals and more than 40 public hospitals in Hong Kong.[250] There is little interaction between public and private healthcare.[251] The hospitals offer a wide range of healthcare services, and some of the territory's private hospitals are considered to be world class.[252] According to UN estimates, Hong Kong has one of the longest life expectancies of any country or territory in the world.[32] As of 2012, Hong Kong women are the longest living demographic group in the world.[33]\n\nThere are two medical schools in the territory, one based at the Chinese University of Hong Kong and the other at the University of Hong Kong.[253][254] Both have links with public sector hospitals.[253][255] With respect to postgraduate education, traditionally many doctors in Hong Kong have looked overseas for further training, and many took British Royal College exams such as the MRCP(UK) and the MRCS(UK). However, Hong Kong has been developing its own postgraduate medical institutions, in particular the Hong Kong Academy of Medicine, and this is gradually taking over the responsibility for all postgraduate medical training in the territory.\n\nSince 2011, there have been growing concerns that mothers-to-be from mainland China, in a bid to obtain the right of abode in Hong Kong and the benefits that come with it, have saturated the neonatal wards of the city's hospitals both public and private. This has led to protest from local pregnant women for the government to remedy the issue, as they have found difficulty in securing a bed space for giving birth and routine check-ups. Other concerns in the decade of 2001–2010 relate to the workload medical staff experience; and medical errors and mishaps, which are frequently highlighted in local news.[256]\n\nCulture\nMain article: Culture of Hong Kong\nSee also: Lingnan culture and Cinema of Hong Kong\n\nOcean Park Hong Kong, a marine mammal park, oceanarium, animal theme park and amusement park in Hong Kong.\n\nA statue of Bruce Lee on the Avenue of Stars, a tribute to the city's martial arts\nHong Kong is frequently described as a place where \"East meets West\", reflecting the culture's mix of the territory's Chinese (mainly Cantonese) roots with Western (mainly British) influences from its time as a British colony.[257] Concepts like feng shui are taken very seriously, with expensive construction projects often hiring expert consultants, and are often believed to make or break a business.[258] Other objects like Ba gua mirrors are still regularly used to deflect evil spirits,[259] and buildings often lack any floor number that has a 4 in it,[260] due to its similarity to the word for \"die\" in Cantonese.[261] The fusion of east and west also characterises Hong Kong's cuisine, where dim sum, hot pot, and fast food restaurants coexist with haute cuisine.[262]\n\nHong Kong is a recognized global centre of trade and calls itself an \"entertainment hub\".[263] Its martial arts film genre gained a high level of popularity in the late 1960s and 1970s. Several Hollywood performers, notable actors and martial artists have originated from Hong Kong cinema, notably Bruce Lee, Jackie Chan, Chow Yun-fat, Michelle Yeoh, Maggie Cheung and Jet Li. A number of Hong Kong film-makers have achieved widespread fame in Hollywood, such as John Woo, Wong Kar-wai, and Stephen Chow.[263] Homegrown films such as Chungking Express, Infernal Affairs, Shaolin Soccer, Rumble in the Bronx, In the Mood for Love and Echoes of the Rainbow have gained international recognition. Hong Kong is the centre for Cantopop music, which draws its influence from other forms of Chinese music and Western genres, and has a multinational fanbase.[264]\n\nThe Hong Kong government supports cultural institutions such as the Hong Kong Heritage Museum, the Hong Kong Museum of Art, the Hong Kong Academy for Performing Arts, and the Hong Kong Philharmonic Orchestra. The government's Leisure and Cultural Services Department subsidises and sponsors international performers brought to Hong Kong. Many international cultural activities are organised by the government, consulates, and privately.[265][266]\n\nHong Kong had two licensed terrestrial broadcasters – ATV and TVB, the former of which has now been defunct. There are three local and a number of foreign suppliers of cable and satellite services.[267] The production of Hong Kong's soap dramas, comedy series, and variety shows reach audiences throughout the Cantonese-speaking population. Magazine and newspaper publishers in Hong Kong distribute and print in both Chinese and English, with a focus on sensationalism and celebrity gossip.[268] The media in Hong Kong is relatively free from official interference compared to Mainland China, although the Far Eastern Economic Review pointed to signs of self-censorship by media whose owners have close ties to or business interests in the People's Republic of China and states that even Western media outlets are not immune to growing Chinese economic power.[269]\n\nHong Kong offers wide recreational and competitive sport opportunities despite its limited land area. It sends delegates to international competitions such as the Olympic Games and Asian Games, and played host to the equestrian events during the 2008 Summer Olympics.[270] There are major multipurpose venues like Hong Kong Coliseum and MacPherson Stadium. Hong Kong's steep terrain and extensive trail network with expansive views attracts hikers, and its rugged coastline provides many beaches for swimming.[271]\n\nSports\nMain article: Sport in Hong Kong\n\nThe Hong Kong Sevens is considered the premier tournament on the IRB Sevens World Series rugby sevens competition and is held annually in Hong Kong on a weekend in late March.\nSports in Hong Kong are a significant part of its culture. Due mainly to British influence going as far back as the late 19th century, Hong Kong had an earlier introduction to Western athletics compared to other Asia regions. Football, cricket, basketball, swimming, badminton, table tennis, cycling and running have the most participants and spectators. In 2009, Hong Kong successfully organised the V East Asian Games. Other major international sporting events including the Equestrian at the 2008 Summer Olympics, Hong Kong Sevens, Hong Kong Marathon, AFC Asian Cup, EAFF East Asian Cup, Hong Kong Tennis Classic, Premier League Asia Trophy, and Lunar New Year Cup are also held in the territory. As of 2010, there were 32 Hong Kong athletes from seven sports ranking in world's Top 20, 29 athletes in six sports in Asia top 10 ranking. Moreover, Hong Kong athletes with disabilities are equally impressive in their performance as of 2009, having won four world championships and two Asian Championships.[272]\n\nArchitecture\nMain article: Architecture of Hong Kong\nSee also: List of tallest buildings in Hong Kong\nAccording to Emporis, there are 1,223 skyscrapers in Hong Kong, which puts the city at the top of world rankings.[273] It has more buildings taller than 500 feet (150 m) than any other city. The high density and tall skyline of Hong Kong's urban area is due to a lack of available sprawl space, with the average distance from the harbour front to the steep hills of Hong Kong Island at 1.3 km (0.81 mi),[274] much of it reclaimed land. This lack of space causes demand for dense, high-rise offices and housing. Thirty-six of the world's 100 tallest residential buildings are in Hong Kong.[275] More people in Hong Kong live or work above the 14th floor than anywhere else on Earth, making it the world's most vertical city.[276][277]\n\nAs a result of the lack of space and demand for construction, few older buildings remain, and the city is becoming a centre for modern architecture. The International Commerce Centre (ICC), at 484 m (1,588 ft) high, is the tallest building in Hong Kong and the third tallest in the world, by height to roof measurement.[278] The tallest building prior to the ICC is Two International Finance Centre, at 415 m (1,362 ft) high.[279] Other recognisable skyline features include the HSBC Headquarters Building, the triangular-topped Central Plaza with its pyramid-shaped spire, The Center with its night-time multi-coloured neon light show; A Symphony of Lights and I. M. Pei's Bank of China Tower with its sharp, angular façade. According to the Emporis website, the city skyline has the biggest visual impact of all world cities.[280] Also, Hong Kong's skyline is often regarded to be the best in the world,[281] with the surrounding mountains and Victoria Harbour complementing the skyscrapers.[282][283] Most of the oldest remaining historic structures, including the Tsim Sha Tsui Clock Tower, the Central Police Station, and the remains of Kowloon Walled City were constructed during the 19th and early 20th centuries.[284][285][286]\n\nThere are many development plans in place, including the construction of new government buildings,[287] waterfront redevelopment in Central,[288] and a series of projects in West Kowloon.[289] More high-rise development is set to take place on the other side of Victoria Harbour in Kowloon, as the 1998 closure of the nearby Kai Tak Airport lifted strict height restrictions.[290] The Urban Renewal Authority is highly active in demolishing older areas, including the razing and redevelopment of Kwun Tong town centre, an approach which has been criticised for its impact on the cultural identity of the city and on lower-income residents.\n\nCityscape\n\nCity view of Kowloon, Hong Kong Island and the Hong Kong Skyline\nNight time city skyline with Victoria Harbour in front and low hills behind\nA panoramic view of the Hong Kong Island skyline at night, taken from Tsim Sha Tsui\n\nView from the highest mountain of Kowloon overlooking Victoria Harbour and Hongkong Island\nSymbols\nThe flag of Hong Kong, announced in 1990, is red with a white Hong Kong orchid tree flower. It was first officially hoisted on 1 July 1997, in the sovereignty handover ceremony. China's March of the Volunteers is the national anthem.\n\nSee also\n\tHong Kong portal\nflag\tChina portal\nIndex of articles related to Hong Kong\nYouth in Hong Kong\nList of heads of Hong Kong by education\nNotes\nJump up ^ While many not recognized by the People's Republic of China, 3 million British nationals form nearly half of the territory's inhabitants. See British nationality law and Hong Kong.[5]\nJump up ^ The identity of Hong Kong Permanent Resident can be of any nationality, including Chinese, British, or others. A person not of Chinese nationality who has entered Hong Kong with a valid travel document, has ordinarily resided in Hong Kong for a continuous period of not less than 7 years and has taken Hong Kong as his or her place of permanent residence are legally recognized as a Hongkonger. See \"Right of Abode\" of The Immigration Department of Hong Kong\nJump up ^ Section 3(2) of the Sino-British Joint Declaration states in part: \"The Hong Kong Special Administrative Region will enjoy a high degree of autonomy, except in foreign and defence affairs which, are the responsibilities of the Central People's Government.\"\nJump up ^ Section 3(5) of the Sino-British Joint Declaration states that the social and economic systems and lifestyle in Hong Kong will remain unchanged, and mentions rights and freedoms ensured by law. Section 3(12) states in part: \"The above-stated basic policies of the People's Republic of China … will remain unchanged for 50 years.\"\nJump up ^ The results of the 2011 census showed that the \"white\" population had increased from 36,384 in 2006 to 54,740 an increase of 50.4 percent.[216][217][218]\nReferences\nCitations\nJump up ^ Basic Law – Anthem\nJump up ^ \"Hong Kong – the Facts\". GovHK. Retrieved 6 January 2017.\nJump up ^ \"OFFICIAL LANGUAGES DIVISION\". Civil Service Bureau. Retrieved 6 January 2017.\nJump up ^ \"Disclaimer and Copyright Notice\". The Legislative Council Commission. 12 December 2015.\n^ Jump up to: a b The Committee Office, House of Commons. \"House of Commons - Foreign Affairs - Fifth Report\". Parliament of the United Kingdom. Retrieved 26 February 2014.\n^ Jump up to: a b c d e f 2011 Population Census – Summary Results (PDF) (Report). Census and Statistics Department. February 2012. Retrieved 5 September 2013.\nJump up ^ \"Maps and Services\" Survey and Mapping Office\nJump up ^ \"Hong Kong Geographic Data\" (PDF). Retrieved 1 Sep 2017.\nJump up ^ \"HK Population for 2016\". Census and Statistics Department (Hong Kong). 27 Feb 2017.\n^ Jump up to: a b c d \"Hong Kong\". International Monetary Fund. Retrieved 4 June 2017.\nJump up ^ \"Thematic Report : Household Income Distribution in Hong Kong 2016\" (PDF). Government of Hong Kong. Retrieved 10 June 2017.\nJump up ^ \"2015 Human Development Report\" (PDF). United Nations Development Programme. 2015. Retrieved 14 December 2015.\n^ Jump up to: a b \"Aquilaria sinensis and origin of the name of Hong Kong\". herbarium.gov.hk. Hong Kong Herbarium. Retrieved 29 May 2016.\n^ Jump up to: a b \"Making scents: saviours of the incense tree\". South China Morning Post. Retrieved 29 May 2016.\nJump up ^ \"Basic Law Bulletin Issue No. 2\" (PDF). Department of Justice, HKSAR.\n^ Jump up to: a b c d \"Basic Law, Chapter IV, Section 4\". Basic Law Promotion Steering Committee. Retrieved 10 November 2009.\nJump up ^ Russell, Peter H.; O'Brien, David M. (2001). Judicial Independence in the Age of Democracy: Critical Perspectives from around the World. University of Virginia Press. p. 306. ISBN 978-0-8139-2016-0.\nJump up ^ \"Basic Law Full Text – chapter (2)\".\nJump up ^ \"Basic Law Full Text – chapter (7)\".\nJump up ^ \"WTO - Hong Kong, China - Member information\". www.wto.org.\nJump up ^ \"Asia-Pacific Economic Cooperation\". www.tid.gov.hk.\nJump up ^ \"The Global Financial Centres Index 16\" (PDF). Long Finance. September 2014. Retrieved 10 December 2014.\nJump up ^ \"The IMD World Competitiveness Scoreboard\" (PDF). CNN. 25 May 2016. Retrieved 6 June 2016.\nJump up ^ \"Trading and Logistics Industry\" in The 2017–18 Budget\n^ Jump up to: a b \"Triennial Central Bank Survey: Foreign exchange turnover in April 2016\" (PDF). Monetary and Economic Department. Bank for International Settlements: 5. September 2016. Retrieved 3 July 2017.\nJump up ^ \"World's most visited cities: Hong Kong top, London second, Rio climbs but Kiev falls\". The Independent. 29 January 2016. Retrieved 6 June 2016.\nJump up ^ \"Irresistible cities: World's 25 top tourism destinations\". CNN. 30 January 2016. Retrieved 6 June 2016.\nJump up ^ \"Hong Kong Economy: Population, Facts, GDP, Business, Trade, Inflation\". www.heritage.org. Retrieved 22 May 2015.\nJump up ^ \"The World Factbook — Central Intelligence Agency\".\nJump up ^ Ash, Russell (2006). The Top 10 of Everything 2007. Hamlyn. p. 78. ISBN 0-600-61532-4.\nJump up ^ Hong Kong Facts, The skyscraper Center. Viewed on 4 August 2017.\n^ Jump up to: a b \"Life Expectancy Around the World\". LiveScience. 1 August 2012.\n^ Jump up to: a b \"Longest Life Expectancy In World: Women In Hong Kong Now Outlast Japan\". Huffington Post. 26 July 2012.\n^ Jump up to: a b \"Public Transport Introduction\". Transport Department, Hong Kong Government. Archived from the original on 7 July 2008. Retrieved 13 July 2008.\n^ Jump up to: a b Lam, William H. K.; Bell, Michael G. H. (2003). Advanced Modeling for Transit Operations and Service Planning. Emerald Group Publishing. p. 231. ISBN 978-0-08-044206-8.\nJump up ^ \"Pollution Index 2015\". Numbeo. 2015. Retrieved 29 April 2015.\nJump up ^ \"Health Effects of Air Pollution in Hong Kong\". Archived from the original on 30 June 2014. Retrieved 7 October 2014.\nJump up ^ Zhen Yu, Jian; Huang, Hilda; Ng, Wai Man. \"Final Report for Provision of Service for Fine Particulate Matter (PM2.5) Sample Chemical Analysis\" (PDF).\nJump up ^ Fairbank, John King (1953). Trade and Diplomacy on the China Coast: The Opening of the Treaty Ports, 1842–1854 (2nd ed.). Harvard University Press. pp. 123–128. ISBN 978-0-8047-0648-3.\n^ Jump up to: a b Room, Adrian (2005). Placenames of the World. McFarland & Company. p. 168. ISBN 0-7864-2248-3. Retrieved 1 September 2011.\nJump up ^ Bishop, Kevin; Roberts, Annabel (1997). China's Imperial Way. China Books and Periodicals. p. 218. ISBN 962-217-511-2. Retrieved 1 September 2011.\nJump up ^ So, Man-hing. \"The Origin of the Name Hong Kong\" (PDF). Archived from the original (PDF) on 1 February 2016. Retrieved 3 January 2016.\nJump up ^ Kataoka, Shin; Lee, Cream (2008). \"A System without a System: Cantonese Romanization Used in Hong Kong Place and Personal Names\". Hong Kong Journal of Applied Linguistics: 94.\nJump up ^ Hongkong Government Gazette, Notification 479, 3 September 1926\nJump up ^ \"GovHK: Residents\". Hong Kong Government. Retrieved 29 September 2010.\nJump up ^ \"The Trial Excavation at the Archaeological Site of Wong Tei Tung, Sham Chung, Hong Kong SAR\". Hong Kong Archaeological Society. January 2006. Archived from the original on 3 March 2009. Retrieved 21 August 2010.\nJump up ^ 港現舊石器製造場 嶺南或為我發源地 [Paleolithic site appears in Hong Kong, Lingnan perhaps discovered our birthplace]. People's Daily (in Chinese). 17 February 2006. Retrieved 21 August 2010.\nJump up ^ Tang, Chung (2005). 考古與香港尋根 [Archaeologist help find Hong Kong's Roots] (PDF). New Asia Monthly (in Chinese). New Asia College. 32 (6): 6–8. Retrieved 21 August 2010.\nJump up ^ Li, Hui (2002). 百越遺傳結構的一元二分跡象 [The genetic structure of Baiyue divide in half] (PDF). Guangxi Ethnic Group Research (in Chinese). 70 (4): 26–31. Archived from the original (PDF) on 1 May 2011. Retrieved 21 August 2010.\nJump up ^ \"2005 Field Archaeology on Sham Chung Site\". Hong Kong Archaeological Society. January 2006. Archived from the original on 3 March 2009. Retrieved 21 August 2010.\nJump up ^ \"Declared Monuments in Hong Kong – New Territories\". Leisure and Cultural Services Department, Hong Kong Government. 13 January 2010. Retrieved 21 August 2010.\nJump up ^ \"Characteristic Culture\". Invest Nanhai. Retrieved 26 August 2010.[dead link]\nJump up ^ Ban Biao; Ban Gu; Ban Zhao. \"地理誌\" [Treatise on geography]. Book of Han (in Chinese). Volume 28. Retrieved 26 August 2010.\nJump up ^ Peng, Quanmin (2001). 從考古材料看漢代深港社會 [Archaeological material from the Shenzhen-Hong Kong Society of Han]. Relics From South (in Chinese). Retrieved 26 August 2010.\nJump up ^ Keat, Gin Ooi (2004). Southeast Asia: A Historical Encyclopedia. ABC-CLIO. p. 932. ISBN 1-57607-770-5. Retrieved 1 September 2011.\nJump up ^ \"Archaeological Background\". Hong Kong Yearbook. Hong Kong Government. 21. 2005. Retrieved 27 August 2010.\nJump up ^ Siu Kwok-kin. 唐代及五代時期屯門在軍事及中外交通上的重要性 [The importance of Tuen Mun during Tang and Five Dynasties period for foreign traffic and military]. From Sui to Ming (in Chinese). Education Bureau, Hong Kong Government: 40–45. Archived from the original on 29 August 2010. Retrieved 29 August 2010.\nJump up ^ Sweeting, Anthony (1990). Education in Hong Kong, Pre-1841 to 1941: Fact and Opinion. Hong Kong University Press. p. 93. ISBN 962-209-258-6.\nJump up ^ Barber, Nicola (2004). Hong Kong. Gareth Stevens. p. 48. ISBN 978-0-8368-5198-4.\nJump up ^ Porter, Jonathan (1996). Macau, the Imaginary City: Culture and Society, 1557 to the Present. Westview Press. p. 63. ISBN 978-0-8133-2836-2.\nJump up ^ Edmonds, Richard L. (2002). China and Europe Since 1978: A European Perspective. Cambridge University Press. p. 1. ISBN 978-0-521-52403-2.\nJump up ^ Von Glahn, Richard (1996). Fountain of Fortune: Money and Monetary Policy in China, 1000–1700. University of California Press. p. 116.\nJump up ^ Hayes, James (1974). \"The Hong Kong Region: Its Place in Traditional Chinese Historiography and Principal Events Since the Establishment of Hsin-an County in 1573\" (PDF). Journal of the Royal Asiatic Society Hong Kong Branch. 14: 108–135. Retrieved 25 April 2015.\nJump up ^ \"Hong Kong Museum of History: \"The Hong Kong Story\" Exhibition Materials\" (PDF). Hong Kong Museum of History. Archived from the original (PDF) on 18 April 2009. Retrieved 30 August 2010.\nJump up ^ Courtauld, Caroline; Holdsworth, May; Vickers, Simon (1997). The Hong Kong Story. Oxford University Press. pp. 38–58. ISBN 978-0-19-590353-9.\nJump up ^ Hoe, Susanna; Roebuck, Derek (1999). The Taking of Hong Kong: Charles and Clara Elliot in China Waters. Routledge. p. 203. ISBN 978-0-7007-1145-1.\nJump up ^ John Thomson 1837–1921,Chap on Hong Kong, Illustrations of China and Its People (London,1873–1874)\nJump up ^ Info Gov HK. \"Hong Kong Gov Info Archived 6 July 2006 at the Wayback Machine..\" History of Hong Kong. Retrieved on 16 February 2007.\n^ Jump up to: a b c d e Wiltshire, Trea (1997). Old Hong Kong. Volume II: 1901–1945 (5th ed.). FormAsia Books. p. 148. ISBN 962-7283-13-4.\nJump up ^ \"History of Hong Kong\". Global Times. 6 July 2010. Archived from the original on 23 July 2010. Retrieved 31 August 2010.\nJump up ^ Scott, Ian (1989). Political change and the crisis of legitimacy in Hong Kong. University of Hawaii Press. p. 6. ISBN 978-0-8248-1269-0.\nJump up ^ Linda Pomerantz-Zhang (1992). \"Wu Tingfang (1842–1922): reform and modernization in modern Chinese history\". Hong Kong University Press. p.8. ISBN 962-209-287-X\nJump up ^ Brief Information on Proposed Grade I Items, pp. 53–54 Archived 13 October 2012 at the Wayback Machine.\nJump up ^ L, Klemen (1999–2000). \"Chronology of the Dutch East Indies, 7 December 1941 – 11 December 1941\". Forgotten Campaign: The Dutch East Indies Campaign 1941–1942. Archived from the original on 15 October 2015.\nJump up ^ L, Klemen (1999–2000). \"Chronology of the Dutch East Indies, 25 December 1941 – 31 December 1941\". Forgotten Campaign: The Dutch East Indies Campaign 1941–1942. Archived from the original on 11 January 2012.\nJump up ^ Bradsher, Keith (17 April 2005). \"Thousands March in Anti-Japan Protest in Hong Kong\". The New York Times. Retrieved 20 October 2010.\nJump up ^ Moore, Lynden (1985). The growth and structure of international trade since the Second World War. Cambridge University Press. p. 48. ISBN 978-0-521-46979-1. Retrieved 1 September 2011.\nJump up ^ Forsyth, Neil, dir. Underground Pride. Mass Transit Railway Corporation, 1990. Film. 21 November 2013\nJump up ^ Dodsworth, John; Mihaljek, Dubravko (1997). Hong Kong, China: Growth, Structural Change, and Economic Stability During the Transition. International Monetary Fund. p. 54. ISBN 1-55775-672-4.\nJump up ^ \"Links between SARS, human genes discovered\". People's Daily. 16 January 2004. Retrieved 1 February 2008.\nJump up ^ Lee, S. H. (2006). SARS in China and Hong Kong. Nova Publishers. pp. 63–70. ISBN 978-1-59454-678-5.\nJump up ^ \"Summary of probable SARS cases with onset of illness from 1 November 2002 to 31 July 2003\". World Health Organization. 31 December 2003. Retrieved 4 October 2010.\nJump up ^ 疫情衝擊香港經濟損失巨大 [The impact of economic losses in the great epidemic] (in Chinese). BBC News. 28 May 2003. Retrieved 24 August 2010.\nJump up ^ Yau, Cannix (11 March 2005). \"Tung's gone. What next?\". The Standard. Archived from the original on 22 May 2011. Retrieved 17 September 2010.\nJump up ^ \"Donald Tsang wins Chief Executive election\". Hong Kong Government. 25 March 2007. Archived from the original on 26 May 2008. Retrieved 17 September 2010.\nJump up ^ \"Chinese Taipei Wins God Medal in Men's 400-Meter Relay\". Kuomintang. 14 December 2009. Archived from the original on 13 May 2011. Retrieved 17 September 2010.\nJump up ^ \"White paper on Hong Kong\". BBC. Retrieved 10 June 2014.\nJump up ^ \"British parliamentary group unlawfully refused entry to Hong Kong\". The Guardian. Retrieved 30 November 2014.\nJump up ^ The Economist Intelligence Unit (2 January 2008). \"Hong Kong politics: China sets reform timetable\". The Economist. Retrieved 6 September 2010.\nJump up ^ \"Disappearance of 5 Tied to Publisher Prompts Broader Worries in Hong Kong\". New York Times. Retrieved 4 January 2016.\nJump up ^ \"Hong Kong ban on pro-independence candidates sparks backlash\". Financial Times. Retrieved 31 July 2016.\nJump up ^ \"Chow Wing-kan pulls out of Legco race amid threat\". 26 August 2016. Retrieved 26 August 2016.\nJump up ^ Trouble Down South: Why Hong Kong and Mainland Chinese Aren't Getting Along Ko, Vanessa. TIME, 24 June 2012.\nJump up ^ \"巿民的身份認同感 People's Ethnic Identity\".\nJump up ^ \"Basic Law, Chapter VIII\". Basic Law Promotion Steering Committee. Retrieved 10 November 2009.\nJump up ^ Chen, Wenmin; Fu, H. L.; Ghai, Yash P. (2000). Hong Kong's Constitutional Debate: Conflict Over Interpretation. Hong Kong University Press. pp. 235–236. ISBN 978-962-209-509-0.\nJump up ^ \"Basic Law, Chapter IV, Section 6\". Basic Law Promotion Steering Committee. Retrieved 10 November 2009.\nJump up ^ \"Civil Service\" (PDF). Information Services Department, Hong Kong Government. June 2009. Retrieved 6 September 2010.\nJump up ^ \"Basic Law, Chapter IV, Section 3\". Basic Law Promotion Steering Committee. Retrieved 10 November 2009.\nJump up ^ Madden, Frederick (2000). The End of Empire: Dependencies since 1948. Part 1: The West Indies, British Honduras, Hong Kong, Fiji, Cyprus, Gibraltar, and the Falklands. Volume VIII: Select Documents on the Constitutional History of the British Empire and Commonwealth. Greenwood Publishing. pp. 188–196. ISBN 978-0-313-29072-5.\nJump up ^ \"Basic Law, Chapter IV, Section 1\". Basic Law Promotion Steering Committee. Retrieved 10 November 2009.\nJump up ^ Burns, John P. (2004). Government Capacity and the Hong Kong Civil Service. Oxford University Press. p. 114. ISBN 978-0-19-590597-7.\n^ Jump up to: a b \"Basic Law, Chapter II\". Basic Law Promotion Steering Committee. Retrieved 10 November 2009.\nJump up ^ \"Presentation to Legislative Council on Right of Abode Issue\". Hong Kong Human Rights Monitor. 10 May 1999. Retrieved 20 January 2007.\nJump up ^ Ming, Sing (August 2006). \"The Legitimacy Problem and Democratic Reform in Hong Kong\". Journal of Contemporary China. Informa. 15 (48): 517–532. doi:10.1080/10670560600736558.\nJump up ^ Balfour, Frederik; Lui, Marco (25 June 2010). \"Hong Kong Lawmakers Approve Tsang's Election Plan\". Businessweek. Bloomberg L.P. Retrieved 6 October 2010.\nJump up ^ \"Public Consultation on the Methods for Selecting the Chief Executive and for Forming the Legislative Council in 2012\" (PDF). Hong Kong Government. 11 June 2010. Retrieved 5 September 2010.\nJump up ^ \"Hopes for full democracy in Hong Kong dealt blow by Beijing\". Hong Kong Herald. 31 August 2014. Retrieved 1 September 2014.\n^ Jump up to: a b c \"The Legal System in Hong Kong\". Department of Justice, Hong Kong Government. Archived from the original on 13 September 2008. Retrieved 20 September 2008.\n^ Jump up to: a b Ash, Robert F. (2003). Hong Kong in Transition: One Country, Two Systems. Volume 11: RoutledgeCurzon Studies in the Modern History of Asia. Psychology Press. pp. 161–188. ISBN 978-0-415-29954-1.\n^ Jump up to: a b \"Introduction\". Hong Kong Judiciary. Retrieved 20 September 2008.\nJump up ^ Gaylord, Mark S.; Gittings, Danny; Traver, Harold (2009). Introduction to Crime, Law and Justice in Hong Kong. Hong Kong University Press. p. 153. ISBN 978-962-209-978-4.\nJump up ^ \"Archived copy\" (PDF). Archived from the original (PDF) on 16 October 2013. Retrieved 20 July 2013.\nJump up ^ \"Basic Law Bulletin Issue No. 10 Part 3\" (PDF). Archived from the original (PDF) on 4 December 2013. Retrieved 14 May 2014.\nJump up ^ \"About Us: Organisation chart of the Secretary for Justice's Office\". Department of Justice, Hong Kong Government. Archived from the original on 4 September 2008. Retrieved 5 September 2008.\nJump up ^ \"Basic Law, Chapter IV, Section 2\". Basic Law Promotion Steering Committee. Retrieved 10 November 2009.\nJump up ^ Weisenhaus, Doreen; Cottrell, Jill; Yan, Mei Ning (2007). Hong Kong Media Law: A Guide for Journalists and Media Professionals. Hong Kong University Press. p. 74. ISBN 978-962-209-808-4.\nJump up ^ Article 151, Hong Kong Basic Law\nJump up ^ Chapter 1, Hong Kong Year Book 2011\nJump up ^ Christopher J. Marut Appointed as Director of the Taipei Office of the American Institute in Taiwan[permanent dead link], American Institute in Taiwan, 8 May 2012\nJump up ^ Commons, The Committee Office, House of. \"House of Commons – The UK's relations with Hong Kong: 30 years after the Joint Declaration – Foreign Affairs\".\nJump up ^ \"Political rights increased after handover: ExpertsHK – China Daily Asia\". Retrieved 19 August 2016.\nJump up ^ \"2008 Human Rights Report: China (Hong Kong)\". US Department of State. Archived from the original on 23 January 2010. Retrieved 2 March 2010.\nJump up ^ \"Same-Sex Marriage / Civil partnership\". FamilyCLIC.hk. Retrieved 25 September 2015.\nJump up ^ \"Country Report 2009\". Freedom House. Retrieved 14 December 2009.\nJump up ^ \"Protest against HK rail link\". The Straits Times. 17 January 2010. Archived from the original on 24 July 2013. Retrieved 6 April 2010.\nJump up ^ http://www.legco.gov.hk/yr03-04/english/counmtg/hansard/cm0428ti-translate-e.pdf\nJump up ^ Yahoo Archived 4 June 2011 at Archive.is\nJump up ^ \"Sexual Orientation and Human Rights in Hong Kong\". Hong Kong Human Rights Monitor. Retrieved 2 March 2010.\nJump up ^ Barme, Geremie R.; Ye, Sang (1 February 1996). \"The Great Firewall of China\". Wired.com. Retrieved 2 November 2011.\nJump up ^ \"The Copyright (Amendment) Bill 2014 and Hong Kong's Freedoms\". 9 December 2015. Retrieved 19 August 2016.\nJump up ^ \"Controversial 'Internet Article 23' may pass despite pan-dem opposition\". Hong Kong Free Press. 4 December 2015. Retrieved 19 August 2016.\n^ Jump up to: a b \"Hong Kong– The Facts: District Administration\" (PDF). Hong Kong Government. Retrieved 31 August 2008.\nJump up ^ \"Mission\". Home Affairs Department, Hong Kong Government. 30 June 2009. Retrieved 10 November 2009.\nJump up ^ Rioni, S. G. (2002). Hong Kong in Focus: Political and Economic Issues. Nova Publishers. pp. 154–163. ISBN 978-1-59033-237-5.\nJump up ^ \"Mystery surrounds new Hong Kong army cadet force inaugurated at PLA base\". SCMP Hong Kong. 15 January 2015.\nJump up ^ Cite error: The named reference censtatd was invoked but never defined (see the help page).\nJump up ^ \"Land Utilization in Hong Kong 2015\". Planning Data. Planning Department. Retrieved 11 October 2016.\nJump up ^ Morton, Brian; Harper, Elizabeth (1995). An Introduction to the Cape d'Aguilar Marine Reserve, Hong Kong. Hong Kong University Press. p. 9. ISBN 9789622093881.\nJump up ^ \"2006 Population By-census\" (PDF). Census and Statistics Department, Hong Kong Government. Retrieved 13 November 2009.\nJump up ^ \"Tai Mo Shan Country Park\". Agriculture, Fisheries and Conservation Department, Hong Kong Government. 17 March 2006. Archived from the original on 3 September 2009. Retrieved 8 November 2009.\nJump up ^ \"Hong Kong\". Olympic Council of Asia. Archived from the original on 18 August 2009. Retrieved 14 November 2009.\nJump up ^ \"Geopark leaflet\" (PDF). Retrieved 26 October 2013.\nJump up ^ \"Chief Executive pledges a clean, green, world-class city\". Hong Kong Trade Development Council. November 2001. Retrieved 17 September 2010.\nJump up ^ \"HK harbour reclamation reprieve\". BBC News. 9 January 2004. Retrieved 4 October 2010.\nJump up ^ Bradsher, Keith (5 November 2006). \"Dirty Air Becomes Divisive Issue in Hong Kong Vote\". The New York Times. Retrieved 1 February 2008.\nJump up ^ \"Distance between Hong Kong, Hong Kong and the Tropic of Cancer\". dateandtime.info. Retrieved 5 September 2017.\nJump up ^ \"Climate of Hong Kong\". Hong Kong Observatory. Retrieved 5 September 2017.\nJump up ^ \"Hong Kong in Figures 2008 Edition\". Census and Statistics Department, Hong Kong Government. 27 February 2008. Retrieved 7 May 2008.\n^ Jump up to: a b \"Extreme Values and Dates of Occurrence of Extremes of Meteorological Elements between 1884–1939 and 1947–2014 for Hong Kong\". Hong Kong Observatory. Retrieved 2015-08-10.\n^ Jump up to: a b \"Record-breaking high temperature\" (PDF). Hong Kong Observatory. Retrieved 2015-08-10.\nJump up ^ http://www.hko.gov.hk/cis/awsYearlyExtract_uc.htm?stn=WGL\nJump up ^ \"Monthly Meteorological Normals for Hong Kong\". Hong Kong Observatory. Retrieved 2012-01-03.\nJump up ^ \"Monthly Data for Single Element\". Retrieved 2016-04-14. Mean monthly maxima and minima (i.e. the expected highest and lowest temperature readings at any point during the year or given month) calculated based on data at HKO from 1981 to 2010.\nJump up ^ \"Hong Kong – Climate data\". Weather Atlas. Retrieved 28 March 2017.\nJump up ^ Coispeau, Olivier (10 August 2016). Finance Masters: A Brief History of International Financial Centers in the Last Millennium. World Scientific. ISBN 9789813108844.\nJump up ^ Bromma, Hubert (2007). How to Invest in Offshore Real Estate and Pay Little Or No Taxes. McGraw-Hill Professional. p. 161. ISBN 978-0-07-147009-4.\nJump up ^ \"Annual Statistics\". World Federation of Exchanges. 2016. Archived from the original on 2017-07-03. Retrieved 2017-07-03.\nJump up ^ \"Hong Kong IPOs May Raise Record $48 Billion in 2010, E&Y Says\". Bloomberg L.P. 21 December 2009. Retrieved 17 September 2010.\nJump up ^ \"The Global Financial Centres Index 21\" (PDF). Long Finance. March 2017.\nJump up ^ Hong Kong's Linked Exchange Rate System (PDF). Hong Kong Monetary Authority. p. 33. Retrieved 6 October 2010.\n^ Jump up to: a b \"End of an experiment\". The Economist. 15 July 2010. Retrieved 5 September 2010.\nJump up ^ \"Hong Kong ranked world's freest economy for 18th consecutive year\". Government of Hong Kong. 12 January 2012. Retrieved 28 May 2012.\nJump up ^ \"2008 Index of Economic Freedom\". The Heritage Foundation. Archived from the original on 1 February 2008. Retrieved 1 February 2008. [clarification needed]\nJump up ^ \"Top 10 Countries\". The Heritage Foundation. Archived from the original on 24 January 2008. Retrieved 1 February 2008.\nJump up ^ Preston, Peter Wallace; Haacke, Jürgen (2003). Contemporary China: The Dynamics of Change at the Start of the New Millennium. Psychology Press. pp. 80–107. ISBN 978-0-7007-1637-1.\nJump up ^ Yeung, Rikkie (2008). Moving Millions: The Commercial Success and Political Controversies of Hong Kong's Railways. Hong Kong University Press. p. 16. ISBN 978-962-209-963-0.\nJump up ^ \"The Global Financial Centres Index 1 Executive Summary\" (PDF). City of London. March 2007. p. 6. Archived from the original (PDF) on 14 June 2007. Retrieved 12 April 2007.\nJump up ^ A Tale Of Three Cities，Time, 17 January 2008\nJump up ^ \"About Hong Kong\". Hong Kong government. April 2006. Archived from the original on 19 January 2008. Retrieved 1 February 2008.\nJump up ^ \"The Panama Canal: A plan to unlock prosperity\". The Economist. 3 December 2009. Retrieved 4 December 2009.\nJump up ^ Dhungana, Gita (29 December 2006). \"Growth in exports defies predictions\". The Standard. Retrieved 4 October 2010.\nJump up ^ Hong Kong Monthly Digest of Statistics, Hong Kong Government, March 2008\nJump up ^ Economic and Social Survey of Asia and the Pacific 2009: Addressing Triple Threats to Development. United Nations Publications. 2009. pp. 94–99. ISBN 978-92-1-120577-0.\n^ Jump up to: a b \"Hong Kong\". The World Factbook. CIA. 23 August 2010. Archived from the original on 14 May 2009. Retrieved 17 September 2010.\nJump up ^ Kong, Daniel (8 August 2013). \"Hong Kong Imports Over 90% of Its Food. Can It Learn to Grow?\". Modern Farmer. Retrieved 26 October 2013.\nJump up ^ UNWTO Tourism Highlights, 2015 Edition(Press release). UNWTO. 25 June 2015. Retrieved 14 September 2015.\nJump up ^ \"Worldwide Cost of Living survey 2009\". Mercer. 29 June 2010. Archived from the original on 25 July 2011. Retrieved 25 August 2010.\nJump up ^ \"Global Wealth Continues Its Strong Recovery with $9 Trillion Gain, but Pressures on Wealth Managers Persist, Says Study by The Boston Consulting Group\" (Press release). Finance Twitter. 31 May 2011.\nJump up ^ \"The 15 most billionaire-dense countries\".\nJump up ^ \"Explore Economies\". World Bank. 2010. Retrieved 31 August 2010.\nJump up ^ \"World News, Politics, Economics, Business & Finance\". The Economist.\nJump up ^ Tsang, Donald (18 September 2006). \"Big Market, Small Government\" (Press release). Hong Kong Government. Archived from the original on 5 December 2008. Retrieved 6 October 2010.\nJump up ^ \"Hong Kong's Export Outlook for 2008: Maintaining Competitiveness through Supply Chain Management\". Hong Kong Trade Development Council. 6 December 2007. Retrieved 30 August 2010.\nJump up ^ \"HKDF –Has Hong Kong Lost its Competitiveness?\". Hong Kong Democratic Foundation. Archived from the original on 15 November 2014. Retrieved 14 November 2009.\nJump up ^ \"Octopus Card Information\". Octopus Cards Limited. Retrieved 10 December 2008.\nJump up ^ Poon, Simpson; Chau, Patrick (February 2001). \"Octopus: The Growing E-payment System in Hong Kong\". Electronic Markets. Informa. 11 (2): 97–106. doi:10.1080/101967801300197016.\nJump up ^ \"Press Release: Government has reached understanding with MTRCL on the terms for merging the MTR and KCR systems\". Hong Kong Government. 11 April 2006. Retrieved 17 November 2007.\nJump up ^ \"Tourist Information\". Mass Transit Railway. Archived from the original on 16 April 2008. Retrieved 29 April 2008.\nJump up ^ \"The Company\". Hong Kong Tramways. Archived from the original on 10 April 2008. Retrieved 29 April 2008.\nJump up ^ Cullinane, S. (January 2002). \"The relationship between car ownership and public transport provision: a case study of Hong Kong\". Transport Policy. 9 (1): 29–39. doi:10.1016/S0967-070X(01)00028-2.\nJump up ^ Ng, Tze-wei (10 November 2006). \"Not even HK's storied Star Ferry can face down developers\". International Herald Tribune. Archived from the original on 24 January 2008. Retrieved 1 September 2010.\nJump up ^ \"Ferry is amongst the world's best\". BBC News. 19 October 2004. Retrieved 29 April 2008.\nJump up ^ Fitzpatrick, Liam. \"Hong Kong: 10 Things to Do in 24 Hours\". Time. Retrieved 31 August 2010.\nJump up ^ Cushman, Jennifer Wayne (1993). Fields from the sea: Chinese junk trade with Siam during the late eighteenth and early nineteenth centuries. SEAP Publications. p. 57. ISBN 0-87727-711-7.\nJump up ^ \"HIT:: Hongkong International Terminals\". Retrieved 22 February 2011.\nJump up ^ Thomson, John (1873). Illustrations of China and Its People. Sampson Low, Marston, Low, and Searle. p. 96.\nJump up ^ Cavaliero, Eric (24 July 1997). \"Grand old lady to turn 110\". The Standard. Archived from the original on 22 May 2011. Retrieved 1 September 2010.\nJump up ^ Gold, Anne (6 July 2001). \"Hong Kong's Mile-Long Escalator System Elevates the Senses: A Stairway to Urban Heaven\". The New York Times. Retrieved 22 October 2010.\n^ Jump up to: a b \"About Us\". Hong Kong International Airport. Archived from the original on 21 August 2007. Retrieved 28 April 2008.\nJump up ^ \"International travellers have voted Hong Kong the best airport in the world\". Skytrax. 8 August 2007. Retrieved 28 April 2008.\nJump up ^ \"Air Cargo and Aviation Logistic Services\" (PDF). Hong Kong International Airport. p. 1. Retrieved 31 August 2010.[dead link]\nJump up ^ Lee, N. K. (2013). \"The Changing Nature of Border, Scale and the Production of Hong Kong's Water Supply System since 1959\". International Journal of Urban and Regional Research. doi:10.1111/1468-2427.12060.\nJump up ^ \"Population – Overview – Census and Statistics Department\".\nJump up ^ \"Table 003 : Population Growth by Component – Census and Statistics Department\".\n^ Jump up to: a b \"GovHK: Hong Kong – the Facts\". www.gov.hk. Retrieved 19 August 2016.\n^ Jump up to: a b \"Hong Kong Demographics Profile 2014\". www.indexmundi.com. Retrieved 19 August 2016.\n^ Jump up to: a b Fan Shuh Ching (1974). \"The Population of Hong Kong\" (PDF). World Population Year. Committee for International Coordination of National Research in Demography: 18–20. Retrieved 25 August 2010.\nJump up ^ \"A history of refugees in Hong Kong\". Time Out Hong Kong. 18 June 2013. Retrieved 9 September 2013. The first wave of refugees came to Hong Kong in the 1930s to escape from the Chinese Civil War and the Sino-Japanese War, but it wasn't until 1949, during the Chinese exodus, when an estimated one million mainland Chinese started coming into the territory via the northern borders. Many people, mostly anti-communist Kuomintang officials and capitalists, rushed to Hong Kong in search of refuge.\nJump up ^ Lonely Planet Hong Kong (10th ed.). Lonely Planet. 2002. p. 16. ISBN 1-86450-230-4. The turmoil on the mainland, leading to the defeat of the Nationalists and takeover by the Communists in 1949, unleashed a torrent of refugees – both rich and poor -into Hong Kong.\nJump up ^ \"Veterans who fled mainland for Hong Kong in 1970s tell their stories\". South China Morning Post. Retrieved 9 September 2013.\nJump up ^ Carroll, John (2007). A Concise History of Hong Kong. Rowman & Littlefield. p. 127. ISBN 978-0-7425-3422-3.\nJump up ^ \"Right of Abode in HKSAR—Verification of Eligibility for Permanent Identity Card\". Immigration Department, Hong Kong Government. 5 June 2007. Archived from the original on 19 January 2008. Retrieved 1 February 2008.\nJump up ^ \"Who is entitled to sponsor family members to come to live in Hong Kong? If I am a lawful resident of Hong Kong, can my family members in the Mainland (or elsewhere) apply to immigrate to Hong Kong?\". Community Legal Information Centre. Retrieved 4 November 2009.\nJump up ^ \"Centre for Health Protection - Life Expectancy at Birth (Male and Female), 1971 - 2015\".\nJump up ^ \"Census Result - 2011 Hong Kong Population Census\".\nJump up ^ \"Population by Ethnicity and District Council District, 2011 (A205)\".\nJump up ^ \"Counting Expat Numbers a Complex Task (Hong Kong)\". Global Auto Industry. July 2008. Retrieved 30 August 2010.\nJump up ^ International Labour Office (2009). Application of International Labour Standards 2009 (I). International Labour Organization. p. 640. ISBN 92-2-120634-3.\nJump up ^ Westra, Nick (5 June 2007). \"Hong Kong as a Cantonese speaking city\". Journalism and Media Studies Centre, University of Hong Kong. Retrieved 14 November 2009.\n^ Jump up to: a b c \"Main Tables - Proportion of Population Aged 5 and Over by Able to Speak Selected Languages/ Dialects and Year\". 2016 Population By-Census. Retrieved 1 July 2017.\nJump up ^ Yum, Cherry (2007). \"Which Chinese? Dialect Choice in Philadelphia's Chinatown\" (PDF). Haverford College. Retrieved 25 August 2010.\nJump up ^ \"Hong Kong\". Bmm.org. 1 July 1997. Retrieved 2 November 2011.\n^ Jump up to: a b \"China (Includes Tibet, Hong Kong, Macau)\". State.gov. Retrieved 2 November 2011.\nJump up ^ Carballo, Marita. \"RELIGION IN THE WORLD AT THE END OF THE MILLENNIUM\". Gallup International Association. Archived from the original on 20 July 2011. Retrieved 11 May 2012.\nJump up ^ \"Apostasy\". Countdown.org. Archived from the original on 25 July 2011. Retrieved 2 November 2011.\nJump up ^ \"Evolution wins out in Hong Kong curriculum dispute\". Nature.com. Retrieved 2 November 2011.\nJump up ^ \"Victory for Darwin – Creationism rejected in new guidelines on the biology curriculum | 香港獨立媒體\". Inmediahk.net. Retrieved 2 November 2011.\nJump up ^ \"Hong Kong Year Book (2010): Chapter 18 – Religion and Custom\" (PDF). Retrieved 26 October 2013.\nJump up ^ \"Hong Kong China Temple\". The Church of Jesus Christ of Latter-day Saints. Retrieved 30 September 2010.\nJump up ^ 2015 Yearbook of Jehovah's Witnesses. Watch Tower Society. p. 184.\nJump up ^ \"International Religious Freedom Report 2007 – Hong Kong\". United States Department of State. 2007. Retrieved 16 May 2009.\nJump up ^ \"International Religious Freedom Report 2006 – Hong Kong\". United States Department of State. 2006. Retrieved 6 October 2010.\nJump up ^ Piboontanasawat, Nipa (23 October 2008). \"Hong Kong Has Highest Income Disparity in Asia, UN Report Says\". Bloomberg. Retrieved 25 August 2010.\nJump up ^ \"State of the World's Cities 2008/2009\" (PDF) (Press release). United Nations Human Settlements Programme. 2009. Retrieved 31 August 2010.\nJump up ^ \"Subcommittee to Study the Subject of Combating Poverty\" (PDF). Legislative Council of Hong Kong. 23 June 2005. Retrieved 30 August 2010.\nJump up ^ \"Policies in Assisting Low-income Employees\" (PDF). Commission on Poverty. Legislative Council of Hong Kong. 23 January 2006. Archived from the original (PDF) on 1 May 2011. Retrieved 30 August 2010.\nJump up ^ Chan, Shun-hing; Leung, Beatrice (2003). Changing Church and State Relations in Hong Kong, 1950–2000. Hong Kong University Press. p. 24. ISBN 962-209-612-3.\nJump up ^ 母語教學小冊子 [Mother Tongue Instruction Handbook] (in Chinese). Education Bureau, Hong Kong Government. Archived from the original on 9 February 2009. Retrieved 4 November 2009.\nJump up ^ \"Policy for Secondary Schools -Medium of Instruction Policy for Secondary Schools\". Education Bureau, Hong Kong Government. Archived from the original on 11 January 2009. Retrieved 4 November 2009.\nJump up ^ \"PISA 2006 Science Competencies for Tomorrow's World\". Organisation for Economic Co-operation and Development. 2006. Retrieved 14 December 2007.\nJump up ^ \"Kindergarten, Primary and Secondary Education\". Education Bureau, Hong Kong Government. Archived from the original on 30 December 2007. Retrieved 1 February 2008.\nJump up ^ \"Programme Highlights\". Hong Kong Government. Retrieved 20 October 2010.\n^ Jump up to: a b Li, Arthur (18 May 2005). \"Creating a better education system\". Hong Kong Government. Archived from the original on 3 March 2008. Retrieved 17 August 2010.\nJump up ^ \"HKDSE\". Hong Kong Examinations and Assessment Authority. 12 October 2010. Archived from the original on 16 October 2010. Retrieved 20 October 2010.\nJump up ^ \"History of HKU\".\nJump up ^ \"Report of the Fulton Commission, 1963: Commission to Advise on the Creation of a Federal-Type Chinese University in Hong Kong\". Minerva. 1 (4): 493–507. Summer 1963. Retrieved 30 April 2014.\nJump up ^ Tan, Hwee Ann (5 June 2013). \"Hong Kong Says International Schools Can't Meet Primary Demand\". Bloomberg Businessweek. Retrieved 9 June 2013.\nJump up ^ Hsu, Cathy (12 November 2012). Global Tourism Higher Education: Past, Present, and Future. Routledge. pp. 139–142. ISBN 978-1-136-44847-8.\nJump up ^ \"Clusters, Hospitals & Institutions\". Hospital Authority. Retrieved 9 May 2013.\nJump up ^ \"Health & safety\". Lonely Planet. Retrieved 10 May 2013.\nJump up ^ \"Private Hospitals in Hong Kong\". The New Economy. Retrieved 9 May 2013.\n^ Jump up to: a b \"Milestones\". Chinese University of Hong Kong. Archived from the original on 23 September 2012. Retrieved 10 May 2013.\nJump up ^ \"Education\". University of Hong Kong. Archived from the original on 8 May 2013. Retrieved 10 May 2013.\nJump up ^ \"Educational objectives\". University of Hong Kong. Archived from the original on 24 October 2013. Retrieved 10 May 2013.\nJump up ^ LaFraniere, Sharon (22 February 2012). \"Mainland Chinese Flock to Hong Kong to Give Birth\". The New York Times. Retrieved 9 June 2013.\nJump up ^ \"24 hours in Hong Kong: Urban thrills where East meets West\". CNN. 8 March 2009. Retrieved 27 May 2009.\nJump up ^ \"Feng shui used in 90% of RP businesses\". Philippine Daily Inquirer. 17 February 2009. Retrieved 14 November 2009.\nJump up ^ Fowler, Jeaneane D.; Fowler, Merv (2008). Chinese Religions: Beliefs and Practices. Sussex Academic Press. p. 263. ISBN 978-1-84519-172-6.\nJump up ^ Xi, Xu; Ingham, Mike (2003). City Voices: Hong Kong writing in English, 1945–present. Hong Kong University Press. p. 181. ISBN 978-962-209-605-9.\nJump up ^ Chan, Cecilia; Chow, Amy (2006). Death, Dying and Bereavement: a Hong Kong Chinese Experience. Volume 1. Hong Kong University Press. p. 3. ISBN 978-962-209-787-2.\nJump up ^ Stone, Andrew; Chow, Chung Wah; Ho, Reggie (15 January 2008). Hong Kong and Macau. Lonely Planet. p. 7. ISBN 978-1-74104-665-6.\n^ Jump up to: a b \"Hong Kong calls itself Asia's entertainment hub\". Monsters and Critics. 23 March 2007.\nJump up ^ Corliss, Richard (24 September 2001). \"Hong Kong music circles the globe with its easy-listening hits and stars\". Time. Retrieved 4 November 2009.\nJump up ^ \"General Information\". Leisure and Cultural Services Department, Hong Kong Government. 15 October 2009. Archived from the original on 16 November 2004. Retrieved 31 August 2010.\nJump up ^ \"About the Museum\". Leisure and Cultural Services Department, Hong Kong Government. 25 May 2010. Archived from the original on 20 August 2010. Retrieved 31 August 2010.\nJump up ^ \"Broadcasting: Licences\". Commerce and Economic Development Bureau, Hong Kong Government. Retrieved 4 November 2009.\nJump up ^ Li, Jinquan (2002). Global Media Spectacle: News War Over Hong Kong. State University of New York Press. pp. 69–74. ISBN 978-0-7914-5472-5.\nJump up ^ Walker, Christopher; Cook, Sarah (12 October 2009). \"China's Export of Censorship\". Far Eastern Economic Review. Retrieved 4 November 2009.\nJump up ^ \"Hong Kong Olympic Equestrian Venue (Beas River & Shatin)\". Beijing Organizing Committee for the Olympic Games. Archived from the original on 9 August 2008. Retrieved 4 November 2009.\nJump up ^ Macdonald, Phil (2006). National Geographic Traveler: Hong Kong (2nd ed.). National Geographic Society. p. 263. ISBN 978-0-7922-5369-3.\nJump up ^ \"Legislative Council Panel on Home Affairs Sports Development Policy and Objectives\" (PDF). Home Affairs Bureau. October 2010. Retrieved 8 June 2013.\nJump up ^ \"Cities with the most skyscrapers\". Emporis. Retrieved 14 June 2012.\nJump up ^ Tong, C. O.; Wong, S. C. (August 1997). \"The advantages of a high density, mixed land use, linear urban development\". Transportation. 24 (3): 295–307. doi:10.1023/A:1004987422746.\nJump up ^ \"World's Tallest Residential Towers\". Emporis. Retrieved 24 May 2009.\nJump up ^ \"Vertical Cities: Hong Kong/New York.\". Time Out. 3 August 2008. Archived from the original on 16 January 2011. Retrieved 25 August 2010.\nJump up ^ \"Home page\". Skyscraper Museum. 14 July 2008. Retrieved 25 August 2010.\nJump up ^ \"International Commerce Centre\". Emporis. Retrieved 2 September 2008.\nJump up ^ \"Two International Finance Centre\". Emporis. Retrieved 24 May 2009.\nJump up ^ \"Emporis Skyline Ranking\". Emporis. Archived from the original on 4 June 2011. Retrieved 24 May 2009.\nJump up ^ \"The world's top 20 city skylines, CNNGo.com\". Retrieved 1 March 2011.\nJump up ^ \"Best Skyline Poll\". Retrieved 8 February 2008.\nJump up ^ Gramsbergen, Egbert; Paul Kazmierczak. \"The World's Best Skylines\". Archived from the original on 4 February 2008. Retrieved 8 February 2008.\nJump up ^ \"Declared Monuments in Hong Kong – Hong Kong Island\". Leisure and Cultural Services Department, Hong Kong Government. 13 January 2010. Retrieved 31 August 2010.\nJump up ^ \"Declared Monuments in Hong Kong – Kowloon Island\". Leisure and Cultural Services Department, Hong Kong Government. 13 January 2010. Retrieved 31 August 2010.\nJump up ^ Sinn, Elizabeth (1990). \"Kowloon Walled City: Its Origin and Early History\" (PDF). Journal of the Hong Kong Branch of the Royal Asiatic Society. 27: 30–31. Archived from the original (PDF) on 17 May 2016. Retrieved 20 June 2012.\nJump up ^ \"Tamar Development Project\". Hong Kong Government. 23 April 2010. Archived from the original on 28 May 2010. Retrieved 17 September 2010.\nJump up ^ \"Central Waterfront Design Competition\". Designing Hong Kong. Retrieved 26 April 2008.\nJump up ^ \"West Kowloon Cultural District Public Engagement Exercise\". Home Affairs Bureau, Hong Kong Government. 26 August 2008. Archived from the original on 11 April 2008. Retrieved 6 October 2010.\nJump up ^ \"Kai Tak building height restrictions lifted\". Hong Kong Government. 10 July 1998. Retrieved 26 April 2008.\nSources\nBard, Solomon, ed. (2002). Voices from the Past: Hong Kong, 1842–1918. Hong Kong University Press.\nEndacott, G. B. (1964). An Eastern Entrepot: A Collection of Documents Illustrating the History of Hong Kong. Her Majesty's Stationery Office. p. 293. ASIN B0007J07G6. OCLC 632495979.\nHanstedt, Paul (2012). Hong Konged: One Modern American Family's (Mis)adventures in the Gateway to China. Avon, Massachusetts: Adams Media. ISBN 978-1-4405-4073-8.\nTsang, Steve (1995). Government and Politics: A Documentary History of Hong Kong. Hong Kong University Press. p. 312. ISBN 962-209-392-2.\nFurther reading\nBarrett, Dean, Hangman's Point, Hong Kong & southern China in 1857, Village East Books, ISBN 0-9661899-1-4, 1998\nCallick, Rowan. Comrades & Capitalists: Hong Kong since the Handover (University of New South Wales Press, 1998) online\nFu, Poshek; Deser, David (2002). The Cinema of Hong Kong: History, Arts, Identity. Cambridge University Press. p. 346. ISBN 978-0-521-77602-8.\nLee, James. Housing, Home Ownership and Social Change in Hong Kong (1999)\nLui, Adam Yuen-chung (1990). Forts and Pirates – A History of Hong Kong. Hong Kong History Society. p. 114. ISBN 962-7489-01-8.\nLiu, Shuyong; Wang, Wenjiong; Chang, Mingyu (1997). An Outline History of Hong Kong. Foreign Languages Press. p. 291. ISBN 978-7-119-01946-8.\nNgo, Tak-Wing (1999). Hong Kong's History: State and Society Under Colonial Rule. Routledge. ISBN 978-0-415-20868-0.\nTsang, Steve (2007). A Modern History of Hong Kong. I. B. Tauris. ISBN 978-1-84511-419-0.\nWelsh, Frank (1993). A Borrowed place: the history of Hong Kong. Kodansha International. p. 624. ISBN 978-1-56836-002-7.\nExternal links\nFind more about\nHong Kong\nat Wikipedia's sister projects\nDefinitions from Wiktionary\nMedia from Commons\nNews from Wikinews\nQuotations from Wikiquote\nTexts from Wikisource\nTextbooks from Wikibooks\nTravel guide from Wikivoyage\nLearning resources from Wikiversity\nData from Wikidata\nHong Kong at UCB Libraries GovPubs\n\"Hong Kong\". The World Factbook. Central Intelligence Agency.\nHong Kong at DMOZ\nHong Kong from the BBC News\n Wikimedia Atlas of Hong Kong\n Geographic data related to Hong Kong at OpenStreetMap\nKey Development Forecasts for Hong Kong from International Futures\nGovernment\nGovHK Hong Kong SAR Government portal\nDiscover Hong Kong – Official site of the Hong Kong Tourism Board\nTrade\nWorld Bank Summary Trade Statistics Hong Kong\n[show]\nInternational membership\n[show]\nLanguages\n[show]\nPopulation\n[show] v t e\nCountries and dependencies of Asia\n[show] v t e\nChina Provincial-level divisions of the People's Republic of China\nCoordinates: 22.3°N 114.2°E\n\nAuthority control\t\nWorldCat Identities VIAF: 261062131 LCCN: n81001722 ISNI: 0000 0001 2179 3140 GND: 4025822-1 SUDOC: 027953920 BNF: cb11988563q (data) NLA: 36343200 NDL: 00563400\n\nCategories: Hong KongSouth ChinaSouth China SeaCities in ChinaChinese-speaking countries and territoriesEnglish-speaking countries and territoriesIndependent citiesMetropolitan areas of ChinaPearl River DeltaPopulated coastal places in Hong KongPopulated places established in 1842Port cities and towns in ChinaSpecial administrative regions of ChinaStates and territories established in 1997\nNavigation menu\nAabbcc1241\nAlerts (0)\nNotice (1)\nTalkSandboxPreferencesBetaWatchlistContributionsLog outArticleTalkReadView sourceView historyWatchSearch\n\nSearch Wikipedia\nGo\nMain page\nContents\nFeatured content\nCurrent events\nRandom article\nDonate to Wikipedia\nWikipedia store\nInteraction\nHelp\nAbout Wikipedia\nCommunity portal\nRecent changes\nContact page\nTools\nWhat links here\nRelated changes\nUpload file\nSpecial pages\nPermanent link\nPage information\nWikidata item\nCite this page\nPrint/export\nCreate a book\nDownload as PDF\nPrintable version\nIn other projects\nWikimedia Commons\nWikibooks\nWikinews\nWikiquote\nWikisource\nWikivoyage\nLanguages\nAcèh\nAfrikaans\nAkan\nAlemannisch\nአማርኛ\nÆnglisc\nАҧсшәа\nالعربية\nAragonés\nঅসমীয়া\nAsturianu\nAzərbaycanca\nتۆرکجه\nBamanankan\nবাংলা\nBân-lâm-gú\nBasa Banyumasan\nБашҡортса\nБеларуская\nБеларуская (тарашкевіца)‎\nभोजपुरी\nBikol Central\nBislama\nБългарски\nBoarisch\nབོད་ཡིག\nBosanski\nBrezhoneg\nБуряад\nCatalà\nЧӑвашла\nCebuano\nČeština\nChi-Chewa\nCymraeg\nDansk\nDeutsch\nދިވެހިބަސް\nEesti\nΕλληνικά\nEspañol\nEsperanto\nEstremeñu\nEuskara\nEʋegbe\nفارسی\nFiji Hindi\nFøroyskt\nFrançais\nFrysk\nGaeilge\nGagauz\nGàidhlig\nGalego\n贛語\nGĩkũyũ\nગુજરાતી\n客家語/Hak-kâ-ngî\nХальмг\n한국어\nHausa\nՀայերեն\nहिन्दी\nHrvatski\nIdo\nIgbo\nIlokano\nবিষ্ণুপ্রিয়া মণিপুরী\nBahasa Indonesia\nInterlingua\nInterlingue\nИрон\nIsiXhosa\nIsiZulu\nÍslenska\nItaliano\nעברית\nBasa Jawa\nKalaallisut\nಕನ್ನಡ\nKapampangan\nქართული\nҚазақша\nKernowek\nKinyarwanda\nKiswahili\nKreyòl ayisyen\nKurdî\nКыргызча\nЛезги\nລາວ\nلۊری شومالی\nLatina\nLatviešu\nLëtzebuergesch\nLietuvių\nLigure\nLimburgs\nLingála\nLumbaart\nMagyar\nमैथिली\nМакедонски\nMalagasy\nമലയാളം\nMāori\nमराठी\nმარგალური\nمصرى\nمازِرونی\nBahasa Melayu\nBaso Minangkabau\nMìng-dĕ̤ng-ngṳ̄\nМонгол\nမြန်မာဘာသာ\nNāhuatl\nNederlands\nनेपाली\nनेपाल भाषा\n日本語\nNapulitano\nНохчийн\nNorsk\nNorsk nynorsk\nNovial\nOccitan\nОлык марий\nଓଡ଼ିଆ\nOʻzbekcha/ўзбекча\nਪੰਜਾਬੀ\nپنجابی\nPapiamentu\nپښتو\nPatois\nភាសាខ្មែរ\nPiemontèis\nPlattdüütsch\nPolski\nPortuguês\nQaraqalpaqsha\nRomână\nRuna Simi\nРусиньскый\nРусский\nСаха тыла\nसंस्कृतम्\nScots\nSesotho\nSetswana\nShqip\nSicilianu\nසිංහල\nSimple English\nSlovenčina\nSlovenščina\nŚlůnski\nSoomaaliga\nکوردی\nСрпски / srpski\nSrpskohrvatski / српскохрватски\nBasa Sunda\nSuomi\nSvenska\nTagalog\nதமிழ்\nTarandíne\nТатарча/tatarça\nతెలుగు\nไทย\nТоҷикӣ\nTsetsêhestâhese\nTürkçe\nTürkmençe\nУкраїнська\nاردو\nئۇيغۇرچە / Uyghurche\nVahcuengh\nVèneto\nVepsän kel’\nTiếng Việt\nVolapük\nWalon\n文言\nWinaray\nWolof\n吴语\nייִדיש\nYorùbá\n粵語\nZazaki\nŽemaitėška\n中文\nडोटेली\nKabɩyɛ\nEdit links\nThis page was last edited on 16 September 2017, at 03:31.\nText is available under the Creative Commons Attribution-ShareAlike License; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy. Wikipedia® is a registered trademark of the Wikimedia Foundation, Inc., a non-profit organization.\nPrivacy policyAbout WikipediaDisclaimersContact WikipediaDevelopersCookie statementMobile viewWikimedia Foundation Powered by MediaWiki\n",
			"date_added": 1505615329080,
			"slug": "%e9%a6%99%e6%b8%af"
		},
		{
			"id": "6fbc7d50-95e6-11e7-91ec-4f68e74565c1",
			"body": "以下列出目前为止已知可用的 Zeronet 代理\n\n=== working ===\n\nhttp://www.kittyseedbox.tk:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D\n\n=== no longer work ===\n\nhttps://zeroml.ml/\n  国内主机 上行1Mbps 下行4Mbps 1G RAM 40G硬盘 单核CPU\n  使用赛风作为Tor的前置代理\n  系统 Windows Server 2012 R2 Standard (x64)",
			"date_added": 1505020260773,
			"slug": "zeronet%e4%bb%a3%e7%90%86"
		},
		{
			"id": "5d842ed0-95e6-11e7-9638-55dccbe5484a",
			"body": "以下列出目前为止已知可用的 Zeronet 代理\n\n=== working ===\n\nhttp://www.kittyseedbox.tk:43110/\n\n=== no longer work ===\n\nhttps://zeroml.ml/\n  国内主机 上行1Mbps 下行4Mbps 1G RAM 40G硬盘 单核CPU\n  使用赛风作为Tor的前置代理\n  系统 Windows Server 2012 R2 Standard (x64)",
			"date_added": 1505020230205,
			"slug": "zeronet%e4%bb%a3%e7%90%86"
		},
		{
			"id": "57d0d510-95e6-11e7-9638-55dccbe5484a",
			"body": "以下列出目前为止已知可用的 Zeronet 代理\n\n=== working ===\nhttp://www.kittyseedbox.tk:43110/<url>\n\n=== no longer work ===\nhttps://zeroml.ml/\n  国内主机 上行1Mbps 下行4Mbps 1G RAM 40G硬盘 单核CPU\n  使用赛风作为Tor的前置代理\n  系统 Windows Server 2012 R2 Standard (x64)",
			"date_added": 1505020220641,
			"slug": "zeronet%e4%bb%a3%e7%90%86"
		},
		{
			"id": "79687440-927f-11e7-a617-5f34c121c9c9",
			"body": "“伪娘”是源自于日本ACGN界，泛指一切自然非加工或通过人为手段（如女装，化妆等）达到让他人被误认为是女性效果的男性角色。同时也是少数男性异装癖患者的经典病状体现。伪娘拥有女性的美丽相貌、身材，同时拥有男女两性魅力。通常他们在穿着女性服饰或进行女性化的打扮后带有极强的萌属性，有的可能更胜一般女性角色。随着伪娘角色的日益增多，越来越多的动漫爱好者开始喜欢伪娘角色。\n\nExample can be found here: http://127.0.0.1:43110/nekox.bit/",
			"date_added": 1504646185349,
			"slug": "%e4%bc%aa%e5%a8%98"
		},
		{
			"id": "23bb5d90-9073-11e7-8af2-cb5748032af4",
			"body": "其實是男孩子\n\n(clone from https://zh.wikipedia.org/wiki/%E7%95%B0%E8%A3%9D at Sep 03, 2017)\n\n異裝[编辑]\n维基百科，自由的百科全书\n\n本条目當前標題「異裝」為暫定名稱，可能原創、不準確或者具爭議性。候補建議標題為「異裝癖」。其他建議標題為：「異性裝」。 \n請注意現時使用這個名稱並不代表對其認可，應先進行討論，待取得共識後，再考量是否維持原狀或更名（移動）至更適合的標題。\n\n美国反串演员Julian Eltinge\n\n穿花童装的男童\nicon\t跨性别主题\n本文介紹的是裝扮成異性的扮裝行為。關於單純的扮妝，詳見「化妝」。而關於軍事上或生物融入環境的隱藏行為，請見「偽裝」。\n異裝又稱易服、易裝、變裝，是人類一項受予複雜解釋的行為，指任何人為任何理由、動機穿著「被視為屬於另一個性別」的服裝，有時也會搭配化妝。成語「易弁而釵」就是男扮女裝的意思。而實際是男性的偽娘雖不一定要變裝，但也常透過這樣的裝扮來表現自己或更突顯女性美。如果連容貌也改變成特定的異性，則進入到易容的範疇。\n有異裝行為的人，可概稱為較中性用語的異裝者（變裝者、易裝者、扮裝者）；而喜歡異裝或有此癖好者，則被稱為異裝癖（易服癖、變裝癖、易裝癖、異性裝扮癖）或戀異性裝癖。許多行為雖然看似相同，但因人而異而常會有不同的成因理解和行為解釋，因此這些稱呼其明確的定義頗為模糊。常見的狀況為工作於特定職業的反串行為（尤其是演員）、跨性別者基於性別認同而成為「異裝者」，或是對異性服裝的戀物情節所產生的異裝。\n目录  [隐藏] \n1\t異裝的動機\n2\t有關「跨性別」之「性別認同」所作的裝扮\n3\t戀異性裝癖者\n4\t職業與異裝\n4.1\t演員與表演\n4.2\t特種行業\n5\t掩飾身份的異裝\n6\t衍生的社會問題\n7\t各地法令\n7.1\t 新加坡\n7.2\t 伊朗\n8\t參考文獻\n異裝的動機[编辑]\n由於人、理由、性別、衣物都相當的複雜多變，因此異裝也是相當複雜多變。很多人異裝並不是為了性或是戀物癖的理由。同樣的，儘管異裝也是一種跨性別的行為，不是每一個異裝的人都有跨性別的感覺或認同。甚至一種行為是否是異裝也很複雜，例如某些人認為男性穿耳洞戴耳環是異裝（他們所處環境之風氣只有女士才戴耳環而又默認之故引申出此念），某些人卻認為不是，這兩類人對異裝的定義就不同。這很視乎於社會與民俗對於衣著所造就的風氣與潮流。\n異裝一詞的意義未必與理由無關。像是某些跨性別者就把異裝當作一種身份、認同。異裝一詞的意義甚至也不限於性別，也有Cosplay、角色扮演、化粧舞會扮演行為等意思。於舞會、化妝舞會等類似場合上，以一特定時代地點、階級、歷史或虛擬的人物為主題的服裝打扮，也是變裝的一種。[1]\n研究異裝的理由、動機有不少問題。歷史上的異裝案例，除非是明顯與一個特定事件有關，或由異裝者刻意強調其異裝動機，通常都很難確定異裝者之動機。而且現在作出的性別分類，像是同性戀、跨性別，在過去的異裝案例上未必有意義。而且即使在現在，異裝的人的動機也很難確定，常出現說法反覆的情形。\n有關「跨性別」之「性別認同」所作的裝扮[编辑]\n某些人是為自身的性別認同認同另一個性別而穿著與生理性別不同的衣物。像是某些跨性別者就覺得在日常生活中與人交流時為求心安理得與自在，而穿著心理認同性別的衣物，以表達自己正確的心理性別，繼而在自己與他人交流時希望他人適度按照「男女社群話題之異」來相應調整話題。\n跨性別包括了許多次分類，比如變性者（transsexual）、異裝者（cross-dresser）、異裝症者（transvestites）、異裝國王（drag kings）與異裝皇后（drag queen）。\n通常戀異性裝癖者或是異裝癖（transvestic fetishist）不包含在這裡面，因為在大部分的情況下這並不是一個性別議題（gender issue）（不過在實踐上很難分）。\n在本文中為行文方便起見，異裝是指行為而與理由動機無關。但是異裝一詞的意義未必與理由無關。某些跨性別者就以「異裝」或是意義相關的CD（cross-dressing）、TV（transvestic）來稱呼相關的行為或人物。在此，異裝可說就是一種身分認同。\n戀異性裝癖者[编辑]\n人類異裝的動機，有因為性別認同障礙而異裝，也有因為純粹戀異性裝癖而異裝。戀異性裝癖不能劃到跨性別類别裡来，原因如下：\n跨性別者乃認為自己心理性別和生殖性別不一致，並基於在「社會普遍習慣把男女衣著風格作鮮明區分」的風氣下務求取得大眾對其內心真正性別即心理性別之認同，而穿著與生理性別不同的裝扮。他們對異性服飾並不會有慾望，假如人類都恢復一絲不掛，他們就不會再有異裝的需要和擔憂，故此以戀異性裝癖並不適用於判定到跨性別者上。\n戀異性裝癖的異裝則並非因為如跨性別者般其內心不認同自己的生殖性别，而是純粹迷戀該等服飾之功能以達求滿足自身性慾幻想之目的。\n很多戀異性裝癖者跟人間既有的刻板印象不同，不是跨性別也不是同性戀。而許多人就只是單純把自己定義為跨性別者，儘管他們也可能符合以上所述的其中一個分類。\n職業與異裝[编辑]\n職業有時會使工作者作出異裝行為，像是台灣沒有男用絲襪，某些需要長時間站立的男性工作者就會穿上女用絲襪或褲襪。\n演員與表演[编辑]\n主条目：反串\n男演員演出女性角色在中國傳統戲劇中有悠久的歷史。京劇大師梅蘭芳就以此聞名。民國初年開始有女演員演出男性角色，粵劇名伶任劍輝就是經常扮演男角的女演員。演員扮演異性角色稱為反串。中華人民共和國的第一任國務院總理周恩來在就讀天津市南開中學的時期，曾參與「南開新劇」（南開中學的話劇團隊），並多次反串飾演女性角色。[2]\n而較知名的男扮女演員則計有香港已故藝人張國榮，其異裝動機乃基於在「社會普遍習慣把男女衣著風格作鮮明區分」的風氣下務求以衣著風格取得大眾對其心理性別和戀愛傾向的認知與認同。在長江七號電影中，周星馳的契女徐嬌、黄蕾和姚文雪反串演出男性角色[3][4][5]；而韓永華則反串演出女性角色[6]。\n在台灣綜藝界也有很多例子，並且用中國傳統戲劇中的「反串」一語來指異裝。在電視界中像是藝人陽帆扮的「楊婆婆」，澎恰恰與許效舜主持的「鐵獅玉玲瓏」，還有藝人大炳的表演都是很有名的反串。在某些餐廳秀中，第三性是一吸引人的主題。\n在泰國，以「泰國變性女人」為主題的表演早已是國際馳名。\n在日本，1914年成立的寶塚歌劇團則以女演員演出男性角色聞名。日本組合「昭和時代」模仿韓國青春洋溢的組合「少女時代」，全都是由男生反串。\n在韓國，組合「Boy's Day」模仿「Girl's Day」，同樣全都是由男生反串。[7]\n在香港，著名DJ葛民輝於電台節目上不時化身「娟姨」與聽眾談天。另外，母親的抉擇角色轉換系列宣傳片中，男生反串扮演未婚媽媽，以體現女生所受的傷害。\n在西方戏剧历史上也有类似反串的传统，例如仲夏夜之梦。\n特種行業[编辑]\n在台灣「特種行業」，有所謂的「第三性公關」，是由男士穿著典型女裝，再作坐檯的「小姐」。\n掩飾身份的異裝[编辑]\n中國古代民間傳奇人物花木蘭女扮男裝代父從軍的故事家喻戶曉，文學作品中亦有不少女扮男裝的女性形象，例如祝英台女扮男裝讀書。\n衍生的社會問題[编辑]\n有些女性則認為男性易服後難以單從服飾被辨認其生理性別，從而增加她們遇到男性非禮時防範上的困難，情況如同「披上羊皮的狼」，然而並沒有足夠資料證據顯示，異裝者有較高比例為性騷擾加害者，大多數加害者往往外表上都符合於主流社會認知，將服裝穿扮視為增加性騷擾防範困擾的說法顯得牽強。所以男性也應該用女性穿男裝會性騷擾男性然後再嫁禍給男同性戀者為理由來禁止女性穿男裝。\n然而在有些地方設有禁止人民作異性典型打扮的法律，以減少可能出現的風化案件。而如果異裝行為對別人構成不安，執法機關也有可能以遊蕩罪或類似罪名向異裝者提出告訴。\n各地法令[编辑]\n 新加坡[编辑]\n新加坡法律曾經以當今社會兩性著裝習慣為規範訂立法律，並強制所有於其境內外出現或駐留的人士遵守，把「社會普遍習慣把男女衣著打扮風格作鮮明區分」的風氣貫徹硬性執行，例子有：\n規定男士頭側頭髮長度不得足以蓋住耳朵及膊[8]，而在公眾場所亦時常有「長髮男子不受歡迎」等告示；\n規定男士不得穿著修裁標緻的衣衫、裙子、絲襪、褲襪、高跟鞋等「被視為屬於女性穿著」的服裝；\n規定男士不得佩戴耳環與任何標緻飾物等「被視為屬於女性佩戴」的飾物。\n新加坡境內任何民眾儀容一旦未符合上述所有規定者即屬違法。\n著名日本音樂大師喜多郎曾因為在新加坡機場辦理入境手續時留長髮，與新加坡政府對男士的儀容規範不符，就被拒絕入境，而其專場音樂會也因此被迫取消。[9][10]\n 伊朗[编辑]\n伊朗政府當局在2010年7月也頒佈了男性人員的髮型指引，把留馬尾等長髮、 龐克髮型等男性人員予以法辦著令剪短。[11][12]\n參考文獻[编辑]\n跳转 ^ 藝術與建築索引典－化妝舞會裝 於2011年3月31日查閱\n跳转 ^ 天津市南開中學校史館內\n跳转 ^ 《長江七號》「星光幫」──徐嬌\n跳转 ^ 《長江七號》「星光幫」── 黃蕾\n跳转 ^ 《長江七號》「星光幫」──姚文雪\n跳转 ^ 《長江七號》「星光幫」──韓永華\n跳转 ^ MBC《Show! 音樂中心》400期特輯\n跳转 ^ Males with long hair will be attended to last\n跳转 ^ 中國寧波網──淺談新加坡鞭刑\n跳转 ^ 楊本禮：《人生品味品味人生》第169頁；臺灣商務印書館出版，2006\n跳转 ^ Telegraph: Iran government issues style guide for men's hair\n跳转 ^ 中國評論新聞網：伊朗政府發佈男性標準髮型　短髮受推崇\n\t维基共享资源中相关的多媒体资源：異裝\n[隐藏] 查 论 编\n性別和性身份\n性別認同\t\n性别\n雄性 雌性 雙性 男性 女性 中性 無性别 双性别 三性别 Boi 順性別 性別酷兒 Girlfag Guydyke 性別流体 泛性别 跨性別 跨性別男性 跨性別女性 變性 Womyn\n第三性別/三種性別\n第三性 Akava'ine Androgynos Bakla Bissu Burnesha 閹人 Fa'afafine Fakaleiti Femminiello Galli 雌雄間性 海吉拉 泰國變性女性 變性人 泰國變性人 Khanith Köçek Koekchuch Mahu Maknyah Mukhannathun Muxe Sworn virgin Takatāpui 中國的變性 新加坡的變性 Transgender in film and television 伊朗的變性 Travesti Tumtum 雙靈 Winkte 人妖 女雄 男雌\n性取向\n认同\t\n性取向\n异性戀 同性戀（男同性戀 · 女同性戀） 單性戀 双性戀 無性戀 泛性戀 非異性戀\n非二元\n男性戀和女性戀 泛性戀 多邊戀 多性戀 半性戀 第三性 雙靈\n其他\n變性戀 Banjee Bi-curious 脫離同性戀 Ex-ex-gay Heteroflexible 金賽量表 物戀 酷兒 疑性恋 Romantic orientation Same gender loving 順性別 Banjee\n參見\t\nErotic target location error 男性戀和女性戀 性別不安症 性别角色 性别社会学 女女性行為 男男性行為 酷兒文化 異裝 性別定型 性别研究\nLGBT主题 性主题 性別研究\n分类：異裝",
			"date_added": 1504420985321,
			"slug": "%e5%a5%b3%e8%a3%85%e5%ad%90"
		},
		{
			"id": "168d5790-9073-11e7-8af2-cb5748032af4",
			"body": "其實是男孩子\n\n(clone from wiki chinese version at Sep 03, 2017)\n\n異裝[编辑]\n维基百科，自由的百科全书\n\n本条目當前標題「異裝」為暫定名稱，可能原創、不準確或者具爭議性。候補建議標題為「異裝癖」。其他建議標題為：「異性裝」。 \n請注意現時使用這個名稱並不代表對其認可，應先進行討論，待取得共識後，再考量是否維持原狀或更名（移動）至更適合的標題。\n\n美国反串演员Julian Eltinge\n\n穿花童装的男童\nicon\t跨性别主题\n本文介紹的是裝扮成異性的扮裝行為。關於單純的扮妝，詳見「化妝」。而關於軍事上或生物融入環境的隱藏行為，請見「偽裝」。\n異裝又稱易服、易裝、變裝，是人類一項受予複雜解釋的行為，指任何人為任何理由、動機穿著「被視為屬於另一個性別」的服裝，有時也會搭配化妝。成語「易弁而釵」就是男扮女裝的意思。而實際是男性的偽娘雖不一定要變裝，但也常透過這樣的裝扮來表現自己或更突顯女性美。如果連容貌也改變成特定的異性，則進入到易容的範疇。\n有異裝行為的人，可概稱為較中性用語的異裝者（變裝者、易裝者、扮裝者）；而喜歡異裝或有此癖好者，則被稱為異裝癖（易服癖、變裝癖、易裝癖、異性裝扮癖）或戀異性裝癖。許多行為雖然看似相同，但因人而異而常會有不同的成因理解和行為解釋，因此這些稱呼其明確的定義頗為模糊。常見的狀況為工作於特定職業的反串行為（尤其是演員）、跨性別者基於性別認同而成為「異裝者」，或是對異性服裝的戀物情節所產生的異裝。\n目录  [隐藏] \n1\t異裝的動機\n2\t有關「跨性別」之「性別認同」所作的裝扮\n3\t戀異性裝癖者\n4\t職業與異裝\n4.1\t演員與表演\n4.2\t特種行業\n5\t掩飾身份的異裝\n6\t衍生的社會問題\n7\t各地法令\n7.1\t 新加坡\n7.2\t 伊朗\n8\t參考文獻\n異裝的動機[编辑]\n由於人、理由、性別、衣物都相當的複雜多變，因此異裝也是相當複雜多變。很多人異裝並不是為了性或是戀物癖的理由。同樣的，儘管異裝也是一種跨性別的行為，不是每一個異裝的人都有跨性別的感覺或認同。甚至一種行為是否是異裝也很複雜，例如某些人認為男性穿耳洞戴耳環是異裝（他們所處環境之風氣只有女士才戴耳環而又默認之故引申出此念），某些人卻認為不是，這兩類人對異裝的定義就不同。這很視乎於社會與民俗對於衣著所造就的風氣與潮流。\n異裝一詞的意義未必與理由無關。像是某些跨性別者就把異裝當作一種身份、認同。異裝一詞的意義甚至也不限於性別，也有Cosplay、角色扮演、化粧舞會扮演行為等意思。於舞會、化妝舞會等類似場合上，以一特定時代地點、階級、歷史或虛擬的人物為主題的服裝打扮，也是變裝的一種。[1]\n研究異裝的理由、動機有不少問題。歷史上的異裝案例，除非是明顯與一個特定事件有關，或由異裝者刻意強調其異裝動機，通常都很難確定異裝者之動機。而且現在作出的性別分類，像是同性戀、跨性別，在過去的異裝案例上未必有意義。而且即使在現在，異裝的人的動機也很難確定，常出現說法反覆的情形。\n有關「跨性別」之「性別認同」所作的裝扮[编辑]\n某些人是為自身的性別認同認同另一個性別而穿著與生理性別不同的衣物。像是某些跨性別者就覺得在日常生活中與人交流時為求心安理得與自在，而穿著心理認同性別的衣物，以表達自己正確的心理性別，繼而在自己與他人交流時希望他人適度按照「男女社群話題之異」來相應調整話題。\n跨性別包括了許多次分類，比如變性者（transsexual）、異裝者（cross-dresser）、異裝症者（transvestites）、異裝國王（drag kings）與異裝皇后（drag queen）。\n通常戀異性裝癖者或是異裝癖（transvestic fetishist）不包含在這裡面，因為在大部分的情況下這並不是一個性別議題（gender issue）（不過在實踐上很難分）。\n在本文中為行文方便起見，異裝是指行為而與理由動機無關。但是異裝一詞的意義未必與理由無關。某些跨性別者就以「異裝」或是意義相關的CD（cross-dressing）、TV（transvestic）來稱呼相關的行為或人物。在此，異裝可說就是一種身分認同。\n戀異性裝癖者[编辑]\n人類異裝的動機，有因為性別認同障礙而異裝，也有因為純粹戀異性裝癖而異裝。戀異性裝癖不能劃到跨性別類别裡来，原因如下：\n跨性別者乃認為自己心理性別和生殖性別不一致，並基於在「社會普遍習慣把男女衣著風格作鮮明區分」的風氣下務求取得大眾對其內心真正性別即心理性別之認同，而穿著與生理性別不同的裝扮。他們對異性服飾並不會有慾望，假如人類都恢復一絲不掛，他們就不會再有異裝的需要和擔憂，故此以戀異性裝癖並不適用於判定到跨性別者上。\n戀異性裝癖的異裝則並非因為如跨性別者般其內心不認同自己的生殖性别，而是純粹迷戀該等服飾之功能以達求滿足自身性慾幻想之目的。\n很多戀異性裝癖者跟人間既有的刻板印象不同，不是跨性別也不是同性戀。而許多人就只是單純把自己定義為跨性別者，儘管他們也可能符合以上所述的其中一個分類。\n職業與異裝[编辑]\n職業有時會使工作者作出異裝行為，像是台灣沒有男用絲襪，某些需要長時間站立的男性工作者就會穿上女用絲襪或褲襪。\n演員與表演[编辑]\n主条目：反串\n男演員演出女性角色在中國傳統戲劇中有悠久的歷史。京劇大師梅蘭芳就以此聞名。民國初年開始有女演員演出男性角色，粵劇名伶任劍輝就是經常扮演男角的女演員。演員扮演異性角色稱為反串。中華人民共和國的第一任國務院總理周恩來在就讀天津市南開中學的時期，曾參與「南開新劇」（南開中學的話劇團隊），並多次反串飾演女性角色。[2]\n而較知名的男扮女演員則計有香港已故藝人張國榮，其異裝動機乃基於在「社會普遍習慣把男女衣著風格作鮮明區分」的風氣下務求以衣著風格取得大眾對其心理性別和戀愛傾向的認知與認同。在長江七號電影中，周星馳的契女徐嬌、黄蕾和姚文雪反串演出男性角色[3][4][5]；而韓永華則反串演出女性角色[6]。\n在台灣綜藝界也有很多例子，並且用中國傳統戲劇中的「反串」一語來指異裝。在電視界中像是藝人陽帆扮的「楊婆婆」，澎恰恰與許效舜主持的「鐵獅玉玲瓏」，還有藝人大炳的表演都是很有名的反串。在某些餐廳秀中，第三性是一吸引人的主題。\n在泰國，以「泰國變性女人」為主題的表演早已是國際馳名。\n在日本，1914年成立的寶塚歌劇團則以女演員演出男性角色聞名。日本組合「昭和時代」模仿韓國青春洋溢的組合「少女時代」，全都是由男生反串。\n在韓國，組合「Boy's Day」模仿「Girl's Day」，同樣全都是由男生反串。[7]\n在香港，著名DJ葛民輝於電台節目上不時化身「娟姨」與聽眾談天。另外，母親的抉擇角色轉換系列宣傳片中，男生反串扮演未婚媽媽，以體現女生所受的傷害。\n在西方戏剧历史上也有类似反串的传统，例如仲夏夜之梦。\n特種行業[编辑]\n在台灣「特種行業」，有所謂的「第三性公關」，是由男士穿著典型女裝，再作坐檯的「小姐」。\n掩飾身份的異裝[编辑]\n中國古代民間傳奇人物花木蘭女扮男裝代父從軍的故事家喻戶曉，文學作品中亦有不少女扮男裝的女性形象，例如祝英台女扮男裝讀書。\n衍生的社會問題[编辑]\n有些女性則認為男性易服後難以單從服飾被辨認其生理性別，從而增加她們遇到男性非禮時防範上的困難，情況如同「披上羊皮的狼」，然而並沒有足夠資料證據顯示，異裝者有較高比例為性騷擾加害者，大多數加害者往往外表上都符合於主流社會認知，將服裝穿扮視為增加性騷擾防範困擾的說法顯得牽強。所以男性也應該用女性穿男裝會性騷擾男性然後再嫁禍給男同性戀者為理由來禁止女性穿男裝。\n然而在有些地方設有禁止人民作異性典型打扮的法律，以減少可能出現的風化案件。而如果異裝行為對別人構成不安，執法機關也有可能以遊蕩罪或類似罪名向異裝者提出告訴。\n各地法令[编辑]\n 新加坡[编辑]\n新加坡法律曾經以當今社會兩性著裝習慣為規範訂立法律，並強制所有於其境內外出現或駐留的人士遵守，把「社會普遍習慣把男女衣著打扮風格作鮮明區分」的風氣貫徹硬性執行，例子有：\n規定男士頭側頭髮長度不得足以蓋住耳朵及膊[8]，而在公眾場所亦時常有「長髮男子不受歡迎」等告示；\n規定男士不得穿著修裁標緻的衣衫、裙子、絲襪、褲襪、高跟鞋等「被視為屬於女性穿著」的服裝；\n規定男士不得佩戴耳環與任何標緻飾物等「被視為屬於女性佩戴」的飾物。\n新加坡境內任何民眾儀容一旦未符合上述所有規定者即屬違法。\n著名日本音樂大師喜多郎曾因為在新加坡機場辦理入境手續時留長髮，與新加坡政府對男士的儀容規範不符，就被拒絕入境，而其專場音樂會也因此被迫取消。[9][10]\n 伊朗[编辑]\n伊朗政府當局在2010年7月也頒佈了男性人員的髮型指引，把留馬尾等長髮、 龐克髮型等男性人員予以法辦著令剪短。[11][12]\n參考文獻[编辑]\n跳转 ^ 藝術與建築索引典－化妝舞會裝 於2011年3月31日查閱\n跳转 ^ 天津市南開中學校史館內\n跳转 ^ 《長江七號》「星光幫」──徐嬌\n跳转 ^ 《長江七號》「星光幫」── 黃蕾\n跳转 ^ 《長江七號》「星光幫」──姚文雪\n跳转 ^ 《長江七號》「星光幫」──韓永華\n跳转 ^ MBC《Show! 音樂中心》400期特輯\n跳转 ^ Males with long hair will be attended to last\n跳转 ^ 中國寧波網──淺談新加坡鞭刑\n跳转 ^ 楊本禮：《人生品味品味人生》第169頁；臺灣商務印書館出版，2006\n跳转 ^ Telegraph: Iran government issues style guide for men's hair\n跳转 ^ 中國評論新聞網：伊朗政府發佈男性標準髮型　短髮受推崇\n\t维基共享资源中相关的多媒体资源：異裝\n[隐藏] 查 论 编\n性別和性身份\n性別認同\t\n性别\n雄性 雌性 雙性 男性 女性 中性 無性别 双性别 三性别 Boi 順性別 性別酷兒 Girlfag Guydyke 性別流体 泛性别 跨性別 跨性別男性 跨性別女性 變性 Womyn\n第三性別/三種性別\n第三性 Akava'ine Androgynos Bakla Bissu Burnesha 閹人 Fa'afafine Fakaleiti Femminiello Galli 雌雄間性 海吉拉 泰國變性女性 變性人 泰國變性人 Khanith Köçek Koekchuch Mahu Maknyah Mukhannathun Muxe Sworn virgin Takatāpui 中國的變性 新加坡的變性 Transgender in film and television 伊朗的變性 Travesti Tumtum 雙靈 Winkte 人妖 女雄 男雌\n性取向\n认同\t\n性取向\n异性戀 同性戀（男同性戀 · 女同性戀） 單性戀 双性戀 無性戀 泛性戀 非異性戀\n非二元\n男性戀和女性戀 泛性戀 多邊戀 多性戀 半性戀 第三性 雙靈\n其他\n變性戀 Banjee Bi-curious 脫離同性戀 Ex-ex-gay Heteroflexible 金賽量表 物戀 酷兒 疑性恋 Romantic orientation Same gender loving 順性別 Banjee\n參見\t\nErotic target location error 男性戀和女性戀 性別不安症 性别角色 性别社会学 女女性行為 男男性行為 酷兒文化 異裝 性別定型 性别研究\nLGBT主题 性主题 性別研究\n分类：異裝",
			"date_added": 1504420963209,
			"slug": "%e5%a5%b3%e8%a3%85%e5%ad%90"
		},
		{
			"id": "04a28cd0-9073-11e7-8af2-cb5748032af4",
			"body": "难道是男孩子\n\n(clone from wiki chinese version at Sep 03, 2017)\n異裝[编辑]\n维基百科，自由的百科全书\n\n本条目當前標題「異裝」為暫定名稱，可能原創、不準確或者具爭議性。候補建議標題為「異裝癖」。其他建議標題為：「異性裝」。 \n請注意現時使用這個名稱並不代表對其認可，應先進行討論，待取得共識後，再考量是否維持原狀或更名（移動）至更適合的標題。\n\n美国反串演员Julian Eltinge\n\n穿花童装的男童\nicon\t跨性别主题\n本文介紹的是裝扮成異性的扮裝行為。關於單純的扮妝，詳見「化妝」。而關於軍事上或生物融入環境的隱藏行為，請見「偽裝」。\n異裝又稱易服、易裝、變裝，是人類一項受予複雜解釋的行為，指任何人為任何理由、動機穿著「被視為屬於另一個性別」的服裝，有時也會搭配化妝。成語「易弁而釵」就是男扮女裝的意思。而實際是男性的偽娘雖不一定要變裝，但也常透過這樣的裝扮來表現自己或更突顯女性美。如果連容貌也改變成特定的異性，則進入到易容的範疇。\n有異裝行為的人，可概稱為較中性用語的異裝者（變裝者、易裝者、扮裝者）；而喜歡異裝或有此癖好者，則被稱為異裝癖（易服癖、變裝癖、易裝癖、異性裝扮癖）或戀異性裝癖。許多行為雖然看似相同，但因人而異而常會有不同的成因理解和行為解釋，因此這些稱呼其明確的定義頗為模糊。常見的狀況為工作於特定職業的反串行為（尤其是演員）、跨性別者基於性別認同而成為「異裝者」，或是對異性服裝的戀物情節所產生的異裝。\n目录  [隐藏] \n1\t異裝的動機\n2\t有關「跨性別」之「性別認同」所作的裝扮\n3\t戀異性裝癖者\n4\t職業與異裝\n4.1\t演員與表演\n4.2\t特種行業\n5\t掩飾身份的異裝\n6\t衍生的社會問題\n7\t各地法令\n7.1\t 新加坡\n7.2\t 伊朗\n8\t參考文獻\n異裝的動機[编辑]\n由於人、理由、性別、衣物都相當的複雜多變，因此異裝也是相當複雜多變。很多人異裝並不是為了性或是戀物癖的理由。同樣的，儘管異裝也是一種跨性別的行為，不是每一個異裝的人都有跨性別的感覺或認同。甚至一種行為是否是異裝也很複雜，例如某些人認為男性穿耳洞戴耳環是異裝（他們所處環境之風氣只有女士才戴耳環而又默認之故引申出此念），某些人卻認為不是，這兩類人對異裝的定義就不同。這很視乎於社會與民俗對於衣著所造就的風氣與潮流。\n異裝一詞的意義未必與理由無關。像是某些跨性別者就把異裝當作一種身份、認同。異裝一詞的意義甚至也不限於性別，也有Cosplay、角色扮演、化粧舞會扮演行為等意思。於舞會、化妝舞會等類似場合上，以一特定時代地點、階級、歷史或虛擬的人物為主題的服裝打扮，也是變裝的一種。[1]\n研究異裝的理由、動機有不少問題。歷史上的異裝案例，除非是明顯與一個特定事件有關，或由異裝者刻意強調其異裝動機，通常都很難確定異裝者之動機。而且現在作出的性別分類，像是同性戀、跨性別，在過去的異裝案例上未必有意義。而且即使在現在，異裝的人的動機也很難確定，常出現說法反覆的情形。\n有關「跨性別」之「性別認同」所作的裝扮[编辑]\n某些人是為自身的性別認同認同另一個性別而穿著與生理性別不同的衣物。像是某些跨性別者就覺得在日常生活中與人交流時為求心安理得與自在，而穿著心理認同性別的衣物，以表達自己正確的心理性別，繼而在自己與他人交流時希望他人適度按照「男女社群話題之異」來相應調整話題。\n跨性別包括了許多次分類，比如變性者（transsexual）、異裝者（cross-dresser）、異裝症者（transvestites）、異裝國王（drag kings）與異裝皇后（drag queen）。\n通常戀異性裝癖者或是異裝癖（transvestic fetishist）不包含在這裡面，因為在大部分的情況下這並不是一個性別議題（gender issue）（不過在實踐上很難分）。\n在本文中為行文方便起見，異裝是指行為而與理由動機無關。但是異裝一詞的意義未必與理由無關。某些跨性別者就以「異裝」或是意義相關的CD（cross-dressing）、TV（transvestic）來稱呼相關的行為或人物。在此，異裝可說就是一種身分認同。\n戀異性裝癖者[编辑]\n人類異裝的動機，有因為性別認同障礙而異裝，也有因為純粹戀異性裝癖而異裝。戀異性裝癖不能劃到跨性別類别裡来，原因如下：\n跨性別者乃認為自己心理性別和生殖性別不一致，並基於在「社會普遍習慣把男女衣著風格作鮮明區分」的風氣下務求取得大眾對其內心真正性別即心理性別之認同，而穿著與生理性別不同的裝扮。他們對異性服飾並不會有慾望，假如人類都恢復一絲不掛，他們就不會再有異裝的需要和擔憂，故此以戀異性裝癖並不適用於判定到跨性別者上。\n戀異性裝癖的異裝則並非因為如跨性別者般其內心不認同自己的生殖性别，而是純粹迷戀該等服飾之功能以達求滿足自身性慾幻想之目的。\n很多戀異性裝癖者跟人間既有的刻板印象不同，不是跨性別也不是同性戀。而許多人就只是單純把自己定義為跨性別者，儘管他們也可能符合以上所述的其中一個分類。\n職業與異裝[编辑]\n職業有時會使工作者作出異裝行為，像是台灣沒有男用絲襪，某些需要長時間站立的男性工作者就會穿上女用絲襪或褲襪。\n演員與表演[编辑]\n主条目：反串\n男演員演出女性角色在中國傳統戲劇中有悠久的歷史。京劇大師梅蘭芳就以此聞名。民國初年開始有女演員演出男性角色，粵劇名伶任劍輝就是經常扮演男角的女演員。演員扮演異性角色稱為反串。中華人民共和國的第一任國務院總理周恩來在就讀天津市南開中學的時期，曾參與「南開新劇」（南開中學的話劇團隊），並多次反串飾演女性角色。[2]\n而較知名的男扮女演員則計有香港已故藝人張國榮，其異裝動機乃基於在「社會普遍習慣把男女衣著風格作鮮明區分」的風氣下務求以衣著風格取得大眾對其心理性別和戀愛傾向的認知與認同。在長江七號電影中，周星馳的契女徐嬌、黄蕾和姚文雪反串演出男性角色[3][4][5]；而韓永華則反串演出女性角色[6]。\n在台灣綜藝界也有很多例子，並且用中國傳統戲劇中的「反串」一語來指異裝。在電視界中像是藝人陽帆扮的「楊婆婆」，澎恰恰與許效舜主持的「鐵獅玉玲瓏」，還有藝人大炳的表演都是很有名的反串。在某些餐廳秀中，第三性是一吸引人的主題。\n在泰國，以「泰國變性女人」為主題的表演早已是國際馳名。\n在日本，1914年成立的寶塚歌劇團則以女演員演出男性角色聞名。日本組合「昭和時代」模仿韓國青春洋溢的組合「少女時代」，全都是由男生反串。\n在韓國，組合「Boy's Day」模仿「Girl's Day」，同樣全都是由男生反串。[7]\n在香港，著名DJ葛民輝於電台節目上不時化身「娟姨」與聽眾談天。另外，母親的抉擇角色轉換系列宣傳片中，男生反串扮演未婚媽媽，以體現女生所受的傷害。\n在西方戏剧历史上也有类似反串的传统，例如仲夏夜之梦。\n特種行業[编辑]\n在台灣「特種行業」，有所謂的「第三性公關」，是由男士穿著典型女裝，再作坐檯的「小姐」。\n掩飾身份的異裝[编辑]\n中國古代民間傳奇人物花木蘭女扮男裝代父從軍的故事家喻戶曉，文學作品中亦有不少女扮男裝的女性形象，例如祝英台女扮男裝讀書。\n衍生的社會問題[编辑]\n有些女性則認為男性易服後難以單從服飾被辨認其生理性別，從而增加她們遇到男性非禮時防範上的困難，情況如同「披上羊皮的狼」，然而並沒有足夠資料證據顯示，異裝者有較高比例為性騷擾加害者，大多數加害者往往外表上都符合於主流社會認知，將服裝穿扮視為增加性騷擾防範困擾的說法顯得牽強。所以男性也應該用女性穿男裝會性騷擾男性然後再嫁禍給男同性戀者為理由來禁止女性穿男裝。\n然而在有些地方設有禁止人民作異性典型打扮的法律，以減少可能出現的風化案件。而如果異裝行為對別人構成不安，執法機關也有可能以遊蕩罪或類似罪名向異裝者提出告訴。\n各地法令[编辑]\n 新加坡[编辑]\n新加坡法律曾經以當今社會兩性著裝習慣為規範訂立法律，並強制所有於其境內外出現或駐留的人士遵守，把「社會普遍習慣把男女衣著打扮風格作鮮明區分」的風氣貫徹硬性執行，例子有：\n規定男士頭側頭髮長度不得足以蓋住耳朵及膊[8]，而在公眾場所亦時常有「長髮男子不受歡迎」等告示；\n規定男士不得穿著修裁標緻的衣衫、裙子、絲襪、褲襪、高跟鞋等「被視為屬於女性穿著」的服裝；\n規定男士不得佩戴耳環與任何標緻飾物等「被視為屬於女性佩戴」的飾物。\n新加坡境內任何民眾儀容一旦未符合上述所有規定者即屬違法。\n著名日本音樂大師喜多郎曾因為在新加坡機場辦理入境手續時留長髮，與新加坡政府對男士的儀容規範不符，就被拒絕入境，而其專場音樂會也因此被迫取消。[9][10]\n 伊朗[编辑]\n伊朗政府當局在2010年7月也頒佈了男性人員的髮型指引，把留馬尾等長髮、 龐克髮型等男性人員予以法辦著令剪短。[11][12]\n參考文獻[编辑]\n跳转 ^ 藝術與建築索引典－化妝舞會裝 於2011年3月31日查閱\n跳转 ^ 天津市南開中學校史館內\n跳转 ^ 《長江七號》「星光幫」──徐嬌\n跳转 ^ 《長江七號》「星光幫」── 黃蕾\n跳转 ^ 《長江七號》「星光幫」──姚文雪\n跳转 ^ 《長江七號》「星光幫」──韓永華\n跳转 ^ MBC《Show! 音樂中心》400期特輯\n跳转 ^ Males with long hair will be attended to last\n跳转 ^ 中國寧波網──淺談新加坡鞭刑\n跳转 ^ 楊本禮：《人生品味品味人生》第169頁；臺灣商務印書館出版，2006\n跳转 ^ Telegraph: Iran government issues style guide for men's hair\n跳转 ^ 中國評論新聞網：伊朗政府發佈男性標準髮型　短髮受推崇\n\t维基共享资源中相关的多媒体资源：異裝\n[隐藏] 查 论 编\n性別和性身份\n性別認同\t\n性别\n雄性 雌性 雙性 男性 女性 中性 無性别 双性别 三性别 Boi 順性別 性別酷兒 Girlfag Guydyke 性別流体 泛性别 跨性別 跨性別男性 跨性別女性 變性 Womyn\n第三性別/三種性別\n第三性 Akava'ine Androgynos Bakla Bissu Burnesha 閹人 Fa'afafine Fakaleiti Femminiello Galli 雌雄間性 海吉拉 泰國變性女性 變性人 泰國變性人 Khanith Köçek Koekchuch Mahu Maknyah Mukhannathun Muxe Sworn virgin Takatāpui 中國的變性 新加坡的變性 Transgender in film and television 伊朗的變性 Travesti Tumtum 雙靈 Winkte 人妖 女雄 男雌\n性取向\n认同\t\n性取向\n异性戀 同性戀（男同性戀 · 女同性戀） 單性戀 双性戀 無性戀 泛性戀 非異性戀\n非二元\n男性戀和女性戀 泛性戀 多邊戀 多性戀 半性戀 第三性 雙靈\n其他\n變性戀 Banjee Bi-curious 脫離同性戀 Ex-ex-gay Heteroflexible 金賽量表 物戀 酷兒 疑性恋 Romantic orientation Same gender loving 順性別 Banjee\n參見\t\nErotic target location error 男性戀和女性戀 性別不安症 性别角色 性别社会学 女女性行為 男男性行為 酷兒文化 異裝 性別定型 性别研究\nLGBT主题 性主题 性別研究\n分类：異裝",
			"date_added": 1504420933149,
			"slug": "%e5%a5%b3%e8%a3%85%e5%ad%90"
		},
		{
			"id": "ec165ed0-9072-11e7-8af2-cb5748032af4",
			"body": "难道是男孩子\n_____edit_____\n(clone from wiki chinese version at Sep 03, 2017)\n{{Disputed title|alternate title=異裝癖|alternate titles=異性裝}}\n[[File:Julian Eltinge (the fascinating widow).jpg|250px|thumb|right|美国反串演员Julian Eltinge]]\n[[File:Flower Boy 2.jpg|250px|thumb|right|穿花童装的男童]]\n{{Portal|跨性别}}\n{{otheruses|subject=裝扮成異性的扮裝行為|other=單純的扮妝，詳見「'''[[化妝]]'''」。而關於軍事上或生物融入環境的隱藏行為|偽裝}}\n'''異裝'''又稱'''易服'''、'''易裝'''、'''變裝'''，是人類一項受予複雜解釋的行為，指任何人為任何理由、動機穿著「被視為屬於另一個[[性別]]」的服裝，有時也會搭配[[化妝]]。成語「易弁而釵」就是男扮女裝的意思。而實際是男性的[[偽娘]]雖不一定要變裝，但也常透過這樣的裝扮來表現自己或更突顯女性美。如果連容貌也改變成特定的異性，則進入到[[易容]]的範疇。\n\n有異裝行為的人，可概稱為較中性用語的'''異裝者'''（變裝者、易裝者、扮裝者）；而喜歡異裝或有此癖好者，則被稱為'''異裝癖'''（易服癖、變裝癖、易裝癖、異性裝扮癖）或'''戀異性裝癖'''。許多行為雖然看似相同，但因人而異而常會有不同的成因理解和行為解釋，因此這些稱呼其明確的定義頗為模糊。常見的狀況為工作於特定職業的[[反串]]行為（尤其是演員）、[[跨性別者]]基於[[性別認同]]而成為「異裝者」，或是對異性服裝的[[戀物癖|戀物情節]]所產生的異裝。\n",
			"date_added": 1504420891966,
			"slug": "%e5%a5%b3%e8%a3%85%e5%ad%90"
		}
	]
}