{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1560440259_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 1,
				"body": "I recommend not using NordVPN, from https://news.ycombinator.com/item?id=18609655\n\nEveryone in Vilnius, Lithuania knows, that both, NordVPN and ProtonVPN, are being developed here by the people related to Tesonet, which has been recently sued in Texas Eastern District Court for the patent infringement in \"Large-scale web data extraction products and services with residential proxy network ( https://oxylabs.io/ )\"[1] by Luminati Networks, an Israeli data mining company behind HolaVPN[2].\n\nThe section from the \"About\" page of Tesonet (26 Apr 2018)[3], which was suddenly removed in June 2018 after the connection between ProtonVPN and Tesonet was made public by the co-founder of PIA[4]:\n\n\"For the latest project, Tesonet is working together with an international brand from Switzerland to create a security product that helps users protect their network traffic. As part of this technical partnership, we are collaborating on datacenter and network infrastructure that can easily supply 10 Gbps worth of bandwidth to users around the world. The product is developed using the latest authentication encryption methods and the best practices in the security world.\"\n\nAs late as September 2018, NordVPN and ProtonVPN still become affected by the same extremely rare Windows security bugs at the same time[5], even though the CTO of ProtonMail claimed here on Hacker News, that they used Tesonet, a data mining company, for developing ProtonVPN, a free VPN service, only as \"an office space provider\"[6].\n\n[1] https://web.archive.org/web/20190613154045/http://litigation.maxval-ip.com/Litigation/DetailView?CaseID=Epee88Womxg%3D&logstat=false&Party=Luminati%20Networks%20Ltd.%20v.%20UAB%20Tesonet\n\n[2] http://fortune.com/2015/05/29/hola-luminati-vpn/\n\n[3] https://web.archive.org/web/20190613154045/https://web.archive.org/web/20180426161609/https://tesonet.com/about/\n\n[4] https://news.ycombinator.com/item?id=17258203\n\n[5] https://web.archive.org/web/20190613154045/https://www.pcmag.com/news/363619/protonvpn-and-nordvpn-bugs-left-windows-vulnerable-to-hacker\n\n[6] https://news.ycombinator.com/item?id=17258538",
				"added": 1560440470
			}
		],
		"1560432237_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 2,
				"body": "Doesn't matter, it's stored on the computers of all peers serving the site besides being accessible from a handful of proxies which are likely indexed by Javascript-enabled web crawlers which possibly includes Google as well.\n\nIt's not like this is a private network.",
				"added": 1560440907
			},
			{
				"comment_id": 5,
				"body": "> [daz](#comment_94_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): it is only porn that keeps the internet going\n\nRight ...",
				"added": 1560441359
			}
		],
		"1560347482_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 4,
				"body": "> [sheendocks](#comment_49_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): I don't think the Pope is an illuminati puppet\n\nI don't think he's a free agent either, can you give us a TLDR of the PDF?",
				"added": 1560441205
			}
		]
	},
	"comment_vote": {}
}