{"cert_user_id": "leycec@github", "next_comment_id": 11, "comment": {"1604064736_mirrored_HelloZeroNet_github": [{"comment_id": 1, "body": "@MuxZeroNet Thanks for the thorough synopsis of open questions! Several are currently under discussion at the [ZeroTalk thread](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_1Kr2JfCsBYQU1z96xQsYTshKvJ5nz4mTG3) for this topic.\r\n\r\nSince I'd prefer this clearnet issue serve as the central hub for this topic, I've taken the liberty of copying across a few of the more notable comments on that ZeroTalk thread. If this was unspeakably bad, just let me know and I'll remove the offending quotes.\r\n\r\n**Let's do this.**\r\n\r\n> - Hashing, integrity\r\n> How can we hash the big files in such a way that small segments can be verified efficiently?\r\n\r\nThe canonical solution is [Merkle trees](https://en.wikipedia.org/wiki/Merkle_tree) (i.e., hash trees). I'll be astonished if ZeroNet doesn't eventually adopt *some* variant on a hash tree for distributing and validating big files. The devil is in the details, however:\r\n\r\n> nofish ━ on Jun 09, 2017\r\n> It's planned this summer, right now I experimenting with merkle trees.\r\n> Conclusions so far:\r\n> Pros: Smaller content.json files (only one 64bytes roothash)\r\n> Cons: Needs to send proof with every pieces. (640 bytes/piece at 1000 pieces) and slower confirmation time\r\n> So I'm not sure if it's worth it...\r\n\r\n> p2p ━ on Jun 13, 2017\r\n> IMO we can have quick-hash-tree + SHA-512-whole-file-hash as default, and all-SHA-512-hash-tree as fallback. In `content.json` we just need to store these 3 kinds of hashes: quick-hash-tree's root hash, SHA-512-whole-file-hash, and all-SHA-512-hash-tree's root hash.\r\n> First, we calculate quick-hash-tree in which much faster checksums are used such as CRCs to calculate leaf node hashes, and then combine the whole file, calculate the SHA-512-whole-file-hash. In case of attack ( all CRCs are right but SHA-512-whole-file-hash is invalid ), we fallback to all-SHA-512-hash-tree to find out which data piece is fake.\r\n> In this way, we can address the performance problem.\r\n\r\nIntegrating [IPFS](https://ipfs.io) into ZeroNet is strictly off-the-table for all of the obvious reasons, including:\r\n\r\n> nofish ━ on Jun 10, 2017\r\n> It [*integrating IPFS*] could be possible, but then we need to run separate daemon which would reduce portability, more memory usage, probably no full tor support, more connections and [probably other problems](https://github.com/ipfs/community/blob/master/code-of-conduct.md#copyright-violations).\r\n\r\n> skwerlman ━ on Jun 11, 2017\r\n> I hadn't thought about tor support, which is probably a deal breaker since IPFS is UDP-only atm.\r\n> That CoC [*Code of Conduct*] is pretty spooky, since it seems to apply US law globally, and, assuming it's enforceable, it means the IPFS devs are susceptible to state coercion.\r\n> I think you're right that IPFS isn't the right solution here.\r\n\r\nThe remainder of @MuxZeroNet's line of questioning ultimately reduces to user experience (UX). The ideal approach would be to incrementally generalize ZeroNet's existing *small* optional file support to gradually encapsulate all of the functionality required for *big* optional file support.\r\n\r\nTo do so sanely, a browser-based user interface for managing optional files is all but essential. Specifically, ZeroHello might introduce a new zite-specific context menu item (e.g., named \"Files,\" \"Share,\" \"Details,\" \"Content,\" or something similar). When clicked, this item might open a new browser tab:\r\n\r\n* Displaying a detailed list of all optional files available from the selected zite.\r\n* Displaying torrent-style AJAX controls permitting each optional file to be independently started, paused, stopped, and deleted.\r\n\r\nIn other words, I2PSnark in ZeroNet drag *ala*:\r\n\r\n![I2PSnark UI](http://i.imgur.com/dT01pls.png)\r\n\r\nSadly, the size of even small optional files currently contributes to the 10MB zite limit. Generalizing ZeroNet's existing support from small to big optional files thus requires decoupling the size of optional files from the maximum size of the zite hosting those files.\r\n\r\nThe ideal approach is probably the incremental approach – one slow, languorous pull request at a time until we're where we eventually want to be. This road is long and winding, but utopia remains in sight.", "added": 1499383379, "modified": 1499384007, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/7#issuecomment-313569827", "source_type": "github"}], "1604064916_mirrored_kseistrup_github": [{"comment_id": 2, "body": "Python 2 is now [less than three years from the chopping block](https://pythonclock.org). :hocho: \r\n\r\nZeroNet's transition to Python 3 needs to be feature complete *before* 2020, Python 2.7's proposed end-of-life (EOL) date. While feasible and indeed necessary, this transition is likely to prove non-trivial – which is to say, \"It's gonna hurt.\" There's really no getting around that. [`six`](https://pypi.python.org/pypi/six) helps, but it's no panacea. The syntactic and semantic differences between Python 2 and 3 are sufficiently profound (particularly with respect to string handling) that the two could be said to be different languages entirely – albeit closely related languages.\r\n\r\nSsomeone just needs to bite the thankless bullet and start doing it. The sooner this painful migration begins, the sooner this painful migration ends. Or to paraphrase an [ancient Chinese and/or African proverb](https://s-media-cache-ak0.pinimg.com/originals/ad/12/56/ad125658e28ffd37f5e72502ca41ce87.jpg):\r\n\r\n> The best time to migrate to Python 3 was two years ago. The second best time is today.", "added": 1494210637, "modified": 1494210672, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/149#issuecomment-299776447", "source_type": "github"}], "1604065216_mirrored_WeirdCarrotMonster_github": [{"comment_id": 3, "body": "**This needs to happen.**\r\n\r\nAs a [Gentoo Linux contributor](https://github.com/leycec/raiagent), ZeroNet's inclusion of vendorized dependencies *and* failure to comply with basic Python packaging standards (e.g., `setup.py`, PyPI) all but guarantees that ZeroNet will never hit [Portage](https://wiki.gentoo.org/wiki/Portage) – the official package tree for Gentoo. ZeroNet's appallingly anarchic (and anachronistic) installation process is a poor fit for modern Linux distributions. While I fully intend to publish and maintain an unofficial ZeroNet ebuild (i.e., Gentoo package) at my [third-party overlay](https://github.com/leycec/raiagent), this is only a stop-gap temporary measure.\r\n\r\nZeroNet deserves better. Ultimately, ZeroNet needs to comply with industry-standard installation practice for open-source Python software. That means `setup.py` and PyPI.\r\n\r\nAuthoring and submitting a working `setup.py` script to PyPI is, frankly, trivial. By compare to the mammoth task of designing and maintaining a decentralized, demonetized, anonymized, censorship-resistent Internet, interfacing with the [CheeseShop](https://wiki.python.org/moin/CheeseShop) should be literal child's play.\r\n\r\nAre we children? Or are we men?", "added": 1494195736, "modified": 1494196057, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/382#issuecomment-299751057", "source_type": "github"}, {"comment_id": 4, "body": "@ulrichard I note that you've already authored a [preliminary `setup.py`](https://github.com/HelloZeroNet/ZeroNet/issues/417#issuecomment-256174420) for use in your [Ubuntu PPA](https://launchpad.net/%7Erichi-paraeasy/+archive/ubuntu/ppa/+packages). _Excellent._\r\n\r\nWould you be willing to submit a pull request officially integrating that into ZeroNet? It doesn't necessarily need to be perfect, particularly with respect to dependencies and version ranges. As an initial foray into Python packaging, even a superficially working `setup.py` would happily suffice.\r\n\r\nSomething is absolutely better than nothing.\r\n\r\n...and nothing is what ZeroNet currently has.", "added": 1494196442, "modified": 1494209024, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/382#issuecomment-299752143", "source_type": "github"}, {"comment_id": 5, "body": "> I'm pretty confident those are not the only options. We adults are not limited to men in gender :-)\r\n\r\nAs much as we all appreciate restatements of the self-obvious, the \"Are we children? Or are we men?\" hypothetical was a tongue-in-cheek reference to [Devo](https://rateyourmusic.com/artist/devo)'s 1978 synthpop classic [**\"Q: Are We Not Men? A: We Are Devo!\"**](https://rateyourmusic.com/release/album/devo/q__are_we_not_men__a__we_are_devo_)\r\n\r\nI assumed we were all sufficiently familiar with 70's-era New Wave (art|post|proto)-punk experimental synthpop rock here. I assumed incorrectly. *For shame, Internet!*\r\n\r\n> Having a sensible importable name for the top-level package is a pre-requisite for a sane packaging setup...\r\n\r\n👍 🤐 👍 \r\n\r\nZeroNet has deviated *sooo* far afield from a sane packaging setup that I'm unsure what, if anything, can reasonably be done at this late hour. It's *not* simply the lack of a `setup.py` script, PyPI wheel, or eponymous top-level package. It's also:\r\n\r\n* The extreme number of bundled mandatory runtime dependencies in the `src/lib` subdirectory, most patched in a ZeroNet-specific manner in unclear and probably unsafe ways.\r\n* The lack of any official list of mandatory and optional build-, run-, and test-time dependencies (ideally complete with acceptable version ranges).\r\n* The lack of a documented protocol for performing system-wide installation, particularly with respect to requisite users, groups, permissions, and directory structure.\r\n* The lack of a default system-wide installation shell script.\r\n* The lack of a default configuration file template.\r\n* The lack of a default `systemd` unit.\r\n* The lack of a default OpenRC script.\r\n* The lack of a default `/usr/bin/zeronet` shell script. The bundled `zeronet.py` script fails to suffice for a medley of reasons. In particular, `zeronet.py`:\r\n  * Fails to include the system-wide ZeroNet configuration file (e.g., `/etc/zeronet.conf`) if any.\r\n  * Fails to generalize to Python 3.x (e.g., due to the shebang line `#!/usr/bin/env python2.7`). While ZeroNet does *not* yet support Python 3.x, it really [needs to](https://github.com/HelloZeroNet/ZeroNet/issues/149) start doing that.\r\n\r\nIn short, **ZeroNet is a Turing-complete nightmare with respect to packaging.**\r\n\r\nTo simplify packaging for other Linux distros, consider pilfering the `src_install()` function of my [recently complete ZeroNet ebuild](https://github.com/leycec/raiagent/blob/master/net-vpn/zeronet/zeronet-9999.ebuild#L112) for Gentoo Linux. This function dynamically synthesizes sane users, groups, permissions, directory structure, system-wide configuration file, `systemd` unit, OpenRC script, and launcher script from user-supplied choices (e.g., whether or not to enable Tor-based anonymization). The ebuild preamble also specifies the most authoritative list of mandatory and optional dependencies I've yet discovered.\r\n\r\nThe [ZeroNet PKGBUILD tree](https://aur.archlinux.org/cgit/aur.git/tree/?h=zeronet) for Arch Linux comes similarly recommended for this purpose.\r\n\r\nMay the genderless penguin be with you, fellow packagers. 🐧 ", "added": 1495840975, "modified": 1495841792, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/382#issuecomment-304420648", "source_type": "github"}], "1604065933_mirrored_leycec_github": [{"comment_id": 6, "body": "@HelloZeroNet *Ping!* You're probably busy beyond belief.<sup>_bbb_</sup> Installation instructions are understandably very low-priority, but is there anything further you'd like me to do for this?\r\n\r\nI'd be happy to touch this up in any way you like. In any event, thanks for all the decentralized ZeroNet! 🕸 ", "added": 1496438383, "modified": 1496438488, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/952#issuecomment-305936338", "source_type": "github"}, {"comment_id": 7, "body": "**_Sweeeeet!_** Penguins everywhere applaud you.", "added": 1496546550, "modified": 1496546580, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/952#issuecomment-306021229", "source_type": "github"}], "1604067585_mirrored_HelloZeroNet_github": [{"comment_id": 8, "body": "@blurHY: You've added nothing meaningful to this conversation. Yes, we get it: you're deeply and hopelessly infatuated with IPFS, presumably due to the psychology of previous investment in your [InterPlanetary ZeroNet (IPZN)](https://github.com/ipzn/ipzn). The overwhelming majority of us disagree with your hardline position. Can we please move constructively on?\r\n\r\nAlso, stop belligerently polluting this and other ZeroNet threads. This includes #2198, #2194, #2189, #2062, and the list goes on and on. #2090 is probably the *only* issue where you offer sound advice unburdened by sarcasm, vitriol, or one-liner exhortations extolling the virtues of IPFS and denigrating everything else in existence.\r\n\r\n## tl;dr\r\n\r\nMore threads like #2090. Less threads like this and all of your other commentary. 谢谢.", "added": 1570250172, "modified": 1570250172, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2192#issuecomment-538626173", "source_type": "github"}], "1604067685_mirrored_adrelanos_github": [{"comment_id": 9, "body": "**Linux ≠ Debian.** While popular, Debian-based Linux distributions occupy only a small fraction of the Linux space. Devolving ZeroNet from its current distro-agnostic installation instructions to distro-specific installation instructions makes little to no sense. <sup>*Mostly, no sense.*</sup>\r\n\r\nThe current distro-agnostic installation instructions are fine. What's *not* fine is the sluggish pace of package publication by Debian developers – but that's entirely on them. ZeroNet isn't to blame here. When even Gentoo and Arch Linux provide up-to-date packages for ZeroNet, you know that something's wrong with your rolling release model... *or lack thereof.*\r\n\r\n> It is also a third party package manager.\r\n\r\n`pip` is the [official Python package manager bundled with Python itself](https://docs.python.org/3/library/ensurepip.html). It doesn't get more first-party than that. With respect to Python packaging, it's system-wide package managers like Debian's `apt` and CentOS' `yum` that are third-party – not `pip`.\r\n\r\n**Relative perspective:** it matters.\r\n\r\n> Could you please use dependencies available from distribution package repositories such as packages.debian.org?\r\n\r\n**No,** because distro-specific package repositories are (*wait for it*)... distro-specific. ZeroNet would only be installable under Debian-based Linux distributions – a significant regression from ZeroNet's current applicability to *all* Linux distributions. Does that actually sound like a good idea to anyone in attendance who is *not* @adrelanos?\r\n\r\nIf we really want to walk down this road in a sane way, we might consider publishing a [distro-agnostic AppImage](https://appimage.org) for ZeroNet. Unlike distro-specific packages, AppImages portably run on *all* Linux distributions. They also bundle *all* requisite dependencies in a safe, secure, robust, reproducible manner isolated from any package manager – `pip` and `apt` included.\r\n\r\nIf portability, security, and ease of installation are your concerns, AppImage is your answer. Debian is a non-answer to a question that no one asked.\r\n\r\n> This is also a blocker for ever getting ZeroNet accepted into official packages.debian.org.\r\n\r\n**No.** The blockers here are Debian developers – *not* ZeroNet. Again, Gentoo and Arch Linux both publish ZeroNet packages. If the little guys with effectively no funding can do it, the big guys with absurd piles of multinational corporate venture capital absolutely can, too.\r\n\r\nThis is entirely on Debian. Debian's well-known internal torpor is entirely a Debian issue. \r\n\r\n## tl;dr\r\n\r\n*This issue is a non-issue and should probably be closed.*", "added": 1575424720, "modified": 1575424845, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2326#issuecomment-561477159", "source_type": "github"}], "1604068013_mirrored_mx5kevin_github": [{"comment_id": 10, "body": "@slrslr has the right of it. Ideally, the ZeroHello frontpage would explicitly notify seeders of all big files for which they're the last remaining seeder – **in bold,** _with emphasis_, and possibly a GeoCities-era red blinking ComicSans font as well. That alone would do wonders for raising awareness amongst users of the need to continually seed big files (and thus run ZeroNet as a startup system service).", "added": 1597938093, "modified": 1597938093, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2602#issuecomment-677833053", "source_type": "github"}]}, "next_topic_id": 4, "topic": [{"topic_id": 1604065933, "title": "Arch and Gentoo Linux Installation Instructions", "body": "This trivial pull request adds installation instructions for the following Linux distributions:\r\n\r\n* **[Arch Linux](https://www.archlinux.org),** via the [unofficial `zeronet` package](https://aur.archlinux.org/packages/zeronet) published by the [Arch User Repository (AUR)](https://aur.archlinux.org).\r\n* **[Gentoo Linux](https://www.gentoo.org),** via the [unofficial `zeronet` package](https://github.com/leycec/raiagent/tree/master/net-vpn/zeronet) published by the [raiagent overlay](https://github.com/leycec/raiagent).\r\n\r\nBoth distributions provide the latest stable ZeroNet release (~~0.5.4~~ 0.5.5) by default and the latest unstable GitHub commit as an optional variant. [Ricers, unite!](https://wiki.installgentoo.com/index.php/Ricing) 🍚 ", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1495748625, "modified": 1496546580, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/952", "source_type": "github"}, {"topic_id": 1604067549, "title": "ZeroNet >= 0.7.0 requires PySocks >= 1.6.8", "body": "### Step 1: Please describe your environment\r\n\r\n  * ZeroNet version: 0.7.1\r\n  * Operating system: Gentoo Linux\r\n  * Web browser: Tor Browser\r\n  * Tor status: always\r\n  * Opened port: no\r\n  * Special configuration: no\r\n\r\n### Step 2: Describe the problem:\r\n\r\nHello, ZeroNet! This is @leycec, the [quasi-official maintainer of the Gentoo Linux ebuild for ZeroNet](https://github.com/leycec/raiagent), with a trivial dependency issue. As the title suggests, ZeroNet ≥ 0.7.0 requires PySocks ≥ 1.6.8. Unfortunately, the top-level `requirements.txt` file listing all mandatory dependencies of ZeroNet fails to specify this; this file only ambiguously lists `PySocks` rather than `PySocks>=1.6.8`. Specifically:\r\n\r\n```\r\n# This line in \"requirements.txt\"...\r\nPySocks\r\n\r\n# ...should resemble this instead.\r\nPySocks>=1.6.8\r\n```\r\n\r\nThis is an issue under Gentoo Linux in particular, as only PySocks 1.6.7 is currently marked as stable. PySocks 1.6.8 is currently marked as unstable, meaning *most* Gentoo Linux users who upgraded to ZeroNet 0.7.1 now have a broken ZeroNet. [We've since patched this on our end](https://github.com/leycec/raiagent/commit/37d1a97a32165e97ba153840f2d569b2037ac975), but an official fix in the ZeroNet codebase would be swell.\r\n\r\nThanks for all the phenomenal volunteerism, @HelloZeroNet. Magical rabbits for all! :rabbit: :rabbit2: \r\n\r\n#### Steps to reproduce:\r\n\r\n  1. Install ZeroNet 0.7.1.\r\n  2. Install PySocks 1.6.7.\r\n  3. Enable `tor = always`.\r\n  4. Restart ZeroNet.\r\n  5. Observe the catastrophic destruction of all that you know and love.\r\n\r\n#### Observed Results:\r\n\r\nZeroNet completely fails. All connection attempts – including those to trackers – fail with a PySocks-specific exception buried deep within the curmudgeonly bowels of the `socks.py` codebase. This can be trivially observed by tailing the ZeroNet debug logfile: e.g.,\r\n\r\n```\r\n$ tail -f /var/log/zeronet/debug.log\r\n...\r\n[2019-10-17 02:22:53,437] DEBUG    TorManager Created new hidden service for [insert-hash-here]: [insert-id-here]\r\n[2019-10-17 02:22:53,438] DEBUG    ConnServer Conn# 1 [insert-domain-name-here] [?] > Connecting... (site: Site ??..??)\r\n[2019-10-17 02:22:53,438] DEBUG    TorManager Creating new Tor socket to [insert-domain-name-here]:31130\r\n[2019-10-17 02:22:53,439] DEBUG    ConnServer Conn# 1 [insert-domain-name-here] [?] > Closing connection: [insert-domain-name-here] Connect error: AttributeError: 'super' object has no attribute 'getpeername' in ConnectionServer.py line 208 > Connection.py line 143 > socks.py line 314 > socks.py line 458, waiting_requests: 0, sites: 0, buff: 0...\r\n[2019-10-17 02:22:53,440] DEBUG    ConnServer Conn# 2 [insert-domain-name-here] [?] > Connecting... (site: Site ??..??)\r\n[2019-10-17 02:22:53,440] DEBUG    TorManager Creating new Tor socket to [insert-domain-name-here]:33399\r\n[2019-10-17 02:22:53,441] DEBUG    ConnServer Conn# 2 [insert-domain-name-here] [?] > Closing connection: [insert-domain-name-here] Connect error: AttributeError: 'super' object has no attribute 'getpeername' in ConnectionServer.py line 208 > Connection.py line 143 > socks.py line 314 > socks.py line 458, waiting_requests: 0, sites: 0, buff: 0...\r\n...\r\n```\r\n\r\nNote the repeated references to an `AttributeError` on line 458 of `socks.py`. This is an [ancient PySocks 1.6.7 issue](https://github.com/Anorov/PySocks/issues/129) when specifically [monkey-patched by `gevent`](https://github.com/gevent/gevent/issues/937). Fortunately, [PySocks 1.6.8 has since resolved this issue](https://github.com/Anorov/PySocks/pull/88).\r\n\r\nErgo, ZeroNet ≥ 0.7.0 requires PySocks ≥ 1.6.8.\r\n\r\n#### Expected Results:\r\n\r\nZeroNet to actually work. Insert troll face here. Thanks again, @HelloZeroNet. You rock it always.", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1571285233, "modified": 1571747012, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2226", "source_type": "github"}, {"topic_id": 1604067573, "title": "Tor Browser >= 9.0 superficially incompatible with ZeroNet (and most other darknets)", "body": "## tl;dr\r\n\r\nIf you recently upgraded to Tor Browser 9.0 and are no longer able to connect to ZeroNet, browse to `about:config` and change the value of the `network.proxy.no_proxies_on` setting to `127.0.0.1`.\r\n\r\n*Read on for ugly and terrifying details.*\r\n\r\n### Step 1: Please describe your environment\r\n\r\n  * ZeroNet version: 7.1\r\n  * Operating system: Gentoo Linux\r\n  * Web browser: Tor Browser 9.0\r\n  * Tor status: always\r\n  * Opened port: no\r\n  * Special configuration: N/A\r\n\r\n### Step 2: Describe the problem:\r\n\r\nTor Browser 9.0 (released two days ago) **superficially breaks ZeroNet** – and all other localhost-based darknets including I2P. Previously, the detailed instructions under the FAQ question [\"How to use ZeroNet with the Tor browser?\"](https://zeronet.io/docs/faq/#how-to-use-zeronet-with-the-tor-browser) sufficed to render ZeroNet usable with Tor Browser. Tragicomically, Tor Browser 9.0 fundamentally broke us by removing the \"Use custom proxy settings\" subsection from the \"Preferences...\" dialog. This includes the \"No proxy for:\" field required to enable ZeroNet usage. *Yup.*\r\n\r\nThe forced removal of custom proxy settings from Tor Browser 9.0 doesn't simply effect *new* users; it also effects all *existing* users who previously listed `127.0.0.1` under the \"No proxy for:\" field. Why? Because Tor Browser 9.0 didn't simply remove these front-facing GUI elements; it also removed *all* of the underlying implementation logic associated with these front-facing GUI elements.\r\n\r\nWe begin to see the problem, I trust. Attempting to browse to *any* localhost port in Tor Browser 9.0 now yields the following thoroughly useless error message:\r\n\r\n> **Unable to connect**\r\n>\r\n> Firefox can’t establish a connection to the server at 127.0.0.1:43110.\r\n>\r\n> * The site could be temporarily unavailable or too busy. Try again in a few moments.\r\n> * If you are unable to load any pages, check your computer’s network connection.\r\n> * If your computer or network is protected by a firewall or proxy, make sure that Tor Browser is permitted to access the Web.\r\n\r\nPerusing the Tor logs (e.g., via \"Preferences...\", \"Tor\", \"View Logs...\") yields a slightly more informative view:\r\n\r\n> 10/25/19, 02:33:28.443 [NOTICE] New control connection opened from 127.0.0.1. \r\n> 10/25/19, 02:33:28.788 [WARN] Rejecting SOCKS request for anonymous connection to private address [scrubbed]. [10 similar message(s) suppressed in last 300 seconds]\r\n\r\n**This is bad.** Since Tor Browser defaults to auto-updating itself, most Tor Browsers users will now find ZeroNet (and most other darknets) inexplicably unresponsive. There's no visual indication during either the Tor Browser update process *or* from within Tor Browser itself once restarted that localhost connections are now silently and unconditionally denied.\r\n\r\nThis is appalling user experience (UX) design. This is also disappointing behaviour from Tor Browser developers, who absolutely should know better than to fundamentally break previously working functionality for no demonstrably good reason. Clearly, they think they know better. Clearly, they don't.\r\n\r\n*I am darknet-based anger incarnate.*\r\n\r\nI'm afraid I couldn't find a recent ticket on the Tor bug tracker that publicizes this, but several ancient tickets appear to relate: [ticket/10419](https://trac.torproject.org/projects/tor/ticket/10419), [ticket/10165](https://trac.torproject.org/projects/tor/ticket/10165), and [ticket/11493](https://trac.torproject.org/projects/tor/ticket/11493). Please repeatedly pester, flame, and shame developers on the Tor bug tracker until they relent – which they won't, of course. They've only gotten worse and worse and ever more ~~authoritarian~~ \"vigilant\" about prohibiting localhost access. Expect to be ignored, in other words.\r\n\r\nBut wait! There's more. As any good Mozilla devotee knows, Firefox's public-facing UI is *also* overly authoritarian, unnecessarily minimalist, and frankly useless... but trivially circumvented by the One True Preferences dialog: `about:config`. Long live `about:config`! Without that, Firefox and now Tor Browser would be literally unusable for most sane purposes.\r\n\r\nDoes `about:config` help us here? It absolutely does. Well, until Tor Browser developers realize that users can restore access to localhost by defining a single setting in `about:config`. At that point, they'll probably attempt to prohibit that, too. When they do, we'll need to get imaginatively creative. Until then, the following alternative instructions to those listed at [\"How to use ZeroNet with the Tor browser?\"](https://zeronet.io/docs/faq/#how-to-use-zeronet-with-the-tor-browser) suffice to restore worky:\r\n\r\n1. Start Tor Browser.\r\n1. Browse to `about:config`.\r\n1. Enter `network.proxy.no_proxies_on` into the \"Search:\" box.\r\n1. Double-click the `network.proxy.no_proxies_on` line that appears.\r\n1. Enter `127.0.0.1` as the value of this preference.\r\n1. Click \"OK\".\r\n\r\nChanges take effect immediately. Restarting Tor Browser is unnecessary. No thanks for small favours!\r\n\r\nNeedless to say, we'll need to revise our FAQ instructions to note this. It would be nice **[read:** _it'll never happen_**]** if someone <sup>who is not me</sup> would also create a Tor Browser Add-on or Extension for ZeroNet that automates this and other mundane chores (e.g., installing a ZeroNet-specific `.pac` file for domain resolution).\r\n\r\nUntil then, we're stuck with low-level manual kludges. *Why, developers... Y U break worky!?!?*\r\n\r\n#### Steps to reproduce:\r\n\r\n  1. Update Tor Browser.\r\n  2. Note that ZeroNet is dead.\r\n  3. Repeatedly smash forehead against keyboard until lapsing into blissful unconsciousness.\r\n\r\n#### Observed Results:\r\n\r\n  * What happened? This could be a screenshot, a description, log output (you can send log/debug.log file to hello@zeronet.io if necessary), etc.\r\n\r\nZeroNet dead.\r\n\r\n#### Expected Results:\r\n\r\n  * What did you expect to happen?\r\n\r\nZeroNet not to be dead.", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1571973278, "modified": 1572357890, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2244", "source_type": "github"}]}