{
	"message": [
		{
			"body": "le fond du problème c'est que vous êtes trop ignares et irrespecteux pour comprendre le mot : liberté. dommage :).",
			"date_added": 1615539305700
		},
		{
			"body": "et alors gerard miller, mais alors qu'il est con... il aurait du etre acteur, avec son sketch sur le nom des rues... meme dieudonné il aurait pas fait mieux :D",
			"date_added": 1615542856100
		},
		{
			"body": "mais je pense que gégé il est trop arrogant pour suivre un script... le truc qui me fait rire c'est les bouffons qui le venerent, genre ils veulent aller a la tele avec drucker HAHAHAH:..",
			"date_added": 1615543025300
		},
		{
			"body": "ou avec l'autre merdeux a lunette... comment il s'appelle le petit leche cul...?",
			"date_added": 1615543042900
		},
		{
			"body": "je pourrais meme pas vous dire, par le grand jean luc ! ",
			"date_added": 1615543060400
		},
		{
			"body": "ramassi de crétin ! ahahahah",
			"date_added": 1615543071100
		},
		{
			"body": "j image ca doit pas etre mieux a la banque de france ! genre on picole du sullfite en bouffant de la saucisse,..ahahahaha",
			"date_added": 1615543096200
		},
		{
			"body": "tellemtn lamentable vaut mieux aller vivre dans le lamentin :D",
			"date_added": 1615543115600
		},
		{
			"body": "hhehhehe",
			"date_added": 1615543117000
		},
		{
			"body": "hehehe martin blanchier il est bien :)",
			"date_added": 1615543582700
		},
		{
			"body": "morandini faut qu'il arrete la coke, ou alors qu'il commence le shit :D",
			"date_added": 1615543605300
		},
		{
			"body": "en fait vous avez tuer jean luc de la rue (il a bien fait un OD a la coke?) car il avait pas une qualité constante, voir a été piegé... oui tueurs, vous l avez tué.",
			"date_added": 1615543655900
		},
		{
			"body": "sur lci,.. marine. dit rien. tu nous dis juste : finit la criminalization de la weed, faites ce que vous voulez plus mon problem... gagnante 120% des voix",
			"date_added": 1615543726100
		},
		{
			"body": "par contre t es prete a tuer les pds de l 'onu? c est la bataille",
			"date_added": 1615543762700
		},
		{
			"body": "moi je crois pas, je pense que t'es juste une opposition hegelian... en gros on controle les 2 bords comme ca pas de surprise",
			"date_added": 1615543784400
		},
		{
			"body": "c'est leur probleme avec putinovitch ou le CCP, ils arrivent pas :D",
			"date_added": 1615543797200
		},
		{
			"body": "voir avec les saudiens israeliens et surtout les mullahs !",
			"date_added": 1615543808600
		},
		{
			"body": "rien a foutre de vos cash de vos enfants (a violer) etc...",
			"date_added": 1615543820200
		},
		{
			"body": "degager bouffeurs de porc",
			"date_added": 1615543825900
		},
		{
			"body": "on pourrait pas mettre la petite a la place? marion la? elle a l'air plus moderne",
			"date_added": 1615543842900
		},
		{
			"body": "on va ouvrir un ehpad a l elysée !",
			"date_added": 1615543865600
		},
		{
			"body": "j en suis au stade ou j'ai honte meme de regarder...",
			"date_added": 1615543944400
		},
		{
			"body": "julien odoul il est bien !",
			"date_added": 1615544963600
		},
		{
			"body": "mais  j imagine qu'il est contre les plantes :)",
			"date_added": 1615544974200
		},
		{
			"body": "imad kansau il a l'air bien...",
			"date_added": 1615545222500
		},
		{
			"body": "j'ai vus un gros con ! le mec il dit que je dois pas discuter d'une molecule avec un medecin, mais quel bouffon ! bien sur que je discute, inspecte et verifie !",
			"date_added": 1615548998600
		},
		{
			"body": "c'est quoi cette connerie, de se laisser faire et marcher sur les pieds, d'etre comme un beta bea sans aucune independence... do your own research 101 ! ",
			"date_added": 1615549036300
		},
		{
			"body": "le doc il sait pas tout ! il a fait max 5-7h sur un sujet et il recoit des tonnes de prospectus ! moi je checke. je m'en fous de celui qui a l'authorisation de préscrire !",
			"date_added": 1615549075100
		},
		{
			"body": "y en a un il a dit un truc bien : c'est clair le gouv fait des coups de comm... mais pour masquer quoi? ahah !",
			"date_added": 1615549274900
		},
		{
			"body": "conseil a celui du fn sur lci... surtout pas se justifier... un pays sans frontiere n existe pas. fin de l'immigration de masse. point. pas de justification. l immigration de masse plus possible.",
			"date_added": 1615549370300
		},
		{
			"body": "apres l autre con il veut les refugiée climatique mais qu'il aille se faire foutre...",
			"date_added": 1615549397500
		},
		{
			"body": "partager la richesse blah blah...",
			"date_added": 1615549404600
		},
		{
			"body": "nazi",
			"date_added": 1615549406000
		},
		{
			"body": "ils ont qu a creuser autour de leur putain d ile pour faire un mur et la surelever ! j en ai rien a foutre.",
			"date_added": 1615549451700
		},
		{
			"body": "et comme ca le niveau de la mer baissera !",
			"date_added": 1615549463000
		},
		{
			"body": "one o one",
			"date_added": 1615549466200
		},
		{
			"body": "trop raison : mandatory medical intervention... ca c'est le genre de sujet que les petits putes et pds du paff n abordent jamais comme ca...",
			"date_added": 1615549810800
		},
		{
			"body": "c'est tjrs wrapper, c'est tjrs un agenda... jamais celui de la liberté... jamais.",
			"date_added": 1615549827000
		},
		{
			"body": "et jrs pas de meteo global !!! quelle honte !! cet ethnocentrisme pitoyable !",
			"date_added": 1615550372600
		},
		{
			"body": "on veut voir les perturbations atlantique ! heureusement qu il y a d autre chaine international...",
			"date_added": 1615550407500
		},
		{
			"body": "mais quels losers",
			"date_added": 1615550412500
		},
		{
			"body": "mage des bananes ! ",
			"date_added": 1615550432000
		}
	]
}