{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 1,
				"body": "Zero nie kończy się na , @nofisch? Czy ktoś go zastąpi? Tego To nie wiem? Ale to jest sprawdzian, jak solidną ma konstrukcję ZeroNet? Jak długo utrzyma się na powierzchni. Ja nie rezygnuję. I ędę dalej wspierał.",
				"added": 1624851347
			}
		],
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 2,
				"body": "If you own iOS or macOS devices, then probably one of the values that you value is privacy. Apple itself is proud of it:\nUnfortunately, Apple's latest announcement does not bode well for the privacy concerns of iOS and macOS users:\nRemember the attempts to push through laws to add backdoors in encrypted communicators under the guise of fighting terrorism? In the case of Apple's new announcement, the rationale is to protect children from pedophiles and limit the distribution of child pornography. In order for the company to achieve its goal, all photos stored in the iCloud cloud will be scanned and compared with a database of special hashes. In addition, on a similar basis, messages in the iMessage application will be scanned to warn parents when someone sends sexual photos to their comfort. (this option requires a parent / guardian account)\nHowever, this is not the end, as Apple also plans to introduce scanning of photos located directly in our devices:\nAccording to the community of security researchers and privacy enthusiasts, Apple's actions are de facto creating a back door for law enforcement. The new solution can also be used unethically by countries where the regime is in power, such as Poland, to spy on people who are not in favor of the authorities there:\nAdditional problems can be false detection of our photos as \"inappropriate\", or even deliberately sending someone prohibited content to achieve the effect of so-called swatting (Apple will notify law enforcement when their system detects inappropriate photos on our device):",
				"added": 1628933532
			},
			{
				"comment_id": 3,
				"body": "@ozaichirah.\nIt has nothing to do with anything. It's just an example of the direction the world is going. Does this show what you can expect from others???Everything is set for full control. To put it mildly, surveillance-all. How can you expect honesty from a broker in such circumstances??? The broker always works with the owner giving the money. read / finances/. We don't have a second option.",
				"added": 1629054951
			}
		]
	},
	"comment_vote": {}
}