{
	"next_topic_id": 4,
	"topic": [],
	"topic_vote": {
		"1566897680_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1567677765_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"1602987633_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1616113202_1NKkmuj4vzTYCuCD8ExJokgpcgyaiFM3KC": 1,
		"1568271804_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"1616066718_1AMUtxW7pjg4XgawDbAk297M1FfHWvSdSz": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1619825404_1LpWbu62NgT4wzh1k1XVDCW9qwENC7AQi1": [
			{
				"comment_id": 1,
				"body": "no tak ti prejeme hodne stesti\na doufam, ze se nestanes zrovna takovou objeti psycho terroru jako ja\n[Petr](/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1AMUtxW7pjg4XgawDbAk297M1FfHWvSdSz/petrkoval@zeroid.bit)",
				"added": 1620430736
			},
			{
				"comment_id": 2,
				"body": "ti zlocinci si nedaji pokoj ani tu\na velmi smutne, ze se na te kriminalite podili i samotna policie\nnebo nam chcou tvrdit, ze kdyz kriminalita vychazi obcas z IP adres, ktere jsou vedene jako IP adresy policie,\nze je zneuzili nejaci desetileti pubertaci? to snad ne!\na nebo se doslova vydavat za KripoWIen (kriminalni policie Viden Rakousko)\nkdyz u mne bylo u dveri bytu tech 10 uredniku kriminalni policie, o nicem nevedeli !?\n\nhttps://www.facebook.com/vendy.kolarova.39/posts/3750565435167924\ntakze kriminelni skupina Melesovci za plne spoluprace kriminelne pracujici policie Slovenske republiky\n\ntakze jdes do blokace nejen na Facebooku ale i zde!\nelsiebergovagma@zeroid.bit\n\npo pridani po\nmeles@zeroid.bit\nvrabecindicky@zeroid.bit\nfedorslasnky@zeroid.bit\nfedorslynskyy@zeroid.bit\n\nVY SI S TIM PSYCHO TERROREM NEDATE POKOJ ANI PO 4 LETECH PSYCHO TERRORU A TRESTNICH OZNAMENICH U MINISTERSTVA SLOVENSKE RPEUBLIKY A U LANDESKRIMINALAMT WIEN\nPSYCHOPATE NA DOSMRTI, TAKZE VAS VIDET ROZHODNE NEMUSIM\n\nUZ BY STE SE MELI LECIT NA NEJAKE PSYCHIATRICKE LECEBNE A DAT DRUHYM LIDEM KONECNE POKOJ VY KRIMINELNI ZMRDI !\n\n[Petr](/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1AMUtxW7pjg4XgawDbAk297M1FfHWvSdSz/petrkoval@zeroid.bit)\n\nJESTE DODATEK\n\nMILAN LAURINEC O TECHTO PSYCHOPATECH:\nPlná verzia kyber terorizmu - stalkingu aj na Slovensku podporovaná políciou proti Národnému Občianskemu tribunálu.\nhttps://www.facebook.com/milan.laurinec.96/videos/3206313552778571\n\nTITO PSYCHOPATE NA FACEBOOKU\nhttps://www.facebook.com/melesovci\n\nDALSI PROFIL TECHTO PSYCHOPATU\nVelký Jazyk LHÁŘ\nhttps://www.facebook.com/Velk%C3%BD-Jazyk-LH%C3%81%C5%98-103855841904630\nna kterem tito psychopate napadaji tohoto cloveka a jeho zenu\nhttps://www.facebook.com/sany.davis.54\n\na taky se byli schopni vydavat za tohoto slepeho cloveka\nhttps://www.facebook.com/adam.z.mikulasek\naby mne pod jeho identitou a bez jeho vedomi a souhlasu kriminelne napadali\n\na celou dobu se v tom veze jak Slovenska tak Rakouska policie !\nvse bylo jako trestni oznameni  policejne ohlaseno a policie misto aby tento psycho terror stihala jak jej kryje, jinymi slovy policie jsou komplicove teto psycho terror kriminality vuci hodne lidem !\n\n",
				"added": 1622212598
			}
		],
		"1637750556_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "To je jako s domacim nasilim. Mlatici chlab zenskou a deti ma vzdycky pravdu a umlacena zenska k smrti je kospiracni teoretickou. To je nas nazor, kdyz je polovina argumentace odborne verejnosti jako jsou prvotridni lekari umlcovana.\n\nPetr Koval a Vendula Kolarova z Vidne\n\na v nasem pripade tomu vyhrozovani vrazdou (v minule dobe) nebo objednavky pornozbozi pod nasi identitou na nas moc na duveryhodnosti taky nenapomaha ...\n\na to jeste nevzpominam zahadnou smrt Jiriho Zajice\n\nA jinak bychom to vic oznacili jako ocovaci dogmu, kdyz se ockuji ohrozeni lide nejruznejsimi zdravotnimi problemy, kde to u nich jejich immuni system jen tak tak zvlada a oni jim ho zrujniji jakoukoliv chemikalii, jedno jestli nepovolene leky pro daneho cloveka a nebo experiment v podobe techto valkcin, kde to u nejruznejsich zdravotnich potizi a v kombinaji s nemi vubec nemohou mit odzkousene. Oni to ale nejdou na riziko ale s plnym vedomim ze to vyjde uplne vedle v nejhorsich problemech u daneho cloveka. Oni tim ockuji jakekoliv problematicke lidi a jejich problematicke zdravotni stavy, a to se nam jevi jako umyslne poskozovani neli umyslna vrazda. To at se na nas nikdo nezlobi.\nKdyby to davali jen a pouze zcela zdravym lidem tak by se to jeste tak nejak chapalo, ale ne u naprsto nemocnych lidi.",
				"added": 1637753372,
				"modified": 1637754625
			},
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_90_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Dobrý den, zdravím do Rakouska. Nečetl jsem o tom, že by mělo být povinné očkovat seniory bez ohledu na jejich zdravotní stav. To mi přijde jako nepravděpodobné, jelikož když jsem byl na očkování tak ze mě ta doktorka přímo tahala jestli mám nějaké problémy (zda mě můžou očkovat) a myslím si, že v případě seniorů bude  zjišťování anamnézy (nebo jak se tomu říká) spíše důkladnější než tomu bylo v mém případě. [...]\nO tom by se psalo kdyby se to necenzurovalo. Oni to ty mrchy rikaji tem seniorum bez jakekoliv cizi pomoci. Neovoli jim ani zavolat detem, kteri je predem varovali, ze kdyz se to stane ze tem detem maji okamzite zavolat, a ty mrchy jim tem penzinistum v tom zabrani a pod vyhruzkama je praticky pod ultimatem atd.\nPak ubreni volaji detem kdyz uz se to neda vratit zpet. To jsou takove hruzny ze to fakt naposledy nebylo ani za totality ko,munismu ale jen za Adolfa Hitlera !!!!",
				"added": 1637821911
			},
			{
				"comment_id": 5,
				"body": "> [ssdifnskdjfnsdjk](#comment_91_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): uff, hmm o tomhle mi není nic známo, je to divné že by senioři nemohli zavolat dětem a cenzura je, ale myslím že se to nedá srovnávat s tím co je třeba v komunistické číně. Čekal bych že půjde hlavně o cenzuru vyložených lží na sítích jako FB, nebo možná jen o lživé reklamy.https://koronavirus.mzcr.cz/dezinformace-o-covid-19/\n\nMy uz se davno neotientujeme dle zdroju tretich osob. Nas je dobre z 100 000 navzajem pospojovanych lidi a kazdy cerpa jen z overitelnych faktu svych vlastnich znamych v osobnim styku a ze svych vlastnich osobnich zkusennosti.\nAt uz z volneho casu a nebo z prostredi sveho vlastniho povolani. Neco vidim ja, neco moji kolegove.\nTakze nas jen tezko nekdo ublbne informacemi, ktere si nemuzeme na svou vlastni kuzi, na sve vlastni oci, nijak overit. A spousta z nas muselo podepsat mlcenlivost o skutecnych detajlech, a jak to nekdo nezvlada ze svym zaludkem a svym svedomim, a kdyz neco prece jen nekdo z nas vyzvani, hned je mu vyhrozovano a hned je pronasledovan a sikanovan policii, a dale zastrasovan, tak je vsechno jasne. Internet , Media, vsechno muzes zapomet, pokud si tam nemuzes zajit a overit si to sam. A tomu je maximalne braneno a nebo kdyz v ramci povolani mas pristup, tak jsi umlcovan a vydiran kdyz porusis mlcenlivost.",
				"added": 1637849755
			},
			{
				"comment_id": 6,
				"body": "JINAK CO SE TYKA DEZINFORMACI VERZUS FAKTA !!!\nhttps://www.facebook.com/100006246761320/videos/915478716039568/",
				"added": 1637860337
			}
		]
	},
	"comment_vote": {
		"1_1KPdLHcCBgxQoQLQYKsi8eEVsMJCkkDjTZ": 1,
		"1_1Mn2C722jSxg6Fj7bf6oDYGZMnYdJy31tZ": 1,
		"2_1FSRQNLJT5W3tFWMPVZ9cEH6Db2Z4a1yAk": 1,
		"2_1KPdLHcCBgxQoQLQYKsi8eEVsMJCkkDjTZ": 1,
		"81_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"80_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"79_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"78_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"77_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"120_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"55_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}