{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1560710420_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1560710420_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": ">\"The Next Reset\n>Is it possible that we're being warned so that there might be 500 million survivors to rule over when all is said and done?\"\n\n\nhttps://en.wikipedia.org/wiki/Georgia_Guidestones\n\n>1.    Maintain humanity under 500,000,000 in perpetual balance with nature.\n>2.    Guide reproduction wisely — improving fitness and diversity.\n>3.    Unite humanity with a living new language.\n>4.    Rule passion — faith — tradition — and all things with tempered reason.\n>5.    Protect people and nations with fair laws and just courts.\n>6.    Let all nations rule internally resolving external disputes in a world court.\n>7.    Avoid petty laws and useless officials.\n>8.    Balance personal rights with social duties.\n>9.    Prize truth — beauty — love — seeking harmony with the infinite.\n>10.    Be not a cancer on the earth — Leave room for nature — Leave room for nature.\n\nYes, very much possible.",
				"added": 1560720445
			},
			{
				"comment_id": 4,
				"body": ">Next Reset = Black Swan Event,\n\nhttps://en.wikipedia.org/wiki/Black_swan_theory\n\n>The black swan theory or theory of black swan events is a metaphor that describes an event that comes as a surprise, has a major effect, and is often inappropriately rationalized after the fact with the benefit of hindsight. The term is based on an ancient saying that presumed black swans did not exist – a saying that became reinterpreted to teach a different lesson after black swans were discovered in the wild. \n\nThat's likely ... except this part:\n\n>and is often inappropriately rationalized after the fact with the benefit of hindsight\n\nDon't underestimate our overlords",
				"added": 1560721779
			}
		],
		"1560456511_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 2,
				"body": ">David Icke is only alive because of Reptilians. but as I can tell you 80% of his live talks are bang on the mark.\n\nHow do you know which 80% is truth and which 20% is lies? It's very hard if you don't have the ability to think critically and have crucial truthful information to begin with.\n\n>Contaminous nonsense\n\nYes",
				"added": 1560720803
			}
		],
		"1560612764_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": ">Leftism\n\nDefine it. It's important.\n\n>It's promising.\n\nI'm very sceptical, haha.",
				"added": 1560720865
			}
		]
	},
	"comment_vote": {}
}