{
	"next_comment_id": 10,
	"user_name": "Undyingfirewall",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1588435141": 1590096069,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1605625908": 1605774922
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "After all, the Direct feature has finally appeared in the Web version of Hipstagram.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1589721403",
			"date_added": 1590095593
		},
		{
			"comment_id": 2,
			"body": "Do you call an Android device like this? I mean, I wonder if there are any users of Pocket PCs or other legacy smart devices those are used to be called PDAs. I mean, except me, of course.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1589470828",
			"date_added": 1590095970
		},
		{
			"comment_id": 3,
			"body": "Heh, when my ex has deleted a comment under her Instagram post about her huge fortune of being able to go out, I realized that's alright that she is my ex now. Because I know that deep inside she can't disagree with this.\nI really appreciate if my girlfriend loves freedom, but, unfortunately, it doesn't mean she would let others do so. Moreover, usually it does mean that she won't. Yep, it's also about the love of freedom 'cause it's Moscow.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1588435141",
			"date_added": 1590096596
		},
		{
			"comment_id": 4,
			"body": "@caryoscelus: Well, looks like it's the sad truth. Realizing all the drawbacks of the Android since the fifth version, or what's more important nowdays, the modern hardware design (without removable batteries, card readers, Mini Jacks, etc), such devices are less reliable than Pocket PCs or even Symbian-powered phones used to be. So they are just too unreliable to be called with an acronym which includes the word \"assistant\".\nLooks like many people don't even remember an acronym like this because they don't need a real smartphone. They still use it as a feature phone, and main features still consist of making calls (regardless of using the GSM network or IM apps), but also running a modern Web browser^W^W JS runtime and all the fancy consumer apps. Android is a real \"consumer OS\". It even consumes more hardware resources than a normal desktop OS, so a good i3-powered laptop that handles complex games such as Life is Strange or Minecraft (with hi-res textures) and modern Web (barely, through K-Meleon), can't run Android-x86 smoothly, especially in a VM.\nThe real major reason we can't stick to such reliable devices and OSes (speaking even about desktop OSes, like Windows XP) is that we're already stuck to modern Web browsers.\nAll in all, after 3 years of using Debian as my primary desktop OS, and as the proprietary software (such as Pocket PC) is not fancy nowdays (formally), I wish I had a desktop Linux distribution on my mobile devices. And I find three solutions to it:\n1) keep using my HTC HD2 or buy a used Nokia N900;\n2) use a combination of a netbook and a cellphone which is just capable of tethering;\n2.1) replace the cellphone with an LTE dongle and set up SIP for \"legacy\" phoning services;\n3) design and assemble my own RasPi-based PDA. Well, as I got an A on \"Drawing and CAD\" for the term, looks like this is the way.\nChroot-based apps like Linux Deploy were used to be a good and high-compatible solution, but they won't resolve the hardware design issues.\nP.S. And reflashing a RasPi-based PDA would be much easier, as RasPi does store the firmware on a removable storage.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1589470828",
			"date_added": 1590134792
		},
		{
			"comment_id": 5,
			"body": "After in 2017 both FF and PM showed WebView-styled error pages, I realized that there is no sense of using a custom browser on Android, so now I just use a clean build of Chromium, like Bromite (of course, as development of Gello, a fork of the AOSP browser, has stopped).",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1602438855",
			"date_added": 1604240137
		},
		{
			"comment_id": 6,
			"body": "@Notime: So, to solve the problem, it just has to be publicly considered as a bad practice... But how?",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1602438855",
			"date_added": 1604240222
		},
		{
			"comment_id": 7,
			"body": "У меня откуда-то целых два таких сайта...",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1606942880",
			"date_added": 1606943371
		},
		{
			"comment_id": 8,
			"body": "@caryoscelus: похоже, что это уже безнадёжно: у меня 0N сейчас работает на малинке, включенной 24/7 то ли с середины, то ли вообще с начала ноября. За это время бывает, что на этих зайтах приличное число пиров появляется, но так до сих пор в \"connecting sites\" первые и висят...",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1606942880",
			"date_added": 1607165259
		},
		{
			"comment_id": 9,
			"body": "But a cup of tea after bath is better.))0)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1607522302",
			"date_added": 1607616899
		}
	]
}