{"cert_user_id": "MarBlen79@github", "next_topic_id": 2, "topic": [{"topic_id": 1604066357, "title": "ZeroNet Protocol and Developing apps", "body": "My question is regarding of the future of ZeroNet regarding better developer support.\r\n\r\nHaving an app and being able to remove the back-end using a tool like ZeroNet would be incredible useful for most of the apps out there.\r\n\r\nBut currently this idea doesn't seem possible. While it's great to be able to access different Zites when you run ZeroNet. Commercially speaking users/customer won't do all the work (Tor+ZeroNet+Zite url) to try a new website.\r\n\r\nAre there any plans to make a lightweight ZeroNet that can be integrated and use in the background without the client knowing? Like IPFS does.\r\n\r\nIs my believe that will make it more developer friendly and increase adoption.", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1518703222, "modified": 1562004970, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1289", "source_type": "github"}], "next_comment_id": 2, "comment": {"1604066357_mirrored_MarBlen79_github": [{"comment_id": 1, "body": "I was looking into this a little bit more and below are some ideas or ways to use ZeroNet like it is right now.\r\n\r\nDesktop applications:\r\nThere are examples of using Electron (app GUI) and zerorpc to connect JS with Python.\r\nZeroNet already provides ZeroFrame API so most of the job is done (zerorpc won't be needed).\r\nMaking a desktop app with Electron requires to manually change the code of this branch (removing tray icon, default website, sites that come with ZeroNet).\r\nCreating a ZeroNet \"core\" should solve this part. With \"core\" I mean no kind of UI just like an API that can be started in a thread.\r\nObviously, the current GUI can be added on top of the \"core\" version.\r\n\r\n\r\nMobile applications:\r\nIt's difficult creating mobile apps with Python. Qt is an option. Kivy is also one option, but according to the issues in ZeroNet-Kivy repo the UI gets buggy.\r\nMaybe doing something similar to what I said before can help the integration with Kivy. The problem is that if someone wants to use ZeroNet they are tied to doing it in Kivy which is not good (according to reviews is a lot slower).\r\n\r\nApache Cordova/Ionic won't work, since they are just webviews.\r\nI didn't look into React Native but it could be an option.\r\nNativeScript lets you create native apps with Javascript, according to the documentation you can create threads and integrate C++ code to the app.\r\n\r\nI am not sure if there is a way to easily go from Python to C. According to StackOverflow, Cython could be an option.\r\n\r\nI also found transcrypt.org which seems it can help porting Python to JS.\r\n\r\nI tried to integrate IPFS in an Apache Cordova app and it worked (including pub-sub). There are many websites built on top of IPFS because it's really easy to integrate it.\r\nI posted this issue to point out how much more developer friendly ZeroNet could be. Because as a developer, ZeroNet seems it could be easier and better to use when trying to create a P2P app.\r\n", "added": 1519209188, "modified": 1519209188, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1289#issuecomment-367326663", "source_type": "github"}]}}