{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "IDEIAS - O CAPITALISMO SE DESLOCA: NOVAS ARQUITETURAS SOCIAIS",
			"body": "Neste debate, o economista [Ladislau Dowbor](https://dowbor.org/) propõe analisar um conjunto de mudanças do capitalismo que sugere que estamos em transição para outro modo de produção, deixando para trás a chamada era industrial e inaugurando algo novo. Professor titular de pós-graduação da PUC-SP, Ladislau Dowbor apresentará seu novo livro '[O capitalismo se desloca: novas arquiteturas sociais](https://ipfs.infura.io/ipfs/QmaG5ALLAAam2acU5aq3PjsXGAqXFyV6Ns9Z9tQ9qFPSGX)', em fase de impressão pelas Edições Sesc, com a participação de Antônio Martins, jornalista e editor do site [Outras Palavras](https://outraspalavras.net/).\n- https://invidious.snopyta.org/watch?v=HN8LXk4IwkA\n- http://ipfs.io/ipfs/QmaResrwJbQaxdXHRXFb7dQo48X9hcbppUvgoMLnyvRfGL",
			"added": 1606015900
		},
		{
			"topic_id": 2,
			"title": "Brasil utiliza há mais de 60 anos criptografia de empresa que era controlada pela CIA, revelam documentos",
			"body": "Durante mais de seis décadas, dos anos 1950 a 2018, a empresa de criptografia suíça Crypto AG forneceu a 120 países do mundo aparelhos de comunicação secreta, [sem nunca revelar que tinha vínculos com a CIA](https://archive.is/f4Ocs). Enquanto chefes de Estado, líderes militares e diplomatas trocavam mensagens de alta importância estratégica acreditando estar em sigilo, na verdade eram espionados por agentes americanos e, na maior parte do tempo, por seus parceiros alemães.\nA Marinha, o Exército e o Itamaraty estiveram entre os clientes da empresa, mostram documentos inéditos descobertos por pesquisadores brasileiros e repassados ao GLOBO. Começando na década de 1950 e indo pelo menos até dezembro de 2019 — um ano depois de a Crypto AG mudar de mãos — órgãos de Estado do Brasil pagaram por equipamentos e serviços de comunicação secreta de uma empresa que, durante décadas, era na realidade controlada por serviços de inteligência dos Estados Unidos.\nAlguns dos produtos da empresa adquiridos pelo Brasil entre 2014 e 2019 têm como propósito equipar os submarinos brasileiros do programa [Prosub](https://archive.is/55oXv), atualmente em desenvolvimento. Descrito pela Marinha como “um dos maiores contratos internacionais já feitos pelo Brasil e o maior programa de capacitação industrial e tecnológica na história da indústria da defesa brasileira”, os submarinos podem estar vulneráveis à interceptação americana devido a dispositivos de comunicação propositalmente corrompidos.\n\n#‘O golpe do século’\nA maioria das denúncias contra a Crypto AG foi publicada em fevereiro deste ano no Washington Post por Greg Miller, correspondente de segurança nacional do jornal, em parceria com a TV alemã ZDF. No [texto](https://archive.is/55Myf) chamado “O golpe de inteligência do século: por décadas, a CIA leu as comunicações encriptadas de aliados e adversários”, Miller conta como a empresa suíça Crypto Aktiengesellschaft (Crypto AG), a princípio privada, passou para o controle da Agência Central de Inteligência (CIA) e de sua homóloga alemã, o Serviço Federal de Inteligência (BND) .\nBaseando-se em um relatório interno da CIA, Miller relata como, começando nos anos 1950, mas sobretudo a partir da década de 1970, estas agências, em parceria com a também americana Agência de Segurança Nacional (NSA), inseriram falhas ocultas nos códigos dos dispositivos para conseguirem ler mensagens criptografadas, ao mesmo tempo em que vendiam os aparelhos mundo afora.\nAlém de lidas, as mensagens eram frequentemente encaminhadas aos aliados mais próximos dos dois países. “Governos estrangeiros pagavam um bom dinheiro aos EUA e [ao que era então] a Alemanha Ocidental pelo privilégio de ter suas comunicações mais secretas lidas por pelo menos dois (e possivelmente cinco ou seis) países estrangeiros”, diz o documento da CIA. A Alemanha manteve-se sócia da empresa até 1992, quando, com receio de ser descoberta, abandonou a parceria.\nAs denúncias do Post comprovaram antigas suspeitas contra a Crypto AG. Em 1982, durante a Guerra das Malvinas, a Argentina convenceu-se de que mensagens secretas suas haviam sido decifradas por forças britânicas. Após um executivo da empresa suíça viajar para Buenos Aires, acabou persuadindo os argentinos de que o problema estava em um único equipamento desatualizado — conseguindo esconder que, na verdade, as informações foram entregues a Londres pelo governo Reagan.\nJá em 1992, o Irã tomou uma atitude contra a empresa. Após anos de suspeitas, deteve um vendedor da companhia durante 9 meses, até o pagamento de um resgate. O caso levou atenção midiática à Crypto AG, e várias reportagens nos anos seguintes investigaram o seu envolvimento com o governo americano. Uma dessas matérias foi [feita em 1995 pelo Baltimore Sun](https://archive.is/o44ZZ), e expunha parte do envolvimento da Crypto AG com a NSA. Segundo o Washington Post, isso reduziu muito o número de países que faziam negócios com a empresa, que se tornou deficitária.\nEsses antecedentes não foram suficiente para impedir o Estado brasileiro de contratar serviços da Crypto AG. Pelo contrário, a Marinha continuou a comprar produtos da empresa a até menos de um ano atrás. Procurada, a força afirmou por escrito anteontem que “a Marinha do Brasil (MB) desconhece, oficialmente, alegações de comprometimento da qualidade ou da segurança dos equipamentos” por ela adquiridos.\nA ligação da Crypto AG com o Brasil começou a ser mapeada por Vitelio Brustolin, professor de Estudos Estratégicos da Universidade Federal Fluminense (UFF) e pesquisador de Harvard, que convidou para ajudá-lo os colegas Dennison de Oliveira, da Universidade Federal do Paraná (UFPR), e Alcides Peron, da Universidade de São Paulo (USP). Ao vasculhar arquivos no Brasil e nos EUA, o trio encontrou várias situações em que órgãos brasileiros adquiriram equipamentos da Crypto AG, analisadas em um [artigo científico](https://ipfs.infura.io/ipfs/QmUtAyezbhv1jWewXaPzY2ih6uBdGKEVeniQTNRgrh8Bwc) publicado na última semana.\n\n#Compras recentes\nOs dados mais recentes envolvem a Marinha. Documentos no Portal da Transparência da CGU listam 27 despesas, com valores que chegam a R$ 1.371.826, pagas à Crypto AG entre 2014 e 2019. Nem todos detalham a que se referem os pagamentos, mas alguns especificam terem sido para a compra do dispositivo de criptografia HC-2650, assim como para softwares para o mesmo. Na maior nota, de 2015, o Comando da Marinha adquiriu 10 unidades do aparelho, ao custo de R$ 137.182 cada.\nSegundo um anúncio da Crypto AG, o HC-2650 é uma “plataforma de criptografia universal compatível com todas as faixas de frequência (HF, VHF, UHF, SatCom) (...) O flexível HC-2650 é adequado para conexão com todas as redes militares e para tornar todas as redes de rádio seguras (...) Unidades deste tipo continuarão a ser usadas em muitas redes no futuro, porque são criptograficamente, eletricamente e mecanicamente extremamente robustas e oferecem a maior confiabilidade”.\nNão se sabe onde todos os aparelhos adquiridos pelo Brasil são empregados nem se outros órgãos de Defesa os utilizam. Sabe-se que um destino dos dispositivos são os submarinos de propulsão convencional em desenvolvimento, que aparecem nominalmente listados em várias notas, incluindo uma de 25 de novembro de 2019, no valor de R$ 113.415,82, para atualização do software que opera no sistema do dispositivo HC-2650.\nO Brasil constrói quatro submarinos convencionais. O primeiro deles, o Riachuelo, está no mar desde 2018 e tem o fim dos testes no mar previsto para o mês que vem. O seu sistema de comunicação pode estar corrompido e vulnerável à interceptação estrangeira antes de que ele possa começar a cumprir seu propósito de, segundo a Marinha, “elevar substancialmente a capacidade de resposta eficiente do Poder Naval frente ao enorme desafio de controle e proteção da ‘Amazônia Azul’, que encerra grandes reservas naturais e representa um terço da extensa fronteira do país”.\n— Um submarino é uma arma estratégica. Um só submarino oculto cria um perigo para um adversário. Em algum momento, ele precisa se comunicar com a terra, e justamente nessa hora pode ser descoberto— afirmou Brustolin. —Se a sua comunicação pode ser interceptada e decifrada, se saberá o que o submarino irá fazer. Isso compromete toda a funcionalidade estratégica do equipamento.\n\n#Operação Condor\nAlém das descobertas relativas à Marinha, os pesquisadores identificaram o uso pelo governo brasileiro de dispositivos da Crypto AG décadas atrás. Na ditadura militar, de acordo com documentos do arquivo da Agência de Segurança Nacional americana, a NSA, [o Brasil chegou a fornecer equipamentos da Crypto AG](https://archive.is/4rhN6) aos outros países envolvidos na Operação Condor (Argentina, Chile, Bolívia, Paraguai e Uruguai, com eventual participação de outros países).\n“Todos os países pertencentes à organização Condor mantêm comunicações (...). O sistema de criptografia empregado pela Condor é um sistema de máquina manual de origem suíça entregue a todos os países da Condor pelos brasileiros e com a designação CX-52”, diz um documento. Como hoje se sabe que as máquinas sofreram interferência da NSA, os pesquisadores concluem que “isso prova que funcionários do governo americano estavam cientes dos sequestros, tortura e assassinatos realizados pelas ditaduras que participaram da Condor”.\nNo Arquivo Nacional, também foi descoberto um certificado de importação de 80 máquinas CX-52 e sete Hagelin B-621-b em 1971, adquiridas pelo Itamaraty diretamente da Embaixada da Suíça. Há ainda outros documentos do Itamaraty mencionando criptografia em 1965, 1960 e 1958.\nA menção mais antiga foi encontrada no arquivo da NSA e data de 1955. Aponta que, naquele ano, o Exército brasileiro já era cliente da Crypto AG, e tinha interesse em comprar 500 máquinas criptográficas. A empresa não acreditava que uma encomenda tão grande pudesse ser atendida de uma vez. Àquela altura, a Marinha já dispunha de pelo menos 60 equipamentos. Segundo os pesquisadores, há fortes evidências de que a empresa suíça era então a única fornecedora de dispositivos de criptografia ao Brasil. O país planejou começar a importar equipamento americano, mas Washington barrou o plano.\nNovos dados devem ser descobertos nos próximos anos, conforme documentos recém-disponibilizados no arquivo da NSA em Maryland forem analisados. Entre estes, há pastas reunidas pela Inteligência americana com nomes como “Codificação e decodificação no Brasil”, “Análise do trabalho criptográfico e criptoanálise no Brasil” e “Correspondência [do Brasil] de e para as embaixadas alemãs”.\nBrustolin afirma que provavelmente as máquinas da Crypto AG eram utilizadas por mais órgãos brasileiros:\n— Quando se utiliza esse tipo de máquina, você não pode ter de outros fornecedores, ou seus órgãos não se comunicam, por incompatibilidade. Havia poucos produtores deste tipo de equipamento, e a Crypto AG era o principal no mundo. Se você tem um equipamento dela no Itamaraty, para o ministério se comunicar com as Forças Armadas, precisará ser um aparelho da mesma empresa, ou então a mensagem não será lida. Então é possível que as demais máquinas empregadas pelo governo fossem compatíveis.\n\n#Resposta da Marinha\nEm sua resposta, além de afirmar que “desconhece, oficialmente, alegações de comprometimento da qualidade ou da segurança” dos equipamentos, a Marinha disse que estes “atendem requisitos técnicos e de segurança, e são amplamente testados pela Força antes de serem operacionalizados”. Acrescentou que os itens encontram-se em teste e não entraram em operação, e confirmou que alguns iriam para os submarinos.\nPor fim, a Marinha disse que “participa do desenvolvimento do RDS (Rádio Definido por Software) em conjunto com as demais Forças Armadas”, projeto que tem como objetivo o desenvolvimento de uma família de equipamentos de rádio. A Força acrescentou que “utiliza softwares e algoritmos próprios para a proteção de dados sigilosos”, sem especificar quais. O Ministério da Defesa não especificou se as outras Armas ainda são clientes da Crypto AG, mas disse que “as Forças Armadas zelam pela segurança das informações, tratando o assunto com todos os cuidados necessários”.\nEm 2014, a empresa “fortaleceu a sua presença na América Latina” com a abertura de um escritório na Barra da Tijuca, no Rio. Em 2015, ele era o único no Hemisfério Ocidental além de Zurique, e um dos únicos cinco do mundo. Não está claro até quando esta sede funcionou.\nEm 2018, após ter sido deficitária por anos, a empresa foi desmembrada. As contas internacionais foram vendidas para Andrew Linde, um empresário sueco, que afirmou ao Washington Post que desconhecia os acionistas da Crypto AG — que nunca vieram a público — quando a adquiriu. O atual nome operacional da empresa é Crypto International AG, e é ela que oferece os produtos que eram do portfólio da Crypto AG.\nNo site da empresa, há uma advertência de que “a empresa foi fundada em 2018 e tem um proprietário diferente, uma administração diferente e uma abordagem diferente em comparação à Crypto AG (...) Nunca houve qualquer afirmação de que um equipamento vendido pela Crypto International AG foi manipulado”. Procurada pela reportagem, a empresa confirmou vender a plataforma HC-2650, adquirida pela Marinha, mas disse que não cita os seus clientes.\n\n#História e 5G\nDe acordo com os pesquisadores, as descobertas levantam questionamentos sobre episódios históricos e também sobre a segurança nacional no presente. Dennison de Oliveira se pergunta, por exemplo, se EUA e Alemanha espionavam a comunicação sigilosa brasileira em 1975, época do acordo nuclear com a Alemanha. O Brasil negociava com os dois países e, após enfrentar jogo duro americano, assinou um pacto com os alemães. Oliveira suspeita que “houve um conluio entre os dois países, a par de tudo o que acontecia do lado brasileiro, para empurrar um acordo péssimo”.\n— Mas o programa nuclear é só um exemplo. A Operação Condor, comunicações relativas à Petrobras, à Embraer, ou a praticamente qualquer área da construção do Estado nacional, podem ter sido decisivamente impactadas pela espionagem eletrônica da Crypto.\nOs pesquisadores se perguntam por que o Brasil foi um dos poucos países a continuar a comprar da companhia, após amplas denúncias públicas e ela ter sido deixada de lado por vários países. Brustolin afirma que a melhor alternativa do ponto de vista estratégico é uma tecnologia de criptografia produzida pelo Estado. Ele cita um centro de criptografia dentro da Abin, e diz que o seu desenvolvimento é viável.\nO pesquisador aponta também uma consequência atual: [os EUA pressionam o Brasil a não adotar a tecnologia 5G chinesa](https://archive.is/j5cYv), acusando Pequim de adulterar os seus equipamentos para permitir espionagem. Brustolin se pergunta como essas acusações podem ser feitas por Washington, tendo em vista suas práticas de décadas.\n— [Quando veio ao Brasil](https://archive.is/egrMk), o conselheiro de Segurança Nacional dos EUA disse que a China adultera tecnologia para espionagem — afirmou. —Eu gostaria de saber se ele continuaria a dizer que a tecnologia de 5G americana é a mais segura. Denunciam muito a China, mas, até hoje, as únicas provas de equipamentos adulterados que temos são dos EUA. O governo brasileiro também precisa responder quais ações estão previstas no leilão para garantir que não haverá espionagem, qual solução oferecerá para esse problema. É importante termos consciência de que essa é uma discussão de soberania.\n\n- Fonte: https://web.archive.org/web/20201122182311/https://oglobo.globo.com/mundo/brasil-utiliza-ha-mais-de-60-anos-criptografia-de-empresa-que-era-controlada-pela-cia-revelam-documentos-24758960",
			"added": 1606071686
		},
		{
			"topic_id": 3,
			"title": "A direita mente sobre a esquerda",
			"body": "- https://invidious.snopyta.org/watch?v=eOxvK6HLnrE\n- https://ipfs.io/ipfs/QmRkjjXgKACH9DJdZNM3AMFT3yGq3UD8NzLKr9pe5WxsoV",
			"added": 1606511402
		},
		{
			"topic_id": 4,
			"title": "Leia todas as reportagens que o Intercept e parceiros produziram para a Vaza Jato",
			"body": "[Vaza Jato](https://pt.wikipedia.org/wiki/Vaza_Jato) é o termo pelo qual ficou conhecido, na imprensa brasileira, o vazamento de conversas, realizadas através do aplicativo [Telegram](https://telegram.org/), entre o ex-juiz [Sérgio Moro](https://pt.wikipedia.org/wiki/S%C3%A9rgio_Moro) e o promotor [Deltan Dallagnol](https://pt.wikipedia.org/wiki/Deltan_Dallagnol), além de outros integrantes da força-tarefa da [Operação Lava Jato](https://pt.wikipedia.org/wiki/Opera%C3%A7%C3%A3o_Lava_Jato).\n- https://theintercept.com/2020/01/20/linha-do-tempo-vaza-jato/\n- Internet Archive: https://web.archive.org/web/*/https://theintercept.com/2020/01/20/linha-do-tempo-vaza-jato/",
			"added": 1606697157
		},
		{
			"topic_id": 5,
			"title": "Minetest: Uma alternativa grátis e Open Source ao Minecraft",
			"body": "O Minetest é um jogo de aventura, sobrevivência e criação livre inspirado no [Minecraft](https://www.minecraft.net/). A diferença é que é absolutamente gratuito e open source. Graças a isto, o usuário base carrega continuamente novo conteúdo.\n- Site: https://www.minetest.net/\n- GitHub: https://github.com/minetest",
			"added": 1607985907
		}
	],
	"topic_vote": {
		"2_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ": 1,
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"2_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": 1
	},
	"next_comment_id": 189,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#O \"marxismo cultural\" de Yago Martins\n- https://invidious.snopyta.org/watch?v=AQluVqKfKLQ\n- https://siasky.net/AACcc33chwGIjEefdjM9S2aZkuvLueFdsS3cVPYNEhAq0Q\n\nNo atual vídeo refutamos as asneiras de Yago Martins do canal \"[Dois dedos de teologia](https://invidious.snopyta.org/channel/UCzGwyAyWLB2Si6VDFpq8rjw)\" no vídeo: [ENTENDA O QUE É MARXISMO CULTURAL](https://siasky.net/AABjybv6KLXzP3VGMNeDOeXy_Kj7sX9gZtErAx28RVXQdw)",
				"added": 1605751245
			},
			{
				"comment_id": 2,
				"body": "#KIM KATAGUIRI | Com esse gráfico o capitalismo venceu\n- https://invidious.snopyta.org/watch?v=_KIk7SZtEBs\n- https://siasky.net/AABd4wHw78Xb1w-a9FgOaJHYTZ2xHA5UtBJSeh4b0K6Uvw\n\nVídeo do [Kim Kataguiri](https://twitter.com/kimpkat): https://siasky.net/AADrYFk0kFqTll51D5qgvmAThsKCcm8P5TxymRdb3Okqtw",
				"added": 1605756664
			},
			{
				"comment_id": 37,
				"body": "#[Dos Antagonismos na Apropriação Capitalista da Água à sua Concepção como Bem Comum](https://ipfs.infura.io/ipfs/QmWvTJxj3hw53YCN1LvdeSknnhdnJbR3LVHb919w7foFq1)\nO artigo defende que, para compreender a apropriação capitalista da água em suas diversas manifestações, é necessário considerá-las como momentos da produção de valor, uma dimensão socialmente construída que organiza o metabolismo entre seres humanos e natureza na dinâmica da luta de classes. Fundamentado em Marx, propõe uma interpretação para o tema da água a partir da ontologia do ser social e problematiza a construção histórico-conceitual dos consensos em torno da concepção hegemônica da água como bem econômico, analisando suas implicações para a organização da gestão e do acesso. Constata-se que, de modo funcional a essa organização, a apropriação da água é tratada de modo fragmentado e desarticulado. Por outro lado, nas lutas sociais pela defesa de meios de vida ameaçados, emergem concepções que se contrapõem aos consensos sobre a água e ao valor social capitalista, apontando na direção de uma concepção universal da água como bem comum.",
				"added": 1606239143
			},
			{
				"comment_id": 38,
				"body": "#Reivindicando o Companheiro Orwell\n#George Orwell se tornou um espelho no qual qualquer posição política pode olhar e se ver olhando de volta. Mas não se engane – Orwell pertence à Esquerda.\n\nDurante a primeira semana de revelações sobre o programa “[Prism](http://127.0.0.1:43110/0sh.bit/?Hl1Z)” da Agência de Segurança Nacional (NSA) [1], George Orwell virou moda.\n\nOu, mais precisamente, ler (ou pelo menos possuir) ‘[1984](https://ipfs.infura.io/ipfs/QmbvmWKKz3exqLv4ae7e55Tk32eDEMaHUpJhDYLc9iukxX)’ de Orwell virou moda. As vendas do clássico dispararam acima de 7000% no Amazon poucos dias após a liberação dos primeiros relatos sobre a nova e sinistra forma de nossa cultura de vigilância.\n\nA súbita popularidade de Orwell tem um custo para o legado do autor. Ler ‘1984’ e ‘[A Revolução dos Bichos](https://ipfs.infura.io/ipfs/QmcpGNYJ61Z6kioaTokXKTX2qr6dNAM22EQz9FWoCxJQRZ)’ fornece apenas uma introdução simplista a um pensador complexo. Além disso, sua escrita e ação no meio de lutas mortíferas dentro da Esquerda tornaram seu legado difícil de entender sem uma análise detalhada de sua vida e obras.\n\nOrwell se tornou um espelho em que todo tipo de posições políticas pode olhar e, sem falhar, se ver olhando de volta. Já passou do tempo de recuperar Orwell como um companheiro na luta por um mundo melhor.\n\nInfelizmente, há mais do que alguns cultistas do Ron Paul, anarquistas de ‘alcance abrangente’ e hacktivistas ‘libertarianos’ [2] que vêem 1984 como um tipo de volume de companhia para ‘[A Revolta de Atlas](https://ipfs.infura.io/ipfs/QmVoiD7y95QMcS8s9E5FsvTuxteQF3MngsSvMAK9HTMJEm)’ [3]. Mesmo Glenn Beck freqüentemente cita partes selecionadas de Orwell. O falecido Christopher Hitchens deixou as águas ainda mais turvas, usando Orwell como um arquétipo para seu próprio abandono da Esquerda no fim da vida e subsequente apoio à “Guerra ao Terror” de George W. Bush.\n\n‘[A Revolução dos Bichos](https://ipfs.infura.io/ipfs/QmcpGNYJ61Z6kioaTokXKTX2qr6dNAM22EQz9FWoCxJQRZ)’ em si merece atenção especial, uma vez que se tornou um documento importante para os apologistas do capital e conhecido o bastante para que eles possam citá-lo sem lê-lo. Orwell enfrentou dificuldades para publicar o livro – menos por causa de seu conteúdo anti-stalinista, e mais porque as editoras acreditavam que sua mensagem glorificava as intenções e objetivos originais de Outubro de 1917 [4]. O poeta profundamente reacionário T.S. Eliot, por exemplo, desgostou intensamente do livro, porque acreditava que A Revolução dos Bichos sugeria que a resposta ao comunismo era “mais comunismo”.\n\nObscurecendo mais ainda as questões, o conhecimento do público geral do livro vem em grande parte de uma animação de 1954, que como Daniel J. Leab mostra em seu excelente ‘Orwell subverted’ [‘Orwell Subvertido’], recebeu financiamento da CIA. Feito vários anos após a morte de Orwell, o filme representa uma revisão grave do romance, sugerindo não que a Revolução Russa tivesse dado errado, mas que simplesmente nunca deveria ter ocorrido. As representações positivas de Leon Trotsky (“Bola de Neve” no livro) são suprimidas ou suavizadas. “Velho Major”, o filósofo envelhecido que é uma mistura de Marx e Lenin no romance, é feito para parecer gordo, estúpido e ridículo no filme.\n\nNos últimos anos de sua vida, o próprio Orwell contribuiu para a confusão sobre sua visão política. Firmemente à Esquerda, ele se associou aos socialistas anticomunistas que se tornaram profundamente desencantados com o curso da política externa soviética. Trabalhando com a ‘Partisan Review’, Orwell tornou-se um firme defensor da Oposição de Esquerda anti-stalinista.\n\nNos últimos meses de sua vida, ele também tomou a fatídica decisão de redigir uma lista de 35 nomes de simpatizantes estalinistas e apologistas liberais burgueses dos “julgamentos” de Stalin. Deve-se notar que Orwell esperava que o governo britânico usasse isso principalmente para propaganda; este não era o tipo de “lista” tão familiar no Comitê de Atividades Antiamericanas que assombra os Estados Unidos. Ainda assim, foi uma decisão indefensável para um moribundo que tinha um arquivo robusto no MI5 detalhando suas atividades e associados “comunistas”.\n\nA prolífica escrita de Orwell nos fornece uma melhor compreensão desses fatos isolados sobre sua biografia. De sua caneta (e do cano de sua arma na Guerra Civil Espanhola), o fascismo raramente teve um inimigo maior, e o socialismo poucos campeões maiores.\n\nTomemos, por exemplo, o seu ‘[Road to Wigan Pier](https://ipfs.infura.io/ipfs/QmbMGfFGSDzNVXUWwWXq5aebDfRD6BRRsnPD6wL1wZfL8Y)’ [no Brasil, ‘A Caminho de Wigan’], uma das declarações mais fortes  já escritas para a posição socialista. A primeira metade do livro apresenta um retrato profundamente comovente das condições de emprego e da experiência crua da vida, entre os mineiros de carvão no norte da Inglaterra. Ele recria o mundo “daqueles pobres burros de carga subterrâneos, enegrecido até os olhos, com suas gargantas cheias de poeira de carvão, empurrando suas pás para a frente com músculos de aço dos braços e barriga.”\n\nA segunda metade do livro constitui uma defesa vibrante da posição de “Extrema Esquerda” [5]. Depois de dar uma das mais completas e elegantes análises de atitudes de classe já escritas em inglês, Orwell diz essencialmente que nenhuma pessoa sã pode deixar de ver o socialismo como a única resposta real a esses problemas; apenas aqueles com a “motivação corrupta” de “se apegar ao sistema social atual” poderiam ficar em oposição a isso.\n\nE, no entanto, Orwell sendo Orwell, boa parte da segunda parte não poupa nenhum soco na sua crítica ao marxismo como expresso na política. Ele é impiedoso em sua crítica de “esnobes bolcheviques”, que são susceptíveis de se casar com ricos e acabar conservadores quando tiverem trinta e cinco anos. Não tem paciência para intelectuais comunistas que falam para a classe trabalhadora apenas na linguagem abstrusa da teoria. Poderíamos passar, diz ele, “com um pouco menos de conversa sobre ‘capitalista’ e ‘proletário’ e um pouco mais sobre os ‘ladrões’ e os ‘roubados’”.\n\nEm geral, Orwell via o socialismo em sua época como falhando em sua tarefa mais básica: ajudar a promover a consciência de classe. Que diferença faz, ele se pergunta em ‘A Caminho de Wigan’, quando um burguês se junta ao Partido Comunista Britânico? Não muita, conclui, como por vezes demais o cheiro de diletantismo poderia ser detectado.\n\nO que é necessário, ele acreditava, é um compromisso inabalável com a luta de classes e não o tipo de progressismo vago que muitas vezes prejudica a construção de um movimento de massas do povo. Este ódio às panelinhas esquerdistas e ao jargão de clubes às vezes levou Orwell a uma retórica facilmente levantada hoje por charlatões conservadores. Os vegetarianos o deixavam irritado. O ethos masculino que ele compartilhava com os colegas socialistas Jack London e Ernest Hemingway o cegou às conexões entre a disponibilidade de controle de natalidade e justiça econômica. Seu tom estentório sobre tais assuntos surgiu de sua insistência na centralidade da luta de classes. No fim, a luta de classes significava exatamente isso: uma guerra entre os ladrões e os roubados, e não uma subcultura de escolhas políticas peculiares. Os socialistas, ele sugere, são muitas vezes a pior propaganda do socialismo.\n\nOrwell também se prova presciente em sua discussão sobre redefinir categorias marxistas para o novo mundo que assistiu nascer. Se preocupava com o fato de que muita propaganda socialista representava o “trabalhador mítico” como o pedreiro ou mineiro corpulento em seu macacão. Ele sabia que “o trabalhador”, saído direto do Realismo Soviético, seria cada vez mais substituído por um novo tipo de proletariado trabalhando sob uma nova fase do capitalismo.\n\n“E o exército desgraçado de balconistas e lojistas?”, ele pergunta. Sua idéia pressagia nossa consciência atual das possibilidades de construir um movimento que inclua trabalhadores de cubículo e empregados de call center, os “colaboradores” de Walmarts e trabalhadores de redes de fast food. Orwell sabia que se usarmos a linguagem de explorador e explorado, a Esquerda pode defender seus argumentos. Aqueles que enfrentam a natureza viciosa do capitalismo através das longas horas de trabalho de cada dia conhecem a exploração em primeira mão. Eles não são diletantes e, Orwell nos lembra, a revolução pertence a eles.\n\nA luta para criar uma esquerda relevante dependerá da capacidade de falar uma linguagem de luta de classes sem cair no obscurantismo teórico comum aos marxistas na sociedade ocidental de hoje. A trincheira de Orwell em ‘O Caminho’ estaria ainda mais firme se tivesse visto o destino do marxismo nas últimas décadas. Nos Estados Unidos, o “marxista” aparece mais freqüentemente como um elemento nas subculturas acadêmicas da moda do que na ideologia de um movimento de massas.\n\nO primeiro passo para recuperar Orwell é ler Orwell. ‘O Caminho para Wigan’ e ‘Lutando na Espanha’ [‘Homage to Catalonia’, no original] são lugares óbvios para começar. Este último, tratando das suas experiências na guerra civil espanhola lutando com trotskistas [e anarquistas], coloca em contexto sua posição veementemente anti-stalinista.\n\nTambém vale a pena lembrar que, antes de mais nada, Orwell era um ensaísta inveterado, um dos mais prolíficos resenhadores de livros, filmes, peças de teatro e idéias que o século XX produziu. Ensaios como “Socialistas Podem Ser Felizes?” E até peças aparentemente não relacionadas sobre Charles Dickens, Tolstoi e sobre beber chá estão cheios de análises de classe e críticas ao capitalismo industrial que ele conheceu bem.\n\nO nome de Orwell e ‘1984’ continuam a ter uma ressonância tão poderosa que não é de se surpreender que tantos busquem sua sanção. E, como acontece com todos os pensadores complexos, é possível encontrar o que soa como citações de apoio em sua escrita e experiência de vida para uma série de ideologias.\n\nUsos mercenários de pedaços do trabalho de Orwell se destinam a apropriá-lo para fins reacionários, e não para os objetivos pelos quais ele passou sua vida lutando. Glenn Beck, embora um sem-vergonha, deveria ficar envergonhado. Christopher Hitchens fez um desserviço tentando reivindicá-lo como seu santo padroeiro. George Orwell pertence ao povo.\n\n#Notas\n\n- [1] O programa de vigilância digital generalizada revelado por Edward Snowden e Glenn Greenwald. O mesmo se repetiu após a eleição de Donald Trump como presidente dos EUA. [N.M.]\n\n- [2] Para uma discussão sobre o uso do termo, ver [Uma Filosofia Para o Proprietariado](https://web.archive.org/web/20200418212053/https://ominhocario.wordpress.com/2016/10/21/uma-filosofia-para-o-proprietariado/), de Rob Hunter. [N.M.]\n\n- [3] O mais famoso livro de Ayn Rand. Ver ‘[O Que Acontece Quando Você Acredita em Ayn Rand e na Teoria Econômica Moderna](https://web.archive.org/web/20200614060739/https://evonomics.com/o-que-acontece-quando-voce-acredita-em-ayn-rand-e-na-teoria-economica-moderna/)’, de Denise D. Cummins. [N.M.]\n\n- [4] Referência ao mês da Revolução Soviética na Rússia. [N.M.]\n\n- [5] No original, “hard left”. [N.M.]\n\n#Fonte: https://web.archive.org/web/20200614231817/https://ominhocario.wordpress.com/2017/04/04/reivindicando-o-companheiro-orwell/",
				"added": 1606242297
			},
			{
				"comment_id": 39,
				"body": "#Estratégia socialista e Revolução Brasileira\n- https://invidious.snopyta.org/watch?v=Nmue54LNAc4\n- https://siasky.net/AAAA4dCabBQYYBm9IQ6UegR18CmmH9P0BNBapZDtHC6PZw\n\n#A teoria das classes sociais no marxismo\n- https://invidious.snopyta.org/watch?v=InIGgU0v02c\n- https://siasky.net/AACcqNxmD2RGHSM7CYLmt9vLzTS5bkZm2SGCJ0ceGlyRTw\n\n#Educação popular e consciência de classe\n- https://invidious.snopyta.org/watch?v=oibBwc_aWmk\n- https://siasky.net/AAB30NGPujhs9o_AuEksao9oJHI0OTEmI7X7MUevIItaFA",
				"added": 1606266668
			},
			{
				"comment_id": 40,
				"body": "#Livre mercado, latifúndio e fome no Brasil\n- https://invidious.snopyta.org/watch?v=qL_DODRM4sk\n- https://siasky.net/AACL630H2SS3O4hAAPX6KAMp6AXJ-pFY3NdxepA36FvkhA",
				"added": 1606270828
			},
			{
				"comment_id": 41,
				"body": "#As armadilhas do desenvolvimentismo: imperialismo e dependência na América Latina\n- https://invidious.snopyta.org/watch?v=R-7q8mi5Ehs\n- https://siasky.net/AACAbyk6CYLOaZUEz32D2P5iFytAKQqROWyL6zyL6oC9kg",
				"added": 1606273060
			},
			{
				"comment_id": 42,
				"body": "#[O canto da sereia: social-liberalismo, novo desenvolvimentismo e supremacia burguesa no capitalismo dependente brasileiro](https://ipfs.io/ipfs/QmZMJ49YLKcmUD2zNtfo6AqRPZq4xTbZiKhdUccYLheAPM)\nEm meados dos anos 2000, a ideologia neodesenvolvimentista surgiu no cenário político brasileiro e apresentou-se como uma alternativa ao neoliberalismo. Desde então, criou-se uma controvérsia em torno da suposta ruptura dos governos do Partido dos Trabalhadores (PT) com o projeto neoliberal. Recuperando correntes clássicas do pensamento social brasileiro, que remete a autores como Caio Prado Jr., Florestan Fernandes, Octavio Ianni, Ruy Mauro Marini, dentre outros, o presente artigo pretende trazer uma contribuição àquela polêmica, centrando-se no debate sobre a política econômica e seus impactos sobre a economia política do capitalismo dependente brasileiro. As suas perguntas centrais são: qual é o papel do novo desenvolvimentismo na etapa contemporânea do capitalismo dependente? É correto afirmar que esta ideologia supera o social-liberalismo e detém a hegemonia na pavimentação do capitalismo no nosso país, deslocando a plutocracia dos seus postos dominantes no bloco histórico neoliberal?",
				"added": 1606274222
			},
			{
				"comment_id": 43,
				"body": "#Social-liberalismo e pós-política: armadilhas da burguesia\n- https://invidious.snopyta.org/watch?v=C0T-6CbqptI\n- https://siasky.net/AACadQq6n_evnxnZ5G3DeARcqpDagzA549olkmAX0rkAQQ",
				"added": 1606276759
			},
			{
				"comment_id": 44,
				"body": "#Como manter um país na pobreza? O desenvolvimento do subdesenvolvimento\n- https://invidious.snopyta.org/watch?v=j2QZ-Q8rhA8\n- https://siasky.net/AAD-BPA8NfRMOlWN00ERr1QnS5cYfAcXRPIaIiRkZyU9ig",
				"added": 1606279351
			},
			{
				"comment_id": 56,
				"body": "#Anti-libertarianismo: mercados, filosofia e mito\nAutor: Alan Haworth\n- https://ipfs.infura.io/ipfs/QmVL5FuZp6qc2P9mGCXTUort8F5hTvexPcwoc642tNxqq3\n\nOs defensores do livre mercado afirmam que seu é o único mecanismo econômico que respeita e promove a liberdade humana. O socialismo, dizem eles, foi totalmente desacreditado. A maioria dos libertários trata o estado em qualquer coisa que não seja sua forma mínima, 'vigia noturno', como uma personificação repressiva do mal. Alguns rejeitam o estado completamente.\nMas a 'ideia de mercado livre' é uma crença racionalmente defensável? Ou seus proponentes deixam de examinar as raízes filosóficas de sua chamada liberdade? O anti-libertarianismo tem uma visão cética dos princípios conceituais da política de livre mercado. Alan Haworth argumenta que o libertarianismo é pouco mais do que uma declaração de fé infundada e quase religiosa: um romance de mercado. Além disso, o libertarianismo é exposto como profundamente antitético à própria liberdade que pretende promover.\nEste livro controverso é para qualquer pessoa interessada no impacto cultural e político das políticas de mercado livre no mundo moderno. Será inestimável para estudantes e especialistas em teoria política e econômica, ciências sociais e filosofia.",
				"added": 1606390321
			},
			{
				"comment_id": 75,
				"body": "#A direita mente sobre a esquerda\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:3_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K/A+direita+mente+sobre+a+esquerda",
				"added": 1606511870
			},
			{
				"comment_id": 100,
				"body": "#...E Naquele Dia Mataram a Felicidade (2013)\nDocumentário sobre a vida de [Thomas Sankara](https://web.archive.org/web/20201120170730/http://www.dw.com/pt-002/thomas-sankara-o-l%C3%ADder-vision%C3%A1rio/a-41780185), líder revolucionário de [Burquina Faso](https://en.wikipedia.org/wiki/Burkina_Faso).\n- https://invidious.snopyta.org/watch?v=20u-WWjM_50\n- https://siasky.net/CAAitRVcH9iW9xMcKlVmoARqKRk80_wvk4TXMffb7EZHGg",
				"added": 1606790519
			},
			{
				"comment_id": 106,
				"body": "#ENGELS | O mito de seu \"testamento\" político\n- https://invidious.snopyta.org/watch?v=vsESJA8zh-o\n- https://siasky.net/AADFKn8P_Q1CIJX5jnE8OOH-Psd6vnqI2D-JQ8jS1ia8Kw\n\nENGELS || Em homenagem aos 200 anos de Friedrich Engels, veremos nesse vídeo como um de seus últimos textos, a Introdução ao [as Lutas de Classes na França](https://ipfs.infura.io/ipfs/QmPsRunJ5fX77JHzkECwauvW7L922Hs5oRxhd8s1x7KHEL) de Marx, teve seu conteúdo falsificado para justificar uma estratégia institucional, eleitoral, legal e oportunista de socialismo.\n\nArtigo sugerido de Francesco Ricci: https://web.archive.org/web/20200922051042/https://teoriaerevolucao.pstu.org.br/o-testamento-falsificado-de-engels-uma-lenda-dos-oportunistas/",
				"added": 1607046856
			},
			{
				"comment_id": 108,
				"body": "#A armadilha da renda básica (universal): desemprego e luta de classes\n- https://invidious.snopyta.org/watch?v=xaQoRmIcexc\n- https://siasky.net/AABgfigJ3nF0WAb_fxUY8ff9r_jOdzvHdAy7BYhY71db4Q",
				"added": 1607049690
			},
			{
				"comment_id": 122,
				"body": "#PRIVATIZAÇÕES: O (nada secreto) PLANO DA DOUTRINA GUEDES | CartaConectada com Sabrina Fernandes\n- https://invidious.snopyta.org/watch?v=VcOw2K4wIOw\n- https://siasky.net/AABiQjnlKwBiLZvxHZVuC89hGGyMpd87_SLzCophdCVrQw\n\nUm dos grandes objetivos do governo neoliberal de Jair Bolsonaro - em especial de seu ministro da Economia, Paulo Guedes - é privatização de grandes empresas estatais. E as joias da coroa desse processo de desmonte do Estado são os Correios, a Petrobras e a Eletrobras.",
				"added": 1607205515
			},
			{
				"comment_id": 131,
				"body": "#O Dilema das Redes (sociais) | Netflix COMENTANDO FILMES\n- https://invidious.snopyta.org/watch?v=qcfrp_UIvO4\n- https://ipfs.io/ipfs/QmYbAsLtxgSgpvZP3iPWrpVz8bCwzXX2LSjRYb3vjtL9qd\n\nO DILEMA DAS REDES (SOCIAIS) | Comentando o documentário recente da Netflix que aborda os algoritmos e os diversos efeitos produzidos pelas redes sociais ligados à dependência, manipulação, fake news, teorias da conspiração, etc...\nSerá que o problema são as redes sociais propriamente ditas?\n#Documentário \"O Dilema das Redes\": https://ipfs.io/ipfs/QmWymVbWNLmETCwBMCutm3Kp2Gvpz3HSjkhHfcwfvPX6o7",
				"added": 1607295495
			},
			{
				"comment_id": 167,
				"body": "#[Hannah Arendt, Losurdo e a questão do totalitarismo: algumas aproximações](https://ipfs.infura.io/ipfs/QmedcxhmQqRhhSP2j6NjqHgYJ1d86ZrtMWgqMyEkEdMj77)\nEsse artigo é uma tentativa de cotejar o mais influente livro sobre o chamado totalitarismo, de Hannah Arendt, e as formulações críticas a ele elaboradas por Domenico Losurdo. A hipótese mais geral é que Losurdo, embora eficaz na crítica à identificação de nazismo e stalinismo, mantém-se, apesar de suas inúmeras contribuições, no plano descritivo, abrindo mão de questionar os fundamentos teórico-metodológicos de sua contraposição a Hannah Arendt, o que prejudica a crítica mais profunda do conceito de totalitarismo e a apresentação de uma explicação alternativa do stalinismo.",
				"added": 1607650155
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 3,
				"body": "#Cérebro humano tem semelhanças intrigantes com teia cósmica de galáxias\nUm astrofísico e um neurocirurgião pode parecer uma dupla que tenha pouco a estudar em conjunto, mas Franco Vazza (Universidade de Bologna) e Alberto Feletti (Universidade de Verona) mostraram que é possível estabelecer paralelos entre campos do saber que aparentam ser totalmente desconexos.\nOs dois compararam a rede de neurônios do cérebro humano com a rede cósmica das galáxias - e encontraram similaridades surpreendentes.\nÉ fato que a diferença de dimensões é descomunal, mas a dupla não partiu do nada: Eles começaram o estudo porque viram que existem alguns paralelos interessantes.\nA teia cósmica estudada tem cerca de 100 bilhões de galáxias, enquanto o cérebro humano tem calculados 69 bilhões de neurônios. Nos dois sistemas, apenas 30% são constituídos pela massa das galáxias e dos neurônios. As galáxias e os neurônios se organizam em longos filamentos, com nós entre os filamentos. E, finalmente, nos dois sistemas, 70% da distribuição de massa ou energia é composta de componentes desempenhando um papel aparentemente passivo - a água, no caso do cérebro, e a energia escura, no caso do Universo observável.\nAssim, não é tão surpreendente que a análise quantitativa feita pelos dois cientistas italianos revele que processos físicos muito diferentes podem dar origem a estruturas com níveis similares de complexidade e auto-organização.\n\n- https://web.archive.org/web/20201118110236/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=cerebro-humano-semelhancas-teia-cosmica-galaxias&id=010130201117\n- Artigo: [The Quantitative Comparison Between the Neuronal Network and the Cosmic Web](https://ipfs.infura.io/ipfs/QmZctCHNWeo3CAFYoirrfeSBEgSAxESF6gGTxDiPaRuM5q)",
				"added": 1605757242
			},
			{
				"comment_id": 8,
				"body": "#Ondas temporais podem emergir da dilatação quântica do tempo\nO fenômeno da [superposição quântica](https://en.wikipedia.org/wiki/Quantum_superposition) é ótimo para a próxima geração da computação porque permite que os bits dos computadores quânticos guardem mais de um dado ao mesmo tempo.\nMas os físicos estão desconfiando que essa mesma superposição quântica possa atrapalhar o registro do tempo nos relógios de altíssima precisão, os chamados [relógios atômicos](https://en.wikipedia.org/wiki/Atomic_clock), usados para sincronizar as comunicações via satélite, controlar os sistemas de GPS e uma infinidade de outros usos, na tecnologia e no laboratório.\nA suspeita é que a superposição possa gerar o que os físicos estão chamando de \"dilatação quântica do tempo\", algo que mexe com a própria [natureza do tempo - ou do que entendemos que o tempo seja](https://web.archive.org/web/20201016100324/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=universo-tem-relogio-fundamental-batendo-peito&id=010130200707).\nEm outras palavras, assim como a gravidade emerge da geometria do tecido do espaço-tempo, e as ondas gravitacionais movem-se por esse mesmo tecido, parece existir um grau de liberdade do tempo, onde \"ondas temporais\" são criadas por uma dilatação do tempo ou por um encurtamento do tempo, conforme o caso.\n\"Sempre que desenvolvemos relógios melhores, aprendemos algo novo sobre o mundo,\" disse Alexander Smith, do Dartmouth College, nos EUA. \"A dilatação quântica do tempo é uma consequência tanto da mecânica quântica quanto da relatividade de Einstein e, portanto, oferece uma nova possibilidade de testar a física fundamental na interseção das duas.\"\n- https://web.archive.org/web/20201120115846/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=ondas-temporais-emergir-dilatacao-quantica-tempo&id=010130201120\n- Artigo: [Quantum clocks observe classical and quantum time dilation](https://ipfs.infura.io/ipfs/QmXCTp3GundaAbdUff9e2uYwnsrpzqgjJvpW55dHRvso2S)",
				"added": 1605885737
			},
			{
				"comment_id": 22,
				"body": "#Aceleração do universo e criação gravitacional de matéria escura fria: novos modelos e testes observacionais\n- https://ipfs.infura.io/ipfs/QmTrk7GUvtaLMhvQjEmKj2LbfAowHKNaaCnwtzKpk2oetZ\n\n#Reduzindo o setor escuro do Universo: uma nova cosmologia acelerada com criação de matéria escura fria\n- https://ipfs.infura.io/ipfs/QmS3SGSxoRtBZJCez9kLBed8uZvr7nFX5m4LTpCHkjvxPD",
				"added": 1605997025
			},
			{
				"comment_id": 23,
				"body": "#Matéria escura pode ter sabores misturados e evaporação quântica\nOs astrofísicos acreditam que cerca de 80% da matéria do nosso Universo é composta de uma misteriosa \"matéria escura\", que não pode ser percebida pelos sentidos humanos e nem detectada pelos instrumentos científicos.\nA ideia vem das observações da enorme velocidade com que as galáxias giram. Deve haver alguma coisa que gere uma gravidade que evite que elas se esfacelem, arremessando estrelas para todos os lados - essa \"alguma coisa\" recebeu a denominação de [matéria escura](https://en.wikipedia.org/wiki/Dark_matter).\nComo nenhum experimento conseguiu detectar qualquer indício da matéria escura até agora, há uma verdadeira corrida para tentar explicá-la de uma forma que faça mais sentido.\nMikhail Medvedev, professor de física e astronomia da Universidade do Kansas, nos Estados Unidos, está propondo agora um novo modelo para explicar a matéria escura, que ele batizou de \"matéria escura multicomponente de sabores misturados.\"\n- https://web.archive.org/web/20201121221022/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=materia-escura-ter-sabores-misturados-evaporacao-quantica\n- Artigo: [Cosmological Simulations of Multicomponent Cold Dark Matter](https://ipfs.infura.io/ipfs/QmYBK6btBfWL7T5aXCtmPfzGQTjnf2CSL1nj7mDmSoM6Gv)",
				"added": 1605997846
			},
			{
				"comment_id": 45,
				"body": "#Para se livrar do conceito de matéria escura, a gravidade teria que ser muito estranha, dizem cosmólogos\nA [matéria escura](https://en.wikipedia.org/wiki/Dark_matter), o material invisível cuja gravidade supostamente mantém as galáxias unidas, pode ser o conceito menos satisfatório da física. Mas se você quiser se livrar dele, um novo estudo descobriu, você precisará substituí-lo por algo ainda mais bizarro: uma força de gravidade que, em algumas distâncias, junta objetos massivos e, em outras distâncias, os empurra separados. A análise ressalta o quão difícil é explicar a matéria escura.\n- https://web.archive.org/web/20201122141826/https://www.sciencemag.org/news/2020/11/explain-away-dark-matter-gravity-would-have-be-really-weird-cosmologists-say\n- Artigo: [What Is the Price of Abandoning Dark Matter? Cosmological Constraints on Alternative Gravity Theories](https://ipfs.infura.io/ipfs/QmNTSAThNs1TYPaR6VRmqKbKFefMTWQrVg3wg7CBez1MPF)",
				"added": 1606323002
			},
			{
				"comment_id": 46,
				"body": "#Um bilhão de pêndulos minúsculos poderá detectar matéria escura\nTodos os [experimentos feitos até hoje para detectar a matéria escura](https://web.archive.org/web/20201031235644if_/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=em-busca-materia-escura-detector-capta-sinal-enigmatico&id=010130201014#.X535x7MYw1k) - e foram muitos - voltaram de mãos vazias, de modo que continuamos sem entender o que gera a gravidade que mantém as galáxias coesas.\nA massa da matéria comum não seria suficiente para isso, o que leva os cosmologistas a estimarem que existe um \"algo a mais\" que representa 27% da massa do Universo, contra apenas 5% da matéria de que nós e as estrelas somos feitos - os outros 68% seriam a energia escura, que explicaria porque o Universo está se expandindo.\nCom a falta de resultados, os físicos estão deixando de lado as teorias usadas para embasar esses experimentos - a mais famosa delas fala de partículas conhecidas como [WIMPs](https://en.wikipedia.org/wiki/Weakly_interacting_massive_particles) - e partindo em busca de novas possíveis explicações.\nEncorajados pelo [sucesso na detecção das ondas gravitacionais](https://web.archive.org/web/20201114034527if_/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=familias-buracos-negros&id=010130201102#.X69S4rMYw1k), Daniel Carney e seus colegas da Universidade de Maryland, nos EUA, estão propondo dois experimentos que deverão detectar a matéria escura unicamente por seus efeitos gravitacionais, ao contrário das tentativas feitas até hoje, que tentaram detectar as hipotéticas partículas de matéria escura conforme eles colidissem com substâncias químicas comuns, emitindo luz ou liberando carga elétrica nesses choques - só para relembrar, isso não funcionou.\n- https://web.archive.org/web/20201125120658/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=um-bilhao-pendulos-minusculos-podera-detectar-materia-escura&id=010130201125\n- Artigo: [Proposal for gravitational direct detection of dark matter](https://ipfs.infura.io/ipfs/QmXUJtPXXcBfyEgLaPGDXGSF7jRWQksbtwebqAYeN5bvr6)",
				"added": 1606323694
			},
			{
				"comment_id": 49,
				"body": "#Estranhas 'moléculas gravitacionais' poderiam orbitar buracos negros como elétrons girando em torno de átomos\nUma equipe de pesquisadores mostrou que um tipo especial de partícula pode existir ao redor de um par de buracos negros da mesma forma que um elétron pode existir ao redor de um par de átomos de hidrogênio - o primeiro exemplo de uma \"molécula gravitacional\". Este estranho objeto pode nos dar dicas sobre a identidade da matéria escura e a natureza última do espaço-tempo.\n- https://web.archive.org/web/20201119133254/https://www.livescience.com/black-holes-gravitational-molecules-evidence.html\n- Artigo: [Black hole binaries and light fields: gravitational molecules](https://ipfs.infura.io/ipfs/QmUgTiffgu2L8ANnin6aowzYKJbaJxMtFDwCuDzWSmiLQ4)",
				"added": 1606327712
			},
			{
				"comment_id": 50,
				"body": "#ACERVO SEM FRONTEIRAS BURACOS NEGROS\n- https://vimeo.com/461570311/157663da47\n- http://ipfs.io/ipfs/QmUteMSs8AfLFFwMNfjXyoAs6dgm1NYo1TB1uRHX68Pxh9\n\nTema do programa Sem Fronteiras, da GloboNews, a matéria do correspondente internacional Jorge Pontual destacou o [primeiro registro, divulgado em 2019, da região no espaço que tem o campo gravitacional tão intenso a ponto de atrair para seu interior tudo aquilo que a rodeia](https://web.archive.org/web/20200418213530/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=astronomos-obtem-primeira-imagem-buraco-negro&id=010130190410).\n“A notícia celebrada como um dos maiores feitos científicos do ano vai ser lembrada por séculos”, afirmou o jornalista. Para alcançar o feito, foi necessária a organização de uma colaboração inédita de mais de 200 cientistas de todo o mundo. O próximo passo vai ser descobrir o [buraco negro existente no centro da Via Láctea](https://en.wikipedia.org/wiki/Sagittarius_A*), um trabalho que envolve “perseverança, paciência e cooperação”.\nNa reportagem especial, Pontual entrevista uma série de especialistas envolvidos nesta grande força-tarefa científica. Tentar registrar um buraco negro foi uma ideia que surgiu no início dos anos 90, quando o astrônomo  Sheperd Doeleman decidiu que faria a primeira imagem. A equipe chefiada pelo especialista alcançou o feito mais de 25 anos depois e, para divulgar a imagem, levaram 10 meses. “Grupos de trabalho espalhados pela Europa, Ásia, África, Europa e América do Sul e do Norte guardaram segredo por esse tempo todo para fazer todos os testes e garantir que a imagem era mesmo real”, explicou o jornalista.\n- Fonte: https://web.archive.org/web/20201118212110/https://impa.br/noticias/1o-lugar-no-premio-impa-sbm-traz-misterios-dos-buracos-negros/",
				"added": 1606332833
			},
			{
				"comment_id": 53,
				"body": "#Lei universal da física descoberta graças a uma gota de azeite\nParece um experimento simples: Com apenas dois espelhos e uma gota de [azeite de oliva](https://en.wikipedia.org/wiki/Olive_oil), um grupo de pesquisadores conseguiu descobrir uma lei universal da física.\nMas não se trata de qualquer tipo de espelho. São de extrema qualidade, curvos e com um tamanho entre 10 e 50 vezes menor que a espessura de um fio de cabelo. Já o azeite era do tipo comum mesmo e foi comprado em um supermercado pela equipe.\nO experimento trata de fótons interagindo com outros fótons do presente e do passado ao mesmo tempo.\nTudo começa com o conceito de biestabilidade. \"Imagine um bit de computador que pode estar em dois estados: 0 ou 1. O problema é que você tem um único comando. Portanto, se você pressionar um botão, é provável que o bit caia para 0 ou caia em 1,\" relata o físico mexicano Said Rodríguez, atualmente no instituto científico Amolf, nos Países Baixos.\nAgora vem um segundo conceito: biestabilidade em um sistema com memória. \"Agora imagine que você lança uma moeda para o alto e dê cara. Então a lança novamente. O resultado depende de já ter saído cara antes? Não deveria e, na maior parte dos sistemas, não depende. Mas, para este sistema, sim. Isso é o que o torna especial,\" esclarece Rodríguez.\nEm outras palavras, a probabilidade depende do que aconteceu no passado, em sua história. Por isso se diz que o sistema tem memória.\n- https://web.archive.org/web/20200927080209/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=lei-universal-fisica-descoberta-gracas-gota-azeite&id=010115200511\n- Artigos: https://ipfs.io/ipfs/QmZM7cABqwDhPgVenQiu3fabwYV8N46yz5Uy8jMpaGSeaw",
				"added": 1606337537
			},
			{
				"comment_id": 60,
				"body": "#Cosmologia quântica em gravidade Teleparalela - [Dr. Alexandre da Silva Fernandes](http://lattes.cnpq.br/2788492661861895)\n- https://invidious.snopyta.org/-txzOfeV5tQ\n- https://ipfs.io/ipfs/QmPKcgHo8ucN8zE7ZaUatvMjcQuPunQ1s8oCCUTVaJZzdZ\n\nSlides: https://ipfs.io/ipfs/QmWZeaqnwBDozZkyVwVpLcSof7KZrVAGLuBT7KtJEkbWu1",
				"added": 1606440691
			},
			{
				"comment_id": 61,
				"body": "#Breve introdução à teoria das cordas - [Ms. Vilson Fabrício dos Santos Juliatto](http://lattes.cnpq.br/8349471402927202)\n- https://invidious.snopyta.org/s1C9IQFFnLE\n- http://ipfs.io/ipfs/Qmbkc5uDYDnoV17mF7b2nV94WkQG8en3sM6KbGRrsxhZrb",
				"added": 1606440794
			},
			{
				"comment_id": 62,
				"body": "#A EQUAÇÃO DE UM MILHÃO DE DÓLARES! ([Equação de Navier-Stokes](https://www.claymath.org/millennium-problems/navier%E2%80%93stokes-equation))\n- https://invidious.snopyta.org/AeautqGKg2w\n- http://ipfs.io/ipfs/QmSiTj9b6kGyDCURpKv6hakWcjiVwxH97YwCCoBLuFwnbt",
				"added": 1606442988
			},
			{
				"comment_id": 68,
				"body": "#Leis da Física variam ao longo do Universo\nUm dos mais queridos princípios da ciência - a constância das leis da física - pode não ser verdadeiro.\nUm estudo publicado na mais conceituada revista de física, a Physical Review Letters, afirma que as leis da natureza podem variar ao longo do Universo.\nO estudo concluiu que uma das quatro forças fundamentais, o [eletromagnetismo](https://en.wikipedia.org/wiki/Electromagnetism), parece variar de um lugar para outro.\nO eletromagnetismo é medido por meio da chamada [constante de estrutura fina](https://en.wikipedia.org/wiki/Fine-structure_constant), simbolizada pela letra grega alfa (α).\n- https://web.archive.org/web/20200724155843/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=leis-fisica-variam-longo-universo&id=010830111103\n- Artigo: [Indications of a Spatial Variation of the Fine Structure Constant](https://ipfs.infura.io/ipfs/QmU6VwJ7kjapjQNRkN7Cs4DpggqrhwUZWSnd5HaveuAwM6)",
				"added": 1606504531
			},
			{
				"comment_id": 70,
				"body": "#A pior previsão já feita pela Física pode ter sido solucionada\nVocê conhece a história: [Einstein](https://en.wikipedia.org/wiki/Albert_Einstein) acreditava que o Universo era estático, embora sua teoria indicasse outra coisa. Para ajeitar tudo, ele introduziu em suas equações a [constante cosmológica](https://en.wikipedia.org/wiki/Cosmological_constant) λ (lambda), e o Universo parou.\nA parada - apenas na cabeça dos físicos, é claro - foi rápida porque, em 1929, [Georges Lemaitre descobriu a expansão do Universo](https://web.archive.org/web/20200806134037/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=georges-lemaitre-descobriu-expansao-universo&id=010130111119) com dados observacionais, o que fez Einstein chamar sua constante de \"a maior mancada da minha vida\" (The greatest blunder of my life).\nA coisa ficou mais séria em 1998, quando a análise de [supernovas](https://en.wikipedia.org/wiki/Supernova) distantes mostrou que o Universo estava não apenas acelerando, mas que essa aceleração estava se tornando cada vez maior.\nA constante cosmológica foi mais uma vez chamada à cena para descrever o fenômeno, que os físicos chamam de \"energia do vácuo\", uma energia cuja natureza é desconhecida - hoje ela é chamada de [energia escura](https://en.wikipedia.org/wiki/Dark_energy), quintessência e outros nomes menos comuns -, mas à qual é atribuída a responsabilidade pela [aceleração da expansão do Universo](https://en.wikipedia.org/wiki/Accelerating_expansion_of_the_universe).\nMas aí surgiu um problema ainda maior, talvez o maior de toda a Física.\nA teoria prevê que a constante cosmológica vale 3,83 × 10^+69 m^-2. As observações mais precisas já feitas, por sua vez, com base na [radiação de fundo de micro-ondas](https://en.wikipedia.org/wiki/Cosmic_microwave_background), chegaram a um valor de 1,11 × 10^-52 m^-2, o que é minúsculo, mas ainda assim suficiente para explicar a expansão acelerada.\nEssa diferença gigantesca - 10^+121, isto é, um \"1\" seguido de 121 \"0\" - passou a ser conhecida como a pior previsão já feita por qualquer teoria no campo da Física.\n\n#Constantes que variam\nAgora, Lucas Lombriser, da Universidade de Genebra, na Suíça, quer tirar essa sujeira de debaixo do tapete. E, para isso, ele teve uma ideia, por assim dizer, mirabolante.\nO truque consiste em introduzir uma variação na [constante universal de gravitação](https://en.wikipedia.org/wiki/Gravitational_constant) G, bolada por [Newton](https://en.wikipedia.org/wiki/Isaac_Newton), mas que aparece nas equações de Einstein.\nSim, uma variação em uma constante significa torná-la \"inconstante\". A ideia de \"[constantes inconstantes](https://web.archive.org/web/20200724155843if_/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=leis-fisica-variam-longo-universo&id=010830111103#.XxsFP7MYw1k)\" não é exatamente nova para os físicos, e há mesmo alguns indícios experimentais de que a [força da gravidade pode não ser constante](https://web.archive.org/web/20180409004328if_/http://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=forca-gravidade-nao-constante&id=010130130917#.Wsq3SLMYw1k).\n\n- https://web.archive.org/web/20191206/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=a-pior-previsao-ja-feita-pela-fisica-ter-sido-solucionada&id=010130190910\n- Artigo: [On the cosmological constant problem](https://ipfs.infura.io/ipfs/QmNyTk1kdPsxtRQ7EN8kXjQXktWNvsoBqeg8NS4h9qhZ8M)",
				"added": 1606505215
			},
			{
				"comment_id": 86,
				"body": "#Ondas gravitacionais poderão comprovar desaparecimento de dimensões\nUma nova teoria soluciona alguns problemas da cosmologia e da física de partículas ao propor que o Universo primordial continha menos dimensões espaciais do que as três que nós experimentamos hoje.\nA teoria também propõe que nosso Universo atual tem quatro dimensões espaciais, mas nós detectamos apenas uma \"fatia\" de três dimensões desse espaço quadridimensional.\nEssa quarta dimensão espacial do tempo, segundo a teoria, teria fornecido uma energia extra, que turbinou a expansão do Universo.\nEsse impulso adicional poderia explicar a aceleração da expansão do Universo, que foi descoberta em 1998 e que é geralmente explicada como sendo uma resultante de uma misteriosa \"[energia escura](https://en.wikipedia.org/wiki/Dark_energy)\" que permearia todo o Universo. Ou seja, se a teoria agora proposta estiver correta, a hipótese de energia escura também poderia desaparecer.\nA teoria resolve igualmente alguns problemas na física das partículas, afirma Dejan Stojkovic, um dos autores da teoria e que também é coautor de uma outra proposta que envolve sumiços - uma teoria que afirma que os [buracos negros podem não existir](https://web.archive.org/web/20200930085453/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=010805070625&id=010805070625).\n- https://web.archive.org/web/20200806102019/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=ondas-gravitacionais-desaparecimento-dimensoes&id=020130110407\n- Artigo: [Detecting Vanishing Dimensions via Primordial Gravitational Wave Astronomy](https://ipfs.infura.io/ipfs/QmSRheXNHrP2zC6eJZiJz1LCHkD9D8cNJH7heFFzFN8T4T)",
				"added": 1606613581
			},
			{
				"comment_id": 87,
				"body": "#Dimensões evaporam-se na gravidade quântica\nTrabalhando em teorias da [gravidade quântica](https://en.wikipedia.org/wiki/Quantum_gravity), que pretendem unificar a mecânica quântica com a Relatividade Geral, os cientistas perceberam recentemente algo curioso demais para ser uma mera coincidência.\nDentre as várias teorias diferentes que tentam explicar a gravidade quântica, todas preveem o mesmo estranho comportamento em pequenas escalas: campos e partículas começam a se comportar como se o espaço fosse unidimensional.\nA observação pode ajudar a unificar a relatividade com a mecânica quântica. \"Há algumas estranhas coincidências aqui que podem estar apontando para algo importante,\" disse Carlip à revista New Scientist.\nEle observou que as teorias produzem resultados semelhantes e trazem uma explicação de como as dimensões podem sumir. \"A esperança é que nós possamos usar isso para descobrir o que realmente é a gravidade quântica,\" diz ele.\n- https://web.archive.org/web/20200929115046/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=dimensoes-gravidade-quantica&id=010130100928\n- Artigo: [The Small Scale Structure of Spacetime](https://web.archive.org/web/20200627031232/https://arxiv.org/pdf/1009.1136v1.pdf)",
				"added": 1606615568
			},
			{
				"comment_id": 88,
				"body": "#[Restrições astrofísicas nos fenômenos dissipativos da escala de Planck](https://ipfs.infura.io/ipfs/QmUGJAZK3iNcMgYVbus8xytsrMaBMNP2YtV4THA57H7jvH)\nO surgimento de um espaço-tempo clássico a partir de qualquer modelo de gravidade quântica ainda é uma questão sutil e apenas parcialmente compreendida. Se de fato o espaço-tempo está surgindo como algum tipo de condensado em grande escala de objetos mais fundamentais, então é natural esperar que a matéria, sendo uma excitação coletiva dos constituintes do espaço-tempo, apresente cinemática modificada com energias suficientemente altas. Consideramos aqui a fenomenologia dos efeitos dissipativos que surgem necessariamente em tal quadro. Adotando a hidrodinâmica dissipativa como uma estrutura geral para a descrição da troca de energia entre as excitações coletivas e os graus de liberdade fundamentais do espaço-tempo, discutimos como as taxas de perda de energia para partículas elementares podem ser derivadas de relações de dispersão e usadas para fornecer fortes restrições na base das observações astrofísicas atuais de partículas de alta energia.",
				"added": 1606616781
			},
			{
				"comment_id": 89,
				"body": "#[Uma proposta didático-matemática para o uso da escala de Planck: dos fótons aos buracos negros](https://ipfs.infura.io/ipfs/QmZAUkmdA7g4FQL8GBX93DDeUNqC9XkTY17avcDNZ2sYwa)\nApresentamos, neste artigo, um estudo teórico sobre os limites físicos associados a uma partícula fundamental, o fóton, na escala de Planck. Além disso, calculamos a temperatura de um buraco negro com as dimensões de Planck. A partir da análise dimensional, verificamos cinco unidades da escala de Planck (massa, tempo, comprimento, energia e temperatura). Primeiramente, analisamos um fóton com dimensões do comprimento de Planck; em seguida, identificamos a energia deste fóton com o comprimento de onda da ordem do raio de Schwarzschild (rs). Por fim, calculamos a temperatura de um buraco negro com as dimensões de Planck (no caso, com seu raio de Schwarzschild igual ao comprimento de Planck). O “raio do fóton” aparece como um múltiplo do comprimento de Planck, demonstrando a inacessibilidade de escalas menores que a de Planck devido ao Princípio da Incerteza. Dentre os resultados obtidos, podemos destacar três caminhos possíveis para a escala de Planck, bem como a mensuração do menor fóton possível de acordo com as leis da Física, que se caracteriza por máxima frequência e energia.",
				"added": 1606622348
			},
			{
				"comment_id": 90,
				"body": "#[A eletrodinâmica e a gravidade linearizada sob os efeitos da violação da invariância de Lorentz na escala de Planck](https://ipfs.infura.io/ipfs/QmQSd6aXrHLaAonv3TPDzmXLnRNfHHWtCt25goeNpG1Kgh)\nPartindo da motivação de que algumas teorias de gravitação quântica preveem a Violação da Invariância de Lorentz (VIL) em níveis de energia em torno da escala de Planck, propomos a construção de novos formalismos que abordam possíveis efeitos da VIL na Eletrodinâmica e na Gravidade linearizada. Esses formalismos se baseiam em teorias de campos efetivas capazes de modificar as lagrangianas comumente usadas através de termos de dimensão de massa arbritrária com altas ordens derivativas que incluem um campo de fundo constante controlando a intensidade da VIL nos modelos. Isso produz modificações nas equações de movimento e nas relações de dispersão das teorias de modo semelhante ao procedimento de Myers-Pospelov. Espera-se que estes operadores sejam capazes de descrever a VIL típica das escalas fundamentais de altas energias da gravitação quântica. Também estudamos aspectos teóricos relacionados a consistência da Eletrodinâmica modificada por meio da estabilidade, causalidade e unitariedade, com o cálculo do propagador de Feynman do fóton na presença da VIL. Depois estudamos o contexto fenomenológico dos modelos considerando efeitos de atraso temporal entre dois fótons e entre dois grávitons, bem como efeitos de birrefringência entre dois fótons, utilizando para isso dados vindos de eventos astrofísicos de emissão de ondas eletromagnéticas provenientes de explosões de raios gamma, bem como da emissão de ondas gravitacionais detectadas até então. Também consideramos o fenômeno de atraso temporal devido a presença de lentes gravitacionais. Por fim, discutimos os limites experimentais sobre a VIL em torno da escala da energia de Planck.",
				"added": 1606622647
			},
			{
				"comment_id": 91,
				"body": "#Físicos dizem ter detectado o quinto elemento - a quintessência\nUma dupla de físicos da Alemanha e do Japão acredita ter dado um passo importante para ressuscitar uma das teorias mais controversas da Física: o [éter](http://127.0.0.1:43110/0sh.bit/?AU3Y).\nAté Einstein, o éter era a substância essencial a partir da qual todas as partículas e ondas eram medidas, e no qual elas se deslocavam. Mas a teoria da relatividade especial dispensou o éter. Como defender o éter significava contrapor-se à relatividade, o termo foi logo banido e criou-se muito preconceito em torno dele.\nNão têm faltado tentativas de ressuscitá-lo, sendo que a versão mais moderna equivale ao chamado [vácuo quântico](https://en.wikipedia.org/wiki/Quantum_vacuum_state), que descreve o \"vazio\" como uma sopa de partículas que surgem e desaparecem o tempo todo - para quase todos os efeitos, aceitar o vácuo quântico significa apenas rebatizar o éter.\nAgora, Yuto Minami (KEK - Organização de Pesquisa do Acelerador de Alta Energia, no Japão) e Eiichiro Komatsu (Instituto Max Planck de Astrofísica, na Alemanha) encontraram algo que pode colocar um fim à discussão, trazendo o éter de vez para a mesa de discussão dos físicos.\nMas, para evitar controvérsias e polêmicas infrutíferas, em vez de chamar a substância que detectaram de éter, eles preferiram batizá-la de \"[quintessência](https://web.archive.org/web/20201105052227if_/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=palavras-significados-diferentes-ciencia-parte-3&id=010130200928#.X6OMJrMYw1k)\", ou campo quintessencial, uma referência ao \"quinto elemento\", ao lado do ar, terra, água e fogo propostos na Antiguidade para explicar a origem de todas as substâncias.\n- https://web.archive.org/web/20201128114436/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=quintessencia-fisicos-dizem-ter-detectado-quinto-elemento&id=010130201127\n- Artigo: [New Extraction of the Cosmic Birefringence from the Planck 2018 Polarization Data](https://web.archive.org/web/20201124020054/https://arxiv.org/pdf/2011.11254.pdf)",
				"added": 1606677835
			},
			{
				"comment_id": 92,
				"body": "#A temperatura média do universo tem ficado cada vez mais quente\nPor quase um século, os astrônomos entenderam que o Universo está em um estado de expansão. Desde a década de 1990, eles compreenderam que, há quatro bilhões de anos, o ritmo de expansão está se acelerando. Conforme isso progride, e os aglomerados de galáxias e filamentos do Universo se distanciam cada vez mais, os cientistas teorizam que a temperatura média do Universo diminuirá gradualmente.\nMas de acordo com uma [nova pesquisa](https://doi.org/10.3847/1538-4357/abb403) liderada pelo [Centro de Cosmologia e Física de AstroPartículas](https://ccapp.osu.edu/) (CCAPP) da Universidade do Estado de Ohio, parece que o Universo está realmente ficando mais quente com o passar do tempo. Depois de investigar a história térmica do Universo nos últimos 10 bilhões de anos, a equipe concluiu que a temperatura média do gás cósmico aumentou mais de 10 vezes e atingiu cerca de 2,2 milhões K (~ 2,2 ° C; 4 milhões ° F) hoje.\n- https://web.archive.org/web/20201127141301/https://www.universetoday.com/148794/the-average-temperature-of-the-universe-has-been-getting-hotter-and-hotter/\n- Artigo: [The Cosmic Thermal History Probed by Sunyaev-Zeldovich Effect Tomography](https://web.archive.org/web/20201009004635/https://arxiv.org/pdf/2006.14650v2.pdf)",
				"added": 1606679743
			},
			{
				"comment_id": 94,
				"body": "#Qual é a melhor teoria quântica? Inteligência Científica Artificial responde\n\"Eu creio que posso dizer com segurança que ninguém entende mecânica quântica,\" disse certa vez o famoso físico [Richard Feynman](https://en.wikipedia.org/wiki/Richard_Feynman) (1918-1988), um dos pioneiros na área da [computação quântica](https://en.wikipedia.org/wiki/Quantum_computing) e criador do conceito de [nanotecnologia](https://en.wikipedia.org/wiki/Nanotechnology).\nE esse dito um tanto contundente parece continuar válido em muitos aspectos hoje.\nDe fato, vários fenômenos da física permanecem envoltos em mistério. Por exemplo, até hoje não se sabe por que a resistência elétrica dos [supercondutores](https://en.wikipedia.org/wiki/Superconductivity) cai a zero quando eles atingem limiares específicos de temperatura. Ou porque uma onda colapsa para um comportamento tipo partícula quando é feita uma medição.\nPara entender esses sistemas quânticos, vários modelos teóricos têm sido propostos e estudados. Mas qual reflete melhor a realidade?\n#Inteligência científica artificial\nOra, se os físicos não conseguem decidir qual é a melhor teoria ou o melhor modelo, que tal pedir uma ajudinha para a [inteligência artificial](https://en.wikipedia.org/wiki/Artificial_intelligence)? É o que estão propondo Annabelle Bohrdt e um grupo das universidades Técnica de Munique (Alemanha) e Harvard (EUA).\nSegundo eles, a questão de qual modelo descreve melhor um fenômeno quântico pode ser respondida através da análise de imagens, o mesmo mecanismo utilizado para o reconhecimento facial, já amplamente utilizado em outras áreas.\n\"Semelhante à detecção de gatos ou cães em imagens, imagens de configurações de cada teoria quântica alimentam a rede neural,\" explica Annabelle. \"Os parâmetros da rede são então otimizados para dar a cada imagem o rótulo correto - neste caso, os rótulos são apenas 'teoria A' ou 'teoria B', em vez de gato ou cachorro.\"\nAs imagens usadas para treinar a rede neural artificial vêm de experimentos conhecidos como simuladores quânticos.\n- https://web.archive.org/web/20200305121632/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=inteligencia-cientifica-artificial&id=010150190729\n- Artigo: [Classifying snapshots of the doped Hubbard model with machine learning](https://ipfs.infura.io/ipfs/QmamXMQdRRowpocCbQ6LrZJkxQQpn6V6sZx4LF5cdxNMcX)",
				"added": 1606709518
			},
			{
				"comment_id": 95,
				"body": "#Teoria das cordas: por que ainda não foi comprovada?\n- https://www.if.ufrgs.br/novocref/?contact-pergunta=teoria-das-cordas-por-que-ainda-nao-foi-comprovada\n- https://siasky.net/fADsEW0HeO6G0jX1Fd12tUCZsMmF5haTorJWJhzgohgG7g",
				"added": 1606710175
			},
			{
				"comment_id": 96,
				"body": "#Alcançada temperatura abaixo do zero absoluto\nA escala de temperaturas absolutas - conhecida como escala [Kelvin](https://en.wikipedia.org/wiki/Kelvin) - é um dos conceitos centrais da física.\nPor definição, nada pode ser mais frio do que o [zero absoluto](https://en.wikipedia.org/wiki/Absolute_zero), estabelecido em 0 Kelvin, ou -273,15 °C.\nContudo, há muito os físicos sabem que, abaixo do zero absoluto, há todo um reino de temperaturas absolutas negativas.\nEm 2011, [um grupo de físicos teóricos alemães demonstrou](https://web.archive.org/web/20200811130854if_/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=atingir-temperaturas-abaixo-zero-absoluto&id=010115110214#.XzKYnrMYw1k) que, se não é possível passar suavemente pelo zero absoluto, como acontece na [escala Celsius](https://en.wikipedia.org/wiki/Celsius), é possível saltar pelo 0 K e ir diretamente para esse reino ainda inexplorado.\nAgora, uma outra equipe alemã fez os experimentos e demonstrou na prática como ir abaixo do zero absoluto.\nE a realidade mostrou-se impressionante: abaixo do quase inatingível frio absoluto estão algumas das temperaturas mais quentes já observadas no Universo.\nO resultado terá largas implicações em várias áreas científicas, da física básica à cosmologia.\n- https://web.archive.org/web/20200927230710/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=temperatura-abaixo-zero-absoluto&id=010170130107\n\n#Bibliografia:\n- Artigo: [Negative Absolute Temperature for Motional Degrees of Freedom](https://ipfs.infura.io/ipfs/QmaeXu1tjJTCFLuBKoazVTWb1HNKMPiknFAHBvx7AvWrgM)\n- Artigo: [Negative Temperatures?](https://ipfs.infura.io/ipfs/QmfHURhAGuR5kX8e1ABfYjRarPb3AWxPQd88mtC2EuMrLG)",
				"added": 1606758183
			},
			{
				"comment_id": 97,
				"body": "#Experimento vai estudar vácuo quântico e buracos negros usando som\nSe o experimento funcionar, isso poderá dar informações que hoje não são levadas em conta nos modelos que explicam não apenas os buracos negros, mas também todos os objetos relativísticos, que se movem em velocidades muito elevadas pelo espaço.\n- https://web.archive.org/web/20201130141948/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=experimento-vai-estudar-vacuo-quantico-buracos-negros-usando-som&id=010130201130\n- Artigo: [Interferometric Unruh Detectors for Bose-Einstein Condensates](https://web.archive.org/web/20200914052518/https://arxiv.org/pdf/2007.07160v1.pdf)",
				"added": 1606768451
			},
			{
				"comment_id": 98,
				"body": "#Sensor gera sua própria energia usando tunelamento quântico\nEdifícios inteligentes, eletrônica de vestir, monitoramento ambiental, [internet das coisas](https://en.wikipedia.org/wiki/Internet_of_things), são todas tecnologias fortemente baseadas em sensores.\nE, para serem eficientes e práticos, esses sensores devem ser minúsculos e gastarem o mínimo de energia.\nÉ por isso que está chamando tanto a atenção o trabalho de um trio de pesquisadores da Universidade de Washington, nos EUA.\nEles construíram sensores que geram sua própria energia tirando proveito de um fenômeno quântico chamado [tunelamento](https://en.wikipedia.org/wiki/Quantum_tunnelling) - os sensores podem funcionar mais de um ano sem precisar de nenhuma manutenção ou troca de [bateria](https://en.wikipedia.org/wiki/Electric_battery).\n- https://web.archive.org/web/20201130141740/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=sensor-gera-sua-propria-energia-usando-tunelamento-quantico&id=010165201130\n- Artigo: [A self-powered analog sensor-data-logging device based on Fowler-Nordheim dynamical systems](https://ipfs.infura.io/ipfs/QmNmkT68tCcfcTgwi5RGuYevkE4GNVzjwWyKQsPNedTKLu)",
				"added": 1606769001
			},
			{
				"comment_id": 101,
				"body": "#Teoria da Gravidade rival de Einstein mata matéria escura\nUma equipe de astrônomos que estudou a distribuição da matéria normal, ou bariônica, em mais de 30.000 galáxias, anunciou que suas observações podem ser explicadas por essa teoria alternativa, sem qualquer necessidade da matéria escura - a matéria escura nasceu como um argumento teórico para explicar porque as galáxias não se esfacelam dado que elas apresentariam uma velocidade grande demais para manter as estrelas agrupadas.\nSe essa teoria da gravidade modificada - seus autores a chamam de \"gravidade emergente\" - estiver correta, ela promete lançar por terra centenas de anos de física fundamental, baseada nas regras estabelecidas pela Lei da Gravitação de Isaac Newton e pela Teoria da Relatividade Geral de Einstein.\n- https://web.archive.org/web/20171106004728/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=teoria-gravidade-rival-einstein-mata-materia-escura&id=020130161223\n- Artigo: [First test of Verlinde's theory of Emergent Gravity using Weak Gravitational Lensing measurements](https://ipfs.infura.io/ipfs/QmQiF8rgL3dCbwK4kmFQFGvSp1X9uJR2zLCTT1dD8vcaew)",
				"added": 1606877687
			},
			{
				"comment_id": 102,
				"body": "#[Modelos cosmológicos com campos fermiônicos](https://ipfs.infura.io/ipfs/QmWUznW5mvHrfgjFRxuSvuznkHocRFpTvadfpmFvhAQvzC)\nResumo: Neste trabalho, estudamos como campos fermiônicos mínima e não minimamente acoplados ao campo gravitacional podem ser responsáveis por diversas fases de expansão acelerada durante a evolução do Universo. A contribuição da matéria bariônica e de radiação é levada em conta em um dos dois casos aqui apresentados. Buscamos as formas da densidade de potencial e do acoplamento para ação geral que descreve esse modelo através da técnica da simetria de Noether. No primeiro caso, o qual não conta com a contribuição da radiação e da matéria bariônica, obtemos soluções analíticas para as equações de campo e analisamos os possíveis cenários que estas podem descrever. No segundo caso, fazemos uma mudança de variáveis para encontrar o parâmetro de Hubble em função do desvio para o vermelho e, com esse resultado, obtivemos gráficos para o parâmetro densidade e de desaceleração. Por fim, comparamos as curvas encontradas com os dados observacionais.",
				"added": 1606882023
			},
			{
				"comment_id": 103,
				"body": "#[TeVeS: uma alternativa ao modelo da matéria escura](https://ipfs.infura.io/ipfs/QmR83pkrnMvx3R2ZAem1XoXkC8nFwheQH8fy3yNFeVtbsV)\nA materia escura continua sendo um desafio para a Física, uma vez que ela não é detectada nem existe um modelo teórico que possa prever de maneira clara a sua existência. No entanto, ela é necessária tendo em vista que as curvas planas de rotação de galáxias só são compreendidas pela imposição à força de sua existência. Por outro lado, na década de 1980 foi proposta uma modicação da gravitação (MOND) de tal maneira que não seria necessário impor uma componente não-visível. Em 2004, Bekenstein propôs o TeVeS, a mais completa e bem-sucedida teoria da família MOND. Contudo, tanto as teorias da famlia MOND quanto o postulado da matéria escura possuem pontos fortes e fracos.",
				"added": 1606882114
			},
			{
				"comment_id": 105,
				"body": "#[Aceleração e termodinâmica do horizonte aparente da métrica de FLRW no contexto do TEGR](https://ipfs.infura.io/ipfs/QmSvHB4WQJX1vLkYxvujTayy7nCAQENAg7SRoTS77rkCAf)\nA solução de Friedmann-Lemaître-Robertson-Walker (FLRW) é uma solução exata das equações de Einstein que descreve um modelo de universo isotrópico e homogêneo que pode está expandindo ou contraindo de forma acelerada. Dados observacionais recentes sugerem que o presente universo é aproximadamente plano e que este está expandindo acelerado. Nesta dissertação, no contexto do Teleparallelismo Equivalente à Relatividade Geral (TERG), tentaremos entender a razão pela qual o universo, baseado no modelo de FLRW, está expandindo de forma acelerada. Apresentaremos também uma relação para a primeira lei da termodinâmica para a superfície do horizonte aparente do modelo de FLRW, de onde extrairemos uma expressão para a temperatura no horizonte aparente.",
				"added": 1607041657
			},
			{
				"comment_id": 107,
				"body": "#Candidato a átomo de matéria escura pode ser detectado em laboratório\nUma partícula hipotética que poderia resolver um dos maiores quebra-cabeças da cosmologia ficou um pouco menos misteriosa - ao menos teoricamente.\nFísicos do Instituto RIKEN e da Universidade de Keio, ambos no Japão, descobriram fundamentos matemáticos que podem explicar como os chamados [áxions](https://en.wikipedia.org/wiki/Axion) podem gerar entidades semelhantes a cordas. A estrutura e o comportamento dessas cordas geram uma tensão elétrica \"anômala\", diferente do que ocorre nos materiais comuns.\nO melhor de tudo é que essa tal \"tensão anômola\" pode ser a mesma já detectada em materiais que estão sendo estudados em laboratório e usados em testes para uma nova geração de eletrônicos.\n- https://web.archive.org/web/20201203230244/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=axions-candidato-atomo-materia-escura-detectado-laboratorio&id=010130201203\n- Artigo: [Higher-form symmetries and 3-group in axion electrodynamics](https://ipfs.infura.io/ipfs/QmeiQb7j57gSJbQxXLLeGBftFxbAoh3jwqkZTFpS2atn3L)",
				"added": 1607048778
			},
			{
				"comment_id": 136,
				"body": "#Constante mágica do Universo tem valor mais preciso já medido\nUma equipe de físicos franceses acaba de realizar a medição mais precisa até hoje da [constante de estrutura fina](https://en.wikipedia.org/wiki/Fine-structure_constant), que caracteriza a força da interação entre a luz e as partículas elementares com carga elétrica, como os elétrons.\nDentre todas as constantes fundamentais da natureza, a constante de estrutura fina - representada pela letra grega alfa (α) - é especial porque ela não tem dimensão ou unidade; é um número puro que parece ser extremamente importante para o Universo porque aparece por todos os lados.\nAo caracterizar a magnitude da força eletromagnética, seu tradicional valor de 1/137 aparece em múltiplos ou divisores em quase tudo o que se refere aos átomos, moléculas e outras partículas carregadas - como elétrons e prótons -, afetando virtualmente todas as áreas da pesquisa científica, da física e da química à biologia.\nAlguns físicos gostam de chamá-la de \"constante mágica\" porque ela parece ter o valor adequado para que as coisas sejam como são: O valor 1/137 é pequeno o bastante para deixar a força eletromagnética fraca o suficiente para que os elétrons saltem entre materiais, viabilizando as reações químicas, mas forte o suficiente para que as estrelas sejam capazes de sintetizar elementos mais pesados, como o carbono, que fundamenta a vida como a conhecemos.\nÉ por isso que muitos cientistas dedicam toda a sua vida profissional a medir a constante de estrutura fina com a maior precisão possível.\n#Valor da Constante de Estrutura Fina\nLéo Morel e seus colegas da Universidade de Sorbonne, na França, determinaram o valor de α com uma precisão de 11 dígitos significativos, melhorando a precisão da medição anterior por um fator de 3.\nIsso dá 1/137.035999206(11), com os dois últimos dígitos, entre parênteses, com um nível de incerteza ainda grande. Mas a margem de erro é de meras 81 partes por trilhão.\nA equipe alcançou tamanha precisão aprimorando sua configuração experimental ao longo de 22 anos, em um esforço para reduzir imprecisões e controlar os efeitos que podem criar perturbações na medição.\n- https://web.archive.org/web/20201207110423/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=valor-constante-estrutura-fina-fica-mais-preciso&id=010130201207\n- Artigo: [Determination of the fine-structure constant with an accuracy of 81 parts per trillion](https://ipfs.infura.io/ipfs/QmVJ9BY3bXnAb9rwgh7zfQ4PRGA6y3PP4r5Si8tnqHSAym)",
				"added": 1607342392
			},
			{
				"comment_id": 137,
				"body": "#Técnica altera propriedades do material átomo por átomo\n\"Nós descobrimos uma maneira completamente nova de controlar a condutividade dos materiais em nanoescala,\" anunciou entusiasmado o professor Dennis Meier, da Universidade Norueguesa de Ciência e Tecnologia.\nNão é para menos: A técnica que sua equipe desenvolveu não interfere nas outras propriedades do material - e estamos falando de propriedades que quase sempre são mutuamente excludentes.\nIsso torna possível combinar diferentes funções no mesmo material, o que é um avanço importante para a tecnologia em nanoescala, que gosta de construir as coisas \"de baixo para cima\", montando átomos e moléculas como se eles fossem peças de encaixar.\n- https://web.archive.org/web/20201207110937/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=tecnica-altera-propriedades-material-atomo-atomo&id=010165201207\n- Artigo: [Conductivity control via minimally invasive anti-Frenkel defects in a functional oxide](https://ipfs.infura.io/ipfs/QmexDywwk9ZQvUt3aDgEHT1d4sHk56SbfvYyH2yi4Pj2DK)",
				"added": 1607342643
			},
			{
				"comment_id": 138,
				"body": "#Material captura e guarda energia solar por meses\nHá cerca de dois anos, cientistas japoneses sintetizaram um material ultraporoso, que eles chamaram de DMOF-1, pertencente a uma classe de cerâmicas porosas conhecidas como estruturas metal-orgânicas (MOF: metal-organic framework).\nAgora, uma equipe da Universidade de Lancaster, no Reino Unido, confirmou a suspeita da equipe japonesa: o DMOF-1 consegue capturar diretamente energia do Sol e armazená-la para uso futuro.\nA energia pode ser guardada durante meses a temperatura ambiente, e pode ser liberada quando necessária na forma de calor.\nComo os desenvolvimentos necessários - aumento de eficiência e fabricação em larga escala -, esse material poderá ser usado para capturar a energia solar durante o dia e disponibilizá-la à noite, ou mesmo capturar o calor do Sol no verão e usá-lo para aquecer as casas no inverno.\n- https://web.archive.org/web/20201207111412/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=material-captura-guarda-energia-solar-meses&id=010115201207\n- Artigo: [Long-Term Solar Energy Storage under Ambient Conditions in a MOF-Based Solid-Solid Phase-Change Material](https://ipfs.infura.io/ipfs/QmYLejiis1QrRniPdw343cpFenRLNUAzcwDjoBACFGWcoK)",
				"added": 1607343092
			},
			{
				"comment_id": 140,
				"body": "#Sons de fluido perfeito mostram primeiras notas musicais do Universo\nPara os físicos, um fluxo perfeito se forma quando um fluido flui com a menor quantidade de atrito, ou viscosidade, permitida pelas leis da mecânica quântica.\nEsse comportamento perfeitamente fluido é raro na natureza, mas os cientistas acreditam que ele ocorra nos núcleos das estrelas de nêutrons e na [sopa pastosa do Universo primitivo, conhecida como plasma de quarks e glúons](https://web.archive.org/web/20200930001322if_/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=plasma-quarks-gluons-criado-colisoes-particulas-leves&id=010175190703#.X3PNqbMYw1k).\nAgora, uma equipe do MIT, nos EUA, conseguiu pela primeira vez criar um fluido perfeito em laboratório, medindo seu comportamento e sua estrutura interna usando sons.\nParth Patel e seus colegas analisaram milhares de ondas sonoras viajando através desse gás para medir sua \"difusão do som\", ou a rapidez com que o som se dissipa no gás, o que está diretamente relacionado à viscosidade, ou atrito interno de um material.\nSurpreendentemente, eles descobriram que a difusão do som no fluido é tão baixa que pode ser descrita por uma quantidade \"quântica\" de atrito, dada por uma constante da natureza conhecida como [constante de Planck](https://en.wikipedia.org/wiki/Planck_constant), e pela massa das partículas individuais (férmions) no fluido.\nEste valor fundamental confirmou que o gás de férmions de interação forte se comporta como um fluido perfeito, e é de natureza universal.\n- https://web.archive.org/web/20201208051644/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=sons-fluido-perfeito-mostram-primeiros-notas-musicais-universo&id=010130201208\n- Artigo: [Universal sound diffusion in a strongly interacting Fermi gas](https://ipfs.infura.io/ipfs/QmTe6ETByaLmKMwLeZwif3ZU4yLGWrdJoLuRTng6o2MZW3)",
				"added": 1607426442
			},
			{
				"comment_id": 177,
				"body": "#Qual é a Temperatura MÁXIMA do Universo?\n- https://invidious.snopyta.org/watch?v=6EBCulC8Klo\n- https://siasky.net/AAChi-Po9u0uv1Dm0I0O3Ef4YddFiudCiNPtOYuDiuekjg\n\nQual é a temperatura mais alta possível no Universo? Assim como nós temos o [0 absoluto](https://en.wikipedia.org/wiki/Absolute_zero), será que também temos um máximo absoluto? Como vocês vão descobrir nesse vídeo, as coisas começam a ficar complicadas quando misturamos termodinâmica com relatividade... e física quântica.",
				"added": 1607829613
			},
			{
				"comment_id": 178,
				"body": "#Terceira lei da termodinâmica. Teorema do calor de Nernst. Obtenção da entropia absoluta e tabelas de entropia padrão.\n- http://eaulas.usp.br/portal/video.action?idItem=19723\n- http://ipfs.io/ipfs/QmTE7JsH8VU3UXRNa7LmMB1AqZKEhqtWW6PKrV5Ms4ahLp",
				"added": 1607880804
			},
			{
				"comment_id": 179,
				"body": "#Cosmologia inflacionária e termodinâmica\n- https://doi.org/10.1088/0264-9381/15/4/014\n- https://ipfs.infura.io/ipfs/QmX7uFn7VPeUiFPg18cuetbu8SaUCxnDBY2BYNvnVMrTp1",
				"added": 1607880944
			},
			{
				"comment_id": 181,
				"body": "#Termodinâmica e cosmologia\n- https://doi.org/10.1007/BF00758981\n- https://ipfs.infura.io/ipfs/Qme3EAmce72HDVzwkRueGBfjzvDCJ3BKbzCCYk92pDBQHP",
				"added": 1607891740
			},
			{
				"comment_id": 182,
				"body": "#Termodinâmica Causal na Relatividade\n- https://arxiv.org/abs/astro-ph/9609119v1\n- https://ipfs.infura.io/ipfs/QmWEjvX1U1p7B5KXqwLat7hPfRkmnCsBbbuFfBEr5WhoFe",
				"added": 1607891941
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 4,
				"body": "#Tróia\n- http://ipfs.io/ipfs/QmQR2yzhzCsd4s9RsxxBUvpzGdUYktfxujwmVPaaocyVLa\n\nEm 1193 A.C., Paris (Orlando Bloom) é um príncipe que provoca uma guerra da Messência contra Tróia, ao afastar Helena (Diane Kruger) de seu marido, Menelaus (Brendan Gleeson). Tem início então uma sangrenta batalha, que dura por mais de uma década. A esperança do Priam (Peter O'Toole), rei de Tróia, em vencer a guerra está nas mãos de [Aquiles](https://en.wikipedia.org/wiki/Achilles) (Brad Pitt), o maior herói da Grécia, e seu filho Hector (Eric Bana).",
				"added": 1605802037
			},
			{
				"comment_id": 10,
				"body": "#FILME | Encontro com Milton Santos: o mundo global visto do lado de cá, 2006\n- https://invidious.snopyta.org/watch?v=-UUB5DW_mnM\n- https://ipfs.io/ipfs/Qmcw2oZ9jWBbRMxfDuS2aJKzbep2tznRgpbMcusz8BDHJJ\n\nQuando o mundo estava pautado pelo pensamento único da globalização, o professor [Milton Santos](https://pt.wikipedia.org/wiki/Milton_Santos) foi a voz discordante, denunciando as perversidades do que chamou de \"globalitarismo\", sistema econômico que provoca a concentração de riqueza entre os ricos e que distribui mais pobreza para os desfavorecidos. Fruto de sete anos de trabalho, Encontro com Milton Santos ou O Mundo Global visto do lado de cá apresenta a última entrevista do geógrafo, gravada em janeiro de 2001, cinco meses antes da sua morte. Na entrevista, ele traça um painel das desigualdades entre o norte rico e o mundo do sul saqueado, apresentando alternativas e um prognóstico otimista sobre o futuro da humanidade. Dedicado às suas ideias, o filme mostra também seu percurso da Faculdade de Direito para o Jornalismo e a Geografia e fala de suas paixões, como Josué de Castro, Sartre, Rui Barbosa, Castro Alves.",
				"added": 1605890997
			},
			{
				"comment_id": 11,
				"body": "#FILME | Privatizações: a distopia do Capital, 2014\n- https://invidious.snopyta.org/xJPCKjT0XXk\n- https://ipfs.io/ipfs/Qmccw2aqbAWqb3GHUJWs47umEVBLNGzX8Jh4jVunBDgN6E\n\nAo denunciar a quebradeira do Estado nos anos 1990, o documentário mostra de que forma o Brasil perdeu elementos fundamentais da sua soberania ao transferir para o setor privado internacional uma parte essencial e simbólica do patrimônio coletivo brasileiro. Cerca de 15% do PIB do país passou do setor público para o privado, seguindo uma lógica em que o Estado seria a razão dos problemas do país e o grande adversário da eficiência econômica. O filme relembra o papel ativo do Estado no processo de industrialização do país, investindo em obras de infraestrutura, e o surgimento do neoliberalismo nos anos 1980, com duras críticas ao Estado desenvolvimentista e uma propaganda feroz sobre as vantagens do mercado. Privatizações indica que o programa de desestatização não configurou um Estado mínimo ou ausente, mas submetido às exigências do mercado e redefinido em função do processo de acumulação do capital. Dentro dessa lógica, moradia, transporte, educação e saúde são tratados como mercadoria em uma engrenagem onde o beneficiário é o sistema financeiro.",
				"added": 1605891091
			},
			{
				"comment_id": 54,
				"body": "#Malcolm X (1992)\nÉpico biográfico do controverso e influente líder nacionalista negro, desde seu início de vida e carreira como um pequeno gângster, até seu ministério como membro da [Nação do Islã](https://en.wikipedia.org/wiki/Nation_of_Islam).\n- https://view.axel.org/item/93ba189f7aedfc05\n- Torrent: http://127.0.0.1:43110/ZeroTorrent.bit/?Topic:1_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K/Malcolm+X+Legendado",
				"added": 1606356285
			},
			{
				"comment_id": 79,
				"body": "#K-9: Um Policial Bom pra Cachorro (1989)\n- https://ipfs.io/ipfs/QmXmW34woB1gx7FwuYq6RjDRnaz5bL6QTqVvBFGnMscq5P\n\n[James Belushi](https://en.wikipedia.org/wiki/Jim_Belushi) estrela como Thomas Dooley, um policial de narcóticos pouco ortodoxo que se junta com um cão da polícia independente nesta hilária comédia de ação. O obstinado Dooley está a um passo de pegar um proeminente homem de sociedade em uma apreensão de US$ 50 milhões em cocaína. Ele é conhecido por ser muito doido para quererem ser seu parceiro e ninguém quer trabalhar com ele exceto Jerry Lee, um pastor alemão muito bem treinado como cão policial com o melhor nariz para descobrir drogas. A parceria pouco convencional não agrada nenhum dos dois, mas depois de uma série de tiroteios, perseguições, brigas e desventuras românticas, eles desenvolvem um respeito relutante um pelo outro. É uma aventura emocionante e agitada sobre uma equipe policial inusitada e imbatível que vai fazer você torcer pelo melhor amigo do homem.",
				"added": 1606530941
			},
			{
				"comment_id": 99,
				"body": "#Filhas do Sol (2018)\n- https://siasky.net/AACBLAW8p1gldpbvJtHnFOMp12Y9EEfhxrMRWXdCDCGO2g\n\nComandante das Filhas do Sol, batalhão curdo formado por mulheres que lutam pela sobrevivência do seu povo, Bahar está prestes a retornar a Gordyene, cidade na qual já foi feita prisioneira. Mathilde, uma jornalista francesa, acompanha o grupo durante o ataque, e a amizade entre as duas muda suas vidas para sempre. Indicado à Palma de Ouro no Festival de Cannes.\n#Resenha: https://web.archive.org/web/20200928123459/https://outraspalavras.net/poeticas/3017992/",
				"added": 1606769483
			},
			{
				"comment_id": 139,
				"body": "#Vira-Lata\n- https://swarm-gateways.net/bzz:/60f426ccfb1d05eb4193f9bf23bcadd5c0b52a925a6d254683446fc3302b9aeb/Vira-Lata.mkv\n\nUm acidente no laboratório de alta tecnologia do dr. Simon Barsinistro (Peter Dinklage) faz com que um cachorro beagle desabrigado, chamado Engraxate, ganhe poderes extraordinários. Com isso ele passa a vestir um traje de super-herói e se auto-denomina o Vira-Lata, jurando defender os cidadãos de Capitol City.",
				"added": 1607357669
			},
			{
				"comment_id": 143,
				"body": "#K-9000, um Policial Mil Vezes Melhor (1990)\nUm policial e uma cientista se unem para recuperar sua última criação, um cão cibernético que combate o crime.\n- https://invidious.snopyta.org/watch?v=UK-zah-yhOs\n- https://siasky.net/AAANtBaOEyXfwixEcYzUrFI9aoq9F9bvEN6X6RNcZzs8eQ",
				"added": 1607529852
			},
			{
				"comment_id": 146,
				"body": "#Os Supremos - O Filme\n- https://siasky.net/AADIMuhY0rQCnyfpj5ja2w9Ef1aky87-Be4wcOOh7_jJzQ\n\nAntigos inimigos da humanidade estão prestes a atacar, o que faz com que o grupo Os Supremos seja reunido para combatê-los. Para liderá-los é convocado o Capitão América (Justin Gross), um herói que ganhou seus poderes graças ao soro do supersoldado, nele aplicado durante a Segunda Guerra Mundial, e que permaneceu congelado nos últimos 60 anos. A equipe conta ainda com as presenças do Homem de Ferro (Marc Worden), Hulk (Fred Tatasciore), Vespa (Grey DeLisle), Viúva Negra (Olivia d'Abo), Thor (David Boat) e Gigante (Nolan North).",
				"added": 1607542342
			},
			{
				"comment_id": 161,
				"body": "#A Identidade Bourne (2002)\n- https://siasky.net/CACSAWWbseEfpTVBdZVsvFZnnV7QfWatGuJO3PZRxd1J2Q\n\nApós ser resgatado no mar, Jason Bourne acorda sem memória e busca por sua identidade. Enquanto isso, ele se torna um risco para uma organização que deseja eliminá-lo.",
				"added": 1607604412
			},
			{
				"comment_id": 164,
				"body": "#Hitman: Assassino 47 (2007)\n- https://siasky.net/CACQuNT3qLJ7HNV5DwdaWxZ9engtcvzUTnCryG_8IIld_Q\n\nO agente 47 (Timothy Olyphant) foi criado para ser um exímio matador de aluguel. Suas armas mais poderosas são a ousadia e o orgulho que tem ao executar cada trabalho. O número 47 é uma referência aos dois últimos dígitos do código de barras que tem tatuado em sua nuca. Um dia ele é envolvido em um golpe político, o que faz com que seja perseguido pela Interpol e por militares russos. Enquanto foge pela Europa Oriental ele tenta descobrir quem organizou este plano contra ele, ao mesmo tempo em que precisa lidar com as lembranças que uma bela garota lhe desperta.",
				"added": 1607614804
			},
			{
				"comment_id": 165,
				"body": "#Soldado Universal (1992)\n- https://siasky.net/CAAmXIVNddanE8K-a6Wtl1f8zZ6f5VTkg3CAL0FY6ou47w\n\nDurante a Guerra do Vietnã, o soldado Luc Deveraux descobre que seu superior, Andrew Scott, se tornou descontroladamente violento, e os dois lutam até a morte. Seus corpos são resgatados e colocados num programa secreto em que são reanimados e treinados para se tornar máquinas assassinas. Inicialmente, Deveraux e Scott não têm memória de suas vidas passadas, mas lampejos do passado começam a retornar, reavivando o intenso conflito.",
				"added": 1607632534
			},
			{
				"comment_id": 168,
				"body": "#O Máskara (1994)\n- https://siasky.net/CADgLg-nrD3FrviHQKD872pGZdH_Pn-zwuK0KWYDB8i1-Q\n\nEm Edge City vive Stanley Ipkiss (Jim Carrey), um cara decente que trabalha em um banco mas é socialmente desajeitado e sem muito sucesso com as mulheres. Após um dos piores dias da sua vida, ele acha no mar a estranha máscara de Loki, um deus escandinavo. Quando Stanley coloca a máscara, se transforma em O Máskara, um ser com o rosto verde que possui a coragem para fazer as coisas mais arriscadas e divertidas que Stanley receia fazer, inclusive flertar com Tina Carlyle (Cameron Diaz), a bela e sensual cantora que se apresenta no Coco Bongo, a discoteca do momento. O Máskara tem velocidade sobre-humana e um humor não-convencional e, enquanto isto, o gângster Dorian Tyrrell (Peter Greene), que namora Tina, se esforça para destruir o Máskara e se apoderar da máscara para usar seus poderes para o mal.",
				"added": 1607653836
			},
			{
				"comment_id": 169,
				"body": "#Hércules (2014)\n- https://siasky.net/CAASbhGwUo_rxPdLx-3m03eRYPClD-Xp2zH4eABcVheyTA\n\nTendo suportado seus lendários doze trabalhos, Hércules, o semideus grego, tem sua vida como uma espada de aluguel testada quando o rei da Trácia e sua filha buscam sua ajuda para derrotar um senhor da guerra tirânico.",
				"added": 1607736520
			},
			{
				"comment_id": 175,
				"body": "#A Identidade Bourne (1988)\n- https://invidious.snopyta.org/watch?v=6C4X6Q-O8uE\n- https://siasky.net/CACHKQz2iuvw1-_x2VXz2Ft6WDQya73mYc_ltLiZAoNn-g\n\nJason Bourne (Richard Chamberlain) acorda em uma praia na França sem nenhuma lembrança da sua identidade. Determinado a descobrir a verdade sobre o seu passado, ele começa a investigar pistas de pequenos fragmentos da sua memória e descobre o número de uma conta bancária na Suíça. Perseguido por perigosos assassinos, Bourne segue sua busca por respostas em Zurique, Paris e Nova York.",
				"added": 1607778908
			},
			{
				"comment_id": 176,
				"body": "#A Origem (2010)\n- https://siasky.net/CADjaNkE7u2B6ADUf1-BVMMHT44Sre63FpwZI1Hr6cG41w\n\nEm um mundo onde é possível entrar na mente humana, Cobb (Leonardo DiCaprio) está entre os melhores na arte de roubar segredos valiosos do inconsciente, durante o estado de sono. Além disto ele é um fugitivo, pois está impedido de retornar aos Estados Unidos devido à morte de Mal (Marion Cotillard). Desesperado para rever seus filhos, Cobb aceita a ousada missão proposta por Saito (Ken Watanabe), um empresário japonês: entrar na mente de Richard Fischer (Cillian Murphy), o herdeiro de um império econômico, e plantar a ideia de desmembrá-lo. Para realizar este feito ele conta com a ajuda do parceiro Arthur (Joseph Gordon-Levitt), a inexperiente arquiteta de sonhos Ariadne (Ellen Page) e Eames (Tom Hardy), que consegue se disfarçar de forma precisa no mundo dos sonhos.",
				"added": 1607815604
			},
			{
				"comment_id": 180,
				"body": "#Logan (2017)\nEm um futuro em que os mutantes estão quase extintos, um velho e cansado [Logan](http://127.0.0.1:43110/0sh.bit/?p0Gw) leva uma vida tranquila. Mas quando [Laura](https://en.wikipedia.org/wiki/X-23), uma garota mutante perseguida por cientistas, pede ajuda a ele, ele deve colocá-la em segurança.\n- https://siasky.net/CACnghC8iSMcCHljPGnu5ecdU1t4Fb4nwmcwuQHOmMkwbw",
				"added": 1607881896
			},
			{
				"comment_id": 183,
				"body": "#Upgrade: Atualização (2018)\nSituada em um futuro próximo, a tecnologia controla quase todos os aspectos da vida. Mas quando o mundo de Gray, um tecnófobo autointitulado, vira de cabeça para baixo, sua única esperança de vingança é um implante experimental de chip de computador.\n- https://siasky.net/CAB1o2sAVbR1kTwWqrBYyBpU3YZ7QtmSaT-fsfsTA3M_0g",
				"added": 1607892569
			},
			{
				"comment_id": 184,
				"body": "#Hercules Reborn (2014)\nQuando a noiva de um jovem é sequestrada por um rei malvado, ele pede ajuda a Hércules. O herói caído vive no exílio, banido por matar sua família, mas a coragem do jovem inspira Hércules. Juntos, eles lutam para resgatar a noiva e recuperar a honra de Hércules.\n- Filme: https://siasky.net/AAAMFgCuy3Q7SO7GfvzP6xYVGZS1TP9iLHJCozYsZARuvQ\n- Legenda Português (Brasil): https://siasky.net/ZAD2mHEQ_QS6Xg-qkGEf1udqjde0G56v0fEbEKRNQWoWtg\n\n[Sincronização de trilha de legenda](https://web.archive.org/web/20200813085756/https://tecnoblog.net/197237/sincronizar-legenda-vlc-mpc/): -6,000 s",
				"added": 1607900563
			},
			{
				"comment_id": 185,
				"body": "#Sansão e Dalila (1949)\nSansão, um forte homem de uma tribo escravizado pelos filisteus, se apaixona por Semadar, uma devota ao reino dominante que se envolve com Ahtur, o que leva a uma guerra entre os dois povos. Na briga, Semadar acaba morta e sua irmã Dalila, que sempre amou Sansão secretamente, jura vingança. Ela planeja seduzi-lo para que ele revele seu segredo para entregá-lo ao seu líder, Saran de Gaza.\n- https://gloria.tv/post/7wfAVvqQQNp1ATFiYkQDU4VD8\n- https://siasky.net/AACxSxBvXLLZotxhbaJnmbYH8raf_CiUhCjRDbvGBGCF8g",
				"added": 1607911783
			},
			{
				"comment_id": 186,
				"body": "#Mechanical Violator Hakaider - Dublado (((Studioycthus))) FanDub\n[Hakaider](https://en.wikipedia.org/wiki/Mechanical_Violator_Hakaider) é um [Tokusatsu](https://en.wikipedia.org/wiki/Tokusatsu) que é ambientado num futuro pós-apocalíptico, o filme mostra uma aventura sombria. Na utópica cidade de Jesus Town, o líder Gurjev e seu anjo mecânico Michael controlam a população que vive sem vontade própria. Contra eles, um grupo de renegados luta para levar liberdade ao povo. Hakaider, um androide esquecido, se une a eles. Mesmo lutando pela liberdade e justiça, mostra todo seu lado sanguinário.\n- https://invidious.snopyta.org/watch?v=_v-W19uwsLc\n- https://siasky.net/AADIDjAN1l9a5c1dTpwR8D0cwQmpsF8-FBc-mFmBc8YS2g",
				"added": 1607967930
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 5,
				"body": "#[Autobiografia de Malcolm X](https://ipfs.io/ipfs/QmdQC4LhmojDLFhBNWZKrtEn2bdpyvKGeXUkK5mSyu7YYJ)\n[A Autobiografia de Malcolm X](https://en.wikipedia.org/wiki/The_Autobiography_of_Malcolm_X) foi publicada em 1965, o resultado de uma colaboração entre o ativista de direitos humanos [Malcolm X](https://en.wikipedia.org/wiki/Malcolm_X) e o jornalista [Alex Haley](https://en.wikipedia.org/wiki/Alex_Haley). Haley foi co-autor da autobiografia com base em uma série de entrevistas em profundidade que ele conduziu entre 1963 e o assassinato de Malcolm X em 1965.",
				"added": 1605813330
			},
			{
				"comment_id": 12,
				"body": "#Obras completas de Sigmund Freud | Fonte: [CLIQUE AQUI](https://web.archive.org/web/20201121003035/https://psicanaliseflorianopolis.com/index.php/artigos/obra-de-s-freud/9-obras-completas-de-sigmund-freud)\n- https://ipfs.io/ipfs/QmRiRVsw2akww5K83Xw1NuZ17gosu11f2Pu9aqzbGBHXJr\n\n[Sigmund Freud](https://en.wikipedia.org/wiki/Sigmund_Freud) é conhecido como o “pai da psicanálise”, por conta da sua extensa contribuição para o surgimento desse campo clínico que tem enfoque na psique humana. Formulou teorias como a do “[id, ego e superego](https://en.wikipedia.org/wiki/Id,_ego_and_super-ego)” e a do “[complexo de Édipo](https://en.wikipedia.org/wiki/Oedipus_complex)”, que até hoje possuem enorme importância e são extensamente debatidas pelos psicanalistas.\nAs contribuições de Freud, porém, não se resumem ao campo da psicanálise, uma vez que suas teorias repercutiram bastante no campo científico e influenciaram diretamente áreas como a psicoterapia. A obra de Freud também repercutiu até em campos como a filosofia e a literatura. Até hoje alguns dos métodos de tratamento criados por Freud são utilizados por psiquiatras.",
				"added": 1605922485
			},
			{
				"comment_id": 20,
				"body": "#O CAPITALISMO SE DESLOCA: Novas arquiteturas sociais\n- https://ipfs.infura.io/ipfs/QmaG5ALLAAam2acU5aq3PjsXGAqXFyV6Ns9Z9tQ9qFPSGX\n\nNeste livro, [Ladislau Dowbor](https://dowbor.org/) propõe analisar um conjunto de mudanças do capitalismo que sugere que estamos em transição para outro modo de produção, deixando para trás a chamada era industrial e inaugurando algo novo, que o autor denomina era do conhecimento. Mas novo não significa necessariamente melhor: podemos estar diante de uma sociedade mais conectada e colaborativa, no entanto, problemas antigos – como os ambientais, sociais e econômicos – que a cada dia se agravam, além do controle individualizado sobre as populações, por meio de algoritmos e de inteligência artificial, pesam sobre o futuro da humanidade. Cabe a nós antever os rumos que tomará este admirável, ou abominável, mundo novo.",
				"added": 1605982208
			},
			{
				"comment_id": 21,
				"body": "#A Era do Capital Improdutivo – A nova arquitetura do poder\n- https://ipfs.infura.io/ipfs/QmRGJULDbZM9C1dKQpPfCrMU8UF7TkpZGTCSUnsT7tJnZU\n\nComo os bancos registram lucros bilionários em plena recessão e desemprego? Neste livro, [Ladislau Dowbor](https://dowbor.org/) investiga como a riqueza do mundo – minérios, petróleo, trabalho, alimentos –, produzida pelo trabalho, é capturada pelos bancos e seus intermediários financeiros. Com uma vasta pesquisa, Ladislau revela os mecanismos usados pelas corporações financeiras, com estruturas que muito se assemelham a governos, para exercer o poder político diretamente e influenciar as principais decisões dos poderes públicos.\nO resultado não poderia ser diferente: esterilizam a riqueza produzida pela sociedade para multiplicá-la somente em seu próprio benefício, por meio de investimentos financeiros que não criam novas tecnologias nem geram novos empregos. Ladislau demonstra por que o mercado considera positiva qualquer atividade que gere lucro – ainda que trave a economia e produza prejuízos sociais e ambientais – para enviar seus recursos, a salvo de impostos, a paraísos fiscais.\nO livro destrincha como a financeirização dilacera as economias no Brasil e mundo afora ao forçar os governos eleitos a cumprir agendas refutadas pelas urnas. Sobretudo quando desviam grande parte do orçamento público para o pagamento de juros da dívida, engordando ainda mais as forças do capital financeiro em detrimento de políticas públicas de saúde, educação, previdência.",
				"added": 1605982612
			},
			{
				"comment_id": 25,
				"body": "#O ESTADO EMPREENDEDOR - Mariana Mazzucato\n- https://ipfs.infura.io/ipfs/QmNMZjNx8i5xRX2ZdSsgnkGZctwrgAmkUAphpUUPhU98DG\n\nUma invenção com impacto enorme na vida de milhões de pessoas, o iPhone costuma ser visto como fruto da mente genial de Steve Jobs e da empresa que ele ajudou a se tornar uma marca mundial bilionária, a Apple. Muitas das tecnologias mais marcantes do aparelho, porém, são resultado de pesquisas financiadas pelo Estado americano, como a tela touchscreen e o assistente virtual acionado por voz, Siri. Essa é uma das revelações feitas por [Mariana Mazzucato](https://marianamazzucato.com/) em [O Estado empreendedor](http://www.amazon.com.br/O-Estado-Empreendedor-Mariana-Mazzucato/dp/8582850034/ref=sr_1_1?ie=UTF8&qid=1413282863&sr=8-1&keywords=estado+empreendedor), e ilustra bem o principal tema discutido por ela no livro: apesar de ser percebido como lento, burocrático e pouco ousado, o Estado teve e continua tendo papel fundamental e estratégico no desenvolvimento de grandes avanços tecnológicos. Valendo-se sempre de dados fartos e análises bem fundamentadas, a autora examina outros casos semelhantes em áreas que vão da internet à nanotecnologia e, através de um olhar fresco e muitas vezes surpreendente, enriquece um debate atualíssimo. \"A srta. Mazzucato está certa ao afirmar que o Estado desempenhou um papel fundamental na produção de avanços para a mudança do jogo, e que sua contribuição para o sucesso dos negócios baseados em tecnologia não deve ser subestimada.\" - The Economist",
				"added": 1606010008
			},
			{
				"comment_id": 27,
				"body": "#A Revolução Cubana - [Luis Fernando Ayerbe](http://lattes.cnpq.br/7138436147757988)\n- https://ipfs.infura.io/ipfs/QmdwdjbJuQv7yB6tf63rXd6BCuW8dZA9vRCyXwFZhPzCPY\n\nPor mais de cinquenta anos, a trajetória da experiência revolucionária em Cuba abrigou personalidades marcantes, como Che Guevara, e acontecimentos dramáticos, como a Crise dos Mísseis. Todos esses ícones históricos do século XX entrecruzam-se com a profunda reestruturação interna da economia e sociedade cubanas e o associado desafio à antes incontrastada hegemonia dos Estados Unidos sobre a América Latina. A complexidade desses elementos não deve ser menosprezada e, em si, é uma explicação para as paixões e a batalha interpretativa ainda hoje evocadas por essa evolução caribenha.\n#Resenha:\n- https://invidious.snopyta.org/watch?v=5HnnazjvT6I\n- https://siasky.net/AADiOU9z8JxSEyym3zjTK1dbt4Pu-I1yxshmzOq9BWwIXg",
				"added": 1606074539
			},
			{
				"comment_id": 55,
				"body": "#Anti-libertarianismo: mercados, filosofia e mito\nAutor: Alan Haworth\n- https://ipfs.infura.io/ipfs/QmVL5FuZp6qc2P9mGCXTUort8F5hTvexPcwoc642tNxqq3\n\nOs defensores do livre mercado afirmam que seu é o único mecanismo econômico que respeita e promove a liberdade humana. O socialismo, dizem eles, foi totalmente desacreditado. A maioria dos libertários trata o estado em qualquer coisa que não seja sua forma mínima, 'vigia noturno', como uma personificação repressiva do mal. Alguns rejeitam o estado completamente.\nMas a 'ideia de mercado livre' é uma crença racionalmente defensável? Ou seus proponentes deixam de examinar as raízes filosóficas de sua chamada liberdade? O anti-libertarianismo tem uma visão cética dos princípios conceituais da política de livre mercado. Alan Haworth argumenta que o libertarianismo é pouco mais do que uma declaração de fé infundada e quase religiosa: um romance de mercado. Além disso, o libertarianismo é exposto como profundamente antitético à própria liberdade que pretende promover.\nEste livro controverso é para qualquer pessoa interessada no impacto cultural e político das políticas de mercado livre no mundo moderno. Será inestimável para estudantes e especialistas em teoria política e econômica, ciências sociais e filosofia.",
				"added": 1606390304
			},
			{
				"comment_id": 111,
				"body": "#O Pequeno Príncipe - Antoine de Saint-Exupéry\n- https://ipfs.infura.io/ipfs/QmceLXSsDA6jZRF4ubiwKmMjKCr6VCjUXF65AZWz9NKc2B\n\nApesar da presença explícita de dois personagens e do registro de um diálogo entre o aviador e uma criança, diversos aspectos autobiográficos estão presentes nesta narrativa, publicada pela primeira vez em 1945. Através de imagens simbólicas, as passagens de ordem temporal, na vida do autor, estão ali presentes: casamento/separação, profissões, sonhos, decepções. Os dois personagens tornam-se representações do próprio [Saint-Exupéry](https://en.wikipedia.org/wiki/Antoine_de_Saint-Exup%C3%A9ry), em um monólogo interior entre o \"eu\" e o \"outro\".",
				"added": 1607139216
			},
			{
				"comment_id": 150,
				"body": "#High Hitler: Como o Uso de Drogas Pelo Führer Pelos Nazistas Ditou o Ritmo do Terceiro Reich\nAutor: Norman Ohler\n- https://ipfs.infura.io/ipfs/QmUuMBPC2WsXt9MdXWXKShhqSV7c6ZNmdj22Lji134sTbh\n\nQuando um amigo DJ lhe contou que [Hitler](https://en.wikipedia.org/wiki/Adolf_Hitler) e seus comandados usavam drogas, o jornalista Norman Ohler resolveu investigar. Foram cinco anos de diversas entrevistas e pesquisas em documentos que não haviam sido estudados sob esta perspectiva. O resultado é um livro que vem provocando interesse no mundo todo e está levando historiadores consagrados a ver o surgimento um novo lado na história da Segunda Guerra Mundial. High Hitler conta em detalhes a dependência de Hitler. Seu médico pessoal, [Theodor Morell](https://en.wikipedia.org/wiki/Theodor_Morell), administrou 74 drogas diferentes ao führer, de injeções de esteroides a produtos similares à [heroína](https://en.wikipedia.org/wiki/Heroin). Mas a revelação que pode levar a um novo entendimento do começo da guerra diz respeito aos soldados alemães. Documentos encontrados por Ohler mostram que eles recebiam doses generosas de [metanfetamina](https://en.wikipedia.org/wiki/Methamphetamine) para ficarem mais dispostos e imbuídos de um sentimento de euforia e invencibilidade – o que teria sido crucial nas bem sucedidas invasões da França e da Polônia.\n\n#Resenha:\n- https://invidious.snopyta.org/Yqok-aS4IYk\n- https://siasky.net/AACSiyg7zv2dNMtXCZgiatyPWDen3YWKBNVqBZVG1xwQGw",
				"added": 1607548304
			},
			{
				"comment_id": 156,
				"body": "#Brasil: Estado social contra a barbárie\nEste livro reúne artigos de um conjunto de professores, pesquisadores e técnicos das diversas áreas de conhecimento e com abordagens multidisciplinares, muitos dos quais participaram da formulação, implementação e gestão de políticas públicas. Formam um conjunto valoroso, uma contribuição crítica, norteada pela identificação dos limites, possibilidades e desafios de um Estado social no Brasil no século XXI.\n- https://fpabramo.org.br/publicacoes/estante/brasil-estado-social-contra-a-barbarie/\n- https://ipfs.infura.io/ipfs/QmZMbC2qXGQWq5tsdFbEeto6zPSNBqNAPGBZTcMgxuKDQy",
				"added": 1607563843
			},
			{
				"comment_id": 159,
				"body": "#Pedagogia do Oprimido – Paulo Freire\n- https://ipfs.infura.io/ipfs/QmVK9BvP1bwck6cidsSM4cE6GRsGUpD8PaN84K3D9CPXVn\n\nFazer o aluno conhecer a liberdade, tornando-se apto a se construir crítica e responsavelmente: foi este o nobre objetivo ao qual Paulo Freire se dedicou durante toda a vida. Mas como alçar um voo tão alto num mundo onde, cada vez mais, \"a pedagogia dominante é a pedagogia da classe dominante\"? Pedagogia do oprimido, obra que figura entre as principais de sua vasta bibliografia, é uma das respostas mais relevantes a essa pergunta. Aqui, consciente da situação em que se encontram os oprimidos do Brasil e da América Latina, Paulo nos oferece uma análise penetrante do funcionamento de nossas classes sociais e indica os caminhos para uma pedagogia eficiente, capaz de suscitar, nos educandos, o diálogo e o saber de si. Não é preciso muito para que a amplitude do pensamento desta obra se revele: do conteúdo programático às estruturas opressoras da sociedade, as reflexões freirianas se debruçam sobre todos os fatores que influenciam a educação, fazendo com que sua teoria pedagógica se torne, também, uma lição de cidadania e solidariedade. Pedagogia do oprimido resume todos os elementos que fizeram de Paulo Freire o principal educador brasileiro do século XX. É um livro de leitura obrigatória para todos aqueles que desejam compreender nossa situação ainda atual de acomodação.",
				"added": 1607600671
			}
		],
		"2_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn": [
			{
				"comment_id": 6,
				"body": "#Simulações cerebrais de código aberto\nA [simulação do cérebro](https://en.wikipedia.org/wiki/Brain_simulation) é o conceito de criar um [modelo de computador](https://en.wikipedia.org/wiki/Computer_simulation) funcional de um cérebro ou parte de um cérebro. Modelar um cérebro envolve modelar as propriedades elétricas e químicas dos neurônios. Um modelo do [conectoma](https://en.wikipedia.org/wiki/Connectome) neural do organismo-alvo também é necessário.\n- https://github.com/OpenSourceBrain\n- https://github.com/Flowx08/Celegans-simulation.git\n- https://github.com/neurokernel/neurokernel.git\n- https://github.com/elysia/elysia.git\n- https://github.com/xchoo/spaun2.0.git",
				"added": 1605841396
			},
			{
				"comment_id": 28,
				"body": "#Chip analógico promete defender inteligência artificial contra hackers\nUm chip baseado em uma tecnologia de memória iônica pode resolver o problema da segurança digital, usando sua memória analógica como uma arma definitiva contra os hackers.\nÉ o que propõe o professor Dmitri Strukov, da Universidade da Califórnia, em Santa Bárbara.\nEle e sua equipe estão desenvolvendo uma camada extra de segurança que incorpora uma tecnologia que visa impedir a clonagem, a prática pela qual os hackers replicam os nós de uma rede e os usam para lançar ataques de dentro da rede.\nDevido à sua natureza, o chip é fisicamente \"inclonável\", tornando o dispositivo invulnerável ao sequestro, falsificação ou replicação pelos criminosos cibernéticos. \"Você pode pensar nele como uma caixa preta,\" disse Strukov.\n- https://web.archive.org/web/20180922171031/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=chip-analogico-promete-defender-inteligencia-artificial-contra-hackers&id=010150180529\n- Artigo: [Hardware-intrinsic security primitives enabled by analogue state and nonlinear conductance variations in integrated memristors](https://ipfs.infura.io/ipfs/QmZgHKiCWEVhvfB9JjZxgwaJTCKJu4wsM5nrAGytnqbNSi)",
				"added": 1606091222
			},
			{
				"comment_id": 29,
				"body": "#Processador anti-hacker para ataque antes que ele comece\nUma nova arquitetura de processador de computador desenvolvida na Universidade de Michigan, nos EUA, promete nada menos do que lançar as bases de um futuro no qual os computadores se defendem proativamente contra ameaças, tornando obsoleto o atual modelo de segurança de encontrar bugs e lançar atualizações.\nO novo chip, batizado de Morpheus, bloqueia possíveis ataques de hackers criptografando e reorganizando aleatoriamente bits chave de seu próprio código e de seus dados 20 vezes por segundo.\nIsso é infinitamente mais rápido do que um hacker humano consegue trabalhar e milhares de vezes mais rápido do que as mais rápidas técnicas de hacking eletrônico.\n\"A abordagem atual de eliminar erros de segurança um por um é um jogo perdido. As pessoas estão constantemente escrevendo código e, tão logo há um novo código, haverá novos bugs e vulnerabilidades de segurança. Com o Morpheus, mesmo que um hacker encontre um bug, a informação necessária para explorá-lo desaparece 50 milissegundos depois. É talvez a coisa mais próxima de um sistema seguro à prova do que surgir no futuro,\" disse o professor Todd Austin.\n- https://web.archive.org/web/20190517/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=processador-anti-hacker-ataque-antes-ele-comece&id=010150190508\n- Artigo: [Morpheus: A Vulnerability-Tolerant Secure Architecture Based on Ensembles of Moving Target Defenses with Churn](https://ipfs.infura.io/ipfs/QmZJtbMu9htkmw6EZBpdvfAhGgkRMevrrbfVq1qKGousdj)",
				"added": 1606091484
			},
			{
				"comment_id": 30,
				"body": "#Proteção definitiva contra hackers tem poucos átomos de espessura\nMuitos especialistas em ciência da computação e segurança da informação afirmam que só estaremos a salvo de hackers e roubos de informações quando a segurança for incorporada no hardware.\nAté agora a indústria não encontrou uma forma de viabilizar essa nova camada de proteção aos usuários, por isso tem havido um interesse crescente no desenvolvimento de mecanismos que sejam baratos e que possam ser incorporados nos aparelhos eletrônicos convencionais.\nUma opção promissora acaba de ser desenvolvida por Abdullah Alharbi, da Universidade de Nova Iorque, nos EUA.\nEle usou cristais de [molibdenita](https://en.wikipedia.org/wiki/Molybdenite), um dos materiais mais promissores para o futuro da computação, para criar primitivas de cibersegurança virtualmente impossíveis de serem clonadas.\nAs estruturas em camadas incorporam a aleatoriedade, um comportamento essencial para a construção das primitivas de segurança que devem criptografar e proteger os dados do computador - fisicamente, direto no hardware, e não por programação.\n- https://web.archive.org/web/20180412105348/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=protecao-definitiva-contra-hackers-tem-poucos-atomos-espessura&id=010150171207\n- Artigo: [Physically Unclonable Cryptographic Primitives by Chemical Vapor Deposition of Layered MoS2](https://ipfs.infura.io/ipfs/QmdpoiSFc73HMngUxADZPxBsMToUkPGZb5eAa8HnFbbGsR)",
				"added": 1606091997
			},
			{
				"comment_id": 31,
				"body": "#Solucionador matemático impulsiona computadores analógicos\nSeu computador executa bem a maioria das tarefas - para processamento de texto, certos cálculos, artes gráficas e navegação na web, ele é a melhor ferramenta de trabalho de que você pode dispor na atualidade.\nMas a forma como os computadores digitais funcionam, com o seu estilo de matemática baseado no sistema de código binário - 0s e 1s, ou o \"ligado\" e \"desligado\" dos transistores - está longe de ser a ideal para resolver todos os tipos de problemas.\nÉ por isso que várias equipes em todo o mundo estão trabalhando para revitalizar a computação analógica.\nAlém de haver sinais de que a computação digital atingiu ou está muito próxima do seu potencial máximo, [chips analógicos gastam 1.000 vezes menos energia](https://web.archive.org/web/20190714184643/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=chip-analogico&id=010150160315), estão mais próximos de [imitar a forma de funcionamento do cérebro](https://web.archive.org/web/20200808122920/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=processador-analogico-imita-cerebro&id=010810111117) e prometem [defender a inteligência artificial contra os hackers](https://web.archive.org/web/20180922171031/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=chip-analogico-promete-defender-inteligencia-artificial-contra-hackers&id=010150180529) - há até quem defenda que [inteligência artificial pra valer vai exigir um hardware analógico](https://web.archive.org/web/20180922/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=hardware-analogico-dedicado-inteligencia-artificial-bate-digital&id=010150180622).\nEm mais um impulso na área, Botond Molnár e seus colegas da Universidade de Notre Dame, nos EUA, acabam de desenvolver uma nova abordagem matemática que ajudará a avançar a computação para além da estrutura digital.\n\n#Problemas NP\nO avanço está em um novo \"solucionador analógico\", que pode potencialmente encontrar a melhor solução para alguns dos problemas mais difíceis da computação, os chamados problemas [NP](http://127.0.0.1:43110/0sh.bit/?REeG) - na teoria da complexidade computacional, NP é o acrônimo em inglês para \"tempo polinomial não-determinístico\" (Non-Deterministic Polynomial Time).\nProblemas associados com dobramento de proteínas, bioinformática, tratamento de imagens médicas, agendamentos e muitas outras áreas são quase insolúveis pelos métodos computacionais conhecidos porque lidam com um número grande demais de variáveis - quando esse número é grande o suficiente, esses problemas são conhecidos como [NP-Complexos](https://en.wikipedia.org/wiki/NP-hardness), ou NP-Difíceis.\nDepois de testar seu novo método em uma variedade de problemas NP-Difíceis, os pesquisadores concluíram que seu solucionador analógico tem potencial para chegar a soluções melhores e possivelmente mais rápidas do que as que podem ser calculadas digitalmente, mesmo pelos mais poderosos supercomputadores.\n\n- https://web.archive.org/web/20190204085301/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=solucionador-matematico-impulsiona-computadores-analogicos&id=010150190103\n- Artigo: [A continuous-time MaxSAT solver with high analog performance](https://ipfs.infura.io/ipfs/QmVm4VHUULUijbsCT8gYVb4vKLBF7hgTL2x51o27bb23GF)",
				"added": 1606093168
			},
			{
				"comment_id": 32,
				"body": "#Criptografia \"inviolável\" imita coração e pulmões\nUma equipe da Universidade de Lancaster, no Reino Unido, criou um modelo matemático que descreve a complexa interação entre o coração e os pulmões, necessária para coordenar os seus ritmos, e usaram esse modelo para criar uma nova forma de criptografar informações.\n\"Criamos um novo esquema de criptografia derivado da biologia, radicalmente diferente de qualquer procedimento anterior. Inspirado na natureza temporalmente variável das funções de acoplamento cardiorrespiratória recentemente descobertas em humanos, propusemos um novo esquema de criptografia que é altamente resistente aos métodos convencionais de ataque,\" disse Tomislav Stankovski, líder do trabalho.\n\"Como acontece frequentemente com avanços importantes, esta descoberta foi feita exatamente na fronteira entre duas áreas diferentes - estamos aplicando física à biologia,\" disse sua colega Aneta Stefanovska.\n- https://web.archive.org/web/20170223/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=criptografia-inviolavel-imita-coracao-pulmoes&id=010150140404\n- Artigo: [Coupling Functions Enable Secure Communications](https://ipfs.infura.io/ipfs/QmSwbRkGxZShW6SMw9LHHeh1h4nRyQmMCrkd4UPUUchxau)",
				"added": 1606093578
			},
			{
				"comment_id": 52,
				"body": "#Histórico problema do caixeiro viajante é resolvido em hardware\nEngenheiros da Universidade de Ciências de Tóquio, no Japão, construíram um processador capaz de resolver um dos problemas mais intratáveis da ciência da computação.\nO \"[problema do caixeiro-viajante](https://en.wikipedia.org/wiki/Travelling_salesman_problem)\" é um problema de otimização combinatorial, em que um vendedor deve começar em uma cidade e retornar a essa cidade depois de viajar para todas as diferentes cidades em uma lista. A questão é saber qual é o caminho mais eficiente entre todos os pontos - o problema se torna exponencialmente mais difícil conforme cada cidade é adicionada à lista.\nÉ claro que a agenda de um vendedor ou entregador é apenas um exemplo do problema, e, além das questões de logística, há uma infinidade de situações correlatas que os computadores precisam resolver o tempo todo.\n- https://web.archive.org/web/20201024030059/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=problema-caixeiro-viajante-resolvido-hardware&id=010150200210\n- Artigo: [AI Chips on Things for Sustainable Society: A 28-nm CMOS, Fully Spin-to-spin Connected 512-Spin, Multi-Spin-Thread, Folded Halved-Interaction Circuits Method, Annealing Processing Chip](https://ipfs.infura.io/ipfs/QmcQUhc5T3zHZ2VaYaCt89g7mGE3uCYJwXutvS7kcsbyGQ)",
				"added": 1606336922
			},
			{
				"comment_id": 65,
				"body": "#Dinheiro virtual ultrasseguro garante transações pela galáxia\nUm novo tipo de [dinheiro](https://en.wikipedia.org/wiki/Money), mais versátil e mais seguro do que as atuais [criptomoedas](https://en.wikipedia.org/wiki/Cryptocurrency), promete dar aos usuários a capacidade de tomar decisões com base em informações que chegam em locais e horários diferentes ao redor do Universo, e ainda manter as economias seguras até mesmo contra ataques dos futuros [computadores quânticos](https://siasky.net/AADPtkEpVvk8qEq1wO4AG6khqbqd4O4zTuohHZtBbrDryw) - nossos ou de [ETs](https://en.wikipedia.org/wiki/Extraterrestrial_life).\n- https://web.archive.org/web/20200808122851/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=dinheiro-virtual-ultrasseguro-garante-transacoes-pela-galaxia&id=010150190607\n- Artigo: [S-money: virtual tokens for a relativistic economy](https://ipfs.infura.io/ipfs/QmT1fEsPZqYm7eqUW9rdUGRAMHSZz2V8U9u5oNZZZQxYsE)",
				"added": 1606501670
			},
			{
				"comment_id": 124,
				"body": "#Computador quântico chinês detona supremacia quântica\nUma equipe liderada por pesquisadores da Universidade de Ciência e Tecnologia da China construiu um tipo especial de computador quântico que demonstrou a supremacia quântica por uma larga margem.\nA supremacia quântica é o ponto a partir do qual os processadores quânticos superam definitivamente os processadores eletrônicos clássicos, solucionando problemas que seriam impossíveis de solucionar com a tecnologia baseada na eletrônica em um período de tempo razoável.\nNo ano passado, o [Google afirmou ter atingido a supremacia quântica](https://web.archive.org/web/20200927222259/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=google-afirma-ter-atingido-supremacia-quantica-ibm-contesta&id=010150191023) com seu processador Sycamore, mas o resultado foi rapidamente contestado por diversas equipes. A IBM, por exemplo, respondeu que seus supercomputadores clássicos poderiam executar algoritmos comuns para fazer os mesmos cálculos em 2,5 dias, o que questiona a vantagem quântica.\nJá a nova demonstração fez algo que supera tão de longe os computadores clássicos que parece não deixar margem a dúvidas.\nO processador quântico chinês, batizado de Jiuzhang, executou cálculos que seriam \"impossíveis\" de serem realizados por um supercomputador em um tempo razoável.\nPor exemplo, o supercomputador japonês Fugaku, o computador clássico mais poderoso do mundo atualmente, levaria 600 milhões de anos para realizar os cálculos que o Jiuzhang fez em apenas 200 segundos. E o maior supercomputador chinês, o Sunway TaihuLight - o quarto mais poderoso do mundo -, levaria 2,5 bilhões de anos para fazer o mesmo cálculo.\n- https://web.archive.org/web/20201205185843/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=computador-quantico-chines-detona-supremacia-quantica&id=010150201204\n- Artigo: [Quantum computational advantage using photons](https://ipfs.infura.io/ipfs/QmTFdLTnSPxm8mayj8UPHQUi1haT67MVivxx2QbM5jRrmw)",
				"added": 1607209262
			},
			{
				"comment_id": 141,
				"body": "#Cristais do tempo permitirão simular internet inteira\n- https://web.archive.org/web/20201126115056/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=cristais-tempo-permitirao-simular-internet-inteira&id=010150201124\n- Artigo: [Simulating complex quantum networks with time crystals](https://ipfs.infura.io/ipfs/QmSiTLNijq2TK65hYEPCqPEurn6vMwVoDTmNUsXqPVYwW1)",
				"added": 1607427027
			},
			{
				"comment_id": 166,
				"body": "#Uma reescrita do GameLauncher tirada de [Need For Speed: World](https://en.wikipedia.org/wiki/Need_for_Speed:_World)\n- https://soapboxrace.world/\n- https://github.com/SoapboxRaceWorld/GameLauncher_NFSW.git",
				"added": 1607642287
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 7,
				"body": "#Em um primeiro momento, os cientistas dizem que reverteram parcialmente um processo de envelhecimento celular em humanos\nCada vez que uma célula dentro de seu corpo se replica, um pedaço de sua juventude se desfaz em pó. Isso ocorre por meio do encurtamento dos [telômeros](https://en.wikipedia.org/wiki/Telomere), estruturas que \"cobrem\" as pontas de nossos cromossomos.\nAgora, cientistas em Israel dizem que foram capazes de reverter esse processo e estender o comprimento dos telômeros em um pequeno estudo envolvendo 26 pacientes.\n- https://web.archive.org/web/20201120093435/https://www.sciencealert.com/oxygen-therapy-found-to-turn-back-the-sands-of-time-on-our-body-s-aging-cells\n- Artigo: [Hyperbaric oxygen therapy increases telomere length and decreases immunosenescence in isolated blood cells: a prospective trial](https://ipfs.infura.io/ipfs/Qmc4qyowKm42E23ebUn8yYm9pGHGt4DK6FsygZmwFEZchs)",
				"added": 1605874227
			},
			{
				"comment_id": 142,
				"body": "#Estudo mostra em qual idade somos mais inteligentes\nEm qual idade somos mais inteligentes? Um grupo de cientistas alemães analisou mais de 24 mil jogos de xadrez, disputados em torneios profissionais ao longo de 125 anos, para conseguir essa resposta.\nA equipe de pesquisa, liderada  por Uwe Sunde, professor de economia da Universidade Ludwig Maximilian, localizada em Munique, Alemanha, concluiu que os humanos atingem seu pico cognitivo por volta dos 35 anos de idade. Após esse apogeu, as habilidades cognitivas tendem a abaixar após os 45 anos.\n“O desempenho individual aumenta drasticamente até o início dos anos 20 e, em seguida, atinge um platô, com pico em torno dos 35 anos e declínio sustentado nas idades mais avançadas”, dizem os autores do estudo, conforme destacou o [Fórum Econômico Mundial](https://web.archive.org/web/20201115140126/https://www.weforum.org/agenda/2020/10/chess-study-suggests-human-brain-peaks-at-35-years-of-age/).\n- https://web.archive.org/web/20201208111933/https://epocanegocios.globo.com/Tecnologia/noticia/2020/12/estudo-mostra-em-qual-idade-somos-mais-inteligentes.html\n- Artigo: [Life cycle patterns of cognitive performance over the long run](https://ipfs.infura.io/ipfs/QmfHCVHJkFSPusVJNBwmAU1ZjtLE6nyKFn6X946j6z7dkd)",
				"added": 1607510602
			},
			{
				"comment_id": 145,
				"body": "#Um novo estudo indica que suplementos que estimulam o cérebro possuem drogas não aprovadas\nUma nova pesquisa divulgada na revista [Neurology: Clinical Practice](https://doi.org/10.1212/CPJ.0000000000000960) aponta que suplementos que supostamente melhoram a saúde e o funcionamento do cérebro, conhecidos como [nootrópicos](https://en.wikipedia.org/wiki/Nootropic), geralmente contêm drogas não aprovadas e potencialmente perigosas para organismo. O estudo não apenas detectou drogas não aprovadas nos EUA para esses produtos nootrópicos, mas também descobriu que essas drogas poderiam estar em doses muito maiores do que as rotuladas ou em combinações que nunca foram testadas em pessoas.\n- https://web.archive.org/web/20201027184941/https://gizmodo.uol.com.br/suplementos-cerebro-drogas-nao-aprovadas/\n- Artigo: [Five unapproved drugs found in cognitive enhancement supplements](https://ipfs.infura.io/ipfs/QmRD2pB2h4X4mhiFPa2URZqCVAWqZ1tC3fga7PzXbw8XgX)",
				"added": 1607535183
			},
			{
				"comment_id": 157,
				"body": "#Remédio para insônia devolveu temporariamente a fala e movimentos para homem com lesão cerebral\nMédicos em Amsterdã afirmam que uma droga geralmente associada à sonolência foi capaz de gerar breves períodos de lucidez a um homem com uma grave lesão cerebral.\nEm um relatório publicado na revista [Cortex](https://doi.org/10.1016/j.cortex.2020.08.011), os especialistas descreveram que uma única dose do medicamento [zolpidem](https://en.wikipedia.org/wiki/Zolpidem) – mais conhecido pelo nome de marca Ambien – conseguiu restaurar temporariamente a capacidade do homem de falar e andar. Infelizmente, os efeitos duram apenas cerca de duas horas, mas o caso pode fornecer uma visão sobre como o cérebro pode ser danificado por derrames e outros traumas.\n- https://web.archive.org/web/20201101095230/https://gizmodo.uol.com.br/homem-lesao-cerebral-remedio-insonia-zolpidem-ambien/\n- Artigo: [Awakening after a sleeping pill: Restoring functional brain networks after severe brain injury](https://ipfs.infura.io/ipfs/QmYJbfVKX4x7fkaw1udH4MSFUPjczPDHdodrREjNcDep9j)",
				"added": 1607568512
			},
			{
				"comment_id": 158,
				"body": "#Santo Daime estimula formação de novos neurônios\nDurante séculos, as sociedades indígenas da Amazônia usaram a [ayahuasca](https://pt.wikipedia.org/wiki/Ayahuasca) para fins xamânicos - no Brasil, esse chá alucinógeno é mais conhecido como [Santo Daime](https://pt.wikipedia.org/wiki/Santo_Daime).\nPesquisadores da Universidade Complutense de Madrid (Espanha) descobriram agora que, em modelos animais, esta bebida estimula a formação de [neurônios](https://en.wikipedia.org/wiki/Neuron) e outras células cerebrais.\nA equipe espera que seus resultados estimulem pesquisas para o uso da planta medicinal como uma potencial terapia para distúrbios psiquiátricos e doenças neurodegenerativas.\nA ayahuasca é produzida a partir da mistura de duas plantas da Amazônia: a videira ayahuasca ([Banisteriopsis caapi](https://pt.wikipedia.org/wiki/Cip%C3%B3-mariri)) e o arbusto chacruna ([Psychotria viridis](https://pt.wikipedia.org/wiki/Chacrona)).\n#Dimetiltriptamina\nUm dos principais componentes naturais do chá de ayahuasca é a [dimetiltriptamina](https://en.wikipedia.org/wiki/N,N-Dimethyltryptamine) (DMT), e é ela que promove a [neurogênese](https://en.wikipedia.org/wiki/Neurogenesis) - a formação de novos neurônios.\nAlém dos neurônios, a infusão usada para fins xamânicos também induz a formação de outras células neurais, como [astrócitos](https://en.wikipedia.org/wiki/Astrocyte) e [oligodendrócitos](https://en.wikipedia.org/wiki/Oligodendrocyte).\n- https://web.archive.org/web/20201117092904/https://www.diariodasaude.com.br/news.php?article=santo-daime-estimula-formacao-novos-neuronios&id=14424\n- Artigo: [N,N-dimethyltryptamine compound found in the hallucinogenic tea ayahuasca, regulates adult neurogenesis in vitro and in vivo](https://ipfs.infura.io/ipfs/QmZNTTnf5vwMHgonFktAw84biVkdU514B4UXdda3ZGXYzc)",
				"added": 1607570016
			},
			{
				"comment_id": 162,
				"body": "#Modafinil: Remédio para ficar acordado mais tempo\nA Modafinila é o princípio ativo de um remédio usado no tratamento da [narcolepsia](https://web.archive.org/web/20200924192621/https://www.tuasaude.com/narcolepsia/), que é uma condição que causa sonolência excessiva. Assim, este remédio ajuda a pessoa a se manter acordado por mais tempo e reduz a probabilidade de ocorrência dos episódios de sono incontrolável.\nEste remédio atua no cérebro, excitando áreas do cérebro responsáveis pela vigília, inibindo assim o sono. A Modafilina, pode ser comprada em farmácias convencionais com o nome comercial de Provigil, Vigil, Modiodal ou Stavigile, sob a forma de comprimidos, por um preço de cerca de 130 reais, dependendo da quantidade de comprimidos na caixa do produto, mas só pode ser comprado com receita médica.\n- https://web.archive.org/web/20201020202447/https://www.tuasaude.com/modafinil-provigil/",
				"added": 1607613885
			},
			{
				"comment_id": 163,
				"body": "#Investigação do potencial uso do Modafinil como agente melhorador da memória\n- https://ipfs.infura.io/ipfs/Qma4jHoWdRRhkg72xfW5YuLJjAhF12EArP57eiqCo3HpCk\n\n#Influência da exposição ao modafinil sobre a preferência por anfetamina em diferentes períodos do desenvolvimento\n- https://ipfs.infura.io/ipfs/QmbyYuYNu24V6Y3rsWBjJCxMopwPqFxvVNCgtnYpFo5f53",
				"added": 1607614130
			},
			{
				"comment_id": 170,
				"body": "#Amplictil\n[Amplictil](https://web.archive.org/web/20170418114739/https://www.tuasaude.com/amplictil/) é um medicamento oral e injetável que tem como substância ativa a [Clorpromazina](https://en.wikipedia.org/wiki/Chlorpromazine).\nEsse medicamento é um [antipsicótico](https://en.wikipedia.org/wiki/Antipsychotic) indicado para diversos distúrbios psicológicos como a [esquizofrenia](https://en.wikipedia.org/wiki/Schizophrenia) e [psicose](https://en.wikipedia.org/wiki/Psychosis).\nO Amplictil bloqueia os impulsos da [dopamina](https://en.wikipedia.org/wiki/Dopamine), diminuindo os sintomas das doenças psicológicas, tem também um efeito sedativo que acalma e relaxa os pacientes.",
				"added": 1607745816
			},
			{
				"comment_id": 171,
				"body": "#Psilocibina\n- https://en.wikipedia.org/wiki/Psilocybin\n\nA [psilocibina](https://www.infoescola.com/farmacologia/psilocibina/) é um alcaloide com estrutura análoga a da serotonina. Possui atividade alucinógena, produzindo efeitos como alucinações e distúrbios sensoriais, sendo encontrada em determinadas espécies de cogumelos. Utilizada desde os tempos ancestrais em rituais, tendo relatos de mais de 3000 anos. Foi extensivamente utilizada na década de 1960, quando acontecia o movimento hippie.\nNo Brasil existem diversas espécies de cogumelos com propriedades alucinógenas, sendo que a maioria pertence aos gêneros [Pcilocybe](https://en.wikipedia.org/wiki/Psilocybe), [Panaeolus](https://en.wikipedia.org/wiki/Panaeolus) e [Pluteus](https://en.wikipedia.org/wiki/Pluteus), que possuem alcaloides indólicos derivados do triptofano, como a psilocibina.",
				"added": 1607746007
			},
			{
				"comment_id": 172,
				"body": "#LSD\n- https://en.wikipedia.org/wiki/Lysergic_acid_diethylamide\n\n[LSD](https://www.infoescola.com/drogas/lsd/) é uma abreviação usada para dietilamida do ácido lisérgico. Trata-se de uma droga alucinógena, sintética, isto é, fabricada em laboratório, de uso oral (é ingerida), que não possui odor, sabor ou cor, é mais comumente utilizada, por adolescentes e jovens.\nPequenas doses do LSD, em torno de 20 à 50 microgramas já produzem alterações mentais, provocando sérias distorções no funcionamento cerebral do usuário, ou melhor, alucinações, além de várias outras reações conforme veremos mais adiante.",
				"added": 1607746155
			},
			{
				"comment_id": 188,
				"body": "#O cientista que contribuiu para que o Uruguai tenha menos de 100 mortos pelo coronavírus\n- https://web.archive.org/web/20201216112238/https://brasil.elpais.com/ciencia/2020-12-16/o-cientista-que-contribuiu-para-que-o-uruguai-tenha-menos-de-100-mortos-pelo-coronavirus.html\n\nA ‘Nature’ reconhece Gonzalo Moratorio como um dos dez pesquisadores mais importantes de 2020 pelo desenvolvimento de um teste de diagnóstico barato e eficaz que ajudou seu país a conter o vírus",
				"added": 1608119682
			}
		],
		"1_1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU": [
			{
				"comment_id": 9,
				"body": "#Aquarela - Toquinho\n- https://invidious.snopyta.org/xT8HIiFQ8Y0\n- http://ipfs.io/ipfs/QmbJVDU7UTzmuVENgVeF9Pbj2YDi7CyucSB929CCtAWZNw\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_0",
				"added": 1605887839
			},
			{
				"comment_id": 13,
				"body": "#Quem de Nós Dois - Ana Carolina\n- https://invidious.snopyta.org/watch?v=z4j9BhlmSSU\n- https://siasky.net/AABUJb9Wkc0eMCyZwo6X1YuUeWAS1j0dacf3dVg3mbkMDQ\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_1",
				"added": 1605925027
			},
			{
				"comment_id": 14,
				"body": "#Palavras Ao Vento - Cássia Eller\n- https://invidious.snopyta.org/watch?v=z2CVgqPQmXY\n- http://ipfs.io/ipfs/QmXL6LTBiTrjiFTTS2CvEp9HZ5RKFj9M5ZXj6aWTbwD5AE\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_2",
				"added": 1605925296
			},
			{
				"comment_id": 85,
				"body": "> [theablet](#comment_101_1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn): 1 Hour Beautiful Piano & Instrument - Sad Inuyasha OST\n> \n> https://invidious.snopyta.org/RL977y-0Dyk\n> https://siasky.net/AACW6Qe0JqXr1glu0LROR-VOLll_rpkN-qFH4xbs0zH2Hw\n> \n> TRACKLIST: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LW5xtJQCi9aC3cHuwKxhUF8oG5bHaezYn_18\n\n#Mudar o Mundo (Change The World - Completa) - Anime Voices Brasil\n- https://invidious.snopyta.org/watch?v=O-8Rt5ffkrw\n- https://siasky.net/AADDy6khwT9zJrBfCpF5tnPWGo5h54TPbkTM2DwjlqiCJg\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_4",
				"added": 1606599759
			},
			{
				"comment_id": 104,
				"body": "#Inimigos da Minha Fé - Giesley Mota\n- https://invidious.snopyta.org/watch?v=_b7QGCMQHEI\n- https://siasky.net/AAA9S_YZxS7dN6zmTU5GlE_U2be2LeGFzn6hxF9Pm9Xuxw\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_5",
				"added": 1607007644
			},
			{
				"comment_id": 109,
				"body": "#O Melhor Que Eu Tenho - Regis Danese\n- https://invidious.snopyta.org/watch?v=UMw5TTSp62E\n- http://ipfs.io/ipfs/QmXJgJ6ZavHn6fc5F8GQiPs7AAmSysqBZgUmAtL8zvnZWG\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_6",
				"added": 1607083325
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 15,
				"body": "#Cada número ímpar maior que 1 é a soma de no máximo cinco primos - [Terence Tao](https://en.wikipedia.org/wiki/Terence_Tao)\n- https://arxiv.org/abs/1201.6656\n- https://ipfs.infura.io/ipfs/QmPGvyFrTeHku3Z7Bd7GLqoeQZqKUyTQEPcNQL77zhf7qn",
				"added": 1605926338
			},
			{
				"comment_id": 16,
				"body": "#[Os números primos como instrumento de estímulo à curiosidade dos estudantes](https://ipfs.infura.io/ipfs/Qma2GHdud83YyxRtFRvoEYiUrFruZ3mQ1wH87ksAWWZmah)\nA importância dos números primos na matemática é indiscutível. O fascínio por esses números ocorre desde a antiguidade com Eratóstenes e Euclides se estendendo até os dias contemporâneos. Apesar de grandes descobertas, relacionadas aos números primos, ao longo das história, ainda há muitos problemas em aberto na Teoria dos Números. Nessa perspectiva, alguns problemas em aberto podem ser utilizados para estimular a curiosidade dos alunos, ampliando o seu interesse pela matemática. Nessa dissertação, serão propostas duas sequências didáticas a serem trabalhadas com alunos do Ensino Fundamental II que relacionam o conteúdo dos números primos com dois desses problemas em aberto: a conjectura de Goldbach e os primos de Fermat. Essas sequências tem como objetivo geral mostrar aos estudantes que nem tudo está solucionado na matemática e que ainda há muitas perguntas sem respostas neste campo do conhecimento. Desta forma, neste trabalho, será feita uma revisão bibliográfica sobre os números primos assim como são trazidos históricos breves de alguns problemas em aberto dentro desta área. Espera-se que a discussão aqui contida também possa motivar o professor a produzir suas próprias sequências didáticas para aplicação em sala de aula. Finalmente, é esperado, nesse trabalho, que a curiosidade dos estudantes seja realmente estimulada durante o processo de ensino-aprendizagem e que eles demonstrem maior interesse pela matemática.",
				"added": 1605926874
			},
			{
				"comment_id": 17,
				"body": "#A constante De Bruijn-Newman não é negativa\n- https://ipfs.infura.io/ipfs/QmbSUsYJUt7T6xAAcFC7YKCwD6ERyJVrkWBp1P3dMVGjiq\n\nA [constante](https://en.wikipedia.org/wiki/De_Bruijn%E2%80%93Newman_constant) está intimamente ligada à [hipótese de Riemann](https://en.wikipedia.org/wiki/Riemann_hypothesis) sobre os zeros da [função zeta de Riemann](https://en.wikipedia.org/wiki/Riemann_zeta_function): uma vez que a hipótese de Riemann é equivalente à afirmação de que todos os zeros de H(0, z) são reais, a hipótese de Riemann é equivalente à conjectura de que Λ ≤ 0. [Brad Rodgers e Terence Tao provaram que Λ < 0 não pode ser verdade](https://doi.org/10.1017/fmp.2020.6), então a hipótese de Riemann é equivalente a Λ = 0. [Uma prova simplificada do resultado Rodgers-Tao foi posteriormente fornecida por Alexander Dobner](https://ipfs.infura.io/ipfs/QmdLt2biL3A6NCjnW2kFdfyNmPErz9vfsAuj3wXzhUzSTR).",
				"added": 1605927540
			},
			{
				"comment_id": 19,
				"body": "> [kywrepos](#comment_17_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K): A constante De Bruijn-Newman não é negativa\n> \n> https://doi.org/10.1017/fmp.2020.6\n> https://ipfs.infura.io/ipfs/QmbSUsYJUt7T6xAAcFC7YKCwD6ERyJVrkWBp1P3dMVGjiq\n> \n> A constante está intimamente ligada à hipótese de Riemann sobre os zeros da função zeta de Riemann: uma vez que a hipótese de Riemann é equivalente à afirmação de que todos os zeros de H(0, z) são reais, a hipótese de Riemann é equivalente à conjectura de que Λ ≤ 0. Brad Rodgers e Terence Tao provaram que Λ < 0 não pode ser verdade, então a hipótese de Riemann é equivalente a Λ = 0. Uma prova simplificada do resultado Rodgers-Tao foi posteriormente fornecida por Alexander Dobner.\n\n#Esforço computacional para o limite superior da constante de De Bruijn-Newman como parte de um projeto Polymath\n- https://github.com/km-git-acc/dbn_upper_bound.git",
				"added": 1605929251
			},
			{
				"comment_id": 47,
				"body": "#A matemática foi descoberta ou inventada?\nA arte de lidar com números é a maior invenção da humanidade, junto da escrita. Mas ela é realmente uma invenção? Ou a matemática sempre existiu na essência da natureza, e tudo o que fazemos é descobrir novos fragmentos dela? Veja o que a filosofia tem a dizer.\n- https://web.archive.org/web/20200929175755/https://super.abril.com.br/especiais/a-matematica-foi-descoberta-ou-inventada/",
				"added": 1606325957
			},
			{
				"comment_id": 48,
				"body": "#YouCubed\n- https://www.youcubed.org/pt-br/\n- https://www.facebook.com/MentalidadesMatematicas/\n\nMissão: incentivar todos os alunos a ter um bom desempenho em matemática por meio das Mentalidades de Crescimento e do ensino inovador",
				"added": 1606326396
			},
			{
				"comment_id": 51,
				"body": "#Palestra: Simetria, encontro da arte com a matemática (2020)\n- https://invidious.snopyta.org/watch?v=nmUStsbBE-A\n- http://ipfs.io/ipfs/QmXq8KPXrX9ZXJqQ6DxTvwtyVw253LtsuLVenkZiSXbTaH\n\nNão são poucos os exemplos de simetria que nossos olhos conseguem captar no dia a dia. Presente em diversos elementos da natureza, nas artes plásticas e até no corpo humano, a proporção áurea é talvez um dos mais conhecidos deles, e fascina por sua forma estética agradável.\nA ideia da palestra teve início com uma troca de correspondências entre o diretor-geral do [IMPA](https://impa.br/) e analista de sistemas Gilza de Melo, que toca, desde 2011, um projeto educacional com escolas da região do Vale do Jequitinhonha. Para a palestra “Simetria, encontro da arte com a matemática”, Gilza convidou alunos do 6º ao 9º ano de escolas do município de Curral de Dentro que participam da iniciativa. “Eles já haviam assistido a uma palestra do professor Paulo Ney, e esperam com muita alegria uma palestra do diretor do IMPA!”, conta Gilza sobre a expectativa dos alunos.",
				"added": 1606335053
			},
			{
				"comment_id": 57,
				"body": "#O Dr. [James Grime](https://twitter.com/jamesgrime) está discutindo uma nova constante geradora de [primos](https://en.wikipedia.org/wiki/Prime_number)\n- https://invidious.snopyta.org/watch?v=_gCKX6VMvmU\n- https://siasky.net/AACajsqngcu4c0u7eg3qKl--tEZSiCbICJIP8aS49Cy-Yw\n- Artigo: [A Prime-Representing Constant](https://ipfs.infura.io/ipfs/QmRy6DgMiK8gb5szkmXeZniTNj1rkffo1nf2D5VjVwYxU9)",
				"added": 1606400063
			},
			{
				"comment_id": 63,
				"body": "#A EQUAÇÃO DE UM MILHÃO DE DÓLARES! ([Equação de Navier-Stokes](https://www.claymath.org/millennium-problems/navier%E2%80%93stokes-equation))\n- https://invidious.snopyta.org/AeautqGKg2w\n- http://ipfs.io/ipfs/QmSiTj9b6kGyDCURpKv6hakWcjiVwxH97YwCCoBLuFwnbt",
				"added": 1606443025
			},
			{
				"comment_id": 64,
				"body": "#[Complexibilidade computacional no cálculo de números primos e perfeitos](https://ipfs.infura.io/ipfs/QmRhgpn2EAM9PwUtH2VPs1eJKdyUSa98H9XGuMsuuTWCjb)\nFatorar um número de 12 milhões de dígitos ou confirmar sua primalidade não é trivial. Os números primos são conhecidos e estudados há séculos por cientistas e pesquisadores de diversas áreas, que dedicam suas vidas para desvendar alguma particularidade desta classe de números tão singular. Com o advento da computação e a capacidade de processamento das máquinas, os estudos vêm evoluindo com muita rapidez, porém o custo computacional ainda é muito grande, levando-se em consideração, por exemplo, o teste de primalidade de [2^43112609 - 1](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_3). Por esta dificuldade de fatoração, utilizam-se os números primos na criptografia de dados para transmissão pela web, principalmente o Modelo de Criptografia RSA, que consiste basicamente na obtenção de dois números primos enormes como base para criação da chave pública para cifrar os dados. Assim, fica praticamente impossível alguém obter os divisor do número e achar a chave privada para decifrar os dados. Este trabalho visa quantificar e especificar a complexidade destes cálculos, e conhecer mais um pouco destes números especiais.",
				"added": 1606491829
			},
			{
				"comment_id": 67,
				"body": "#Motor de animação para vídeos explicativos de matemática\n- https://github.com/3b1b/manim.git",
				"added": 1606503778
			},
			{
				"comment_id": 71,
				"body": "#[There are infinitely many prime numbers in all arithmetic progressions with first term and difference coprime](https://ipfs.infura.io/ipfs/QmS7puZoKJN1yShrYts86USEo4F2cRztruQXxAuaFFZnYJ) - Peter Gustav Lejeune Dirichlet\nA prova de [Dirichlet](https://en.wikipedia.org/wiki/Peter_Gustav_Lejeune_Dirichlet) de infinitos primos em progressões aritméticas foi publicada em 1837, introduziu a série L pela primeira vez, e diz-se que deu início à rigorosa [teoria analítica dos números](https://en.wikipedia.org/wiki/Analytic_number_theory). Dirichlet usa o trabalho anterior de [Euler](https://en.wikipedia.org/wiki/Leonhard_Euler) sobre a função zeta e a distribuição dos primos. Ele primeiro prova um caso mais simples antes de ir para a generalidade completa. O artigo foi traduzido do alemão por R. Stephan e recebeu uma seção de referência.",
				"added": 1606506688
			},
			{
				"comment_id": 72,
				"body": "#Conjectura de Bunyakovsky\nA [conjectura de Bunyakovsky](https://everipedia.org/wiki/lang_en/Bunyakovsky_conjecture) (ou conjectura de Bouniakowsky) fornece um critério para um polinômio f(x) em uma variável com coeficientes inteiros para fornecer infinitos valores primos na sequência f(1), f(2), f(3),.... Foi afirmado em 1857 pelo matemático russo [Viktor Bunyakovsky](https://en.wikipedia.org/wiki/Viktor_Bunyakovsky).\n- https://en.wikipedia.org/wiki/Bunyakovsky_conjecture",
				"added": 1606508405
			},
			{
				"comment_id": 73,
				"body": "#[A conjectura de Bateman-Horn e o Lambda-cálculo de Golomb](https://ipfs.infura.io/ipfs/QmTdweKtP9KURSHpyVi9RFMuwAQZzxRTKBVsygUB3SWZ4S)\nA [Conjectura de Bateman-Horn](https://en.wikipedia.org/wiki/Bateman%E2%80%93Horn_conjecture) dá condições sobre uma família de polinômios com coeficientes inteiros $f_1(X),\\dots,f_k(X)$ para que hajam infinitos $n \\in \\N$ tais que $f_1(n),\\dots,f_k(n)$ sejam todos primos, e determina qual deve ser o comportamento assintótico de tais inteiros $n$. Neste texto, vamos estudar essa conjectura, assim como um método desenvolvido por [Solomon W. Golomb](https://en.wikipedia.org/wiki/Solomon_W._Golomb) que pode ser usado para demonstrá-la. Veremos que esse cálculo prova a Conjectura de Bateman-Horn a menos da troca de um limite com uma série infinita, que é o único passo ainda não provado desse método. Também estudaremos uma tentativa para solucionar esse problema por meio do uso de teoremas abelianos de regularidade, e provaremos que teoremas tão gerais não são suficientes para provar a troca do limite com a série.",
				"added": 1606508952
			},
			{
				"comment_id": 74,
				"body": "#[O reticulado inteiro e algumas aplicações](https://ipfs.infura.io/ipfs/QmVcf5YroKxh4qjHVzSQ4hcdRLZEyYTVmLyW3M1tTJYWyc)\nO presente trabalho tem como objetivo principal apresentar o Teorema de Hurwitz sobre a aproximação de números irracionais através de números racionais utilizando uma constante associada ao valor de raiz de 5 para as aproximações. Para isso, serão relembrados inicialmente alguns conhecimentos sobre Teoria dos Números, tais como divisibilidade e congruências modulares, bem como alguns teoremas acerca de números primos e inteiros que podem ser escritos como soma de dois quadrados. Posteriormente, serão apresentados o reticulado dos números inteiros e algumas das propriedades de seus pontos, assim como alguns teoremas geométricos sobre tais pontos. Em uma última parte será desenvolvida a sequência de Farey em conjunto com os círculos de Ford, para apresentação dos teoremas que garantem a convergência de frações contínuas e, assim, a demonstração do Teorema de Hurwitz.",
				"added": 1606511202
			},
			{
				"comment_id": 77,
				"body": "#Número de Lychrel\nUm [número de Lychrel](https://everipedia.org/wiki/lang_en/Lychrel_number) é um [número natural](https://en.wikipedia.org/wiki/Natural_number) que não pode formar um [palíndromo](https://en.wikipedia.org/wiki/Palindromic_number) por meio do processo [iterativo](https://en.wikipedia.org/wiki/Iteration) de reverter repetidamente seus dígitos e adicionar os números resultantes. Esse processo às vezes é chamado de algoritmo 196, em homenagem ao número mais famoso associado ao processo.\n- https://en.wikipedia.org/wiki/Lychrel_number",
				"added": 1606526982
			},
			{
				"comment_id": 78,
				"body": "#Cada número inteiro positivo é uma soma de três palíndromos\n\"Para inteiro g≥5, provamos que qualquer inteiro positivo pode ser escrito como uma soma de três palíndromos na base g.\"\n- https://ipfs.infura.io/ipfs/QmbZQTvKYUcBJepgSFvB2mYG6HuPw4BdtLnbf41ugSSfHb",
				"added": 1606527434
			},
			{
				"comment_id": 80,
				"body": "#Matemático peruano resolve problema de 3 séculos sobre números primos\nO peruano [Harald Andrés Helfgott](https://en.wikipedia.org/wiki/Harald_Helfgott) afirma ter conseguido resolver um problema matemático sem solução por 271 anos. A chamada \"[conjectura fraca](https://en.wikipedia.org/wiki/Goldbach%27s_weak_conjecture)\" [proposta por Christian Goldbach, em 1742](https://web.archive.org/web/20160920102424/http://www2.uol.com.br/sciam/noticias/numeros_primos_de_goldbach.html), diz que cada número ímpar maior do que cinco pode ser expresso como uma soma de três números primos, mas ninguém tinha conseguido provar isto. Os números primos são aqueles que só são divisíveis por eles mesmos e por um.\n- https://web.archive.org/web/20161101121937/http://noticias.uol.com.br/ciencia/ultimas-noticias/redacao/2013/05/24/matematico-peruano-resolve-problema-de-3-seculos-sobre-numeros-primos.htm\n- Artigos: https://ipfs.io/ipfs/QmXavR4PcyZkRX8vzbK6itqENKLZctSYDMDFaiCEmKRkqw",
				"added": 1606531255
			},
			{
				"comment_id": 119,
				"body": "#[Geometria Hiperbólica: Explorando o Disco de Poincaré no Ensino Médio](https://ipfs.infura.io/ipfs/QmQj9yQ3w6uydLuKP3ecg2EpJXYWaemMRwRs1xvtaFF6Jt)\nEste trabalho trata da introdução ao conhecimento sobre [geometria hiperbólica](https://en.wikipedia.org/wiki/Hyperbolic_geometry), uma das geometrias conhecidas como não-euclidianas. Para isso é apresentado um breve relato histórico envolvendo os matemáticos que contribuíram de alguma forma para o desenvolvimento desta geometria, além do estudo de alguns de seus resultados e modelos de representação. É bastante interessante compreender o que seja o método axiomático, a partir da comparação dos conceitos e propriedades da geometria hiperbólica com os da já conhecida geometria euclidiana. As Geometrias Euclidiana e Hiperbólica diferem basicamente pelo quinto postulado de Euclides e uma curiosidade sobre suas concepções é que a euclidiana foi observada a partir de situações concretas e depois transformada em teoria matemática organizada, já a geometria hiperbólica foi obtida em forma de teoria lógica, coerente e consistente para depois ganhar uma interpretação visual. Este estudo pretende mostrar que é possível estabelecer conexões entre estas duas geometrias a ponto de explorar, ainda que superficialmente, o assunto numa turma de ensino básico, usando como apoio o modelo conhecido como “[Disco de Poincaré](https://en.wikipedia.org/wiki/Poincar%C3%A9_disk_model)”, que aproxima bem as duas geometrias.",
				"added": 1607198420
			},
			{
				"comment_id": 120,
				"body": "#[Estudo global de sistemas polinomiais planares no disco de Poincaré](https://ipfs.infura.io/ipfs/QmQ8ymjZTwiTzvXtqtDVy91YLz5pG6SpC6AVdquBtMYj7Z)\nDado um sistema diferencial no plano, muito se questiona sobre o comportamento de suas soluções. Nas vizinhanças dos pontos singulares existem ferramentas que nos indicam o tipo e a estabilidade estrutural de cada um deles; são as chamadas formas normais. No entanto, o interesse vai mais além do conhecimento local das soluções em cada singularidade. Nesse trabalho apresentamos algumas ferramentas clássicas da teoria qualitativa das equações diferenciais ordinárias empregadas na investigação global dos campos de vetores polinomiais planares e as empregamos na investigação de duas famílias paramétricas de campos quadráticos encontradas no estudo dos campos com hipérboles invariantes. Dentre as ferramentas estudadas destacamos a classificação local das soluções em pontos singulares elementares e semi-elementares e a técnica de compactificação de Poincaré.",
				"added": 1607199296
			},
			{
				"comment_id": 132,
				"body": "#[NÚMEROS TRANSCENDENTES](https://ipfs.infura.io/ipfs/QmdakF6BoqZQjN2BZirBenM3HYWw5Ly8ukQrYufj22p3vc)\nSeja Z o conjunto dos números racionais inteiros e Q o conjunto dos racionais. Seja R o conjunto dos reais e C o dos complexos. Todo número que não é racional chama-se irracional. Seja Qalg o conjunto de todos os números algébricos, i.e., números que são raízes de polinômios p(x) a coeficientes inteiros. A será o conjunto de todos os números algébricos que não são racionais. Um número real ou complexo que não é algébrico chama-se transcendente.",
				"added": 1607297400
			},
			{
				"comment_id": 133,
				"body": "#[Equações polinomiais e números transcendentes](https://ipfs.infura.io/ipfs/QmSJZ1ayQqRrc3R5YpnwZ4rBX1cnDpJTVfyJ8XQwvCM93V)\nO trabalho tem como foco principal o estudo das Equações Polinomiais e uma introdução aos Números Transcendentes, com enfoque especial aos números de Liouville. No entanto, aborda também temas importantes como os conjuntos numéricos, a teoria dos números inteiros, a enumerabilidade de conjuntos e o estudo de polinômios, buscando sempre fazer ligações entre os assuntos através de exemplos pertinentes aos mesmos.",
				"added": 1607297531
			},
			{
				"comment_id": 134,
				"body": "#[Uma coleção de resultados sobre números normais](https://ipfs.infura.io/ipfs/QmQTQHU331QmWFofH14AAGBhGRtUozbq5zuMBRTFoyDbQF)\nEntre os mais conhecidos estudos de probabilidades aplicados a teoria dos números, encontra-se o conceito de normalidade. Neste trabalho apresentamos uma coleção de resultados clássicos da teoria dos números normais, incluindo as provas da normalidade da [Constante de Champernowne](https://en.wikipedia.org/wiki/Champernowne_constant) e da [Constante de Copeland-Erdos](https://en.wikipedia.org/wiki/Copeland%E2%80%93Erd%C5%91s_constant). Listamos também em algumas aplicações obtidas da conexão desta teoria com a das sequências equidistribuídas das módulo um, estudadas em sistemas dinâmicos. Entre elas, vamos provar o resultado conhecido por critério de normalidade devido a Pjateckii-Sapiro. Além disso, apresentamos um estudo que desenvolvemos sobre translações que preservam a normalidade, introduzindo o conceito de número determinado. Provamos aqui, independentemente, uma versão mais fraca de um resultado devido a Rauzy que caracterizou o conjunto dos números com os quais podemos formar translações que preservam a normalidade.",
				"added": 1607297783
			},
			{
				"comment_id": 135,
				"body": "#A Teoria dos Números à la Baker (2018)\n- https://invidious.snopyta.org/lRsonYq3PNA\n- http://ipfs.io/ipfs/QmNzNA3V6QojvQWBVDp3xbevM25bU861pMAyQRBQoRXknH\n\nExpositor: [Diego Marques](http://diego.mat.unb.br/index.html) (UnB)\nResumo: Nessa palestra de divulgação falaremos sobre alguns resultados do matemático inglês [Alan Baker](http://127.0.0.1:43110/0sh.bit/?fDzx). Em particular, daremos ênfase nos impactos de sua pesquisa no avanço da [Teoria dos Números transcendentes](https://web.archive.org/web/20200110101123/http://www.im.ufrj.br/walcy/Bienal/textos/TEORIA%20DOS%20NUMEROS.pdf) e aplicações em métodos efetivos em problemas Diofantinos.",
				"added": 1607299301
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 24,
				"body": "#[Considerações sobre a teoria do cérebro triuno e sua relevância para uma filosofia da mente e das emoções](https://ipfs.infura.io/ipfs/QmSZLNLUAx6xcWu1GLSv3g8QQztDJf6gQAgNmtnpQ19bT5)\nEste artigo estabelece algumas relações fundamentais entre evolução, a teoria do cérebro triuno e a relevância que esta pode ter para a fundamentação empírica de uma filosofia da mente e das emoções. Inicialmente, será especialmente considerada a posição do filósofo Ronald de Sousa no seu já clássico artigo “[The Mind’s Bermuda Triangle: Philosophy of Emotions and Empirical Science](https://ipfs.infura.io/ipfs/QmPc4TQFWqaSKfkUxR7feS7zWWpvB5HkbcNXGfcXbzGG3J)”, parte do Oxford Handbook of Philosophy of Emotions. A segunda seção discute a validade da teoria do “cérebro triuno” como abordagem neuroetológica evolutiva, delineando sua divisão tripartite do cérebro e analisando críticas e elogios às suas ideias, além de considerações de neurocientistas importantes no campo do estudo das emoções como Ledoux e Panksepp sobre tal tema. Na terceira seção, trato de um trabalho de Pollen e Hofmann que nos serve de apresentação de novas abordagens contemporâneas para a compreensão da evolução do cérebro. Como conclusão delineio um marco de trabalho na forma de uma agenda de pesquisa para as relações entre biologia evolutiva, neurociência e o estudo filosófico das emoções.",
				"added": 1606001278
			},
			{
				"comment_id": 113,
				"body": "#Prova da Existência de Deus\n[Descartes](https://en.wikipedia.org/wiki/Ren%C3%A9_Descartes) aceitava que o mundo tivesse sido criado por Deus, aceitava que, se Deus existisse, ele seria garantia e suporte de todas as outras verdades. Mas, como saber se Deus existe ou não? Como provar a sua existência se apenas podia ter a certeza da existência do cogito?\nNas suas obras, Descartes apresentou três provas da existência de Deus.\n- [1ª Prova a priori pela simples consideração da ideia de ser perfeito](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_7)\n- [2ª Prova a posteriori pela causalidade das ideias](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_8)\n- [3ª Prova a posteriori baseada na contingência do espírito](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K_9)\n\nFonte: https://web.archive.org/web/20201205154546/https://webpages.ciencias.ulisboa.pt/~ommartins/seminario/descartes/existenciadedeus.htm",
				"added": 1607185441
			},
			{
				"comment_id": 115,
				"body": "#“Princípios da Filosofia” de Descartes\n- https://siasky.net/AABFleWkzFIOSEmPqq1IgFaBBcjlXR_HD1ekIr1Z-PRn8A\n\nO livro foi uma tentativa ambiciosa de [Descartes](https://en.wikipedia.org/wiki/Ren%C3%A9_Descartes) de expor, na forma de um compêndio, um sistema inteiro de pensamento sobre a natureza da matéria, natureza da mente e atividade de Deus em criar e pôr em movimento o universo. A obra apresenta quatro partes. A parte I trata de metafísica, e questões como cognição, fontes do conhecimento e da compreensão do homem, e a relação entre um Deus perfeito e onisciente e o erro humano, tanto intelectual como moral. A parte II abrange os princípios gerais da física e da teoria das leis do movimento. A parte III é dedicada aos fenômenos astronômicos. E a parte IV trata das propriedades de minerais, metais, ímãs e outros fenômenos naturais e sua percepção pelos sentidos.",
				"added": 1607191054
			},
			{
				"comment_id": 125,
				"body": "#Sequência de treze palestras proferidas pelo prof. [Clóvis de Barros Filho](http://lattes.cnpq.br/0774770071354712), na Unimed de Belo Horizonte, nos anos de 2009 e 2010:\n- https://invidious.snopyta.org/playlist?list=UUhNB5bpSvKPxjBcjZFj0k3Q",
				"added": 1607217016
			},
			{
				"comment_id": 127,
				"body": "#[Argumento ontológico. A prova a priori da existência de Deus na filosofia primeira de Descartes](https://ipfs.infura.io/ipfs/QmY5fwyU2NrndjK9gAUFki6jphK3eZeV9SM6xRECvHHJuj)\nA prova ontológica cartesiana tem duas partes: a primeira consiste em inferir da idéia clara e distinta da essência de Deus o conhecimento verdadeiro dessa essência, que é caracterizada como a de um ente sumamente perfeito. A segunda parte tem como premissa inicial o conhecimento da essência de Deus. A partir desse conhecimento é provada a sua existência. A principal objeção à primeira parte da prova se baseia na crítica de S. Tomás ao argumento de S. Anselmo. Ela consiste em mostrar que da idéia (ou do conceito) de Deus é legítimo inferir a idéia da existência de Deus. Assim, se Deus é pensado, então é necessariamente pensado como existente. Mas do conceito de Deus não se pode inferir a sua existência, como pretendeu demonstrar o argumento de S. Anselmo. Os principais objetores da segunda parte da prova são Gassendi, Kant e alguns filósofos analíticos. Essas críticas se apóiam na tese de que existência não é um predicado real ou não é um predicado de primeira ordem e que, portanto, não pode ser uma propriedade de objetos, embora possa ser uma propriedade de conceitos (ou funções proposicionais). Se a prova cartesiana tem alguma plausibilidade, ela deve se esquivar dessas críticas. Nesse trabalho, pretendemos reconstruir essa prova tendo como fio condutor as objeções acima mencionadas.",
				"added": 1607224140
			},
			{
				"comment_id": 128,
				"body": "#[CONSIDERAÇÕES SOBRE A PROVA DA EXISTÊNCIA DE DEUS ELABORADA POR HASDAI CRESCAS (1340-1411)](https://ipfs.infura.io/ipfs/Qmagv8j7wKVQCtqfNNHKR6R9aEqQJggjSRh6o8MywP8efi)\nNeste artigo,é exposto e discutido o caminho percorrido por Hasdai Crescas (1340-1411), filósofo judeu medieval que viveu em Barcelona, na elaboração de sua prova para a existência de Deus, formulada com base em sua crítica às provas apresentadas por Maimônides (1138-1204) no \"Guia dos Perplexos\". A crítica de Crescas parte da formulação de um conceito geral de existência aplicável tanto ao ser necessário quanto aos seres contingentes. Outro aspecto interessante em seu caminho para a elaboração da prova da existência de Deus é a distinção que ele faz entre quididade e existência no ser necessário, posição única entre os medievais e que introduz um importante aspecto de imanência em sua ideia de Deus, distinguindo-a radicalmente daquela defendida por Maimônides.",
				"added": 1607224244
			},
			{
				"comment_id": 129,
				"body": "#[A prova da existência de Deus em Santo Agostinho (De libero arbitrio) e em Santo Anselmo (Proslogion)](https://ipfs.infura.io/ipfs/QmWkCStFuQtQZV1WkGQbY9WWdNwxrn6rs8mDrRHvKmHzvb)\nO objecto deste estudo teve a intenção de apresentar algumas afinidades de linguagem e de raciocínio entre o segundo livro do De libero arbitrio de Santo Agostinho e os primeiros três capítulos do Proslogion de Santo Anselmo, a respeito da prova da existência de Deus. Com efeito, para a maior parte dos augustinianos, e até mesmo dos anselmianos, há verdadeiramente uma filiação do pensamento de Santo Anselmo em Santo Agostinho. Podemos dizer que Anselmo de Cantuária é o principal propagador, ainda que de uma forma inovadora, de um certo pensamento augustiniano, que se reflecte na sua obra e, nomeadamente, no Proslogion. Esta influência denota, ao mesmo tempo, uma proximidade textual e conceptual, de que é a fonte criadora para o monge de Bec. De facto, para bem destrinçar os antecedentes do pensamento anselmiano, é preciso encontrar os princípios de formulação racional, que são semelhantes em Anselmo e Agostinho. Ora, foi nisso que consistiu o nosso trabalho, tanto mais que, entre os trabalhos existentes, assiste-se a uma abordagem menos desenvolvida a este propósito.",
				"added": 1607224353
			},
			{
				"comment_id": 130,
				"body": "#[A Elevação do Espírito Pensante a Deus, ou a Natureza Lógica do Conceito nas Preleções de Hegel Sobre as Provas da Existência de Deus](https://ipfs.infura.io/ipfs/QmekBY4FKVGvjvESEeRbUghC4Li9ggB7LdkmjGkhCtjC1c)\nO artigo investiga a relação existente na filosofia de Hegel entre as provas sobre a existência de Deus e a elevação do espírito humano a Deus. Dois pontos serão ressaltados: a apreensão de Deus como espírito e a natureza lógica do Conceito e isso a partir do modo como Hegel discute tanto a necessidade histórica da “prova” da existência de Deus, surgida com o Cristianismo, quanto o sentido lógico-especulativo das duas principais modalidades dessas provas: a prova ontológica e a prova cosmológica.",
				"added": 1607224546
			}
		],
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 26,
				"body": "#Brasil utiliza há mais de 60 anos criptografia de empresa que era controlada pela CIA, revelam documentos\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:2_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K/Brasil+utiliza+h+mais+de+60+anos+criptografia+de+empresa+que+era+controlada+pela+CIA+revelam+documentos",
				"added": 1606071734
			}
		],
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 34,
				"body": "#Da Democracia à Liberdade: A Diferença entre Governo e Autodeterminação\n- https://ipfs.infura.io/ipfs/QmTG8T8dtteQ76FpC7YhU1xGjq49Rj72wXcMXuXGztZnah\n\nDa democracia à liberdade surgiu de anos de diálogo entre participantes de movimentos sociais em várias partes do mundo. Explorando como as revoltas recentes foram catalisadas e limitadas pelo discurso democrático, o livro explora a diferença entre governo e autodeterminação, propondo novas maneiras de entender o que estamos fazendo quando escolhemos tomar decisões em conjunto.\n\n- Fonte: https://pt.crimethinc.com/books/da-democracia-a-liberdade",
				"added": 1606157513
			},
			{
				"comment_id": 35,
				"body": "#Trabalho\n- https://ipfs.infura.io/ipfs/QmfTAt82bu9g7DJymBpvgSwJJpChpvpqAA5868mxkcLEVy\n\nDepois de tanto progresso tecnológico, por que temos que trabalhar mais do que nunca? O que acontece que quanto mais trabalhamos, mais pobres ficamos em comparação com nossos chefes? Trabalho, oferece um panorama de como o capitalismo funciona no século 21 e o que podemos fazer para superá-lo.\n- Fonte: https://pt.crimethinc.com/books/trabalho-edicao-resumida-de-emergencia",
				"added": 1606158430
			},
			{
				"comment_id": 36,
				"body": "#Receitas para o Desastre: um livro de receitas anarquista\n- https://ipfs.infura.io/ipfs/QmWCcUdKLkW1vaiY8wGc14oX2LdjsrQZfpBG7GWKCnZXum\n\nTendo levado três anos para ser feito, Receitas para o Desastre é a tão esperada sequência para o famoso primeiro livro do [coletivo](https://pt.crimethinc.com/), [Dias de Guerra, Noites de Amor](https://siasky.net/AAC3nPHwMUzkLOaEWhyaP1IfHnJ7Ktd70n7RmxHRVDgOzQ). Este manual de 500 páginas complementa o romance e idealismo da obra anterior com informações e instruções práticas. Se você está procurando por um manual tático para ação revolucionária, já encontrou.\n- Fonte: https://pt.crimethinc.com/books/receitas-para-o-desastre",
				"added": 1606160327
			},
			{
				"comment_id": 152,
				"body": "#A inutilidade das leis - Peter Kropotkin\n- https://bibliotecaanarquista.org/library/peter-kropotkin-a-inutilidade-das-leis\n- https://ipfs.infura.io/ipfs/QmYCUx8uh6sid1dv5YMrFay5wMijVdTwt2Pr7hyFecnJzC\n\n\"A um exame atento, as milhares de leis que existem para regular a humanidade parecem estar divididas em três categorias principais: proteção da propriedade, proteção dos indivíduos, proteção do governo. E analisando cada uma destas categorias, chegamos a uma única e inevitável conclusão lógica e necessária: a inutilidade e perniciosidade das leis.\"",
				"added": 1607553230
			},
			{
				"comment_id": 153,
				"body": "#O Pensamento Socialista Libertário de Noam Chomsky - Felipe Corrêa\n- https://bibliotecaanarquista.org/library/felipe-correa-o-pensamento-socialista-libertario-de-noam-chomsky\n- https://ipfs.infura.io/ipfs/QmafnyAbaxoDYGoWoaTDew2svnNNzQrgaSxkcYNfJGQSiD",
				"added": 1607553606
			}
		],
		"2_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ": [
			{
				"comment_id": 58,
				"body": "#Desenhos animados norte-coreanos\n- https://invidious.snopyta.org/playlist?list=PLhnjHmMnkGpCW2rrTDB0lVrU93lD93dIs\n- https://ipfs.io/ipfs/QmZZQwoWdjMjvCxGZRZYBdHWo2hvW9D4DLFpotP2L1BSy9",
				"added": 1606416580
			},
			{
				"comment_id": 81,
				"body": "#PAPO COM [JOÃO CARVALHO](https://twitter.com/assimdisseojoao) SOBRE A COREIA POPULAR\n- https://invidious.snopyta.org/C-STbWOwpvQ\n- https://siasky.net/AAD05OVSTpcawwnFh5YMGnL9POOKx18R7ue0zoQ7uInxRw",
				"added": 1606566918
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 59,
				"body": "#Ultraman (Netflix)\nDécadas atrás, um herói vindo das estrelas deixou o mundo em paz. Agora, o filho de Ultraman precisa proteger a Terra de uma nova ameaça alienígena.\n#Temporada 1:\n- [Ep. 01](https://siasky.net/AABNQyn4HArXgBKQOqq70E3r7YkenOSTNB6CdFH0HYrJRg)\n- [Ep. 02](https://siasky.net/AAB0rnmjGC7Oh-RC0AIfa_Om3rP2OhGG1fz_CdWIMy3gfw)\n- [Ep. 03](https://siasky.net/AAAVEz0lofuOrIQsaB6RdcxRYKVo7-k0BKmMpzMRrnNULw)\n- [Ep. 04](https://siasky.net/AABLysEo7HDbuWEZ42KsQ-DnxKx3nHVDs_Dh7X8Pt8B7wg)\n- [Ep. 05](https://siasky.net/AADA1MbJnstGFYohb5VgwJqjGJ-AqEUKHxB_5rRcPvrJZQ)\n- [Ep. 06](https://siasky.net/AACttWgKFd-jL85L-ZpI3FPqzWroBf9Oq-HDuCFhg537uw)\n- [Ep. 07](https://siasky.net/AABCt92i1cDp-EKOdfgcSnOpR1Mny48zut-bwDgLQ2LUNA)\n- [Ep. 08](https://siasky.net/AADXHf_A6FU8HqxSYpg9oEHFa9Nds2ErpkHjyv-SWiSLlg)\n- [Ep. 09](https://siasky.net/AADyUOpuRXujo03gFcE9MW8bPqS_GC_4DBCj8pvCyihrHg)\n- [Ep. 10](https://siasky.net/AABlkKg0ww1KsIftce7mTDwuosemObOIl0Zy6pCMU6_ymg)\n- [Ep. 11](https://siasky.net/AAAOmmafjc2Hfx8DNqtX-X-oqFwO1dMMk2Do_u_iOjZQmw)\n- [Ep. 12](https://siasky.net/AACwSQc3aeoSkikqSDrNBDE4d1lnco1_NxpvOws566JSbQ)\n- [Ep. 13](https://siasky.net/AAAniBuWtKL_CPfnGEKgcQRonxkJjc3nN_EgXGxbYdA2aA)",
				"added": 1606440020
			},
			{
				"comment_id": 187,
				"body": "#Maō Gakuin no Futekigōsha\nApós 2.000 anos de incontáveis guerras e contendas, o rei demônio Anos Voldigoad fez um acordo com o herói humano, Kanon, para sacrificar sua própria vida para garantir que a paz pudesse florescer. Reencarnando 2.000 anos depois, Anos descobre que os demônios reais agora governam duramente sobre os demônios híbridos de classes mais baixas em uma sociedade que valoriza os descendentes de sangue puro de Anos sobre os demônios que cruzam com outras espécies, como humanos e espíritos. Descobrindo que a magia como um todo começou a declinar e seus descendentes mais fracos como resultado da paz que ele criou, Anos, agora tecnicamente um híbrido, decide reivindicar seu antigo título de Rei Demônio, mas primeiro, ele deve se graduar no Demônio King Academy, onde ele é rotulado como um desajustado total.\n#1ª temporada\n- Episódios (01 - 12): https://ipfs.io/ipfs/QmRKKn64bR3XSAbJSmyFLEpGgoCGcvN8tjRjq7gdDq6FSh\n- Episódio 13: https://siasky.net/AAB0oAIJ_cQTzTb8o8rFnt5ONVUihOgDs_ER34mTzvIQwQ",
				"added": 1607984990
			}
		],
		"3_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": [
			{
				"comment_id": 76,
				"body": "#Roda Viva | [Bruno Covas](https://twitter.com/brunocovas) e [Guilherme Boulos](https://twitter.com/GuilhermeBoulos) | 23/11/2020\n- https://invidious.snopyta.org/Q7m1unFBczs\n- https://ipfs.io/ipfs/QmegeAoLXD3dLG6eSmpjyoXwpX6wc6vRg4tdxvN3cPTkGq",
				"added": 1606520063
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 82,
				"body": "#NUAWEB - Núcleo de Pesquisa em Arquivamento da Web e Preservação Digital\n- https://www.ufrgs.br/nuaweb/\n\nO Núcleo de Pesquisa em Arquivamento da Web e Preservação Digital foi criado em 2017 com o objetivo de investigar características do arquivamento da web por meio de iniciativas nacionais e internacionais, lidando tanto com as políticas, quanto as tecnologias envolvidas no processo. Estuda aspectos referentes a preservação, uso e acesso ao longo do tempo de objetos digitais disponibilizados na web de forma retrospectiva e como memória digital (website, som, imagem, vídeo, banco de dados, dados de redes sociais, entre outros), com contribuições da Arquivologia, Biblioteconomia, Ciência da Informação, Comunicação e Ciência da Computação.",
				"added": 1606570977
			},
			{
				"comment_id": 83,
				"body": "#[O Historiador e as Fontes Digitais: uma visão acerca da Internet como fonte primária para Pesquisas Históricas](https://ipfs.infura.io/ipfs/QmThhEqhVijNuhMyPHvR3ECLNUmAfThxt74WS2ZdCpzPni)\nEste artigo procura abordar a utilização das fontes digitais no ofício do historiador. Em especial os pesquisadores do Tempo Presente, após o advento da Internet, passaram a contar com um aporte quase inesgotável de novas fontes. Todavia, ainda são poucas as pesquisas históricas que utilizam a Internet como fonte primária. Durante séculos, a historiografia baseou-se na análise em um suporte documental específico: o papel. O documento digital constitui uma novidade e sua materialidade de caráter “virtual” ainda causa estranheza. Neste texto é analisado o atual panorama da historiografia e das fontes digitais, com mais atenção à utilização da Internet como fonte primária no ofício do historiador.",
				"added": 1606571398
			},
			{
				"comment_id": 84,
				"body": "#Rumo a uma era digital obscura?\nBoa parte da informação gerada nesta era será inacessível para as gerações futuras pela deterioração dos dados, a obsolescência tecnológica ou as leis do ‘copyright’\n- https://web.archive.org/web/20200717160623/https://brasil.elpais.com/brasil/2015/02/27/tecnologia/1425053335_288538.html\n- https://siasky.net/_AhuO1wabnkmm9-GvOiiVF8-IH3HbyYsF53BnP2bMjHdMw",
				"added": 1606572143
			},
			{
				"comment_id": 110,
				"body": "#Escravos africanos e o tráfico atlântico: História “politicamente incorreta”\n- https://web.archive.org/web/20201121230717/https://xadrezverbal.com/2014/02/28/escravos-africanos-e-o-trafico-atlantico-historia-politicamente-incorreta/\n- https://siasky.net/_A3CuIWc7ZYf8ABkC_iSDHUISp7mGpmL4vrvsT3WIp-XWA",
				"added": 1607132837
			},
			{
				"comment_id": 154,
				"body": "#O que está acontecendo na Venezuela?\n- https://www.brasildefato.com.br/especiais/o-que-esta-acontecendo-na-venezuela/\n- https://web.archive.org/web/20201101094822/https://www.brasildefato.com.br/especiais/o-que-esta-acontecendo-na-venezuela/",
				"added": 1607558035
			},
			{
				"comment_id": 155,
				"body": "#Eleição sem Lula é fraude\nCobertura e desdobramentos em torno do julgamento do ex-presidente\n- https://www.brasildefato.com.br/especiais/especial-or-eleicao-sem-lula-e-fraude\n- https://web.archive.org/web/20190330195011/https://www.brasildefato.com.br/especiais/especial-or-eleicao-sem-lula-e-fraude",
				"added": 1607558140
			},
			{
				"comment_id": 160,
				"body": "#Paulo Freire e as lutas populares na África do Sul\nPaulo Freire foi um educador radical brasileiro cujo trabalho estava vinculado às lutas pela libertação e pela dignidade humana. Ele constantemente fazia experimentações e refletia sobre como conectar a transformação social com o ensino e a aprendizagem entre os pobres e oprimidos. Para Freire, isso significava lutar por um mundo no qual todos são tratados de maneira igualitária e digna – um mundo no qual o poder econômico e o político estão radicalmente democratizados.\nEste dossiê, resultado de entrevistas com militantes de uma série de lutas na África do Sul, mostra que as ideias de Freire tiveram uma importante influência no Movimento da Consciência Negra [Black Consciousness Movement – BCM], no movimento sindical e em algumas organizações associadas à Frente Democrática Unida [United Democratic Front – UDF]. Suas ideias seguem influentes nos dias de hoje entre sindicalistas e movimentos de massas.\n- https://www.thetricontinental.org/pt-pt/dossie-34-paulo-freire-e-africa-do-sul/\n- https://ipfs.infura.io/ipfs/QmNrkaRGh5dNmScqv75A9srUE1rHija2ZepGe7aTYrwx1D",
				"added": 1607600792
			}
		],
		"4_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": [
			{
				"comment_id": 93,
				"body": "#As mensagens secretas da Lava Jato\nUma enorme coleção de materiais nunca revelados fornece um olhar sem precedentes sobre as operações da força-tarefa anticorrupção que transformou a política brasileira e conquistou a atenção do mundo.\n- https://theintercept.com/series/mensagens-lava-jato/\n- Internet Archive: https://web.archive.org/web/*/https://theintercept.com/series/mensagens-lava-jato/",
				"added": 1606697631
			}
		],
		"3_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": [
			{
				"comment_id": 112,
				"body": "#O Teorema da Incompletude REFUTA a onisciência?!\n\"O Teorema da Incompletude é um resultado muito importante para a lógica matemática, e frequentemente as pessoas acabam tentando aplicá-lo em áreas inadequadas. Mas, será que ele não pode realmente ser usado para raciocinarmos sobre Deus? Neste eu vídeo eu apresento um argumento análogo ao usado na prova do primeiro Teorema da Incompletude de Gödel que diz respeito a um aparente paradoxo na onisciência.\"\n- https://invidious.snopyta.org/watch?v=CMrIS5pq58A\n- https://siasky.net/AABMbQIVNVFbxQLm4-cx_ixYGu7c8hoV8tNNhlRblGGEVA\n\n#Sobre o problema de Gettier (a objeção à noção tripartite de conhecimento), veja:\n- https://invidious.snopyta.org/watch?v=yZxGbP_VvJE\n- https://siasky.net/AACLVEgI9DzkQ6mlc1I4ZrdA1t7ukKJtEkUJmzoAg_H_Kw",
				"added": 1607184542
			},
			{
				"comment_id": 114,
				"body": "#Lógica proposicional\n- https://invidious.snopyta.org/playlist?list=PLpGHF_AAwOMFV1abVZqLyuDUiZmwcg5eZ\n\n#Lógica de primeira ordem\n- https://invidious.snopyta.org/playlist?list=PLpGHF_AAwOMGi-ZGBsBGr_ikixc8xnBWU\n\n#Lógica clássica\n- https://invidious.snopyta.org/playlist?list=PLpGHF_AAwOMHeY-7p6knQy5zq0yafSYcP\n\n#Lógica modal\n- https://invidious.snopyta.org/playlist?list=PLpGHF_AAwOMG8HRYwNLIm50SjMoBd9xvI",
				"added": 1607190879
			},
			{
				"comment_id": 116,
				"body": "#Introdução à lógica - Cezar A. Mortari\n- https://ipfs.infura.io/ipfs/QmSV5Kb62xiTobwXFpjhyiTwX32jR1zomWzrRzrgxcmKEt\n\nPoucas ciências trabalham tanto com a mente quanto a Lógica. O autor não só explica em que ela consiste, como também percorre os seus meandros. Desvenda o que vem a ser inferência, dedução, indução e outras conceituações. Mostra, ainda, as diferenças entre a lógica clássica e a não-lógica, além de apresentar lógicas alternativas, como as polivalentes, a intuicionista e as relevantes.",
				"added": 1607193550
			},
			{
				"comment_id": 117,
				"body": "#O Logicismo ilógico de Gottlob Frege\n- https://invidious.snopyta.org/watch?v=N0ouC4xV7E4\n- https://siasky.net/AACC2vunfS43QzmbwmfLITWFOz7Wpboj_wVJMTX4q30ZJQ\n\n#Bertrand Russell e os Principia Mathematica\n- https://invidious.snopyta.org/watch?v=WvmXpss2QTQ\n- https://siasky.net/AADVL1iJLtLuXluYFB_gdy40_oXb8P7u3_V3gCy1ovnyCg\n\n#Os teoremas da incompletude de Gödel\n- https://invidious.snopyta.org/watch?v=gz5-GhNnkYk\n- https://siasky.net/AAAq4XwyNejFBvdCAUO9XqmYT_cy9lmH5LiJWWqxZ5is0A",
				"added": 1607193872
			},
			{
				"comment_id": 118,
				"body": "#As eleições americanas mostram uma FALHA na LÓGICA?\n- https://invidious.snopyta.org/watch?v=jMXuU0cbnvo\n- https://siasky.net/AAA0R9OuzHSz59B9Jfggmb-e-LRDsyBAZ_JgZNU6fdpnKg\n\nNas últimas semanas só se falam das eleições presidenciais dos EUA. Mas, em uma eleição passada, um evento curioso aconteceu. Será que uma análise lógica desse evento nos mostra que há uma falha na própria lógica?\nLink do artigo citado: https://web.archive.org/web/20160404/https://faculty.arts.ubc.ca/rjohns/vann_mcgee.pdf",
				"added": 1607195280
			},
			{
				"comment_id": 121,
				"body": "#Introdução à Lógica - Irving M. Copi\n- https://siasky.net/AAACIIjWETHIKSEK9wfHhT66l4pf65ZDEEq02EJOEm_-Eg\n\nTanto por sua importância filosófica como por suas aplicações técnicas, a lógica ocupa um lugar central no pensamento contemporâneo. Introdução à lógica constitui uma introdução amena e rigorosa a este tema. O livro compreende três partes intituladas, respectivamente, Linguagem, Dedução e Indução. Na primeira se encontra uma análise das diversas funções da linguagem, tema que possui um interesse filosófico intrínseco. Na segunda, o autor apresenta um enfoque atualizado da silogística tradicional e introduz um método gráfico - o dos [diagramas de Venn](https://en.wikipedia.org/wiki/Venn_diagram) - para decidir sobre a validade dos raciocínios silogísticos. Na terceira parte, o autor se refere à lógica da explicação científica com ilustrações cuidadosamente selecionadas.",
				"added": 1607203850
			},
			{
				"comment_id": 123,
				"body": "#Prova lógica do LIVRE ARBÍTRIO\n- https://invidious.snopyta.org/watch?v=qms09sm-rYc\n- https://siasky.net/AACy_leT0swEPX6UHWUxD0_HyoxiV6vJz9PJX4JP5RCEnw\n\n\"Parece muito que temos várias opções de ações e podemos escolher livremente quais delas tomaremos, em vez de simplesmente seguirmos algo já pré-determinado, né? Apesar de haver discussões milenares sobre isso, é este o sentimento que temos. Mas será que esse sentimento está correto? Neste vídeo, eu apresento um argumento que se propõe a demonstrar logicamente que a tese do livre arbítrio é verdadeira (e que, portanto, o determinismo é falso).\"\n- Artigo original do Huemer: https://web.archive.org/web/20201111205324/https://www.owl232.net/papers/fwill.htm\n- Tradução do artigo para português: https://web.archive.org/web/20200604143832/https://rotalibertaria.wordpress.com/2020/03/31/uma-prova-do-livre-arbitrio-de-michael-huemer/",
				"added": 1607208509
			},
			{
				"comment_id": 126,
				"body": "#Por que uma proposição falsa implica qualquer coisa?\n- https://invidious.snopyta.org/watch?v=KdfIRMrk4Ro\n- https://siasky.net/AAAVMEggQagPvVTI69kVKkXHs3uhzqG5HpBpogxES5yq9Q",
				"added": 1607222908
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 144,
				"body": "Ó Deus, tu és o meu Deus, eu te busco intensamente; a minha alma tem sede de ti! Todo o meu ser anseia por ti, numa terra seca, exausta e sem água.\nQuero contemplar-te no santuário e avistar o teu poder e a tua glória.\nO teu amor é melhor do que a vida! Por isso os meus lábios te exaltarão.\nEu te bendirei enquanto viver, e em teu nome levantarei as minhas mãos.\nA minha alma ficará satisfeita como de rico banquete; com lábios jubilosos a minha boca te louvará.\nQuando me deito lembro-me de ti; penso em ti durante as vigílias da noite.\nPorque és a minha ajuda, canto de alegria à sombra das tuas asas.\nA minha alma apega-se a ti; a tua mão direita me sustém.\nAqueles, porém, que querem matar-me serão destruídos; descerão às profundezas da terra.\nSerão entregues à espada e devorados por chacais.\nMas o rei se alegrará em Deus; todos os que juram pelo nome de Deus o louvarão, mas as bocas dos mentirosos serão tapadas.\n\n- Salmos 63:1-11",
				"added": 1607534861
			}
		],
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 149,
				"body": "#Como fazer um Supersoldado | Nerdologia\n- https://invidious.snopyta.org/watch?v=Qbx7mRUqgTU\n- https://siasky.net/AACMGb8IqAi5BbzaYMBcjorYmGT8RnMZP9eNefgJUFrIOQ\n\n#Habilidades de um supersoldado | Nerdologia\n- https://invidious.snopyta.org/watch?v=FI-_A8qhG54\n- https://siasky.net/AAAO2TvSgecc9wR0mRa8TC16ag9UZqOxxGM-z1DfnSrfEQ",
				"added": 1607546562
			},
			{
				"comment_id": 151,
				"body": "#Autor de High Hitler revela vícios do líder e influência das drogas na Alemanha nazista\nEm entrevista a Luiz Pimentel, o autor do livro [High Hitler](https://ipfs.infura.io/ipfs/QmUuMBPC2WsXt9MdXWXKShhqSV7c6ZNmdj22Lji134sTbh), Norman Ohler, fala sobre a influência das drogas em um dos períodos mais sangrentos da história. Em suas pesquisas, o jornalista encontrou provas de que [Hitler](https://en.wikipedia.org/wiki/Adolf_Hitler) fazia uso de drogas e que substâncias eram fornecidas, inclusive, para o exército alemão.\n- https://invidious.snopyta.org/watch?v=MFmIg7_w35I\n- https://siasky.net/AACPcXcEPDLcOdVb77P6wPKwP7J2aaN2rqEP-Kybz3TJFQ",
				"added": 1607549962
			},
			{
				"comment_id": 174,
				"body": "#Lista de drogas psicoativas usadas por militares\nMilitares em todo o mundo usaram ou estão usando várias [drogas psicoativas](https://en.wikipedia.org/wiki/Psychoactive_drug) para [melhorar o desempenho](https://en.wikipedia.org/wiki/Performance-enhancing_substance) dos soldados suprimindo a fome, aumentando a capacidade de sustentar o esforço sem comida, aumentando e prolongando a vigília e a concentração, suprimindo o medo, reduzindo a empatia e melhorando os reflexos e a memória, entre outras coisas.\n- https://en.wikipedia.org/wiki/List_of_psychoactive_drugs_used_by_militaries\n- Internet Archive: https://web.archive.org/web/*/https://en.wikipedia.org/wiki/List_of_psychoactive_drugs_used_by_militaries",
				"added": 1607771742
			}
		]
	},
	"comment_vote": {
		"27_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": 1,
		"141_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": 1,
		"148_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": 1,
		"174_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": 1,
		"188_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": 1
	}
}