{
	"title": "Записки одного идиота",
	"description": "",
	"links": "",
	"next_post_id": 7,
	"demo": false,
	"modified": 1529769325,
	"post": [
		{
			"post_id": 5,
			"title": "О NetXMS",
			"date_published": 1522699217.98,
			"body": "Это какой-то тихий пиздец. Оно постоянно проебывает метрики в графиках! Нахера такое делать, разработчики???"
		},
		{
			"post_id": 4,
			"title": "Когда remote job не совсем remote",
			"date_published": 1521790206.634,
			"body": "Вот есть у меня работа. По идее она - по удаленке, хоть практически весь состав из одного города. Пилим-пилим, пилим-пилим, все хорошо. Правда, за весь \"срок\" попилинга у нас уже несколько раз менялся вектор развития, но это фигня.\n\nСуть в том, что теперь мы заседаем в офисе за ту же зряплату, а это уже -2к к ней и никто, естественно, компенсировать не желает, несмотря на \"График работы - гибкий, режим работы - удаленный\" в договоре. Тьфу."
		},
		{
			"post_id": 3,
			"title": "Про храпунов",
			"date_published": 1521746497.694,
			"body": "Бесят. Иногда просто дико и неимоверно. Почему? Все просто - вот ты после трудового дня хочешь пойти спать, уже даже утомил себя чтением зеросайтсов с порнухой или каким-нибудь говном с клирнетов, а тут брат жены, который приехал с области, где обитает, на медобследование, и оставшийся с ночевкой, ибо ему на сутки повесили измерительную хуйню, как начнет храпеть!\n\nТрель непередаваемая! А как бесит! Прям так и хочется взять носок и засунуть его в храпунцель!\n\nНо нет, мы же культурные все IRL, не правда ли? Вот и мне приходится терпеть :("
		},
		{
			"post_id": 2,
			"title": "Про СУПы и прочие штучки для разработчиков",
			"date_published": 1521659115.853,
			"body": "Довелось мне попользовать несколько разных СУПов, то бишь систем управления проектами, как ориентированными на разработчиков, так и на менеджеров. Что я могу сказать... **Все говно!** Кроме, пожалуй, одной - phabricator. Хотя и она тоже недопиленная, но хоть не жрет дохулион гигабайт и не просит примерно столько же баксов за лицензию. А функционал там очень даже годный - и тебе хостинг репозиториев, и вики, и документация, и даже для админов есть свои штучки, и CI/CD, и т.д. и т.п.\n\nЕсли у вас нет ненависти к пыху, как у меня - крайне рекомендую попробовать. А я пошел искать что-то дальше."
		},
		{
			"post_id": 1,
			"title": "Здрасьте!",
			"date_published": 1521658800,
			"body": "Добро пожаловать! Не знаю, правда, зачем вы зашли, однако позвольте вас горячо попривествовать на таком странном зайте.\n\nСуть этого блога очень проста - тут будут записки одного идиота. Идиота, который что-то делает не так, или который нашел, увидел и выложил как кто-то делает что-то не так.\n\nТакже возможно будет танцпол. А может не будет. Что точно будет - нецензурная лексика. Я вас предупредил.\n\nВ общем, подписывайтесь, будем развлекаться! :)"
		}
	]
}