{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Desarrollo web",
			"body": "Hola buenas noches, soy programador web, me gusto muchísimo la idea de este sistema inclusive estuve pensando en crear algo basado en la misma forma de trabajo del zero. esto debido a los problemas que sucitan en donde vivo. la cosa esta en que me he topado por error con esta idea y me parecio genial. ahora bien quisiera saber si es posible el manejo de bases de datos o como se puede manejar en el desarrollo web de esta herramienta los usuarios que acceden a un sitio, me refiero existe forma de controlar los usuarios? como decir los sistema de login en un sitio web normal. cosa de que si alguna persona ve un comportamiento no legitimo de un usuario pueda registringirlo. aparte de esto es posible el uso de tecnologías Ajax y compartir contenido en imágenes y alguien puede suministrarme algún ejemplo ? o donde puedo ubicar un tutorial del manejo de la programación basada en zero? gracias de antemano.!",
			"added": 1502332738
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_1KjKGbXe5KwQkmHdtsyhp1TzRieGu3wPBw": [
			{
				"comment_id": 1,
				"body": "La situación mal, muy mal, todo patas arriba",
				"added": 1502320707
			},
			{
				"comment_id": 2,
				"body": "Te hago un resumen general, Venezuela vive una de las crisis sociales y económicas mas graves de la historia actualmente la inflación aumenta cada dia mas al punto de que se ha visto que productos alimenticios aumentan hasta un 100% en cosa de 1 semana. no obstante en el área política el gobierno corrupto coloco la ANC (asamblea nacional constituyente) totalmente de forma fraudulenta diciendoq ue se aprobó por una cantidad irracional de votos, aun asi la oposición termino rechazando los resultados de dicha institución, pero aun asi la oposición acepto participar en las elecciones regionales y presidenciales diciendo que no sederian ningún espacio. el problema de todo esto erradica en que las personas se molestaron por el motivo de que es ilógico aceptar participar en algo tan absurdo sabiendo cual es el resultado de antemano. Capriles indico el dia de hoy en que la sociedad civil debe votar y se debe participar en las elecciones ya que el gobierno solo utilizo la faceta de la asamblea nacional para que las personas tuvieran miedo y se dieran cuenta los fácil que les era mentir y de este modo meterse en la cabeza de los venezolanos que creemos en el voto para asi manipular mentes y obligar a que las personas no voten. no  obstante todos aquellos chamos de la resistencia que fueron tomados presos están siendo sembrados con droga para justificar su detención caso que esta sucediendo en merida y tachira aparte de los 101 muertos que hubieron Venezuela esta en un caos absoluto, donde temes a morir todos los días, pero no sabes de que moriras, se creo la incertidumbre de pensar \"Morire de hambre\" \"Morire asesinado\" \"Me matara un organismo del gobierno\" \"Me asesinaran por opinar diferente\" \"Me dara un derrame cerebral\" \"Me morire de un ataque al corazón\"  y sobran las palabras amigo. solo sabemos que no tenemos dinero para comprar medicinas o comida, nuestros familiares mueren por culpa de la situación. una inyección para el corazón vale 90 millones de bolívares si te da un ataque al corazón requieres de 3 y esa cantidad de dinero pocas personas lo tienen. nuestra juventud se va del país con grandes talentos que pudiesen ser provechosos, y todos nuestros sueños y esperanzas de vida no hacen mas que morir. Un Saludo.",
				"added": 1502321566
			}
		]
	},
	"comment_vote": {
		"2_1EJ2NwsYY3dEVgB7XM1HXdBNgEHP1zy9Ek": 1
	}
}