{
	"title": "free job posting sites",
	"description": "My Blog.",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1514119680,
	"post": [
		{
			"post_id": 8,
			"title": "this is an interesting site",
			"date_published": 1514119637.848,
			"body": "https://www.smartrecruiters.com/"
		},
		{
			"post_id": 7,
			"title": "YOU ARE WHO YOU HIRE!!",
			"date_published": 1514119519.681,
			"body": "Blog post body"
		},
		{
			"post_id": 6,
			"title": "this is a smart site, there is probably no better way than this site in terms of finding the companies to post on it.",
			"date_published": 1514119081.405,
			"body": "https://www.postjobfree.com/"
		},
		{
			"post_id": 5,
			"title": "if you know any credible free recruiting job posting site, please let me know. ",
			"date_published": 1514118988.487,
			"body": "either directly post it here by replying to any message, or send me an email:\n\ntianfuedu@163.com\n\nthank you."
		},
		{
			"post_id": 4,
			"title": "this is a real free job posting site",
			"date_published": 1514118757.152,
			"body": "Jobvertise.com\n\nThis website currently has almost one million resumes within its database and a quarter of a million jobs posted.  This site also offers job alerts and lets you create an account for free!  Upload your resume and get started, your dream job awaits!"
		},
		{
			"post_id": 3,
			"title": "New blog post",
			"date_published": 1514117808.948,
			"body": "JobSpider.com\n\nThe website offers great resources to employers and job seekers who are looking for the perfect fit. You can sign up and look around, post your resume and apply for jobs, completely free. Best of all, this website offers job alerts and an employment directory;  not only will you be notified of interesting jobs, but you can also take a look through the directory to see if companies like Google or Microsoft are looking for someone just like you."
		},
		{
			"post_id": 2,
			"title": "this is not really free, a cheating site ",
			"date_published": 1514117785.605,
			"body": "Indeed.com\n\nIndeed lets job seekers search through millions of jobs from direct employers, without any charge. It acts like a search engine for jobs, very much like Google. You have to click into most jobs to go to each employer’s career website, but it offers very comprehensive job search results – especially among top employers."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}