{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1586949592,
			"title": "Do you know this mothefucker?",
			"body": "PIANKA, ERIC R, \n\n… I watched in amazement as a few hundred members of the Texas Academy of Science rose to their feet and gave a standing ovation to a speech that enthusiastically advocated the elimination of 90 percent of Earth’s population by airborne Ebola. The speech was given by Dr. Eric R. Pianka , the University of Texas evolutionary ecologist and lizard expert who the Academy named the 2006 Distinguished Texas Scientist.\n    Something curious occurred a minute before Pianka began speaking. An official of the Academy approached a video camera operator at the front of the auditorium and engaged him in animated conversation. The camera operator did not look pleased as he pointed the lens of the big camera to the ceiling and slowly walked away.\n    This curious incident came to mind a few minutes later when Professor Pianka began his speech by explaining that the general public is not yet ready to hear what he was about to tell us. \n\nBecause of many years of experience as a writer and editor, Pianka’s strange introduction and the TV camera incident raised a red flag in my mind. Suddenly I forgot that I was a member of the Texas Academy of Science and chairman of its Environmental Science Section. Instead, I grabbed a notepad so I could take on the role of science reporter.\n\nOne of Pianka’s earliest points was a condemnation of anthropocentrism, or the idea that humankind occupies a privileged position in the Universe. He told a story about how a neighbor asked him what good the lizards are that he studies. He answered, “What good are you?”\n\nPianka hammered his point home by exclaiming, “We’re no better than bacteria!”\n\nPianka then began laying out his concerns about how human overpopulation is ruining the Earth. He presented a doomsday scenario in which he claimed that the sharp increase in human population since the beginning of the industrial age is devastating the planet. He warned that quick steps must be taken to restore the planet before it’s too late.\n    Saving the Earth with Ebola\n    Professor Pianka said the Earth as we know it will not survive without drastic measures. Then, and without presenting any data to justify this number, he asserted that the only feasible solution to saving the Earth is to reduce the population to 10 percent of the present number.\n    He then showed solutions for reducing the world’s population in the form of a slide depicting the Four Horsemen of the Apocalypse. War and famine would not do, he explained. Instead, disease offered the most efficient and fastest way to kill the billions that must soon die if the population crisis is to be solved.\n    Pianka then displayed a slide showing rows of human skulls, one of which had red lights flashing from its eye sockets.\n    AIDS is not an efficient killer, he explained, because it is too slow. His favorite candidate for eliminating 90 percent of the world’s population is airborne Ebola ( Ebola Reston ), because it is both highly lethal and it kills in days, instead of years. However, Professor Pianka did not mention that Ebola victims die a slow and torturous death as the virus initiates a cascade of biological calamities inside the victim that eventually liquefy the internal organs.\n    After praising the Ebola virus for its efficiency at killing, Pianka paused, leaned over the lectern, looked at us and carefully said, “We’ve got airborne 90 percent mortality in humans. Killing humans. Think about that.”\n    With his slide of human skulls towering on the screen behind him, Professor Pianka was deadly serious. The audience that had been applauding some of his statements now sat silent.\n    After a dramatic pause, Pianka returned to politics and environmentalism. But he revisited his call for mass death when he reflected on the oil situation.\n    “And the fossil fuels are running out,” he said, “so I think we may have to cut back to two billion, which would be about one-third as many people.” So the oil crisis alone may require eliminating two-third’s of the world’s population.\n    How soon must the mass dying begin if Earth is to be saved? Apparently fairly soon, for Pianka suggested he might be around when the killer disease goes to work. He was born in 1939, and his lengthy obituary appears on his web site.\n    When Pianka finished his remarks, the audience applauded. It wasn’t merely a smattering of polite clapping that audiences diplomatically reserve for poor or boring speakers. It was a loud, vigorous and enthusiastic applause.\n    Questions for Dr. Doom\n    Then came the question and answer session, in which Professor Pianka stated that other diseases are also efficient killers.\n    The audience laughed when he said, “You know, the bird flu’s good, too.” They laughed again when he proposed, with a discernable note of glee in his voice that, “We need to sterilize everybody on the Earth.”\n    After noting that the audience did not represent the general population, a questioner asked, “What kind of reception have you received as you have presented these ideas to other audiences that are not representative of us?”\n    Pianka replied, “I speak to the converted!”\n    Pianka responded to more questions by condemning politicians in general and Al Gore by name, because they do not address the population problem and “…because they deceive the public in every way they can to stay in power.”\n    He spoke glowingly of the police state in China that enforces their one-child policy. He said, “Smarter people have fewer kids.” …\n    With this, the questioning was over. Immediately almost every scientist, professor and college student present stood to their feet and vigorously applauded the man who had enthusiastically endorsed the elimination of 90 percent of the human population. Some even cheered. Dozens then mobbed the professor at the lectern to extend greetings and ask questions. It was necessary to wait a while before I could get close enough to take some photographs.\n    I was assigned to judge a paper in a grad student competition after the speech. On the way, three professors dismissed Pianka as a crank. While waiting to enter the competition room, a group of a dozen Lamar University students expressed outrage over the Pianka speech.\n    Yet five hours later, the distinguished leaders of the Texas Academy of Science presented Pianka with a plaque in recognition of his being named 2006 Distinguished Texas Scientist. When the banquet hall filled with more than 400 people responded with enthusiastic applause, I walked out in protest.\n    Corresponding with Dr. Doom\n    Recently I exchanged a number of e-mails with Pianka. I pointed out to him that one might infer his death wish was really aimed at Africans, for Ebola is found only in Central Africa. He replied that Ebola does not discriminate, kills everyone and could spread to Europe and the the Americas by a single infected airplane passenger.\n    In his last e-mail, Pianka wrote that I completely fail to understand his arguments. So I did a check and found verification of my interpretation of his remarks on his own web site. In a student evaluation of a 2004 course he taught, one of Professor Pianka’s students wrote, “Though I agree that convervation biology is of utmost importance to the world, I do not think that preaching that 90% of the human population should die of ebola is the most effective means of encouraging conservation awareness.”\n    Yet the majority of his student reviews were favorable, with one even saying, ” I worship Dr. Pianka.”\n    The 45-minute lecture before the Texas Academy of Science converted a university biology senior into a Pianka disciple, who then published a blog that seriously supports Pianka’s mass death wish.\n    Dangerous Times\n    Let me now remove my reporter’s hat for a moment and tell you what I think. We live in dangerous times. The national security of many countries is at risk. Science has become tainted by highly publicized cases of misconduct and fraud.\n    Must now we worry that a Pianka-worshipping former student might someday become a professional biologist or physician with access to the most deadly strains of viruses and bacteria? I believe that airborne Ebola is unlikely to threaten the world outside of Central Africa. But scientists have regenerated the 1918 Spanish flu virus that killed 50 million people. There is concern that small pox might someday return. And what other terrible plagues are waiting out there in the natural world to cross the species barrier and to which scientists will one day have access?\n    Meanwhile, I still can’t get out of my mind the pleasant spring day in Texas when a few hundred scientists of the Texas Academy of Science gave a standing ovation for a speaker who they heard advocate for the slow and torturous death of over five billion human beings. … \n\n_____________________________________________________________________________________________________________\nPianka is JEW. \n\nremdesivir - treatment for COVID-19 - was developed by Gilead Sciences as a treatment for Ebola virus disease\n\nfavipiravir - japan drug for COVID-19\n\nHigh doses of favipiravir extended survival in non-human primates infected with Ebola virus, according to a new study….\n\nDespite repeated outbreaks in recent years, there is no effective treatment validated for patients with Ebola virus disease, which can kill about half of those infected.\n\nThese results, together with previous data collected on tolerance and pharmacokinetics in both non-human primates and humans support the evaluation of high doses of favipiravir\n\nThe antiviral drug favipiravir has been previously tested at lower doses in humans and was well-tolerated but did not show strong antiviral activity. In the current study, researchers infected 26 non-human primates with the 2001 Gabon strain of Ebola virus and followed them for 21 days. Thirteen animals were untreated and 13 were treated, beginning two days before infection, with twice-daily doses of favipiravir at 100, 150, or 180 mg/kg.\n\nAll animals that were untreated or treated with 100 mg/kg of favipiravir died within 10 days of infection. Two out of 5 (40%) animals treated with 150 mg/kg were still alive at day 21 of the study, and 3 out of 5 animals (60%) treated with 180 mg/kg favipiravir survived to day 21. Moreover, the study showed that the drug inhibited viral replication in a drug concentration-dependent manner. However, applicability to humans is limited by the fact that this model is fully lethal and that treatment initiation in patients is most often initiated several days after infection, when symptoms and high levels of viral replication are already present, rather than before infection.\n\n“These results, together with previous data collected on tolerance and pharmacokinetics in both non-human primates and humans support the evaluation of high doses of favipiravir for future human intervention in particular for contact cases,” said Jeremie Guedj of INSERM, France, and colleagues.",
			"added": 1586949591
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1586949592_1GGSNB12PSSTBU2AoYyQaEU4jXqjXctVxZ": [
			{
				"comment_id": 1,
				"body": "FBI Interested in Texas “Doomsday” Ecologist who said Ebola the Solution to Human Overpopulation\nStudents being influenced and agree with him and some might eventually act on his suggestions.\n\nAUSTIN, April 6, 2006 (LifeSiteNews.com) – Ebola, a form of hemorrhagic fever in which the internal organs of the victim liquefy, has one of the highest rates of fatality of any known contagious disease at approximately 80-90% and is one of the most contagious diseases known to medical science. It is also high on the list of possible bio-terror weapons of concern to international law enforcement and military security agencies. Tom Clancy’s thriller novel, Rainbow Six describes a group of radical environmentalists that wants to rid the world of people using a modified version of Ebola.\n\nAll of which is why the FBI is interested in talking to Texas ecologist and herpetologist, Dr. Eric R. Pianka, who suggested at a meeting of the Texas Academy of Sciences that an airborne version of Ebola that would wipe out 90% of the human population was the solution to the human “overpopulation problem.”\n\nThis week, Pianka has been in the Texas media saying that he was not advocating bio-terrorism, but also told the Austin Statesman that he is meeting with local FBI officials in response to complaints that he is advocating biological terrorism.\n\n“Someone has reported me as a terrorist,” he said. “They think I’m forming a cadre of people to release the airborne Ebola virus into the air. That I’m the leader and my students are the followers.”\n\nOn the day he was named by the Academy as 2006 Distinguished Texas Scientist, Pianka declared that AIDS was not killing off the surplus human population fast enough. What is needed, he said, is Ebola to kill 5.8 billion of the world’s 6 billion plus humans. The speech received a prolonged standing ovation at the Academy’s annual meeting at Lamar University in Beaumont.\n\nThe Seguin Gazette quotes Pianka saying, “Every one of you who gets to survive has to bury nine.”\n\n”[Disease] will control the scourge of humanity,” Pianka said in his March 3 speech. “We’re looking forward to a huge collapse.” He said, “We’ve grown fat, apathetic and miserable,” and described the world as a “fat, human biomass.”\n\nThe syllabus for one of Pianka’s courses reads, “Although [Ebola Zaire] Kills 9 out of 10 people, outbreaks have so far been unable to become epidemics because they are currently spread only by direct physical contact with infected blood…Ebola Reston, is airborne, and it is only a matter of time until Ebola Zaire evolves the capacity to be airborne.”\n\nThe speech was first reported by popular science and computer writer, Forrest Mims III on the website of the Citizen Scientist. Mims said he was concerned that in this age of international security tensions, “fertile young minds,” might take Pianka’s assertions as suggestions.\n\nOne class evaluation for one of Pianka’s courses shows the enthusiasm with which his ideas are received by ‘fertile young minds. Two quoted by the Seguin Gazette read, “the most incredible class I ever had” and “Pianka is a GOD!”\n\nAfter the talk, student blogger, Brenna McConnell, who attended the Academy talk wrote, “He’s basically advocating for the death for all but 10 percent of the current population. And at the risk of sounding just as radical, I think he’s right.”\n\nTo the possibility that someone would actually go with the idea, Pianka said, “Good terrorists would be taking [Ebola Reston and Ebola Zaire] so that they had microbes they could let loose on the Earth that would kill 90 percent of people.”\n\nRead previous LifeSiteNews.com coverage:\n  Texas “Doomsday Ecologist” Calls for 90% of Humans to be Wiped out with Ebola Virus\nhttps://www.lifesitenews.com/ldn/2006/apr/06040306.html\n\nRead a transcript of Pianka’s March 3 talk:\nhttp://www.pearceyreport.com/archives/2006/04/transcript_dr_d.php/",
				"added": 1586950531
			},
			{
				"comment_id": 2,
				"body": "Tucker with pianka,  kopykate:\nhttp://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/?Video=1586953242_1GGSNB12PSSTBU2AoYyQaEU4jXqjXctVxZ",
				"added": 1586953606
			},
			{
				"comment_id": 5,
				"body": "I cant find any peers to share kopykate video, someone upload it from clearnet link https://www.youtube.com/watch?v=urxN6VHiUeY please",
				"added": 1586958325
			}
		],
		"1586928602_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 3,
				"body": "> [gitcenter](#comment_1362_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): By the way, PeerMessage plugin now has a separate site which I recommend: http://127.0.0.1:43110/1CeEXxqemr5CcVQAAmrW13QYwZV4kAkQz6/.\n\nNever let a crisis go to waste, right git? Where is jew and tranny haters blocklists, cant find them :) \nStill waiting for implementation? :)\n\nReading for newcomers:\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1568735040_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1568749254_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J",
				"added": 1586956907
			}
		],
		"1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL": [
			{
				"comment_id": 4,
				"body": "everyone who dislike it here should fuck off",
				"added": 1586957040
			},
			{
				"comment_id": 6,
				"body": "> [blurhy](#comment_421_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): what ? do you mean me ?\n\nDo you like it here or not ?",
				"added": 1586958768
			},
			{
				"comment_id": 7,
				"body": ":)",
				"added": 1586958827
			},
			{
				"comment_id": 9,
				"body": "> [blurhy](#comment_423_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): i see, you want to fuck off\n\nWhy you use something you dont like?",
				"added": 1586959525
			},
			{
				"comment_id": 10,
				"body": "> [blurhy](#comment_424_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Do you like microsoft ? Why can't you live without it ?\n\nNo. \nI can.",
				"added": 1586959821
			}
		],
		"1584402406_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 8,
				"body": "I seriously worried about h3bhkj5gqz4n3pjm. He was (hope he still is) tough motherfucker but he has strong and interesting opinions on various topics. And from his telling he is European.",
				"added": 1586959468
			}
		],
		"1587107506_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 11,
				"body": "> [freemankind](#comment_6_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): share positivityteach respectgive knowledge\n\nYou should fuck off to reddit with this fagshit. Seriously.",
				"added": 1587222360
			},
			{
				"comment_id": 12,
				"body": "> [illuminatus](#comment_9_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3): One of the good things about reddit is that you can see peoples posting history, at least 3 times I've become angry about some post someone did, I then put him/he in a box, thinking the person must be this type, but then it turns out that we have a lot of things in common, and we are not really a box, but more like intersecting mesh, with snap to grid enabled. (I've just smoked cannabis after a two week without. Ding dong :--)\n\nYou are new here. If you put the user name on ZeroHello in search box you can see whole posting history under that account. \n\nStop smoking or your brain will turn in to garbage place unconnected to reality with fake artificial feelings.",
				"added": 1587231094
			}
		]
	},
	"comment_vote": {}
}