{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1527011238,
			"title": "GIF Time",
			"body": "How and who selects the images/videos for the GIF-Time page? Can the person be supported? Can you upload your own pictures there?",
			"added": 1527011237
		},
		{
			"topic_id": 1547928896,
			"title": "The disappearance of Christian Morgenstern",
			"body": "The parents of the missing Christian Morgenstern do not believe that their son disappeared from the Fischendorf bridge. A video from the outdoor camera of a building now points to a completely different last Whereabout. The family's lawyer pointed out a violent crime \non the man. When does the prosecution start investigating?\n\nMore and more details come to light, which are evident in the versions of the Disappear at the Fischendorfer pedestrian bridge. in the morning of the New Year's Day personal belongings of the 20-year-old man have been found. There is now a written insurance of a woman: Around 10 o'clock, when she crossed the bridge, Christian's things were not there. At the Fischendorfer Bridge, where the clothes were lying there was neither blood nor traces of a fight or any other evidence of a criminal offence. \n\nDespite the rain, the jacket found was barely wet. This reinforces the father's suspicion that the things there were long after Christian disappeared on New Year's morning. \nOne thing is certain: his cell phone was switched off several hours before. \n\nOne more clue for the father, that Christian's disappearance could be related to a Felony. Someone could have deliberately put it there. It is not the only clue. Meanwhile, a lawyer on behalf of the family has filed a lawsuit for violent crime. Section 160 of the Code of Criminal Procedure stipulates that the public prosecutor's office must investigate the facts as soon as it becomes aware of suspicion of a criminal offence.\n\nMysterious: Wallet, cash, money card and mobile phone missing. The clothes were scattered all over the bridge. individual chip cards and the student identity card. Wallet, money card, However, cash and mobile phone are missing.\nThe police cannot identify a criminal offence by locating clothing and other personal belongings. \n\nSince the beginning of the year, the river has been meticulously and unsuccessfully searched in multiple operations.\n\nPlease help us find the young man.",
			"added": 1547928894
		},
		{
			"topic_id": 1554110095,
			"title": "European upload filter",
			"body": "Hello ZeroNet,\nhow do we actually implement the EU upload filter on this platform?\nIdeas?",
			"added": 1554110092
		},
		{
			"topic_id": 1558277346,
			"title": "Unencrypted payment transactions on German trains",
			"body": "I am currently travelling by train in Germany. I noticed an open W-Lan during the card payment in the train. Is the railway company really that bad? Transferring bank data via an insecure connection is creepy, isn't it? the network was active during all card payments on the train until the train attendant paused. I didn't record anything because I didn't have a notebook with me. But my Android phone received this network well while riding. Also, the signal strength changed with the distance between me and the train attendant. \n\nThe name of the WLAN was: PP$x7Q#123",
			"added": 1558277342
		}
	],
	"topic_vote": {
		"1527011238_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1547928896_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1558277346_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1525943428_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 1,
				"body": "could we use yacy?",
				"added": 1526235189
			}
		],
		"1547928896_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 2,
				"body": "There is a possible video from a surveillance camera, but this has not yet been published according to my status.\nThis video is supposed to show a man with a mobile phone in front of the supermarket near the home of the elderly.\nThe parking lot is always a meeting place for young people, which is why it could well be the young man. Unfortunately the video is said to be too dark.\nThere is a Video from german TV: https://www.youtube.com/watch?v=o8jwTKjYykI",
				"added": 1547983445
			}
		],
		"1547971447_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 3,
				"body": "i get the same error",
				"added": 1547987679
			}
		],
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 4,
				"body": "In germany there is now a kind of darknet ban and a ban on technologies for anonymizing on the internet.",
				"added": 1554495171
			},
			{
				"comment_id": 5,
				"body": "Now European mass censorship has been confirmed. What will we be able to create in two years time to escape this filth? What's the next step?",
				"added": 1555321667
			},
			{
				"comment_id": 6,
				"body": "The implementation of the DSGVO also took a very long time.",
				"added": 1555357919
			},
			{
				"comment_id": 7,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_19_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You're talking about you, and yes you're useless but you're already know that.\n\n\nwatch your language",
				"added": 1557058336
			},
			{
				"comment_id": 8,
				"body": "best uploadfilter\nhttp://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/?RedditGifs&Post:14197:This+hotel+actually+censors+part+of+the+view.",
				"added": 1557058416
			},
			{
				"comment_id": 9,
				"body": "https://translate.google.com/translate?hl=en&sl=de&tl=en&u=https%3A%2F%2Fwww.heise.de%2Fnewsticker%2Fmeldung%2FDeepdotweb-Darknet-Verzeichnis-down-Betreiber-festgenommen-4417158.html",
				"added": 1557323570
			}
		],
		"1558277346_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 10,
				"body": "It was an ad hoc network. I think between ticket handheld and EC terminal.",
				"added": 1558299018
			},
			{
				"comment_id": 11,
				"body": "some new things?",
				"added": 1564035630
			}
		]
	},
	"comment_vote": {
		"134_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"1_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": 1,
		"4_1JELMpwdE941yFgHCCnTXfchb1Wxsiuuy4": 1,
		"5_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1_1P7EzRpBkZmopxsxukTKQRrQkRwB2GxJaP": 1,
		"2_13qtuJDbMg2qcQxczwAHf2H8Wc5n762J41": 1,
		"1_114QMqF2DuSQDKc46cTS8iccz3k4onvKRy": 1,
		"94_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1
	}
}