{
	"title": "土木坛子",
	"description": "https://tumutanzi.com",
	"links": "Freedom?",
	"next_post_id": 18,
	"demo": false,
	"modified": 1494246746,
	"post": [
		{
			"post_id": 17,
			"title": "剑桥一瞥",
			"date_published": 1494246720.76,
			"body": "因某事情，最近去了一趟剑桥（[赖博主的地盘](https://justyy.com)），住了两天两夜，见识了这个美丽又著名的英国小城市，以及世界闻名的剑桥大学。\n\n剑桥大学古老的[学院联邦制](https://zh.wikipedia.org/wiki/%E6%9B%B8%E9%99%A2%E8%81%AF%E9%82%A6%E5%88%B6)和它古老的大学建筑一样古老。宽敞干净的街道，历史悠久的教堂，让这个城市彻底变成了一个旅游城市。剑桥大学让剑桥出名，剑桥市没有辜负游客们的期望。徐志摩的那段《再别康桥》的诗作，让康桥和康河至少在华人世界里格外出名。\n\n坐在康河上的木船里，看着两岸悠闲的人们，估计水上威尼斯的感觉也是如此。抚摸着刻着徐志摩诗词的石碑，坐在他当年求学时也曾留下不少时光的康桥上，感叹时光的不紧不慢。\n\n此次在剑桥结识了好多优秀的博士同行，多年以后，我相信这些伙伴们都会出人头地。当我们再回顾这次的时光，也一定是满满的回忆。\n\n一切美景的前提还需英国难得的好天气，有图为证。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6234.jpg)  \n背后的那座木桥就是有名的[数学桥](https://zh.wikipedia.org/wiki/%E6%95%B8%E5%AD%B8%E6%A9%8B)，传闻是牛顿建的，但这是假的传闻。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6273.jpg)  \n水乡”威尼斯“？\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6283.jpg)  \n康河两岸休闲的人们\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6290.jpg)  \n墙壁爬满植物的建筑\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6302.jpg)  \n康河沿岸的参天大树\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6308.jpg)  \n游船上的游客们\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6312.jpg)  \n康河上有很多桥，这座桥很别致。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6316.jpg)  \n康河上的鸭子算是见识了世界\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6317.jpg)  \n中年大叔的趣味，请允许我拍个对面船上的美女\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6330.jpg)  \n中年大叔的恶趣味，看懂的别作声……\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6337.jpg)  \n从康河的游船上看剑桥大学的国王学院背面——还有明月当空。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6351.jpg)  \n缘分真神奇。这位大叔来自巴西，我头天在剑桥和他坐一条船，第二天在市区第三次碰到他，两男人紧紧握着手聊了几句！一离开我立马心想，我应该和他拍个照片留念！正想着，他倒回来，拿着手机跟我说：来，老弟，合个影！他会读心术啊。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6356.jpg)  \n在剑桥认识的博士生们一起吃晚饭，该中餐馆因霍金在此吃了一顿饭而出名，据说霍金吃的是土豆片。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6370.jpg)  \n剑桥的教堂，其实有很多教堂。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6371.jpg)  \n剑桥的街道\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6373.jpg)  \n他也是一景，白天待在这个垃圾桶里弹吉它，接受捐赠，晚上用胶带把垃圾桶封上（图中右下角）。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6381.jpg)  \n剑桥大学国王学院入口\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6386.jpg)  \n国王学院里面\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6387.jpg)  \n国王学院里的教堂\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6391.jpg)  \n国王学院院子内\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6400.jpg)  \n到此一游，剑桥大学国王学院。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6402.jpg)  \n剑桥大学国王学院\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6411.jpg)  \n剑桥大学国王学院里面的徐志摩诗词石碑\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6420.jpg)  \n徐志摩的康桥。剑桥的确不错，但是康桥，显然是文案做的比产品好。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6421.jpg)  \n我想带走一片云彩，可是天上没有一片云。当年徐志摩也没有这样骚情过吧？\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6429.jpg)  \n国王学院里的长椅，有人在那里安静地看书。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6435.jpg)  \n剑桥大学里的那些花儿\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6436.jpg)  \n剑桥大学里的那些花儿\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6446.jpg)  \n剑桥大学国王学院里的教堂外墙立面\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6458.jpg)  \n剑桥大学国王学院里的教堂内部\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6461.jpg)  \n剑桥大学国王学院里的教堂内部\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6463.jpg)  \n剑桥大学国王学院里入口\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6466.jpg)  \n剑桥大学国王学院入口外面的游人\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6472.jpg)  \n剑桥街道\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6475.jpg)  \n剑桥大学某学院住宿区\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6479.jpg)  \n剑桥大学某学院住宿区里的图书馆入口\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6484.jpg)  \n剑桥大学某学院住宿区，看看人家这大学住宿，感觉我上过所有的国内国外大学都是假的。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6485.jpg)  \n上图的真实拍照画面，摄影师很卖力。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6492.jpg)  \n感觉有点像领导视察剑桥大学？\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6496.jpg)  \n校园里的松鼠\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6498.jpg)  \n春天里的花开得真艳\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6501.jpg)  \n公园草地上在晴天就会”长“出很多人\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6512.jpg)  \n康河两岸的人们，脱掉衣服晒太阳。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6581.jpg)  \n撑船的小哥穿过垂柳，姿势好优雅。\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6582.jpg)  \n为我们撑船的小哥\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6632.jpg)  \n我也来撑船\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6653.jpg)  \n美女博士为我撑船\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6654.jpg)  \n给一个美女博士的背影特写吧\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6666.jpg)  \n原谅大叔就是这么浪\n\n![剑桥游记](https://tumutanzi.com/wp-content/uploads/2017/04/IMG_6667.jpg)  \n真的是带着任务来的，结识的优秀伙伴们！背景是剑桥大学的三一学院（也就是霍金目前工作的学院）。\n\n感谢著名的[碧桂园](https://tumutanzi.com/archives/15618)地产公司赞助本次行程的住宿和交通费用！"
		},
		{
			"post_id": 16,
			"title": "如何看待碧桂园“未来领袖”大规模招收博士现象？",
			"date_published": 1494241848.366,
			"body": "如果你拥有博士学位，告诉你一个好消息：深圳的“孔雀计划”对引进人才最低补贴160万元。要求条件不高，比如：只需要全球排名200名的大学毕业的博士，并签约在深圳工作三年即可。160万相对深圳的高房价不算什么，但这估计是目前国内地方政府层面对人才补贴最高的计划。每年共投入10亿人民币人才资金的“孔雀计划”无疑显示出深圳政府的魄力和对人才重视力度之大。\n\n其实，除了大力度引进人才的深圳政府之外，其它财力雄厚的地方政府都有不同形式的人才引进计划（需要你时各种计划文件、绿色通道，不需要你时摆出各种规章制度），体现在待遇上就是年薪和补贴比过去要有诚意得多。在国家有足够资金的同时，这也反映了宏观经济向着研发和创新的方向发展，那么对高端人才的需求自然水涨船高，而最快的办法就是用钱买人，用金钱将那些发达国家的人才（目前主要是华人）迅速收割。重赏之下，必有勇夫。\n\n不只是政府政策。这几年有一个企业也引起了众多博士们的关注，碧桂园。一家广东的房地产企业。从2013年开始通过一个叫[“未来领袖”的人才计划](https://tumutanzi.com/archives/12886)大规模招收海内外博士毕业生到该公司工作，坊间传闻，每一位“未来领袖”博士目标培养成房地产项目经理，年薪在40-60万之间。据该公司2016年中期财报透露：\n\n> “为了长远发展，本集团也正持续进行战略人才储备和培养，截至2016年6月30日，已有261位博士加入管理培训生计划，他们已逐渐成长为本集团的中流砥柱，本集团将继续培养、招募各行业高素质人才，蓄力未来。”\n\n对博士毕业生的招收规模之大，待遇年薪之高，一时之间使得人们对此现象不能不关注。我有好几个博士朋友就此问题问我，不乏甚至有人参与此计划。我想这是一个值得令人思考的问题。就此现象，我分享一点我的看法，未必正确，仅供参考。\n\n一个民营房地产企业如此大规模地招收博士，这是不是一个广告效应的噱头？为什么要这么多博士？这对企业有用吗？对博士毕业生是否一个负责任的态度？会不会造成人才浪费？一连串的问题。\n\n从博士这边来看，通常一名博士毕业后，常规去向是科研院所，向着研究员或者教授的职业路线发展。然而，科研教职之路并不平坦，僧多粥少，国内国外，博士毕业到拿到教授职位的比例很小，因为教职位子越来越难得，而华人科研工作者在国外生存更不易。\n\n从国家科研资金投入来看，由于实体经济的衰落以及2008年开始的经济危机，发达国家的科研投入很可能维持现有水平或继续萎缩，再加上跨国合作、以及科研人员在不同国家的流动性有利于科技创新，近几年许多国家出现反全球化和反移民现象，这可能也会驱动发达国家政府减少投入科研资金。\n\n2015年中国R&D支出占GDP之比为2.047%，比2000年翻了近3倍。预计2020年，中国科研投入资金将超过美国（同时科研投入占GDP将达到史无前例的2.5%）。需要注意的是，科研行业同时有着马太效应，大者恒大，赢者通吃。处于科研系统底层的科研从业者，尤其是年轻的科研人员，还是有不少人在为温饱问题而挣扎，很难静下心来搞科研。\n\n同时，做科研的辛苦程度并不亚于做企业。每个团队中的塔尖，无论是教授或非教授，面对的都是这些任务：要招到优秀的人（学生或者博士后）并管理好团队，寻找到相当数量的科研资金，发表足够数量有足够影响力的文章，建设和维护本行业圈子内有影响力的社交网络。这和一个企业的CEO没有区别。科研院所的人看起来无固定约束——不用打卡坐班，但无形的压力时刻保持，累心比累身谁更累？\n\n从碧桂园这个房地产企业来讲，为什么要这么多博士（该企业2017年预招300个博士，意味着可能要面试6000个博士，而中国2012年博士毕业生总产出为约6万，2016年中国留学基金委资助海外博士留学生8500人）？博士能干什么？好的人力资源，需要将人放在合适的位置发挥出其最大的价值，于企业于个人才是双赢的事情。\n\n必须指出，建筑业可能仍然是一个技术发展相当慢的行业，除了机械代替过去繁重的人工，其它方面，盖一个房子与一个世纪前没有太大的区别，就更别说像英国这种发达国家大量的民房还是100年前的。技术落后的一个重要原因就是人才的缺乏，或者说顶尖人才不愿意进入这个行业。\n\n碧桂园这几年的发展有一种野蛮生长扩张的景象。目前国内国外有着大量的项目开工（2016年中期已经有531个国内项目，海外5个），眼前需要大量的人才，未来也需要人才储备。其创始人亦提出：有“人才”有天下。大有一种想做成基业长青的抱负。\n\n对碧桂园来讲，它可能看重的是广大博士的高智商和高情商。对于博士来讲，过去的经验和知识能用得上的不多，因为即使继续从事科研，科研的关注点也会变化。博士的智商未必最高——当然平均水平不错，不可否认的是，博士们情商很高，攻读博士的几年时间，一般都是修炼苦行僧一样的修炼——否则根本就熬不到毕业的那一天。另外一个不容忽视的事情：每一位博士都有其本身强大的人际社交网络这一无形的宝贵资源，你懂的。\n\n因此，碧桂园这样的企业可能认为博士的学习能力和思维方式，带来的创新是企业亟需的东西。如果还有一定的社交技巧，为人处事都能处理得很好，将又深又窄的研究方法用来对付又宽又浅的企业运作（比如房地产），有一种高射炮打蚊子的俯视感。这也可能是碧桂园对博士的专业背景要求不高的原因。\n\n碧桂园刚开始大规模招收博士时，外界其实很质疑这件事情的动机和最终结果——包括现在依然有很多人持怀疑态度。不过，从目前已经进行了几年的这个计划来看，规模越来越大，作为外人，里面如何运作是一个黑箱子，但有理由猜测这个计划进行得还不错，至少达到了预期效果。否则没有理由花大价钱招进这一批人并养着他。如果为一个人才的投入是1元钱，能带来的10元的效益，这样的生意谁都会愿意做。\n\n不是每个博士都会愿意去碧桂园——40万年薪在现在看起来并不是高不可攀，也不是每个博士都会被招聘进去——碧桂园有它的择人标准，即使成功招聘了也未必到职——往年只有约一半的到职率。但听说碧桂园的待遇承诺确实兑现了——深圳政府的“孔雀计划”据说在兑现时不尽完美。碧桂园2016年销售额3000亿，据说利润400多亿，它有足够的资金兑现承诺。另一方面，碧桂园到目前共有400人，只有30多人离职（不过也要考虑到大部分新入职的博士不太可能会离职），似乎企业和博士双方都比较满意。\n\n从近几年开始，随着[全球化新形态](https://tumutanzi.com/archives/15584)的发展，不少有实力的中国企业或多或少都有出海扩张计划，这符合国家大环境鼓励企业走出去的背景，也适合人民币国际化的大背景，更响应中国“一带一路”建设的大计划。国内城镇化进程迟早会有饱和的时候，但是东南亚沿海欠发达地区的整体现代化，还有巨大的空间，中国有能力的企业不走出去解救“受苦受难”的人们，天理难容。即使是发达国家地区，安永最近的调查显示，2016年中国对德投资额从2015年的5.3亿美元升至126亿美元。\n\n在此背景下，像碧桂园这样的房地产企业，也有出海计划，碧桂园已经或者即将进军马来西亚、印度、印尼、澳大利亚等市场。所以，它需要尤其是海外毕业的博士，这样有利于它的出海计划。\n\n行业都有起有落。目前碧桂园还处于大量需要人才的阶段，企业也处于井喷野蛮式扩张的时期，招这么多博士进一个企业，似乎没有什么问题。万一将来行业的冬天来临了怎么办？企业如何对这些人才负责？一万年太久，只争朝夕？我不知道碧桂园到目前还有没有思考到这么远。不过，也许这些博士本身能为企业找到其它的利润增长点，他们应该有足够的智慧去面对，未来的世界，房地产企业还只是造房子吗？他们的加入本身就是对这个行业的最强力的注血。\n\n正如在中建某集团担任副总的马明磊博士如此评价碧桂园大规模招收博士现象：\n\n> “这是典型的门客思想，但是却很务实。更适合那些有经验又有激情的人进入这个圈子，实际上碧桂园在2006年开始做的是全硕士人才招聘制度，现在又开始博士精英制度，这个概念属于人才核武，威慑力明显。\n> \n> 五年多国企经验告诉我一个道理，博士和其他人不同之处在于都曾入过思维监狱，也都胜利越狱，本身这就是最大的能力。再和高级的管理制度配合起来，这个团体能做的创新和创制，我认为也是不可估量的。\n> \n> 中建五局的总经理去碧桂园之后一年的收入是过去七倍，创造的价值是过去三十几倍，实际上他们的拿地策略，公关水平，设计与施工管控都在一个高级的水平上，与万达拿地快质量差不同，与万科玩高级概念，龙湖走高端养居不同，碧桂园走的更为中庸，似乎考虑更多的元素参与，我认为碧桂园短期内不见大风起，未来却可能云飞扬。”\n\n和他一样，我对碧桂园这种“敢为天下先”的做法，表示谨慎的乐观，是一个值得称赞的行为，这本身多少说明这家企业有进取的创新精神。至于未来如何评价？未来自有评说。\n\n男人找媳妇到最后还是看漂不漂亮，找工作的时候最后也是看待遇够不够高。去企业工作一定会很辛苦，肯定会有KPI等内部外部考核指标，直至你精疲力尽的时候。所以，我必须声明，我对各位博士是否应该进碧桂园这样的企业不持任何态度，既不鼓励也不反对，我本身也和它毫无利益关系。\n\n爱搞科研的搞科研，科研总需要人去搞，这样的行为值得鼓励并称赞。当然，如果觉得搞科研没有兴趣，前途渺茫，有合适的企业也未必不可以考虑，小步试错，快速迭代。做科研的人思路必须开阔，敢于创新，在面临自己的职业路径选择时，也需要发挥这种精神。"
		},
		{
			"post_id": 15,
			"title": "2017春晚直播海外观看（CCTV央视高清特供）",
			"date_published": 1485360677.485,
			"body": "### 2017春晚直播海外在线网页收看方法技巧\n\n[![央视春晚海外直播](https://tumutanzi.com/img/chunwan2017.jpg)](https://www.xiangweiqing.co.uk/tv/chunwan.html)\n\n观看方法很简单，直接点击上面播放图标观看2017年央视春晚海外直播，YouTube信号源全球直播，高清流畅，不卡顿！本页面上2017中央电视台春节联欢晚会 2017 Chinese New Year Gala (Live) 支持Chrome, Firefox火狐，Safari, IE浏览器，支持iPad, iPhone安卓Android手机平板电脑，不需要安装任何其它软件和插件，高清流畅。\n\n2017年春节来了，按惯例([2013年春晚](https://tumutanzi.com/archives/10735)，[2015年春晚](https://tumutanzi.com/archives/13040)和[2016年春晚](https://tumutanzi.com/archives/15093))，土木坛子将一如既住为广大海外华人提供春晚高清在线直播服务攻略，方便美国、英国、加拿大、日本、法国、德国、澳大利亚、新西兰、荷兰等国外华人留学生，不用电视机或者电视盒子而直接通过电脑手机同步观看央视鸡年春节晚会直播，和国内外亲朋好友共同迎接鸡年春节到来。\n\n土木坛子在英国祝大家春节愉快，鸡年吉祥！\n\n### 2017鸡年春晚直播时间\n\n*   北京时间——1月27日8:00 pm （星期五）\n*   英国时间——1月27日12:00 pm （中午）\n*   欧洲中部时间——1月27日13:00 pm\n*   美国东部时间——1月27日7:00 am\n*   美国中部时间——1月27日6:00 am\n*   美国山地时间——1月27日5:00 am\n*   美国太平洋时间——1月27日4:00 am\n*   阿拉斯加时间——1月27日3:00 am\n*   夏威夷时间——1月27日2:00 am\n\n### 2017年央视鸡年春晚节目单（本信息采集时间为2016年12月24日，具体节目单以播出时候的最终节目单为准）\n\n*   1、开场歌舞（洪荒少年+喂鸡舞）表演：鹿晗、口技：金鸡报晓，表演:京中口技。\n*   2、奥运冠军给全国观众拜年，成员：郎平、朱婷、惠若琪领衔的中国女排，马龙、张继科、孙杨、李晓霞、吴敏霞\n*   3、相声（蓝瘦不香菇）表演：贾玲、白凯南\n*   4、小品（坦诚相见）表演：冯巩、林永健\n*   5、歌曲（李）演唱：李玉刚、李宗盛、李玟、李易峰\n*   6、歌曲（新牡丹亭）演唱：李雨儿、杨桃、刘洋洋、储兰兰\n*   7、小品（你轻点）表演：刘亮、白鸽\n*   8、模仿秀（我是谁）表演：孙建宏\n*   9、上海分会场——歌曲（认真的雪）演唱：薛之谦\n*   10、小品（千钧一发）表演：郭冬临、邵峰\n*   11、歌曲（江山颂）演唱：雷佳\n*   12、相声（新虎口遐想）表演：姜昆、戴志诚\n*   13、哈尔滨分会场——歌曲（天赋）演唱：唐嫣、罗晋\n*   14、歌曲（文艺男青年之歌）演唱：孔东东、刘佳\n*   15、钢琴独奏（高山流水）表演：朗朗\n*   16、歌曲（兔子爱萝卜）演唱：杨臣刚\n*   17、西昌分会场——歌曲（天空）演唱：王菲\n*   18、歌曲（牧羊辞）演唱：黄琦雯、郑绪岚\n*   19、小品（老有所依）表演：嘻哈包袱铺\n*   20、武术表演（中华功夫）表演：王洪祥、陈逸豪等《混混拳王》剧组\n*   21、小品（一个小目标）表演：蔡明、潘长江\n*   22、杂技（洪荒之力）表演：李童、登封市少林鹅坡武术专修院\n*   23、相声（这样是哪样）表演：曹云金、刘云天\n*   24、歌曲（妈，我回来了）演唱：毛阿敏、李可亮\n*   25、歌曲（生命之枪）演唱：张梦雪、孙浩雨\n*   26、桂林分会场——歌曲（生活不止眼前的苟且）演唱：许巍\n*   27、魔术（滴水不漏）表演：傅琰东\n*   28、歌曲（龙曲）演唱：成龙、龚铭\n*   29、舞蹈（锦绣河山）表演：中国东方演艺集团\n*   30、相声（好好说话）表演：苗阜、王声\n*   31、歌曲（王、张、刘、陈）王程程、张杰、刘若英、陈奕迅\n*   零点仪式：金鸡报喜\n*   32、诗歌（咏鸡诗）朗诵：余秀华、张一一、危勇、蒋慕平\n*   33、歌曲（七律《长征》+闪闪的红星）演唱：杨洪基、蒋大为\n*   34、歌曲（跑跑跑+梅花山恋歌）演唱：陈思思、江涛\n*   35、歌曲（中国欢迎你）演唱：张也、郁钧剑、晏菲、刘和刚\n*   36、结束歌曲（难忘今宵）演唱：李谷一等群星\n\n### 五地共庆，四海同欢\n\n除北京外，本届春晚将设置4个分会场：上海、广西桂林、四川凉山和黑龙江哈尔滨。\n\n上海，中国四大直辖市之一，被誉为祖国的东方明珠，是中国近代经济文化中心和近现代工业的主要发祥地，是中国共产党的诞生地。位于黄浦江畔的东方明珠电视塔建于1995年，是上海的地标性建筑，矗立于陆家嘴建筑群中，与外滩的万国建筑博览群隔江相望。璀璨的东方明珠见证了上海勇当改革开放排头兵、创新发展先行者的决心与实力。\n\n广西地处祖国南疆，濒临北部湾，聚居着4796万汉、壮、瑶、苗、侗等各族同胞。桂林地处广西东北部，是世界著名山水旅游城市和首批中国历史文化名城，自古就有“桂林山水甲天下”的盛誉，以山清、水秀、洞奇、石美“四绝”闻名于世，漓江是桂林山水的精华。 近年来，桂林正在以“世界一流的旅游目的地”“全国生态文明建设示范区”“全国旅游创新发展先行区”“区域性文化旅游中心和国际交流的重要平台”为战略定位，举全市之力建设“桂林国际旅游胜地”，践行创新、协调、绿色、开放、共享“五大发展理念”。\n\n被誉为“天府之国”的四川是国宝大熊猫的故乡，这里资源富集、物华天宝，世界遗产众多，地质地貌景观丰富，其水能资源蕴藏量占全国的1/4，是中国最大的水电开发和西电东送基地。四川是农产品供应大省，也是我国重要的工业基地之一，拥有丰富的矿产、生物、能源和旅游资源，堪称天然的“聚宝盆”。凉山彝族自治州，是中国最大的彝族聚居区，位于四川省西南部川滇交界处。凉山有彝族、汉族、藏族、回族、蒙古族等14个世居民族，各个民族在这里繁衍生息、互融互通，涵养出浓郁的民族风情和多样文化。州府西昌市位于成昆铁路中段，是中外驰名的“航天城”，西昌卫星发射中心是中国目前设备技术最先进、承揽卫星发射任务最多的航天器发射场之一，助力祖国航天事业取得了一个又一个的辉煌成果。\n\n黑龙江，我国境内最早迎接太阳升起的地方。在这片神奇的土地上，有连绵起伏的大、小兴安岭，有沃野千里的松嫩平原，独特的地理条件造就了黑龙江“全国大粮仓”的重要地位，连续5年荣膺粮食产量全国榜首。广袤的黑土地孕育出黑龙江独特的白山黑水文化，为其赢得了“北方鱼米之乡”的美誉。黑龙江省会哈尔滨风光旖旎、独具特色，是一座中西合璧、时尚浪漫的历史文化名城。作为独具风情的北国之都，哈尔滨将冰雪演绎出了浪漫的情怀和激情的豪迈，展示出独有的美丽与魅力。哈尔滨的旅游名片——冰雪大世界堪称冰雪文化创意与实践的集大成者，每当夜幕降临，在冰与雪的世界里，在光与影的辉映下，演绎出如痴如醉、晶莹剔透的瑰丽景象。\n\n### 2017鸡年央视春晚主持人和节目单（待确认）\n\n总导演：杨东升，主持人：朱军、董卿、撒贝宁、朱迅、尼格买提、李梓萌\n\n1.  （上海分会场）任鲁豫、陈蓉\n2.  （哈尔滨分会场）马跃、翟毓红\n3.  （桂林分会场）李佳明、丁艳清\n4.  （西昌分会场）张蕾、杨林\n\n### 春晚简介\n\n春节(农历正月初一)是中国的传统盛大节日。中国每年除夕晚上都会举办综艺性文艺晚会，春节联欢晚会简称“春晚”，由中国中央电视台春节联欢晚会，地方台春节联欢晚会，网络春节联欢晚会与各地各部门举办的春节联欢晚会等组成。其中大众所指最多的含义是中国中央电视台春节联欢晚会，是中央电视台在每年农历除夕晚上为庆祝农历新年举办的综艺性文艺晚会。时间一般持续到正月初一（春节）的午夜。春晚在演出规模、演员阵容、播出时长和海内外观众收视率上，总共创下3项世界之最：入选中国世界纪录协会世界收视率最高的综艺晚会；世界播出时间最长的综艺晚会。世界2017年的春晚将以“东西南北中、全民大联欢”为创作基调，再次携手四个风格鲜明、各具特色的地区作为春晚分会场，与地处北京的中央电视台一号演播大厅主会场交相辉映，绘就“五地共庆、四海同欢”的美好盛景，营造举国同庆、喜迎除夕的联欢氛围。\n\nThe annual Chinese New Year Gala hosted by China Central Television (CCTV), abbreviated in Chinese as Chunwan, shown on the eve of Chinese Lunar New Year has become a ritual of Chinese people including overseas Chinese when celebrate the festival since 1983, when it was first televised live at home and abroad.\n\nThe gala usually starts at 8 PM (GMT 8, Beijing Time). on New Year’s Eve and lasts about four hours Making it one of the premier television events of China, CCTV Chinese New Year Gala is the large-scale integrated party owning a largest audience. The Gala is in a variety of forms, often featuring musical, dance, comedy, and drama performances.\n\nCCTV strives for the new high each year to cater to all audience’s tastes."
		},
		{
			"post_id": 14,
			"title": "2016年的一些改变",
			"date_published": 1483295206.606,
			"body": "![英国冬天](https://tumutanzi.com/wp-content/uploads/2017/01/winter-england-2016.jpg)\n\n2016年对世界来讲，发生了很多大事，[英国脱欧](https://tumutanzi.com/archives/15105)，[美国总统大选](https://tumutanzi.com/archives/15485)，各种恐怖袭击……但对我来讲，是很平静的一年，这一年几乎没有干成什么事情。细细回忆，有几件事情是这一年来的一些改变。\n\n**[生了个闺女](https://tumutanzi.com/archives/15421)**：这是上天赐予最好的礼物。犹记得孩子妈年初时，用早孕试纸测试出来的结果，和怀儿子一样，再次感到太突然，没有一点点防备。我的人生就是这样没有计划，再一次。除了叮嘱母亲给列祖列宗多上几柱香， 我真的该好好学习如何节育了……\n\n**[开始喝咖啡](https://tumutanzi.com/archives/15132)**：缘于偶然一次闻到咖啡粉末的浓郁香味，再加上人在国外[难得中国茶叶](https://tumutanzi.com/archives/11742)，慢慢的就喜欢上了咖啡的苦味。每天喝一两杯，于身于心，都有好处。\n\n**用Android手机**：家里领导的手机iPhone 4S跟不上时代了，买最新的iPhone还是有些贵，于是尝试了一款英国产的Wileyfox手机，用着还不错，虽然没有iPhone那么好，但大大超出我的预想，反应很快，电池续航也不错，流氓应用也没有。最关键的是，价钱才100多英镑。\n\n**[开始用电动牙刷](https://tumutanzi.com/archives/15382)**：孩子妈给我买的电动牙刷，我用上后就再也不想用传统牙刷了，确实刷得更干净，连过去牙缝间的黑色牙垢都刷掉了，而我以前总是偏见地以为电动牙刷是懒人才用的东西，它确实是懒人必备，但又不止是懒人必备。\n\n**吃三明治**：生了女儿后，事情还是要多一些。我尝试中午吃自己早上做的三明治，简单方便。面包、蔬菜、肉都有，营养上应该均衡，口味自然没有中餐那么好，但也凑和，总算解决了“吃什么”这个世界难题。\n\n**[买了个Kindle](https://tumutanzi.com/archives/15499)**：我已经有两个Kindle，但都无法用中国亚马逊账号。这个最新的Kindle专门用来看中文书。在不涉及意识形态的作品中，也有不少优秀的中文翻译作品和国内作者的作品，看看也不错，之前[完全排斥翻译作品](https://tumutanzi.com/archives/12485)也不妥。\n\n**看电视**：[买了一台所谓的智能电视机](https://tumutanzi.com/archives/15513)，用网络宽带看电视，以BBC为主，没有广告的电视节目看起来也还可以，了解英国文化和信息，偶尔还听听YouTube上的音乐歌曲。\n\n**听广播**：走在路上，听听广播，比看书还要简单，解放双手。同样以BBC的FM节目为主，一样没有广告，所以还比较喜欢。\n\n**代购还在坚持**：帮国内朋友[代购英国婴儿奶粉](https://tumutanzi.com/archives/13103)的事情还在做，没有太多精力[管理网店](https://tumutanzi.com/archives/15431)（我不是专业的代购），亲朋好友、熟人同学的孩子们，已经够我忙活了。[虽然有些累](https://tumutanzi.com/archives/14195)（所以一般不代购其它的东西），但每每想到朋友们的孩子们能健康成长，除了赚点辛苦钱，这总归还是一件有意义的事情。\n\n**[重启微信公众号](https://tumutanzi.com/archives/15269)**：这个纯属复制粘贴博客文章，没有任何目的，只为方便某些志同道合的国内朋友。庆幸一直坚持到现在。我一般都是胡乱写，是对自己生活的记录，对别人基本上没有太多的帮助，所以也许将来没有什么人看的话，我也就不必做无用功了，人的精力是有限的。\n\n光阴太快，慢慢改变。庆幸思维没有固化，也只有这样才可能不至老得太快。\n\n2017年？期待更多更美好的改变。"
		},
		{
			"post_id": 13,
			"title": "一个鲜为人知的信用卡使用技巧：信用卡额度使用率",
			"date_published": 1482419209.889,
			"body": "![credit-score](https://tumutanzi.com/wp-content/uploads/2016/11/credit-score.jpg)\n\n之前在介绍[为什么要用信用卡](https://tumutanzi.com/archives/15517)的时候，我提到过个人信用分数的问题。如果不好好使用信用卡，可能会给个人信用带来极大的负面影响。\n\n所谓合理使用信用卡，除了按时还清信用卡欠款外，还有一个可能99%的信用卡用户都不知道的问题：**信用卡额度使用率**（credit card utilization）。不注意这个问题也会对[个人信用](https://tumutanzi.com/archives/15497)产生负面影响。\n\n所谓信用卡额度利用率，是指账单日后，信用卡发卡机构给个人征信机构上报的信用额度利用率。比如，小王的信用卡A，有1000元信用额度，最近的对账单上显示他因消费而欠银行500元，那么信用额度利用率就是500/1000＝50%。\n\n如果他还有另外一张信用卡B，额度2000，对账单显示他需要还款600元，那么信用卡B的信用额度利用率就是600/2000＝30%，同时，信用机构还会给出小王所有信用卡的总信用额度利用率，也就是（500+600）/（1000+2000）＝36.7%。\n\n信用机构会依据信用额度利用率，来评估用户的信用分。信用机构的逻辑是这样，信用额度利用率越高，说明该用户信用越差。因为该用户对信用卡额度越依赖，相应的全额还款风险也就越高。进而言之，如果该用户继续申请其它信用：比如贷款或申请新的信用卡，那么银行就会觉得风险比较大。\n\n这个逻辑其实与信用卡银行本身是互相矛盾的，银行应该希望用户在额度范围内用得越多越好，只有那样，银行才能从商家那里收到更多的信用卡刷卡消费手续费——这才是银行开办信用卡的最大利润动机。\n\n事实是，欧美信用机构以及中国央行个人征信都将信用卡额度利用率纳入个人信用分计算体系。因此，信用卡用户只能遵守这个规则。\n\n既然信用卡是用来消费，信用卡额度利用率又越高越不好，那么信用卡额度利用率保持多少为佳？综合各方面的信息，**通常建议信用卡额度利用率保持在10%－30%之间**，是一个最佳的的区间。\n\n这是不是说，小王那张1000元的信用卡在本账单周期内最多只能用300元？不是。信用卡可以在信用额度内随便使用，只要在账单日来临之前，部分还款，使信用卡消费欠款控制在10%-30%以下即可。长期来讲，不要轻易注销信用卡（尤其是最早开通的信用卡，除非年费相当高）、提升所持有信用卡的信用额度也能降低信用卡额度利用率。\n\n假如小王消费了800元，这是80%的信用卡额度利用率，只要在账单日之前还款600元，那么账单上只需要还款200元，银行上报给信用机构的信用卡额度利用率就变成了20%。这个办法对于一些[返现优惠信用卡](https://tumutanzi.com/archives/15402)尤为有用，用得越多返现优惠越多，同时又不因信用额度使用率太高而损害个人信用积分。\n\n显然，信用卡额度利用率为0，即账单日前全部还款或者根本不使用信用卡，这样的信用卡额度利用率也不好，因为那样的话，信用机构觉得你都没有信用使用记录，何来良好的信用？\n\n明白了信用卡额度利用率，你也许就应该注意这个事情。就更别说，在国内居然还有专业的信用卡套现公司，专门帮助信用卡用户套现，如果不注意信用卡额度利用率，这其实是一件很损害个人信用的事情。"
		},
		{
			"post_id": 12,
			"title": "为什么要使用信用卡？",
			"date_published": 1482233314.953,
			"body": "![信用卡](https://tumutanzi.com/wp-content/uploads/2016/07/credit-card.png)\n\n[信用卡](https://tumutanzi.com/archives/15373)其实是银行借钱给信用卡持有人消费，每个账单日来临时，再还清信用卡上的欠款。既然迟早要还，那相比使用现金和普通的银行卡（借记卡），为什么还要使用信用卡呢？网上有一些答案——比如[知乎问答](https://www.zhihu.com/question/19795983)，但答得不是很全面。\n\n使用信用卡除了有利于理财、相当于从银行借到钱、分期付款、境外消费、酒店消费预授权、[积分返现优惠](https://tumutanzi.com/archives/15402)等，在我看来，使用信用卡还有一个最大的好处：**积累信用**。\n\n因为使用信用卡是使用银行借给用户的钱——贷记卡，所以良好的信用卡使用记录，本身就是一个建立和积累良好[信用报告](https://tumutanzi.com/archives/15497)的过程，银行也会每个月将此记录上报信用机构——国内通常是中国人民银行个人征信中心。\n\n经常用信用卡消费，然后按时还款，通过这个记录就可以向信用机构证明，持卡人能很好地管理好自己的信用：及时还款，诚实守信。这的确是个人信用报告中很重要的信息，比如国内央行个人征信报告，国外的各信用机构也是如此，[占信用分的35%](http://www.myfico.com/credit-education/whats-in-your-credit-score/)——最重要的分值。\n\n相反，如果没有信用卡使用记录，信用机构就无法收集该用户的信用历史，从而无法给出良好的信用评价，即所谓的白户，空白记录一张。一个没有良好信用报告的用户，将来如果向银行贷款的话，要么很难贷到，要么利息比较高。\n\n当然，通过信用卡积累信用需要一个前提：合理使用信用卡。如果不当使用信用卡，尤其是不按时还款——哪怕超过一天，信用记录上就会留下不良记录，从而导致更差的信用报告。严重情况下，导致未来房贷等出现问题。这不是吓人，我一朋友说他大学毕业后几年，因为信用卡拖欠还款，现在已无法从银行贷款买房，只能全款买房……\n\n对于使用英国信用卡的朋友，还有一个额外好处，英国信用卡消费受1974年制定的[Section 75 of the Consumer Credit Act](http://www.moneysavingexpert.com/shopping/section75-protect-your-purchases)法案保护：消费100英镑以上3万英镑以下的商品有问题，甚至付款后对方未发货，信用卡发卡单位需要为消费者提供赔偿！此外，信用卡支付通常从付款到商家最终拿到款项有一个Pending缓冲期——通常有好几天时间，假如信用卡被盗刷，完全可能通过通知银行从而挽回损失。\n\n你肯定不想成为一个没有信用的人吧？光说“我是一个诚信的人”，别人难以相信。因此，一个正常的现代人，应该申请拥有至少一张信用卡，然后在生活和工作中合理地使用信用卡，这只会给信用生活带来方便和好处。"
		},
		{
			"post_id": 11,
			"title": "关于职业发展，在变化的世界里哪些东西不变？",
			"date_published": 1479576273.639,
			"body": "![autumn-201610-meersbrook-park](https://tumutanzi.com/wp-content/uploads/2016/10/autumn-201610-meersbrook-park.jpg)\n\n一位朋友厌倦了朝九晚六的企业工作，想辞职换到一个类似[微信公众号](https://tumutanzi.com/archives/15269)的编辑工作，以为工作时间可能更加自由一些，这位朋友问我有什么看法。\n\n我从没有做过人力资源的工作，不懂职业规划，对这个变化的世界也知之甚少，不过我对这种事情还是有一点自己的看法。\n\n大概对现有工作固定上班时间所厌烦而跳到新媒体编辑工作，这样的理由明显很松散。那些自由职业，形式上松散——比如没有固定上班时间，但很可能时刻需要为之紧绷神经，反而不如企业那样像颗螺丝钉一般按步就班轻松。\n\n新媒体行业来得快，去得也快，很难有一种我们需要的稳定和安全感。在稳定和安全感得不到一定保证的前提下，去尝试风险，到时带来的结果可能承担不起。\n\n至于新工作的薪资，如果一个职位门槛很低，意味着任何人都可以进去，这样的工作报酬很难高到哪儿去。在这种新媒体里写写搞笑吸引眼球的文章，是很多人都可以做到的事情，没有太大的理由给出令人眼前一亮的薪资。\n\n其实这位朋友现在企业的薪资报酬还可以，至少对于其所在的二线城市定位来讲，比上不敢说，但比下绰绰有余。\n\n一个人的职业发展，不是不可以更改线路，而是不能随意更改。在这个不断变化的世界里，应该需要怎样一种态度对待自己的职业发展？\n\n首先，要有一个粗略的长远规划，哪怕是慢慢地增量发展，只要沿着这个路线积累知识、经验和资源，终有一天能成为这方面的专家，即所谓的匠人精神。\n\n同时，不能沉浸在安逸和稳定中不求上进。所谓天下虽安，但居安思危。这个世界变化太快，不少专业和知识随着社会的发展也许变得没有太大的用处……那怎么办？\n\n我想，总有一些东西不随时代变化而变化。更具体一点需要注意的事情是，使自己掌握的知识和经验具备以下两个特点：\n\n*   有价值。即有用，没有用的东西，不会被别人所看重，没有哪个公司和企业愿意养着一个没有用的闲人。\n*   稀缺性。人无我有，人有我精，当你有独当一面的地方，这个工作就非你不可。和大众无异，也就沦为芸芸众生。芸芸众生的生活态度可以，但于职业生涯中并不可取。\n\n如果能注意到上面这两点，任凭这个世界如何变化，总有立足之地。正所谓：你是如此优秀，别人不可能忽略掉你（[so good they can’t ignore you](https://tumutanzi.com/archives/12941)）。\n\n与各位共勉，请批评指正，因为我很确定的事情是，任何时候我所说的话都有可能是错误的。"
		},
		{
			"post_id": 10,
			"title": "2016巴西里约奥运会赛事海外CCTV5直播观看方法",
			"date_published": 1470647580.122,
			"body": "### 国外网页直播巴西奥运\n\n直接点击下面播放图片（**[或者直接点击这里](https://www.xiangweiqing.co.uk/tv/aoyunhui.html)**），国外网页高清观看巴西奥运会CCTV5直播，适用于所有地区（美国、英国、加拿大、法国、德国、澳大利亚等）所有联网设备：智能手机、电脑、平板等设备（iPhone, iPad, Mac, iPod）：\n\n[![2016巴西奥运会海外直播](https://tumutanzi.com/wp-content/uploads/2016/08/olympics.png)](https://www.xiangweiqing.co.uk/tv/aoyunhui.html)\n\n巴西里约奥运会马上要开幕了，和上次巴西足球世界杯一样，这是体育爱好者们最期待的盛事。\n\n和以往的奥运会和世界杯转播一样，CCTV5的巴西奥运会直播也因版权问题，不会对国外观众开放网络观看。\n\n这使得国外广大留学生华人朋友又面临一个问题：如何在国外在线收看CCTV5的奥运会赛事直播（重播）？国内的朋友真是身在福中不知福，可看电视，可上CCTV5网站观看……\n\n土木坛子在这里分享给大家国外收看巴西奥运会直播的方法与技巧。希望大家享受奥运会带来的快乐，通过CCTV5关注中国奥运健儿。同时预祝中国运动员取得好成绩，为中国队加油！\n\n### 巴西奥运会开幕时间\n\n*   巴西：2016年8月5日20:00\n*   美国东部：2016年8月5日19:00\n*   英国：2016年8月6日0:00\n*   欧洲西部：美国2016年8月6日1:00\n*   北京时间：2016年8月6日07:00\n\n### [巴西奥运会介绍](https://zh.wikipedia.org/wiki/2016%E5%B9%B4%E5%A4%8F%E5%AD%A3%E5%A5%A7%E6%9E%97%E5%8C%B9%E5%85%8B%E9%81%8B%E5%8B%95%E6%9C%83)\n\n第三十一届夏季奥林匹克运动会（英语：the Games of the XXXI Olympiad，法语：les Jeux de la XXXIe Olympiade，葡萄牙语：os Jogos da XXXI Olimpíada）。又称为2016年里约热内卢奥运会，简称里约奥运，于2016年8月5日至21日在巴西里约热内卢举行。\n\n本届赛事参赛国纪录再创新高，共有10500多名来自206个国家奥委会的运动员预计参赛，其中包括首次登场的科索沃和南苏丹。赛事将设置306套奖牌和28项奥运会项目，包括于2009年由国际奥委会引进的七人制橄榄球和高尔夫。这些体育项目将在主办城市33个场馆和圣保罗（巴西最大城市）、贝洛奥里藏特、萨尔瓦多、巴西利亚（巴西首都）和马瑙斯的5个场馆举办。\n\n赛事将是国际奥委会主席托马斯·巴赫任期内的第一届夏季奥运会。2009年10月2日在丹麦哥本哈根举行的第121届国际奥委会会议上被宣布为主办城市。里约将成为第一个举办夏季奥运会的南美城市。赛事也将是第一届由葡萄牙语国家举办和第一届完全在主办国冬季期间举办的奥运会，还是自1956年和2000年以来，南半球第三届奥运会。\n\n### 里约奥运会与YouTube直播\n\n其实[YouTube直播奥运会](https://www.youtube.com/user/olympic)非常不错。2016年巴西里约奥运会将向亚洲和非洲尚未购买数字信号转播权的64个国家和地区提供伦敦奥运会的网络直播服务，这是YouTube向主流媒体迈进的重要一步。YouTube称，国际奥委会将提供10个频道、多项赛事的高清视频直播服务，包括时长达2200个小时的免费直播，以及全部32项赛事的决赛直播。\n\nYouTube对2016年巴西里约奥运会的实时流媒体独家直播仅限于尚未购买数字信号转播权的国家和地区，这些国家和地区也是国际奥委会的广播合作伙伴，包括：阿富汗、孟加拉国、文莱、不丹、柬埔寨、东帝汶、印度、印度尼西亚、伊朗、老挝、马来西亚、马尔代夫、毛里求斯、蒙古、缅甸、尼泊尔、巴基斯坦、巴布亚新几内亚、新加坡、斯里兰卡、泰国和越南。与此同时，YouTube将以非独家直播的形式向撒哈拉以南的安哥拉和赞比亚等42个非洲国家和地区提供直播服务。\n\n与之对应，其它的国家比如美国、英国、德国、法国、荷兰、比利时、意大利、西班牙、奥地利、芬兰、希腊、葡萄牙、爱尔兰、卢森堡、日本、加拿大、韩国、澳大利亚、中国台湾、瑞典、瑞士、中国香港、丹麦、挪威、以色列、新加坡、新西兰、印度、冰岛、沙特等国家可能无法通过YouTube观看里约奥运会直播。\n\n当然，你可以使用VPN通过上述有YouTube直播权的国家观看……"
		},
		{
			"post_id": 9,
			"title": "回到国内的某些真实感受",
			"date_published": 1466673066.703,
			"body": "请注意，大叔我要开启牢骚模式，以下可能是满满的负能量。\n\n每一次回老家我都有类似的感受。父老乡亲固然淳朴，然而他们一般也只顾麻将打牌不跟你聊天。如果聊起天，问得最多的一般是你的工资多高，当我如实相告后，他们又满是怀疑失望的眼神，因为他们觉得你在国外应该年薪几百万人民币才正常。\n\n有些乡亲们还希望我能向“上面”反映某些他们亟需解决的问题，又或者希望我能“找关系”解决某些私人问题，我家亲叔甚至觉得我应该还能修好电视……\n\n我从来不觉得自己是个与别人有什么不一样的人，然而他们总是觉得你洋博士、博士后应该是三头六臂、神通广大，无所不能。可他们并不会问你过的好不好，而我的答案却往往让他们失望与怀疑，弄得我感觉像是坏了科研人员这个职业的大罪人。这的确是我回老家的相当一部分的感受。\n\n曾经有朋友问我在国外想不想家，我说不想他们不相信。其实大叔我再怎么洒脱，也要被搞烦，我真的理解明朝大学问家李贽为什么要选择晚年出家，他不想被父老乡亲们烦扰。\n\n这社会从来就是如此功利务实，不但是父老乡亲们，我的一发小也这么跟我说：这年头除了钱，什么都是假的。还笑话我可能在国内玩转不开，他感慨地说，在中国要混得好，有三个秘诀：一、不要脸；二、不要脸；三、还是不要脸。\n\n我理解父老乡亲对我的期待，可是我真的满足不了他们的期望，以后我就统一口径，我就是一个和水泥的泥水工，其它啥也不会，这真是真的不能再真的大实话。\n\n![IMG_6742](https://tumutanzi.com/wp-content/uploads/2016/06/IMG_6742-1.jpg)  \n附图说明，我小时候差点淹死在这个水库里，现在不怕了，因为大叔现在是一只海里的乌龟王八蛋。"
		},
		{
			"post_id": 8,
			"title": "土木坛子微信公众号可以留言评论了",
			"date_published": 1464609359.746,
			"body": "![wechat-copyright](https://tumutanzi.com/wp-content/uploads/2016/05/wechat-copyright.png)\n\n早上收到微信官方发来的通知，邀请土木坛子开通微信公众号原创保护。\n\n我早知道这个功能，但没想到这么快就能收到邀请，一般都说要半年甚至更久的连续更新时间，而土木坛子微信公众号恢复更新才不到2周时间。这让我感觉微信团队好像有成员是土木坛子的粉丝一样，或者说，他们很知趣。\n\n收到邀请后，我就去后台申请开启，两个小时后审核就通过。虽然我向来对包括微信在内的腾讯产品并不十分热衷，但他们的认真和快速反应我还是能感觉到。\n\n有了原创保护功能后，土木坛子微信公众号上发布的内容就能拥有原创保护，别人就不能轻易复制抄袭。\n\n比如，前几天我分享在中学母校的演讲全文，就因曾经授权老家某地方媒体公众号发布，原创权居然归属它们，到我自己发布时，警告我不能修改发布！\n\n后来我虽然申诉胜利后，发布文章依然只能保留那家地方媒体公众号的格式，这让我感觉非常不爽。以后，我尽量把自己写的东西发布在“土木坛子”微信公众号上，避免为他人作嫁衣裳。\n\n在开通原创保护的同时，土木坛子公众号还拥有了留言功能，这是我非常期待的功能，之前订阅用户们有感想后，都是通过后台留言与我交流，现在，大家可以直接在文章页面后面留言评论，分享见解，我也会视情况互动回复。\n\n我写博客文章那么多年，自己写的不少，但收到的留言评论更多，其中有不少留言使我收获不少，一个人的见解和思想难免不全面。有了网友的互动交流，收获会加倍。\n\n恢复公众号更新2周以来，发现订阅的用户数量稳步上升，说明这个公众号有一定用处。我需要做的事情也不过是同步博客上的内容，所以也不是太麻烦。\n\n我并不追求单纯的订阅用户数量，我希望订阅“土木坛子”的朋友真的能有所收获和乐趣，虽然我认真对待我写作的东西，但浪费别人的时间和精力永远是一种罪过。\n\n后台数据表明，订阅用户中只有30%是女性。这不奇怪，我写的文字比较随意，但也很理性。我也从来不讲究写作技巧，也没有丰富的情、爱内容，更不会有标题党和心灵鸡汤之类假大空的东西。自然，男性会更喜欢一些。当然，另一方面也说明，订阅土木坛子的这些女士们，也许真的是高雅、睿智型，她们懂我这中年猥琐大叔的欢喜。\n\n无论博客网站上的写作，还是微信公众号上的更新，传播形式的变化没有改变写作的内容和态度。我欢迎有共同兴趣的朋友来和我交流互动，思想传达到知音那里，对我来讲就是一件乐事。\n\n土木坛子微信公众号：TUMUTA 或扫描以下二维码：\n\n![土木坛子公众号](https://tumutanzi.com/img/tumuta-weixin.jpg)"
		},
		{
			"post_id": 7,
			"title": "恢复土木坛子微信公众号更新",
			"date_published": 1463235833.936,
			"body": "最近，我恢复使用土木坛子2012年注册的微信公众号：tumuta，以后尽可能将博客内容更新复制到公众号上，方便喜欢使用微信的朋友交流。\n\n我曾经写过一篇博文，解释了我一直以来[为什么排斥微信公众平台](https://tumutanzi.com/archives/12992)，现在似乎食言了。其实我到现在也并不喜欢微信公众号，它并不是真正的互联网，难以互联。和个人博客网站比起来，它也不具有足够的自由。\n\n然而，我也承认微信公众平台在中文网民中的事实地位，这个封闭花园何时倒闭我不知道，但基于移动互联网的它目前确实方便信息传播——至少在中国大陆。不一定要它天长地久，只要能为我所用，也未尝不可。另一方面，我也希望通过亲自使用它来了解它。\n\n以后，博客这头还一如从前，只要是合适的内容（你懂的），我会复制粘贴到公众号里，方便公众号订阅用户交流。因此，恢复公众号对博客上的老朋友们没有任何影响，它只是多了一条传播途径而已。\n\n一个小故事。我的一同学在国内某县级组织部当差，最近他跟我说，想请我担任他们县水泥企业的技术顾问，我不需到企业上班，有问题时就解决问题，顺便发一点报酬。我一想，能贡献我的专业知识造福社会，还能有一点点钱拿，同时也算老同学的业绩。这是一件人畜无害的好事，我就答应了。\n\n原来他们这种县城也在引进高端人才，但是全职引进的话，根本就没有人去。于是，领导们就开动脑子，想出了这么一个变通办法：不求所有，但为我用。\n\n要说“解放思想、实事求是”这八个字，还是很有见地的。\n\n土木坛子微信公众号：tumuta 或扫描以下二维码：\n\n![土木坛子公众号](https://tumutanzi.com/img/tumuta-weixin.jpg)"
		},
		{
			"post_id": 6,
			"title": "纯粹的互联网",
			"date_published": 1461846994.267,
			"body": "我一看到ZeroNet网络，感觉这才是真正纯粹的互联网，又或者是早期的互联网模式，代表的是真正的平等、自由、民主、隐私。\n\n难道不是吗？憧憬未来。"
		},
		{
			"post_id": 5,
			"title": "简评ZeroNet分布式P2P网络",
			"date_published": 1460916742.486,
			"body": "![zeronet](img/zeronet.jpg)\n\n除了几年前的比特币，很久没有令我眼前一亮好玩的互联网东西出来了。最近看到[月光博客](http://www.williamlong.info/archives/4574.html)介绍了[ZeroNet分布式网络](https://zh.wikipedia.org/wiki/ZeroNet)。试玩了一下ZeroNet，觉得这个P2P分布式网络很有意思。\n\n简单地说，ZeroNet就是一个P2P为基础的HTTP分布式互联网世界，网址形式为127.0.0.1后面跟一个比特币钱包地址一样的34位长度字符串，比如：\n\n`http://127.0.0.1:43110/1D41D7ybgaDypUV3wJ12NHRdJSL35kLiSJ`\n\n虽然没有HTTPS，但我猜测内容本身已经加密，就像比特币的网络系统一样。\n\n与我们平时访问的互联网相比，最大的不同点就在于ZeroNet是去中心化，不需要中心服务器，每个访客都是一个节点，承担存储内容和传输带宽，第三方自然也无法审查删除内容。从这一点上来讲，ZeroNet比CDN式的分布式网络更彻底，CDN不过是把原来的一个中心分散成更多的中心，ZeroNet把内容分布在每一个访客节点上。\n\n听起来和[暗网或深网](https://tumutanzi.com/archives/12904)类似，又是一个互联网的法外之地？的确，ZeroNet类似的P2P网络与神秘的暗网一样，它不受政府管制，除非把整个网络摧毁——比特币也是如此。从这个意义上来讲，它能成为技术上保持中立的传播工具。至于人类利用它来干坏事还是好事，那完全是另外的话题——我们只谈技术。\n\n不过，暗网依然需要中心服务器，只不过外界无法知道服务器的具体地址在哪里——也许美国NSA有这个能力，暗网本身并不依赖P2P技术。ZeroNet上的内容发布以后，只要有一定数量的节点存活，发布者节点关闭与否都不再重要，内容已经永久存活在网上，永远可以访问，就像用BT发布内容一样，只要种子成活后，内容就理论上存活在互联网上。\n\nZeroNet有一个与BitTorrent发布内容不一样的地方，ZeroNet发布的内容可以修改，就像我们现在用的普通网站一样，随时可以修改内容，与之连接的节点也会自动更新。而BT发布后的内容就无法修改了。\n\n易用性方面，ZeroNet和暗网相比不相上下，暗网需要TOR来浏览，要访问ZeroNet网络，直接[下载ZeroNet软件](https://zeronet.io/)，解压后点击即可运行使用，就像VPN一样，运行它后并不影响现行的网络连接，唯独多了一个访问ZeroNet的P2P网络世界功能，并且是全局访问，无论用哪个浏览器都可以访问ZeroNet世界里的网站。\n\n对中国大陆用户来讲，可能还有一点其它的意义，它是一个真正意义上不受监控的网络，配合加密，GFW可能很难对付。ZeroNet虽然依赖于现行的IP地址系统，但它完全与现行的网络平行，也就是说，现行网络上的内容需要有人转移到ZeroNet网络上，ZeroNet上目前的内容很少。ZeroNet也有相应的搜索收录引擎：[http://zeroexpose.com/](http://zeroexpose.com/) 目前收录的内容很少。\n\n我[在ZeroNet上建立了个站点](http://127.0.0.1:43110/1D41D7ybgaDypUV3wJ12NHRdJSL35kLiSJ)，不需要主机、域名、流量带宽，连我自己都不需要开机就可提供可访问。如果你已经[下载了ZeroNet](https://zeronet.io/)，应该能访问。否则[点击这里](https://bit.no.com:43110/1D41D7ybgaDypUV3wJ12NHRdJSL35kLiSJ)使用ZeroNet的网关bit.no.com访问。[或者从GitHub下载](https://github.com/HelloZeroNet/ZeroNet)，目前支持Mac, Linux和Windows, 还不支持移动设备系统。\n\n我不太认为ZeroNet能取代现行的网络架构。现行的万维网架构发明并存在如此长时间，已经被时间证明了它的重要性，但ZeroNet的出现的确令我眼前一亮，至少从技术层面上来讲，我很久没有这样的感觉了。\n\n必须声明，我也是刚接触ZeroNet，以上理解与评价可能有错误，欢迎高手指正补充。\n\n原文链接：[简评ZeroNet分布式P2P网络\n](https://tumutanzi.com/archives/15178)"
		},
		{
			"post_id": 3,
			"title": "开通P2P网络ZeroNet上的个人网站",
			"date_published": 1460876815.338,
			"body": "一直对P2P的东西很感兴趣，这个ZeroNet的网络系统也很有意思，虽然现在很简陋，但背后的思想还是值得称赞，无论如何，先体验一番。\n\n我是土木坛子，https://tumutanzi.com 的博主。"
		}
	]
}