{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1565411669,
			"title": "Useing a SOCKS proxy with authentication.",
			"body": "I wanted to set my VPN's socks proxy for connecting to trackers, But it looks like there is no way to enter the username and password. I'm not going to use the un:pw@vpnproxy.net trick for obvious reasons.\n\nIs there a way to do this in the config?",
			"added": 1565411668
		},
		{
			"topic_id": 1565638318,
			"title": "No Proxy for localhost in tor is insecure?",
			"body": "https://www.reddit.com/r/TOR/comments/4lj2da/tor_unable_to_connect_localhost/\n\nAparently this reddit user thinks that setting up No Proxy for 127.0.0.1 is not a good idea, and proceeds to link to the following.\n\nhttps://blog.jetbrains.com/blog/2016/05/11/security-update-for-intellij-based-ides-v2016-1-and-older-versions/\n\nHe just says. \"Don't do that\" and gives that site as an exsample, but does not expand on why. Is it a consern over Cross-Site Request Forgery (CSRF)?\n\nI'm confused... Hopefully someone can give some insight.",
			"added": 1565638316
		},
		{
			"topic_id": 1565847129,
			"title": "Self Destructing/Locking down ZeroNet.",
			"body": "As good as zero net is for our freedom, there remains a legal problem.\n\nMost authorities do not care if the data was automatically pulled from Zero, or if you actively even was aware the content was on your HDD. The fact that something illegal was on your HDD is enough for them to say you knew, so they can chuck you into the legal grinder, Were a stuffy old judge that does not understand technology will chuck the book at you for being a degenerate. \n\nWe all know that innocent until proven guilty is dead, and Authorities operate on the flawed thinking of \"you have nothing to fear if you have nothing to hide\".\n\nSo, we need a method that allows the storing of ZeroNet data in a way that meets the following conditions.\n\nA. It is not stored in a legible manner on your HDD.\nB. It can be destroyed in a way that is quick, so the entire data does not have to be zeroed or Gutmanned.\nC. Destruction is not detectable, so you are not charged with destruction of evidence.\nD. It is able to pass plausible deniability.\nE. Can pass the handing over of a password, so you are not charged with obstruction or contempt.\nF. Does not require full disk encryption with a hidden system OS, as the point is to seed all the time, and the clean OS needs to be used constantly for deniability’s sake.\n\nVeracript is obvious, But, I'm worried the problem with this is that the browser and the OS will leave foot prints behind that shows that the hidden volume existed in logs. Or, in the free space data that the authorities could grab if they felt the need to take it to the forensics lab after there donut brake.\n\nSo, I'm thinking that we could have a Linux distro VM with LUKS set up in a way to have a fake and a hidden volume. It is not that unusual for People to have VM's that they do not do very much with. E.G Just have it as a toy they played with, or just testing it out.\n\nIf we use a privacy distro that inherently wipes its self after each reboot, The fact the VM fake boot password has nothing can not be considered suspicious at all. However, The reel VM boot is where your ZeroNet is actually run within, and is where the data is kept. Running this in a VM allows you to host Zero net in its own environment, and, gives you the ability to just give the police the fake PW in that unlikely event you got your IP pegged that one time you was careless, or, a vulnerability was found that allowed Zites to leek your real location.\n\nThere are also ways to get LUKS to delete its keys when requiered, so, for added peace of mind, you could have a way for the ZeroNet volume to Nuke it's keys in a quick manor and reboot, forever rendering that part of the data forever destroyed.",
			"added": 1565847126
		},
		{
			"topic_id": 1565912878,
			"title": "Group?",
			"body": "What is this?",
			"added": 1565912874,
			"type": "group"
		},
		{
			"topic_id": 1565913051,
			"title": "Test",
			"body": "Test",
			"added": 1565913046,
			"parent_topic_uri": "1565912878_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM"
		},
		{
			"topic_id": 1565915181,
			"title": "Now your entering the twilight zone.",
			"body": "",
			"added": 1565915175,
			"parent_topic_uri": "1565915104_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9",
			"type": "group"
		},
		{
			"topic_id": 1565915206,
			"title": "The plot thickens",
			"body": "",
			"added": 1565915199,
			"parent_topic_uri": "1565915181_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM"
		},
		{
			"topic_id": 1565915406,
			"title": "Looks at first posts",
			"body": "Yep. This feels like home.",
			"added": 1565915398,
			"parent_topic_uri": "1565914998_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp"
		},
		{
			"topic_id": 1565920867,
			"title": "Lets get formmatting!",
			"body": " \n \n# _**Tested as working formatting tags you can use on ZT.**_\n\n### ------------------------------------ References ------------------------------------ \n\n[OP][1]\n[OP][2]\n[1]:Faggot\n[2]:Still_A_Faggot\n\n```\n[OP][1]\n[OP][2]\n[1]:Faggot\n[2]:Still_A_Faggot\n```\n\n## _**You can use this to do comment/element jumping**_\n\nClick reply and take the (#comment) string and use that as the reference.\n\n[EG][3]\n[3]:#comment_48_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM\n```\n[EG][3]\n[3]:#comment_48_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM\n```\nIf you want to jump to an element, use inspect element in your browser to find its id in the code. copy the id string, paste it as your Reference and add a \"#\" to the beginning.\n\nE.G.\n\nDon't forget to leave a [comment][4]\n[4]:#comment_body\n\n```\nDon't forget to leave a [comment][4]\n[4]:#comment_body\n```\n\n### ------------------------------------------ List ------------------------------------------\n\n- a\n- b\n- c\n\n```\n- a \n- b\n- c\n```\n\n### -------------------------------------- Num List --------------------------------------\n\n1. a\n2. b\n3. c\n\n```\n1. a\n2. b\n3. c\n```\n\n### -------------------------------------- Code line ---------------------------------------- \n\n`code line`\n\n``` `code line` ```\n\n### ------------------------------------ Code block --------------------------------------\n\n```\ncode\nblock\n```\n\n` ``` `\n`code`\n`block`\n` ``` `\n### ----------------------------------------- Link --------------------------------------------\n\n[link](http://youaregay.com/)\n\n```\n[link](http://youaregay.com/)\n```\nYes, that is actually a working site.\n\n### ---------------------------------------- Quote -------------------------------------------\n\nIt was once said that: \n> OP is a faggot\n\n```\nIt was once said that: \n> OP is a faggot\n```\n\n## They can also be staggered.\n\nConvo:\n> fag1: hay\n>> fag2: fuckoff\n>>> fag1: oh...\n\n> anon: what am i reading?\n\n```\nConvo:\n> fag1: hay\n>> fag2: fuckoff\n>>> fag1: oh...\n\n> anon: what am i reading?\n```\n\n### ------------------------------------ Formatting --------------------------------------- \n\n# H1\n### H3\n## H2\n\n_italic_\n\n**bold**\n\n~~strikethrough~~\n\n--- \n\n```\n# H1\n### H3\n## H2\n\n_italic_\n\n**bold**\n\n~~strikethrough~~\n\n---\n^Horizontal rule\n```\nYes, H2 and H3 are wrong way round... \nThe Horizontal rule also brakes if you do not give it a blank newline above and below it.\n\n###Paragraph formatting\n \n \n \n \n \nIf you want to make multiple newline spaces that the forum engine will not just toss out for being a duplicate. you can use a hair space on each line. This is not recognized as a space character so you can get that paragraph formatting just the way you like it.\n \n \n \n \n \n Enjoy.\n\n### ------------------------- Chan refugee bonus tip ------------------------------\n \n > Such text\n > Much meam\n \n~~If you want to meme text, put a hair space character before the \">\" so the forum engine does not recognize it as a quote.~~ \n\n >\n >\n >\n\nDisregard that, OP sucks cocks. You can use `\\>` to do the same thing, But as pointed out by [qspitzer][5], the hair space does keep things clean on the ZeroTalk list, not that you degenerates would care for such formalitys.\n\n\\>\n\\>\n\\>\n\nIf you do not like how the forum engine makes the newline spacing bigger when doing any of the above, you can also use `&gt;`. (thanks [eighty4][6]). This will keep the paragraph spacing tight.\n\n&gt;\n&gt;\n&gt;\n \n > Much point\n > Such wow\n \n \n[5]:#comment_66_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX\n[6]:#comment_29_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX\n ",
			"added": 1565920858
		},
		{
			"topic_id": 1565922993,
			"title": "This Group is going to burn...",
			"body": "Trollnado in 3... 2... 1...",
			"added": 1565922983,
			"parent_topic_uri": "1565922813_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W"
		},
		{
			"topic_id": 1565927048,
			"title": "Newfags can't meme text.",
			"body": " \n > finds way to meme text.\n > works like a charm.\n > feels good man.\n ",
			"added": 1565927037
		},
		{
			"topic_id": 1566086206,
			"title": "We are fucked.",
			"body": "Technology has now come to this point, nothing can be trusted anymore.\nhttps://www.notjordanpeterson.com/",
			"added": 1566086194
		}
	],
	"topic_vote": {
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"1565542665_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"1565915104_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565915181_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1,
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1
	},
	"next_comment_id": 61,
	"comment": {
		"1565403304_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 1,
				"body": "Just to but in, It is very common for users that use \"Always TOR\" to lose connection to the trackers. Can't find anyone who has explained why yet, but my guess is that the TOR network may be blocking the BitTorrent activity, shutting you out of the network.\n\nI know Tor users frown upon using the network for P2P file shearing, So, If anyone is knowable about the Tor protocol and how peers on the network react to seeing torrent activity, it would be a big help to finding out what is going on.",
				"added": 1565407215
			},
			{
				"comment_id": 2,
				"body": "> [crazylime](#comment_14_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): After updating my tracker list, it appears as though I can get about 26/49 to work.  But, what doesn't work ever is connections to peers, 0 of 6000+.  Why would no peers be accessible?\n\nWell, It may be down to timeing out. I mean, My ping to peers is 3240ms ave over Always Tor. I have a VPN, So, Im just realy testing it out to see how it works. \n\nBut I'm turning Always Tor off now because that ping is abysmal. It would be a hell of a stress on the Tor network, having to deal with the thousands of requests BitTorrent generates with that kind of ping. This is why the Tor network users don't like P2P running over it.",
				"added": 1565413998
			},
			{
				"comment_id": 3,
				"body": "Maybe it would be worth looking into useing Tribbler technolgy for the anonymization protocol. Tribler has built a tor like onion routing system that is taylored for bittorrent with some impressive results.",
				"added": 1565414600
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 4,
				"body": "The account ID system is based on Certs. Basically, Your cert has a public and privet key. You keep your privet key and give sites your public one. This verifies that you are who you say you are without the need to have a password, or for the site to have the need to keep account information.\n\nSites in this system would not be able to keep accounts, as, all the data of the site, even its databases, have to be stored on all computers that load it. So having a database that says (user = John; Pass = Doe;) would be pointless, as anyone that access the site would have that information at hand.\n\nCerts however do not have this problem, as, the user can sign the information with their privet key, and the sites' logic can check this signature information with the public key to verify you are who you say you are.\n\nYou can also use this system to make User only page content. As the content can be encrypted with the public key and sent out to all users to store, but it's content can only be opened and read by the user with that privet key.\n\nThis is why the \"very confusing \"account/id\" system\" is the way it is.",
				"added": 1565572238
			},
			{
				"comment_id": 6,
				"body": "> [bvcfbfbcbcvd](#comment_5_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): @montecarlo: I thought it was obvious that by \"Google\", I meant that they could easily block ZeroNet in their browser which everyone (except I) uses. Nothing about the network itself.\n\nWhat are they going to do, Block LocalHost? I meen, All the browser is doing is presenting a HTML front end GUI served from the LocalHost on port 43110. Most of the magic is going on in the ZeroNet Aplication, with the browser haveing no control over it. Unless they skim the code looking for ZeroNet elements to block the connection, there is not much they can do.\n\nMainly because they like to take a shadow inhibiter approach. E. G: Use an engine bug or use an API they know other browsers do not play nicely with in their own products, to encourage people to do things there way. An outright element scan to trigger a connection drop to the localhost would be way too blatent.",
				"added": 1565578676
			}
		],
		"1565575485_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 5,
				"body": "Confermation: Request receaved. Now posting...\nWaiting for confirmation of receipt...",
				"added": 1565577038
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 7,
				"body": "That was a good one, Thanks for the chuckle. XD",
				"added": 1565579721
			},
			{
				"comment_id": 8,
				"body": "> [trevorlaneray](#comment_44_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): But you raise a good point... How would one go about establishing a \"verified\" tag on a decentralized platform?\n\nYou could have it so when you claim verification on a username, you submit a public key and all look alike character variations of that username is blacklisted as not available for verification. \n\nIf you sign the post with your privet key and the username matches, the verified symbol appears, but, if you do not sign the post, it does not.",
				"added": 1565580616
			},
			{
				"comment_id": 10,
				"body": "> [steeljacket](#comment_10_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a): lol, holy smokes, I posted that strictly tongue in cheek fellows, I was lightly trolling all of you, I expected a storm of \"get f*d\" comments, apparently I severely misjudged the character of this place. I mean, you guys started the flaming well enough until @trevorlaneray arrived and civility and productive conversation broke out. For the record: I don't want a \"verified\" check, it is the mark of lower intelligence and high aggression over on Twatter and I'll be a monkey's uncle if I get one here...\n\nWhat can we say, This is interesting tech. Your troll post posed an interesting conundrum regarding how one could even do such a thing on a decentralized trustless network. ;)",
				"added": 1565585718
			}
		],
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 9,
				"body": "Fake News",
				"added": 1565585257
			}
		],
		"1565639606_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 11,
				"body": "Counter point. Although it is true that all users have the same opportunity to run the network, all are not equal. Only users that have a good home network connection and proper set up to reduce ping, will be preferentially picked as peers to connect to over less capable connections.\n\nPing, Data Capacity and Mbps is the currency the network treasures, and as such, The ones with the grater amount has more power over the network.\n\nDoes the Networking Masterrace not like you? You just got put into the mute blackhole, and your posts will not be seeded by them.\nDoes the Networking Masterrace like you, Or is indifrent to your exsistence? Well, good news, Your posts have been given blessing and now your post will be served by your gracious BestNet overlords.\n\nNet Neutrality inherently does not exist on ZeroNet because of this, so it can not be said to operate in a way compatible with the mantra. From each according to his ability, to each according to his needs.\n\nFood for thought ay? ;)",
				"added": 1565642174
			}
		],
		"1565641356_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 12,
				"body": "Fail. Lets take things slow and start with the basics.\n   ▲\n▲  ▲\n\n... Well, I have egg on my face ...",
				"added": 1565643964
			},
			{
				"comment_id": 14,
				"body": ".. ▲\n▲ .▲\nBest i can do. :(",
				"added": 1565644556
			}
		],
		"1565770181_1FqEEdpNCYZJfnpyNWJqE4hgXtWNu5vgz5": [
			{
				"comment_id": 15,
				"body": "SOON™",
				"added": 1565770304
			}
		],
		"1565768730_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad": [
			{
				"comment_id": 16,
				"body": "If it was done, It would just be an IP farm set up by the FBI.",
				"added": 1565770595
			}
		],
		"1565667891_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 17,
				"body": "> [gannarchism](#comment_3_1GKvSWUo9g1J3RscxqQJBrHm7ge8Pdcdb3): can't you just like, not hate people based on things they can't control?\n\nYour a long way from Kansas Toto.",
				"added": 1565770825
			}
		],
		"1565689573_1JjyvqhjWDqSncWvSoGxAGKr4SNXr1Kwpi": [
			{
				"comment_id": 18,
				"body": "Center left classical liberal. AKA. An alt right nazi apparently.",
				"added": 1565771057
			}
		],
		"1565823101_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 19,
				"body": "I would say sex with a miner is worse, as, the hole point of the law is to protect the young who; \n\nA. May not fully understand their actions.\nB. Can be easaly manipulated.\nC. Are impulsive as fuck because of their underdeveloped frontal lobe.\n\nAll of the above still applys to 13-18 year olds, and allways has and always will be true.\n\nIncest is illegal, because the point of the law is to stop genetic malformations that happen when relatives breed. however;\n\nA. We live in a world of contraception\nB. The morning after pill is their if things go wrong\nC. Can always abort as a last resort.\n\nSo, One could argue that Incest is the lesser of two evils in the modern day. Still weird as fuck though.",
				"added": 1565841037
			},
			{
				"comment_id": 20,
				"body": "PS: Now i want zerotalk to have an actual pole feature. That would be cool.",
				"added": 1565841520
			}
		],
		"1565847129_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 21,
				"body": "> [wejehteman2](#comment_19_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): keep a copy of torbrowser inside the varacrypt drive and use that to browse.\n\nThe problem with this is that the drive needs to be mounted in the system OS. The OS and Its applications such as virus scanners could leak evidence of files on the hidden drive, blowing your plausible deniability. Unless you keep on top of everything religiously and make sure files never get leaked in ways that can be under looked.",
				"added": 1565848944
			},
			{
				"comment_id": 22,
				"body": "> [223556](#comment_117_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): That's a thing? Can't you plead the fifth? lmao\n\nUnfortunately not. I want my freedom, and help others get it to. But at the same time, this tech leaves me open to transmitting offensive content over a communication network. That is something I can get done for. I'm VPN'ed Hard with a network kill switch enabled. I'm just covering all bases.",
				"added": 1565849801
			},
			{
				"comment_id": 23,
				"body": "> [mido](#comment_11_1G2nXDHaHSiL2SV5w9jy1tWddBS5EegZMw): I am using LUKS and  Secure-deletetion Toolkit now.\n\nDoes the Secure-deletetion Toolkit do \"encryption implosion\"? (that is the term im coining for key deletion methods that render a container useless even if the password is known).",
				"added": 1565891800
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 24,
				"body": "You have the right to abort, But you should pay for it.\n\nJust like how you have the right to own a TV, this does not mean the taxpayer should pay for your ability to buy one. If there is a charity that will give you one, Good for you.\n\nOnly when there is a medical necessity, should an abortion be free if a country has a National health service.\n\nCondoms and contraception I would say is valid for the state to give out for free. This is because it is a loss-leader that costs peanuts compared to the cost of the state paying for crotch goblins of young immature parents. It is also not, you know, the state paying to end a life.\n\nIt is not even that expensive. if you are not a pillock and go to your doctor ASAP,  you get a handy little pill. If you leave it to the point when they need to go in with vacuum and forceps, then, well. It just got expensive. You left it too long and that is the price your paying. \n\nOr, you know, just contact social services and let them know you want to put it up for adoption. That is free, and you will be helping a couple that can't conceive.\n",
				"added": 1565896609
			}
		],
		"1565889331_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 25,
				"body": "\"who have to be muted, which is not something I want to do as it doesn't actually block them for anyone else\"\n\nTranslation: I don't like your ideals, and the fact I can do nothing to stop you other than not interacting with you my self annoys me. REEEEE!\n\nYou have the freedom to not see or distribute their posts, And others have the right to do the same.\nBut others also have the freedom to distribute them posts as well.\n\nIn the end of the day, Why do you care? After you have muted them your not seeing or distributing their stuff any more, so you have for filled your own personal freedom and your own house is in order.",
				"added": 1565898412
			}
		],
		"1565852058_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 26,
				"body": "Being dyslexic, Edit is a godsend. No matter how many times I proofread, you can bet your ass I will still find an error later on and I'm compelled to correct it.\n\nPeople assume bad spelling = retarded, it's a fact of life I've come to terms with. But don't you dare take my edit away. It's the only thing I have. XD",
				"added": 1565899071
			}
		],
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 27,
				"body": "Tor is already bundled on windows. That is, Zero can send all traffic over the tor network. It would be good however to have \"Always Tor\" on by default, with the option to disabling it giving a pop-up that states.\n\n...Warning...\nDisabling Always Tor will expose your IP to the internet as the technology uses BitTorrent to distribute sites.\nThis will allow people to link the sites you use/host to your IP Address based on what you are seeding.\n\nWe do not recommend doing this unless you have another means of anonymizing your IP, such as a VPN or SOCKS Proxy, that you are sure is properly configured to not leak your identity.",
				"added": 1565900806
			},
			{
				"comment_id": 28,
				"body": "> [xianc78](#comment_49_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ):   Given how Linux software is installed, I don't think we can bundle Tor with the Linux bundle.\n\nCan it not just be listed as a dependency in the Repo? That is the point of apt-get is it not, to make dependency hell a thing of the past.",
				"added": 1565903674
			},
			{
				"comment_id": 29,
				"body": "> [bigbadbob](#comment_280_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj):  I would say zeronet does a pretty good job explaining it for those who pay attention.\n\nAs a rule of thumb. You don't expect people to pay attention, You try to grab it. That is why pop-up dialogues exist to say, Hay, It looks like what you are doing could end badly. Are you sure?",
				"added": 1565904168
			},
			{
				"comment_id": 30,
				"body": "> [bigbadbob](#comment_285_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I was never on 8chan but its certainly true for 4chan. Anyone who posts anything must be rawdoggin it. Every vpn i tried or tor node was banned, so i would only ever just lurk. I just assumed people who post didn't care or understand.\n\nI got a 4chan pass one year, and i could VPN and post. Haveing a pass circumvents IP block lists for posting, witch makes sense, as thay have another way to identify you even if you was VPNing onto the site. \n\nThe only thing they do ban you for then is telling others that this is a thing. I got a 8 day ban for telling someone in the VIP board about it, but it was just an IP block, so i took it as a warning. So, I just hopped onto another server on my VPN, Re-linked my pass to that IP and kept posting.\n\nBasically: This is a thing we will let you do, But we are going to say don't do it, and ask that you don't tell others to do this thing that you can do but can't. ;)",
				"added": 1565906023
			},
			{
				"comment_id": 34,
				"body": "> [eighty4](#comment_24_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): I was never on 8chan but its certainly true for 4chan. Anyone who posts anything must be rawdoggin it. Every vpn i tried or tor node was banned, so i would only ever just lurk. I just assumed people who post didn't care or understand.\n\nTo really scare them, have the following:\n\nCountry: kekistan | ISP: KekNet | IP: 550.330.550.69",
				"added": 1565909466
			},
			{
				"comment_id": 38,
				"body": "> [xianc78](#comment_53_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): Unless you can pay with crypto, it is a scam.\nYes, yes you can.\n\nhttps://www.4chan.org/pass\n\"We currently accept: Bitcoin, Bitcoin Cash, Ethereum and Litecoin.\"",
				"added": 1565915709
			}
		],
		"1565907502_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 31,
				"body": "After seeing your user name, I just thought about all the above with \"You wouldn't\" appended to the beginning.",
				"added": 1565907910
			},
			{
				"comment_id": 32,
				"body": "https://www.youtube.com/watch?v=ALZZx1xmAzg",
				"added": 1565908208
			}
		],
		"1565542665_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 33,
				"body": "Just had 2 mint lamb burgers, with buttered buns, Mayo, Ketchup, and mozzarella Cheese.\nCome at me bro.",
				"added": 1565908895
			}
		],
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 35,
				"body": "Thanks for the chuckle. XD",
				"added": 1565910380
			}
		],
		"1565885910_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 36,
				"body": "You again. I remember you was posting about how you don't want to mute people because it does not go far enough, stopping people from interacting with things you post completely. Why the change of hart there champ?",
				"added": 1565914273
			},
			{
				"comment_id": 37,
				"body": "To actually give you an answer: The site sends a mute request to the ZeroNet API. That \"animation\" from the zero icon at the top left is the ZeroNet API asking the user if you want it to execute the request.\n\nIt is done so bad zites can't just execute a shadow ban attack, spamming a bunch of user mute requests to the API without the users knowledge.",
				"added": 1565914871
			}
		],
		"1565914749_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 39,
				"body": "Can not see the ability to sticky, even though i created the group. Must only be available to the ZTO.",
				"added": 1565915911
			}
		],
		"1565913335_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 40,
				"body": "Yes. You may now leave.",
				"added": 1565916075
			}
		],
		"1565915750_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 41,
				"body": "> [xlk](#comment_55_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): image altimage altimage alt\nI can download the image, But it dose not display.\n1. #BAD#\n2. #ZeroNet Logo.svg#\n3. #Bad#",
				"added": 1565916407
			},
			{
				"comment_id": 42,
				"body": "BBS codes?",
				"added": 1565916695
			},
			{
				"comment_id": 43,
				"body": "#---------------------------------------------------------------- References ---------------------------------------------------------------#\n\n[OP][1]\n[OP][2]\n[1]:Faggot\n[2]:Still_A_Faggot\n\n```\n[OP][1]\n[OP][2]\n[1]:Faggot\n[2]:Still_A_Faggot\n```\n#--------------------------------------------------------------------- List -----------------------------------------------------------------------#\n\n- a\n- b\n- c\n\n```\n- a \n- b\n- c\n```\n\n#----------------------------------------------------------------- Num List -------------------------------------------------------------------#\n\n1. a\n2. b\n3. c\n\n```\n1. a\n2. b\n3. c\n```\n\n#----------------------------------------------------------------- Code line -------------------------------------------------------------------#\n\n`code line`\n\n``` `code line` ```\n\n#---------------------------------------------------------------- Code block ------------------------------------------------------------------#\n\n```\ncode\nblock\n```\n\n` ``` `\n`code`\n`block`\n` ``` `\n#--------------------------------------------------------------------- Link -----------------------------------------------------------------------#\n\n[link](http://youaregay.com/)\n\n```\n[link](http://youaregay.com/)\n```\nYes, that is actually a working site.\n\n#---------------------------------------------------------------- Formatting ------------------------------------------------------------------#\n\n# H1\n_italic_\n**bold**\n~~strikethrough~~\n\n--- \n\n```\n# H1\n_italic_\n**bold**\n~~strikethrough~~\n---\n^Horizontal rule\n```\n\n\n",
				"added": 1565916801
			}
		],
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 44,
				"body": "# _**BOOM BABY!**_",
				"added": 1565922733
			},
			{
				"comment_id": 45,
				"body": "[test][1]\n[1]:?Topic:1565880498_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN/SOPA+is+back+WhiteHouse+drafty+to+censor+internet+feat+Ajit+Pai#comment_23_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL",
				"added": 1565923528
			},
			{
				"comment_id": 46,
				"body": ">test\n>> test\n\nWhat... Thats new.\n&gt;\n&gt;\n&gt;\n>test",
				"added": 1565924030
			},
			{
				"comment_id": 48,
				"body": "```\n> can't meme text.\n> gives up.\n> use's code block.\n> feels bad man.\n```\n&gt; finds way to meme text.\n&gt; works like a charm.\n&gt; feels good man.\n\nOh. and if your here because you clicked the comment jump, click [here][1] to get back to where you was.\n[1]:#_-you-can-use-this-to-do-comment-element-jumping-_\n",
				"added": 1565926471
			},
			{
				"comment_id": 56,
				"body": "> [eighty4](#comment_29_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): Also you can use the & gt; entity (without the space)\n\nThanks for that, Also found this does not make the forum engine double the newline space.",
				"added": 1565980463
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 51,
				"body": "# _**OP is a [faggot][1]**_\n[1]:#topic_1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5",
				"added": 1565933980
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 52,
				"body": "Good bye... https://youtu.be/N_dUmDBfp6k?t=110",
				"added": 1565936487
			},
			{
				"comment_id": 53,
				"body": "> [bigbadbob](#comment_289_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Will this thread disappear if he actually uninstalls?   I for one will miss all the hilarious posts:) He called us cunts. lol\n\n\nIt is on your PC, It is on my PC, its on all our PC's. As long as all the people that saw his shit keep seeding, it is on here forever.",
				"added": 1565936700
			},
			{
				"comment_id": 55,
				"body": "> [redlibertyreal](#comment_55_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): making racist, small-penis, insecure terrorist types too stupid to know basic opsec harder to track now that their slightly smarter racist friends showed them how to use ZeroNet with Tor.\n\nYou haven't really been around the chans have you? Its all just edgy shitposting. Is hilarity through vulgarness for vulgarness sake. It's humor derived from being a caricature of humanity's worst. The wider population do not get this. This is why a man was prosecuted in the UK for making his dog do a Nazi solute to \"gas the Jews\" as a joke.\n\nBecause they are misfits and miss understood, nobody in the everyday population care to dig deeper. so, they just take what they are tolled and save the energy of further mental processing. They have other stuff to do after all, and don't have the time to look into something they already think is packed and categorized correctly, and ultimately, don't care about.\n\nThis is why the chan refugees are here. The establishment don't get it, Just how it didn't get rock, metal, goth, vidiogames, atheists, homosexuals etc. in the past. Remember when Marilyn Manson was blamed for columbine? It's all the same thing. The wider hole needed an easy scapegoat, so they point to a micro culture that on the outside looks \"Evil\" and call it a day. \n\n",
				"added": 1565978632
			},
			{
				"comment_id": 57,
				"body": "> [aspidochelone](#comment_88_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): There are some definite comic fascists, genuine fascists, and people I can't figure.\n\nThe majority are having a joke. It's a small minority that are actually real racists, that, in an act of irony, think there being taken seriously. In actuality, they are just another punchline in the act. Poetic really, when you think about it.",
				"added": 1565982726
			},
			{
				"comment_id": 58,
				"body": "> [xcape2net](#comment_318_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): May I remind you that 8Chan people did NOT create ZeroNet?\n\nSo... The point is that this is a free platform that is resistant to censorship. Your getting the refugees that lost there home to censorship. As far as i'm concerned, The platform is doing its intended function. Don't take them too seriously, they don't expect you too.\n\nlooking over at /tech/ on the 08chan board, They are trying to also help out. Just give it time, and things will calm down.",
				"added": 1565983500
			},
			{
				"comment_id": 59,
				"body": "\n> [xcape2net](#comment_319_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Agreed.  And I've never suggested that anyone leave.  I just want the 8Chan people to realize that they are not the only ones here or entitled to be here.  They have no right to start telling the rest of us to leave.\n\nWhat would help is if zero talk had better categorization. Then things would naturally filter on there own. There are groups. But they are not really given much weight on the platform.",
				"added": 1565983955
			}
		],
		"1565966684_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 54,
				"body": "why ripple? I thought that was a network that was made primarily for banks and payment providers.",
				"added": 1565976351
			}
		],
		"1565927048_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 60,
				"body": "        ▲\n▲  ▲ It ain't a triforce if its not perfect.",
				"added": 1566000398
			}
		]
	},
	"comment_vote": {
		"3_1A66iTtvyEopuCML2LGYZMN56dUf9ppLYY": 1,
		"4_1LqBmfU8v7MjQWdX8veLtbXuqmDvACw4vM": 1,
		"13_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": 1,
		"41_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"24_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"996_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"33_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"995_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"288_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"49_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1,
		"139_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	}
}