{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1631126622,
			"title": "This Russian author died years ago - but I still seed his zites.",
			"body": "http://127.0.0.1:43110/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/?page=3\nhttp://127.0.0.1:43110/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/\nhttp://127.0.0.1:43110/18ZaNRBjjZSxV38omZS5tu3ngNExnRYxxA/\nhttp://127.0.0.1:43110/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/\n\nSome very good insights on the Russian mindset and the turmoil they endured when the Soviet Union collapsed.\n\nMight offer some guidance for what is ahead.....\n\nDon't know the cause of his death but he left wife and children behind. If his wife knew about these zites - she either chose never to take them down or she had no access to the signing keys. \n\n\"Balancer\" zites are probably THE best example of ZeroNet's potential for uncensorable and enduring knowledge. Might be a reason for any normie to take a look at this simple but robust technology.\n\nI only hope that if nofish loses interest in Zeronet - he'll find ways to decentralize it even more. So it won't need support through the ages.",
			"added": 1631126621
		}
	],
	"topic_vote": {
		"1631126622_1ATSif8GHYZiSgFWpQQ4dijmhV6iJyf4v7": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "ZeroID just worked for me.",
				"added": 1630905364
			}
		],
		"1630944991_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 2,
				"body": "I'm puzzled. Zeronet on Ubuntu really is a stand alone app without any transport. It gains Tor transport only after the Tor browser is opened (using it's proxy). So if the Tor browser is already compatible with V3 onions, why wouldn't Zeronet?",
				"added": 1630950446
			}
		],
		"1630039559_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 3,
				"body": "Me too.\n\nFear whites do all the fighting - while Jews and Niggers clean up all the government gibs. Have any idea how much these worthless troops REALLY cost the public? If the public ever grasped just how badly they were being taken - many in the military would be hanging from lamp posts.",
				"added": 1630951164
			}
		],
		"1631126622_1ATSif8GHYZiSgFWpQQ4dijmhV6iJyf4v7": [
			{
				"comment_id": 4,
				"body": "> [gitcenter](#comment_1555_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Stroke, ventilator, pneumonia... Rest in peace, KRoN.\n\nThanks for taking the time to explain what happened to him.",
				"added": 1631547092
			},
			{
				"comment_id": 5,
				"body": "> [robione](#comment_669_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Why not transfer the zites to clones you have keys for to manage/update, etc?\n\nOut of respect - you leave it alone and just seed. He's dead. There are no updates. His original effort stands as intended and will remain standing until no one chooses to seed his sites.\n\nZeronet may prove it's mettle for long term preservation. It will be tested by time.",
				"added": 1631547432
			}
		]
	},
	"comment_vote": {}
}