{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "O capitalismo vai devorar a democracia, a menos que nos pronunciemos",
			"body": "Você já se perguntou por que os políticos não são mais o que costumavam ser, por que os governos parecem incapazes de resolver problemas reais? O economista Yanis Varoufakis, ex-ministro das Finanças da Grécia, diz que é porque pode-se estar na política hoje, sem estar no poder, pois o verdadeiro poder agora pertence àqueles que controlam a economia. Ele acredita que os mega-ricos e as corporações estejam canibalizando a esfera política, causando uma crise financeira. Nesta palestra, testemunhe o sonho dele para um mundo no qual o capital e o trabalho não lutam mais um contra o outro, \"um mundo que é, simultaneamente, libertário, marxista e keynesiano\". \n\n- https://download.ted.com/talks/YanisVaroufakis_2015G-480p-pt-br.mp4",
			"added": 1527560376
		},
		{
			"topic_id": 2,
			"title": "bitcoins",
			"body": "#Bitcoins\n\n- https://privatebin.net/?827ec808cf66addc#am5XqNMRsYl16UxbWGboNQQTV8W4BNm5FouRrNLPvxo=",
			"added": 1527562395
		}
	],
	"topic_vote": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_12U1Hmmg3QABcs245rgVZoRPPvj6jcgfr5": 1,
		"1_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"2_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1
	},
	"next_comment_id": 42,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#ELETRICIDADE E MAGNETISMO\n- https://web.archive.org/web/20180528162537/http://www.villate.org/doc/fisica2/fisica2_20120908.pdf",
				"added": 1527525735
			},
			{
				"comment_id": 2,
				"body": "#COMPRIMENTO E TEMPO DE PLANCK\n- https://web.archive.org/web/20180528164721/https://ipfs.io/ipfs/QmTCN1ShtGNvPgp1ciqKV2SoyX5uYpfTM4L3X4BHE78mFs",
				"added": 1527526098
			},
			{
				"comment_id": 3,
				"body": "#Gravitação quântica\n\n- https://arxiv.org/abs/gr-qc/0410054\n- https://arxiv.org/abs/hep-th/0310077\n- http://arxiv.org/abs/gr-qc/9411005v1",
				"added": 1527526671
			},
			{
				"comment_id": 4,
				"body": "#Teoria das cordas\n- http://superstringtheory.com/index.html\n- https://en.wikipedia.org/wiki/String_theory\n- https://web.archive.org/web/20180528175727/http://www.damtp.cam.ac.uk/user/mbg15/superstrings/superstrings.html\n- https://web.archive.org/web/20100108090009/http://omnis.if.ufrj.br/~braga/cordas.html",
				"added": 1527530779
			},
			{
				"comment_id": 5,
				"body": "#A entropia de Hawking para buracos negros - Revista Brasileira de Ensino de Física\n- https://web.archive.org/web/20180528180835/http://www.sbfisica.org.br/rbef/pdf/070703.pdf",
				"added": 1527530988
			},
			{
				"comment_id": 9,
				"body": "#Do Big Bang ao Universo Eterno\n- https://youtu.be/W21s-blOskY",
				"added": 1527534618
			},
			{
				"comment_id": 11,
				"body": "#O começo do tempo - Stephen Hawking\n- https://web.archive.org/web/20180528072101/http://www.hawking.org.uk/the-beginning-of-time.html",
				"added": 1527535244
			},
			{
				"comment_id": 14,
				"body": "#Singularidades e Buracos Negros\n- https://plato.stanford.edu/entries/spacetime-singularities/#",
				"added": 1527537511
			},
			{
				"comment_id": 16,
				"body": "#Laser\n- Parte 1: http://www.archive.org/download/MITRES.6.005/understanding-1_300k.mp4\n- Parte 2: http://www.archive.org/download/MITRES.6.005/understanding-2_300k.mp4\n- Parte 3: http://www.archive.org/download/MITRES.6.005/understanding-3_300k.mp4\n- Parte 3 (cont.): http://www.archive.org/download/MITRES.6.005/understanding-4_300k.mp4\n\n#Fibra ótica\n- http://www.archive.org/download/MITRES.6.005/understanding-5_300k.mp4",
				"added": 1527544880
			},
			{
				"comment_id": 17,
				"body": "#Teletransporte\n- https://web.archive.org/web/20180528220315/https://fas.org/sgp/eprint/teleport.pdf",
				"added": 1527545464
			},
			{
				"comment_id": 18,
				"body": "#Biblioteca Física\n- https://sechat.blog/bibiogr-fisica/\n\n#4 livros de Física para o Ciclo Básico - #sechatexpresso - Sechat\n- https://youtu.be/DZOR76H0l0Y",
				"added": 1527545537
			},
			{
				"comment_id": 20,
				"body": "#Teoria Quântica I\n- https://web.archive.org/web/20180528231830/https://ocw.mit.edu/ans15436/ZipForEndUsers/8/8-321-fall-2017/8-321-fall-2017.zip",
				"added": 1527548796
			},
			{
				"comment_id": 34,
				"body": "#O mecanismo gravitacional para gerar massa\n\nO objetivo deste trabalho é mostrar que a interação gravitacional é capaz de gerar massa para todos os corpos. A condição para isso é a existência de uma distribuição de energia representada pelo vácuo ou pela constante cosmológica.\n\n- https://web.archive.org/web/20180529040144/http://www.marionovello.com.br/wp-content/uploads/2016/01/gravitational-origin-of-mass.pdf",
				"added": 1527566676
			},
			{
				"comment_id": 35,
				"body": "#Superstrings - Cordas Cósmicas \n- https://web.archive.org/web/20180529040738/http://astro.if.ufrgs.br/univ/string/string.htm",
				"added": 1527566963
			},
			{
				"comment_id": 36,
				"body": "#O mundo como holograma\nRaphael Bousso da UC Berkeley apresenta uma introdução amigável às idéias por trás do princípio holográfico, que pode ser muito importante na busca por uma teoria da gravidade quântica.\n- https://youtu.be/GHgi6E1ECgo",
				"added": 1527567018
			},
			{
				"comment_id": 37,
				"body": "#Hiperespaço – Michio Kaku\nHiperespaço – Michio Kaku é um dos pioneiros da teoria das supercordas e está na linha de frente dessa verdadeira revolução na física moderna. Muitos cientistas proeminentes acreditam que a teoria desvendará algumas das mais intrigantes questões de nossos tempos, como as origens do universo, os buracos negros e as viagens no tempo. Hiperespaço transmite ao público a vitalidade das pesquisas e o entusiasmo dos cientistas ao deparar com o sentido de espaço e tempo.\n\n- https://web.archive.org/web/20180529041712/https://ipfs.io/ipfs/QmeTqsqkzUqnPnPewKBbYwAqLbRVww5DU95twhcXwsoCiJ",
				"added": 1527567556
			},
			{
				"comment_id": 38,
				"body": "#A Consciência e o Hiperespaço \n- https://web.archive.org/web/20180529041944/http://www.metaconsciencia.com/artigos/files/Artigo_15.pdf",
				"added": 1527567733
			},
			{
				"comment_id": 39,
				"body": "#Uma nova história do tempo – Stephen Hawking\n Contribuição revigorante à literatura científica, esse livro explica de forma mais clara e pausada os principais conceito abordados no best-seller mundial Uma breve história do tempo , além de registrar os últimos progressos na busca por uma teoria unificada de todas as forças da física. As respostas dadas pelo professor Hawking e seu colaborador Mlodinow iluminam as mais importantes questões sobre a natureza do espaço e do tempo, o papel de Deus na criação e a história e o futuro do universo. \n\n- https://web.archive.org/web/20180529044110/https://ipfs.io/ipfs/QmQcJptUWsibunYeNAiUTLRtutjB1sue7iW8Z4a9qSskUu",
				"added": 1527568968
			},
			{
				"comment_id": 40,
				"body": "#O que é Informação Quântica?\n- https://youtu.be/tFYksiTND2w",
				"added": 1527569047
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 6,
				"body": "#Teoremas da incompletude de Gödel\n\n- https://web.archive.org/web/20180528181542/http://im.ufrj.br/~risk/diversos/godel.html\n- https://www.youtube.com/watch?v=O4ndIDcDSGc\n- https://www.youtube.com/watch?v=jDyra0RH-Xs\n- https://www.youtube.com/watch?v=s_4Rq141_-A",
				"added": 1527534411
			},
			{
				"comment_id": 7,
				"body": "#História: O Teorema da Incompletude de Kurt Gödel\n- https://youtu.be/drtipYgbT-s",
				"added": 1527534460
			},
			{
				"comment_id": 8,
				"body": "#Geometria euclidiana\n- https://web.archive.org/web/20180528183357/http://w3.impa.br/~arss/cursos/GEP/Geometria%20Euclidiana%20Plana.pdf\n- https://web.archive.org/web/20180528183259/http://www.dca.fee.unicamp.br/courses/IA841/2s2006/notas/cap2.pdf\n- https://web.archive.org/web/20180528183227/http://www.ime.unicamp.br/~jardim/ma620/ma620aula23.pdf",
				"added": 1527534473
			},
			{
				"comment_id": 10,
				"body": "#Introdução à Teoria dos Grafos\n- https://www.youtube.com/playlist?list=PLrVGp617x0hAm90-7zQzbRsSOnN2Vbr-I",
				"added": 1527534707
			},
			{
				"comment_id": 19,
				"body": "#e: A história de um número – Eli Maor\n- https://web.archive.org/web/20180528223305/https://ipfs.io/ipfs/QmP1cwJtymx5inMeNTR1UEiupPxJ6YrNzM8wGy9yj6BDdm",
				"added": 1527546860
			},
			{
				"comment_id": 21,
				"body": "#Teoria dos números I\n- https://web.archive.org/web/20180528231459/https://ocw.mit.edu/ans15436/ZipForEndUsers/18/18-785-fall-2017/18-785-fall-2017.zip",
				"added": 1527548871
			},
			{
				"comment_id": 22,
				"body": "#A função zeta de Riemann e o teorema dos números primos (PDF)\n- https://web.archive.org/web/20180528231020/https://ocw.mit.edu/courses/mathematics/18-785-number-theory-i-fall-2017/lecture-notes/MIT18_785F17_lec16.pdf\n- https://web.archive.org/web/20180528231322/https://ocw.mit.edu/courses/mathematics/18-785-number-theory-i-fall-2017/assignments/MIT18_785F17_Pset8.pdf",
				"added": 1527549252
			},
			{
				"comment_id": 23,
				"body": "#Introdução à Ciência da Computação e Programação em Python\n\n- https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-0001-introduction-to-computer-science-and-programming-in-python-fall-2016/index.htm",
				"added": 1527549989
			},
			{
				"comment_id": 24,
				"body": "#Inteligência artificial\n- https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-034-artificial-intelligence-fall-2010/index.htm",
				"added": 1527550252
			},
			{
				"comment_id": 25,
				"body": "#Introdução aos Algoritmos\n- https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/index.htm",
				"added": 1527550325
			},
			{
				"comment_id": 26,
				"body": "#Introdução ao C e C ++\n- https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-s096-introduction-to-c-and-c-january-iap-2013/index.htm",
				"added": 1527550537
			},
			{
				"comment_id": 41,
				"body": "#Matemática para todos.\n- https://www.youtube.com/playlist?list=PLfxAEzZ3mo8abKPw9TjCViZT_ViD6RZEJ",
				"added": 1527569082
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 12,
				"body": "#Pois, que adiantará ao homem ganhar o mundo inteiro e perder a sua alma? Ou, o que o homem poderá dar em troca de sua alma?\n- Mateus 16:26",
				"added": 1527536230
			},
			{
				"comment_id": 13,
				"body": "#O Trivium na Perspectiva Bíblica  \n- https://web.archive.org/web/20180528192852/http://www.monergismo.com/textos/educacao/trivium-perspectiva-biblica_randy-booth.pdf",
				"added": 1527537091
			},
			{
				"comment_id": 28,
				"body": "#O Sermão da Montanha – As Beatitudes\n“E Jesus, vendo a multidão, subiu a um monte, e, assentando-se, aproximaram-se dele os seus discípulos; E, abrindo a sua boca, os ensinava, dizendo:\nBem-aventurados os pobres de espírito, porque deles é o reino dos céus;\nBem-aventurados os que choram, porque eles serão consolados;\nBem-aventurados os mansos, porque eles herdarão a terra;\nBem-aventurados os que têm fome e sede de justiça, porque eles serão fartos;\nBem-aventurados os misericordiosos, porque eles alcançarão misericórdia;\nBem-aventurados os limpos de coração, porque eles verão a Deus;\nBem-aventurados os pacificadores, porque eles serão chamados filhos de Deus;\nBem-aventurados os que sofrem perseguição por causa da justiça, porque deles é o reino dos céus;\nBem-aventurados sois vós, quando vos injuriarem e perseguirem e, mentindo, disserem todo o mal contra vós por minha causa” (Mateus 5: 1 – 11) \n\n- Conheça um pouco mais sobre este importante sermão!\n\n#“Bem-aventurados os pobres de espírito, porque deles é o reino dos céus”\n\nAs pessoas ao ouvirem: “Bem-aventurados…”, logo fizeram conexão com algumas das citações bíblicas. Será que Ele comentará um dos Provérbios? Será que ele citou Salmos? Ou a abordagem dele será extraída da lei?\n\nA bem-aventurança é um tema que prendeu a atenção dos ouvintes de Jesus e em nossos dias ainda cria expectativa nos leitores. Afinal, quem não quer ser bem-aventurado?\n\nQuando Jesus complementa: “Bem-aventurados OS POBRES…” a mensagem toca ainda mais os ouvintes. Esta seria uma mensagem inesquecível, pois tocou a emoção do povo: “Será uma revolução social? É agora que alcançaremos a hegemonia política e a paz prometida?”.\n\nA promessa de alegria aos pobres é plenamente compreensível, mas o que entender do qualificativo adicionado ao substantivo pobre? “Bem-aventurados os pobres de espírito…”. Quem são os pobres de espírito?\n\nJesus estava rodeado de pobres de várias cidades circunvizinhas. Se a mensagem fosse somente: ‘bem-aventurados os pobres’, ela seria aceita e ovacionada pela multidão! Jesus teria conquistado os seus ouvintes e mais seguidores. Mas, como um povo que professava ‘a melhor’ religião, com princípios éticos e morais intocáveis e que se consideravam filhos de Abraão poderia aceitar ou reconhecer ser um ‘pobre de espírito’?\n\nComo alguém observador da lei reconheceria a condição de pobreza espiritual?\n\nNo Antigo Testamento não consta o conceito ‘pobre de espírito’. Mas, Aquele que representava uma esperança de mudança na condição do povo, apresenta um novo conceito e uma necessidade de reconhecer uma condição que caracteriza os pecadores ou os incircuncisos. Como um filho de Abraão poderia reconhecer que era pobre de espírito?\n\nJesus completou a frase: “…porque deles é o reino dos céus”. Muitos se perguntaram: De quem é o reino dos céus? Dos pobres de espírito?\n\nAlém do mais, o povo estava a procura de curas, de pães, de peixes, de um reino terreno, mas Jesus estava falando de um outro reino: do reino dos céus!\n\nOnde fica este reino? O que é o reino dos céus?\n\nPara responder essas perguntas devemos observar a mensagem que foi anunciada desde o nascimento de Cristo: “E, naqueles dias, apareceu João batista pregando no deserto da Judeia, e dizendo: Arrependei-vos, porque é chegado o reino dos céus” ( Mt 3:1 -2); “Desde então começou Jesus a pregar, e a dizer: arrependei-vos, porque é chegado o reino dos céus” Mt 4: 17.\n\nVerifica-se que o reino dos céus diz da pessoa de Cristo, como profetizou Isaías e reafirmou João Batista: “Porque este é o anunciado pelo profeta Isaías, que disse: Voz do que clama no deserto: Preparai o caminho do Senhor, endireitai as suas veredas” ( Mt 3:3 ).\n\nQuando Jesus disse: “Bem-aventurados os pobres de espírito, porque deles é o reino dos céus”, Ele não estava denunciando a moral do povo. Ele não estava apregoando um reino humano ( Jo 18:36 ). Também não estava em busca de uma melhoria na condição socioeconômica do povo ( Jo 12:8 ). Antes Jesus estava se apresentando ao povo por parábolas.\n\nCom a sua mensagem, Jesus expôs ao povo que Ele é o acesso ao reino dos céus, e que todos aqueles que reconhecessem que eram pobres de espírito, estes seriam bem-aventurados. Àqueles que reconhecessem a precária condição espiritual que se encontravam, pertenciam o reino dos céus, que é Cristo. Eles precisavam reconhecer que eram necessitados espiritualmente.\n\nEnquanto queriam pão, Jesus estava apresentado o pão vivo que desceu dos céus. Enquanto buscavam um reino, Jesus estava lhes abrindo a porta do reino dos céus. A relutância em aceitar a condição de necessitados espiritualmente persistiu até mesmo entre os discípulos que criam nele: “Responderam eles (os judeus que criam nele): somos descendentes de Abraão, e jamais fomos escravos de ninguém” ( Jo 8:31 -33).\n\nEles acreditavam estar abastados espiritualmente por serem descendentes de Abraão. Ao se auto proclamarem como filhos de Abraão, os judeus estavam cônscios de que eram filhos de Deus ( Jo 8:41 ). Ser filho de Abraão para eles era o mesmo que ter a filiação divina. Por isso João Batista disse que das pedras Deus poderia fazer filhos para si. Em razão desta crença os judeus não admitiam que eram escravos de ninguém, uma vez que se admitissem ser escravos, era o mesmo que admitir que alguém havia conquistado o próprio Deus ( Jo 8:33 ).\n\n \n#“Bem-aventurados os que choram, porque eles serão consolados”\n\nO sermão prossegue: “Bem-aventurados OS QUE CHORAM…”. A bem-aventurança depende da emoção humana? O choro como conseqüência direta de uma emoção humana concede o favor de ser consolado?\n\nNão! A ideia apresentada neste versículo complementa a anterior.\n\nO choro denota a condição de impotência frente a questões impossíveis. Após reconhecer a condição de miserabilidade espiritual, a reação do homem é o choro.\n\nA única ação de um miserável é o choro, e serão consolados!\n\nPara que o abatido seja consolado, é preciso que habite com alguém que lhe arranque da miséria: “Porque assim diz o Alto e o Sublime, que habita na eternidade, e cujo nome é Santo: Num alto e santo lugar habito; como também com o contrito e abatido de espírito, para vivificar o espírito dos abatidos, e para vivificar o coração dos contritos” ( Is 57:15 ; Sl 51:17 ).\n\nCompare:\n\n“Bem-aventurados os pobres de espírito, porque deles é o reino dos céus” ( Mt 5:3 ).\n\n“…como também com o contrito e abatido de espírito, para vivificar o espírito dos abatidos, e para vivificar o coração dos contritos” ( Is 57:15 ).\n\nO salmista quando pedia perdão ao Senhor disse: “Cria em mim, ó Deus, um coração puro, e renova em mim um espírito reto” ( Sl 51:10 ).\n\nQuem haveria de consolar os que choram? Os que choram serão consolados por Aquele que tem o reino dos céus. É Ele que enxugará todas as lágrimas!\n\nA resposta está em Isaias: “O espírito do Senhor DEUS está sobre mim; porque o SENHOR me ungiu, para pregar boas novas aos mansos; enviou-me a restaurar os contritos de coração, a proclamar liberdade aos cativos, e a abertura de prisão aos presos; A apregoar o ano aceitável do SENHOR e o dia da vingança do nosso Deus; a consolar todos os tristes” ( Is 61:1 -2).\n\n \n#“Bem-aventurados os mansos, porque eles herdarão a terra”\n\nA mensagem de Jesus possivelmente formou um impasse na mente dos ouvintes: Moisés, o homem mais manso da terra não conseguiu herdar a terra, como herdar a terra se os ouvintes não se consideravam maiores que Moisés “E era o homem Moisés mui manso, mais do que todos os homens que havia sobre a terra” ( Nm 12:3 ).\n\nSe Moisés, considerado um dos homens mais manso da terra, não conseguiu herdar a terra, qual a intenção de Jesus ao declarar que os mansos são felizes?\n\nMas a pergunta persiste: Quem são os mansos? Qual é a terra a se herdar?\n\n“E os mansos terão gozo sobre gozo no SENHOR; e os necessitados entre os homens se alegrarão no Santo de Israel” ( Is 29:19 ).\n“Os mansos comerão e se fartarão; louvarão ao SENHOR os que o buscam; o vosso coração viverá eternamente” ( Sl 22:26 ).\n“Mas os mansos herdarão a terra, e se deleitarão na abundancia de paz” ( Sl 37:11 ).\n\nÀ exemplo do Antigo Testamento as bem-aventuranças decorre do Senhor de Israel, mas, como alcançar tamanha alegria e ainda herdar a terra? E qual terra?\n\nJesus é a resposta: “Tomai sobre vós o meu jugo, e aprendei de mim, que sou manso e humilde de coração; e encontrareis descanso para as vossas almas” ( Mt 11:29 ).\n\n“Bem-aventurados os mansos, porque eles herdarão a terra;”\n\n“….aprendei de mim, que sou manso e humilde de coração; e encontrareis descanso para as vossas almas”\n\nObserve a relação entre os dois versículos: aqueles que se deixarem instruir por Jesus, o Mestre por excelência, estes serão felizes por alcançar o prometido, descanso para as almas. Estes serão bem-aventurados por alcançar o prometido: a promessa de herdar a terra equivale ao descanso para a alma para aqueles que se deixarem instruir.\n\nQuando Jesus falou ‘bem-aventurados os mansos, porque eles herdarão a terra’, não foi com o intuito de concitar os ouvintes a que tivessem uma personalidade semelhante ou superior a de Moisés.\n\nA mansidão que Jesus faz referência não é comportamental, antes é a mansidão vinculada ao coração, ou a nova natureza do homem. Após o homem aprender de Jesus haverá uma transformação na natureza do homem, e estes receberão a plenitude de Cristo, e serão semelhantes a Ele: mansos e humildes de coração ( Cl 2:10 ).\n\nQuando Jesus afirmou que os mansos herdarão a terra, Ele não fez referência a elementos deste mundo, mas ao descanso preparado por Deus. A ‘terra’ representa um lugar de descanso que Deus preparou para os que aprenderem daquele que é por excelência manso de coração “Ora, nós, os que temos crido, entramos no descanso…” ( Hb 4:3 -10).\n\nA terra prometida no Antigo Testamento estava atrelada a ideia de descanso, e no Novo Testamento a referência a terra diz de coisas melhores: do descanso de Deus. Aqueles que aprenderem com Cristo, estes terão descanso para as suas almas.\n\nAquele que encontra descanso para a sua alma em Cristo não receberá como herança um torrão de terra, antes será herdeiro de novos céus e nova terra “Mas nós, segundo a sua promessa, aguardamos novos céus e nova terra, em que habita a justiça” ( 2Pe 3:13 ).\n\nO apóstolo Pedro ao referir-se aos mansos de coração, não fala do homem natural, mas daquele homem que não conseguimos visualizar, aquele ‘encoberto no coração’, do homem regenerado, que possui um incorruptível traje de um espírito manso e quieto “Mas o homem encoberto no coração; no incorruptível traje de um espírito manso e quieto, que é precioso diante de Deus” ( 1Pe 3:4 ).\n\nO que é precioso diante de Deus? O que possui valor para com Deus? Segundo o apóstolo Paulo o que tem valor, o que tem virtude diante de Deus, é o ser uma nova Criatura: “Porque em Jesus Cristo nem a circuncisão nem a incircuncisão tem valor algum; mas sim a fé que opera pelo amor” ( Gl 5:6 ); “Porque em Cristo Jesus nem a circuncisão, nem a incircuncisão tem virtude alguma, mas sim o ser uma nova criatura” ( Gl 6:15 ).\n\nComo a fé ‘vem pelo ouvir’, e o ‘ouvir pela palavra de Deus’, quando Jesus diz que devemos aprender dele, é porque o seu ensino produz fé que faz os seus ouvintes alcançar uma nova vida com direito a ser herdeiro com Cristo. Como Cristo descansou de suas obras, como herdeiros de Deus, os de novo gerado alcançam a bem-aventurança.\n\nAtravés da regeneração o homem adquire a natureza de Cristo, ou seja, é gerado segundo Deus um novo homem em verdadeira justiça e santidade, características pertinentes a pessoa de Cristo. Somente através do novo nascimento o homem torna-se humilde e manso de coração.\n\n \n#“Bem-aventurados os que têm fome e sede de justiça, porque eles serão fartos”\n\nPercebe-se que Jesus não estava se referindo à justiça que é administrada nos tribunais dos homens! A abordagem de Jesus em momento algum teve objetivos político. Jesus não estava preocupado com os problemas atrelados as injustiças sociais. Jesus não estava promovendo mais uma obra de caridade.\n\nEm momento algum Jesus expôs os princípios anunciados pela teologia da libertação em que a prática de justiça esteja atrelada a transformações de ordem econômicas, social e políticas. Em momento algum Jesus demonstra que a bem-aventurança dependa de transformações sociais ou que se fundamenta nas relações sociais.\n\nJesus não estava promovendo diretamente a prática da fraternidade, o equilíbrio nas relações no exercício do poder ou incentivando a partilha de bens no intuito de equilibrar a distribuição de riquezas.\n\nNão! O sermão do monte trata de questões eminentemente espirituais.\n\nSe Jesus estivesse promovendo a solidariedade humana como requisito para se alcançar a verdadeira alegria, ele não teria protocolado um veemente protesto aos seus ouvintes: “Porque vos digo que, se a vossa justiça não exceder a dos escribas e fariseus, de modo nenhum entrareis no reino dos céus” ( Mt 5:20 ).\n\nVocê já observou o conceito dos fariseus e dos escribas frente a multidão? Para o povo os fariseus e os escribas eram o que a sociedade tinha de melhor. Porém, a análise de Cristo é diferente: “Assim também vós exteriormente pareceis justos aos homens, mas interiormente estais cheios de hipocrisia e de iniqüidade” ( Mt 23:28 ).\n\nOs religiosos pareciam justos, mas a natureza deles era incompatível com a divina: estavam plenos de iniqüidade.\n\nComo seria possível as obras dos ouvintes de Jesus alcançar uma posição maior em relação aos fariseus e saduceus? Como entender o ter fome e sede de justiça? Onde os ouvintes de Jesus encontrariam fartura de justiça?\n\nSe conseguirmos responder a estas perguntas, estaremos bem próximo de entender todos os conceitos apresentados por Jesus no sermão do monte.\n\nJesus não se ocupou em estabelecer um novo padrão de conduta para os seus ouvintes. Também não foi oferecido felicidade e alegria com base nas emoções e motivações humanas.\n\nA felicidade do homem neste mundo envolve outros aspectos e não está vinculado ao que Cristo apregoou no sermão do monte “Porque quem quer amar a vida, e ver os dias bons, refreie a sua língua do mal, e os seus lábios não falem engano. Aparte-se do mal, e faça o bem; Busque a paz, e siga-a” ( 1Pd 3:10 -11).\n\nSe alguém procura a felicidade deste mundo, basta seguir o que disse o apóstolo Pedro, ao citar o ( Sl 34:12 -14). Basta ter uma vida correta diante da sociedade que o homem terá uma vida tranqüila e sossegada em muitos aspectos.\n\nO que Jesus oferece através das bem-aventuranças vai além das perspectivas humanas e não se refere a este mundo. A missão de Jesus é resgatar os pobres de espírito, sem qualquer referência aos valores humanos, personalidade, caráter, moral, etc. Todos estes elementos sofrem transformações ao longo do tempo, e difere de sociedade para sociedade.\n\nOs valores de hoje são totalmente diferentes dos valores de cem anos atrás. O caráter e a moral sofreram transformações e se adequou a sociedade moderna. Se a salvação estivesse apoiada nestas questões circunstanciais, qual seria o padrão correto de conduta nestes séculos de história da igreja?\n\nJesus não apoiou a sua doutrina no homem ou em seus méritos. A doutrina de Jesus não faz acepção de pessoas, de condição social, de épocas ou de cultura. A mensagem de Jesus é a mesma para os pobres e para os ricos. Ambos precisam reconhecer a miséria espiritual que se encontram.\n\nTodos os homens precisam arrependerem-se e o primeiro passo está em reconhecer a condição de miséria espiritual e a necessidade de socorro divino. Todos os homens estavam mortos em delitos e pecados, sem qualquer distinção entre eles.\n\nA próxima bem-aventurança anunciada por Jesus encera um desejo de mudança. Diante da condição de miséria espiritual, quando o homem reconhece a sua real condição, resta somente o choro, e a obra a ser realizada para mudar este quadro fica na dependência de Deus.\n\nAqueles que se deixam instruir por Jesus, o manso e humilde de coração, livram-se da condição de miséria espiritual conforme foi apregoado tempos depois “Jesus dizia, pois, aos judeus que criam nele: Se vós permanecerdes na minha palavra, verdadeiramente sereis meus discípulos. E conhecereis a verdade, e a verdade vos libertará” ( Jo 8:31 -32).\n\n \n#“Bem-aventurados os que têm fome e sede de justiça, porque eles serão fartos”\n\nAinda persistem as perguntas: Como ter fome e sede de justiça? Onde encontrar fartura de justiça? A resposta para estas perguntas nos fará compreender melhor os conceitos apresentados por Jesus no sermão do monte.\n\n“Ó VÓS, todos os que tendes sede, vinde às águas, e os que não tendes dinheiro, vinde, comprai, e comei; sim, vinde, comprai, sem dinheiro e sem preço, vinho e leite. Por que gastais o dinheiro naquilo que não é pão? E o produto do vosso trabalho naquilo que não pode satisfazer? Ouvi-me atentamente, e comei o que é bom, e a vossa alma se deleite com a gordura. Inclinai os vossos ouvidos, e vinde a mim; ouvi, e a vossa alma viverá; porque convosco farei uma aliança perpétua, dando-vos as firmes beneficências de Davi” ( Is 55:1 -3).\n\nO paradoxo perdura: Diante de uma multidão faminta e sedenta Jesus declara que aqueles que têm fome e sede são felizes. As necessidades básicas dos ouvintes de Jesus eram evidentes. Porém, Jesus não se atem a problemática social. O fato de não ser tolerante às injustiças sociais não aproxima o homem de Deus. Promover projetos de cunho social não é o caminho que conduz aos céus.\n\nEm um mundo em crise social, econômica, política, familiar, etc, as pessoas desejam mudanças urgentes e clamam por justiça, mas esta ‘fome’ e ‘sede’ de justiça não é a que traz a verdadeira felicidade. A mensagem do evangelho não coaduna com a teologia da libertação.\n\nSomente os pobres de espírito têm sede e fome de justiça. Os ‘ricos’ espirituais são aqueles que se consideram justos diante de Deus. São aqueles que se justificam por meio de suas ações diante dos homens.\n\nOs pobres nada têm neste mundo para sentirem-se seguros, mas eles terão o reino dos céus. Somente os pobres de espírito sentem fome e sede de justiça, e em Deus serão fartos. Aquele que concede o reino dos céus é justo e justificador, e somente ele pode satisfazer o que é exigido pela sua justiça.\n\nO profeta Isaías há muito tempo anunciou aos pobres que bastavam vir e comprar o melhor que se podia oferecer: vinho e leite. Que convite! Que alegria! Os pobres foram convidados a terem o que as suas posses não podiam arrematar.\n\nPorém, o profeta protesta: “Porque gastais o dinheiro naquilo que não é pão, e o produto do vosso trabalho naquilo que não pode satisfazer?” ( Is 55:2 ). A quem o profeta se referia? Aqueles que consideravam não ter sede e fome! Aqueles que consideravam ter trabalhado o bastante para satisfazer as suas necessidades. Estes trabalharam em vão.\n\nOs pretensos ricos estavam gastando naquilo que não podia satisfazer a necessidade essencial do homem.\n\nMas, de que maneira os pobres de espírito podem saciar a fome e a sede? A resposta é bem simples: “Ouvi-me atentamente… Inclinai os vossos ouvidos…”. Simples assim ser abastado de justiça? É isso que o profeta Isaías disse: Todos que ouvirem atentamente a palavra de Deus, estes comerão o que é bom, o melhor! O que pode fazer deleitar a alma.\n\nQual é o deleite da alma? O que a palavra de Deus pode suprir? “Ouvi, e a vossa alma viverá”. Se o homem tem sede e fome de justiça, ela será saciada a partir do momento que se obter da vida que há em Deus. Só após tornar participante da natureza divina o homem estará abastado de justiça.\n\nNão é o trabalho do homem que satisfaz a necessidade da alma. Não é doações, não é pratos de sopas, não é reconhecendo os erros do dia-a-dia, não é fazendo sacrifícios que o homem irá satisfazer a necessidade primária da criatura de Deus.\n\nO que satisfaz a necessidade dos homens é o fruto do trabalho de Deus: “Ele verá o fruto do trabalho da sua alma, e ficará satisfeito; com o seu conhecimento o meu servo, o justo, justificará a muitos; porque as iniqüidades deles levará sobre si” ( Is 51:11 ).\n\nO fruto do trabalho do servo do Senhor se resume em conhecimento. Conhecimento é transmitido através da palavra! O trabalho do Senhor é realizado por meio da sua palavra, e todos que participarem do fruto oferecido terão nova vida.\n\nApós aprender daquele que é humilde e manso de coração “Tomai sobre vós o meu jugo, e aprendei de mim, que sou manso e humilde de coração; e encontrareis descanso para as vossas almas” ( Mt 11:29 ), o homem encontrará descanso e o verdadeiro alimento para a alma.\n\nCristo não estava preocupado com a miséria socioeconômica do povo. A falta de moradia não era a causa ou a bandeira do evangelho. O evangelho social não estava em voga no discurso do Messias.\n\nCristo levou a iniqüidade de todos nós, mas é o conhecimento transmitido por Ele que nos justifica. Ou seja, quando Paulo diz que a fé vem pelo ouvir e o ouvir pela palavra de Deus, nada mais é do que aprendermos com Aquele que é manso e humilde de coração.\n\nAtravés do conhecimento adquirido vem a fé, e por meio da fé podemos agradar a Deus. Após adquirir vida através da palavra de Deus, adquirimos um espírito manso, somos justificados, ou seja, declarados justos diante de Deus.\n\nNão é o caráter do homem que é transformado. O homem não recebe uma moral ‘nova’ ao adquirir o conhecimento do Santo. Antes, o homem tem o seu ser criado novamente em verdadeira justiça e santidade ( Ef 4:24 ), e a sua alma alcança descanso no Bom Pastor.\n\nAqueles que entram por Cristo haverão de entrar, sair e achar pastagem. Estes estão de posse do descanso prometido por Deus ( Jo 10:9 ; Sl 23).\n\nAtravés do evangelho de Cristo o homem descobre a justiça de Deus ( Rm 1:17 ). Ao se alimentar das promessas contidas no evangelho, o homem alcança maravilhosa fé que provem de Deus e passa a ter vida dentre os mortos.\n\nO ladrão na cruz foi justificado ao refugiar-se em Cristo após reconhecer a sua miséria. Ele não tentou agarrar-se a vida aqui, mas implorou pela futura ( Mt 10:39 ). Talvez aquele homem nunca desejasse a justiça dos homens. Talvez ele sempre fosse um excluído da sociedade. Mas, um único encontro com a justiça de Deus revelada aos homens foi o suficiente para que um pobre de espírito obtivesse a vida eterna.\n\nJesus continuou a falar da necessidade em se ter fome e sede de justiça em contraste com a situação dos fariseus e saduceus “Porque vos digo que, se a vossa justiça não exceder a dos escribas e fariseus, de modo nenhum entrareis no reino dos céus” ( Mt 5:20 ).\n\nSomente aqueles que se alimentam da palavra de Deus têm em si a justiça maior, que ultrapassa em muito a dos fariseus. Basta o homem reconhecer a sua pobreza espiritual que Deus não negará o alimento necessário que produz nova vida “Porque, assim como desce a chuva e a neve dos céus, e para lá não tornam, mas regam a terra, e a fazem produzir, e brotar, e dar semente ao semeador, e pão ao que come, assim será a minha palavra, que sair da minha boca; ela não voltará para mim vazia, antes fará o que me apraz, e prosperará naquilo para que a enviei” ( Is 55:10 -11).\n\nPara os homens, os fariseus e os escribas representavam o que a sociedade tinha de melhor, mas a análise de Cristo é diferente: “Assim também vós exteriormente pareceis justos aos homens, mas interiormente estais cheios de hipocrisia e de iniqüidade” ( Mt 23:28 ).\n\nSó em Cristo é possível obter a justiça que vem de Deus. Após ser justificado por meio de Cristo o homem obtém o direito de entrar no reino dos céus.\n\n \n#“Bem-aventurados os misericordiosos, porque eles alcançarão misericórdia”\n\nPor que os misericordiosos alcançarão misericórdia? É uma das qualidades que devemos ter? Jesus estava incentivando o perdão entre os seus ouvintes? Se não demonstramos misericórdia aos nossos semelhantes não obteremos da misericórdia de Deus?\n\nA misericórdia aqui prometida não refere-se a misericórdia que devemos oferecer aos nossos semelhantes. Ser compassivo com o próximo não habilita ninguém a receber a misericórdia divina. A experiência demonstra que ao sermos cordiais com os nossos semelhantes teremos uma vida melhor nesta terra, mas isto não significa que obteremos misericórdia de Deus porque exercermos misericórdia.\n\nSó é bem-aventurado aquele que alcança a misericórdia divina, pois toda bem-aventurança advém de Deus. Porém, tal bem-aventurança não esta condicionada ao comportamento humano.\n\nDaí surge à questão: Como ser misericordioso para alcançar misericórdia? Se com Deus não barganha?\n\nO que Jesus ensinou não se compara aos ensinamentos budistas, espiritualistas, etc. Jesus não falou na reciprocidade necessária ao tratamento humano. Ele não se ocupa em tratar de questões comportamentais como o fazem as várias religiões pelo mundo.\n\nJesus está tratando desde o início do sermão de questões exclusivamente espirituais e este versículo não é exceção: Observe este salmo: “Bem-aventurado aquele cuja transgressão é perdoada, e cujo pecado é coberto. Bem-aventurado o homem a quem o SENHOR não imputa maldade, e em cujo espírito não há engano” ( Sl 32:1 -2).\n\nSer misericordioso é condição que decorre do novo nascimento, onde o justificado passa a ser semelhante a Cristo. Tal semelhança não se manifesta na conduta, mas decorre da nova natureza.\n\nTodo aquele que é instruído por Jesus passa a ser manso e humilde de coração; aquele que se alimenta dos ensinos de Cristo passam a ser fartos de Justiça, pois são criados em verdadeira justiça e santidade; aqueles que recebem de Deus misericórdia, passam a condição de misericordiosos.\n\nA misericórdia de Deus é demonstrada em perdão. Deus não imputa maldade àqueles que são alvos de sua misericórdia. Como? O salmista responde:\n\n“Bem-aventurado aquele cuja transgressão é perdoada, e cujo pecado é coberto”\n\nQuem é bem-aventurado? A resposta é aquele! Aquele quem? O transgressor, o pecador! Se o transgressor, o pecador, é quem recebe a dádiva de Deus, percebe-se que o salmista fala do velho homem. O homem precisa de perdão, mas para isso a velha natureza precisa ser coberta na morte com Cristo.\n\nO transgressor é alvo do perdão divino desde que seja satisfeita uma condição da retidão e da justiça divina: a alma que pecar, esta morrerá! Ou seja, se você é pecador só cessará do pecado após morrer com Cristo. Este é o novo e vivo caminho que nos foi aberto pelo corpo de Cristo.\n\nO versículo citado acima aponta para o homem não regenerado.\n\n“Bem-aventurado o homem a quem o SENHOR não imputa maldade, e em cujo espírito não há engano”\n\nO homem cuja transgressão é perdoada, após receber o perdão, estará na condição apresentada neste verso: O Senhor não lhe imputará maldade, e em seu espírito não haverá engano, visto que foi de novo criado, segundo Deus, em verdadeira justiça e santidade.\n\nEstes dois versículos apontam duas situações distintas de um mesmo homem. Bem-aventurado é o homem:\n\na) cujo pecado é coberto, e;\n\nb) cujo espírito não há engano. Este é o novo homem e aquele o velho homem.\n\nO novo homem gerado em Cristo não tem maldade a ser imputada. Se tivesse, é certo que seria imputada, pois Deus não tem o culpado por inocente. Só o novo homem não possui engano ou falsidade em sua natureza.\n\nQuando o apóstolo Paulo recomenda aos cristãos serem misericordiosos, ele está abordando questões comportamentais pertinentes aos cristãos, mas o tema não é o mesmo apresentado por Jesus “Antes sede uns para com os outros benignos, misericordiosos, perdoando-vos uns aos outros, como também Deus vos perdoou em Cristo” ( Ef 4:32 ).\n\nAgora, quando Cristo diz: “Sede, pois, misericordiosos, como também vosso Pai é misericordioso” ( Lc 6:36 ), ele está falando do mesmo tema apresentado na bem-aventurança. O homem é bem-aventurado quando alcança a filiação divina. As condições necessárias para que o homem seja verdadeiramente misericordioso só é possível àquele que Deus recebe por filho.\n\nObserve o que Jesus ensinou: “E, levantando ele os olhos para os seus discípulos, dizia: Bem-aventurados vós, os pobres, porque vosso é o reino de Deus. Bem-aventurados vós, que agora tendes fome, porque sereis fartos. Bem-aventurados vós, que agora chorais, porque haveis de rir. Bem-aventurados sereis quando os homens vos odiarem e quando vos separarem, e vos injuriarem, e rejeitarem o vosso nome como mau, por causa do Filho do homem. Folgai nesse dia, exultai; porque eis que é grande o vosso galardão no céu, pois assim faziam os seus pais aos profetas”;\n\nPorém aos abastados espiritualmente diz: “Mas ai de vós, ricos! porque já tendes a vossa consolação. Ai de vós, os que estais fartos, porque tereis fome. Ai de vós, os que agora rides, porque vos lamentareis e chorareis. Ai de vós quando todos os homens de vós disserem bem, porque assim faziam seus pais aos falsos profetas”;\n\nE Jesus passa a alertar os seus ouvintes:\n\n“Mas a vós, que isto ouvis, digo: Amai a vossos inimigos, fazei bem aos que vos odeiam; Bendizei os que vos maldizem, e orai pelos que vos caluniam. Ao que te ferir numa face, oferece-lhe também a outra; e ao que te houver tirado a capa, nem a túnica recuses; E dá a qualquer que te pedir; e ao que tomar o que é teu, não lho tornes a pedir. E como vós quereis que os homens vos façam, da mesma maneira lhes fazei vós, também”;\n\nObserve que é impossível ao homem alcançar o padrão de comportamento descrito acima, mas é plenamente possível a qualquer homem o comportamento descrito abaixo?\n\n“E se amardes aos que vos amam, que recompensa tereis? Também os pecadores amam aos que os amam. E se fizerdes bem aos que vos fazem bem, que recompensa tereis? Também os pecadores fazem o mesmo. E se emprestardes àqueles de quem esperais tornar a receber, que recompensa tereis? Também os pecadores emprestam aos pecadores, para tornarem a receber outro tanto”;\n\nJesus recomenda um novo padrão de comportamento aos seus ouvintes?: “Amai, pois, a vossos inimigos, e fazei bem, e emprestai, sem nada esperardes, e será grande o vosso galardão, e sereis filhos do Altíssimo; porque ele é benigno até para com os ingratos e maus. Sede, pois, misericordiosos, como também vosso Pai é misericordioso. Não julgueis, e não sereis julgados; não condeneis, e não sereis condenados; soltai, e soltar-vos-ão. Dai, e ser-vos-á dado; boa medida, recalcada, sacudida e transbordando, vos deitarão no vosso regaço; porque com a mesma medida com que medirdes também vos medirão de novo”;\n\nA nova forma de comportamento demonstra que o homem está de posse da filiação divina. As questões comportamentais não levam o homem a alcançar a filiação divina, mas quando se alcança a filiação por meio de Cristo, o homem terá em si as condições necessárias para ter um comportamento a altura de sua nova condição.\n\nQuando Jesus disse: “Sede, pois, misericordiosos…” o que realmente ele recomendou? A resposta encontra-se na parábola: “E dizia-lhes uma parábola: Pode porventura o cego guiar o cego? Não cairão ambos na cova? O discípulo não é superior a seu mestre, mas todo o que for perfeito será como o seu mestre. E por que atentas tu no argueiro que está no olho de teu irmão, e não reparas na trave que está no teu próprio olho? Ou como podes dizer a teu irmão: Irmão, deixa-me tirar o argueiro que está no teu olho, não atentando tu mesmo na trave que está no teu olho? Hipócrita, tira primeiro a trave do teu olho, e então verás bem para tirar o argueiro que está no olho de teu irmão”;\n\nJesus recrimina os lideres religiosos judeus: eles eram cegos guiando uma multidão de cegos. Qualquer um que aprendesse com um fariseu, o máximo que alcançaria era ser um fariseu.\n\nA perfeição que alguém poderia alcançar aprendendo de um fariseu seria: “… exteriormente pareceis justos aos homens, mas interiormente estais cheios de hipocrisia e de iniquidade” ( Mt 23:28 ).\n\n“Porque não há boa árvore que dê mau fruto, nem má árvore que dê bom fruto. Porque cada árvore se conhece pelo seu próprio fruto; pois não se colhem figos dos espinheiros, nem se vindimam uvas dos abrolhos. O homem bom, do bom tesouro do seu coração tira o bem, e o homem mau, do mau tesouro do seu coração tira o mal, porque da abundância do seu coração fala a boca”\n\nPor meio de parábolas Jesus evidência um princípio pertinente ao evangelho: só é possível um homem produzir o bem a partir do momento que ele estiver ligado a oliveira, que é Cristo.\n\nAquele que não está em Cristo obrará o mal sempre, e aquele que em Cristo estiver produzirá segundo a espécie da sua boa árvore, o bem. A transformação que se opera na natureza transbordará além do coração. O homem poderá tirar o bem do bom depósito.\n\n“E por que me chamais, Senhor, Senhor, e não fazeis o que eu digo? Qualquer que vem a mim e ouve as minhas palavras, e as observa, eu vos mostrarei a quem é semelhante: É semelhante ao homem que edificou uma casa, e cavou, e abriu bem fundo, e pós os alicerces sobre a rocha; e, vindo a enchente, bateu com ímpeto a corrente naquela casa, e não a pode abalar, porque estava fundada sobre a rocha. Mas o que ouve e não pratica é semelhante ao homem que edificou uma casa sobre terra, sem alicerces, na qual bateu com ímpeto a corrente, e logo caiu; e foi grande a ruína daquela casa”.\n\nToda obra que o homem edifica se não estiver alicerçada em Cristo, nada representa para Deus. O exemplo da árvore e da casa alicerçada versa sobre os mesmos princípios.\n\n \n#“Bem-aventurados os limpos de coração, porque eles verão a Deus”\n\nObserve que após a segunda bem-aventurança ocorreu uma mudança sutil na composição do texto. No início do sermão Jesus destaca a necessidade daqueles que são bem-aventurados: pobres e que choram. Ele destacou a necessidade e o que alcançaram: o reino dos céus e o serem conciliados.\n\nDeste ponto em diante Jesus passou a destacar a nova condição daqueles que já haviam alcançado o reino dos céus e estavam consolados. Jesus passa a descrever os bem-aventurados como mansos, misericordiosos, puros de coração, pacificadores, etc.\n\nSó é possível ver a Deus quando se está limpo de coração, e a palavra de Deus tem esta função, remover todas as impurezas. Por meio da palavra do evangelho os discípulos estavam limpos. De igual forma, todos quantos ouvirem do evangelho e crerem em Cristo também estão limpos: “Vós já estais limpos, pela palavra que vos tenho falado” ( Jo 15:3 ).\n\nQuem são os limpos de coração? Como alcançar esta condição?\n\nOs limpos de coração são aqueles que ouviram e aprenderam de Cristo, que é manso e humilde de coração. Os limpos de coração são aqueles que alcançaram a condição de filhos de Deus, uma vez que morreram com Cristo e ressuscitaram com Ele uma nova criatura.\n\nO novo homem é criado através do poder de Deus que o evangelho contém, e por meio desta nova criação o homem passa a ter um novo espírito e um novo coração, limpo de impurezas ( Rm 1:16 ; Jo 1:12 -13). Estes são os Regenerados.\n\nAlguém pode questionar: Como é possível ver a Deus? João responde: “Deus nunca foi visto por alguém. O Filho unigênito, que está no seio do Pai, esse o revelou” ( Jo 1:18 ).\n\nAqueles que são instruídos por Cristo verão a Deus, pois estão completamente lavados peal palavra do evangelho.\n\n \n#“Bem-aventurados os pacificadores, porque eles serão chamados filhos de Deus”\n\nJesus dá outro título aos bem-aventurados: pacificadores!\n\nQuem são, e o que é ser um pacificador? Seriam aqueles que repudiam a guerra? Não!\n\nOs pacificadores são aqueles que levam as boas novas de paz. Àqueles que anunciam que Deus está em Cristo reconciliando consigo mesmo o mundo! Estes são os pacificadores “Isto é, Deus estava em Cristo reconciliando consigo o mundo, não lhes imputando os seus pecados; e pós em nós a palavra da reconciliação” ( 2Co 5:19 ).\n\nAqueles que cumprem o ide de Jesus, estes são os pacificadores. Jesus, o Filho de Deus foi enviado ao mundo para proclamar a palavra da verdade: “O Espírito do Senhor DEUS está sobre mim; porque o SENHOR me ungiu, para pregar boas novas aos mansos; enviou-me a restaurar os contritos de coração, a proclamar liberdade aos cativos, e a abertura de prisão aos presos” ( Is 61:1 ).\n\nTodos quantos recebem a mensagem do evangelho também são comissionados a levar as boas novas de salvação. Além da incumbência maravilhosa de anunciar o evangelho o Cristão é agraciado com a filiação divina.\n\nSomente os filhos de Deus, os de novo nascido, podem levar a semente da palavra da verdade. Isto porque eles são nascidos da semente incorruptível, e o que anunciam, o fruto dos lábios, contém a semente incorruptível.\n\n \n#“Bem-aventurados os que sofrem perseguição por causa da justiça, porque deles é o reino dos céus”\n\nA missão dos pacificadores não é fácil. Eles sofrerão perseguições, mas o reino dos céus pertence a eles.\n\nA perseguição é por causa da justiça de Deus expressa no evangelho. Os bem-aventurados não serão perseguidos por questões humanas, mas por causa da mensagem de Cristo, que é a justiça de Deus aos homens “Mas agora se manifestou sem a lei a justiça de Deus, tendo o testemunho da lei e dos profetas; Isto é, a justiça de Deus pela fé em Jesus Cristo para todos e sobre todos os que creem; porque não há diferença” ( Rm 3:21 ).\n\nO motivo da perseguição dos pacificadores é por causa de Cristo, a justiça de Deus aos homens.\n\n \n#“Bem-aventurados sois vós, quando vos injuriarem e perseguirem e, mentindo, disserem todo o mal contra vós por minha causa”\n\nJesus para de falar das bem-aventuranças ao apontar para os seus discípulos.\n\nOs discípulos deveriam entender que eram bem-aventurados quando sofressem injurias e perseguições. É uma alegria ser participante das aflições de Cristo.\n\nAtravés das bem-aventuranças Jesus estava se apresentando ao povo, visto que todas elas fluem de Cristo. Em Cristo está estabelecida a alegria dos povos e das nações.\n\nMesmo quando perseguido e injuriado o bem-aventurado é bem-aventurado: a felicidade transcende desta vida para a eterna. Estevão se alegrou ao ver a face do Senhor!\n\nNão são as perseguições ou as agruras desta vida que tornam um homem bem-aventurado. Problemas fazem parte do cotidiano. A bem-aventurança decorre do evangelho de Cristo, pois Cristo é que concede aos homens a condição de alegria em Deus.\n\nApós anunciar as beatitudes, Jesus demonstrou que somente os seus seguidores alcançam a verdadeira felicidade “Bem-aventurado sois vós…” ( Mt 5:11 ).\n\nA verdadeira alegria pertence aqueles que, por causa de Cristo, haveriam de ser perseguidos e injuriados “Ora, todos quantos querem viver piedosamente em Cristo Jesus serão perseguidos” ( 1Tm 3:12 ).\n\nTodos quantos estiverem em Cristo serão perseguidos, mas, além de estarem de posse das bem-aventuranças, deveriam exultar por causa do galardão guardado nos céus. Que privilegio e que alegria! Ser perseguido como foram perseguidos os profetas do passado e ainda ter direito a um grande galardão guardado nos céus (v. 12)!\n\nCristo declara que os seus seguidores, além de serem bem-aventurados e de possuírem galardões guardados nos céus, também são o sal da terra.\n\nEm que aspecto os seguidores de Jesus são o sal da terra? Os seguidores de Cristo conservam o padrão das sãs palavras do evangelho. Mediante a ação do Espírito Santo os cristãos guardam-na em bom depósito ( 2Tm 1:13 ).\n\nA palavra de Deus é alimento que dá vida aos homens, e os seguidores de Cristo também desempenham a função do sal: torna agradável ao paladar (ouvidos) o alimento (evangelho).\n\nO cristão quando anuncia o evangelho não está fazendo a ‘obra’ de Deus, como alguns pensam realizar.\n\nA obra de Deus é a de conceder vida, e vida em abundância, e homem algum realizará está obra, que é exclusiva de Deus “Por isso, nem o que planta é alguma coisa, nem o que rega, mas Deus, que dá o crescimento” ( 1Co 3:7 ).\n\nNão foi dado aos seguidores de Cristo fazer a obra que é realizável somente por Deus “Que faremos para executarmos as obras de Deus?” ( Jo 6:28 ).\n\nOs seguidores de Cristo podem se oferecer como libação sobre o sacrifício, mas nunca realizarão a obra de Deus “E, ainda que seja oferecido por libação sobre o sacrifício e serviço da vossa fé, folgo e me regozijo com todos vós” ( Fl 2:17 ).\n\nOs bem-aventurados são sal por ter a função de dar sabor agradável, o que torna agradável aos homens a mensagem do evangelho.\n\nO apóstolo Paulo preocupou-se muito com estes aspectos ao pedir que orassem por ele “Orai também juntamente por nós, para que Deus nos abra a porta da palavra, a fim de falarmos do ministério de Cristo, pelo qual estou preso. Orai para que o manifeste como devo fazer” ( Cl 4:3 -4).\n\nOs cristãos devem andar em sabedoria para os que estão de fora, aproveitando bem cada oportunidade para proclamar o evangelho. Para isso a palavra do Cristão deve ser temperada com sal! Qual palavra deve ser temperada? A palavra (mensagem) do evangelho.\n\nO andar do cristão, ou a resposta conveniente são elementos que ‘temperam’ a palavra do evangelho aos que são de fora.\n\nO apóstolo Pedro faz referência aos bem-aventurados e a perseguição em decorrência do evangelho: “Mas alegrai-vos no fato de serdes participantes das aflições de Cristo, para que também na revelação da sua glória vos regozijeis e alegreis. Se pelo nome de Cristo sois vituperados, bem-aventurados sois, porque sobre vós repousa o Espírito da glória e de Deus; quanto a eles, é ele, sim, blasfemado, mas quanto a vós, é glorificado. Que nenhum de vós padeça como homicida, ou ladrão, ou malfeitor, ou como o que se entremete em negócios alheios; Mas, se padece como cristão, não se envergonhe, antes glorifique a Deus nesta parte” ( 1Pe 4:13 -16).\n\nCaso o cristão não desempenhe a função do sal, com que se há de salgar? Todos quantos se dizem seguidores de Cristo devem estar cônscios de sua condição. Se o cristão não desempenhar o papel para qual foi comissionado, resta ser lançado fora e servirá de pasto aos homens.\n\nO cristão deve ter muito cuidado para não confundir: ‘ser pisado pelos homens’ e o ‘ser bem-aventurado por sofrer perseguições’. Quando os cristãos são perseguidos por causa do evangelho é bem-aventurado, mas, haverá aqueles que padecem por se intrometer em negócios alheios, etc.\n\nO Cristão é a luz do mundo, pois é filho da Luz “Enquanto tendes luz, crede na luz, para que sejais filhos da luz. Estas coisas disse Jesus e, retirando-se, escondeu-se deles” ( Jo 12:36 ). Os discípulos eram luz no Senhor, visto que, creram em Cristo.\n\nSendo luz no mundo, isto indica que, tal qual Jesus é, os discípulos o eram neste mundo “… porque, qual ele é, somos nós também neste mundo” ( 1Jo 4:17 ).\n\nA função dos seguidores de Cristo é a de conceder luz ao mundo (casa) que está em trevas.\n\nOs seguidores de Jesus tornam-se luz, por serem nascidos da Luz (regeneração). Agora, na condição de filhos da luz, os nascidos de novo devem comportar-se como filhos “Porque noutro tempo éreis trevas, mas agora sois luz no SENHOR; andai como filhos da luz” ( Ef 5:8 ).\n\nQuem é nascido de novo deve comportar-se de modo digno da vocação para qual foi chamado, ou seja, não deve portar-se como andam os outros gentios ( Ef 4:1 e 17).\n\n\n- FONTE: http://estudosbiblicos.org/o-sermao-da-montanha/",
				"added": 1527554129
			},
			{
				"comment_id": 29,
				"body": "#Jesus fez também a seguinte comparação: \"Pode um cego guiar outro cego? Não cairão os dois no buraco?\n- Lucas 6:39",
				"added": 1527559663
			}
		],
		"1_12U1Hmmg3QABcs245rgVZoRPPvj6jcgfr5": [
			{
				"comment_id": 15,
				"body": "#ALTERNATIVA: https://walletgenerator.net/",
				"added": 1527538642
			}
		],
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 27,
				"body": "#O Poder Corrompe o que Há de Melhor - Mikhail Bakunin\n- https://web.archive.org/web/20180529000655/https://www.marxists.org/portugues/bakunin/1867/mes/poder.htm",
				"added": 1527553625
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 30,
				"body": "#Envie notas que serão destruídas automaticamente assim que forem lidas\n- https://privnote.com/",
				"added": 1527564781
			},
			{
				"comment_id": 31,
				"body": "#anonymoX - Internet anônima e privada.\n- https://www.anonymox.net/en",
				"added": 1527564904
			},
			{
				"comment_id": 32,
				"body": "#Guerrilla Mail - Endereço de E-Mail Temporário Descartável\n- https://www.guerrillamail.com/pt/",
				"added": 1527564959
			},
			{
				"comment_id": 33,
				"body": "#Criptografe seus arquivos e proteja-os de estranhos com AES Crypt\n- https://www.aescrypt.com/",
				"added": 1527565397
			}
		]
	},
	"comment_vote": {
		"1_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"2_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"4_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"7_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"10_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"11_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"13_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"18_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"20_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"22_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"28_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"33_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"37_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"39_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1,
		"40_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs": 1
	}
}