{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1598305624,
			"title": "How to use tor mobile browser with zeronet mobile ?",
			"body": "When I try to open ZeroHello in tor browser mobile, it can't connect. Someone have an idea ? Thx",
			"added": 1598305623
		}
	],
	"topic_vote": {
		"1598305624_1PFBZmDixgHPejjatauiJQHUukQcqjMCxN": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1598305624_1PFBZmDixgHPejjatauiJQHUukQcqjMCxN": [
			{
				"comment_id": 1,
				"body": "> [mg0](#comment_339_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): What does it say? unable to reach the page? must enable javascript?\n\nunable to reach the page, parameters for scripts are ok its the first thing I look for. thx for reply.",
				"added": 1598340134
			},
			{
				"comment_id": 2,
				"body": "> [geekless10](#comment_3_12PZt1S4yo8R3U46XFTnreGTjAhThDppe4): Connecting to the localhost is disabled to prevent fingerprinting.I can't find any information how to enable it.\n\nYes its all my problem, Tor browser mobile haven't this in prefs tab...",
				"added": 1598391913
			}
		],
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [
			{
				"comment_id": 3,
				"body": "I watched IPFS which I didn't know, thanks to you. As soon as you start looking for the word \"dynamic\" the problems appear!\nEither it is not possible, or it seems very complicated, ZeroNet is much better on this point with its database system and also its authentication system.\nIPFS seems to have a business vision of things behind the scenes, more than a liberating side of the system. Without having tested IPFS I already prefer ZeroNet and don't want to spend time on IPFS.",
				"added": 1599337659
			},
			{
				"comment_id": 4,
				"body": "> [kec](#comment_24_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN): Are you on Linux by chance - or still a Windows user?  [...]\n\nPersonally, I've been on linux for too long to remember when ... and I really like my terminal.\nThank you for clarifying, with a less surly tone that would have been even better.\nIt would be nice if IPFS updated its documentation because there are a lot of occurrences of \"static site\" but when you type the word \"dynamic\" in the search engine there are zero results, which explains my reaction when I discovered IPFS for the first time tonight.\nEspecially when I also see windows everywhere as well as mac and linux advertised as experimental.\nIn short, not very clear all that ...\nYour speech is diametrically opposed to what I could see by looking quickly at the site and the documentation as well as the IPFS github.\nA pubsub system on ZeroNet, why not, with intelligent use of hubs.",
				"added": 1599347542
			}
		],
		"1599688609_17DFecT1rUtpofyfEvapNqRtkZ7J86M4H4": [
			{
				"comment_id": 5,
				"body": "> [test12365](#comment_2_17DFecT1rUtpofyfEvapNqRtkZ7J86M4H4): Capitalism is a marginal improvement over \"feudalism\", better wages but 0 power. No edit button, that sucks.\n\nThe edit button is the little pencil that appears to the left of your text when you hover over it.",
				"added": 1599693242
			}
		],
		"1600134285_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 6,
				"body": "> [schiz0@kxoid.bit](#comment_47_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): Why is needed nofish to add kxoid and kaffieid?\n\nBecause his the owner of ZeroTalk",
				"added": 1600196011
			},
			{
				"comment_id": 7,
				"body": "> [schiz0@kxoid.bit](#comment_48_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): Ah, ok! So if I'm the owner of a ZeroTalk clone there's no problem because I can accept those ids, right?\n\nYes, right, because you can edit, sign, publish, content.json",
				"added": 1600200745
			}
		],
		"1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 8,
				"body": "There is only one way to be free, and that is to learn to be free by being free. Freedom is also responsibility. My father is an anguished man, who wanted to protect me from everything, even if it means cutting me off from everything. The result is that when I had a little freedom I did a lot more bullshit and had a lot more experiences of all kinds than most people and that without any restraint. In the end, learning to self-censor took much longer ...",
				"added": 1600493118
			},
			{
				"comment_id": 10,
				"body": "It's amazing how most people want to change the system while still being hooked up to the old world and how it works like crabs and balls.",
				"added": 1600524995
			}
		],
		"1600451214_14DD49E4i7XTVfi8WqSuV47Nuo1T66etmP": [
			{
				"comment_id": 9,
				"body": "The best would have been to inform yourself well before the purchase ... Today there are many smartphones which are as good or even better than those of Apple. As long as they keep selling it I don't see why they would stop their bullshit ... Boycoot is the only solution we have to build a free world.",
				"added": 1600493691
			}
		],
		"1600719972_18DpxPYwftnzYLAEJKtFtFvWajiCWx5Mqj": [
			{
				"comment_id": 11,
				"body": "With a new zite (site) this message is \"normal\", it's just a lack of peers. Spread the address of the zite and as soon as you have a few peers the message will disappear. To be seed here is a good place : http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n",
				"added": 1600757308
			}
		],
		"1601057110_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 12,
				"body": "I'm running it and a little progress bar would be nice if we knew if it's crashed or if we just have to wait, I'll wait, we'll see, after a while. ;)",
				"added": 1601062198
			},
			{
				"comment_id": 13,
				"body": "> [spiritus](#comment_12_1PFBZmDixgHPejjatauiJQHUukQcqjMCxN): I'm running it and a little progress bar would be nice if we knew if it's crashed or if we just have to wait, I'll wait, we'll see, after a while. ;)\n\nIt seems long anyway ...",
				"added": 1601062333
			},
			{
				"comment_id": 14,
				"body": "> [spiritus](#comment_13_1PFBZmDixgHPejjatauiJQHUukQcqjMCxN): It seems long anyway ...\n\nor even just a percentage",
				"added": 1601062998
			},
			{
				"comment_id": 15,
				"body": "> [6283822](#comment_87_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): did you meant for initial setup ?\n\nFail at download, initial setup yes",
				"added": 1601109968
			},
			{
				"comment_id": 16,
				"body": "MAJ, but seen to be the same, fail again",
				"added": 1601147712
			},
			{
				"comment_id": 17,
				"body": "No permissions ?",
				"added": 1601147904
			}
		]
	},
	"comment_vote": {
		"2_1PFBZmDixgHPejjatauiJQHUukQcqjMCxN": 1,
		"3_12PZt1S4yo8R3U46XFTnreGTjAhThDppe4": 1
	}
}