{
	"next_post_id": 38,
	"next_comment_id": 22,
	"next_follow_id": 2,
	"avatar": "jpg",
	"user_name": "Lajos Nagy",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "This all doesn't fit anywhere else, I guess",
	"post": [
		{
			"post_id": 1,
			"date_added": 1588972007,
			"body": "Hello, ZeroMe. This is me. Lajos Nagy. Photographer, dad, father, husband, lover of puns and watcher of Star Trek II: Wrath of Khan"
		},
		{
			"post_id": 1588985459,
			"body": "Cultivate\n\nTo prune, to grow and to protect until maturity. Plant or performance. Photography crosses my mind every day, but most days it's not with a cultivation-focused mindset. That might be a mistake, I believe it to be. Cultivate that eye, cultivate that mindset, cultivate that understanding. Most of us don't get lucky enough to just be good at something and I sure didn't. Growing, hence, is the way. The only way.",
			"date_added": 1588985457
		},
		{
			"post_id": 1589023308,
			"body": "Much of what I do with film photography revolves around sentiment. Technical perfection can be, of course, approached and there are great tools to do so, but that's not why I photograph on film. The sentiment that the exact piece of physical medium was with me when I made that memory, the imperfect rendering, the just missed focus. It all would take away from digital or at best, not change a thing, adds that much more to film.\n\nDifferent tool to different ends.",
			"date_added": 1589023305
		},
		{
			"post_id": 1589063505,
			"body": "Incapable is the creative who will not attempt anything they might fail at. I've been toying with street photography, but I've so far been incapable, because there have been times I would have liked to go and didn't. It doesn't take much to cross over to capable, however. Having simply done it puts you there, and that really is only an effort of the mind. Being good has nothing to do with it.",
			"date_added": 1589063501
		},
		{
			"post_id": 1589122860,
			"body": "Safe is better than unsafe, but it's worse than interesting. Safe kills the little edge that those who want to get ahead, possess. So be non-safe instead. Better than unsafe, but without the boring tepidity of the everyday, the usual. I've never gotten what I truly wanted being perfectly safe. It's not \"being brave\", it's ditching comfort.",
			"date_added": 1589122855
		},
		{
			"post_id": 1589203002,
			"body": "Not every day do I wish to write an essay, but at the end of every day I wish I had written something. Some days I'll write a journal, some days I will write these posts and some days I can't find the inclination to do anything productive at all. Those are the days I dread the most, those are truly lost to the fog of the past. \n\nDays not spent writing are days spent to be forgotten.",
			"date_added": 1589202996
		},
		{
			"post_id": 1589287643,
			"body": "Be the person you want to, not the one you think you should. I remember wanting to become a software developer. Turns out numbers are hard and computers are made of those. Forced the matter for some 12 years before realising I was better suited for a different type of work. I was always drawn towards creative pursuits but thought I should become a numbers kind of person. Office drone, software guy. I am not. I've decided to put in a conscious effort to become the creative guy I've always wanted to. Hard work, accepting truth.",
			"date_added": 1589287636
		},
		{
			"post_id": 1589363591,
			"body": "Five photography tips for lockdown! The cure for boredom, do this! Yes, yes. We all wish it was that easy. Read an article on medium or maybe five and then your worries of the world atomize and disappear. If you only did the five things correctly, you would fill your quota as a photographer and as extension a creative. There, you did it. You've completed the guide. Very good, very good. You get a passing score.\n\nBut how about I want to spend my time experiencing the anxiety. What if I don't want to shoot still life or monkey with reflections from a champagne glass. What if creativity on rails isn't creativity at all whatsoever. What if being stuck in a rut, with your brain trapped is part of progress. Integral step to true improvement. What if letting the seams spring a leak and allowing your ideas find different outlets is the way to deal with all this, professionally and creatively?\n\nI don't know but I do know these are the questions I want to keep asking. ",
			"date_added": 1589363583
		},
		{
			"post_id": 1589454227,
			"body": "\"Celebrities are just people who got lucky\" a few times online recently and I'm not so sure that's the case. Of course celebrity status in and of itself doesn't mean much, it's such a wide spread there's no distinction between Jay-Z and Carrot Top when the word 'celebrity' is used. I'm thinking here of the content creators, the new celebrities of the world. The Joe Rogans, the Tim Ferrisses and those who genuinely do show up and do work to some extent, regardless of whether I agree with or like them. Youtubers, podcasters, bloggers, vloggers, the new entertainers.\n\nI don't _know_ of course if they're popular because they're popular, perpetuating a lucky break and turning it into a positive feedback loop. It's impossible to know. But it doesn't resonate. What I, personally, can try is to find out if just hard work and tenacity correlates with a level of success that can be measured on a scale other than my own. Not 'hustle', just active participation in an endeavour divergent from the main stream 9-5 groove that's so easy to get pushed back into.\n\nShould be fun! ",
			"date_added": 1589454218
		},
		{
			"post_id": 1589534027,
			"body": "Some companies graciously offering to allow staff to work from home forever. Aren't you guys just sweathearts, letting office space leases lapse and not having to pay for coffee and fruit and whatever else we were being lured with.\n\nIf it takes a pandemic for a company to even think about letting staff to work from their own homes in roles where physical presence isn't necessary, maybe their hearts aren't really in it.\n\nBut also, if they had not realised it's more profitable to let people not come to the office than it is to make them, they're not winning on efficiency anyway.\n\nThis said, I like working from home about as much as I like sleeping in the office.",
			"date_added": 1589534017
		},
		{
			"post_id": 1589632783,
			"body": "Niche topic I know, but I was researching the resolution of 35mm film for a project yesterday. Fujifilm's 400h does 125 linepairs per mm, which is some 54 megapixels. Common film stocks from the 70s and 80s are similar in speed and technology, so disregarding the anamorphic stretch for a moment we can conclude that George Lucas can keep remastering Star Wars up to roughly 9k without sacrificing image quality.",
			"date_added": 1589632772
		},
		{
			"post_id": 1589724078,
			"body": "It's Sunday and I've spent roughly 10 - 12 hours writing, recording and editing this weekend. I don't usually get to spend this much time on these things so I'm grateful, but it's 3 pm already. The Monday dread is setting in. Meh.",
			"date_added": 1589724066
		},
		{
			"post_id": 1589796288,
			"body": "I've made a couple videos now with an improvised teleprompter, and I'm not so sure I like the results too much to be honest. It might be easier to write the entire script up-front and to record it in one or two attempts but the result is difficult to connect to. Not to mention that the reason I make videos at all is to practice speaking and public speaking at that.\n\nI'm thinking I'll ditch the crutch and put in the effort to become a better communicator instead of striving for a more polished feel up-front. If any time is the time to fail, it's the dress rehearsal, before anyone cares about what I do.",
			"date_added": 1589796275
		},
		{
			"post_id": 1589892058,
			"body": "Did some napkin math yesterday and found out that it is possible to write a novel in a month. I can comfortably type at about 70-75 Wpm, so a 60 average over an hour would give me 3600 words. Let's assume I'd have to stop and think every now and again, and only produce half of that in reality, or 1800 words in an hour. That sounds reasonable, I've written article drafts of 2000 words in an hour.\n\nThe usual length for fiction novels ranges from 70 to 90 thousand words according to the Internet and I've no reason to dispute that. That makes producing 90 thousand words in a month a very achievable goal and a daily commitment of about 3-3.5 thousand words or just around the two hour mark. \n\nI know I spend more time than that on useless stuff, so I waste about a novel's worth of time a month easily. Of course there's no good reason to only spend a month doing it, even finishing a book in two months would be quite a feat and not something most people ever achieve. With edits and revisions that puts me at the 2.5 month estimate for a finished manuscript.\n\nNow of course I'm not that big a deal when it comes to words on paper, but I've figured out I don't have to be. Picked up a Danielle Steel book a few months back to see what makes them popular. My conclusion is that they're not anything special. Just a story with a few characters thrown in. \n\nNot my cup of tea but these books without a doubt give a useful waterline for what qualifies as a book and what it is that people read. And buy. And that's to mean no disrespect to Danielle Steel. She's not an artist who produces books I enjoy but she finishes and sells books. If anything that's what a writer who writes books does. Finishes a novel and gets it in hands of people.\n\nWith kindle publishing the latter part should pose no obstacle whatsoever. \n\n\"Danielle Steel has written 185 books, including over 141 novels\"\n\nThat's more books than I have produced of anything, I reckon.\n\n",
			"date_added": 1589892044
		},
		{
			"post_id": 1589994972,
			"body": "Trying to find an ultraportable to use for writing. It's got to be something light enough I want to take with me, powerful enough that I don't mind using it instead of my main laptop but also cheap enough so I don't baby it. \n\nOf course there are the superb Thinkpad X series, but anything I want to pay for I don't particularly like the battery life of. X230-x250 would certainly be enough power if I they run for another 5 hours on battery. And when it's dead, there's pretty much nothing I can do about it other than finding an outlet or a second battery. Not super light either. Okay they are pretty light, but they are not sling-bag portable.\n\nIpad, ipad AIr maybe? Certainly cheap enough, powerful enough and light enough, the battery life is good too, but a 11\" screen would be nicer, plus the folio keyboard is very expensive. At that point I might as well get an apple magic keyboard with a carrier case. Not very practical, but it ticks many boxes.\n\nChromebooks would work, too, but they're more limited in what they can do than even an ipad would be. Keyboards are crap as far as I can tell, also. Or maybe I've not looked hard enough.\n\nMicrosoft Surface Go 2 looks interesting, but it's the price of an ipad air, the performance of the ipad and the software selection leaves much to desire, with that W10 Home in S mode.\n\nI am probably missing something. Why is it so difficult to find a decent keyboard that attaches to a good screen and battery life? I definitely am missing something.",
			"date_added": 1589994957
		},
		{
			"post_id": 1590079842,
			"body": "But also as it turns out there is a thing called a word processor. The memory that these had existed lived somewhere in the far recesses of my brain only to be dug out now that I've run into them again.\n\nAlphasmart Neo 2. Runs 700 hours on a set of batteries and all it does is it lets me write. Don't mind if I do!",
			"date_added": 1590079826
		},
		{
			"post_id": 1590185948,
			"body": "Time and time again I see people make things with gear worse than what I already have. Why is it that I still want to upgrade instead of hunkering down. Why is it so hard to just shut up, sit down, do something and then share it. Because it is, it's the hardest thing. To share something of me and have it judged. But that is the only way to improve. Therefore I must.",
			"date_added": 1590185931
		},
		{
			"post_id": 1590274139,
			"body": "Bought just an iPad with the magic keyboard. They're expensive bits of kit but they do offer a number things I like in a portable computer:\n\n1) Software support and security patches for a long time\n2) excellent quality assurance\n3) dependable battery life\n4) ubiquity\n\nNumber one, I can't believe how some manufacturers come to the conclusion that they are allowed to drop software support for their products in less than two years. Android smartphone makers are the worst. You buy it you stop existing as far as they are concerned. Cooked ROMs or no updates at all, and with some manufacturers locking the bootloader that isn't even a thing. \n\nIf I buy a computer for between $500 to $1000, I am expecting to be given a decent software update schedule. Or the very least allowed to do whatever the bleeping hell I want with the hardware once the manufacturer is finished.\n\nNumber two is directed at companies that make things I like very very much but without the assurance that it is that thing every time. Lenovo does not think this part is very important. Good God I love their Thinkpads, they are beautiful statements of power and performance. A brutalist piece of art, a companion to the serious user. \n\nThere are cracking spots on the case, failing screens, failing charging ports and many, many more. They're not the only one, but goodness knows they coast on the product being otherwise so excellent that new owners are willing to put up with three replacements.\n\nNumber three is a must for me. Up to 10 hours on a laptop is not good enough, I want at least ten hours. An ipad does this, and although you can squeeze out that much from many other things, an iPad very seldom gets the SD card driver's process stuck resulting in a drained battery in 3 hours. Dependable battery is very important to me.\n\nNumber four does two extremely important things for me. A ubiquitous piece of equipment draws no attention in public. At worst someone would think I was one of those hipster wankers sitting at Starbucks, but it's not like I'm hacking away at an IBM M keyboard, which might as well be a machine gun as far as those sitting around it are concerned. I like a good mechanical keyboard. Writing this on an unicomp UB434ha so it's not like I mind the clack, but when I'm out and about, I want a usual piece of kit literally nobody cares about. I want to work, not worry what people think or who wants to snag it the moment I turn my back for ten seconds.\n\nAnd second it makes accessories wildly available. You can get for an iPad a ridiculous variety of keyboards, cases, screen protectors, adapters and chargers. Whatever it can do and you want it to do you can, no issue with availability.\n\n\nAnd that's why I bought myself a bog-standard ipad with a magic keyboard for writing.\n\nThat and the fact that Alphasmart Neo 2s are generally only available in the US and in ANSI layout. I much prefer ISO.\n",
			"date_added": 1590274121
		},
		{
			"post_id": 1590362472,
			"body": "Is it sometimes a chore to produce anything of value, let alone interest. I've cooked, came up with the idea for my next video and that's that. Looked after the kids a little and also worked about an hour on my day job.\n\nTomorrow I should be taking delivery of my new toys and spend some time setting it all up.\n\nOn a separate note, I've found I like writing with fountain pens very much, so I got myself a Lamy Safari Fine nib pen with black-blue ink. Should drop sometime early next week.\n\nNot much else to add, everyone have a great rest of your weekend!",
			"date_added": 1590362453
		},
		{
			"post_id": 1590434647,
			"body": "I choose to do more than I absolutely have to. Yet, creation is non-optional for me. I'm not obsessed with it, but every time I slump into simply getting on with life and satisfy myself with simply unwinding at the end of the day, I court depression. I choose to create but I also have to, otherwise I slip and it gets harder to climb out next time.\n\nIf only it was this easy to make myself exercise. It's simple, but it's not easy for sure. Used to run a 10k daily before I had to take it easy, now I don't run at all. Tough luck, I'll have to start soon or court serious health problems.\n\nIt is what it is, making the best of what I can get.",
			"date_added": 1590434627
		},
		{
			"post_id": 1590442566,
			"body": "I just found out it's possible to register to my local library online, and check out stuff with a nice app called Libby. Free books and audiobooks. My mind is blown how much stuff I've been missing out on. I've of course known of libraries but never made the connection that they also do digital books...\n\nWoah dude.",
			"date_added": 1590442545
		},
		{
			"post_id": 1590500147,
			"body": "I did not expect the stylus to be such a boon to how I work. I've completely replaced my bullet journal already and it's only been a day.\n\nIn other news, keyboard to be shipped on Thursday and I'm ready to hunker down and write my first novel.\n\nFinally producing something, such as these short posts and some work I've done for a video, is giving me such energy and motivation. Can't wait 'til I can integrate writing into my day.",
			"date_added": 1590500125
		},
		{
			"post_id": 1590662426,
			"body": "The one thing that bothers me most about working for a big corporation is the lack of agency. If someone hires me to do a job, I expect them to be interested in my ability to complete tasks related to the job description, not how well I navigate bureaucracy.\n\nJust yesterday I spent two hours trying to put e-mail on my phone, because the desktop client logs out after a few minutes and I don't get notifications. Clearly, that's not very good for a role that has to deal with notifications, but my point is that it is extremely difficult to get anything done, when everyone's scared shitless of making a mistake in the process. I shouldn't have to talk to three departments just so that I can request to be allowed to do my job more efficiently.\n\nProcess is good, it unifies response to common tasks, but caressing the process isn't what anyone should be doing. We should be doing our best so can others can get their work done, too. Literal days of my life seep away monthly just managing the moving bits to the bureaucratic machine that makes paperwork go around. I'm all for a paper trail and accountability, but please just for once can I spend less time on the paperwork than the technical implementation of what I'm doing.\n\nThis is frustrating, inefficient and I should only hope that it's also a hindrance to the company requiring insane amounts of box ticking. Companies that do this should be at a disadvantage compared to those that don't, especially in the current market.\n\nI understand now the people who burn out at their office gig and want to escape by any means necessary. The scary part is, I wouldn't even truly mind the soul sucking boredom of the actual job if the friction around it wouldn't be utterly maddening as well. I wouldn't rebel if it was only boring and a little bit annoying, but it's designed to make me hate it deep from my gut, too. Why? Who gets something out of this? Why is the increased turnaround worth it?\n\nWhy exacerbate the turnaround at all, surely this means there's no conscious thought behind it, no 'corpgeist', or invisible hand of the corporation? Surely this is only an emergent feature of people fearing for their jobs enough to be willing to spend their time crossing t-s and dotting i-s, rather than on productive, meaningful work.",
			"date_added": 1590662403
		},
		{
			"post_id": 1590707740,
			"body": "Wrote a thousand words of outline for my very first novel. I expect it to be tripe shit, but I've always known I enjoy writing and editing text.\n\nDoes the world need yet another Sci-fi novel? No it doesn't but someone in the world might. I'm writing it for the ten people who will read it and cherish the time they had with it.\n\nThis is sooooo much fun.",
			"date_added": 1590707716
		},
		{
			"post_id": 1590750783,
			"body": "Final stretch to the weekend. Not that the weekend is any special. It's just house chores for eight hours and then an evening and an afternoon. Much like a weekday, where it's eight hours of work chores and then an evening and afternoon.\n\nIn fact, why am I looking forward to the weekend at all? :)",
			"date_added": 1590750758
		},
		{
			"post_id": 1590873690,
			"body": "And like clockwork the space bar in my 2017 Macbook Pro stopped clicking. It was working a few days ago, now it's not. Probably an eyelash fell on it.\n\nNever in my years have I fathomed an irredeemable piece of flaming horse shit like the butterfly keyboard without gaskets. It sounds like a first world problem. It is, too, to a certain degree. But fucking hell, can the primary input sources on a 2700 usd machine stay operational for at least the duration of the warranty period? Is that an unbridgeable ask?\n\nI don't even eat on top of my laptop. Because I'm not a caveman. Yet this keyboard finds a way to break.\n\nApple really fucked the pooch with this one, I'm very close to having it repaired and buying a 2020 mbp or a comparable thinkpad. Like ... _this_ close. Heard the keyboard in the 16\" was good, but that's a lot of money to spend on a keyboard upgrade.\n\nAs you might be able to tell I'm rather passionate about keyboards.",
			"date_added": 1590873664
		},
		{
			"post_id": 1590970523,
			"body": "Scrolled through Reddit and Twitter today and all I've got to say is that I'm absolutely exhausted. I feel like I've worked 12 hours straight and it's only been 2-3 hours of catching up on the news. 2020 is too much.\n\nI've been meaning to say something. Anything. But there's nothing of any value I can add to any conversation. Also politics on the Internet is generally not a bright idea, so I try not to touch on it in any of my online presences. This platform is a little more free-flowing than the others so I can comfortably write about what I think, but still. Just... Exhausted.\n\nAll I want is a nice house with a garden somewhere in the north of Scotland where people are nice and the weather is a proper motherfucker, and wait until I'm once again inclined to move into a large city.",
			"date_added": 1590970496
		},
		{
			"post_id": 1591018479,
			"body": "Did a bit of shed engineering today. Still waiting for the HDMI -> USB adapter. They're extremely difficult to come by since people bought up all the stock.",
			"date_added": 1591018451,
			"meta": "{\"img\":\"900,678,b97ca8666333221986876433865654a84112db999a789,0123344556005434782600544448968A14BB4598903B32692805BB95006AC673655111CDEEC74CCC\"}"
		},
		{
			"post_id": 1591098695,
			"body": "Dusted off a Dell e7250 yesterday to throw linux on it. Manjaro with KDE plasma worked first time, everything just works. Connected to my nas right away, browser synced, wifi works, sound works, video driver, sleep and hibernate. Everything. Not used to pamac as a package manager or Arch in general but I do like what I see.\n\nThe reason I did it was to see if I can get away with getting rid of my macbook pro for a big-boy laptop with Linux. I reckon I could. I'd have to dual boot some other OS, because my choice of NLE and raw processors (Davinci Resolve and Capture One)  only really work well on MacOS and Windows, and my DAW, Logic, only runs on Macos but otherwise this is fine. I could probably find alternatives I like using and can integrate in my workflow along a Windows PC running those things.\n\nI'll keep using the mac until the keyboard jams again, have it replaced under warranty and then sell the whole thing for something more reliable, such as a 13\" MBP 2020, a Ryzen version of the new T14 or potentially something older like a T495.",
			"date_added": 1591098666
		},
		{
			"post_id": 1591185413,
			"body": "Wife is back to work, schools and nurseries have yet to open. So now we're two knowledge workers trying to focus on hard mental tasks while also having to look after small children. This is not right. I can both debug build pipeline issues and stop a toddler from climbing on the window sill, but not simultaneously. No one can. No one should.\n\nBut then, who am I to say I've got it hard. Everyone does, we're sitting/fighting through the worst epidemic and economic downturn of the last 60 odd years. \"In recent memory\", as they say. \n\nWife looks at me side-eyed when I tell her that judging by how much everything changed in the last two or so years, I wouldn't be surprised at all if a G7 was subject to a nuclear attack in the coming few months. My money is on the states launching such an attack on domestic soil, but that's of course utter speculation. The point is it's impossible to know where and when the pent up pressure escapes. Only that it's probably soon now.\n\nWhat shocks me to my core is that I just _know_ that we'll think back to the current standing of events in a few months and think to ourselves 'Oh, I remember when that used to be a problem. That was cute!' in a way we think back to when we expected Australia burning for weeks to be the defining feature of the year, or the escalation of conflict in Iran, or Brexit.\n\nBlows my mind regularly that Brexit no longer registers as a concern, COVID barely does judging by various countries tentatively opening up already.\n\nI want to fight and scream and write and talk about all these problems. I also don't want to. I'm tired of being worried of it all all the God damned time. \n\nAs if there was a mental war was being waged and our heads were the battlefields. Constant barrage of opposing messages on all channels imaginable. The constant misinformation and bold faced lies. The incendiary comments under every story, the unsavoury messages under every video. \n\nAnd when it's not a skirmish for the public opinion, it's an ad.\n\nFucking hell, I miss when my biggest problem was wanting to throw up from the absolute tsunami of companies trying all day to influence me to spend money on whatever they were peddling. Thought _that_ was an issue. Having to shield my children from the unadulterated advertisement coming from the TV as if from a fire hose.\n\nI'm too old to be an angsty communist anymore. I've never really wanted to be one in the first place because I was born behind the Iron Curtain. I've seen enough to know it's not the label that makes the difference. It's not the anthems, the affirmations, the way books portray history in schools.\n\nFeels good to let the steam go sometimes.",
			"date_added": 1591185383
		},
		{
			"post_id": 1591269971,
			"body": "Finally started writing. 1700-ish words done yesterday after work. I'll have to edit it for sure, very heavily, but starting is the hardest part.\n\n\nIt's immense fun, however, so there's that :D",
			"date_added": 1591269940
		},
		{
			"post_id": 1591364509,
			"body": "Now that I work night shift at the 'factory', creative endeavours are taking a back seat.\n\nIn fact, the only thing I've been able to pull together was some writing. Journals, these messages here, and some work on the book.\n\nThe good news is that this is a creative constraint suited very well to pointing out where I was wasting my time before. If you have no time to waste, you'll waste less time.\n\nIt's one thing to intellectually understand I've been wasting my time and yet another to have an external pressure come and squeeze out the unnecessary parts of my creative process. No need to write an entire script for a video, for instance. \n\nCompletely kills the flow and the chill. It's actually easier to come up with my 'voice', my point with a video, and the key bits I want to mention than it is to write a compelling script that I can perform in a natural way.\n\nI think it's easier to learn how to just go than it is to plan ahead and make it seem like I'm speaking off the dome.\n\nCertainly cringier to edit though, which is yet another pressure point well aimed to make me get better faster.",
			"date_added": 1591364477
		},
		{
			"post_id": 1591553865,
			"body": "12 minute video, render time 4 hours on a Ryzen 7 3700x with Vega 64. I may have overdone it a little bit.\n\nBut at least I shot, edited and started to render the video during the weekend, so that's productivity goal done!",
			"date_added": 1591553832
		},
		{
			"post_id": 1591662622,
			"body": "The Internet is a weird, weird place, full of wonder.\n\nBeen on it since the late 90s, and it still constantly amazes me.",
			"date_added": 1591662588
		},
		{
			"post_id": 1591789951,
			"body": "Go to bed at 2 in the morning, wake up at 8, deal with the kids, snooze another hour. Look after the kids until 5, then get to work until midnight. You're knackered, but whatever, one episode and it's bedtime. Shit, it's 2:40 am. Alright, going to bed early tomorrow. 8Am, 5pm, midnight, bedtime. Sleep until 8, well rested.  Kids, work, midnight, still got energy for something, let's write!, 2:50am, knackered in the morning.\n\nThis groundhog day sucks, I want another one. Too spent to even dream, other days I can squeeze in an hour of me time, sometimes two. But then it's back on the treadmill.\n\nNot sustainable. And by that I don't mean in the \"it's not good for you maaaaan\" sense, I mean it in the \"spiraling out of control shit's going to break soon\" sense.",
			"date_added": 1591789916
		},
		{
			"post_id": 1591791115,
			"body": "One thing always stumps me when looking at higher-end laptops in 2020 is how the base option is still 8 gigabytes of memory. Memory is cheap, put in 16 gigabytes already for crying out loud. It's like what, 40-50 quids at the distributor level for a stick like that? How is a Dell XPS 15 still starting at 8 gigabytes.\n\nLenovo is even worse, they removed RAM expandability from this year's thinkpads, L14, T14 etc. Yes, the business class, ugly as arse tanks are no longer upgradeable. And stuck at 8 GBs. Or 16 if you want to _customize_ your machine to come with that much memory. It shouldn't even be an option. In a chassis that big it should be a 16GB stick with a free dimm slot.\n\nIf it were the ideapad, or a latitude 3000-5000, I would say sure. Cost consciousness is a thing, absolutely. But it's been what 8 years since we've had 8 and 16GBs as the higher end options in high-end laptops and I think it's time to go 16GB baseline. Memory is cheap, put more in there, especially in very expensive machines, without having to _customize_ it, increasing lead time from days to weeks.\n\nAnd maybe, just maybe, 14-15 inch laptops don't need soldered memory, unless it's the X1 Carbon Extreme or something designed to be the pinnacle of thinness. \n\nNot even going to rag on Apple this time, they've been doing this since 2011, they get an F on this one by default.",
			"date_added": 1591791079
		},
		{
			"post_id": 1592081395,
			"body": "Does anyone happen to have a good solution for sharing _very_ high resolution photos in full size on the clearnet? How would you go about making publicly available hundreds of 30MP JPGs that are 7-15MB each?\n\nI want to share extremely detailed shots of laptop parts for people to use as reference for dis/reassembly, modding or whatever, but I just can't think of a way to reasonably do it. Torrent with a dedicated server as the tracker? Some wordpress mod that can help me organise it and store everything in S3? Zip it all up and build an SFTP server somewhere? What would the right approach be?",
			"date_added": 1592081358
		}
	],
	"post_like": {
		"132mEvGg5NRtZdVrw1iV2TX4uvU6XYKm7u_1589009169": 1589026187,
		"1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1589149904": 1589204683,
		"1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1589316707": 1589366855,
		"1GSsLUYxCrcS1DkKMBiGLvQJ8z4NAqTNVW_1589386696": 1589389638,
		"1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1591145573": 1591536511
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Ansho Rei: When you're working with data in memory, safe is of course the good kind of approach. But when creative output is to be achieved, safe is stale and that's not good. I've been in software a long time and am trying desperately to salvage what's left of my sanity by trying unsafe things for a change. Or maybe it's not software that's doing me in, maybe it's big corp financial software? :D",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1589122860",
			"date_added": 1589202719
		},
		{
			"comment_id": 2,
			"body": "@1bfqutudhtexlka: The effort is part of the process. I'd say it's the most important part of the process.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1589203002",
			"date_added": 1589280601
		},
		{
			"comment_id": 3,
			"body": "Yes we can!",
			"post_uri": "144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY_1589369184",
			"date_added": 1589371336
		},
		{
			"comment_id": 4,
			"body": "@Moor: They are running out of runway on that one, I think. They won't have much of a choice soon.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1589534027",
			"date_added": 1589571210
		},
		{
			"comment_id": 5,
			"body": "@styromaniac@zeroid.bit: At any point in life it's imperative we know how far George Lucas can possibly go. At this rate Solo will shoot before the scrawl is over by 2050. :D",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1589632783",
			"date_added": 1589743738
		},
		{
			"comment_id": 6,
			"body": "@Thegreenmage: I remember using an Asus Netbook 1005HA for this exact purpose a few years ago. That was a heap of doodoo but I loved it to bits. Must have written a million words on it. There are much better options now. \n\nI like the idea of a tablet and a keyboard for some reason, but I just know that if I got something that had some grunt to it, I'd never get anything done because I would spend my time doing the same things I normally do on my laptop or desktop. Which is nothing useful, unfortunately.\n\nIf only something like a Thinkpad X61 with a 10-12 hour battery life and 2 pound weight existed!",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1589994972",
			"date_added": 1590080624
		},
		{
			"comment_id": 7,
			"body": "Haven't exercised but I got my diet in a decent state finally. Taught myself some new recipes and made chicken breasts my son absolutely devours. He's very hard to please. I'm reading an utter pile of garbage of a book, but it's something I want to be doing for various reasons, so that's good too. I'm adding more and more into my days recently. With the lockdown still in full swing, I feel that the weeks blur into one another. I jokingly tell the neighbour good morning every day, regardless of whether it's morning or not. It's becoming difficult to actually tell if it is and it terrifies the living crap out of me. Days flow into each other, too.\n\nI journal for my children and I blog on ZeroMe every day. It helps me focus and gives me something to write daily. It's not much but any kind of consistency and discipline is welcome in my life. Still got my work so that's nice, but it's never been anyone's dream gig. Pays well, but does my sanity in. So now I add things into my day, get better, create etc, otherwise I'd probably be ready to go lick the doorknob of a public building and be done with it.",
			"post_uri": "1GESkMhyvAiHWnALjYKhDuTe3mHNMpndeG_1590192473",
			"date_added": 1590274910
		},
		{
			"comment_id": 8,
			"body": "@styromaniac@zeroid.bit: that would be nice indeed. I liked the old Thinkpad ones from the X220/T420 period. I also liked the island style in older macbook pros, from 2013-2015. Butterfly switch 2016-2019 macbook pros are complete garbage fire, I've not liked a single of the three generations of those. Magic keyboards have the same keycaps but they're short-travel scissor switches, which I don't hate. I'd much rather user cherry browns. I have to sacrifice those for mobility on this project, unfortunately :(",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1590274139",
			"date_added": 1590361497
		},
		{
			"comment_id": 9,
			"body": "@Zeronetuser1453: Creation is truly magic when you consistently apply yourself to it. At least that's what I've found. I usually find myself chronically unmotivated, tired and out of time. Juggling family and work does that, who has the wherewithal to be an artist on top of that... Except I made myself write one post on Zero every day, and now that I look back I go holy crap, where did I ever get the time to give birth to all this text.\n\n\nI found that if I apply myself to committing my thoughts to a 'permanent' medium, they pile up very quickly indeed. Sometimes it's a chore to do something that's not necessarily vital to my and my families continued existence, but looking back I'm always glad I had.",
			"post_uri": "1GESkMhyvAiHWnALjYKhDuTe3mHNMpndeG_1590192473",
			"date_added": 1590362764
		},
		{
			"comment_id": 10,
			"body": "@Dilans: I've been toying with a few ideas. Haven't decided to be honest but one of the worlds I want to capture is a really gritty, dark fantasy set in a technologically advanced distant future.  Lots of angst to vent lately, would do me some good to write it all out :)",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1590500147",
			"date_added": 1590516792
		},
		{
			"comment_id": 11,
			"body": "@Dilans: Thanks! We'll see how it comes together. I feel like I need to write even if nobody reads it. Especially if nobody reads it. I want it to be an honest effort and an honest book. Not corrupted by monetary interests or any other motivations other than my wanting it to exist.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1590500147",
			"date_added": 1590603953
		},
		{
			"comment_id": 12,
			"body": "@Foxtrot: I really like it on unsexy business laptops. Those are easy to come by, relatively inexpensive, very easy to maintain and because there are so many of them, Linux support tends to be excellent. You can slap linux on a dell latitude or a thinkpad and almost always things just work. And if they don't, a bunch of people have likely attempted what you want to do. Great stuff. It's unfortunate that it's a little cold to content creators but that's more an issue with commercial entities not wanting to roll out their apps for these platforms. Oh well.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591098695",
			"date_added": 1591183705
		},
		{
			"comment_id": 13,
			"body": "@Halo119: I am terribly sorry, I do not understand (even with google translate, it's giving me a weird interpretation) :(",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1590970523",
			"date_added": 1591205399
		},
		{
			"comment_id": 14,
			"body": "@SSDifnskdjfnsdjk: Yep, 8GB will work for some people, my mum absolutely slays it with a Q9550 Core 2 Quad and 8 GBs of RAM, but she pretty much only uses Word and Powerpoint on that thing.\n\nThe real problem with 8GBs is not the sheer amount, it's that that's the base amount on premium business / multimedia laptops. A new, from Lenovo T14 fresh off their website goes for $1799 with 8 gigs soldered, no upgrade. The first step that comes with 16gb is $2799, and that's just not good enough. It's not good enough to begin with, but it's not upgradeable so double nope. Apple does it and that makes my eye twitch.\n\nAll the latitudes, ideapads, acer swifts etc, in the $500-$1000 range can come with 8 GBs for those who want a dependable, albeit mid-range laptop. For the premium range, let's step up to 16GBs already, it's been time for three years :D",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115",
			"date_added": 1591816336
		},
		{
			"comment_id": 15,
			"body": "@Ansho Rei: Wife uses an iMac with 24GBs of ram, she's the worst tab litterer I've ever seen. She has so many running in Chrome you can only see the favicon. I don't think she has an idea what tabs are already open and just opens a new one. I keep pointing her towards tab organizers, Vivaldi for the tab stacks, she's just not willing to change it. That's the only reason that machine has that much RAM in it.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115",
			"date_added": 1591816472
		},
		{
			"comment_id": 16,
			"body": "@Lajos Nagy: Now that I said it I think I'm enabling her. We need an intervention! :D",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115",
			"date_added": 1591816691
		},
		{
			"comment_id": 17,
			"body": "@Frankwalter: Unfortunately there comes a time when you can't work around needing more memory. My 'work-work' is very opsy, virtualisation heavy. Some days all I do is run the browser and poke AWS management console, some days I have to run docker containers. My 'other-work', which is more a hobby at the moment is photography and videography, so my desktop PC is a Ryzen 7 3700x with 64GBs of decently quick DDR4. Photoshop pisses through that like tissue paper once I start frame stacking for instance. It's a monster of a machine and Photoshop/Davinci Resolve/Lightroom/Capture One etc can kick it to the curb real fast if I'm not careful. I started looking for a laptop that can do both the ops work and the media heavy stuff if need be, and I just can't imagine either with 8GBs of RAM. There are multiple options, currently using a Macbook Pro 2017 15\", which does this type of hybrid stuff _very_ well, but the keyboard is such a steaming heap of horse shit that I'd rather dual boot KDE plasma and Windows on a different laptop with a good keyboard than to put up with this one (I know the 16\" is excellent, it's also $2800 :( ). Even though all the other aspects of the laptop work fine. So this brought me to realising that 8GBs is still pretty much the normal even in the high-end. You'd have to explicitly want 16 or more to be given it. In some instances it's a massive price hike, in other instances it's a custom build with weeks of lead-time. I'm not against 8 being an option, or even the norm in the mid-range, but when you're looking at $1300-2000 laptops that come with really abysmal 1080p displays (TN, or just bad IPS), and 8GBs of RAM, I think there's a problem.\n\nPS.: if you don't mind me asking, what type of work is it that requires lots of RAM but can be done in the cloud comfortably? ",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115",
			"date_added": 1591902610
		},
		{
			"comment_id": 18,
			"body": "@Frankwalter: Thanks for the detailed explanation. That sounds like a fun way to blow up dozens of gigabytes of memory :)",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115",
			"date_added": 1591909136
		},
		{
			"comment_id": 19,
			"body": "@Maycontainnuts: heya, thanks a lot for that, I've just seen the message. Will read up and see what I can do! :) I've no pictures of the EliteBook, if I ever get to put my paws on one I'll take it to a billion pieces and take photos of it. Current lineup is Lenovo and dell stuff mostly :)\nHeard of Luis Rossman, I think he's the kind of guy who has an attitude but can back it up with being right most of the time. Cool guy. I think hardware people buy should become their property. Software... not necessarily but the hardware I should be able to do with as I damn well please once I've paid for it.\n(I also think software should become fair game if the original maker no longer maintains it. Like a copyright expiry or something after a few years)",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592151175
		},
		{
			"comment_id": 20,
			"body": "@Maycontainnuts: Heard about the John Deere situation and I find it absolutely despicable. One thing to try and hang on to intellectual property they spent money developing, yet another entirely to lock in repair just for its own sake. If the farmer can't get to the fusebox without invalidating the bootloader or DRM or whatever else they're pulling, they will lose tens of thousands of dollars in crop. Apple aren't as hostile, but they don't make it easy for sure. The T2 chip does a bunch of things other than hardware encrypting the internal SSD, but it's one of those things you can still avoid to be bit by. I simply back up religiously.\n|  <- these are a good idea btw\nDid my research yesterday and ended up with an uberseedbox plan, some £12 a month or similar and it gives me 12TB up, unmetered down, 2TB storage and enough cpu to run Plex should I wish to. Then I spent the rest of the evening figuring out Usenet, sonarr, indexes nzbs all those things. It's nice to be able to torrent without getting my shit deep packet inspected. Which I suspect my ISP does, as my DNS queries start timing out the second I start a torrent on my home computer, even if it's just a new Manjaro KDE build. That's with VPN of course. They just know. Somehow. Either that or they simply throttle high throughput VPN, which I've noticed through work VPN stuff as well. Seedbox, sftp or synchthing. Eat that, Virgin media.\n|\nNot a huge proponent of piracy, but mostly due to convenience of Netflix and its competitors. If there's something I'd like to watch or show my kids that I can't pay for in any way, I will download it without second thought. It's mostly old movies or dubs otherwise hard/impossible to come by.\n|\nIt's the Eos R, I love it for the photos it takes and it's a decent video camera also. Should've gone with the Fuji XT4, but I had other Canon gear and wanted to keep the kit small. Used to run 3-4 different lens mounts and that's super unwieldy.\n|\nI'm considering buying a few popular second hand laptops for the express purpose of disassembling, cleaning, photographing and reselling them. I'm lucky enough to be able to swing a £2-300 loss on a passion project and if it's of at least that much value to the world, why not! Still thinking about the best way to go about organising everything, but I will give it a go. I know people mod the crap out of older thinkpads that I love for what they represent anyway (linux friendly, repairable, expandable).\n",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592328393
		},
		{
			"comment_id": 21,
			"body": "@Maycontainnuts: re tapes: yup, I did go for LTO5 tapes, because they're a lot easier to work with if you don't want proprietary software. Of course if you already know what you're doing LTO4 are fine, but LTO5 gives you LTFS support, which is nice. Drives are a little more expensive, but not all that much on the long run.\n|\nas for servers with older CPUs, such as 2011v3 , 2650 or similar... do have a look at newer Ryzen chips. They do with 6-8 cores what older chips did with 20+. It's absolutely insane what an 8 core consumer grade CPU does to older Xeons. Max memory is limited of course, depends on how much you want/need. And then you can throw in more grunt still, later, that 3950x is also nuts.\n|\nput in bids for three lenovo thinkpads. Two for the express purpose of disassembly and one for personal use. T420, T430 to take apart and put back together. T480 to kit out and use as my personal machine. Macbook Pro had its fun, time for a good keyboard.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1592081395",
			"date_added": 1592416367
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv",
			"user_name": "Lajosnagy",
			"date_added": 1588973442
		}
	]
}