{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1586237062_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3": 1
	},
	"next_comment_id": 21,
	"comment": {
		"1585342480_1HJtxgNm8uvChV6fixT4Y3FiupwfkAjC3d": [
			{
				"comment_id": 1,
				"body": "Just us 8.",
				"added": 1585394536
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 2,
				"body": "This thread might help answer the question over at http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1585342480_1HJtxgNm8uvChV6fixT4Y3FiupwfkAjC3d/How+many+people+use+zeronet",
				"added": 1585394712
			}
		],
		"1585396937_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 3,
				"body": "Maybe a reporting mechanism similar to blockchain governance consensus that will build a list of content and users to blacklist based on the number of confirmed user reports. The software would then automatically blacklist the content addresses and users that have been reported and confirmed more than an agreed number of times.\n\nEdit: Just read about blocklists in zeronet. Not automatic but great that it exists.",
				"added": 1585398212
			}
		],
		"1585399613_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 4,
				"body": "@blurhy\nI think it will be an ongoing problem. While a small minority of people may want to create and publish such content you will always have a much larger collection of people who will consume said content. Supply and demand I guess.  I think that if you reduced the demand then the supply would still exist in some way, shape or form. I am certainly no expert in these things but I think that such things reflect the state of our society.  Peoples beliefs, taboos, norms vary so much that you will never be able please everyone, all the time. Freedom comes at a cost I guess. How do you decide what is right or wrong and who makes that final decision. Such things as sexual abuse, slavery, etc are things that should just not exist in our day and age but it keeps turning up in the most shocking of places. I don't think a silver bullet exists if all peoples freedoms are to be preserved.",
				"added": 1585403880
			},
			{
				"comment_id": 5,
				"body": "> [arione](#comment_1_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): I genuinely ask: if there are some violent crimes in a housing estate do we just install cameras everywhere so 'good guys' can watch everybody or do we educate people in self defense and allow them guns?\n\nWhich one of your suggestions will stop the violent crime? I know which one will create more violent crime.",
				"added": 1585405255
			},
			{
				"comment_id": 6,
				"body": "> [xerog](#comment_31_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv): Which one? Seriously!?\n\nThe original question as I read it was how can we stop such things from happening on a network without blockchain. Are you suggesting that just educating people will bring a halt to all the depraved goings on in a computer network such as zeronet? Seriously!?",
				"added": 1585405970
			},
			{
				"comment_id": 7,
				"body": "> [moor](#comment_409_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): idk about all of that other stuff but about ddos, to use it to take down stuff like this \"nth room\" i think most people would be more than OK with it.\n\nThis still comes back to the problem of \"most people\". How do we determine \"most people\" and then who, if anyone, presses the \"START\" button on the ddos attack if \"most people\" agree that it should go ahead?",
				"added": 1585442676
			},
			{
				"comment_id": 8,
				"body": "> [moor](#comment_410_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): aspidochelone\n\nA vigilante mentality will just cause problems for innocent people on the network and solve nothing. As @aspidochelone said, DDOS censorship only harms a network.",
				"added": 1585446078
			},
			{
				"comment_id": 9,
				"body": "I solved it! Lets turn off the internet and go back to TV, books and console video games. The good old days when nothing bad ever happened..... NOT!!",
				"added": 1585446910
			},
			{
				"comment_id": 10,
				"body": "> [moor](#comment_411_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what i meant is to ddos sites doing shite like \"nth room\" and not anything else. ddos is a form of free speech and can be an action fight evil, this being a perfect example (assuming ddosing is viable).\n\nFair enough. I guess I was thinking more along the lines of something that can be built into and be part of the zeronet software itself. What you say is true but I don't think it would work long term. Sites like this would move somewhere else and start up again. That sort of thing is definitely something that needs to be reported to the relevant authorities.",
				"added": 1585450436
			},
			{
				"comment_id": 11,
				"body": "At the end of the day I don't really give a fuck! After all i'm not Batman even though a few people say i look a lot like him. It's usually night time and i'm wearing my Batman costume. Just saying..... zeronet rocks!!",
				"added": 1585558974
			}
		],
		"1585516116_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 12,
				"body": "I'm fine, thanks for asking. Working, eating, sleeping, taking the occasional dump as per usual. Still seeing many people out and about. Mainly the older generation which I find a bit odd. Country Oz if you're wondering. My keepers have stopped us slaves from interacting with each other now which is interesting. I like it but then i'm weird apparently...... Take care @bigbadbob and make sure not to miss the news. It's all true you know....  |:{)",
				"added": 1585561238
			}
		],
		"1585431659_17Z8aUjWp2GECRJJUr4NXvE8byWXg68s8A": [
			{
				"comment_id": 13,
				"body": "Have you checked your sock draw?",
				"added": 1585566631
			}
		],
		"1585634533_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 14,
				"body": "I better stop posting pictures of my cat. \"THE BEAST\" might want to eat it. That would be a bad thing by the way.... Do you think that they will write a book about this? If they do then i'll wait for the film version. So much easier on the poor old eyes.",
				"added": 1585641146
			}
		],
		"1585732050_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 15,
				"body": "This looks great but it reminds me of a couple of other platforms very similar:\nhttps://d.tube/\nhttps://bittube.tv/\nNo doubt more exist but which one to use? Decisions, decisions.....",
				"added": 1585740762
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_1990_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The most decentralized and P2P platform, which is LBRY.\n\nThank you for your recommendation but the https://lbry.com/privacypolicy worries me a bit.\nPeertube looks interesting:\nhttps://joinpeertube.org/",
				"added": 1585746673
			}
		],
		"1585844255_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 17,
				"body": "Here endeth the [lesson](https://guides.github.com/features/mastering-markdown/).",
				"added": 1585897681
			}
		],
		"1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL": [
			{
				"comment_id": 18,
				"body": "@decentrack Do you have something better in mind?",
				"added": 1586602034
			},
			{
				"comment_id": 19,
				"body": "So, after all that waffle my question still remains unanswered.  Do you or any one else have something better in mind? In other words, does anything exist similar to zeronet that is fully decentralized?",
				"added": 1586694456
			},
			{
				"comment_id": 20,
				"body": "> [blurhy](#comment_396_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): For sure. I've already mentioned it multiple times, in the wiki, and this topic\n\nI [see](https://hackernoon.com/decentralized-cloud-storage-how-it-will-change-the-face-of-the-internet-12-pc1fw3476). Thank you and [goodbye](https://fediverse.party/).",
				"added": 1586695972
			}
		]
	},
	"comment_vote": {
		"34_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": 1,
		"1_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes": 1
	}
}