{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "互联网时代，我们解决了“信息不对称”的问题了吗？",
			"body": "信息不对称这个词，我们已经听过很多次了，在园林苗木行业初发展之际，一批目光敏锐的苗木人就是因为掌握了更多的信息，而率先在市场上赢得了先机。一批优秀的苗木经纪人崛起，因为手头上掌握了更多的需求和供应信息，成为了市场上的赢家。而很多供应方和需求方都没有意识到，在通过经纪人交易的过程中，他们与其说付出的是中介费，还不如说是付的是信息租金。\n&nbsp;  \n到今天，信息经济学逐渐成为新的市场经济理论的主流，许多人开始意识到，信息不对称对经济的影响有多大，而信息经济学也认为，信息不对称造成了市场交易双方的利益失衡，影响了社会的公平、公正的原则以及市场配置资源的效率。同时，也揭示了信息如同资本、土地一样，是一种进行经济核算的生产要素。市场经济的本质是用价格信号对社会资源进行配置，社会资源的分配和再分配过程实际上是人们围绕价格进行资源博弈的过程，对任何一种资源的优先占有都可以在博弈中获得相关的利益，信息也是这样。\n&nbsp;  \n园林苗木行业，在以前并不能完全互通有无的时候，很多人凭借信息赚了钱，然而进入互联网时代之后，互联网推进了信息透明化，但我们真的就已经解决了“信息不对称”的问题了吗？\n&nbsp;  \n&nbsp;  \n&nbsp;  \n信息不对称的原因有哪些？\n&nbsp;  \n虽然之前没有听过专有的理论来解释信息不对称，但做生意的苗木人都知道信息不对称是什么意思，毕竟大多数人都曾经因为信息不对称或收益或受害，那为什么会产生信息不对称？\n&nbsp;  \n首先，与人有关。更确切的说是与人的知识水平有关。大多数人的文化水平是不一致的，或者说阅历见识是不同的，所以本身掌握的信息也会不一致。其次，这是社会分工越来越细的必然性。以园林行业为例，园林苗木可以细化到各种不同的分工，分工不同，各自掌握的信息也不同，例如种植户大多掌握成本的信息和苗木价格信息，但经纪人掌握了更多的苗木数量和分布信息等。最后，信息不对称还来自于信息掌握人员对信息的封闭和垄断。举例来说，以前，苗木经纪人手里掌握了许多供应方的信息，但是这些信息是苗木经纪人通过全国各地到处跑，花了许多时间精力金钱的代价才掌握在手中的，这些信息的来源也是经纪人们付出了很多成本的，他们需要用这些信息来回报自己的付出，因此，自然在提供信息的时候，他们需要收取费用，并且不会全部提供。\n&nbsp;  \n互联网时代有没有解决信息不对称的问题？\n&nbsp;  \n进入互联网时代之后，我们认为信息不对称的问题解决了许多。原因是，没有互联网的时代，因为大多数需求方对于产品的来源和数量以及价格都不太清楚，所以形成了高价卖苗的习惯。苗木的利润高得吓人。而进入互联网时代之后，苗木的信息进一步透明，需方能通过网络了解更多苗木资源，而供方更可以通过网络阐述供给诉求，价格逐步趋向理性透明。\n&nbsp;  \n但这是不是就说明互联网使信息回归到对称的时候了呢？\n&nbsp;  \n不一定。\n&nbsp;  \n互联网的确推动了行业信息不对称问题的解决，但解决的只是一部分的信息不对称，也就是我们说的，需求方在哪里，供应方在哪里，哪里有苗卖，苗木的理性价格是多少的问题，供应方和需求方不再是一对一的对话，而成为了多对一。营销意识的渐渐兴起，许多供应方也会积极的通过各种方式，如媒体、展会、平台等展示自己的产品，供需求方选择。价格方面也回归理性，需求方通过自己本身的采购团队也能收集许多的采购信息，虽然说不是完全的解决了这方面的信息不对称，但在很大程度上，告别了过去睁眼瞎的状况。\n&nbsp;  \n而深层次的信息不对称，指的是产品的品质、交易过程中所能提供的服务、能否按照约定的时间交付产品、以及交易双方能够达到互相信任等问题。\n&nbsp;  \n产品的品质自不用多说，价格虽然透明，但并不代表你用低的价格能买到质量好的苗，甚至并不能代表你用约定好的价格买到你看好，而供应方而同意供应的苗，在起苗运输的过程中偷梁换柱、鱼目混珠，这种事情，在苗木行业并不少见。\n&nbsp;  \n产品的服务也能够理解，需求方现在要求的最常见的服务是保证苗木的存活率。\n&nbsp;  \n按照约定的时间交付产品，也就是苗能否如期的送到需方的工地上，如果不能，造成的损失如何承担。\n&nbsp;  \n当然，这也并非需方都要考虑的问题，供方也因为按照要求提供一切服务之后，却收不到应有的款项，或者说需方未按照约定的账期付款，而是想尽办法一拖再拖，这也就涉及到双方的信任问题，因此，现在拒绝账期，只接受现金交易的供应方也越来越多。\n&nbsp;  \n&nbsp;  \n&nbsp;  \n更多的信息不对称如何来解决？\n&nbsp;  \n产品来源、数量、价格这些信息不对称的问题，我们大多都可以通过互联网来解决，那么深层次的信息不对称如何来解决?\n&nbsp;  \n谁都无法保证能完全解决信息不对称的问题，但现在和未来互联网平台却是选择之一。平台作为中立的第三方，了解供需双方的需求，从需方的角度上来说，平台会为需方解决第一层次的信息不对称，也就是苗木的价格、数量以及供应方。同时，为了满足需方的要求，也会从不同的维度对供应方的产品进行挖掘、解构和展示，例如，一棵苗木的所有数据，包括原始图片，大小、冠幅、分枝点、土球等苗木自身的数据，然后是价格细分，苗木本身价格、物流运输价格等等，再到供应方的位置、个人信息等。\n&nbsp;  \n同时解决部分深层次的信息不对称问题，首先是产品的品质问题，平台通过联系供应方，能保证最终到达需方手中的产品也一定是最初需方看中的品质的产品。其次，产品的服务，平台围绕产品所做的所有工作都是产品的附加服务。第三，在时间维度上，约定供应方按照合同约定时间让产品到达需方手中。\n&nbsp;  \n也许有人要问，平台为什么有这样的约束力，首先是因为对供方而言，平台与其的联系不单单只是一笔生意，而是能给其提供后续更多的合作。而且平台也不单单只有一家供方可以选择。同时，交易的资金过渡到作为中间方的平台，如果及时交付，供方才能收到全部款项，这也解决了深层次信息不对称中间的双方信任问题，这个信任并不是供需双方对彼此的信息的，而是双方都将信任给予了与供需双方没有利益冲突的平台。\n",
			"added": 1525530294
		},
		{
			"topic_id": 2,
			"title": "VPN帮你翻墙？还是先顾着自己的隐私再说吧",
			"body": "中国的互联网并不是真正开放的互联网，有时候很多人耐不住自己想要窥探外面世界的好奇心，选择用翻墙这种方式打开世界的大门，而VPN（虚拟专用网络）就是看似用来帮助你混淆自己踪迹的帮助者。可是，你真的了解VPN吗？它真的老老实实的只为你工作吗\n&nbsp;  \n中国的互联网并不是真正开放的互联网，有时候很多人耐不住自己想要窥探外面世界的好奇心，选择用翻墙这种方式打开世界的大门，而VPN（虚拟专用网络）就是看似用来帮助你混淆自己踪迹的帮助者。可是，你真的了解VPN吗？它真的老老实实的只为你工作吗？\n&nbsp;  \n三年前斯诺登泄密事件揭露的东西，从安全的角度看对互联网服务提供商来讲并没有太多的帮助，甚至可以说做的有些过火。同时也模糊了反恐政策的概念。而当新闻爆出像NSA的Vulcan数据库或者它的Diffie-Hellman策略时，任何一个网络隐私主义者看过了都会心中发颤。突然间似乎每个人都需要重新评估下某些网上用于保持隐私的工具——VPN。\n&nbsp;  \n传统VPN简介\n&nbsp;  \nVPN（虚拟专用网络），这款工具通常用于混淆用户的IP地址，或在用户进行WEB浏览时增加一层安全保护。它会把你的流量转到加密且安全的VPN服务器上。不同的人使用VPN的目的也不同，有些人可能是用它来改变自身的IP地址，这样就可以获取一些其他地域的媒体内容，或者能匿名下载一些东西。还有的人希望以此规避广告商的网络追踪，或者防止盗用WIFI后的负面影响，甚至只是为了在他们访问特定网站时隐藏真实的IP地址。\n&nbsp;  \n然而VPN的质量也是参差不齐的。事实上某些存在问题的VPN会让用户的安全更加脆弱。某些VPN是禁用了torrent下载的，还有些会记录下信息，跟踪上网行为，或者按照当地的法律对数据进行保留。\n&nbsp;  \n去年我开始尝试整理一份好的VPN列表，虽然网上已有不少类似的VPN清单，但是通常都充斥着附加内容链接，很难确认其准确性。这份VPN比较图表，里面概述了VPN业务流程、日志记录、服务配置和其他特性。但它存在矛盾策略，并误导读者，声明各类的服务是100%有效的。但其实大部分内容是从真实的VPN网站导入的，这就意味着可能会混入一些错误信息。",
			"added": 1525531226
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_1Fv1zTzqXsRhzDPzrBmRC9niGS6szBq91Y": [
			{
				"comment_id": 1,
				"body": "几个月的研究后，笔者的尝试都失败了。所以现在笔者仍然不能推荐一组安全的VPN列表给大家。相反的是，研究结果刷新了笔者对目前VPN的三观。当涉及到日志记录的时候，评估可行性和验证准确性也不是件容易的事，所以，我觉得与其给大家一个简单的列表，还是提供一些指导方针更加靠谱，让大家自己了解在本年度哪些VPN是有效可用的。\n&nbsp;  \nVPN不是用来匿名的\n&nbsp;  \n关于VPN的一个常见的误读是：它们会给大家提供匿名功能，即使是针对民族主义者。但是，安全研究员Kenneth White表示：\n&nbsp;  \n    “如果政府对目标进行专门的监测追踪，VPN是不足以做到这一点的。”\n&nbsp;  \n事实上，VPN声称的会给提供用户匿名性，是“不可行的，不负责的，或者两者兼备的”。DNSleaktest.com的站长Jeremy Campbell在邮件里告诉记者：\n&nbsp;  \n    “为了实现匿名去使用公共VPN是非常愚蠢而危险的，无论服务配置的有多么安全，匿名技术本身并没有在这里实现。VPN服务要求你信任他们，但匿名系统本身是没有这个属性的。”\n&nbsp;  \nWhite没有坚持完全放弃VPN，但是他警告说它应该作为一个辅助工具，而不是一个隐私的解决方案，他表示：\n&nbsp;  \n    “相反，像专门的隐私工具如Tor浏览器之类的（里面可能包含了信用良好的VPN），那就是可以使用的。它们不仅实现了匿名化属性，而且浏览器已经进行了大量定制，以实现网络隐私的最大化（比如弱化了cookie、Flash、Java插件等特征）。”\n&nbsp;  \nTor分布式网络，会尝试在多个中继传输流量来实现匿名。但其实它也很难进行核实，没有人知道Tor这样是否能够获得百分百成功。Tor浏览器最近受到了美国国防部的瞩目，这只会强化这种担心。某些批评者认为，Tor会让人们更容易依赖过时版本的Firefox，但这些东西都不能保证是万无一失的。\n&nbsp;  \nJohns Hopkins大学的密码学教授Matthew Green表示：\n&nbsp;  \n    “某些在俄罗斯出口节点的恶意Tor，实际上会偷偷修改二进制文件。所以，如果你不幸在Tor下载文件时碰巧遇到了这些节点，它们可能会将它转换成恶意软件。”\n&nbsp;  \n尽管Green并没有听说过VPN发生过这样的事，但他指出这样的攻击是存在可能的。与多数VPN不同，Tor和Tor浏览器通常用于高风险的情况，工程师需要迅速修复安全漏洞，这样的方式可能不适用于所有的VPN。",
				"added": 1525531418
			},
			{
				"comment_id": 2,
				"body": "用VPN来BT下载安全吗？\n&nbsp;  \n某些VPN提供商会禁用p2p，如果有必要还会把用户的名字给版权所有者。代表版权所有者的利益的，可能会取消惯犯的账户。希望使用VPN进行torrent下载和流媒体观看的亲们，可以寻找那些特殊的服务提供商（或者不保留日志），但是问题又来了，Campbell表示：\n&nbsp;  \n    “然而，我们并没有办法验证VPN提供商所说的话。大家必须依靠新闻报道和网上论坛的讨论等等，来判断服务提供商的声誉。”\n&nbsp;  \n看来，必须时刻保持警惕才行。\n&nbsp;  \nVPN可以“防御”广告追踪？\n&nbsp;  \n尽管VPN能掩饰你的IP地址，但它不一定能保证你免受间谍广告和追踪的困扰。\n&nbsp;  \nCampbell表示：\n&nbsp;  \n    “VPN提供的防广告追踪的技术可以忽略不计，因为IP掩盖是一个弱标志。网络广告更倾向于cookies、supercookies和浏览器指纹技术，这些东西VPN是无法进行保护的。”\n&nbsp;  \n为了防止无处不在的广告跟踪，广告阻断器uBlock、uBlock origin，以及追踪阻断器PrivacyBadger或Disconnect会提供一定程度的保护。禁用JS代码，或者使用Firefox下的NoScript可以消除一些指纹。更高级的用户可以使用虚拟机或者沙箱浏览器。当然，Tor浏览器也能防止产生特定浏览器指纹。\n&nbsp;  \nVPN让你更危险？\n&nbsp;  \n用户使用VPN的是为了保护自身网络安全，特别是在处于公共WIFI之下的时候。GoGo被爆出使用了Youtube的伪造证书，这可能会泄露用户的流量，包括用户的Youtube密码。\n&nbsp;  \n因为VPN建立了用户和VPN商服务器之间的通道，所以用户对于VPN提供商的信任非常重要。毕竟提供商能看到和记录你所有的流量，甚至可以更改你的流量内容。一个VPN的配置不当，黑客就可能直接访问你的本地局域网，这比别人在咖啡店网络下，嗅探你的流量更加可怕。\n&nbsp;  \n    “如果VPN服务供应商不老实的话，你只能自己做祈祷了。你得时刻担心是否会在本地局域网被人黑掉，若是使用了一个粗制滥造的VPN服务，很可能就会把自己推入虎口。”\n&nbsp;",
				"added": 1525531469
			},
			{
				"comment_id": 3,
				"body": "预共享密钥\n&nbsp;  \nWhite提供了一个VPN的列表，在网上已有共享密钥发布：\n&nbsp;  \nGoldenFrog、GFwVPN、VPNReactor、UnblockVPN、IBVPN、Astril、PureVPN、PrivateInternetAccess、TorGuard、IPVanish、NordicVPN、EarthVPN。\n&nbsp;  \n    “如果我知道了你正在使用的VPN预共享密钥，并且我控制了你所在WIFI的热点，那么就可以进行中间人攻击并且解密你的上网行为。也就是说，当黑客拥有这预共享密钥时，您的网络安全系数就降低了。”\n&nbsp;  \nPPTP的代替品\n&nbsp;  \n一些VPN还使用了老掉牙的的PPTP VPN协议，这在根本上就是不安全的。更好的选择包括IPSec（有人积极维护）、L2TP/IPSec、IKEv2以及OpenVPN等等。\n&nbsp;  \n在上述的几个选项中，IPSec可以设置为不需要安装额外的软件，但有人认为这是故意破坏和削弱NSA（美国国家安全局）的力量。OpenVPN比它还要安全，但是搭建手法更加复杂，需要第三方软件的帮助，以及用户进行正确且复杂的配置。\n&nbsp;  \n根据High-Tech Bridge最近的研究发现，SSL VPN中，有90%会使用不安全的或者过时的加密。而有77%使用了不安全的SSLv3（甚至SSLv2）协议，76%用了不可信的SSL证书（黑客可以更轻易的进行中间人攻击，拦截VPN连接中的流量），更有一大部分用的不安全的RSA密钥长度的签名，以及不安全的SHA-1签名。不管你信不信，其中还有10%存在心脏出血漏洞。\n&nbsp;  \n数据保留和日志记录\n&nbsp;  \n一些VPN会根据本国或当地的法律，进行日志信息保存。而且许多VPN服务提供商会记录大量信息，比如在特定的用户来连接时，是从哪里、从什么时候连上的，甚至还有他们做了哪些连接。\n&nbsp;  \n甚至有些VPN服务提供商，日志量少时会记录下重要日志，比如连接的IP地址和用户名，以及内部路由使用的内部负载均衡和服务器维护。某些VPN服务提供商的日志记录可能会很快销毁，而其他的由于本地的相关法律，处理方式会有所不同。不管怎样日志里保存的信息都是足以破除用户匿名性的。\n&nbsp;  \n仔细阅读服务条款会帮助你确定服务商日志维护保留的情况，并可以了解他们会如何使用收集到的信息。但是其中的真伪也很难验证。有人认为进行犯罪活动时VPN也会保护用户的身份，但人家美国政府已经与世界上数十个国家签署了司法互助条约了。",
				"added": 1525531501
			},
			{
				"comment_id": 4,
				"body": "您已经用完了限额,请联系站长 xiaolan@protonmail.ch 增加限额",
				"added": 1525531539
			}
		]
	},
	"comment_vote": {}
}