{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "> [harker](#comment_16_1PjG3bDsaJ9ZEdpZKh69YSAsELb2NfUawu): <DIV STYLE=\"width:expression(alert('anyunix'));\"> [...]\n\nlolz ... test it somewhere else ... guys this kid is just fascinate about hacking .. new boy in hackers world .. lolz",
				"added": 1536216707
			}
		],
		"1535881177_147dKWfEsmiinRTaUvoY3gXWXyk1gmZdtL": [
			{
				"comment_id": 2,
				"body": "why don't we people together create a zeronet news portal and information will be updated by ourself",
				"added": 1536216827
			},
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_637_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): This would be ideal. But having a bot auto-mirror all the major news sites/articles would really help keep people on ZeroNet while we don't have many people producing unique content.\n\nbut copying content or cloning bigger media houses digital portals will cause some legal issues and if it is related to BBC like media houses that surely zeronet will face a horrible situation , except if we display rss feed from BBC thats ok , but cloning a web portal of media houses like BBC , that is definitely wrong idea ",
				"added": 1536226663
			},
			{
				"comment_id": 4,
				"body": "> [kaffie](#comment_638_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Not cloning the web portal. Just mirroring the article content. As for legal issues, I honestly really doubt that. ZeroUP has tons of pirated stuff, we have various torrent sites, pirated movies on kopykate, pirated music on zerolstn, hell there's even CP on here. I doubt news articles would cause an issue compared to that other stuff.\n\nBBC is bigger house in media , so it will be a big issue if they take any legal action , and as i come from similar profession i aware about that as Zeronet is not about anonymity it is about user privacy  .. but RSS feed can be easy to create a portal where user can get news updates ..  like \n\nBBC RSS Update http://feeds.bbci.co.uk/news/rss.xml\nRT RSS updates https://www.rt.com/rss/\n\netc etc",
				"added": 1536233399
			}
		]
	},
	"comment_vote": {}
}