{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Offline сообщения в qtox",
			"body": "Изначально работали нормально, отсылал сообщения, справа от него вертелся индикатор отправки, когда собеседник появлялся в сети оно ему пересылалось. В последнюю пару дней происходит иначе, клиент отображает что сообщение отправлено, но собеседнику оно не приходит. Пока искал куда задать этот вопрос, немного покопался и выяснил что дело в настройках истории, если включить хранение истории на диске, о offline работают как раньше. Да видимо баг(qtox qTox v1.6.0-91-gb392e2c-obs). Может кто знает как решить или может баг разработчикам закинуть(в eng не силен).",
			"added": 1484739723
		},
		{
			"topic_id": 2,
			"title": "Zeronet и RSS",
			"body": "А тут есть какой-нибудь аналог RSS, который будет оповещать, что на подписанных зайтах произошли изменения?",
			"added": 1484806817
		},
		{
			"topic_id": 3,
			"title": "Zeronet: Как узнать приватный ключ склонированного сайта?",
			"body": "Склонировал CMS-ку местного блога(http://127.0.0.1:43110/152GqEt28SewXSrQAskNCCkR3rCryexWKQ/, кому интересно, но это чисто тестовая страничка которая будет заменена в последствии), немного покрутил css дабы привести к читаемому виду(ну не могу я такие огромные шрифты терпеть) и задумался, а как узнать его приватный ключ для работы из консоли и пр.?",
			"added": 1485174018
		},
		{
			"topic_id": 4,
			"title": "Проверьте zite",
			"body": "Переключил транспорт на tor, вроде работает, можете посмотреть открывается или нет http://127.0.0.1:43110/152GqEt28SewXSrQAskNCCkR3rCryexWKQ/",
			"added": 1487167207
		}
	],
	"topic_vote": {},
	"next_comment_id": 32,
	"comment": {
		"1_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 1,
				"body": "> [shift](#comment_354_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А если в другом клиенте попровобавать повторить?\n\nС другим пока не пробовал. Учитывая сто offline-сообщения это просто отложенная отправка, то может и заработает в другом. Но меня пока именно qtox интересует.",
				"added": 1484747146
			},
			{
				"comment_id": 3,
				"body": "> [voland](#comment_37_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): сейчас 1.7.1 версия, на ней смотрели?\n\nНет, видимо в репозиторий debian не прилетела, обязательно проверю с ней.",
				"added": 1484749756
			},
			{
				"comment_id": 4,
				"body": "> [voland](#comment_38_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): https://software.opensuse.org/download.html?project=home%3Aantonbatenev%3Atox&package=qtox отсюда пакеты? \n> ну или собрать из исходников: https://github.com/qTox/qTox/releases\n> тут трекинг: https://github.com/qTox/qTox/issues\n\nДа, пакеты от туда, туда пока не прилетело, видимо придется руками собирать.",
				"added": 1484806316
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 2,
				"body": "+1",
				"added": 1484747358
			}
		],
		"2_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 5,
				"body": "А все разобрался, там время последнего обновления пишется...",
				"added": 1484810783
			}
		],
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 6,
				"body": "Сначала решил, что автор[Pandorы] неадекватный, а потом увидел имя...вот почему все Михаилы немного невменяемые?",
				"added": 1485155960
			},
			{
				"comment_id": 8,
				"body": "> [voland](#comment_51_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): А пандора жива? Хм, интересный концепт, но  в отличие от диаспоры кажется не взлетит\n\nДа непонятно, вроде запустил, создал учетку и что делать дальше непонятно. Хотя судя по комментариям автора: Интерефйс->Функционал->Эстетика, может оно только для скриншотинга и годится)",
				"added": 1485179184
			},
			{
				"comment_id": 9,
				"body": "> [voland](#comment_51_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): А пандора жива? Хм, интересный концепт, но  в отличие от диаспоры кажется не взлетит\n\nУ retroShare такой-же концепт, и там даже можно початиться с парой анонимусов.",
				"added": 1485179224
			},
			{
				"comment_id": 10,
				"body": "> [antignu](#comment_16_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Так кто тут понял, зачем оно? Как оно должно использоваться, по мнению автора и используется ли кем-то?\n\nАвтор строит свою Децентрализованную Тоталитарную Утопию, https://github.com/Novator/Pandora/blob/master/doc/guide.ru.pdf вот тут 3 главу(про кодекс) можешь почитать, если интересно.",
				"added": 1485240152
			},
			{
				"comment_id": 11,
				"body": "> [voland](#comment_52_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): в RS идея f2f при этом если тор не настроен, то все вываливается всем желающим и не очень, потому там анонимусы крайне сомнительные.\n\nЯ не к тому на сколько анонимны тамошние анонимусы(ZeroNet в этом плане тоже не особо анонимен), а к тому что они там в принципе есть, в отличии от пандоры.",
				"added": 1485240968
			}
		],
		"3_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 7,
				"body": "> [zalex](#comment_64_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): В ZeroNetDirectory/data/users.json найди свой сайт, и там должен быть пункт Private Key.\n\nАга вижу, спасибо",
				"added": 1485175872
			}
		],
		"1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7": [
			{
				"comment_id": 12,
				"body": "> [dmi](#comment_4_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Да, казалось бы, ничего особенного... после того как Фоменко растолкал народ на тему того, что историю очень легко переписывать (технология простая как пробка) и глупо полагать, что это не сделано несколько раз, сложилась некая общность товарищей с достаточно высоким интеллектом и нереализованным исследовательским потенциалом.Они несколько лет с завидной регулярностью вытаскивают на всеобщее обозрение разные фотки,  тексты, обзоры, аналитику, указывающие на несоответствие официальной истории.\n> Среди всего этого невероятно много пурги. Но количество действительно интересного фактического материала, причем обработанного и очень объемного, кажется начало подходить к критической точке для формирования какой-то общей и более очевидной картины.Видимо на этом радостном моменте их и решили придавить легонько, чтобы чего не вышло.Формально там фиг знает за что - может просто неполиткорректный высер в камментах, каких тысячи. ЖЖ не объяснил.\n> А тусуются они все на LJ потому, что там это оказалось очень удобно: они все друг друга читают и делают себе перепосты того, что подходит под их картину и для своей аудитории. Получается довольно занятный синергетический эффект.\n> А поскольку у многих ЖЖ это единственное место, где их труды аккуратно собраны, перспектива все потерять их не радует.\n> Вот как-то примерно так...\n\nА примеры подобных бложиков будут? Я только wakeuphuman знаю, но там автор явно под веществами...",
				"added": 1487077884
			},
			{
				"comment_id": 13,
				"body": "> [dmi](#comment_5_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Тут немного глубже. Каждый из них собирает свою аудиторию. Если его вышибают из ЖЖ, то есть у него альтернативное место или нет, \"канал вещания\" проседает.Кроме того, дублировать - это лишний труд.Идеально было бы, если бы они всех тут и собрали. Причем если они уйдут с ЖЖ всей толпой (как сейчас и собираются), то это вполне реальный вариант.Дальше - кто хочет камментить, ставит плагин. Порог входа не больше, чем в ЖЖ.Кто просто читает - может через прокси-сайты это делать без регистрации.\n\nА чем тогда RS не устраивает? Это-ж идеальная соц. сеть, совершенно не обязательно связываться с текущей тусовкой, можно создать свою f2f сеть || с ними.",
				"added": 1487079837
			},
			{
				"comment_id": 14,
				"body": "> [dmi](#comment_6_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Подобрал на скорую руку. И только из LJ, чтобы было репрезентативно. Так еще много где канеш.\n> Веселые картинки (фотки) 19 века.http://kadykchanskiy.livejournal.com/316421.htmlhttp://kadykchanskiy.livejournal.com/635647.html\n> По картам с Тамерланомhttp://gilliotinus.livejournal.com/135677.html\n> Про пугачевское восстаниеhttp://alekseyzayats.livejournal.com/3377.html\n> Еще веселые картинки (гравюры)http://kadykchanskiy.livejournal.com/272748.html\n> Про культурный слойhttp://tar-s.livejournal.com/1020843.html\n> Как охотился Николай второйhttp://sandra-rimskaya.livejournal.com/1928592.html\n> Про то, мимо чего бездумно ходимhttp://kadykchanskiy.livejournal.com/594677.html\n> PS. Выводы авторов иногда, эм... \"своеобразные\", но не в них суть, а в самих материалах, которые они находят и в вопросах которые они задают.\n\nспасибо, пойду почитаю",
				"added": 1487139975
			}
		],
		"4_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 15,
				"body": "Не знал о проксе, спасибо",
				"added": 1487169076
			}
		],
		"1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": [
			{
				"comment_id": 16,
				"body": ">Стоит ли вникать в самые быдлотемыи мемчики ради социализации?\nНе стоит. Если тебе действительно что-то надо от конкретного человека(или ему от тебя), то у вас уже ест общая тема для беседы. Все остальное - тупое потребление контента, не трать на это время.",
				"added": 1487570971
			}
		],
		"1_1CDkheadGbhxVvNCHn2nvH7GBDnwm5V8oi": [
			{
				"comment_id": 17,
				"body": "++",
				"added": 1487571218
			}
		],
		"1_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 18,
				"body": ">Особое беспокойство у регуляторов вызывает end-to-end шифрование мессенджеров, которые к тому же отказываются ставить на своих серверах оборудование типа СОРМ и сотрудничать с ФСБ.\nДа все они поставят, когда на ни надавят как следует, большинству их пользователей вообще плевать ан e2e шифрование. Так что децентрализованные im наше всё!",
				"added": 1487571340
			}
		],
		"1_14yvo4Fy5yLJuSmJLN1SPRTCcUM86pEANk": [
			{
				"comment_id": 19,
				"body": "Из современного:\nBlackBerry Q10/Q5/Classic. Да сенсорное, но с удобной клавиатурой. Нативных приложений только маловато, но можно запускать apk-шки.\n\nИз древнего:\nNokia e75 - это просто шедевр смартфоностроения, увы такого уже не выпускают.\nНу и вообще symbian'овские сматрфоны досенсорной эрой были неплохими девайсами.",
				"added": 1488185889
			},
			{
				"comment_id": 24,
				"body": "> [balancer73](#comment_80_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Хуже, чем проприетарщина. Это проприетарщина, которая уже отказалсь от производства своих коммуникаторов и финансовая отчётность которой всё более удручает.\n> В плане свободы и независимости, которые озвучивались в топикстарте, это ну никак не вариант :)\n\nЗато это единственный вариант получить смартфон с клавиатурой и возможностью поставить более-менее современный софт.\nА так symbian, если у nokia и были сервера для скрытного сбора телеметрии, то их давно выключили и отдали под другие нужды. С другой стороны дыры там тоже не закрывали все эти годы.",
				"added": 1488262530
			},
			{
				"comment_id": 25,
				"body": "> [vlad20012](#comment_272_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): GPD Pocket - Как на такой клавиатуре вообще писать-то?\n\nСоглашусь. Нафига впихнули CapsLock и правые Shift, Alt и Ctrl. Power вообще не нужен на клавиатуры, только мешается. Клавиши регулировки звука/яркости тоже не нужны(кому надо настроят на любой хоткей). Ну и от Mod4 и Menu можно относительно безболезненно отказаться.\nВ общем да, клавиатура однозначно отбивает все желание покупать это чудо инженерной мысли.",
				"added": 1488262997
			},
			{
				"comment_id": 26,
				"body": "https://geektimes.ru/post/286412/ Тут еще новый BB KEYone на свежем ведройде выпустили. Тоже с физической клавиатурой на которой можно как нажатиями, так и швайпом набирать. Но, блин, это-же ведроид...",
				"added": 1488275345
			},
			{
				"comment_id": 27,
				"body": "> [tolst0evsky](#comment_12_14yvo4Fy5yLJuSmJLN1SPRTCcUM86pEANk): по ссылке более интересен перезапуск некронокии :-)\n\nЭто уже не Нокия, а натуральная Нокла. Очередной ведрофон, который ничем кроме бренда не выделяется. Думаю фанаты ведроида могут посоветовать небрендованного китайца получше за те-же деньги.",
				"added": 1488350522
			},
			{
				"comment_id": 28,
				"body": "https://www.indiegogo.com/projects/gemini-pda-android-linux-keyboard-mobile-device-phone#/ вот тут чуваки пилят деньги на смартбук с более вменяемой клавиатурой.",
				"added": 1488434071
			},
			{
				"comment_id": 30,
				"body": "> [mist](#comment_35_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Да, клава прямо праздник для всяких вимеров, но дисплей все портит с таким соотношением сторон. По линуксу тоже мало что известно. Но сборы опять успешны, мода что-ли пошла на подобные устройства? Вполне может быть, что будут ещё появляться подобные.\n\nМне нравятся подобные устройства, жду когда выйдут в свободную продажу и буду брать",
				"added": 1488521471
			},
			{
				"comment_id": 31,
				"body": "> [tolst0evsky](#comment_13_14yvo4Fy5yLJuSmJLN1SPRTCcUM86pEANk): Там русская раскладка не поместится.\n\nЭто да, но мне сойдет и в таком варианте. В крайнем случае можно редкие буквы разместить на alt/ctrl/fn+.",
				"added": 1488780524
			}
		],
		"2_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": [
			{
				"comment_id": 20,
				"body": "А где в этой диаспоре найти русскоязычное комьюнити?",
				"added": 1488187761
			},
			{
				"comment_id": 21,
				"body": "Не понимаю я эту диаспору. Ну вот завел аккаунт на diasp.eu, пробую открыть профиль человека с diasp.org, просит авторизацию, вбиваю логин(с доменом) и пасс - не пашет. Это синхронизация еще не прошла или может оно хочет куки с \"третьих\" сайтов?",
				"added": 1488188832
			},
			{
				"comment_id": 22,
				"body": "> [mist](#comment_28_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Если ты зарегался на diasp.eu, то и логиниться только оттуда должен. Закрытые от внешнего интернета профили, должны отображаться через твой под.\n> \n> По тегу #lang_ru\n\nСтранно, я на eu сервере вроде залогиненым остаюсь",
				"added": 1488201528
			},
			{
				"comment_id": 23,
				"body": "> [zeroalx](#comment_22_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi): Странно, я на eu сервере вроде залогиненым остаюсь\n\nА все понял, надо у человека менять diasp.org на diasp.eu тогда отображается...действительно кривовато",
				"added": 1488201624
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 29,
				"body": "> [zernon](#comment_1_1Dif4FhYssQJCe7hFdSDpVbrxEVmFvtYzz): Привет, мое первое сообщение в ЗероНете.\n\n\"ВсЕм ЧмОкИ в ЭтОм ЧаТи!\"",
				"added": 1488459808
			}
		]
	},
	"comment_vote": {
		"1_195q5MTNhdC1Bu38ANoaASrzH42KvcHree": 1
	}
}