{
	"comment": {
		"1557313311_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"body": "Dzika przyroda, i do niej dopasowana muzyka.Piękny Ptak w przestworzach. Pies Haski, który mówi\"Jestem szczęśliwy\".",
				"date_added": 1612993297
			}
		],
		"1548341596_1FZYhmAxsjUgUsDb3maysDUc9nRjfJNQm5": [
			{
				"body": "Stara dobra muzyka; i gorace dziewczyny. Taniec który miał duszę. To nie to co dzisięjsze kiwanie się, jak żyd na szabasie.",
				"date_added": 1612993449
			}
		],
		"1550084392_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"body": "Synchronizacja dwóch aut na lodzie; To tylko Rosjanie potrafią coś takiego zrobić.Polecam obejrzeć.",
				"date_added": 1612994191
			}
		],
		"1616712062_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Trochę szokujący film, nagranie; Wygląda na prawdziwe, to nie jest przedstawienie, teatralne. Jestem przeciw zastrzykom, obojętnie jakim. Według mnie, szczepionki powinny być zabronione. Smutne zdarzenie.",
				"date_added": 1616721508
			}
		],
		"1617203898_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Olbrzymie pieniądze, ktore zostały utopione, /dosłownie /. Pycha ludzka niezna granic, przykładem jest właśnie Dubaj. Bogactwo odbiera rozum i rozsądek. Kiedyś, jak archeolodzy odkopią te miasto? to będą zachodzić w głowę, co się tutaj wydarzyło. Można powiedzieć; dać Małpie brzytwę.",
				"date_added": 1617209218
			}
		],
		"1617586167_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Prawdziwy obraz kraju, złodziei i bandytów, morderców.  Brawo Rosjanie, można tylko was podziwiać  za waszą odwagę  wypowiedzi.",
				"date_added": 1617623141
			}
		],
		"1618186916_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Bardzo słuszne obserwacje, warte przemyślenia. Jeśli tak potraktujemy rzeczywistość? To całe nasze życie może się zmienić, i to bardzo.",
				"date_added": 1618188281
			}
		],
		"1618404947_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"body": "Obejrzałem dwa razy; i dochodzę do jednego wniosku; To jest manipulacja ludźmi. Chcą ludzi nastawić przeciw Rosji; Dlaczego właśnie teraz? Już wyjaśniam. Przez półtora roku, nikt się nie mógł dopatrzeć zależności, pomiędzy świrusem a prawdziwymi zgonami? Właśnie teraz, jak magik w cyrku z kapelusza, wyciągnęli jajko niespodziankę. Czy to jest przypadek? Nie, nie jest. W szarej codzienności nie ma przypadków, ale są zaplanowane akcje Służb Specjalnych. Ponieważ szykują się do wojny ze Wschodem? To dobrze by było, żeby znalazł się jakiś dodatkowy powód. Pinokio sięga do kapelusza i wyciąga niezbite dowody, przeciwko Rosji i Chinom. Pod postacią świrusa, który podobno sieje spustoszenie w naszym kraju. / ta sprawa dotyczy tylko, wyłącznie  naszego kraju /. Mamy zostać mięsem armatnim, więc naiwnych trzeba jakoś podpuścić / otumanić.  . Moja przepowiednia: Ten Film to prowokacja, w celu podpuszczenia ludzi , przeciwko Rosji i Chinom. To jest pierwsza jaskółka, teraz pokażą się następne wypowiedzi obrażonych Polityków i Trolli internetowych. A na koniec DYSKUSJA w TVP-1. I na  innych kanałach. Atmosfera zostanie podgrzana do maksimum. A potem Kamasze, i bratnia pomoc dla poszkodowanych  ukrów.  Czas pokaże, jak to się potoczy dalej?",
				"date_added": 1618432393
			}
		],
		"1618593380_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"body": "Dosyć wiernie oddaje atmosferę pracy w tym środowisku. Oczywiście są to opowieści o niczym  konkretnym. Taka propozycja pracy dla CIA, itp. Dobry  haker, który pracuje dla korporacji. Zły haker, to ten który pracuje prywatnie. na własny rachunek. Ci ludzie naprawdę dużo potrafią, jednego tylko nie potrafią? Wykorzystać tej - WIEDZY - mądrze. Wyrośnięte dzieci, tak są predstawiani szerszemu ogółowi. A jak jest naprawdę? . ",
				"date_added": 1618693239
			}
		],
		"1618584606_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"body": "11- Września, to nie był zamach terorystów. Pandemia, to zamach na wolność ludzi. Kto to zorganizował ten teatr? Bo to jest jednak  przedstawienie teatralne. ",
				"date_added": 1618694144
			}
		],
		"1618581479_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"body": "Jest to przekaz, który trzeba zrozumieć. Ilu ludzi to Rozumie?",
				"date_added": 1618694322
			}
		],
		"1618764040_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "To wszystko jest przygotowywane od lat, czy to jest Przypadek?Czy ludzie zdają sobie z tego sprawę? Kim jesteśmy dla nich? Czy jesteśmy fermą mięsa?",
				"date_added": 1618783208
			}
		],
		"1615414066_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Piękne obrazy; i muzyka nastrojowa. Malarz i kompozytor, razem wielkie mistrzostwo.",
				"date_added": 1619078786
			}
		],
		"1618718897_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"body": "Dopiero na zdjęciach widać zmiany jakie zachodzą w Rosji.  To już nie jest dawny związek radziecki. To już jest nowa jakość.  Można tylko pozazdrościć. I jest czego?",
				"date_added": 1619079135
			}
		],
		"1619231523_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Warto obejrzeć? Temat dla zaawansowanych w swoim rozwoju. Trzeba tego wysłuchać ze zrozumieniem. Wstęp właśnie mówi o tym. Pytanie? Kto nam zakłuca czas? Pytanie jest prowokujące. Ale bardzo ważne. ",
				"date_added": 1619232755
			}
		],
		"1619504106_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"body": "Jestem ciekaw, co tak naprawdę \"ON\" myśli? Ogólnie mówi rzeczy, o których powinniśmy my wszyscy wiedzieć cały czas.",
				"date_added": 1619520895
			}
		],
		"1619529580_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Trochę trudno to skomentować? To tylko dawni pasterze owiec, nic więcej.",
				"date_added": 1619530408
			}
		],
		"1619873750_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"body": "Jeśli to nie Fejk? To może być prawda. Kraj jest realny. Tam mają różne pomysły?",
				"date_added": 1619888868
			}
		],
		"1620415187_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Wiedza która może zaprocentować twoim zdrowiem, warto posłuchać człowieka.",
				"date_added": 1620456261
			}
		],
		"1619266467_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"body": "Temat ciekawy i typowo szkoleniowy; Warto wysłuchać, można się sporo nauczyć na tym materiale. Nie są to żadne rewelacje, ale dla początkujących to jest spora działka wiedzy takiej na codzień.",
				"date_added": 1620554106
			}
		],
		"1620582124_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Dobry materiał, polecam; obydwie części które tworzą całość.",
				"date_added": 1620658394
			}
		],
		"1620813360_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Kobieta, wie co mówi; zgadzam się całej rozciągłości.",
				"date_added": 1620813489
			}
		],
		"1622345953_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Warto się z tym zapoznać? Świadomość, co to jest? i jak funkcjonuje? Czy jest drugie życie?",
				"date_added": 1622341380
			}
		],
		"1622601521_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Tak, mają rozmach w swoich budowach?",
				"date_added": 1622624837
			}
		],
		"1621966344_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"body": "Tak, wszystko zmierza w tym kierunku; Wojna to biznes, dla banksterów.",
				"date_added": 1622745030
			}
		],
		"1623268792_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Jak zwykle ciekawe tematy; świadomość co to jest? Jak to w ludzki sposób wytłumaczyć? Jednak można to zrobić, w ciekawy sposób. ",
				"date_added": 1623262488
			}
		],
		"1623326428_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"body": "Tak to prawda, pamietam i zgadzam się całkowicie; To jest wspaniałe.",
				"date_added": 1623329105
			}
		],
		"1624491654_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"body": "Dobry i wartościowy materiał; zapoznać się z nim obowiazkowo. ",
				"date_added": 1624538895
			}
		],
		"1623673766_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"body": "Kiedyś, to się nazywało Skok na kasę. A dzisiaj to nzaywa się podatek kastralny.  .pozdrawiam",
				"date_added": 1624549021
			}
		],
		"1622251625_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Pomału realizują swoje plany, my się patrzymy? I nic nie zauważamy. ",
				"date_added": 1624551162
			}
		],
		"1623530135_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"body": "Kto za nim stoi?Czyje pomysły on realizuje?Napewno jest to czubek piramidy.",
				"date_added": 1624802850
			}
		],
		"1621076890_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"body": "To pokazuje jak wszystkie systemy są słabe. Jak bardzo są skomplikowane i nieudane? Dlaczego tak się dzieje? Bo komuś zależy na tym,, żeby tak było.",
				"date_added": 1624803761
			},
			{
				"body": "Uwaga; 5-minut opuźnienia ma ten program. Było to celowo zrobione, audycja na żywo.",
				"date_added": 1624804079
			}
		],
		"1624993872_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Słucham co on opowiada? To takie bla, bla, bla, Czyli takie pierdu, pierdu. Są momenty kiedy mówi prawdę? Ale to wszystko jest , ustawka, Jakiś ukryty cel. Jaki to jest Cel? Zgadnijcie sami. Kośiół to przeżytek i oszustwo. Tysiąc lat to funkcjonoweało, ale dzisiaj już przestało. Ostanie barany, idą do rzeźni na mięso. To są ostatnie dni kłamstwa. To co kiedyś przechodziło? To dzisiaj już nie przejdzie. Film pochodzi z Tuby, a jeśli ona to zaakceptowała, to tylko znmaczy , że to jest zrobione pod publikę. Jest takie powiedzenie: Głupi wszystko kupi. Co można jeszcze do tego dodać? Pozdrawiam.",
				"date_added": 1624992992
			}
		],
		"1621549494_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"body": "To jest interesujace.",
				"date_added": 1625366687
			}
		],
		"1619274241_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"body": "To jest ważny przekaz; Jesteśmy kontrolowani na każdym kroku. ŻYJEMY W JEDNYM WIELKIM OBOZIE KONCENTRACYJNYM.",
				"date_added": 1625370031
			}
		],
		"1616336564_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Jedyny porządny prezydent; Szkoda tylko że jeden na cały świat? Dlatego został zamordowany. Wielki szacunek dla tego człowieka.",
				"date_added": 1625370287
			}
		],
		"1615228219_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Tak, to były czasy wspaniałe? I kobiety były wspaniałe. Dzisiaj Polska zeszła na psy. ",
				"date_added": 1625370668
			}
		],
		"1583335583_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"body": "To jest film, który powinien obejrzeć każdy polak. Szczególnie meżczyzna? ",
				"date_added": 1625371673
			}
		],
		"1578671564_17L8tN9xz17h6MX5JY5fqfGFocsMF34xBf": [
			{
				"body": "Zmiany ktore zachodzą w naszym organizmie? One zachodzą nieustannie; Można temu zapobiec. Są to zioła.",
				"date_added": 1625372792
			}
		],
		"1626205395_1Me1VCYRwZ9whErbbhew63eKJFS8L8Jyka": [
			{
				"body": "Potwierdzam; To wszystko jest prawdą. Można rozmawiać ze zwierzętami i nie tylko.",
				"date_added": 1626279141
			}
		],
		"1626274157_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Jest to Człowiek, który dużo wie. Warto go uważnie wysłuchać. Ważne sprawy porusza.To dotyczy rozwoju człowieka. ",
				"date_added": 1626282443
			}
		],
		"1555303184_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"body": "Stare dobre czasy, warto czasami po wspominać. To już daleka historia.",
				"date_added": 1626289253
			}
		],
		"1555501230_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"body": "Są czy ich niema? Kto to wie, jak jest naprawdę? Ale wygląda mocno prawdopodobnie. ",
				"date_added": 1626290708
			}
		],
		"1609110978_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Sokal, zawsze ma coś ciekawego do powiedzenia; Jest zorientowany w sytuacji. Zawsze można go wesprzeć. ",
				"date_added": 1626295937
			}
		],
		"1626941926_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "\"DNA\"-temat na czasie? Dużo się mowi ostatnio na ten temat.",
				"date_added": 1626938675
			}
		],
		"1630771347_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Przejdź na wyższy poziom świadomości, to jest argument...",
				"date_added": 1631416142
			}
		],
		"1630611401_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Tak to jest prawda; Wiele razy z tym się spotkałem. Ciekawy wykład i prawdziwy; Potwierdzam. ",
				"date_added": 1631417508
			}
		],
		"1631612120_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"body": "Dzięki; Tak to jest marzenie, piękne widoki. Po prostu Raj na ziemi.",
				"date_added": 1631613450
			}
		],
		"1634396579_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Dzięki; zarąbisty film. Prawsdziwa  Perełka, w tym chlewie informacji. pozdr.",
				"date_added": 1634401034
			}
		],
		"1634084004_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Luksus, to pojęcie względne? Ważne, żeby przeżyć i nie dać się rozjechać prez walec drogowy. to jest znacznie groźniejsze jak pseudo LUKSUS.",
				"date_added": 1636326929
			}
		],
		"1635604929_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": [
			{
				"body": "Ten gościu, posiada dużą Wiedzę na różne tematy; warto posłuchać jego innych prelekcji.",
				"date_added": 1636327119
			}
		],
		"1548337196_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"body": "Chcesz być zdrowy? to śpij na lewym boku. Tak dyktuje umiejscowienie żołądka i jego kształt...",
				"date_added": 1636362176
			}
		],
		"1554338753_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"body": "Gdzie jest tyle zła; Tak to prawda, czasami mam wrażenie, że tylko ono nas otacza. ",
				"date_added": 1636394397
			}
		],
		"1636712282_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"body": "Panowie; Cenzura zawsze była, jest, i w otwartym internecie będzie. Złe słowo użyłem? To nie jest otwarty internet i wolny... To nasz internet jest wolny i bez cenzury, dlatego mogę to napisać otwartym tekstem.  Końcówka udziela wiele porad,  tak to prawda. WOLNOŚĆ,- to jest to co mamy w Swojej głowie;  Tego nikt nam nie może odebrać? Jeśli tylko chcemy, To jesteśmy Wolni... pozdrawiam.",
				"date_added": 1636747160
			}
		],
		"1637445190_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": [
			{
				"body": "Ciekawa lektura, na ile prawdziwa? Jak nie sprawdzisz, to się nie dowiesz...",
				"date_added": 1637661001
			}
		],
		"1637498570_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": [
			{
				"body": "Gdzie jest początek, i jak zacząć? Temat dla każdego.",
				"date_added": 1637673149
			}
		],
		"1637607931_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": [
			{
				"body": "Mandaty bolesna sprawa i dokuczliwa, komornki i policja na usługach? Co zrobić, jak się zachować? Nie każdy jest prawnikiem, a w szkole tego nie uczą...",
				"date_added": 1637676673
			}
		],
		"1637625984_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": [
			{
				"body": "Pytanie, ile osób o tym wie? Jak rozpowszechnić tą wiedzę? Jak spopularyzować? Trzymam kciuki.",
				"date_added": 1637679813
			}
		]
	}
}