{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1609979400_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1,
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1
	},
	"next_comment_id": 19,
	"comment": {
		"1610221008_1oqB7832C1ZbyXfR9XLLbAMgwifdSVM6J": [
			{
				"comment_id": 1,
				"body": "Absolutely chaotic, yet strangely blessed.",
				"added": 1610222911
			}
		],
		"1610162257_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 2,
				"body": "The thing that terrifies me the most is how absolutely technologically illiterate most people are. I don't even consider myself at the levels of literacy necessary to want to do all that I can. But to read \"not tech-savvy enough to know about or discover ZeroNet...Minds, Parler, Gab, etc.\" that just makes my blood boil because these things are NOT HARD TO FIND. They're right there in front of everyone's faces. But people don't want to take the time out to sit down and learn the 3 or so commands they need to get something like ZeroNet up and running... heck, my husband knows better, and it's still easier for him to tap buttons on his phone sometimes -_-\n\nPeople are lambasting FB/TW/YT for the Purge, but they're just flocking to Gab, Minds, Parler, Rumble... what makes them think those platforms won't censor them in the future? We're never going to get anywhere unless people start making the jump to alternate protocols like ZeroNet, Tor, Gopher/Gemini, I2P, etc. What I would love to see is people running and hosting their own platforms from their own homes. Can't have it censored if it's all within your own control. But by the time people realize that, I'm afraid it might be too late. Looks like it already is.",
				"added": 1610223243
			},
			{
				"comment_id": 8,
				"body": "> [bimmyql](#comment_6_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): yeah, I did a double take there since I couldn't believe ZeroNet was considered \"tech-savvy\". I got it running in a few minutes. you just run the shell script and it does everything for you automatically.\n\nI ended up taking that out of my comment, but yeah, download a tar file and extract it, run the shell script and you're good to go. One of THE easiest things I've ever accessed...",
				"added": 1610247260
			}
		],
		"1609976542_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "I thought it was all but confirmed that Antifa were the ones who, as usual, broke in? There were pictures of known antifa members and they were the main ones doing all the breaking and entering. Video evidence of trump supporters, in fact, trying to STOP them. Not to mention Twitter censored Trump's video telling everyone to go home in peace. Also one of the people who broke in to the capitol released a video saying they had, in fact, been paid to do so. Def a false flag attack to divide this country even further. I don't like the whole left/right split because divided we fall. They're playing it up and it's working, and this country will fall to ruins because of it.",
				"added": 1610223427
			}
		],
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": [
			{
				"comment_id": 4,
				"body": "I'm absolutely sick of people jumping platforms like this. Remember when the Internet used to be tiny little blogs with blogrolls on the side? Not much censorship going on back then... Parler will go down, too, they're already being pressured and I don't think they can handle it.",
				"added": 1610223503
			},
			{
				"comment_id": 9,
				"body": "> [namvata55](#comment_28_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): all of these shitty little alt tech platforms that ask for your phone number and other personal info are fucking honeypots, I have no idea why boomers keep falling for this shit\n\nTHANK YOU!! Now, people are saying to go from Parler to Clouthub, so I was like, alright, I'll bite... Phone number?? NOPED right outta there!",
				"added": 1610477774
			},
			{
				"comment_id": 10,
				"body": "> [anshorei](#comment_171_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Last time I heard the rules of Parler were strict, even stricter than Twitter in some regards, but their moderation was not on a blanket \"our bots will take everything down as they please as determined by arcane algorithms\", but more of a \"if people report it, and it does indeed violate our policies\". With a such large influx of people their moderation cannot be expected to keep up. It is also likely a lot of violating posts were made in order to damage the site.\n\nI don't think this would have made any difference. Big Tech is out to censor \"alternative\" media (read: the competition, We The People) no matter what. Parler could have done everything absolutely perfectly, and they STILL would have been taken offline. From what I recall, Amazon's reasoning was basically, \"...mmmyeah, we don't THINK you're going to do what we want, so we'll take you out anyway.\"",
				"added": 1610477903
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 5,
				"body": "> [g0dless](#comment_1_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM): This is pretty neat. Like our own slice of the internet. Away from all the normies. xD\n\nUntil they all get tired of being censored on the Big Tech platforms and figure out how to come over here...",
				"added": 1610224854
			}
		],
		"1610193120_1KkgEcvzK3mbVZGBTFLgkwy7WDjdfVSURj": [
			{
				"comment_id": 6,
				"body": "> [bimmyql](#comment_3_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): Fuck off. People like you are the ones making anti-censorship projects look bad.\n\nI'll bite, just to tip the scales away from this guy.\n\nGermania: History of the Third Reich appears to be pretty popular these days. Haven't read it myself, but others might find it interesting.",
				"added": 1610225026
			}
		],
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 7,
				"body": "And yet, what we're literally seeing in the world right now are \"far right\" proponents fleeing to alternate social media platforms, because the FAR-LEFTISTS in control of Big Tech are... \"shit[ting] all over people's freedoms and free speech [since they're becoming] actual policy\"\n\nWhat is wrong with you??",
				"added": 1610246853
			}
		],
		"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "> [bimmyql](#comment_45_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): For fresh installs, does it make sense to have a very strict, curated list of users and zites to allow content from by default? Perhaps then some sort of \"Web of Trust\" can be used to gradually expose new content to the most experienced users first, and if it doesn't get flagged by anyone, then raise its trust score to signal to newer users that its probably okay. [...]\n\nThis is censorship.",
				"added": 1610478222
			}
		],
		"1610348128_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ": [
			{
				"comment_id": 12,
				"body": "It's floating around here somewhere, last I heard. Why do you want to see that, though? Poor girls have been violated enough already. Also, not sure if it's real? Are you kidding? Dude, where have you been the last few years...",
				"added": 1610478310
			}
		],
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 13,
				"body": "I've been running Ubuntu 20.04 for the last little while. Over the summer I might take a stab at Arch, pretty excited to try it out. Switched a relative over to Linux Mint on one of their old machines. It looks and functions a lot like Windows so it was an easy choice for them.",
				"added": 1610480088
			}
		],
		"1610369492_1uRiXAhYBVhxWPxZuFH8zDssbSapKHVcW": [
			{
				"comment_id": 14,
				"body": "> [apely56](#comment_15_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG): https://www.msn.com/en-gb/news/world/trump-approves-emergency-declaration-for-biden-inauguration/ar-BB1cF9n3 op sucks dick. Nothing wrong with that thouh.\n\nAre you seriously going to MSN for your \"news\"?",
				"added": 1610480354
			}
		],
		"1612534044_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": [
			{
				"comment_id": 15,
				"body": "I can't believe they're just outright admitting it now. They must think we're really, really dumb.",
				"added": 1612582361
			}
		],
		"1617373305_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 16,
				"body": "The capitol hill \"assault\" was committed by known BLM and Antifa thugs. It started before Trump had even finished his speech. He had nothing to do with it.\n\nStill, I agree with you that censorship is bad. Fortunately, just because Facebook doesn't want something on it's platform, doesn't mean it's gone from the internet. In fact, you can find it on the clearnet just fine: https://therightview.com/the-right-view-with-president-donald-j-trump-and-lara-trump/",
				"added": 1617397589
			}
		],
		"1617244448_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 17,
				"body": "lol",
				"added": 1617397717
			}
		],
		"1617149531_16badkisTTGDcQf3YmZ9ra8b9PnhaJTynx": [
			{
				"comment_id": 18,
				"body": "Who cares. Just don't be a jerk.",
				"added": 1617397764
			}
		]
	},
	"comment_vote": {
		"3_16JXVw3e2ubwoEP966mFnp3vt5PzyW5Pd4": 1,
		"26_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"4_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"1_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"18_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1,
		"5_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": 1,
		"35_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"170_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"10_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY": 1,
		"28_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"1_1FP7xeZP8gz48ziNkyodkrcNFGcoX6A6nL": 1,
		"1_1JXjCUdKqR7B3c9f4SB2qBpWeawpGTwztW": 1,
		"2861_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"74_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"11_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"23_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"7_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY": 1,
		"1_13GmZWNCZqPELbMy6ujquVGqYz77wiQ5RY": 1,
		"1_12eVhxNAYFPJi5rUnbHwbmKPnqAniJs7SA": 1,
		"1_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2": 1,
		"3_1DMqyu7PvGCW5gc1KaCGNGVFhWqARTSjem": 1,
		"36_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"2_1M2KXT2z13QiNqDpUpzuNJzuPvmZ9Eq17n": 1,
		"13_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"7_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"1_1BGxE2M5NHhrPU7gS2pBgGxtMXZsJuhGCv": 1,
		"2858_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"37_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"53_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"25_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"2943_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"9_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN": 1,
		"2947_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"21_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"1_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": 1,
		"38_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"1_1EvNcAayp2Umf6EZwtZqu9fAxV9a7zDiUj": 1,
		"3_1789pQPut6Qwi5VL6aCtpWCMbqaMHgdoZp": 1,
		"66_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"47_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"32_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"38_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"32_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"56_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"57_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"3_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu": 1,
		"2941_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1851aFpye4naTGR1817guf36cbuw8mmvXL": 1,
		"89_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"2_175vrhm51gDo1nwuJvMJMFGM39rcr5RDst": 1,
		"27_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG": 1
	}
}