{
	"title": "new Blog();",
	"description": "Blockchain developer | CipherDogs founder | FP hobbyist | CTF",
	"links": "​​​​​​​Donate:\n\n*   **MONERO:**\n\n*   4A5cX5VRHSmitG2fyZZqJu1hTFR53aKpPD9GjnBi6D3p5qVNA8c3gFxB7Q8E1aJQiHNt2EBjjviUTMNWmX4f4V8RSE3JX9f\n\n* * *\n\n*   [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 18,
	"demo": false,
	"modified": 1591278038,
	"post": [
		{
			"post_id": 17,
			"title": "Cipher Dogs team seeking funding",
			"date_published": 1591277871.495,
			"body": "Our team is interested in electronic art/hack/social activity and blockchain/decentralized technology and other technologies. We are aimed at promoting blockchain technology among people. Our team creates various libraries, websites, artwork and other projects in the field of blockchain technologies. We also help blockchain projects. We believe that blockchain technology is the future.\n\nOur projects:\n[https://keys.cipherdogs.net/](https://keys.cipherdogs.net/)\n[https://torrent.cipherdogs.net/](https://torrent.cipherdogs.net/)\n[https://allnero.cipherdogs.net/](https://allnero.cipherdogs.net/)\n[https://cyber.cipherdogs.net/](https://cyber.cipherdogs.net/)\n[https://github.com/CipherDogs](https://github.com/CipherDogs)\n\nWe are an independent and non-profit project that believes in decentralization and is ready to promote and develop this technology with all our strengths. But without you, we can’t do it.\n\nWe ask you to send a donation in support of the project. Any help, especially regular one, helps us work better, concentrate on current tasks and not go to stuffy offices, selling our time to corporations for nothing.\n\n[Bitcoin address](https://blockchair.com/bitcoin/address/bc1q0a7hm3hdxhsv6mc50zsel2x9809tny2ck3ghpl)\n[Ethereum address](https://etherscan.io/address/0xD12Dd8aEb8F96D0bFF6aA9C74bDf92009741d3Aa)\n[Monero address](https://donate.cipherdogs.net/?address=4A5cX5VRHSmitG2fyZZqJu1hTFR53aKpPD9GjnBi6D3p5qVNA8c3gFxB7Q8E1aJQiHNt2EBjjviUTMNWmX4f4V8RSE3JX9f)"
		},
		{
			"post_id": 16,
			"title": "W3 c4m3",
			"date_published": 1558181619.583,
			"body": "![cipher1.png (1975x1975)](data/img/post_16_cipher1.png)"
		},
		{
			"post_id": 15,
			"title": "Инфотрейдер",
			"date_published": 1547371749.891,
			"body": "Жесткий диск Seagate Barracuda емкостью в 40 гигов лежал на дне спортивной сумки «Adidas», скрытый четырьмя парами теннисных носков. В этой же сумке лежал пакет с сэндвичем, пара сорочек, жестяная банка колы и две осколочные гранаты, от колец которых тянулись нитки к ползунку молнии. Усики у колец заблаговременно отогнуты — если кто-то решит открыть сумку без позволения хозяина, у него будет несколько секунд, чтобы избежать превращения в фарш.\nСумка принадлежала Баду — молодому худощавому парню с красными кроличьими глазами и серьгой в форме значка Internet Explorer.\n...\nВоротник куртки поднят, шапка, наоборот, натянута максимально низко. И дело не в том, что на улице холодно, хотя и в этом тоже.\nГлавная причина — в чертовых камерах наблюдений, которые сейчас стоят на каждом углу. Бесстрастно фиксирующих всех прохожих, независимо от пола и вероисповедания.\nБольшой Брат is watching you. Таковы реалии современного мира и никуда от этого не деться. С каждым годом количество объективов на улицах будет только увеличиваться, что бы там не орали любители свободы и независимости.\nВпрочем, грех жаловаться на камеры наблюдения тем, кому эти камеры помогают зарабатывать на жизнь.\nБад был инфотрейдером, одним из тех, кто за деньги продает любую информацию. И сейчас он шел на встречу, которая могла принести или кучу денег или же кучу неприятностей.\nВ неприятностях, в отличие от денег, Бад не нуждался. Он собирался вступить в очень серьезную организацию, а для этого требовались две вещи: незапятнанная биография и крупная сумма в качестве вступительного взноса. Если на встрече все пройдет гладко, биография останется незапятнанной, а денег будет достаточно. Поэтому еще раз: внимательность и осторожность.\nВторую руку Бад держал в кармане куртки — ладонь сжимала рукоятку восьмизарядного «Тульского Токарева». Вряд ли пушка поможет на встрече, если возникнут какие-то осложнения, но все же оружие дает ощущение уверенности и спокойствия. Пусть даже и мнимое.\nСодержимое винчестера на 40 гигабайт украдено у крупной корпорации, что гораздо опаснее, чем, скажем, воровство у государства. Обычно службы безопасности, стоящие на страже частного капитала, куда более профессиональны и эффективны, чем, например, набранные по объявлению ламеры из управления «К». Кроме того, у корпоративных безопасников развязаны руки, и они не станут церемониться, если возьмут Бада с поличным.\nК счастью для Бада, в корпорации хотя и знали о факте воровства, но не подозревали, насколько ценной она была. Несколько мегабайт кода для спам-фильтра, база адресов крупнейшего почтового портала России и очень много гигабайт частной переписки.\nПо большому счету, мусор.\nБезопасники даже не смогли вычислить шпиона, который скопировал данные и принес Баду. Уволили весь отдел, попавший под подозрение, и постарались забыть о неприятном происшествии.\nЗа содержимое винчестера Бад заплатил бывшему сотруднику корпорации двенадцать штук. Плюс пара штук ушла на мелкие побочные расходы. Заказчик был готов выкатить двести тысяч.\nВыглядело гораздо прибыльнее, чем торговля наркотой, оружием или человеческими органами. С такими деньгами шанс словить пулю в башку очень высок даже для тех, чьи спины прикрыты авторитетом организаций вроде Армады. А уж одиночка вроде Бада вообще выглядит потенциальной жертвой. Поэтому в сумке гранаты, а в кармане «Тульский Токарев». Если не спасут, то хоть подстрахуют.\n\n> Чубарьян Александр Александрович. Хакеры. Книга 1\\. Basic"
		},
		{
			"post_id": 14,
			"title": "Действие первое - Hub",
			"date_published": 1547271183.324,
			"body": "Первым что принес в эту сеть, после долго отсутствия это [AsocioHub](http://127.0.0.1:43110/1MxqEM11KaAuKE2X9anKV2hz5NYmM1jaSP/).\n\nОтличия от других Hub's:\n\n*   Увеличен предел размера файлов пользователя\n\n*   Добавлена поддержка Kaffie ID\n\n*   Добавлена поддержка Crypto ID\n\nТакже планирую поддержку других сервисов ID. А пока что Welcome to new Hub!"
		},
		{
			"post_id": 13,
			"title": "Возвращение",
			"date_published": 1547270923.91,
			"body": "Заметил тенденцию, что многие начинают вести блоги, потом их забрасывают, а затем начинают писать посты \"Я не умер, я вернулся\".\n\nТак вот, не буду распинать, я тоже вернулся, не куда не пропадал. Назрело куча проектов по привлечению людей сюда и продвижению децентрализации и прочего. Скоро все будет."
		},
		{
			"post_id": 12,
			"title": "Masternode",
			"date_published": 1535212486.21,
			"body": "Открыл для себя одну из функций криптовалют, как мастерноды. Меня очень заинтересовала это технология, не только как способ заработка, но и чисто как функция для криптоинтузиаста. И побольше части из-за интереса, я решил поднять одну такую у себя. Что из этого получится увидим позже."
		},
		{
			"post_id": 11,
			"title": "New coin",
			"date_published": 1535212145.026,
			"body": "После собственного скромного анализа криптовалют, я пришел к тому, что многие из них перестают являться децентрализованными.  Потому я решил произвести перераспределение средств. Решил прикупить Zcash и покинуть такие валюты как Bitcoin и Ethereum."
		},
		{
			"post_id": 10,
			"title": "VPS",
			"date_published": 1531754558.135,
			"body": "Приобрел на днях VPS на сайте [yourserver.se](yourserver.se) (clearnet), всего за 250 руб в месяц. Сейчас будем проверять как она себя покажет и стоит ли ее оставлять.\nПока поднял для себя личный прокси сервер. Хочу еще попробовать openVPN, zeronet proxy, ну и еще что нибудь, что в голову придет. Может даже свои проекты попробую развернуть.\nЕще один главный плюс, это оплата в криптовалюте, это прям очень приятно радует."
		},
		{
			"post_id": 9,
			"title": "Покупка криптовалюты",
			"date_published": 1530904754.175,
			"body": "Каждый раз, когда собираюсь купить не много криптовалюты, сталкиваюсь с проблемой покупки. Все сервисы обмена или биржи требуют слишком много данных. Реальные данные, копии паспорта, если переводишь с карты банка, то видно от кого поступают деньги.\n\nА хочется покупать валюту более менее анонимно, указывай минимум данных.\n\nРешил попробовать купить биткоина с помощью криптоматов. Есть специальный сервис для поиска криптоматов [Coin ATM Radar](https://coinatmradar.com/) (clear). Посмотрим, что из этого получится."
		},
		{
			"post_id": 8,
			"title": "Bye Bye Github",
			"date_published": 1528148221.906,
			"body": "![fba0ba2c33fde3822352fdee5fce1c9b.jpg (1200x675)](data/img/post_8_fba0ba2c33fde3822352fdee5fce1c9b.jpg)​​​​​​​\n\nВот и все, это произошло. Сегодня объявили о том, что Microsoft купили Github за 7,5 миллиарда долларов. Все таки надеемся, что Github не умрет быстро, и он всегда будет жить в наших сердцах.\n\nТем временем импортов проектов из Github в Gitlab увеличилось в 40 раз. Я лично перешел на BitBucket. Его минималистичный дизайн и отстутствие лишних социальных функций, позволяет больше сосредоточиться на разработке.\n\nКому интересно вот мой [профиль](https://bitbucket.org/deadblackclover) (clearnet)"
		},
		{
			"post_id": 7,
			"title": "GitHub",
			"date_published": 1527965676.08,
			"body": "Сегодня пролетела новость о том, что GitHub хочет продаться Microsoft. Это новость меня сильно опечалила, и наверное не только меня. Сразу же стоит задуматься что будет с этой платформой после покупки. Мне кажеться они ее полностью интегрируют по свои TFS и продадуться властям. Но даже если они всего лишь станут главными спонсорами, это ни к чему хорошу не приведет. \n\nТак что пора готовить свои .git к таким действиям."
		},
		{
			"post_id": 6,
			"title": "Money",
			"date_published": 1527880157.41,
			"body": "Да, хоть криптовалюта это технология, покупать ее все равно стоить. Я тоже это сделал. Сейчас у меня имеется BTC, LTC, NMC, ETH, ETC, DASH. И есть еще токены, такие как BAT и GNT, потому что мне нравиться эти проекты. В основном криптовалюта у меня лежит на долгий срок, но иногда я ее использую для пожертвований. Да я конечно поздно вошел в криптовалюту, но лучше поздно, чем никогда. \n\nНе собираюсь покупать и использователь такую как Ripple, потому что считаю что это скам, и уже сильно все сомнительно происходит у них. Практической пользы от монетки XRP нет, майнить нельзя. Валюта создана компаний, а компания пытается заработать денег на ней. Так что это как не по криптоанархически. Есть технология и криптовалюта, но это не совсем одно и тоже."
		},
		{
			"post_id": 5,
			"title": "Криптовалюта",
			"date_published": 1527879279.14,
			"body": "Хотелось бы не много поговорить про криптовалюту\n\nМне не нравиться какая ситуация происходит вокруг криптовалюты. Все увидели в ней способо дохода и пиар. Люди подались в трейдерство, так как из-за резких скачков курса, действительно можно не плохо заработать. Куча компаний проводит ICO и пытаются что-то сделать на основе блокчейна. Но только малая часть из них, понимает что действительно стоить за этим, и они делают действительно достойные проекты. А стоит за этим, технология blockchain. В связке с P2P она спобна изменить интернет в лучшую сторону, так как децентрализация это то что нужно сейчас человечеству.\n\nКриптовалюта это не деньги, это технология."
		},
		{
			"post_id": 4,
			"title": "Music this day",
			"date_published": 1527788472.534,
			"body": "Phosgore - Domination (2009)\n\n![1254414524_phosgore-domination.jpg (350x350)](data/img/post_4_1254414524_phosgore-domination.jpg)​​​​​​​\n\nSpirit of hackers of the 90s"
		},
		{
			"post_id": 3,
			"title": "Zeronet",
			"date_published": 1527694560.383,
			"body": "Так как я здесь, хотел бы рассказать, почему же Zeronet. Я за свою скромную жизнь перепробывал кучу соц сети, сайтов и прочего из сети Интернет. Да, сама сеть Интернета это революция, которая изменила мир. И если эту сеть использовать правильно, то это довольно дельная вещь. Так вот, я буду человеком тех. специальности, избродил весь интеренет. С самого начала я всегда пытался сохранить свою безопасность, свои данные и свою анонимность. Я всегда придерживался свободы в интернет. И вот, я нашел. И пока, на данный момент это лучшие решение. Это Zeronet.\n\nДа, децентрализация - это то, что спасет нас, свободных граждан и наш интернет, от ужасных рук гос. апарата. Это уже меняет мир.\n\nДумаю не стоит писат, о том как работает Zeronet. Но важно помнить одно, эту маленькую шестеренку, в большом децентрализованном механизме свободы, нужно беречь. Спасибо!"
		},
		{
			"post_id": 2,
			"title": "First",
			"date_published": 1527621757.852,
			"body": "Вот мой первый пост. Так как по каким то причинам у меня отказывается работать ZeroMe и ZeroMail, буду писать здесь.\n\nЯ люблю децентрализацию и блокчейн. Здесь я буду делиться информацией про технологии и прочее. Не призывают разделять мою точку зрения, но я готов к обсуждению."
		}
	]
}