{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1597999990,
			"title": "Popularizing decentralized platforms?",
			"body": "Will it ever be possible for decentralized platforms to have a main stay with the general public? Just look at what happened with bitcoin... a bunch of normies realized they could be making a profit buying and selling turning the current crypto scene into \"get rich quick\" vaporware. The correct usage for the technology is never ultimately adopted.\n\nWill there ever be a melding of immutable trustless platforms that can replace the likes of YouTube and the entire G-Suite? Will the \"internet\" go through a new transformation when states start clamping down on the free market of ideas outside the scope of traditional \"intellectual property\" laws? Are IP laws slowing progress?\n\nCould the traditional functions of governments be decentralized and sustained with a cryptocurrency \"tax\" collection system to grant admin type privileges to specific private key holders for their services? Think of it as a decentralized WeChat type of platform. Is this the ultimate solution/goal? Share your thoughts...",
			"added": 1597999989
		}
	],
	"topic_vote": {
		"1597999990_1EvSiWY7H61zpcecgT2uAMD5QGA5AFJEq6": 1,
		"1598362059_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 1,
				"body": ">VPNs all seem blocked.\nBruh just buy a passcode, it's only $13usd per year. No more shitty google captcha.",
				"added": 1597998992
			}
		],
		"1597799191_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 2,
				"body": "it feels like it",
				"added": 1597999196
			}
		],
		"1597999990_1EvSiWY7H61zpcecgT2uAMD5QGA5AFJEq6": [
			{
				"comment_id": 3,
				"body": "> [thorburn](#comment_112_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Not sure that will happen unless the billionaire club and 'security' services fund developers/projects, provide free data centers and hosting. And then provide the sheep a trough full of shiny free stuff, that requires zero mental capacity to install on a phone, and only requires the use of one functional thumb. [...]\n\nIn my heart of hearts I feel that trying to reach \"ultimate equality\" is a complete pipe dream. We live in a reality of imbalances. We act as if natural order plays a minimal part of our lives but at our core we emulate and iterate functions in nature like little branches of a fractal.\n\nBuilding a organized system to openly regulate human affairs could help realize a better bonding with nature and progress. Stride to build complete awareness to establish consensus. People aren't very different, we could all come from a perspective to follow anyone's lines of reasoning (within healthy functioning bound.) I'm just rambling now but this is something that I can't get off my mind. I keep asking myself \"what types of governance and regulatory systems will people accept in the next 200 years?\" If there is money to be had with a potential for \"happiness\" and meaning people will keep their heads above cynicism and absurdism I assume.",
				"added": 1598011955
			}
		]
	},
	"comment_vote": {
		"112_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1
	}
}