{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1604312868_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 1,
				"body": "Specter of evil rules the earth.  \nQ. How does one know if something is evil?\nA. Killing of innocent life is evil. \n_________ kills innocent life. \nTherefore ____________ is evil.",
				"added": 1605012686
			},
			{
				"comment_id": 2,
				"body": "Thank you for sharing your thoughts. I affirm your right to share them, and appreciate adding your ideas to the collective to debate, hear affirmative and negative position on them. This has been the strength of the western culture for the past 2500 years, to share ideas and to improve them. \n\nThe ability to freely think as individuals is absolute abhorrent to the \"ruling class\".  If individuals think, they will rebel against those who rule.  The ruling class of earth will do \"ALL\" they can to stay in power. Using demonic tactics to  kills those with dissenting voices. If they can't do that, they use \"ad hominiem\" attack to belittle their thoughts. If that doesn't stop them, they will use \"useful-idiots\" to do their bidding, while absolutely despising, the \"useful idiots\".  \n\nAnother of the ruling class demonic tactic is to use the material cause of \"money\" to achieve their objectives.  Current rulers of this world use monetary system to control the world.  They use a fiat based money system, with legalized counterfeiting (fractional reserve banking), using the stock market to launder money, by obfuscating the total amount of money in the world.  With that money, they buy academia to publish sophist propaganda. With money, they buy the media to propagate the propaganda. With money, they buy politicians and religious leaders to     \nestablish \"laws\" to suppress people, corrupt people to do their bidding.  All the while they hate all humanity.  If you are reading, don't kid yourself. You are not apart of that ruling class. If you think siding with them and doing their bidding will save your life, it won't. The faster job you do to kill your perceived opponents, they will come after you next.  They hate humanity. \n\nThese appear to be the clashes of multi-culture.  The ones freed to think and \"useful idiots\" who think that by doing and following what the demonic class says, they will be liked and not killed.  Demonic class hate you too. \n\nWho can save us from this enslavement?  Who can save us from the judgment to come? Are you good or are you bad? Take the good person test.  http://goodpersontest.com/  When you stand before your maker, will you be innocent or guilty? Heaven or hell? Where will you go?",
				"added": 1605015430
			}
		]
	},
	"comment_vote": {}
}