{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1611157835,
			"title": "Communist States of Murrica",
			"body": "So, it almost happened. Let's play a bingo:\n1. Wipe 2nd amendement\n2. Ban heterosexuality\n3. Force white extinction\n4. Ban money (btw, happen years ago)",
			"added": 1611157834
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "Bill Gates - Virgin sales. Can't into social interactions. Took first money from his father. Sold OS he never made himself. Tries to be serious and fluffy.\nElon Musk - Chad Engineer. Dig pussies like his tunnels. Self made man. Treats NASA and gov like his bitch. Can into Rocket Science. Watches anime & smoke weed on a live stream.",
				"added": 1610463237
			}
		],
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 2,
				"body": "Artix. It's not ideal due lack of some scripts (mostly container apps), but I don't like systemd. NixOS seems interesting, but it also contains systemd (and it's extremely hard to get rid of it).",
				"added": 1610541546
			},
			{
				"comment_id": 3,
				"body": "> [mxh69420](#comment_42_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx):\n\nThere is no ideal system. OSS usually lack a lot of features, or just works in strange way. Closed source sucks in terms of privacy and also works extremely dumb. Also, ususally OSS does not mean quality. Not going to defend MS or other corpo, but I know only few stable and advanced systems, and they are all closed source (mostly). QNX is a good example. As for desktop usage - they are all crappy in some way.",
				"added": 1610541932
			}
		],
		"1611098873_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [
			{
				"comment_id": 4,
				"body": "*someone assasinates Biden*\nEveryone: OH SHI~~~~\n*first niggercunt becomes US president*",
				"added": 1611157384
			}
		],
		"1610998661_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "Just another posers that can't do anything important. True hardcore groups became known only after attacks.",
				"added": 1611240705
			}
		]
	},
	"comment_vote": {}
}