{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1585207808_1KtNz7B6oMUBcPKCTZuSTbphZ2s7RTYCk1": 1,
		"1591995772_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1594835373_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1597030160_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1603284377_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": 1,
		"1614833395_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"1615507108_1LJx7UWxfu1L7KZeNxdggqQqewk2CwEXWG": 1,
		"1616114475_1NKkmuj4vzTYCuCD8ExJokgpcgyaiFM3KC": 1,
		"1616503348_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1616648188_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1618323031_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1,
		"1618367645_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1,
		"1631205039_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": 1,
		"1632662049_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1,
		"1633895520_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": 1,
		"1633896629_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": 1
	},
	"next_comment_id": 77,
	"comment": {
		"1582577947_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 1,
				"body": ">The government is moving good, The problem is on the media\nAs if media are not at least partially controlled by governments.",
				"added": 1582794369
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1884_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): that's life\n\nAnd life is complicated.",
				"added": 1583029549
			},
			{
				"comment_id": 5,
				"body": ">in what way?\nOh \"life is complicated\" is a meme, don't take it too seriously.",
				"added": 1583108930
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 2,
				"body": ">CCP wants to use climate war, biological war, and geographical war to recover Taiwan. When it kills half of the Taiwanese,it will belong to Beijing!\nI don't have a political bias but at least calm yourself down before you say something.",
				"added": 1582794503
			},
			{
				"comment_id": 21,
				"body": ">The Chinese gov CCP not equal China can not delegate Chinese people\nThere is actually no Chinese after CCP. The most successfully thing the CCP has ever done in it's history is, it vanished social value, traditional culture and national identity of Chinese and rebuilt them around CCP itself.\nIf CCP just collapsed one day without any hint, then China altogether with the concept of Chinese will break into like millions of little countries and sub-cultures. It will be somehow like Singapore, while each one can speak Chinese language, remain some Chinese culture but they will no longer ident themselves as Chinese.",
				"added": 1586782905
			}
		],
		"1581540627_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 3,
				"body": "Heh. the existence of Internet totally relies on government's ignorance of it's actual power to shake their ability to control information flow. China and Russia and more countries told us once they realized, there won't be an actual Internet, it's just national controlled intranet chained together.",
				"added": 1582813824
			}
		],
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 6,
				"body": ">Games are made so that they are as addictive as possible and ultimately you gain NOTHING of value by playing them.\nTrust me that no one can achieve 100% time efficiency. You will waste such time by whatsoever means even you aren't wasting them by video games.",
				"added": 1583130808
			}
		],
		"1583479244_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 7,
				"body": "Would services like Advcash help you ?",
				"added": 1583505161
			}
		],
		"1583450778_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 8,
				"body": "Lmao, quite a lot. From crypto mining, human OCR (aka. type in captchas), DDoS/SEO (yeah there are people paying to do this) to decentralized money laundering, cryptocurrency exchanging, online phishing etc. Depends on what device you are using, what skill you got, what you already have, and what risk you would like to take.",
				"added": 1583505969
			}
		],
		"1583587826_154DLn4k3ckpT1v151SLaFh7mmy4TnccmT": [
			{
				"comment_id": 9,
				"body": "For things like Mega Million or PowerBall yeah there is literally no point in buying.\nBut also notice the chance is minuscule doesn't stop it from happening. The lightning striking on you is a minuscule chance event but it doesn't stop that every year there are guys got struck by lightning.",
				"added": 1583632821
			},
			{
				"comment_id": 10,
				"body": ">If you had a fair lottery\nAll lotteries are unfair for if so the authority who run the lottery will have no income and the lottery cannot last. That's why all lotteries have a mathematical expectation that's minus.",
				"added": 1583633082
			}
		],
		"1583652466_12cd6EZPPnYus8unwYEjFxKYWps2kNBJKd": [
			{
				"comment_id": 11,
				"body": "By \"removed everything\" I suppose you just throw everything into the recycle bin and emptied it. If so you are not out of luck. Try PartitionGuru or something like that.",
				"added": 1583653632
			}
		],
		"1583880411_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE": [
			{
				"comment_id": 12,
				"body": "Well, there is no nobel, evil, right or wrong in the world, or to say they are not worth being concerned. The only thing makes sense in the world in conflict, action, and payout. \"Something is evil\" is really a childish idea towards the world.",
				"added": 1584009548
			}
		],
		"1584077470_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 13,
				"body": "No. For how you gonna make sure the new update provides more benefit that issues ?",
				"added": 1584094355
			}
		],
		"1584075893_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 14,
				"body": "Actually, if you make people (by most of the time, a sub-concept of \"people\", called \"idiots\") believe that something can be used as money or can make money then it is money, it makes money for you.\n\nIDK if you heard of \"cryptocurrency scam\". Basically someone released a new cryptocurrency (for most of the time they are neither cryptic nor even decentralized) and said \"Well here is our new cryptocurrency which based on (all kinds of shit) principle. You see how BitCoin prices went up back in the day so join us quickly to not miss the chance. $99 for your 1st miner (Which is not an actual device and not even a software, they simply mark you as \"able to generate coins\" in their database).\n\nWell no one can get any benefit from such shit coin. But there will certainly be idiots that pay $99 for you and when you got enough $99s, run away. It did make money for you.",
				"added": 1584150809
			}
		],
		"1584308899_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 15,
				"body": "It's actually good enough that the tanks didn't actually fire the cannon.",
				"added": 1584366175
			}
		],
		"1584640277_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 16,
				"body": ">-PRIME TIME IN FRONT OF TE-LIE-VISION\n\"Television is the represent of mind's eye.\"",
				"added": 1584702551
			}
		],
		"1584836844_1EVRj1cizACuJXsBGLRGSvTMYG7MkThztD": [
			{
				"comment_id": 17,
				"body": "There aren't really such kind of VPN. Tor is the most similar thing to what you described.",
				"added": 1584839716
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 18,
				"body": "We can hear you loud and clear.",
				"added": 1585044084
			}
		],
		"1585207808_1KtNz7B6oMUBcPKCTZuSTbphZ2s7RTYCk1": [
			{
				"comment_id": 19,
				"body": ">satellite phones and satellite phone based IPv4 connections might still work\nSatellite communication can be blocked deliberately on ground in a certain geological range. China once developed such device to prevent unauthorized receiving of satellite TV.",
				"added": 1585217199
			}
		],
		"1585358824_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 20,
				"body": "Uh, but isn't losing sense of smell a common sign of multiple kinds of illness including regular cold ?",
				"added": 1585388012
			}
		],
		"1586990520_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": [
			{
				"comment_id": 22,
				"body": "Trump® Bucks™ .",
				"added": 1587031725
			}
		],
		"1587258725_15rKpUB9rz2YzS5vFmuNprwbQbRFgtAERh": [
			{
				"comment_id": 23,
				"body": "If you mean on general Internet, you can set up your DNS server to resolve the \"special domain\" you like if no other public DNS servers accept such domain. However the most issue is how you gonna persuade other people to use your DNS server rather than default ones distributed by DHCP or other public DNS such as 8.8.8.8 .\nAn alternative way is to add a line in hosts file in the OS to statically resolve the domain, if your website also got a static IP address. But still the same issue, how you gonna persuade others to add a line in their hosts file for your website.",
				"added": 1587266996
			}
		],
		"1587305852_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": [
			{
				"comment_id": 24,
				"body": "It has nothing wrong, because nothing is actually right or wrong. But people tend to define that what lost in the conflict is wrong, so socialism is wrong just as Nazi is wrong --- They are not wrong because of wrong, they are wrong because of they lost in the conflict (with capitalism / allies).",
				"added": 1587467002
			},
			{
				"comment_id": 25,
				"body": ">human laziness to ensure the success of socialism or it fails due to the greed of humanity in that some group will attempt to funnel resources solely to themselves.\nHumanity is the least reliable thing on human, while the only reliability on human is animal instinct for humans are just a kind of \"advanced animal\". We don't manage to remove humanity for now is cuz we don't really have anything suitable to replace it.",
				"added": 1587467192
			}
		],
		"1588389325_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 26,
				"body": "Where are our commie whackers",
				"added": 1588643063
			}
		],
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 27,
				"body": "Well, commies are still learning. China is already working on a M0 level (equal to coins and bills) cryptocurrency called DCEP.",
				"added": 1588643256
			}
		],
		"1589055412_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 28,
				"body": "It's like \"why I need to lock my door at night, like if there will be anyone break into my house just to steal my leftover cold pizza and drink ?\"\nWell that's true -- Only if you only have a cold pizza and a bottle of drink inside your house.",
				"added": 1589105309
			},
			{
				"comment_id": 29,
				"body": ">What is the \"west\" ? Make a country list.\nWhen we talking about \"west\" we usually mean non-communism countries",
				"added": 1589109188
			}
		],
		"1589480365_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": [
			{
				"comment_id": 30,
				"body": "It's just a VPN, not good or bad. It just like to put advertisement everywhere though.",
				"added": 1589537630
			}
		],
		"1589714892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 31,
				"body": "I don't really know how to say. Maybe things get better on TikTok, but on it's Chinese version, DouYin, I can say most of the person there got like at most half the brain cells as normal person.",
				"added": 1589719860
			}
		],
		"1590819172_1NnCNCau8QnJDzkZqX9KMdqn4SenArGwRv": [
			{
				"comment_id": 32,
				"body": "So where are the texts ?",
				"added": 1590847004
			}
		],
		"1591579090_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 33,
				"body": "Well, what if just run a script that post dozens of 1-stars in cycle. Like how some lame software/services etc. got their 5-stars.",
				"added": 1591624438
			}
		],
		"1592059237_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": [
			{
				"comment_id": 34,
				"body": "Is this the future ? Probably not. Is this futuristic ? Yeah.",
				"added": 1592110853
			}
		],
		"1592403341_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 35,
				"body": "> Maybe you will have latency issues with \"always Tor\" peers, but this is normal even on normal internet.\nI guess you may have some very terrible latency issues, which could up to seconds or even minutes (in very terrible conditions) since you cannot control the access routine. Assuming A is in China while B is in USA and they are trying to have a 2P game. A may have no direct connection to nodes in USA so it may first connect to another node in China and then that node need to find another node until it find a way to USA, which literally equals gaming under multiple proxy servers compared to connecting to game server directly.\n\nAlso the uptime is not guaranteed. There are always times that only very few routes available to get A and B connected. It's just like sometimes cold Zerosites take very long time to load, since nodes with that website data cached are all offline. And when it comes to gaming, time critical data cannot even get cached.",
				"added": 1592404265
			}
		],
		"1593791342_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 36,
				"body": "> You're a superpower.\nA pathetic fact about is superpower, is they have the power and ability to rewrite and redefine the so called human civilization. They don't really need the favor of the world because when they got enough power that no anyone match in the world (or at least cause devastating aftermath if any entity go total conflict with them), they will deny that human have rights. They will define evil as nobel. And there will be definitely people believing in them since when a lie is told thousands of times, then it's a truth.",
				"added": 1593836340
			}
		],
		"1594835373_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 37,
				"body": "Actually you can do more than that. By running that caddy on a computer with public IP or a VPS, you can access to ZeroNet wherever you are, without using ZeroNet client and to wait for things to sync up. This is insecure though. Also, if you run a Internet website and it's CGI rendered, by fetching Zite first (HTML, JS, CSS, assets, ...) from the caddy then insert it into the website, you can even display ZeroNet contents inside your Internet website.",
				"added": 1594905906
			}
		],
		"1597030160_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 38,
				"body": "> [otbtechnologies](#comment_25_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): Use a Meek-Azure Bridge and you can connect, or else you will not be able to access the network due to the Great Firewall. Similar proxies modeled after Meek-Azure now exist, but Meek-Azure is most well known and used.\n\nMeek-Azure doesn't really work that well sometimes since sometimes China also block connection to Azure based services in foreign. A frontend proxy would work but you need to ensure that proxy is safe, or the whole point of using Tor would gone.",
				"added": 1597471734
			}
		],
		"1600451214_14DD49E4i7XTVfi8WqSuV47Nuo1T66etmP": [
			{
				"comment_id": 39,
				"body": "You can use third party installers like 3uTools or i4tools. They can install apps besides App Store.\nHowever the best way of doing so is just jailbreaking your iPhone (if the model and OS version is capable of doing so), grab a Wechat IPA package somewhere, and install it manually.",
				"added": 1600586435
			}
		],
		"1601719510_1DjoJoSQPYTUcaJck51X5rDxXtEBYmtUtR": [
			{
				"comment_id": 40,
				"body": "> [gandhi](#comment_8_1DjoJoSQPYTUcaJck51X5rDxXtEBYmtUtR): Do you know a single proxy in China? I dont!\n\nThere are actually benefits (though niche and minor) in the network of China. e.g it's basically semi-legal to use pirated software, movies, musics etc. in China so some Chinese forums and network storage services are good places to hunt down resources.",
				"added": 1602063220
			},
			{
				"comment_id": 41,
				"body": "> [hkpeace](#comment_14_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2): Did the Zeronet founder nofish see the message? \nWhen you send something, other peers have to cache and resend that data so other peers could receive them. If huge amount of data is allowed to send on ZeroNet by default then it would cause very heavy burden on peers' storage space. You have to choose one to scarify, storage space or file size and ZeroNet chose the latter since it's meant to be a website service rather than a file storage service e.g. IPFS.\nYou can still bypass the space limitation by joining hubs that allow huge files.",
				"added": 1602063491
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 42,
				"body": "> ZeroNet isn't it. We're not like that here.\nIt's not like or not. Why people doesn't do that on Zeronet is because it's not secure enough for such purposes. Zeronet isn't anonymous, it's decentralized. It's based on BitTorrent protocol and notice in some countries even downloading torrents aren't safe.",
				"added": 1603890274
			}
		],
		"1603695205_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 43,
				"body": "Windows Server 2019. I am still a Windows pleb but at least it's probably the cleanest Windows 10 revision you can get.",
				"added": 1603890417
			}
		],
		"1614409620_172Vi8HghL8PzkqoAVbGbfvE456rnfkWES": [
			{
				"comment_id": 44,
				"body": "Antivirus says it's dangerous doesn't mean it's actually dangerous and antivirus says safe don't mean it's really safe. It's just a reference and you have to made the final decision.",
				"added": 1614491455
			}
		],
		"1614298638_1M77v8LSvJyW7ThTD1Z46CVBYfi8y1SpaW": [
			{
				"comment_id": 45,
				"body": "We can hear you loud and clear.",
				"added": 1614506172
			}
		],
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 46,
				"body": "Hope it turns out well.",
				"added": 1614927490
			}
		],
		"1615234594_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": [
			{
				"comment_id": 47,
				"body": "There is always gas (carbon dioxide ?) inside bottles of wine so if it's not properly opened but cracked, it could go explode.",
				"added": 1615268763
			}
		],
		"1615362040_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 48,
				"body": "\"medical freedom\" ? Tbh I don't really get it. The freedom to refuse medication and keep yourself in illness or potental dying risk ?",
				"added": 1615424449
			},
			{
				"comment_id": 50,
				"body": "> are you the propriety of a state or uno etc or your own. \nWho owns the army owns you because they can \"confiscate\" you by a bullet in head. \n> so when someone come before you with \"morals\" or \"ethics\": shot. it lies and it's a thing.\nI like it tbh. They are just tools for profit.",
				"added": 1615448587
			}
		],
		"1615446906_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 49,
				"body": "LGBTQ itself is probably cult but that leads to pedophilia ? I don't get it.",
				"added": 1615448164
			}
		],
		"1615468688_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 51,
				"body": "> Also i love how chineese media have this feelings of north korea media\nBasically all communism medias.",
				"added": 1615508860
			}
		],
		"1615639855_1CrQwgPdoq37YL5gNdsAvX6q8S2j9FWanm": [
			{
				"comment_id": 52,
				"body": "> decentralized social media doesn't mean censorship resistant\nAnd it also means unresistance to spamming.",
				"added": 1615711710
			}
		],
		"1615795020_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 53,
				"body": "There is no culture when it comes to economic, there is no economic when it comes to politics, there is no politics when it comes to military.",
				"added": 1615795819
			}
		],
		"1615839546_18w7xHq6PfLBDhcTqJSMkgvqYEYiKWEtjS": [
			{
				"comment_id": 54,
				"body": "Believe in that free mind doesn't exist and mind influencing is not avoidable. Even if you have seen through one propaganda, doesn't mean it's not the plan of another propaganda.",
				"added": 1615854073
			}
		],
		"1615914969_1JBQz17hPq1gGpFB3Y385fJiKDCeSB2vXe": [
			{
				"comment_id": 55,
				"body": "Resilio Sync no longer works in China like ages ago. Probably because the tracker (which is controlled by Resilio Inc. rather than user selectable) is blocked by GFW.",
				"added": 1616031388
			}
		],
		"1615964839_1CVe9cCruLHfk9DvG79pUbeLBqdMR9i4FZ": [
			{
				"comment_id": 56,
				"body": "It's revisionism rather than pure socialism or capitalism so it doesn't have too much difference between westerners when it comes to things like this. Whether nationalistic or internationalistic, it's all for keeping it alive.",
				"added": 1616033406
			}
		],
		"1616138135_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 57,
				"body": "\"America, fuck yeah.\"",
				"added": 1616142063
			}
		],
		"1616203894_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 58,
				"body": "Basically all decentralized networks have to worry about the same issue: things are always not, and probably never in real-time. Because it would take huge (compared to centralized network) amount of time for other nodes to spread away your message and you can only access a piece of data when other nodes that contain such data are online.",
				"added": 1616486394
			}
		],
		"1616720591_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 59,
				"body": "Where to escape though ? Other places aren't anywhere near safe either.",
				"added": 1616998103
			}
		],
		"1616777685_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 60,
				"body": "> Probably AMD will publich psp source code and it will be mainlined in coreboot\nThen Xbox One / SeriesX/S would get totally fucked because their security highly depends on PSP.",
				"added": 1616998591
			},
			{
				"comment_id": 64,
				"body": "> THEY GOT A BACKDOOR IN OUR PIS? WTF\nYou know there is a thing called TrustZone in ARM processors right.",
				"added": 1617932878
			}
		],
		"1617039004_1EDgrafDZQ8H6WLq6jHin6NKfQ8qZKzA1C": [
			{
				"comment_id": 61,
				"body": "Most of the people simply don't see the point of the plan B, but it's not no point.",
				"added": 1617093980
			}
		],
		"1617189082_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 62,
				"body": "That's like egg against rock.",
				"added": 1617335123
			}
		],
		"1617873274_1Nv7HrYvwPjyGyx6iUG7KZrj4TNduUBcah": [
			{
				"comment_id": 63,
				"body": "> a big stepping stone to get people to migrate is ease of use and fast loading time.\nNot really a friendly \"browser\" though. It's more an archival/storage system rather than webpages. Though you can definitely hold webpages in IPFS.",
				"added": 1617929048
			}
		],
		"1618347400_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": [
			{
				"comment_id": 65,
				"body": "Just copy the entire folder of your client to your server and run it from there. All data would be carried over.\nIt's designed to be that portable.",
				"added": 1618370952
			}
		],
		"1618591816_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 66,
				"body": "It's possible, the problem is when such trend begins, most of the players are not capable of getting and commanding such quantity of capital.\nThings like GameStop doesn't always happen.",
				"added": 1618822643
			}
		],
		"1618902135_19RaUbLi7u4d1wWD6oKS5cp5fSnH7hXnB2": [
			{
				"comment_id": 67,
				"body": "If there is no news to report, then make one.",
				"added": 1618970627
			}
		],
		"1619342119_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": [
			{
				"comment_id": 68,
				"body": "Where there is media, there is propaganda.",
				"added": 1619492598
			}
		],
		"1620449256_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 69,
				"body": "Today I learned that we are never too old to learn something stupid.",
				"added": 1621297553
			}
		],
		"1622537604_17qgF4cL3wN9yvkUtEPnVBMvL1exu976uk": [
			{
				"comment_id": 70,
				"body": "Believe or not, education itself is a very ineffective thing. Public education system is not there for transmitting knowledge, but more just as a society stablizer.\nThose who aren't suitable for receiving education shouldn't receive education in the first place, since it's both a torture for themselves, and a waste of educational resources for society and country.",
				"added": 1622786480
			}
		],
		"1621790517_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 71,
				"body": "You cannot defeat any ideology, conception of history or philosophy -- because they are basically theology after all, which means unrepeatable and unfalsifiable. There is only believe in or not -- and the result of not believeing in could  result in something similar to being roasted alive on a crucifix.\n\nThough there is one way to defeat all ideology, conception of history or philosophy -- since they are unrepeatable and unfalsifiable, all of them are just gibberish competition which makes zero sense after all.",
				"added": 1622787054
			}
		],
		"1630441420_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 72,
				"body": "Quality over quantity. That's it.",
				"added": 1630907764
			}
		],
		"1631519191_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 73,
				"body": "Check if you are using proxies. No idea why that happens but the proxy discovering mechanism in FireFox tend to cause such issue.",
				"added": 1631519930
			}
		],
		"1631920972_15nqVJAHdxk2KxMwvCp4iiXfj4BtYw7CCo": [
			{
				"comment_id": 74,
				"body": "> [airplane](#comment_1_1LtR9cd9SLeQwx6mbaVmjzbKAePFrykH4z): IPFS will be great when someone invents a GUI for idiots like myself.\nIPFS is more like a file sharing service rather than web service. But that being said, doesn't stop you from hosting webpages.",
				"added": 1632364267
			}
		],
		"1632704104_1QJu7G65kp7mtDiDX2b19eJWe88rNciBBQ": [
			{
				"comment_id": 75,
				"body": "So what is this ?",
				"added": 1632714990
			}
		],
		"1635093320_17dzj9vkJR1oGT7Sp8LY17M95JR59r4zVt": [
			{
				"comment_id": 76,
				"body": "51% ?",
				"added": 1635228125
			}
		]
	},
	"comment_vote": {
		"14_16j1WtLKAKpemCzA2suD1aaWfie2854o5T": 1,
		"1_19NNH1RF6TRJUjp1qpT7Ri6opWw5yHpw7m": 1,
		"30_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"1879_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"36_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": 1,
		"51_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"2_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": 1,
		"371_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1054_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"87_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"25_1F87dd49JyvrShxjTz6jszGnxm7bn8if6m": 1,
		"44_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1_1Go2fSUWjjmqMA7rwxpb56Cj31mxfeELak": 1,
		"1_15ezZYPh7Fz6NHAVTQRUpZRa28cNNYuwSP": 1,
		"1162_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"86_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"3014_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"37_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"4_1JAn6MYwzZFPfg9cQ8Y6j1vUHVmr5hvXLM": 1,
		"25_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": 1,
		"1_175vrhm51gDo1nwuJvMJMFGM39rcr5RDst": 1,
		"61_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": 1,
		"1258_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"19_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"295_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"13_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8": 1,
		"3_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": 1,
		"16_19CcB8NQHjyzj4TH9vKYm92xNPaUBg7hmv": 1,
		"135_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"3073_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_1P1rwS5wiQ32NDHRPFLjFLJMZZaa2sLGKA": 1,
		"343_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1
	}
}