{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1554025779,
			"title": "Thoughts on \"Cubbit\"?",
			"body": "4 terabytes of distributed cloud storage, where each user supports a physical storage node, instead of using a data center. I like distribution and evolving beyond centralized networks, but I'm not really sure cloud storage is the best use case. What they're offering is 512 GB of storage for about $340 USD, when 1 TB external drives go for like $50, and work offline.\n\nDecentralized sites have a very strong use case because they cannot be taken down. But Cubbit is just storing files. I don't doubt that it is more secure than something like Dropbox or Google Drive. But is cloud storage really all that cost effective for the marginal use you get out of it? If you buy one of these storage units, it doesn't house your files on it, just fragments of other people's files, so when the internet goes down, you're still fucked.\n\nYou can \"expand\" your storage to 4 TB, but in order to do so you have to go buy a 4 TB USB hard drive and plug it into the Cubbit unit. So you're basically paying a few hundred dollars to turn a USB hard drive into cloud storage, losing offline capability, and the ability to install software to it among other things.\n\nLink to their campaign with more info: https://www.kickstarter.com/projects/cubbit/cubbit-reinventing-the-cloud?",
			"added": 1554025778
		},
		{
			"topic_id": 1557012094,
			"title": "Spaces of critique",
			"body": "Cultural critique exists in spaces that have not yet been consumed by the object of critique: virtual reality and the internet were once feverishly talked about by cyber-cultural theorists even through most of the 90s, as these were spaces not yet taken over by state or global interests, and so critiques of power structures could be safely be made from within them.\nObviously this is not the case, as the internet is an apparatus of the state and of state corporations; critiques made on the internet are now highly scrutinized by the corporate media, and in many countries they are actually policed by law enforcement. Virtual reality is subsumed by marketing--we're treated to watching a cartoon of Mark Zuckerberg in a simulated, disaster-struck Puerto Rico. \nBut like any medium, it is content-agnostic, and while critiques can be printed in books, those books exist in separate space, often times obeying separate laws of publication, or rather refusing to obey laws of publication at all. For the medium of the internet to serve as a medium of critique, there must be separate spaces that are absolutely independent of the state/corporate internet. I remember last year we had fun mapping ZeroNet but pinpointing user locations on the globe: the map of ZeroNet essentially fits \"within\" the map of the internet proper; it is a space within the medium. I believe maps are a very useful tool for visualizing critical spaces: the internet as a concept has been so thoroughly warped by external power structures that it can no longer be \"mapped\" as a medium, but rather as spaces with different functions and forms.\nIn this way, ZeroNet is not the final solution to centralized internet, but rather a hint of what is to come later: non-interacting networks created as-needed, functioning as spaces for operations which cannot be permitted on the Clearnet.",
			"added": 1557012092
		},
		{
			"topic_id": 1571450538,
			"title": "James Cameron's Avatar is the only video game movie",
			"body": "Take from Tekwars. Everything about \"native Americans\" and \"colonialism\" is a total hoax, Avatar is a gamer movie. It's just a guy who wants to get online and play WoW all day, and the evil military guy is like Dad, telling him to go outside and stop playing games all day, and he just wants that sweet gamer dopamine juice from the big tree. The main character is the quintessential cumposter, his dick doesn't work irl so he has to play WoW and fuck Navi women instead; humanity needs resources from the planet to survive and he basically says fuck it because he'd rather jerk off in VR. He unilaterally decides to destroy Mozart, Bosch, Aristotle, literally all of human history, so that he can keep playing his MMO and fuck CGI women. Avatar was really just about video games and porn destroying civilization and retard sin the audience thought it was about some pointless historical events nobody can change or remember because they're already cumposters. James Cameron too, even he thought he was making a historical allegory because he's a cumbrain, and ended up just making a movie about himself and the sexual frustration he's been building up since making Terminator 2.",
			"added": 1571450535
		}
	],
	"topic_vote": {
		"1552558114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1554165337_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": 1,
		"1538188815_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": 1,
		"1555089595_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1565734523_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565832419_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565919141_1HpXiKhyQBTjE53rsdiNPjqxFwny3hycS9": 1,
		"1573845173_1MqNGUHk63CGdv7KMZ9br6NvCUcDC5dezp": 1
	},
	"next_comment_id": 32,
	"comment": {
		"1552558114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Morphic resonance. \"Form\" is a field like gravity or magnetism that determines the shapes objects take as they form, on an atomic level. For all our advances in chemistry and crystallography, we still cannot mathematically predict how molecules of as few as six atoms will form, let alone the forms of massive organic molecules. And the speed at which atoms arrange themselves into their proper molecular forms is far too fast to be trial-and-error through rotations.\nMorphic fields persist throughout time and without regard to distance, as they are non-physical. Once an object begins to form a certain way, it makes future objects of the same nature more likely to form in that way, just as rain trickling down a slope forms niches that water is more likely to follow the paths of. Chemists who synthesize new chemicals often have trouble in making them crystallize, but later iterations form much more quickly: the sugar turanose was considered a liquid for decades, but after it first crystallized in the 1920s, it began crystallizing all over the world. Xylitol, a sugar alcohol used as a gum sweetener, was first made in 1891 and was a liquid until 1942 a form with a melting point of 61 degrees centigrade formed; several years later, another form with a melting point of 91 degrees centigrade formed, and now the liquid form cannot be made anymore. Ritonavir, an AIDS drug made by Abbott Laboratories, was first made in 1996; after 18 months on the market, an unknown polymorph of the drug began to form, and within a few days, only the new polymorph would synthesize. The new form was only half as soluble as the old and after spending a massive amount of time and money trying to make the old form synthesize again, they gave up and produced the new form, recommending double the dosage (they were able to create the original polymorph, but not reliably, as it would now frequently form in a mixture with the new polymorph).\nIf it's true that morphic fields exert influence regardless of distance, then it's possible that on another planet, the a similar kind of molecule began forming a certain way on such a large scale that it changed the way these molecules now form on our planet.",
				"added": 1552687369
			}
		],
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 2,
				"body": "If nobody wants to host the video, then nobody has to host it. Censoring it implies the State using force to scrub it, which is of course morally wrong. But there is no \"right to information\" as some people say. Nobody is obligated to host the video or the manifesto. Let it be voluntary. If it is valued in any way, then it will remain.",
				"added": 1552830851
			}
		],
		"1552788873_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "> [quantumkitty](#comment_212_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): It's good to have freedom. Then again, now I have to be scared of being randomly gunned down every time I go and do my groceries at the mall.\n\nI don't think it makes a difference: the existence of this information doesn't do anything, it comes down to the person, an little else. The nit-picking analysis of JFK's assassination has not triggered spontaneous assassinations of world leaders across the globe. The level of information is not the cause, and we can debate the \"cause\" for a long while, but the present question is how much information is \"proper.\" The government is not suppressing the video because they fear it will inspire other shooters, it is simply because the video is unfiltered; it can't be twisted and re-written or laced with disinformation like all of their articles. The information does not threaten the public, it threatens the legitimacy of the government, not that there ever was such a thing.",
				"added": 1552979845
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 4,
				"body": "I think overall it is growing, but with periodical recessions in users. For instance when the US president gave up American custody of ICANN right before the election of a new leader, lots of people came to ZeroNet. Then after a couple months, nothing changes on the clearnet, and most of them stop getting on here and go back to business as usual, but I like to believe a small number stuck around, so that's growth at the end of the day.\nI think right now it will take a major development to really get things going, either a new service here that people will want to use, or the collapse of the old order. I am not sure ZeroNet will survive in its current form and it may become something very different before the peer to peer ecosystem is truly formed.",
				"added": 1554325831
			}
		],
		"1554477808_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 5,
				"body": "The two most common scenarios argued over, I believe, are 1. Monitoring by private services for the sake of ad revenue, and 2. Monitoring by state agencies. State agencies are of course the greater threat, as you can delete your Facebook and Google accounts any time, and isolate yourself from their practices, while government agencies are typically more \"compulsory\" to put it lightly.\nRE: surveillance by private companies, basically it makes the Internet a worse place. Websites have become monstrously inaccessible without overtaxing your browser/hardware because the amount of crap they have to load--namely ads and the various tracking/monitoring scripts used to sell them. A free-as-in-freedom decentralized net will never evolve so long as this ad dependency goes unchecked, and opting to use open source or non-tracking premium software reduces this stagnation.\nRE: government surveillance, this one is a bit more obvious, but it is worth talking about due to the extent to which it leverages private companies. Intensive monitoring in junction with a convoluted and illegitimate legal code allows the state to incarcerate citizens it views as enemies based on non-offenses (see: anti-terrorism laws being used to incarcerate peaceful activists world wide in the last decade).\nThere is also a junction between the two which we haven't really seen come onto the scene yet, but should be wary of: private websites with political agendas controlling access to resources. This mainly refers to the spoken-of possibility of Google or Facebook becoming the de-facto portal for things like hiring employees, credit approval, etc. and red-flagging job-seekers whose personal beliefs expressed in \"private\" messages do not align with the personal beliefs of the site team.\nThough I would not advocate for the banning of this or that or anything in the private sector, only the involuntary tracking by the state of course; I would instead advocate and support new services that are privacy-minded instead of the vertical stacks that exist now.",
				"added": 1554581186
			}
		],
		"1538188815_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": [
			{
				"comment_id": 6,
				"body": "http://127.0.0.1:43110/1cQfdZfKPwsHfmKvC5NRmL1Q8eAAmNrSy/\nThis site has been around a while but died kind of soon after launch; it's a clone of ZeroTalk.",
				"added": 1554849204
			},
			{
				"comment_id": 10,
				"body": "> [whocoulditbe](#comment_1_1Br3Miz6bsuYZnNu5CHRmA7j65KZnL5qc8): It's cool to see other furries on here!\n\nhttp://127.0.0.1:43110/1cQfdZfKPwsHfmKvC5NRmL1Q8eAAmNrSy/\nGet in here, you big gay",
				"added": 1555672204
			}
		],
		"1552196439_1C7YrxNaqMVjJNqJ1NWMSnzCLdpyfZz27z": [
			{
				"comment_id": 7,
				"body": "I have been working on a typesetting format made for digital documents instead of printed works. I believe the future of information sharing will be largely peer to peer and digital, whether in the form of simple web pages like dpage's, or PDFs. It's not hugely important and in a sense I see it more as a personal art/design project, but it is inspired by an aversion to censorship and privacy control.",
				"added": 1555234476
			}
		],
		"1555383590_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": [
			{
				"comment_id": 8,
				"body": "Obvious arson attack. Anti-catholic attacks in France have shot up in recent years, and in 2019 we have already witnessed the burning of other churches-which firefighters have officially declared as arsons-the destruction of statues, altars, and the desecration of Eucharist items. For the government to call this an accident when it happened after work hours on top of a string of anti-Catholic church burnings and vandalism is ridiculous.",
				"added": 1555485970
			},
			{
				"comment_id": 9,
				"body": "> [geekosan](#comment_10_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4): I much doubt that, more inclined to think this was an accident.\n\nConstruction site safety measurements, especially for fire, are extreme to say the least. The probability of an accidental fire is intentionally minimized to nearly zero. Meanwhile there have been mounting church vandalisms and burnings against Catholics in France. Attacking the most prominent Catholic cathedral, which the multitudes of French Muslims cheered on and celebrated on Twitter, seems like a far more likely move. Would you kindly explain what you believe caused the \"accident\" after all workers had left the premises, considering electricity was restricted for the sake of avoiding fires?",
				"added": 1555619203
			}
		],
		"1555707064_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 11,
				"body": "Another statist farce. These people have nothing to offer you, they have nothing which they can give to you, they can only promise not to take away things you already possess. There is no \"freedom\" that they can create and hand to you; the central illusion of the democratic state is that your freedoms depend on it, and that your submission to the ruler makes you free. You are a slave for playing their game.",
				"added": 1555777138
			},
			{
				"comment_id": 12,
				"body": "> [anonymouslogin](#comment_219_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): There will be a president after Trump. Perhaps it will be Trump. My point is, if the appointment is inevitable why not influence it in the best possible way? Vote Yang!\n\nHow can one man have any power over the rest of us? What you're describing is total fiction. The power you believe he has is of your own creation. You want him to have power, you want him to control the economy, the decisions of others, to thwart your enemies.\nIf you want me to \"vote\" for him, then you must demonstrate how we will all be more free with him as a ruler than without. As \"positive\" points of him point to yet more slavery, theft through taxation, etc. There will be more wars, there will be hundreds of thousands of bombs dropped on other nations, there will billions of dollars spent on weapons, the US will still possess and maintain nuclear WMDs, Yang will not change any of this, you are a fraud, just like the man you worship.",
				"added": 1555949583
			},
			{
				"comment_id": 13,
				"body": "> [anonymouslogin](#comment_231_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Who said anything about worship? What do you advocate? Anarchy?\n\nWhorship in the sense that you illogically tie your current and future wellbeing to the policies of a mortal man, or group thereof. As humans we naturally seek subservience to something--a leader, a metanarrative, a substance--and do so voluntarily. While this reveals an unfortunate tendency towards tyranny it also reveals that power structures are extremely fragile and rely on the voluntary submission of the majority, to authorize the involuntary subduing of others. I don't care if you follow Yang off a cliff, but forcing the rest of us to follow along and fund your programs (assuming he is elected etc.) is immoral and illogical. You're creating logically opposed definitions of humans: those can exert force to control others, and those who cannot. Yang--and all presidents--believe in using force to imprison those who refuse to pay him taxes, and if they resist arrest, then his servants are authorized to kill them.\nI am advocating anarchy as it is logically consistent, morally just, and practical. Rather than politics of voluntary servitude, I am advocating politics of voluntary inservitude, \"reflective indocility\", as in Foucault. Fictional laws and regulations ought to be replaced by social relations which are organized about communication rather than power structures and power politics.",
				"added": 1556046118
			},
			{
				"comment_id": 14,
				"body": "> [anonymouslogin](#comment_234_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Leadership through consensus.\n\nNow you know that isn't true.\n> [anonymouslogin](#comment_234_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): If you live in the US and don't pay taxes, I hope you never drive on a tax funded road, or visit a public facility because participating in those things would cause problems for your approach to ethics.\n\nMy argument was that the government requires involuntary submission and forces people to be a part of it, and you're telling me that my being a part of it is my fault, and not the governments? Also the roads in the US and Britain were built and maintained by private companies originally, the government only took them over later. Roads SHOULD be privately owned, and toll roads in major cities worldwide (London, Stockholm, Singapore, some highways in the US and others) are more efficient, more environmentally friendly, and safer. The fact that government roads are poorly maintained, accident prone, and require funds to be illegally moved from the general fund because gas taxes can't pay for maintenance are pretty strong signs that your statist system of building infrastructure doesn't work.\n\n> [anonymouslogin](#comment_234_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Furthermore, no matter how fierce you think you are, in an anarchy with no consequences there is always some person bigger and more fierce than you who will beat you up and take your resources.\n\nIf that were true, then hundreds of thousands of years ago, the strongest men would have killed their competitors so they can have universal access to all females in their tribes. But of course you can't do this, because collaborating is exponentially more useful and productive than stealing--all it takes is a handful of other people to work together to overthrow you. Civilization itself began when men decided it'd be better to negotiate rather than throw spears at each other, and it's because there are consequences. If you kill an innocent man and take his things, then everyone suddenly views you as a threat, because you may do the same thing to them. If they don't kill you outright in response, you will certainly be ostracized and cut off from the services everyone else provides. social relations have value beyond political power, which is why the state seeks to supplant all social relationships with state power like when private charity was replaced with welfare in the 20th century. For more on justice social order in a stateless, lawless society, it has been written about for decades, but Stefan Molyneux wrote a great article about it in 2006 that still holds up https://freedomain.blogspot.com/2006/04/stateless-prisons.html\n\n> [anonymouslogin](#comment_234_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): You'll either vote them in as king or die. This is reality, as sorry as I am for it.\n\nAh, no I won't. I have a family, close friends, I'm a provider in my community, a member of a Church and a religious fraternity, I have a network of colleagues I still keep up with and attend conferences with. I think we collectively have more power than some rogue element. Criminals are dangerous, whether or not there is a government. But we have many mechanisms or discouraging and fighting criminal elements besides the state. I'd argue that a military and police force backed with tanks, jets, and nukes is more dangerous. Hopefully it won't take a THIRD world war to prove how dangerous the state is, but maybe two plus a cold war wasn't enough to get the message across.",
				"added": 1556125642
			},
			{
				"comment_id": 15,
				"body": "> [anonymouslogin](#comment_236_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I wish it was though......\n\nJohn C. Calhoun, an American politician in the 19th century, wrote about leadership through consensus quite a bit. He recognized that there will always be people who benefit from government at the expense of others: those who give more than they receive from it, and those who receive more than they give. He proposed a form of government modeled after the Roman and Polish monarchies, in which there were representatives that all had veto power over one another--plebeians can veto the laws of patricians and vice versa. Of course, nobody wants to play fair like that. The supreme court has been the real aim of political parties for decades because having 5 justices gives you absolute power over the legal system. Vetos for me but not for thee. A nation without laws or leaders is a simple extension of Calhoun's principle of fairness--no one group having total authority over another, where something's strength is derived from its value, not from its power or from violence.",
				"added": 1556280152
			},
			{
				"comment_id": 16,
				"body": "> [anonymouslogin](#comment_244_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Where there is universal mutual respect, I think this utopian view of anarchy might work.\nBy mutual respect, I assume you mean respect for property. This isn't just a requirement for practical anarchy, it is a requirement for really any system in which people have any degree of freedom. And I think it is clear that the government fails in this regard: businesses and employees are taxed excessively, and states seem to have some inevitable tendency to invade one another which obviously does not respect the property of those being invaded. \nThink of the wars of religion in Europe, prior to the separation of church and state: denominations fighting for control of the government because it gives them the authority to wipe out their opponents; the same thing happens now, between the classes, between races, the sexes etc. \nWhat I think you fail to see here is that the lack of respect between groups in a statist society exists because these groups can use the state to control one another, rather than negotiate and cooperate. Mutual respect comes from the mutual understanding that negotiating is better than fighting because violence just depletes resources, including human resources, and creates an untenable, unstable society: no one will bother to accumulate resources or create things if they can have it all taken away by force in an instant. And the idea that mutual respect just never existed before the state is ridiculous. Like if you lived in a small town, you'd know--people don't just gouge each other on prices because you quickly gain a reputation for being greedy and unfair and you're ostracized, your kids are ostracized, it's just generally unpleasant for all parties involved. Mutual respect is an inevitable, emergent property of successful communities, and communities with mutual respect for property rights are exponentially more prosperous and productive than those which do not have this understand of respect, and they eventually collapse while societies built on the respect of property rights prosper and spread.\nSo mutual respect for one another is not exactly hard to come by in a free society, but in a statist society, where it is possible for one group to gain control over the property of another group through force (the working class using taxes to take wealth from the upper class; the military industrial complex taxing the general population for billions of dollars to pay for weapons), you don't need respect for property rights to get what you want anymore, so it vanishes.",
				"added": 1556450703
			},
			{
				"comment_id": 17,
				"body": "> [anonymouslogin](#comment_256_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I agree that most public services should be pay for use. ... The key is to make sure the corporations and ruling elite pay the people enough to afford ALL of the services they require. The reality is so far away for any number of reasons, but mostly just greed. \n\nSorry to double-post but my client was out of sync and I missed this comment.\n>Most public services should be pay for use\nWhy most and not all? I'm sure you've heard of the \"problem of the commons;\" it is essentially a case for privatization. If you want something taken care of sustainably and efficiently, then let people express value in it. You want clean water, so instead of regulations, have companies that will ensure water quality: the company has an incentive to keep water clean because if they don't they have to pay out; a portion of the client payments can then be invested in sanitation infrastructure, R&D, etc., because these things will earn the insurance company more money in the long run.\nPrices are information: how much people are willing to pay for what under what circumstances. They're offered by sellers but ultimately they are determined by customers, praxeology. The idea that you can \"make sure\" all the prices are right essentially means you can distribute all the resources just right. The information contained in prices signals what resources need to go where; the market behaves as a collective intelligence in this way. And people have studied the \"planning problem\" for a century at this point, at least. The fact of the matter is you cannot replicate, much less predict, this collective intelligence. So trying to set taxes and minimum wages and hours and vacation days and so on is ridiculous. Not only is it less efficient than letting people decide for themselves, but on what moral grounds can you interfere? It is immoral to deprive someone of their sovereignty, and you can't just do it sometimes and not others, it's not subjective. So if you actually believe it is a moral imperative to preserve sovereignty, then on what possible grounds can you violate it?\n>GREED\nI won't spend long on this one, because it is the most nonsensical. How do you draw a line between an amount of wealth that constitutes greed and an amount that does not? In order to even codify and enforce such an idea, you must have such a lust for power, to wish to appropriate the possessions of others, who would prefer to be left alone, that even the wealthiest among us cannot comprehend the greed for control and domination that smolders in the hearts of socialists and regulators.\nAnd it's all so arbitrary anyway. Is it morally wrong for someone to be poor? If so, then are monks and ascetics \"evil\" for choosing to be poor? Obviously not--there is no real evil in wanting or not wanting something. What's evil is taking away that choice. Calling people greedy and suggesting that their actions should be legally controlled and dictated is far more dangerous than anyone running a business with voluntary employees, offering prices that people are free to accept or reject.",
				"added": 1556470198
			},
			{
				"comment_id": 18,
				"body": "> [anonymouslogin](#comment_260_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Industrialized nations don't account for the external costs of their products.\nThat is true, nations don't account for external costs, businesses and customers do. And I already gave a pretty fair example of how environmental costs are handled in a free society. People want clean air, people want clean water, people don't want mercury and coal dust dumped in their back yards, and if you privatize these costs with DROs, then suddenly you have people spending money on protecting the environment, and that money is invested in R&D and infrastructure to limit environmental damages; and the companies with the best R&D divisions sell the best technology to other firms and so on.\nI don't know what you do for a living, I don't want to make any presuppositions, but I do think that people who don't work natural resource management have been painted an inaccurate picture of how procurement companies function. I manage forests and timber/fiber plantations, and here in the southeastern United States, 95% of forested land is privately owned, it is productive, well kept, and sustainably managed because people harvest the wood on it. You hire timber cruisers to assess the property, some trees are taken for lumber, others are left to regrow the forest. Meanwhile the government managed land out west is Hell--theirs is used more for grazing than forestry of course but compare the value of an acre of government land set aside for ranchers to graze cattle on to an acre of privately managed land, it's night and day.\n>If the environmental cost of a gallon of gasoline were factored into the price, no one would be able to afford it.\nThe Duke study I found on social/environmental costs pegs the \"adjusted\" price per gallon $6.27 a gallon. If that were the case then people would probably switch to more fuel efficient vehicles; I don't think \"no one would be able to afford it.\" And I get it--that's the point--raise prices so people will switch to cleaner habits. Like I said, I work in natural resource management, I am a conservationist, one who actually works to develop sustainable management plans and preserve forest ecosystems, not a politician or armchair environmentalist who calls for ineffective laws to be passed and then blame companies when things keep getting worse. But the cause is not gasoline being too cheap: the only reason demand drives gasoline prices so far down is because things like road usage are free, and when the government constructs new roads, it doesn't have to pay anyone for the environmental damages caused by road use, usually because it's on government owned land that they have no financial incentive to conserve.\nSome articles on road privatization which reference multiple studies on the effects of toll roads:\nhttps://www.wired.com/story/gas-tax-vmt-toll-road/\nhttps://www.wired.com/story/virginia-i66-toll-road/\n>In this way the most egregious offenders have the highest profit margins, and ethical companies can't compete.\nThis is another fabrication. For one, in a free society you would get more money for running a clean business because of funds from insurance companies, so you'd make more money by cooperating with them, so long as people are allowed to express interest in environmental quality. And it's not just reactive either, it's not just \"Oh this mining company set up shop and dynamited a whole mountain, took the ores and skipped town just as the salmon started dying off.\" You'd have certification agencies which examine company plans, methods, supply chains etc., and can give the company a stamp of a aproval or not. Companies that are certified as sustainable get more customers on the wholesale market because A. it means they will be around longer and your supply point won't suddenly dry up five years down the road, and B. they conduct business in an ethical way, meaning there won't be any major scandals that link back to you, which would ruin your company's reputation when people find out you knowingly purchased supplies from an uncertified procurement company.\nAgain, not wanting to make presuppositions but I don't get the impression that you've worked in this kind of field before. I think it's great that you care about the environment--I do too, I spent the majority of my adult life working to maximize sustainable yields in the timber industry, something that takes a little bit more commitment than reading an article about social costs and casting a vote for a government program funded with someone else's money.\n>Regulation is the best way to make the business playing field equal and protect the environment.\nReality thoroughly disproves that point. US business regulations push manufacturing into countries with less sustainable infrastructure and even less free economies in which the government faces no consequences for environmental damages. If you want people to pay for environmental costs, start with the government: the government is able to print money at will meaning environmental costs don't even exist to them. When the Canadian government set fishing limits on Newfoundland, the social restrictions that prevented over-fishing were superseded and the fishing industry there practically died off overnight.\nIf you want further reading, I would suggest any of Molyneux's books on practical anarchy--before he became a writer he was a software entrepreneur who developed greentech software to help companies manage environmental impacts, and programs to assist in maintaining workplace safety standards and the like (things that companies are in fact interested in). Additionally Anderson & Leal's \"Free Market Environmentalism\" is a comprehensive book on the subject.",
				"added": 1556561578
			},
			{
				"comment_id": 21,
				"body": "> [atomiserxenolith](#comment_64_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): People look for one 'dear leader' who can take all the responsibility and do all the thinking for them ...\nAnd it's not just that these leaders don't know how to run X. It's that NOBODY knows how to run X, when it's sufficiently complex. Nobody knows how to \"run\" the timber industry, it's a combination of so many disciplines and fields of study. So people tend to specialize and then collaborate with other experts as needed. So political leaders--I'm not saying Donald Trump is stupid, but the idea that you can \"run\" a country is ridiculous. But it's the Dunning-Kruger effect: if you don't know much about something, then you think it's more simple than it really is. The only people stepping up to the plate, with good intentions anyway, are the ones who really underestimate the task of political leadership. The ones who know exactly what they're doing are the ones doing it for power and wealth, because they know that the state exists to benefit a select few people, they don't have any illusions of it benefiting the masses, so they just want to be one of the few. Think of where these politicians would be without the state? Nobody would ever hear about them, and they certainly would not have the hundreds of millions of dollars that the Obamas and the Clintons etc. have.\n>If some of the contributors here had to put their money where their mouth is, it wouldn't be long before they had very little currency left to do any damage with their shallow and irrelevant thinking.\nI think this also highlights the impetus for \"benevolent\" big government. Helping people is really hard. I've tried to help friends go on a diet or quit smoking and THAT'S hard enough. It is so difficult to truly help people, that everyone would rather just pay taxes and vote for government programs and then feel like they've helped someone. Of course it doesn't work, you can't just throw resources at people to fix all of their problems--if someone is trying to go on a diet and keeps cheating then throwing money at them won't do anything, it'll probably make it worse. If someone has a drinking or smoking problem, then throwing tax dollars at them isn't going to do anything--making it illegal for healthcare providers to discriminate against people who are overweight or sedentary etc. is certainly not providing any incentive for them to get healthy. You can't help people with government programs, they do not work, and if anybody thinks so, then I can promise you they have not really and truly tried to help these people themselves because then they would know it is not that simple. And I'm not against charity--I think we need charity. But charity has to be managed, intensely, by some kind of organization, whether that is the church or non-compulsory union whatever. But we can't let the state manage this.",
				"added": 1557112115
			},
			{
				"comment_id": 22,
				"body": "> [anonymouslogin](#comment_267_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): In a political environment requiring a \"leader\" like the body of a serpent needs a head\nProjects need leaders, companies need leaders, any functioning organization needs some kind of hierarchy, I'm not arguing against that. But realistically how much can you organize under a single person or board of individuals, before the whole thing becomes too bloated or spread out and they lose control? In the business world this the difference between large companies and startups: small businesses driven by passionate individuals can outmaneuver large companies. When you run a \"large\" business, if you want to, say, upgrade your office computers, you have to buy thousands of computers, and which usually means bidding for a lot in an auction and then having people install them in all the workspaces and that's all peanuts compared to the task of building and maintaining an office intranet connecting all those machines. If you're a startup of like 15 people working remotely, your overhead is basically nothing compared to the large business. And of course if a small business succeeds it usually is incorporated into a parent company or it becomes a large company itself and the cycle continues. Businesses have an average lifespan of like 40 years. If you look at the 100 largest businesses of a hundred years almost all of them are gone now, it's one of the reasons this fear of monopolies in a free market is so ridiculous.\n\nSo the state can be thought of as a \"large company\" where the \"leader\" has less control over the direction of the business, except that the business has gotten so large and is in charge of so many different things that the leader has no control whatsoever. And that's where we get the \"deep state\", spin doctors, the unelected secretaries serving life terms influencing elected politicians in certain governmental structures like in the UK. The leader has so little control over the individual parts that they begin to function autonomously, but instead of becoming these efficient self-governing bodies, they become corrupt because they still act with the perceived authority of the leader. One problem we have in the US in particular is these divisions and agencies competing against one another directly: the department of the interior, the department of agriculture, the bureau of land management, forestry service, fish and wildlife service--these agencies don't get along, to say the least. One of the reasons New Zealand has a proportionately more efficient timber industry is because they have fewer government agencies competing against one another in land management.\n\nBasically if you want the leadership of the state to actually function, you have to shrink the state down to a size where it does not become unraveled and corrupt. So let's say you get the government shrunk down to a size where it can be managed (at which point we probably don't need it). The problem with that is no matter how small you shrink the state, it will always grow bigger again. So long as it has the monopoly on violence, so long as it can redistribute wealth to give people what they want in the short-term, then people will always let it get bigger, they will WANT it to get bigger. It doesn't work--shrinking the government does not work--you have to gt rid of it.",
				"added": 1557121478
			}
		],
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 19,
				"body": "Meanwhile their newsletter just keeps us updated on their guidelines for their transgender employees' transitions and why DNA tests are bad because it lets white people discriminate against you. They don't care about talent, they don't care about anything besides looking \"progressive\" so they can get more donations. By next year these bugs are going to be a weekly thing.",
				"added": 1556996057
			},
			{
				"comment_id": 20,
				"body": "I like to use Surf but it is minimal and lacks extensions. I'm going to give Brave a go, I used it years ago. Just remember that Mozilla did the whole \"moving beyond meritocracy\" thing. They hire based solely on diversity, not on skill, because they believe that having a diverse team is actually better than having a skilled team. This is obviously not true, and in the future this will become a constant issue. better to abandon it now.",
				"added": 1557072985
			}
		],
		"1557692157_18yjuvi7DyL85Rip57MiXEcGhkgCv2rHT2": [
			{
				"comment_id": 23,
				"body": "Someone made a primitive p2p MMO not too long ago. It was an isometric multiplayer dungeon crawler.",
				"added": 1557701226
			}
		],
		"1565919141_1HpXiKhyQBTjE53rsdiNPjqxFwny3hycS9": [
			{
				"comment_id": 24,
				"body": "http://127.0.0.1:43110/1GhQnhzopJKP1RUKX8cd55CSXXSygzPFYj/\nThere's a copy of the 8 values test hosted on a zite.",
				"added": 1565920098
			}
		],
		"1571440312_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 25,
				"body": "It's all going to burn, might as well get your $1,000 and buy some ammo with it first. Your survival chance is seriously the highest under yang than under anyone else just because you have more resources available for killing other people.",
				"added": 1571449881
			}
		],
		"1571440231_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 26,
				"body": "ABC News is already airing fake war footage to try and get people to support another invasion. War means more people watching the news for war coverage, it's literally just a money making scheme, you're retarded if you actually care about this and read the news to try and understand it.",
				"added": 1571450006
			}
		],
		"1571450538_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": [
			{
				"comment_id": 27,
				"body": "> [styromaniac](#comment_1138_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Are we spoofing reviews now? LOL\n\nNah that's just straight up what it is. Guys who just try to review movies for their execution and technical prowess are missing out, enjoying movies for their intended purposes is pea-brained compared to interpreting it yourself. Like if you don't care about computer effects, and you don't care about generic allegorical stories, and you don't care about movie soundtracks, then 'real' reviews are useless.",
				"added": 1571454565
			}
		],
		"1571930824_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi": [
			{
				"comment_id": 28,
				"body": "The destruction of British heritage, calling Africans \"quintessentially British\", government protection of immigrant rape and child grooming gangs, constant Mohammedan terrorist attacks in major cities--all of this goes on from day to day and the BBC thinks this is what'a really going to help people. Fucking pathetic.\nThe BBC will never tell the truth, the BBC will never help people, the BBC will never publish important information. If the BBC had any interest in helping people, there would be 24 hour coverage of foreign crime, the monetary costs of immigrants, the burden these inbreds create for the healthcare and insurance systems, they would be absolutely smearing Mohammedan politicians and their anti-white ethnic biases.\nThey don't care about anyone. They get their money from the government, do you really think they'll earnestly criticize the government on any grounds beyond the Overton window? Fuck them, I'll blow their brains out if I ever get the chance, you'll do more good hijacking and bombing the planes their executives and reporters fly on than by consuming their fucking PRODUCT.",
				"added": 1572114242
			}
		],
		"1573845173_1MqNGUHk63CGdv7KMZ9br6NvCUcDC5dezp": [
			{
				"comment_id": 29,
				"body": "It's mainly nobodies like CIA strategists, public opinion researchers, potentially a small number of military personnel but that's unlikely. They aren't necessarily pro-US-gov above all else, as the same people who sign off on US propaganda in movies and TV sign off on pro-China propaganda. So it's not simply pro-US, they're pro-hegemony. Below the map of national borders is a map of black-sites which could be called the real seats of power. The goal of these planners is a world of havens where they can exercise control and live with immunity to the troubles of the world. I don't know what their objective is or if there is any. It may very well be regular people seeking safety and security like everyone else, who have coincidentally found themselves in positions of immense unseen influence.",
				"added": 1573863638
			},
			{
				"comment_id": 30,
				"body": "> [xcape2net](#comment_561_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): It's more like the 80/20 rule.  20% do all the work, and the other 80% surf the internet all day--if they even bother to show up at work.\nThis is pretty much why it's so easy for manipulators to hide. Especially in the US, where there is a massive number of intercompeting agencies and departments at all levels of government. Say what you want about New Zealand having socialist inclinations and lacking free speech, the people there are still absolutely more economically free and free from the government than Americans and it's because their government is not a massive entanglement of bureaucrats siphoning money at every organizational level. In terms of real, physical size, the US government is one of if not the biggest in the world, making it rife with banana republic style corruption.",
				"added": 1573864760
			}
		],
		"1574806526_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 31,
				"body": "There are a few that I really do enjoy, and I think there are a few people like Swery and Suda51 who are true artists working in the medium. But in general I don't pay too much attention to games. Even compared to film, a shocking proportion of character/player interactions within most games are violence towards other people. I know games don't make people violent, but I do believe they program people to accept violence, support wars, etc. Why else would the US military have recruitment booths outside of media events for games that cover up US war crimes 1984-style like Call of Duty?",
				"added": 1577232756
			}
		]
	},
	"comment_vote": {
		"707_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"14_1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb": 1,
		"209_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"810_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"3_17FiRbZZvpgdkSUeVv3qbqKjTe9DDea1d8": 1,
		"64_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"113_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"174_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"38_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"375_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	}
}