{
	"next_comment_id": 16,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i usually setup a wifi hotspot, though the mobile network companies there have expensive internet so i have to suffer slow speed when out of home.\n> You may try to check that ISP reviews to see if anyone is writing about their 60GB comment. Maybe they just write it, but they are not doing any measures.\n\nYeah I will definitely have to look into it. I mean the tethering works great, but I sure wish I had a hardline connection",
			"post_id": 11,
			"date_added": 1527784238
		},
		{
			"comment_id": 2,
			"body": "> [jamesholden](#comment_1_12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8): Worst I did was cracking neighbour WEP WiFi key and using a Red Bull can as a signal enhancer. Worked well for the most part :p\n\nThat's awesome LOL. I don't have a neighbor that has hardline connection or I might try that. I live in the country. ZeroNet, Tor, and Beaker Browser for the DAT network works great using that means, but I2P not so much. ",
			"post_id": 11,
			"date_added": 1527879079
		},
		{
			"comment_id": 3,
			"body": "> [hidalgo](#comment_1_16i5onLjS8JfSVGoCVQa87DYr4kTnqnzFg): Very funny! These are old guys yes?\n\nYes they are comedians from the 1930s-1940s",
			"post_id": 18,
			"date_added": 1528221250
		},
		{
			"comment_id": 4,
			"body": "> [zerolstn](#comment_1_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj): Good, old humour. Love it. Thanks for sharing!\n\nNo problem! :) Thanks for listening!!",
			"post_id": 18,
			"date_added": 1528232550
		},
		{
			"comment_id": 5,
			"body": "> [zerolstn](#comment_1_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj): Good, old humour. Love it. Thanks for sharing!\n\nNow that I am getting the hang of the IPFS system; I might go ahead and upload some more :)",
			"post_id": 18,
			"date_added": 1528232619
		},
		{
			"comment_id": 6,
			"body": "> [zerolstn](#comment_3_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj): Really camp-y. I like it!\n> Also can't tell if getting my ass eaten is a good or bad thing lol\n\nLOL. Yeah it was verrrryyy low budget lol. I used gelatin to make a fake hand that gets chopped off and smashed in a gate. Regular old Knox Gelatin lol",
			"post_id": 23,
			"date_added": 1528671964
		},
		{
			"comment_id": 7,
			"body": "> [ulrichard](#comment_1_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ): I don't know this guy, but that's what totalitarian regimes do.\n\nYeah it's pretty fucking trippy. They say it's the private companies themselves making the decisions, but you damn well know politics are in on it. Fucking cowards playing mind games",
			"post_id": 30,
			"date_added": 1537736727
		},
		{
			"comment_id": 8,
			"body": "> [ulrichard](#comment_2_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ): Ok, I watched part of the video. I have to say it is not my thing. A bit too much conspiracy theories. But I'm all for free speech. I wouldn't classify this as hate speech. They use rude language, but don't call for anything nasty. Whoever wants to watch this should be able to.\n\nYeah he's a bit of a nutter sometimes, but there's no reason i can see to ban him",
			"post_id": 30,
			"date_added": 1537819110
		},
		{
			"comment_id": 9,
			"body": "> [ulrichard](#comment_4_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ): cool stuff\n\nYeah. The videos actually make it funny, but it ain't really funny lol. I would be balling out my MEP if I were in the EU. Most of those fuckers didn't even read what they signed and were happy about the outcome. Pitiful",
			"post_id": 34,
			"date_added": 1538003649
		},
		{
			"comment_id": 10,
			"body": "> [balancer73](#comment_1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): I have been with SSB Patchwork for almost two years. Unfortunately, I practically do not use it. For full use there are barriers:\n> \n> No good web gates\n> There is a mass of unknown content on my computer that I don’t control (more than 3GB already)\n> Technically, this is just a blog. No file sharing, video, audio, etc.\n> There is no way to find out where and how my own content is stored safely.\n> Finally, there is a rather strange audience. This, of course, is a subjective assessment, but I'm not interested in them :)\n> \n> So I prefer ZeroNet :)\n\nI just thought it was neat. I geek out over pretty much any new decentralized thing I find. I usually share them for people who may not have seen them. I haven't fully explored it and from your description it sounds rather boring LOL\n\nI do like ZeroNet though and it's amazing what they're doing here. Thanks for reading and commenting :)",
			"post_id": 43,
			"date_added": 1539211806
		},
		{
			"comment_id": 11,
			"body": "> [apocalapsus](#comment_1_1CyQdj779DH9yTm2RucJkjfShqa6wUD1fN): Audio is not playable :(\n\nAwwww.. well that sucks. I added it to IFS and it is playing for me here on my office computer. I uploaded it on my home machine. \n",
			"post_id": 55,
			"date_added": 1544450511
		},
		{
			"comment_id": 12,
			"body": "> [apocalapsus](#comment_1_1CyQdj779DH9yTm2RucJkjfShqa6wUD1fN): Audio is not playable :(\n\nIt stopped in the middle of the audio for me. Well phooey... it must not have gotten all the way uploaded to IFS. I'll have to fix it",
			"post_id": 55,
			"date_added": 1544451360
		},
		{
			"comment_id": 14,
			"body": "> [diligentslacker](#comment_1_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u): Thats cool. what is the markup to add audio from ifs into blog post? if you don't mind...\n\n<audio controls>\n<source src=\"audio link here\" type=\"audio/ogg\">\n<source src=\"audio link here\" type=\"audio/mpeg\">\nYour browser does not support the audio element.\n</audio>\n\n\n^^^There ya go :)",
			"post_id": 55,
			"date_added": 1545225769
		},
		{
			"comment_id": 15,
			"body": "> [t0ny](#comment_1_1DQ97EiEM8nSZ34beMaBepz7cM8zDAFLX3): super!\n\nIKR?! She's beautiful",
			"post_id": 45,
			"date_added": 1549481910
		}
	],
	"comment_vote": {},
	"post_vote": {
		"2": 1,
		"17": 1,
		"18": 1,
		"36": 1
	}
}