{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Por que faço um link para o WayBack Machine em vez do site original",
			"body": "Ao vincular a uma página com o propósito de referência, parece-me melhor vincular ao [arquivo](https://archive.org/) de uma determinada página, ao invés do próprio site original.\n\nIsso garante que, depois de alguns anos, meu artigo seja consistente. Devido à natureza mutável da web, existe a chance de que, após alguns anos, o link leve a:\n\n- 404 / Não encontrado (mais comum)\n- Conteúdo alterado ou editado ou totalmente substituído\n- Conteúdo que, devido ao aumento da popularidade, passou a ser blindado, exigindo do usuário uma conta para ler o artigo na íntegra.\n\n#O link para um arquivo é provavelmente mais confiável do que o link para um conteúdo Web dinâmico instável.\n\nTome medidas defensivas. Para preparar seu conteúdo para o futuro, em vez de fazer referência à web em geral, é muito mais confiável vincular a um arquivo.\n\n#Exemplo:\nO Epoch Times escreveu um artigo sobre mineração de dados em smartphones para seus usuários. Este é o artigo arquivado aqui:\n[A versão do arquivo (totalmente legível)](https://web.archive.org/web/20190214015500/https://www.theepochtimes.com/smartphone-app-users-are-data-mined-even-when-not-using-the-apps_2787202.html)\n\n#Conteúdo do artigo antes\nVocê pode ver seu conteúdo útil legível perfeitamente “normal”.\n- https://ipfs.infura.io/ipfs/QmTp9JPehr4YPRo94zDqPKg54G6gewbCw9fBKnn7vmbkiF\n\n#Conteúdo do artigo depois\nAgora é spam de um site que sofre de necessidades financeiras.\n- https://ipfs.infura.io/ipfs/QmNtXLk5qAYyRxWDEGwBKUjXPpc3kNhE3uh5R277Tan711\n\nPortanto, em 14 de fevereiro de 2019, seus usuários teriam visto o conteúdo que você pretendia. No entanto, em 07 de setembro de 2020, seus usuários serão solicitados a apoiar o jornalismo independente.\n\n#Se um registro de arquivo não existe, faça um\nVale a pena o momento extra, ao fazer referência a um site, para fazer um arquivo da página que você deseja referenciar, se ainda não existir. Depois disso, use imediatamente o link da entrada [archive.org](https://archive.org/), em vez do blog, notícias, informações ou site de fórum que você deseja consultar.\n\n#Em tempos de instabilidade, tome medidas para estabilidade\nA web é um lugar que muda rapidamente. Ainda mais durante a [pandemia de Covid](https://pt.wikipedia.org/wiki/Pandemia_de_COVID-19) e os sofridos mercados financeiros. Como os tempos estão financeiramente mais difíceis, os sites estão desaparecendo, acumulando publicidade, exigindo resposta do usuário e coisas assim.\n\nPara evitar que seu conteúdo perca qualidade devido a essas coisas, vincular a uma cópia estática sólida e imutável da página é muito mais confiável.\n\n- Fonte: https://web.archive.org/web/20200908202603/https://hawaiigentech.com/post/commentary/why-i-link-to-waybackmachine-instead/",
			"added": 1599605622
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#Guerrilha Comunista-Maoísta nas Filipinas - O Cotidiano da Luta Armada\n- https://siasky.net/AABKbjmfjeNVdlIzxtP9VnSqa2sQd2SA9d50m9pYa1XqMQ\n\nDocumentário produzido no ano de 2013 por ocasião do aniversário de 45 anos da fundação do Partido Comunista das Filipinas mostra o cotidiano dos comunistas filipinos no decorrer da revolução, da luta armada, do trabalho político com as massas trabalhadoras de camponeses e indígenas.\n\n#O avanço da Guerrilha Comunista Maoísta nas Filipinas\n- https://siasky.net/AADUDM_hxfcx2pzhJNFyoPjH1uGDUQcmY2YanjdFI84xOQ\n\nVídeo feito por jornalistas progressistas filipinos mostra o avanço da Guerra Popular dirigida pelo Partido Comunista das Filipinas no ano de 2012 no sul de Mindanao, a segunda maior ilha do país.\n\nO braço armado do Partido, o Novo Exército Popular, leva a cabo uma luta contra uma operação genocida do Estado filipino, a OPLAN Bayanihan, um programa de contrainsurgência apoiado pelos Estados Unidos que leva a cabo a militarização e o massacre de comunidades rurais camponesas e indígenas no país, no intuito não apenas de derrotar a grande Revolução dirigida Partido Comunista das Filipinas, como de roubar as terras das massas camponesas e indígenas e dá-las para empresas mineradoras, madeireiras e agrobusiness.\n\nO Partido Comunista das Filipinas foi fundado sob a ideologia do Marxismo-Leninismo-Pensamento Mao Tsé-Tung no ano de 1968, fundou o NEP no ano de 1969 e desde então leva a cabo uma Guerra Popular Prolongada, mobilizando as massas operárias e camponesas filipinas para a tomada do poder, a derrocada da dominação do imperialismo norte-americano, dos latifundiários e capitalistas burocráticos, e a instauração de um Estado democrático-popular com a perspectiva da construção do socialismo.\n\n#A Guerrilha Comunista Maoísta na Índia\n- https://siasky.net/AADZW9koF1b4_fOsarb4BaLdoAGNbwltRRz17HT-tDl23w\n\nDesde o ano de 1967, com a eclosão do Levante Agrário de Naxalbari, na aldeia de Naxalbari, dirigida por militantes comunistas, o Partido Comunista da Índia (Maoísta) conduz uma revolução armada mediante a Guerra Popular Prolongada para derrubar o velho regime semicolonial e semifeudal indiano e fundar uma República democrático-popular, tendo como perspectiva a construção do socialismo e do comunismo.\n\nDesde o final da década de 1980 e início da década de 1990, o velho Estado reacionário indiano tem aprofundado a aplicação das políticas neoliberais do Consenso de Washington, o que tem se traduzido na entrega cada vez maior de terras das comunidades camponesas e indígenas para grandes mineradoras, projetos industriais e na destruição do meio ambiente para satisfazer o lucro de madeireiras e das construtoras de barragens.\n\nO Estado reacionário indiano tem levado a cabo a odiosa \"Operação Caçada Verde\" como forma de militarizar as comunidades rurais não apenas para entregar as terras dos camponeses e indígenas aos grandes capitalistas e fazendeiros como também para tentar, fracassadamente, derrotar a Guerra Popular dirigida pelo Partido Comunista da Índia (Maoísta). Como resultado da guerra suja feita pelo Estado indiano contra as massas rurais, já se calcula em mais de 5 milhões o número de refugiados internos. Nesta guerra suja, o Estado reacionário não se limita a utilizar seu próprio exército para massacrar as massas, mas emprega também grupos paramilitares de extrema direita, como a famigerada \"Salwa Judum\".\n\nO presente documentário foi filmado na região central da Índia, considerado pelas classes dominantes indianas como o \"Corredor Vermelho\", em razão de nesta região se concentrarem as principais bases de apoio do Partido Comunista da Índia (Maoísta) e seu exército popular, onde atualmente vivem cerca de 40 milhões de pessoas.\n\n#Reportagem sobre a Guerrilha Comunista Maoísta da Índia\n- https://siasky.net/AAB-EgkxeG3tqqRDE9Z4NYx3pLrlBPpDD596II_XfjKOZw\n\nReportagem que apresenta um pouco das atividades dos soldados do Exército Guerrilheiro Popular de Libertação, dirigido pelo Partido Comunista da Índia (Maoísta), e também a história do movimento marxista-leninista-maoísta na Índia.",
				"added": 1599597466
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 2,
				"body": "#Álgebra Linear: utilização de matrizes para criptografia de mensagens\n- https://siasky.net/AACDUtqgUqtu4xwAyPW3ukVAJ9nZdSXxgytjmo4DAun-sQ\n\n[Álgebra linear](https://everipedia.org/wiki/lang_en/Linear_algebra) é um ramo da matemática que surgiu do estudo detalhado de sistemas de equações lineares, sejam elas algébricas ou diferenciais. A álgebra linear utiliza alguns conceitos e estruturas fundamentais da matemática como vetores, espaços vetoriais, transformações lineares, sistemas de equações lineares e matrizes.",
				"added": 1599598010
			},
			{
				"comment_id": 3,
				"body": "#Como enviar uma mensagem secreta? ([Criptografia de Hill](https://everipedia.org/wiki/lang_en/Hill_cipher))\nMétodo matricial para envio criptografado\n- https://siasky.net/AABwxgpN535-6kGZ-bPgYLaaDLGsQeYVaYJwtcrEzTOxzw",
				"added": 1599599853
			},
			{
				"comment_id": 4,
				"body": "#Álgebra linear e teoria dos números na criptografia\n- https://ipfs.infura.io/ipfs/QmZfB8vrPLcYdxK3kJ6TS42XtYJM6pxpi9F3bVmuMRwMZM\n\n\"Neste trabalho, temos por objetivo principal aplicar conceitos da Álgebra Linear e da Teoria de congruências para decodificar mensagens. Iniciaremos estudando a parte de álgebra linear que proporciona suporte a Criptografia. Em seguida estudaremos alguns resultados da Teoria de Números. Por fim, apresentaremos as cifras de Hill e utilizaremos a teoria estudada no processo de decodificação de mensagens.\"",
				"added": 1599599980
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 5,
				"body": "#Golden Boy\n\nGolden Boy é uma série de mangá escrita por [Tatsuya Egawa](https://en.wikipedia.org/wiki/Tatsuya_Egawa), sobre um jovem de 25 anos chamado Oe Kintaro, que viaja pelo Japão em sua bicicleta. O mangá foi originalmente serializado na revista Super Jump da Shueisha, em 1992. Recebeu adaptação para anime, no formato OVA com 6 episódios, produzidos pela Shueisha em conjunto com a KSS em 1995. Apesar das cenas de nudez, orgasmo, e masturbação feminina, a série de anime não é estritamente do gênero hentai, ao contrário do mangá, que se torna pornográfico a partir do segundo volume.\n\nA principal mensagem da série é de que é possível conseguir aprendizado através de qualquer situação na vida. Kintaro, apesar de iniciar os capítulos propondo-se a fazer algo no qual não possui nenhum conhecimento (como trabalhar em uma empresa de computadores sem saber programação, ou ser instrutor de natação sem saber nadar), acaba por surpreender a todos, pois em pouquíssimo tempo, através da observação, não apenas aprende aquele trabalho como inventa formas totalmente inovadoras de aumentar o desempenho e superar os desafios.\n\n- Episódios: https://ipfs.io/ipfs/QmWQURnmT3uMABMqGAcmRYNHz9abwMLESHf5VhHULoPBJN",
				"added": 1599609115
			}
		],
		"1_1DJf8DgxdWYpZ1GMguWfX6mPGybGtjA5Sv": [
			{
				"comment_id": 6,
				"body": "Session é um aplicativo de mensagens seguras de código aberto e baseado em chave pública que usa um conjunto de servidores de armazenamento descentralizados e um [protocolo de roteamento Onion](https://docs.loki.network/LokiServices/Messenger/infrastructure/#onion-requests) para enviar mensagens criptografadas de ponta a ponta com exposição mínima dos metadados do usuário. Ele faz isso ao mesmo tempo em que fornece recursos comuns de aplicativos de mensagens convencionais.\n\n- Site: https://getsession.org/\n- GitHub: https://github.com/loki-project\n- Whitepaper: https://web.archive.org/web/20200814004210/https://arxiv.org/pdf/2002.04609.pdf",
				"added": 1599615947
			}
		],
		"2_1EC7RAvqbKEigqq2cstsNuoprx6J2wumDg": [
			{
				"comment_id": 7,
				"body": "#Guia de instalação do LokiNET - Linux\n- https://docs.loki.network/Lokinet/Guides/lokinet-linux-guide/\n- https://github.com/loki-project/loki-docs/blob/master/docs/Lokinet/Guides/lokinet-linux-guide.md\n\n#Guia de instalação do Lokinet - MacOS\n- https://github.com/loki-project/loki-docs/blob/master/docs/Lokinet/Guides/lokinet-mac-guide.md\n\n#Guia de instalação do Lokinet - Windows 10\n- https://github.com/loki-project/loki-docs/blob/master/docs/Lokinet/Guides/lokinet-windows-guide.md",
				"added": 1599617888
			},
			{
				"comment_id": 8,
				"body": "#LokiNET SNApps / Guia de configuração de serviço oculto\n\nA função de SNApps é semelhante aos chamados serviços ocultos no Tor, que floresceram. Eles fornecem aos usuários uma maneira de interagir totalmente dentro do ambiente do onion router, proporcionando um grau ainda maior de anonimato do que pode ser alcançado ao acessar conteúdo hospedado externamente. Os SNApps permitem que os usuários configurem e hospedem marketplaces, fóruns, sites de denúncias, mídia social e a maioria dos outros aplicativos da Internet em suas próprias máquinas ou servidores, mantendo o anonimato total do servidor e do usuário. Isso expande muito o escopo da rede e permite que os usuários construam comunidades significativas dentro do Lokinet.\n\n- https://docs.loki.network/Lokinet/Guides/AccessingSNApps/\n- https://github.com/loki-project/loki-docs/blob/master/docs/Lokinet/Guides/AccessingSNApps.md\n\n#Lokinet Wiki: http://dw68y1xhptqbhcm5s8aaaip6dbopykagig5q5u1za4c7pzxto77y.loki/wiki/",
				"added": 1599618106
			},
			{
				"comment_id": 9,
				"body": "#Conecte-se a um chat IRC pelo Lokinet\n- https://docs.loki.network/Lokinet/Guides/LokinetIRC/\n- https://github.com/loki-project/loki-docs/blob/master/docs/Lokinet/Guides/LokinetIRC.md",
				"added": 1599618308
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 10,
				"body": "#Será que teremos computação sem consumo de energia?\n\nUm trio de pesquisadores italianos acredita ter encontrado a prova definitiva de que o [Princípio de Landauer](https://everipedia.org/wiki/lang_en/Landauer%27s_principle) pode não ser tão restritivo - ou talvez nem mesmo importar - para a computação.\n\nNos anos 1960, Rolf Landauer (1927-1999) estabeleceu o princípio de que qualquer transformação de informação que ocorra em um dispositivo computacional consome energia porque qualquer processamento produz energia térmica e, como consequência, a informação acaba se perdendo - logo, seria impossível criar um processador de qualquer tipo que não consuma energia.\n\nNinguém até hoje conseguiu demonstrar lógica ou matematicamente o contrário - menos ainda na prática - mas o Princípio de Landauer continua sendo controverso entre os físicos e mesmo entre os filósofos. Seus opositores argumentam não haver qualquer correlação entre lógica e entropia, enquanto seus defensores tentam enquadrar o conceito de informação dentro da termodinâmica estatística.\n\nEsse assunto tem uma enorme implicação prática devido ao elevadíssimo consumo de energia dos computadores. Por exemplo, estima-se que apenas as centrais de dados de empresas como Google, Facebook e Amazon sejam responsáveis pelo consumo de 2% de toda a eletricidade produzida nos EUA - se cálculos forem feitos para os computadores e demais dispositivos pessoais, o número deve ser impressionante.\n\nOcorre que todos esses computadores funcionam em um nível muito acima do mínimo previsto por Landauer, mostrando que, à parte as discussões teóricas, há espaço para melhorias.\n\nAssim, o Princípio de Landauer não impediu que Miquel Lopez Suárez, Igor Neri e Luca Gammaitoni, da Universidade de Perugia, na Itália, fizessem seus próprios experimentos para tentar se aproximar de uma computação menos intensiva em energia.\n\n#Desafiando o Princípio de Landauer\n\nOcorre que os resultados práticos obtidos pelo trio italiano deram uma balançada geral no princípio de Landauer - se não o jogaram por terra, ao menos mostraram que ele parece ter pouca relevância prática para a computação.\n\n\"Assim que começamos a trabalhar no projeto, percebemos que havia algo de errado no entendimento comum do Princípio de Landauer,\" lembra Gammaitoni.\n\nO experimento consiste em uma porta lógica OR eletromecânica, cujo trabalho é pegar um dado binário - 0 ou 1 - e convertê-lo em um 0. Esse é o exemplo central de Landauer, que argumenta que esse processo é irreversível porque a saída - 0 - não permite determinar se a entrada foi um 0 ou um 1, de forma que a operação resulta em um apagamento da informação - Landauer equiparou a informação perdida à energia que se dissipou, daí a conexão com a entropia.\n\n#Computação sem gasto de energia\n\nO dispositivo lógico construído pela equipe italiana consiste em um minúsculo braço oscilante que se dobra em resposta às tensões aplicadas aos eletrodos instalados próximos à sua extremidade. Essa configuração permitiu imitar uma porta lógica eletrônica construída com transistores.\n\nComo as forças para operar essa porta lógica mecânica são minúsculas, foi possível calcular a energia gasta para executar uma única operação lógica e verificar se essa operação lógica individual gera ou não uma dissipação de calor.\n\nE não gera.\n\nA equipe verificou que uma operação lógica em seu dispositivo pode ser realizada com um consumo de energia que representa apenas 5% do limite de Landauer.\n\n\"Agora estamos procurando por outra fonte de financiamento para continuar com essa pesquisa. Nosso objetivo é construir um dispositivo de computação completo para mostrar que você pode fazer toda a computação\" com consumo quase zero de energia, disse Gammaitoni.\n\n#Artigo: [Sub-kBT micro-electromechanical irreversible logic gate](https://ipfs.infura.io/ipfs/QmY1rtVxR2PqtxrhCmXvq1nVDzDjRhwuUNdes3Nrxswczf)\n\n- Fonte: https://web.archive.org/web/20180729140253/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=computacao-sem-consumo-energia-possivel&id=010150171117",
				"added": 1599619088
			},
			{
				"comment_id": 11,
				"body": "#Processadores vencerão Limite de Landauer para consumir menos\n\nA miniaturização tem garantido que a energia necessária para executar cada cálculo computacional venha diminuindo ano a ano. Mas, como a pressão por mais miniaturização continua, logo os aparelhos digitais atingirão o limite teórico para a energia mínima necessária para uma única operação lógica.\n\nEm 1961, muito antes de os computadores se disseminarem, o físico alemão Rolf Landauer (1927-1999), que trabalhava na IBM, publicou o artigo que o tornaria famoso. Seu estudo mostrava a quantidade mínima de energia necessária para apagar um bit de informação, isto é, passá-lo do estado '1' para o estado '0'.\n\nEsta quantidade mínima de energia, de acordo com o \"Princípio do Apagamento de Landauer\", é dependente da temperatura, o que conecta as leis da termodinâmica com as da teoria da informação. Muitos anos depois, em 2012, finalmente [experimentos confirmaram o princípio de Landauer](https://web.archive.org/web/20171121130958/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=nanotermometro-comportamento-calor-escala-atomica&id=010165130704).\n\nPara a geração atual de computadores esse limite não incomoda porque o consumo típico de energia de uma operação lógica ainda é cerca de mil vezes maior do que ele. Mas isso certamente mudará nas próximas décadas.\n\nSerá então que a computação atingirá um limite fundamental?\n\nJan Klaers, da Universidade de Twente, na Holanda, garante que não há motivo para pânico. Ele propõe vencer o Limite de Landauer fazendo um gerenciamento criterioso para sincronizar a operação do processador e a temperatura. Desta forma, será possível diminuir a energia necessária para o apagamento de cada bit, levando-o até mesmo abaixo do limite de Landauer.\n\n#Estados térmicos espremidos\n\nQuando se observa as muitas operações lógicas que ocorrem em um processador, o perfil de temperatura é complexo. Por exemplo, quando um bit muda de estado em uma determinada porta lógica, a mudança de temperatura será sentida também nas portas vizinhas.\n\nApesar da complexidade, Klaers notou que há um elo entre a temperatura e o consumo de energia do processador: Ambos têm o mesmo ritmo que o relógio do processador. Estes chamados \"estados térmicos espremidos\" mostram que, em determinados momentos, a temperatura e o gasto de energia são menores para as mesmas operações.\n\nLogo, sincronizar as operações lógicas com esses momentos - operando em uma temperatura efetivamente mais fria - levará a um consumo de energia menor do que o limite de Landauer.\n\nKlaers chegou a esta conclusão analisando um modelo mecânico minimalista, semelhante ao que Landauer usou para sua teoria, representando uma memória de um bit.\n\nAgora será necessário demonstrar que o mesmo resultado pode ser alcançado em sistemas de computação reais. A expectativa é que isso não leve os mais de 50 anos que demorou para a demonstração prática do Princípio de Landauer, uma vez que já há pesquisas tentando explorar o [Limite de Landauer para resfriar os computadores](https://web.archive.org/web/20171121130953/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=conhecimento-quantico-resfriar-computadores&id=010150110602).\n\n#Artigo: [Landauer s Erasure Principle in a Squeezed Thermal Memory](https://ipfs.infura.io/ipfs/QmfFHV49Prd54YKkr3eGq5NXo7QK3myFCEPvVhCuEYVRws)\n\n- Fonte: https://web.archive.org/web/20190212195240/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=processadores-vencer-limite-landauer-consumir-menos&id=010150190211",
				"added": 1599619490
			},
			{
				"comment_id": 12,
				"body": "#Universo tem relógio fundamental batendo no peito\n\nA proposta pode parecer estranha e difícil de compreender, mas foi assim também quando a mecânica quântica foi proposta, há quase 100 anos - quase todo o mundo continua sem entender muito a mecânica quântica, mas ela funciona maravilhosamente, como nossa era tecnológica bem demonstra.\n\nA ideia de um trio de físicos da Universidade do Estado da Pensilvânia, nos EUA, tem tudo a ver com esse ramo da física: se tudo no reino quântico é discreto, quebrado, composto de unidades individuais, ainda que minúsculas - as tais quanta -, então deve ser possível entender o tempo da mesma forma.\n\nA proposta é a seguinte: O tempo não seria algo contínuo, que flui suavemente do passado para o futuro; em lugar disso, se você olhá-lo \"de perto\" o suficiente, verá que o tempo é formado por unidades individuais, quanta de tempo, tique-taques minúsculos de um relógio que faz parte da própria estrutura do Universo, tiquetaqueando continuamente para manter tudo funcionando em harmonia.\n\nEsta é a ideia que está sendo defendida por Garrett Wendel, Luis Martínez e Martin Bojowald.\n\nE eles até calcularam quanto dura esse \"átomo de tempo\": 10^-33 segundo.\n\nO relógio fundamental permearia o Universo, algo como o [campo de Higgs](https://everipedia.org/wiki/lang_en/Higgs_boson) da física de partículas, que dá massa às partículas. De modo semelhante ao campo de Higgs, o relógio poderia interagir com a matéria e potencialmente modificar fenômenos físicos.\n\n#Relógio universal fundamental\n\nÉ claro que os físicos ainda não entendem - e nem tentam explicar - a natureza do tempo, e o que dá corda nesse relógio intrínseco do Universo parece ainda mais misterioso, mas o trio acredita que pensar nesse relógio fundamental pode ajudar a resolver o enigma do tempo.\n\nEmbora 10^-33 segundo seja uma fração de tempo largamente fora do alcance dos mais precisos relógios atômicos, os físicos acreditam que essas maravilhas da precisão possam ajudar a testar sua teoria de um tempo pulsando naturalmente na estrutura do Universo.\n\nEm seu modelo, eles consideram dois osciladores, que agem como pêndulos quânticos, oscilando em taxas diferentes. O oscilador mais rápido representa o relógio universal fundamental, e o mais lento representa um sistema mensurável em laboratório, como o átomo de um relógio atômico.\n\nQuando os dois osciladores são postos para interagir, a natureza dessa relação é diferente do que acontece com os osciladores clássicos, que são acoplados por uma força comum. Em vez disso, o acoplamento é imposto pela necessidade de que a energia líquida dos dois osciladores permaneça constante no tempo - uma condição derivada diretamente da relatividade geral.\n\nOs cálculos indicam que essa interação faz com que os dois osciladores lentamente percam a sincronia. Essa dessincronização significa que torna-se impossível para qualquer relógio físico manter indefinidamente tiquetaques de um período constante, o que impõe um limite fundamental à precisão de qualquer relógio.\n\nComo resultado, os tiquetaques de dois relógios atômicos idênticos, por exemplo, nunca vão coincidir com exatidão total se puderem ser observados com a precisão suficiente. É aqui que entra o tal limite de 10^-33 segundo, que seria a precisão absoluta, na qual o tempo seria desmascarado, revelando sua verdadeira personalidade - o fato de que, assim como tudo o mais no reino quântico, ele não é contínuo, mas discreto, formado de unidades mínimas irredutíveis.\n\n#Testar o atraso do relógio\n\nVai demorar para testar essa teoria, porque 10^-33 é um intervalo pelo menos 10^15 vezes menor do que o que pode ser medido pelos mais precisos relógios atômicos, e mesmo 10^10 vezes menor do que o [tempo de Planck](https://everipedia.org/wiki/lang_en/Planck_time), a atual proposta para menor unidade mensurável de tempo.\n\nMas não é para desistir. Ocorre que medir a diferença de sincronização entre dois osciladores é algo que não exige que se chegue ao limite da unidade fundamental do tempo, podendo ser feito em tiquetaques muito maiores.\n\nIsso está entusiasmando os físicos porque essa possibilidade de aferição traz o tempo, pela primeira vez, para a bancada de laboratório, permitindo discuti-lo em termos experimentais, e não mais apenas filosóficos.\n\n#Artigo: [Physical Implications of a Fundamental Period of Time](https://ipfs.infura.io/ipfs/QmNY3RRP6tqSTkoLUeZUP9jurjFMp1ikrNRVyU1LhAC3yB)\n\n- Fonte: https://web.archive.org/web/20200810160654/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=universo-tem-relogio-fundamental-batendo-peito&id=010130200707",
				"added": 1599620076
			}
		]
	},
	"comment_vote": {}
}