{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1587491923,
			"title": "Pomocy! Nie moge nic zamiescic na 'Tablice'",
			"body": "File write error: Forbidden, you can only modify your own files\n\nCzarna magia dlaczego nagle zeronet takie rzeczy mi sadzi... moze glicz i moze tylko u mnie a moze.....",
			"added": 1587491922
		}
	],
	"topic_vote": {
		"1585331079_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1587477797_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": 1,
		"1587221962_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"1587982879_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1
	},
	"next_comment_id": 19,
	"comment": {
		"1585331079_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": [
			{
				"comment_id": 1,
				"body": "> [ey2xjpdx](#comment_38_1At298vUijuhjA2GtqXEydC8csRnhETzdH): Sytuacja jaką mamy teraz w kraju skłoniła mnie do zastanowienia  się nad tym co by było gdyby naszym włodarzom przyszło nagle do głowy by ograniczyć internet i komórki.[...]Urządzenia najbliższych sąsiadów przez ścianę (najczęściej) się \"widzą\". [...]\n\nTak! Jest iskra nadziei ze nie zdechniemy marnie. Kombinowac. Ludzie niektorzy maja mentalnosc zeby klamac i oszukiwac zeby wyjsc na swoje, przeciw 'sasiadowi'. Ta mentalnosc nalezy zastosowac teraz, ale dla 'sasiada' zeby kolektywnie ratowac swoje dupsko. /ka.",
				"added": 1587462622
			},
			{
				"comment_id": 2,
				"body": "> [ejkej](#comment_5_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs): Hej, zero net działa w momencie kiedy nie masz neta. Jeśli twój komputer coś seeduje to inny z sieci też ma do tego dostęp. Najlepszym rozwiązaniem jest postawić jakiś punkt dostępowy. znalazłem takie urządzenie za niecałe 200 zł z zasięgiem 5km na allegro. Zamierzam robić testy. Jeśli znajdziesz rozwiązanie jak wykorzystać domowe karty wifi i routery to daj znać.\n\nSuper. Jedyne co moze stac na przeszkodzie laczeniu to wbudowana niekompatybilnosc sprzetu do dzialania w sieci poza kontrola rzdu i korporacji. Technicznie nie ma absolutnie zadnego ograniczenia tak jak nie ma go w Walky Talky.",
				"added": 1587476684
			},
			{
				"comment_id": 3,
				"body": "> [xenovich](#comment_2_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2): Super. Jedyne co moze stac na przeszkodzie laczeniu to wbudowana niekompatybilnosc sprzetu do dzialania w sieci poza kontrola rzdu i korporacji. Technicznie nie ma absolutnie zadnego ograniczenia tak jak nie ma go w Walky Talky.\n\nPytanie: Jezeli Laptop moze polaczyc sie karta sieciowa z routerem wifi to dlaczego nie moglby z drugim laptopem bezposrednio? A bluetooth? To specjalna technologia podobno, ale... no wlasnie.",
				"added": 1587476862
			},
			{
				"comment_id": 6,
				"body": "> [kapec](#comment_6_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Ubiquiti Bullet M\n\n'Aromat' tych rzeczy jest swietny. Kawal dobrej roboty, dzieki!\n\nTP-Link TL-WR842ND takie rzeczy walaly sie pod szafkami w domach 5 lat temu. To na smietnikach juz czeka na nas na swoja druga szanse.",
				"added": 1587499000
			},
			{
				"comment_id": 9,
				"body": "Jest jeszcze jedna rzecz, ktora pewnie na tym etapie w ogole was nie obchodzi, ale juz o niej wspomne. Jest potwierdzone naukowo ze fale elektromagnetyczne moga byc bardzo szkodliwe dal ludzi. Wydawaloby sie ze mamy w takim razie jedynie dwa wybory: albo dopuszczamy wysylanie fal WiFi i tolerujemy jakis poziom toksycznosci albo ograniczamy komunikacje tylko przez kabel.\n\nAle jest byc moze jeszcze jedna opcja. Ktos kto pracowal rzekomo z ekspertami twierdzil ze ich zdaniem korporacje moga stworzyc technologie komunikacji radiowej ktora jest zdrowsza dla ludzi tylko tego nie robia. Byc moze po raz pierwszy technologia radioelektroniczna bedzie w rekach niezaleznych inzynierow i technikow.",
				"added": 1587549894
			},
			{
				"comment_id": 10,
				"body": "> [ejkej](#comment_8_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs): Słuszna uwaga, może w takim wypadku sieci oparte na gniazdkach z prądem?\n\nOczywiscie ze tak! Na moment wylecialo mi z glowy ze one sa. Adaptery sieciowe do sieci elektrycznej nie sa najtansze ale nie bardzo drogie. Tych rozwiazan technicznych na zakladanie sieci jest tak wiele ze brak pozorny mozliwosci tworzenia niezaleznego internetu wydaje sie paralizujaco absurdalny. Jak kolega wykazal swoimi znaleziskami programowymi do routerow rozwiazania istnieja. Ale ze 99% ludzi ma to w dupie i zajmuje sie glupotami na facebooku i youtube to pozornie jakby sprawa byla niemozliwa. To jest klasyczny przyklad jak zjebanym systemem politycznym jest demokracja. Jest po prostu totalnie niemozliwe osiagnac cokolwiek zaawansowanego na wieksza skale w takim systemie spoleczno politycznym. \n\nDo tej pory wszyscy polacy ktorzy wynajdowali cos genialnego byli okradani przez zagraniczny wywiad a ich marny los zadeptywany pod ziemie. A reszta biega jak debile do Carrefour czy jak tam te kretynskie zydowsko-banksterskie markeciorstwa sie nazywaja. A zachodnia europa to wylegarnia tego ochydnego systemu.\n\nI dlatego pewnie zaden normalny czlowiek kiedy juz wychodzi z tej plantacji juz nigdy nie chce do tego wrocic. Mysle ze to jestesmy my.",
				"added": 1587553309
			},
			{
				"comment_id": 17,
				"body": "To dobry omen.",
				"added": 1596409075
			}
		],
		"1587477797_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": [
			{
				"comment_id": 4,
				"body": "tez spierdolilem z fb. nigdy mi nie dali dotrzec do nikogo filtrujac mnie.\n\ntrzeba promowac jakkolwiek i na kazdy sposob. oni robia jakis 'rytual' ze dla ludzi zn jakby niemozliwy lub niewidzialny. energetycznie blokuja mam wrazenie. Promowac musimy jak sie da ale moze musimy robic 'Transfering' rowniez? N aszybko tlumacze to cos jak zamowienie w swojej woli pewnych zmian w rzeczywistosci. I to nie jest pierdolenie tylko powazna sprawdzona sprawa. Tak jak kroniki akaszy sa sprawdzone. Tylko wyprane mozgi moga uwazac ze to nie istnieje.\n\nJa takie materialy bede robil tylko zaraz jak przetestuje.",
				"added": 1587491787
			},
			{
				"comment_id": 11,
				"body": "Widzialem ze z siedmiu polubien przeszlo juz na ponad dwadziescia. Mam nadzieje ze tez przyczynie sie do stworzenia zainteresowania dla nowych. Moze zamieszcze jakies filmy instruktarzowe po polsku dla zupelnie nowych w zeronet zeby ulatwic im start i zadomowienie sie.",
				"added": 1587842718
			},
			{
				"comment_id": 12,
				"body": "> [mneomonic](#comment_4_1MGFBAHFakQXiAhMFjmWxob7rdAcKraPwP): Ja jestem grafikiem. Chętnie przygotuje grafiki, tylko muszę mieć treści. Dawajcie pomysły ja będę opracowywać i jedziemy ;)\n\nSiema. Witam goraco! Ja wlasnie siedze przy narzedziach do wideo na zeronet wiec jeszcze nie moge sie dolaczyc. Wydaje mi sie potrzeba przygotowac technicznie platformy polskie na zeronet. To co jest chyba nie pokazuje pelnego rozmachu zeronet.",
				"added": 1588174910
			},
			{
				"comment_id": 13,
				"body": "Koledzy inni nasi zamieszczali linki do serwerow proxy na duzych portalach spolecznosciowychj i odkryli ze wszystko co jest zwiazane z zeronet itp wszystkie linki sa filtrowane. Oni sa na to wrazliwi. Moze nalezy linki dawac w grafikach zeby boty mialy problem z indentyfikacja?",
				"added": 1588175680
			}
		],
		"1587491923_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2": [
			{
				"comment_id": 5,
				"body": "jezeli tam grafiki moje niedostepne to tu link do podobnych o kablach sieci wlasnej\n\nhttps://www.google.com/search?q=crossover+lan+cable&client=firefox-b-ab&source=lnms&tbm=isch&sa=X&ved=2ahUKEwiv8a3L7fnoAhU8QxUIHY_vDFwQ_AUoAXoECBUQAw&biw=1024&bih=472#imgrc=7uS3qliTioCKXM",
				"added": 1587492023
			},
			{
				"comment_id": 7,
				"body": "driud: A co to ma wspólnego, z wejściem do sieci internetowej?\n\nChodzi o polaczenie komputerow i podobnych miedzy soba w sieci lokalnej na wymiar osiedla czy blokowiska. Taki kabel pozwala ,rzekomo, na bezposrednia komunikacje komputerow bez routera przez to **ze zyly kabla sa ze soba pozamieniane nie standardowo**. Poniewaz docelowo to ma byc radiowe i laczyc wiele komputerow et. al. to moglby byc w najlepszym wypadku poczatek budowy systemu.\n\nPrzeczuwam, ze informacje [z posta uzytkownika 'kapec'](http://127.0.0.1:43110/1GRYnz73jSXoMMZNU3nSmbCFA3twuitcoo/?Topic:1585331079_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF/Sie+meshowa+LibreMesh#comment_6_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF) gdzie te wszystkie kwiestie zostaly juz rozwiazane. \n\nZgaduje rowniez ze firmware i elektronika routera sieci domowej pozwala mu na przelaczanie 'pinow' kabli na wiele kombinacji lub ze ten problem jest rozwiazywany programowo w komputerze itd. \n\nJest to skrajnie ciekawe.",
				"added": 1587549181
			},
			{
				"comment_id": 8,
				"body": "Czy moje posty na tablicach otwieraja dla was zdjecia dodane do posta?",
				"added": 1587549388
			}
		],
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 14,
				"body": "Mam wrazenie ze te stwierdzenia to jest belkot. Nie zdziwilbym sie gdyby to byla czyjas zoorganizowana akcja obrzydzania ZeroNet. Jest wiele powodow ktore moga bardzo pogarszac dzialanie zeronet szczegolnie kiedy nie ma bardzo wielu seederow. Odczulem osobiscie ogromna roznice dzialania zeronet kiedy operowalem z innych systemow operacyjnych.\n\nNie musimy tworzyc teori spiskowej o tym jak w kodzie jawyskrypt zeronet sa backdoory wpuszczone przez tworce zeronet 'nofish'. Moze jest agentem i klamie od poczatku, a moze jest naprawde tak jak mowi i niczego swiadomie nierobi zeby nas tu sabotazowac. \n\nJest tyle innych mozliwosci gdzie 'sluzby' moga zaklucac i bruzdzic nam nasza komunikacje i wiele z nich znajduje sie w naszych systemach operacyjnych i microchipach Intel. Tam to dopiero mozna siac zamet i bruzdzic! Nie ma takiej sekwencji bitow wysylanych i otrzymywanych z jednego komputera do drugiego ktorej nie moga nam wjebac. Jakies ograniczenia oczywiscie sa szczegolnie kiedy chcieliby zeby ciezko bylo sie polapac. \n\nJa na ich miejscu pierwsze co bym robil to uszkadzal pliki zn uzytkownikow odpowiedzialne za synchronizacje zeby ludzie mieli ciagle problemy z sciaganiem i seedowaniem. Frustracja, spadajace morale i obwinianie nofish o agenture. Dla sluzb to po prostu cos cudownego!\n\nJest coraz wiecej osob ktore grzebia w kodzie stron ZN i coraz ciezej bedzie ukrywac co sie dzieje.",
				"added": 1588240751
			}
		],
		"1587982879_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 15,
				"body": "> [mneomonic](#comment_3_1MGFBAHFakQXiAhMFjmWxob7rdAcKraPwP): No super pomysł!\n\nTworca przerabia strone i z tego co wiem robi ja w HTML a nie jak wiekszosc Zerosites w JavaScript. To jest bardzo ciekawy rozwoj zeronet i pokazuje ze prawie nie ma tu ograniczen. Czas nadchodzi kiedy my bedziemy zakladac tu powazne polskie podziemne media.",
				"added": 1588241308
			}
		],
		"1592306794_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 16,
				"body": "> [glosrozsadku](#comment_1_15UPxFMtZojHw5JYJs9JQQ11kNa8Xn7YB4): \n\nOstatnie zdania 3 i 4 akapitu to brutalna komedia. XD",
				"added": 1593455084
			}
		],
		"1610225804_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 18,
				"body": "NIe ma już Instagramu ZeroMe. Mało ciekawego tam było dlatego go  nie seedowałem. Z zeroneta ginie to co ludzie zostawili na pastwę losu. Ale to też i dobrze bo znika stąd badziewie.",
				"added": 1611921940
			}
		]
	},
	"comment_vote": {
		"6_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"23_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1
	}
}