{
	"next_post_id": 32,
	"next_comment_id": 34,
	"next_follow_id": 25,
	"avatar": "png",
	"user_name": "ZeroLSTN",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "Music streaming for all!\n\n[ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit)\n[ZeroLSTN.Talk](http://127.0.0.1:43110/Talk.ZeroLSTN.bit)\n\nSource Code:\n\n[GitCenter](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/??1Code5125iycoEFCMi9a4XVejFwauoyGqj)\n\n---\n[ZeroMail](http://127.0.0.1:43110/mail.zeronetwork.bit/?to=zerolstn)\n\n---\nMobile Accounts:\n\n[zerolstnmobile@zeroid.bit](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1EmrB8xSDYobVFSc3Kad1vx1EPaPR2myCW/zerolstnmobile@zeroid.bit)\n\n[zerolstnmobile2@zeroid.bit](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1AVEBziQwUaHK8J6gdiDsAjaA8vvye91L1/zerolstnmobile2@zeroid.bit)",
	"post": [
		{
			"post_id": 1515489900,
			"body": "[ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit) v1.0.0 released!",
			"date_added": 1515489898,
			"meta": "{\"img\":\"900,305,6be7be8ce,000000000001012012200000000000\"}"
		},
		{
			"post_id": 1515791146,
			"body": "[ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit) v1.0.2 released!\n\n* Queue an entire album/artist at once\n* Download an entire album/artist at once\n* Download individual songs without playing them\n* Artists/albums now have a set URL, which you can link to\n* New icons\n\nDownloading of full albums/artists currently shows no progress other than the ZeroNet progress bar and thus is kind of misleading, but I am working on showing live download progress per-song, which should make the downloading experience better :)",
			"date_added": 1515791143
		},
		{
			"post_id": 1516702373,
			"body": "[ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit) v1.0.8 released!\n\n* Remove 'Songs' tab from the main page due to heavy processing.\n* Small UI fixes.\n\nWith the recent influx of new songs, it's become apparent that the homepage is in desperate need of some pagination/lazy-loading abilities. The biggest resource hog was definitely the songs tab, especially if you have many genres downloaded. I've removed that for now for performance reasons.\n\nFret not, adding searching capabilities is next up on the TODO list. I plan to have the default be a global artist/album/song search, while also being able to select what you're searching for (artist/album/...) as well.\n\nThere is also now an official ZeroLSTN Forum: [ZeroLSTN.Talk](http://127.0.0.1:43110/Talk.ZeroLSTN.bit)! Huge thanks to balancer73 for the initial idea. I had to clone the site as I plan to change up the styling a bit, but if you want to be a moderator (if that's possible), just ask :)\n\n[ZeroLSTN.Talk](http://127.0.0.1:43110/Talk.ZeroLSTN.bit) will be *the* place for ZeroLSTN updates, news and discussion. It's also the place to propose your genres for addition to the Recommended Genres list, as well as just discussion on songs, albums, the site in general, etc.\n\nSo come on in and join in the fun!",
			"date_added": 1516702369
		},
		{
			"post_id": 1516961560,
			"body": "# Introducing ZeroLSTN Dev Notes!\n\n[ZeroLSTN Dev Notes](http://127.0.0.1:43110/Notes.ZeroLSTN.bit) is a new blog for various developer posts related to ZeroLSTN development as well as general tips and guides for new ZeroNet site developers to start creating their own Zites!\n\nI plan to add more posts about general zite development, in order to make things more accessible to the masses. There will also be tips and tricks for the experienced zite developers, as well as detailed guides for developing with more complex features such as Merger zites.\n\nThe first post is a general overview of how ZeroLSTN works under the hood. I hope it will be useful to others to explain ZeroLSTN's architecture, and I plan to update it as the zite grows and changes fundamentally over time.\n\nI'm excited for any feedback. Let me know what you think!",
			"date_added": 1516961555
		},
		{
			"post_id": 1517188960,
			"body": "I plan on refactoring ZeroLSTN to use webpack instead of browserify so that it can generate multiple JS bundles for each page rather than one massive one for the whole site.\n\nDoes anyone have any immediate ideas on why that would be a bad idea before I start? As far as I can see it'll be a net positive, but will take a few hours.\n\nI also plan to add some linting in the build process so we don't have a mix of tabs and spaces everywhere.",
			"date_added": 1517188954
		},
		{
			"post_id": 1517533632,
			"body": "Work has currently got me tied up at the moment, but I'm itching to get back on to ZeroLSTN dev, especially since I have searching nearly finished.\n\nI'll keep you guys posted.",
			"date_added": 1517533625
		},
		{
			"post_id": 1517875870,
			"body": "## Here comes the Search!\n\n* Search has been added. Access it through \"Search\" at the top of the page, or in the sidebar on mobile.\n* Fixed the tab lengths on Homepage. Didn't notice that til now, whoopsie!\n* Clean up up code indentation. It was horrible, my IDE was lying to me.\n* Added Christian genre to recommended list.\n\n## Why a new minor version?\n\nThe reason I'm bumping the version to v1.1.0 is because I feel Search was the last missing feature to make the site *usable*. Sure there's still a lot of things to add and fix up, but I'm starting to get the feeling I could use ZeroLSTN as my main music player (and just let ZeroNet deal with the hosting ;)\n\n## Future\n\nI'm still buried in work and school, but hopefully I'll be getting more time soon. Implementing Search today took 1hr30m, if you want to get an insight into how much time I really don't have.\n\nThe next major features will be batch uploading (I'm holding back on uploading my own personal library until this is implemented) and wiki-style metadata editing. There will be edit history, and no diffing. While history diffing would be a major space advancement (and implementation headache) for sites like Kiwipedia, song metadata is comparatively light compared to entire Wikipedia pages, therefore I don't think the extra overhead of processing diffs will provide that much benefit over any minor space savings.\n\nAnyways, hope you guys enjoy [ZeroLSTN v1.1.0](http://127.0.0.1:43110/ZeroLSTN.bit/) and let me know of any comments/concerns!\n\nAnd don't forget to join us over at [ZeroLSTN.Talk](http://127.0.0.1:43110/Talk.ZeroLSTN.bit/?Home) for music discussions and meta-talk!",
			"date_added": 1517875862
		},
		{
			"post_id": 1518223478,
			"body": "ZeroLSTN wiki-style metadata editing has been spec'd out. Should help clean up the data a little bit. Only need to implement it now. Should have time this weekend.",
			"date_added": 1518223469
		},
		{
			"post_id": 1518423898,
			"body": "# ZeroLSTN Planned Database Redesign\n\nThis whole weekend I've been working on trying to figure out how to implement wiki-style song metadata updating, aka **Community Song Management**. Going forward, as more and more music is added to the site, it's going to become a necessary feature in ensuring the the overall library is kept clean and organized.\n\nThis weekend, after going through nearly 10 different iterations of implementations, I've come to the conclusion that we're going to need to recreate the merger database with some slight tweaks, specifically the way songs are stored.\n\nDue to how songs are stored currently, it's not feasible to be able to implement a wiki-style system on top. The current system assigns an ID to each song consisting of the current unix timestamp of when it was uploaded. Initially, I wanted to create a new \"update\" object which would reference a song's ID and provide new information, which the site would then show instead.\n\nUnfortunately, upon spending time implementing this and then trying to query it, the queries quickly got out of hand. For each query for song information, the site had to account for songs that did have updates, and those that didn't, requiring multiple queries for each. This resulted in inefficient table lookups. And, this was of course is all made worse by the fact that the way existing song data is stored cannot be changed *by design*, as it's all signed with each respective user's private key, on merger sites which are controlled by the community that no one entity holds the keys to.\n\nSeveral further implementations were tried around until I finally decided the simplest method would be to store the songs in an array in each user's data.json, give each one an ID, and if two song's IDs match, just show the one with the most recent `date_added` value.\n\nThe idea is that an update is just a new 'song', with the same ID attribute as the original. These can then be grouped together and queried very easily.\n\nAlthough, one attack against this is someone could simply change their `date_added` value as the maximum value allowed for that data type, therefore always being the latest edit. I'm not quite sure how to resolve that one just yet. Am open to thoughts there.\n\nAdditionally, if there are multiple copies of the same song with different IDs, then they'll both show up, and while we can edit one or the other, we can't delete one of them. Perhaps we could have an update which simply marks the song as deleted. Thoughts on how duplicate songs would be worked around are appreciated.\n\nSo that's the songs update, and while we're redesigning things, I've decided to change the way the merger sites are grouped too. Genres was a good initial idea, but in practice it's often difficult to assign a single genre to a song that may be a mix of many different ones, or a song that changes course halfway through.\n\nI originally planned on being able to assign multiple genres to a song, with the \"main\" genre being where the song file is actually stored, but if one is uploading a mix of different songs, thinking about which genre is the \"main\" genre is quite confusing...\n\nInstead, I propose merger sites by grouped by **Year** instead. Years are unambiguous, even for mixes, where their year would be the time at which the mix is produced. We could either have one merger site per year, or one per a range of years, say 5. One per year may be better as we break the data up as much as possible, which will be especially important as more and more songs are uploaded.\n\nAll of the above changes come with a small cost, however, and that is deprecating the old, current databases and starting the entire library from scratch. I'd like to thank everyone who has uploaded music thus far, and assure you that it has been very useful in getting the initial foundation of the site off the ground. For the new databases, I plan to have a native batch uploading tool so that people can simply 'dump' their libraries and get the new databases populated very quickly.\n\nOnce it is implemented, ZeroLSTN will switch over to v2.0.0. I'm very excited to see how it will all look once released, and for the future of the site in general. Thoughts and feedback in the comments on the new design are very welcome, and I look forward to hearing everyone's thoughts. Thanks for following along!\n\n**TL;DR:** ZeroLSTN's merger sites are being redesigned, meaning all music will need to be reuploaded. Should be quick with the ability to batch upload. Songs will no longer be grouped by Genre, but by Year which should be a lot less confusing. We'll also have Community Song Management, allowing anyone to edit any song. I have an initial design for how to do that, but it still has some problems and I'd appreciate any feedback or ideas you might have :)",
			"date_added": 1518423888
		},
		{
			"post_id": 1518427337,
			"body": "@Git Center: Sent you a ZeroMail.",
			"date_added": 1518427326
		},
		{
			"post_id": 1518473879,
			"body": "# [ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit) v1.1.1 released!\n\nThis version fixes an XSS vuln discovered by @beardog108 where artist names including `<script>` tags could execute arbitrary JS. This was due to them being parsed as HTML, as I added `<i>` tags for the *Blank* artists.\n\nWe now no longer parse them as HTML, instead checking whether the artist name is blank externally and then using Vue directives to wrap artist names in `<i>` tags or not.\n\nThanks to @beardog108 for finding and responsibly reporting!",
			"date_added": 1518473867
		},
		{
			"post_id": 1519377340,
			"body": "Batch uploading with ID3 tag scraping works now. Coming in v2.",
			"date_added": 1519377327,
			"meta": "{\"img\":\"900,448,46779a89a8aa578888dddeeefff777788367346,0122333324567777886556887788659AAAAAAAA9BBBBCCBBBB\"}"
		},
		{
			"post_id": 1521531327,
			"body": "Got a good amount of work in on ZeroLSTN tonight. You can check out progress on the `wiki_style_editing` branch on [ZeroLSTN/ZeroLSTN](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/log/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/@wiki_style_editing).",
			"date_added": 1521531313
		},
		{
			"post_id": 1523624390,
			"body": "ZeroLSTN v2 is now in closed beta! Everything's looking really good. I hope to release it in the next few days once all the little quirks are worked out.\n\nThanks for being so patient!",
			"date_added": 1523624374
		},
		{
			"post_id": 1524810488,
			"body": "# Status Update\n\nSo release has got a little hung up on getting uploading of a mass amount of songs. I want 5000+ song uploads to work flawlessly, and thus am doing some testing and iteration until it does.\n\nI'm not entirely sure if the BigFiles plugin is designed to handle a massive amount of file uploads. The problem seems to be RAM usage. So far I've found that in Firefox the RAM usage spikes tremendously with a large amount of songs (10GB+) with the ZeroNet process being fine, while in Chrome browser RAM stays in the couple GB range, whereas the ZeroNet process hits ~5GB RAM and then crashes.\n\nI've reworked the uploading system to be done in batches which has been promising. I'm also going to be switching it to use Web Workers so that it won't take up the UI thread while songs are being processed.\n\nOtherwise the rest of the site is looking great. Many new features and quite a few bug fixes. The changelog is going to be pretty big so watch out for that.\n\nIt's so close I can taste it, and I can't wait to see what you guys think of it.",
			"date_added": 1524810471
		},
		{
			"post_id": 1528065018,
			"body": "# [ZeroLSTN](http://127.0.0.1:43110/zerolstn.bit) v2.0.0 is out!\n\nAfter many months in development. Hopefully its worth the weight.\n\nCheck it out: http://127.0.0.1:43110/zerolstn.bit\n\nFull changelog: http://127.0.0.1:43110/Talk.ZeroLSTN.bit/?Topic:1528064546_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj/Release+v2+0+0\n\n(And don't forget to try out the new dark theme!)",
			"date_added": 1528065000
		},
		{
			"post_id": 1528071004,
			"body": "@GitCenter is it possible to close issues made by others that might've disappeared?",
			"date_added": 1528070985
		},
		{
			"post_id": 1528108761,
			"body": "@Lola: I checked out mixtape.bit. Looks cool! We should chat about how to integrate ZeroLSTN's new playlist feature with it.\n\nAlso 'ZeroLSTN' is misspelled on the bottom link :P",
			"date_added": 1528108741
		},
		{
			"post_id": 1528154078,
			"body": "@Krixano do you have immediate insight on this: http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/14@16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj ?",
			"date_added": 1528154057
		},
		{
			"post_id": 1528500799,
			"body": "# v2.0.1 Release!\n\nSome minor fixes after the big [v2.0.0 release](http://127.0.0.1:43110/Talk.ZeroLSTN.bit/?Topic:1528064546_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj/Release+v2+0+0). Mostly bug fixes, but a new feature:\n\n**Features:**\n\n* Song timeouts. if a song is taking too long to load (or has zero peers), we now just skip to the next song in the queue and pop up a toast informing the user what happened.\n\n**Bug Fixes:**\n\n* Numerous fixes with song filenames. We now replace any special or accented characters that didn't play to well with ZeroNet. If you uploaded a song and had '? seeds' on it, this was probably why. Upload a new version and merge the old song into the new one to get things working again.\n* Don't show song edits on the uploads page.\n* Fixed song/album download. Artist download still in the works.\n* Fixed a bug where adding songs to a playlist would add many copies on those songs (turns out it was just in the display code, the proper amount got added in the DB).\n* Fixed a bug where the \"+ Upload more songs button\" would actually replace all the songs you were about to upload instead of adding to them. Whoops :)\n\nAs always, thanks to everyone for suggesting new features and reporting bugs on the [Issues page](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1Code5125iycoEFCMi9a4XVejFwauoyGqj).",
			"date_added": 1528500777
		},
		{
			"post_id": 1528573038,
			"body": "# v2.0.2 Release!\n\nAka the \"I had free time today\" release!\n\n**Features:**\n\n* 你好! Hola! Здравствуйте! Translations are here! If you're able to translate ZeroLSTN into any language other than English, than please do so using [the instructions](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/file/?1Code5125iycoEFCMi9a4XVejFwauoyGqj/docs/translations.md@master).\n* Your volume setting now remains even after closing and reopening ZeroLSTN.\n* Artist/Album names in song cells are now links to their respective Artist/Album pages.\n* The song title and artist name are now shown in ZeroLSTN's tab when they're playing. \n\n**Changes:**\n\n* Only show a song's year if it actually has one\n* Move the logo.png file into the img/ directory\n* Make the search field auto-focus when you visit the Search page\n\n**Bug Fixes:**\n\n* Trim song tags before uploading. This was causing some duplicate artists and such even though they looked the same. Turns out one had spaces and the other did not.\n* Fixed a bug with the progress slider breaking if you changed the song time before playing your first song.\n* Fixed songs sometimes not looping correctly.\n* Fixed being able to view songs by Blank artists.\n\nAs always, thanks to everyone for suggesting new features and reporting bugs on the [issues page](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1Code5125iycoEFCMi9a4XVejFwauoyGqj).",
			"date_added": 1528573015
		},
		{
			"post_id": 1528639847,
			"body": "We could really use an image hosting site.",
			"date_added": 1528639823,
			"meta": "{\"img\":\"\"}"
		},
		{
			"post_id": 1530886538,
			"body": "Hey everyone. I've been busy the last few weeks, but should have some time again this weekend to keep improving things over on [ZeroLSTN](http://127.0.0.1:43110/zerolstn.bit). Thanks to everyone who [submitted bugs](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1Code5125iycoEFCMi9a4XVejFwauoyGqj) in the meantime!",
			"date_added": 1530886512
		},
		{
			"post_id": 1538518163,
			"body": "riot.im device verification: \n\nbrzK jTJL Wimj EKlq TCGe T617 lJiJ 8LyD cqBK wGhS PF0\n\n/w9y P4Y+ V4gi bzcR O3lH jpOE YTzg eWOS UhWI J36/ Wxw",
			"date_added": 1538518136
		},
		{
			"post_id": 1539808910,
			"body": "Check out [KxoVid](http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/)! A new streaming site by Krixano!",
			"date_added": 1539808881,
			"meta": "{\"img\":\"900,473,7ac8adcdedde9bdeeefffdddccc,01123211145665575555566577775556678888566657755555\"}"
		},
		{
			"post_id": 1539879163,
			"body": "KxoVid on mobile in Firefox dev tools",
			"date_added": 1539879133,
			"meta": "{\"img\":\"442,700,7ad69da77a56b555446565439ab566666333677000222,000100233344566775589ABB5CBDDEEEEEEEEEEEEEB5EEEEEEEEEEBEEEEE\"}"
		},
		{
			"post_id": 1540051619,
			"body": "# PoC and detailed explanation of \"The Vacation\" attack is ready.\n\nDetailed info and POC of the \"Vacation\" sandbox escape bug that was discovered by GitCenter / Krixano / ZeroLSTN 3 weeks ago (fixed in Rev3616+): [**The Vacation** Vurnerability list](/1HcLPSR5ss1ehsqP8kU2Sa2TJyDVcGADTp).\n\nGet it at [ZeroTalk](/Talk.ZeroNetwork.bit/?Topic:1540051200_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/PoC+and+detailed+explanation).",
			"date_added": 1540051588,
			"meta": "{\"img\":\"875,700,43c54c65c66d76d88d87dddedceeeedddfffccc,0012221100334555643377778877779AA999999BB99999999B9AAAAAAAAB9AACACAAAB9AAAAAA99B\"}"
		}
	],
	"post_like": {
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517712727": 1517816233,
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1518039056": 1518039710,
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1518055978": 1518223497,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1518233777": 1518249271,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1518394750": 1518416861,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1519145389": 1519258584,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1519446063": 1519455842,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1519802922": 1519806264,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1522947326": 1522960589,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1524710530": 1524809888,
		"14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy_1528124426": 1528154072,
		"1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1530527730": 1530886414,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1532304119": 1532358154,
		"16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1539808910": 1539809127
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@styromaniac@zeroid.bit: @Kaffie: Thanks all, right now I'm trying to focus on user experience (knowing when a song has seeders, knowing which ones you've already downloaded, being able to seed an entire artist/album at a time, explaining the genre/merger site concept to people) and features that would be important to get out early before there are too many songs (sorting, searching, there is [already](https://github.com/anoadragon453/ZeroLSTN/blob/master/src/vue_components/footer_bar.vue#L15) some [code](https://github.com/anoadragon453/ZeroLSTN/blob/master/src/router_pages/edit.vue#L21) for album art in the site but it wasn't ready for release due to some UI hangups).\n\nWatch out for those features in the near future!",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1515489900",
			"date_added": 1515601937
		},
		{
			"comment_id": 2,
			"body": "Err, and playlists, since some people seem to think genres are playlists for some reason...",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1515489900",
			"date_added": 1515602882
		},
		{
			"comment_id": 3,
			"body": "See if the favicon works for you now @Krixano:, I've made it a PNG instead.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1515489900",
			"date_added": 1515623398
		},
		{
			"comment_id": 4,
			"body": "@Ssdifnskdjfnsdjk: Sure yeah, you've been great. Added.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1516702373",
			"date_added": 1516784434
		},
		{
			"comment_id": 5,
			"body": "@Jamesholden: I'm starting to see that as well with the songs from 'Imported From ZeroMusic'. It seems they have a seed, but either we are not able to connect to them or the client has some issue with requesting songs from them. I'm not entirely sure what the issue is, but if ZeroNet reports 1 seeds and is unable to connect to them for download, it may be out of my hands. I'll try to get to the bottom of it though.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1516702373",
			"date_added": 1516784517
		},
		{
			"comment_id": 6,
			"body": "Strange. That's the Electronic genre, correct? Unfortunately I don't have the keys to it so I can't sign/publish, but I'll try publishing from my computer and see if your daemon picks it up :D",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1516707105",
			"date_added": 1516787760
		},
		{
			"comment_id": 7,
			"body": "Should edit and wrap in \\``` tags. Or better yet, post to [NullPaste](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/) and post link here instead.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1517190383",
			"date_added": 1517190065
		},
		{
			"comment_id": 8,
			"body": "@styromaniac@zeroid.bit: Hrm, well here's a link with your crash details anyways: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_0",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1517190383",
			"date_added": 1517190554
		},
		{
			"comment_id": 9,
			"body": "Just saw Kiwipedia is using this method. Looks like I'll go ahead and set it up myself :)",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1517188960",
			"date_added": 1517193603
		},
		{
			"comment_id": 10,
			"body": "We lack a JS implementation that @mkg20001 is working on here: https://github.com/ZeroNetJS/zeronet-js\n\nGive him/it some love and maybe we can be in future release notes :)",
			"post_uri": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h_1517124330",
			"date_added": 1517193671
		},
		{
			"comment_id": 11,
			"body": "They just added a nice WYSIWYG editor to the UI: [ckeditor](https://en.wikipedia.org/wiki/CKEditor).\n\nThey just need to download and save the script and serve it over ZeroNet instead of requesting it on page load. Just a simple developer error.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1518039056",
			"date_added": 1518039848
		},
		{
			"comment_id": 12,
			"body": "Would it be better if songs were grouped by year instead? Say 1980-85, 1986-90, etc.?",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1518290465",
			"date_added": 1518416893
		},
		{
			"comment_id": 13,
			"body": "@Nekololi: I agree the wording may be a bit confusing. The genres you see listed are all the known ones in the index. If you want to *Create* a new genre, that's the button to do so.\n\nTo add an existing one, just click the '+' button in the list next to it.",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1518290465",
			"date_added": 1518476051
		},
		{
			"comment_id": 14,
			"body": "@Nekololi: Ah... I see. Yes, that page appears and is relevant for the person creating the genre, but not those visiting/adding it afterwards.\n\nI have the chance to redesign the merger sites now, so I'll definitely keep in mind not to show arbitrary users that information. Thanks for the letting me know!",
			"post_uri": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1518290465",
			"date_added": 1518493227
		},
		{
			"comment_id": 15,
			"body": "@Git Center: Nope, my inbox is literally empty. Did you send it to zerolstn@zeroid.bit?",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1518427337",
			"date_added": 1518822134
		},
		{
			"comment_id": 16,
			"body": "I'm not getting messages from the echobot either. hrm.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1518427337",
			"date_added": 1518822296
		},
		{
			"comment_id": 17,
			"body": "Should be good soon. Remember this is all initially coming from my laptop :P \n\nSeeing some new songs already!",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528065018",
			"date_added": 1528066866
		},
		{
			"comment_id": 18,
			"body": "@Krixano: Sounds good.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528065018",
			"date_added": 1528067050
		},
		{
			"comment_id": 19,
			"body": "@Krixano: Haven't gotten anything yet. Ping me on here when you send it.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528065018",
			"date_added": 1528069547
		},
		{
			"comment_id": 20,
			"body": "@Krixano: I don't seem to be able to even though other owner-only buttons are showing, such as \"Sign and Publish Changes\". Would be nice to close old bugs that have been long fixed in v2 :P",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528071004",
			"date_added": 1528100816
		},
		{
			"comment_id": 21,
			"body": "@Krixano: Awesome, thanks.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528154078",
			"date_added": 1528192646
		},
		{
			"comment_id": 22,
			"body": "@Polar🍀☘️🌿🌾🌴: Somewhere where anyone can just quickly and easily upload an image and get a direct link to copy it though. I don't want to have to clone a site just to host images.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528639847",
			"date_added": 1528664231
		},
		{
			"comment_id": 23,
			"body": "@Krixano: That sounds like it could work. I may look into making something like that at some point if nobody else wants to try.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528639847",
			"date_added": 1528675425
		},
		{
			"comment_id": 24,
			"body": "@Thunder33345: Perhaps that would be a good use case for the new [BackgroundProcessing](https://github.com/HelloZeroNet/Plugin-BackgroundProcessing) feature?",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1528639847",
			"date_added": 1528701830
		},
		{
			"comment_id": 25,
			"body": "Did you edit the year after the fact? If not, then this is a bug. I'll look into it, thanks!",
			"post_uri": "1Md6YJNZX5yrdSaL9mmrKZNMAfULoXzMX2_1528725339",
			"date_added": 1528913911
		},
		{
			"comment_id": 26,
			"body": "@mp4: Ok, I'll look into this. Also btw the link in your user page on ZeroMe should start with 127.0.0.1:43110, instead it'll likely not work for people.",
			"post_uri": "1Md6YJNZX5yrdSaL9mmrKZNMAfULoXzMX2_1528725339",
			"date_added": 1528969941
		},
		{
			"comment_id": 27,
			"body": "handshake.org anyone?",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536350869",
			"date_added": 1536424090
		},
		{
			"comment_id": 28,
			"body": "@Solens: Hi Solens! Yeah the site is in need of some serious sprucing up. The search *should* be working. I have a feeling that perhaps the songs didn't upload correctly - aka your content.json wasn't signed properly after the new song information was inserted. Did you see a message saying \"Publishing\" after uploading the songs?",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1530886538",
			"date_added": 1536424972
		},
		{
			"comment_id": 29,
			"body": "@Kaffie: It is a blockchain, but not intended to replace DNS, just the root names like .com and so forth, so it may actually not be all that useful now that I think about it :)",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1536350869",
			"date_added": 1536500185
		},
		{
			"comment_id": 30,
			"body": "Port it to ZeroNet ;D",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1538095280",
			"date_added": 1538566745
		},
		{
			"comment_id": 31,
			"body": "@Pubg: Can you post an image? Looks ok in Firefix mobile dev tools: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj/1539879163\n\nOnly issue is the upload video button is hidden.",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1539808910",
			"date_added": 1539879161
		},
		{
			"comment_id": 32,
			"body": "@Pubg: Oh, I don't think that's due to mobile firefox, but just that you're not pulling in the icon fonts. I've relayed the issue to Krixano and it hopefully will get fixed soon. ",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1539808910",
			"date_added": 1539888547
		},
		{
			"comment_id": 33,
			"body": "@Pubg: Does it show any \"MISSING FILES\" in the KxoVid sidebar?",
			"post_uri": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj_1539808910",
			"date_added": 1539888641
		}
	],
	"follow": [
		{
			"follow_id": 2,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1515489717
		},
		{
			"follow_id": 3,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu",
			"user_name": "Krixano",
			"date_added": 1515489726
		},
		{
			"follow_id": 4,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di",
			"user_name": "Git Center",
			"date_added": 1515489732
		},
		{
			"follow_id": 5,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB",
			"user_name": "Missesrobot",
			"date_added": 1515489737
		},
		{
			"follow_id": 6,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE",
			"user_name": "Kopyjane",
			"date_added": 1515489741
		},
		{
			"follow_id": 7,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4",
			"user_name": "Kopykate",
			"date_added": 1515489743
		},
		{
			"follow_id": 8,
			"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
			"auth_address": "1CPaiF2fxihufdKhg9eN76dZGimYk3LZjb",
			"user_name": "Zeroalex",
			"date_added": 1515489748
		},
		{
			"follow_id": 9,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "16ayEL9rXHKdbhoFu1LUanUaPVrzRVe331",
			"user_name": "Andrewm",
			"date_added": 1515489753
		},
		{
			"follow_id": 10,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1LrDWSzi63MhST9ZNkefSPJGFAuByRMeCx",
			"user_name": "Lxpz",
			"date_added": 1516700492
		},
		{
			"follow_id": 11,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "177ia43eQrnWCHCWt1ik6viQGRzWuNXGzD",
			"user_name": "Mkg20001",
			"date_added": 1516700496
		},
		{
			"follow_id": 12,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp",
			"user_name": "FraYoshi",
			"date_added": 1516787491
		},
		{
			"follow_id": 13,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1516833233
		},
		{
			"follow_id": 14,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h",
			"user_name": "Binchan",
			"date_added": 1516833270
		},
		{
			"follow_id": 15,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16nArdxrSaNThNp83kL8E6NLL9WD98iUne",
			"user_name": "Jayofthezero",
			"date_added": 1516956967
		},
		{
			"follow_id": 16,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy",
			"user_name": "Glightstar",
			"date_added": 1516956971
		},
		{
			"follow_id": 17,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ",
			"user_name": "Musickiller",
			"date_added": 1516956973
		},
		{
			"follow_id": 18,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1516956976
		},
		{
			"follow_id": 19,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB",
			"user_name": "Nekololi",
			"date_added": 1516957035
		},
		{
			"follow_id": 20,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd",
			"user_name": "styromaniac@zeroid.bit",
			"date_added": 1516957059
		},
		{
			"follow_id": 21,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw",
			"user_name": "Balancer73",
			"date_added": 1517190894
		},
		{
			"follow_id": 22,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1JwPBvZYXLJzrA6YisjpsyTuuieFLCARS6",
			"user_name": "Emeraude",
			"date_added": 1517192973
		},
		{
			"follow_id": 23,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "16it6qRi6MnCQ9JcqE1WBqNDU14qyXkExX",
			"user_name": "Deadjoker",
			"date_added": 1519378670
		},
		{
			"follow_id": 24,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1UxLMJWV5HPYCdUaFUrBPk11m3bjHQqQT",
			"user_name": "Human18",
			"date_added": 1528653402
		}
	]
}