{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [tolstoevsky](#comment_1_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): Честно, говоря, не знаю лично ни одного человека, использующего Selinux.\n\nВот тоже не встречал, но по дефолту ЦентОС требует. ",
			"post_id": 15,
			"date_added": 1483742574
		},
		{
			"comment_id": 3,
			"body": "что-то не работает на версии\ndd --version\ndd (coreutils) 8.19\nCopyright (C) 2012 Free Software Foundation, Inc.\n:(",
			"post_id": 39,
			"date_added": 1485632912
		},
		{
			"comment_id": 4,
			"body": "> [mist](#comment_1_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Как это должно попасть на компьютер? Ведь злоумышленник уже должен иметь доступ от этого пользователя.\n\nтут вопрос в том, что злоумышленник может залезть на машину под правами ограниченного юзера и поднять привилегии. \n\nКак когда-то в винде проводник через помощника открывали",
			"post_id": 44,
			"date_added": 1487776912
		},
		{
			"comment_id": 5,
			"body": "> [mist](#comment_2_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Мне не очень понятно, как он сможет поднять. Зачем от обычного юзера вводить пароль от аккаунта с администраторским доступом. Там же пальцев на руках всех линуксоидов не хватит, чтобы пересчитать способы перехвата пароля.\n\nа как получить полный контроль над машиной не имея на руках пароля админа? ",
			"post_id": 44,
			"date_added": 1487847922
		},
		{
			"comment_id": 6,
			"body": "> [mist](#comment_3_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Воспрользоваться root-уязвимостью. Толко причем тут это.\n\nздесь рассматривается вариант когда нет root дырок, а есть только кастрированный юзер и sudo... \n",
			"post_id": 44,
			"date_added": 1487854067
		},
		{
			"comment_id": 7,
			"body": "> [mist](#comment_4_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): кастрированный юзер — значит и судоерского доступа у него нет.\n\nтот случай когда sudo может быть, или sudo у других юзеров, задача получить инфу об этом... ",
			"post_id": 44,
			"date_added": 1488017269
		},
		{
			"comment_id": 8,
			"body": "больше не работает",
			"post_id": 41,
			"date_added": 1488999791
		},
		{
			"comment_id": 9,
			"body": "media.peerconnection.enabled -> false \nпожалуй одним из первых должен идти\n",
			"post_id": 73,
			"date_added": 1528799670
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {}
}