{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1608193325,
			"title": "btc: what a cash machine :)",
			"body": "btc/moondust rate is more appropriate than the usd...",
			"added": 1608193324
		},
		{
			"topic_id": 1608206269,
			"title": "I am for mudering the president of the usa...",
			"body": "he is with pedogate. 2 arrests. his families dies.\nno more usa for me, this childrapists cracy can fuck it self\n\nand its goonz can all die.",
			"added": 1608206267
		},
		{
			"topic_id": 1608206719,
			"title": "btw the russian tsar is doing his annual q&a",
			"body": "as always, impressive, will watch it this year, at least try, he is always very informative... a great shefu... will you?",
			"added": 1608206716
		},
		{
			"topic_id": 1608236472,
			"title": "Expanding nato to the west of russia was a betrayal...",
			"body": "totally the type of thing child rapists cleptocrats would do.",
			"added": 1608236468
		},
		{
			"topic_id": 1608237249,
			"title": "Russia accused of ridiculous crimes by the western press",
			"body": "but to be accused of attempting those crimes and not being able to pull them off repeatedly, litterally ads insult to injury :).\n\nahaha.\n\nwho run pedos islands and cover for it? the western.\nwho jails assanage and cover for it? the western\nwho protects snowden and cover for him? Russia\n\nall we need to know about the treason going in western countries...\n\nahhh btw russians could vote for real on constitutionnal modification, who can say that in europe or now the usa with the election regime change going on?\n\nyeah....",
			"added": 1608237244
		},
		{
			"topic_id": 1608237807,
			"title": "Stalin moved the Russian border in berlin",
			"body": "fact.",
			"added": 1608237801
		},
		{
			"topic_id": 1608288215,
			"title": "it takes less time for the us gov to invade bagdad than arrest pedogaters...",
			"body": "3 weeks to invade bagdad, only 2 people arrested.\nsum thing wong !",
			"added": 1608288208
		},
		{
			"topic_id": 1608371312,
			"title": "What is your opinion on the national security study memorandum 220?",
			"body": "When a nation tries to control the demographics of another one, it's an act of war. \n\nthere is nothing much to say to this... \n\nare you aware of it? do you understand the spirit underlying this official policy of the us gov and what are the inevitable consequences?\n\nsorry if you don't.\n\nps : I need to learn how to share the file here :).",
			"added": 1608371304
		},
		{
			"topic_id": 1608384028,
			"title": "who will murder scotus john roberts?",
			"body": "another son of whore of the pedo / genocide empire... \n\ngood kill to take btw :)",
			"added": 1608384019
		},
		{
			"topic_id": 1608419931,
			"title": "there is no need for martial law regarding the election fraud...",
			"body": "or by martial law I mean stopping the commercial and public activities in non contaminated area :). And by contaminated area I mean election fraud area.\n\nhowever, if to put down pedogate there need to be a decoy, election fraud martial law is perfect to conduct the combatf operations, because there there will be :).\n\nmy theory is that sooner or later real american new world dreamer will have to have a contact with the corrupt forces, even for their own survival...\n\nbecause my stories of the corrupt ruling forces having those pedo things in relation to their demographic agenda, is clear retaliation ground, the terminal kind.\n\nyou know the protests concerning the exposure of hte fraud are part of it, the looters and co following it a sad developping trend, but all this is nothing compared to us...\n\nand the craziest thing is that let say america can gets out of it's captors, it will still be nothing compared to the shock of the invasion by japan...\n\nyou have no idea...\n\n\"c'est parti\", THE DRAGON IS IN THE AIR, WRAPPED IN THE GOLDEN RED FLAG... you don't understand how nothing taiwan become in the recent decades... \n\nto be fully honnest we did nothing, simply nurture, raise, care, invest it all in this dragon... and you know with realizing it now, here it is...\n\nwhat I mean is that at a point the bad guys, better meet the raisers of the dragon before the dragons gets exponentially deadliers than the said bad guys...\n\nwhat I really like :  MARTIAL LAW AS REPLACING TEMPORARLY THE CORRUPT PART OF THE CIVILIAN AMERICAN ADMINISTRATION IN A NATION BUILDING. THE NATION BUILDING.\n\nAND FRANKLY THE SUCCESS OF JAPAN ARE BEYOND, AND THERE IS NO OTHER PLACES BUT AMERICA WHERE IT HAS TO SUCCEED.\n\nand there we can go beyond maga !\n\nmeaning that we didn't knew how shity make again was, and  that it won't be enough now.\n\nand if trump educated by the cohn guy (in nyc way earlier) about the black mail and co, and escaped all the trapped on esptein, there is a kill list of those who smeared that... and there we go to the last of them.\n\nthe usa really needs a true new project ! make american great finally ! again barr is just one of those who has to pass trial...\n\nmilitary nuremberg faster style...\n\nwhy only 2 arrests... who knows they may have had his daughter kill shot already...\n\nand that's the thing...\n\nfor what martial law is done\n\nto purge trhis shit fast and nicely\n\nit's not sadr city...\n\nbecause the boys of detroit (Destroy) say they are though but they don't strapp...  \"an arrest\"... ahahhaah... you don't fight drones and apaches with hell fire in these mindset... arrests... what a shame :).\n\ngo donald fuck them, they understand nothing but violence.\n\nbut the good news, we understand in china :) nothing new under the heaven... seen \"the\" walls... there are many more, way olders....",
			"added": 1608419921
		},
		{
			"topic_id": 1608462575,
			"title": "HELP : Trying to understand how I was censored on the zerotalk FR",
			"body": "Okay, there were post published and then they dissapeared. Then I checked in the user data of this zsite, found the key used by those posts, and effectively they have been removed there too.\n\nIt means direct data access? how could another key push those message to be deleted? And if not they should remain somewhere isn't it?\n\nif you have some trails to pursue please...\n\nedit: I mean is there the previous version of the data.json before it was \"updated\" ?",
			"added": 1608462564
		}
	],
	"topic_vote": {},
	"next_comment_id": 55,
	"comment": {
		"1608156151_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "man this is fully by design.\n\nthe ruling class believed they would be able to rule and dominate with less struggle \"third world populations\"...\n\nI guessed they failed to realize that nationalism wasn't a lie... sadiq khan in london.\n\nfor them, nations are psychological construct they plan to destroy to instaure their worldwide rape networks...\n\nyou know... basic primitive savage stuff.\n\"training\" is more assuring \"conformism\" and \"obedience\"... look at the scotus picks? interchangeable biodrones always providing the outcome wanted by the ruling class... oh coincidental. \n\nanyway\n\nthe guy is nz... so they buy him a \"house\" and he has to do \"computer maintenance\"... and he complains, maybe because his computer skills sucks or he got trapped in the UI update game that the genius of the third world love to do to destabilize older western people...\n\nit's a war...\n\nwage it, or be it waged on you.",
				"added": 1608192014
			}
		],
		"1608157260_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "messanger RNA? that's gonna be funny when the beauty queens will end up in beauty zombies :).",
				"added": 1608192044
			},
			{
				"comment_id": 29,
				"body": "what your new RNAm collagene pro deluxe edition has side effects? poor you, all claims of \"bugs\" are contractually excluded, now die with it.",
				"added": 1608371148
			}
		],
		"1608149924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "yeah I have seen it... it's quite violent the apparent \"talent\" you can hire for so cheap... arbitraging cost of living / slavery... \n\nand as the poorer they get the faster they breed... \n\nthe problem is the underlying cultural and generation (epigenetics) values carried by this people...",
				"added": 1608192156
			}
		],
		"1608035871_185GTTshXdJKtwsb8pWjobkFwufjR2Z6jb": [
			{
				"comment_id": 4,
				"body": "okay, thanks a lot for your help...\n\nwill test and review soon and propose the updated version for review here.\n\nI really liked how you helped me (thanks) and how you presented your stuff...",
				"added": 1608192350
			},
			{
				"comment_id": 39,
				"body": "Okay I tested your stuff... proxychain seems to be a mess to me...\n\nif found apt-transport-tor and torsocks which both do exactly what I wanted...\n\napt transport tor for udpate, install and co\ntorsocks for connecting later...\n\nopinions?",
				"added": 1608372890
			},
			{
				"comment_id": 40,
				"body": "and then I will post it maybe to this zsite too : http://127.0.0.1:43110/1Fzb9eyPN8KTQZ1BQsUUT3rw4PkjAMRMGj/\n\nwill see :).",
				"added": 1608373251
			}
		],
		"1608206269_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 5,
				"body": "there are only 2 sides, those with the pedos, those against. chose wisely, both will die.",
				"added": 1608206306
			},
			{
				"comment_id": 6,
				"body": "I can't wait to see ivanka murdered, I am curious if chelsea clinton will be killed first or the bush daughters? maybe those of obama... anyway. filths. us wide.",
				"added": 1608206641
			},
			{
				"comment_id": 7,
				"body": "trump is the one keeping assange jailed. trump is the one who captured meng (huawei), trump is the guy who murdered suleimani (with jared koshner)...\n\ngood luck fellas... \n\nand of course the master pedo supporter... the pedo cic.",
				"added": 1608206854
			},
			{
				"comment_id": 8,
				"body": "I would already raise by a lot of zero the life insurance policies of the trumps...",
				"added": 1608206902
			},
			{
				"comment_id": 18,
				"body": "the concept of trumpers is such a lie and deceit smoke screen... america 1st / maga... nothing fancy and more importantly no need for orange man emperor god savior.\n\nsimply : who is with pedogate diez.\n\nreview later.",
				"added": 1608222670
			},
			{
				"comment_id": 24,
				"body": "what did donald trump do in relation to daccosta who said that epstein was \"intelligence\" in his first bail in palm beach florida? all this? to me? destroyed the american dream. pretty grave.",
				"added": 1608288347
			},
			{
				"comment_id": 25,
				"body": "he has made maga impossible.",
				"added": 1608288463
			},
			{
				"comment_id": 30,
				"body": "I bet that trump isn't aware of the national security study memorandum 220...\n\nI understand, I too love big cities, it's just that most are poorly designed and conceived.\n\nand in an infinite universe, with infinite supply of anything (including bitcoin, bitcoincash, sv, abc etc to the millions of alts) there is nothing impossible, but the stupidity of men.\n\nit's funny how this memorandum fits the objectives of israel too...\n\nsadly guys, as we said, we firmly oppose by all means of war for you to interfer in any domestic matters of PRC.\n\ndon't forget we don't have red lines, we use yellow lines if we want to mark something, and for our enemies it's the wall of hells... at least the best we can do as dying mortals.\n\nso... taiwan !",
				"added": 1608371645
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 9,
				"body": "It was done by the americans to frame china... to hide pedogate and remove donald trump while reducing white old people worldwide... at least that's the follow up...",
				"added": 1608211731
			},
			{
				"comment_id": 10,
				"body": "the jury is still out on the long term effects of covids... testicules... and or a spontaneous autoimmune disease later... who knows... ACE-2 nice choice for to deliver a biological wmds. covid is unarmed (the vector) add the rna of ebola something else and you get more bangs for the bucks...",
				"added": 1608211818
			}
		],
		"1608203697_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 11,
				"body": "the hardest are pigs with human dna (gmo experience in the uk)... very smart those wild hogs, that tell you a lot about what they do in those white labs...",
				"added": 1608211910
			}
		],
		"1608215775_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n": [
			{
				"comment_id": 12,
				"body": "what a bunch of crapp babbles...\n\ntaiwan had original habitants who were quite happy and isolated but under the imperial rules.\n\nthen the foreigners invaded china, japan raped china, and what did the little cowards who lost the war to mao did?\n\nthey invaded peaceful taiwan...\n\nso your crap...\n\ntake it up your ass ahahaha.\n\nyou are done.\n\none day.\n\nbut don't forget it you aren't that important...\n\nwe don't really care, today.\n\nwhere it sad for you, is that your sponsor, the usa, run child rape camps and worst have election stolen... \n\ngood luck with this team...\n\ndon't forget PLA main core isn't the talibans.... since a long time ago, and already haven't we won?\n\nhahahaha.\n\nsurrender now, it will smoother than later.",
				"added": 1608216890
			},
			{
				"comment_id": 13,
				"body": "trump used taiwan to help psywarfare operators like alexjones or mikeadams to be able to not talk about the total betrayal that the american elite is commiting on the american people which above the debasement of the currency is child rape islands...\n\nahhh btw your allies pulled skycrappers on their people.... hehehehe... yeah yeah...\n\nyou are just a pawn in a game so wide that you poor taiwaneses don't have anymore the collective intelligence to play it, but simply reside mentally in your mindgames, games which remains only that, void of reality.",
				"added": 1608217131
			},
			{
				"comment_id": 14,
				"body": "and it's occupation of china. that's big... it's quite stupid for the usa to die 1 to occupy china 2 israel... \nbut what do you want... what can you do...",
				"added": 1608217456
			},
			{
				"comment_id": 15,
				"body": "the real question isn't if taiwan can survive, as we know, it can be invaded anytime, but what can we have to win by keeping it occupied by foreigners? hehehehe... \n\nanyway...\n\nthere is only 1 china and rogue areas... we know how it always end up :) when main core (the mass soldiers of china) will need it, it will be normalized...\n\nanyway, why talk to dyings? rip.",
				"added": 1608217973
			},
			{
				"comment_id": 16,
				"body": "when you think about it it's really sad, for the new world (usa) to have been draged against one of the most ancient civilization (china, mainland) and one of the most expansive civilization on earth (islam).\n\nthat's sad... better stayed in the old world if you wanted to play cops... (good luck with that btw).",
				"added": 1608218118
			},
			{
				"comment_id": 17,
				"body": "aka clearnet.",
				"added": 1608222575
			},
			{
				"comment_id": 21,
				"body": "What is funny if you think about it... what does the usa says to defend in taiwan compared to in america?\n\nfreedom of speech? where is assange already? snowden? mannings? okay... let's look at Trump, the president of the united states himself censored on twitter !!! I mean, I couldn't even event it in a movie... \n\nhuman rights? Do we need to speak about taxations? Or will we simply remain on little st james trials? Ahh... 3.\n\nprosperity? Lifting how many 100's of millions of people out of the fallouts of world wars and invasions? meanwhile, how big were tents cities? \n\nliberty? who has still the biggest per capita jailing system? 2.5 millions if I am right? \n\nthere isn't even free and fair election in the usa, even read about biden laptop or podestas or who are the associate of epstein but to go harrass a russian in the middle of nowhere there is cnn... how curious.\n\nso what is really left about america? you see I don't know much about taiwan, aka the rogue province that will be reunified with the mainland in the unity reality.\n\nmaybe we could speak about the prevalance of shit in the street of shanghai... or crimes?\n\nbut don't get me wrong both way, china work remain mostly undone (we have dreams) while the us trending is down,  meaning, maybe (worth noting), once upon a time...\n\nso what is this independence dream hiding? at least the palestinians have the excuse of islam... so what is those who rule taiwan don't want to lose by being reunified? what is problematic to justice, fairness and rightful administration of the place? meaning all webs of corruptions will be destroyed.\n\nwhat do you think would happen in the reunification of taiwan under the central authorities of the mainland?\n\nno one will invade the us rest assured... no one is crazy enough to such an illogical move... what have those people become? american zombies... \"the shapeshifters have taken over america\", the un-american american... treason.\n\nwhat a perversion. what is taiwan doing to what to associate itself with this? curious... wtf. it's multi spectral ruin. cultural, intellectual, financial, ethical, nothing is left, but this fucking flag standing over child rape island...\n\nand I remind everyone it's not a simulation,.. it's just that most \"npcs\" are so cowards... or dumb :D.\n\nit's not possible... ahahah. so I am in the dumb simulation... ahahah.",
				"added": 1608245380
			},
			{
				"comment_id": 22,
				"body": "but more pragmatically, it can be reasonned that china is a major armed power, that taiwan isn't not some fancy story about china overseas I don't know what continental and or what ever... everyone in this conflict agrees... this is not about that.\n\nwhy shall the usa or any other country be involved in this internal matter of the people of china... and yeah I agree it's totally insulting to say that ccp doesn't run child rape camps, i mean, it's a prerequisite of humanity... otherwise we are in the realms of the beasts, the fallen ones.... where war is all that remains....",
				"added": 1608245768
			},
			{
				"comment_id": 31,
				"body": "hey could you please speak to us about how or if the national security study memorandum is applied on taiwan ? curious... At first I would say they wouldn't deploy it there, but on the other hand they fear the spread of an non aligned to their demographic goal ideas... \n\nso who knows...\n\nwhat I know, is that taiwan is part of china and that ccp leadership to contest is quite an interesting idea... you know suicide by cops, suicide by ccp is just another scale :).",
				"added": 1608371804
			}
		],
		"1608035201_185GTTshXdJKtwsb8pWjobkFwufjR2Z6jb": [
			{
				"comment_id": 19,
				"body": "> [aspidochelone](#comment_421_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): aspidochelon\n\nthat's a fucking great idea... that's ideally what they should do for them, them those who protected all the friends of epstein, and by this i mean the kushner and ivanka... the whole family... anyway.",
				"added": 1608236527
			},
			{
				"comment_id": 20,
				"body": "> [edgelordofdecent](#comment_729_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Or he was involved which is far more likely.\n\npersonally if I was the IRCG I would wait a little... 2025 or 2021 (if the regime change operations against trump are sucessful) then we would start to roll... why? because all the next us admin needs to understand with the heads of the children of madleine albright splashed around party floors, the whole trump family executed across their wide estates with all the friends of donald trump witnessing, imagine 2 miles kill shot on ivanka at a sorros party... that would tell all those child rapists that you fuck with teheran, you directly jump in the middle of the oldest war on earth... did english exist at the begining of this war? omg.\n\nand so those little fools on the ashes of their ww2 laurels will understand that empire come and go, but this revenge is an iranian duty. for all, for eternity to get trump, kushner and the haspel family out.\n\nthere is no way out.\n\nthey have to kill, those, at their weakest moment... no time limit, but that death itself doesn't take the price of revenge before them :).\n\npersonally I have no idea and don't give a fuck about this issue, my problem : the child rapists with legal immunity by any gov.",
				"added": 1608236817
			}
		],
		"1608288215_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 23,
				"body": "more people have walked the moon than been arrested in relation to pedogate/epstein/weinstein cases.",
				"added": 1608288267
			},
			{
				"comment_id": 32,
				"body": "we value the liberty of the will, the capacity to provide an informed consent to any act, and very specially in the regards of bodily matters.\n\nwe estimate that children are unable to provide an informed consent.\n\nas such as you breach our wills on our children, we declare you unwanted, we hunt you, we find you, we extract your organs and sometime conduct other various necessary research for our wars.\n\nremember we try to be as professional as possible in our handling of your deaths, but we hate you and are happy to put a definitive end to your beings.\n\nah, btw we are very armed and organized, we are PC, the people of china.",
				"added": 1608371987
			}
		],
		"1608250382_1vHZxSPDWPsY1FxSNrccx845qs4AoNtq2": [
			{
				"comment_id": 26,
				"body": "the us gov may end up being recognized as the enemy of mankind which leads to american people being hunted down worldwide.\n\nwe know that the us gov released covid on china without the approval of trump (highly probable), to try to frame china, protect pedogate and loot the bail outs while removing trump who doesn't believe in malthusian politics.\n\nso as alex jones is part of the conspriacy to frame china, we have a serious problem with mr jones, happilly for him, first the dod will be massacred, then we will review calmly the situation regarding this particular enemy combatant.\n\nhow is david knight going?",
				"added": 1608370758
			}
		],
		"1608206719_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 27,
				"body": "russia today provides a perfect translation. I didn't watched it all, only the beginning and fundamentally I trust putin so I don't need to review his domestic policies :). I know he isn't after reducing the russian population. and better I know he knows what the americans are up to in this regard.\n\nI don't know... Irak is such a cool place, specially in the summer :D.",
				"added": 1608370908
			}
		],
		"1608328579_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 28,
				"body": "be aware of the freezing team those who may embark on the treason... (for the unaware you can freeze the data in ram...), we know, we are trained, and as build the biggest wall on earth, rest assure we know more about breaches than the world combined.\n\nso if you think you will be able to pull a agnes and chow, backed by a julie ehad from the state dept or mi6, know you will get caught and those who lead you ashtray have signed their family to the other side.\n\n1 china (or china unified) won't be defeated by any outside forces.",
				"added": 1608371057
			}
		],
		"1608236472_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 33,
				"body": "fostering demographic controls, did they do tchernobyl? I am convinced, but it could too have been an accident... like in fukushima...",
				"added": 1608372038
			}
		],
		"1608115429_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 34,
				"body": "what I hate the most in competitive gaming is when the rules of the game changes... new items fucking the game play... new graphic gimmicks fucking the gameplay (like player lightning).\n\nI agree with you remasters or not updating is the way to go...",
				"added": 1608372161
			}
		],
		"1607948770_19rSc8YfLc5CKq528uKnDuerT2PZoKiegm": [
			{
				"comment_id": 35,
				"body": "what is really going on? In 1974, kissinger (uss liberty) decided to impose the national security study memorandum 220. the goal is to control the demographic of foreign nation, the ultimate act of war.\n\nthen you can understand autism rate in the usa, gmo, pedos, glypho, bail outs, wtc 7 to covid.\n\nthen the nazis (americans) decided that they could own taiwan...\n\nwelcome to the chinese battlespace... \n\nyou wanted to fuck ukraine? expand nato?\n\nwelcome to the russian battlespace...\n\nso you wanted wars, you have now no choice but to win it, because we are coming to exterminate you...\n\nyou the american people whose in name those things are made.\n\namericans are the enemy of europeans.",
				"added": 1608372375
			}
		],
		"1608052496_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 36,
				"body": "you need direct blockchain access... if it use a front website or such kind of centralized crap it's not p2p.\n\nex: you can create yourself your torrent and other have access to it without intermediaries... but the torrent software (or protocol).\n\nlike here.",
				"added": 1608372548
			}
		],
		"1607953743_1Mrk9y29vh7KX8HXXPffE1xxWJTgiPAuu3": [
			{
				"comment_id": 37,
				"body": "I don't get why they are so low iq at monero hq to not use torrent to share their binaries and source code...",
				"added": 1608372626
			}
		],
		"1607575526_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 38,
				"body": "zeronet vs .onion both should be inter-compatible... or at least easily portable to one framework to the other.",
				"added": 1608372771
			},
			{
				"comment_id": 41,
				"body": "what I like the most about zn it's the offline mode :) it's quite violently cool to be able to update the network punctually while still being able to use it.",
				"added": 1608373356
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 42,
				"body": "please send me a little pm... how this work, I have no idea :).",
				"added": 1608373668
			}
		],
		"1608376973_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 43,
				"body": "should have tell more about vit c and d and zink,.. healthy nutrition is the fundation of the body (with water) to get a healthy natural immune system...",
				"added": 1608378663
			}
		],
		"1608371312_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 44,
				"body": "> [morocco0](#comment_3_18Rexsj3Nc2FK4TJEHPv6ohDJAS9wRvFjD): ZeroUp Unlimited - http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/\n\nyou shared it? how did you do it please?",
				"added": 1608378693
			},
			{
				"comment_id": 46,
				"body": "the wall is a good example of the problems deriving from this memorandum.\n\nwe said : build the wall (they keep their shit, what ever it is, not our problem) vs the implication of this memo (we will control their demographics through various means, from cultural to biological warfare).\n\nin one they are free to drawn in their own shit under their own responsabilities and can only blame themselves while on the others they become mortals enemies of america...\n\nit was quite stupid to extend a policy concerning eretz israel to the rest of the world to cloack it... big mistake once exposed.",
				"added": 1608387952
			},
			{
				"comment_id": 47,
				"body": "and fundamentally that's the problem of fighting in the lies (or darkness or what ever), it's impossible or very hard to use the darkside without seeing anything :) ! I mean we don't speak of the light jedi or fake so called sith... we mean the force... and in darkness... why do you think the dragon flames?\n\nthose people... so low iq...",
				"added": 1608388029
			}
		],
		"1608384028_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 45,
				"body": "btw how many children of amy (the trump girl) to kill before she surrender her vaxx plan? all? I don't give a shit...\n\nnuke D.C.",
				"added": 1608384092
			}
		],
		"1608393223_16F1RWwNC66bZu8h8sJBo2onWJ98DuK4s7": [
			{
				"comment_id": 48,
				"body": "If you have android you can install a firewall and manage the ports yourself...",
				"added": 1608396942
			}
		],
		"1608392197_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 49,
				"body": "what isn't buggy but god?",
				"added": 1608397003
			}
		],
		"1608419931_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 50,
				"body": "fast :\n\nmartial law NO\nreplacing the civilian compromized part of the admin by military rule YES\nreleasing fast the whole sectors once purged TRIPLE YES !\n\nand you can keep the constitutional framework... it's just need refreshes :). there is no way to not have something buggy, because?\n\nonly god isn't buggy.\n\naction!\n\nbut mike taiwan is right.. .trials...\n\nfor the records :).\n\nthen executions,\n\n for the public !",
				"added": 1608420307
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 51,
				"body": "who can censor (remove) my posts on zerotalk french edition? A lot of my controversial posts have been deleted since yesterday.\n\nAnd how can I recover such messages, are they still in some place on my files?\n\nedit : not in the english edition btw :).",
				"added": 1608453658
			}
		],
		"1608462575_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 52,
				"body": "I guess the answer is hacked :) (again). ohh noooo....",
				"added": 1608462664
			},
			{
				"comment_id": 53,
				"body": "or that apparently I don't control how the key is used on another zsite... for example I tried to modify as message on this key and it didn't got published...",
				"added": 1608462880
			},
			{
				"comment_id": 54,
				"body": "yeah, the french speaking section here is compromized :). have a nice day.",
				"added": 1608475582
			}
		]
	},
	"comment_vote": {}
}