{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1557338480,
			"title": "Porządek świata, a wolność",
			"body": "",
			"added": 1557338479
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1557338480_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc": [
			{
				"comment_id": 1,
				"body": "Ludzkość.\n\nWciąż nie wiemy skąd się wzięła, dlaczego istnieje i co z tego wyniknie. Wciąż nie wiemy nic o tym świecie, ani o nas samych, a mimo to działamy chaotycznie, destruktywnie dla wszystkiego i wszystkich. Działamy z pełnym przekonaniem że wiemy co robimy. Społeczeństwo, państwo, świat. Bez znaczenia jest skala, nie potrafimy podejmować odpowiednich decyzji jako jednostki wiec w świecie rządzonym przez jednostki jesteśmy pasożytami. Błędna hierarchia wartości od zarania dziejów bez zmian wyznacza błędny kierunek naszej cywilizacji. Nie zmieniło się nic poza technologią. Ci którzy uważają się za lepszych wykorzystują, mordują wedle uznania, bez znaczenia są czasy. Europejczycy wymordowali 90% rdzennych amerykanów, Niemcy uważali się za lepszych, za rasę panów, więc mordowali innych od siebie. Unicestwiliśmy wiele gatunków i siebie samych. Traktujemy innych gorzej, nawet ze skrajną nienawiścią, bo mają inne poglądy, inaczej mówią, wyglądają, dla zabawy. Kiedy biały zabije czarnego to rasizm, kiedy czarny zabije białego to już nie. Zbyt często ludzka podłość staje się czymś normalnym, na tyle że nie zauważamy że zabijamy kogoś obok nas, nawet nie fizycznie, ale niszczymy jego wnętrze. Co gorsza nawet gdy to widzimy nic z tym nie robimy. Wolność to możliwość wyboru, wolność jednego kończy się tam gdzie zaczyna się wolność drugiego .  To powinno być fundamentalne prawo każdego człowieka. Są wśród nas osoby bardziej wrażliwe, często w tym pseudo cywilizowanym świecie muszą wewnętrznie umrzeć, aby istnieć. Wielu wybiera odebranie sobie życia niż istnienie w więzieniu. Masy pracują często do śmierci by przetrwać, by garstka mogła żyć wedle uznania ich kosztem. Po trupach ludzi, zwierząt, roślin, tej planety i każdej innej elity dążą do własnej wygody, do własnej wolności nie bacząc na jakiekolwiek konsekwencje, a może być przecież inaczej, możemy to zmienić. Ludzie mogliby żyć w zgodzie z naturą i sobą nawzajem, technologia nie musi oznaczać destrukcji. Wszyscy ludzie mogą być wolni niezależnie od różnic kulturowych, poglądów, wyglądu etc. Możemy żyć w dobrobycie nie będąc pasożytami, ale musimy do tego dążyć i to każdy z nas powinien się o to starać",
				"added": 1557338554
			},
			{
				"comment_id": 2,
				"body": "tomasz21. Ciekawa teoria o bio-robotach, takiego określenia ludzi wewnętrzne martwych nie widziałem jeszcze. Zgadzam się jeśli chodzi o to programowanie ludzi, chociaż inaczej do tego podchodzę. Dla Ciebie programowanie dla mnie zabijanie. Ludzi od małego się zabija wewnętrznie na wiele sposobów, aby jako dorośli byli marionetkami w rekach systemu, bo takich trzeba, ktoś musi zapracować na elitę. Nie tak to powinno wyglądać, ale chyba łatwiej było by świat na nowo zbudować niż zmieniać go na taki jaki być powinien. Być może niektórzy do tego dążą. Odnośnie naszej niewiedzy, to miałem na myśli stosunek tego co można wiedzieć do tego co wiemy. Jest multum teorii, ale to bardziej wiara niż wiedza. Za wiedzę przyjmujemy to jakim dowodom uwierzymy. Zbyt często okazywało się że w badaniach były błędy, czy po prostu były sfałszowane, więc jaka jest prawda? Jak to wygląda wszystko? Zaufać oficjalnej nauce? YouTubowym filmikom? Własnej intuicji? Co jest prawdą? Na czym opieramy naszą wiedzę? Wielu z nas widzi że świat nie działa jak powinien, a mimo wszystko działamy według jego zasad. Nieważne jak wzniosłe są nasze idee, otwarte oczy, wielu z nas wraca między te bio-roboty służąc systemowi, bo jakoś trzeba zapewnić dach nad głową, jedzenie, utrzymać rodzinę etc. Nie ważne jak bardzo otwarte mamy oczy skoro jedynie umysłem potrafimy się wyrwać poza system. Wolni umysłem zniewoleni życiem. \nP. S. Piszę z telefonu i z góry przepraszam za błędy. Rozpoczęcie tematu od komentarza także jest z tym związane. Wciąż poznaję",
				"added": 1557423517
			}
		],
		"1562960205_12p9JsmWBNB2FGXhrACxyF1TdvJzsbwQcu": [
			{
				"comment_id": 3,
				"body": "Myślę, że to nie tylko Pan Z, ale w naszym rządzie jest wielu, którzy dla własnych korzyści niszczą kraj. Obawiam się, że zmiany dokonane siłą mogą być wykorzystywane przez inne państwa",
				"added": 1577593960
			}
		],
		"1581694747_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 4,
				"body": "Między innymi dlatego ludzie podobnie myślący do Ciebie puścili wirusa. Zbyt wielu zyskuje zbyt wiele, żeby to był przypadek.\n\nZachowujesz się podobnie do opisanych przez Ciebie ludzi, jednak zapewniam że jest multum starszych ludzi, którym z swoją wiedzą i doświadczeniem powinni być filarami obecnej cywilizacji. Niestety tych ludzi się obecnie usuwa",
				"added": 1584036751
			}
		]
	},
	"comment_vote": {
		"1_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc": 1
	}
}