{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Идеальная p2p соц сеть",
			"body": "Какой должна быть p2p форум, соц сеть, чат (система, комплекс програм/плагинов)\nчтобы быть популярным и востребованым?",
			"added": 1562445818
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE": [
			{
				"comment_id": 1,
				"body": "> [if0](#comment_98_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): В первую очередь - массово хайпиться: иметь широкую извесность и всегда находится в центре внимания.\n> Во-вторых: быть легко используемой - просто \"открываемой в баузере\", или через простое мобильное приложение, без всяких \"программ/плагинов, комплексов и прочих систем\" - понятий чуждых для людей, которые хотять не \"настраивать и разбираться, как что-то там работает\", а \"поставить и пользоваться\".\n> В-третьих - предоставлять полный набор фитчей, ставших стандартными для современных форумов, соц сетей и чатов. \n> В-четвертых - не жрать ресурсы: трафик, место под данные - важно для мобильных пользователей.\n> Все остальное: \"отсутствие цензуры, безопасность, анонимность\" для массового пользователя вторично, или вовсе безразлично, по отношению к легкости использования.\n\nтогда получается, что мобильному приложению нужно будет стучатся на сервер у которого будет его приватный ключ, чтобы делать всю работу вместо легкого клиента\nтогда приходим к тому, что нужто чтобы сервер получал что то за работу и за секюрность\nпри этом хранил все нужные сайты пользователю в кеше, вместо самого пользователя\n\nхмм, рекламу чтоли показывать:)",
				"added": 1562496236
			},
			{
				"comment_id": 2,
				"body": "> [if0](#comment_98_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): \n> Все остальное: \"отсутствие цензуры, безопасность, анонимность\" для массового пользователя вторично, или вовсе безразлично, по отношению к легкости использования.\n\nну тогда им и нету смысла p2p приложение юзать получается, фейсбук будет в любом случае лучше\nкакие то таргетинговые штучки будет довольно сложно делать",
				"added": 1562496360
			},
			{
				"comment_id": 3,
				"body": "> [if0](#comment_98_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): >\nВ-третьих - предоставлять полный набор фитчей, ставших стандартными для современных форумов, соц сетей и чатов.\n\n\n\nОгласите полный список пожалуйста:)\nесли форум:\n-создавать темы\n-комментировать\n-отвечать на комментарии (треды?)\n\nесли соц сеть:\n-фоловить пользователей\n-писать посты\n-лайкать\n-коментировать\n\nко всему:\n- прикреплять файлы\n\nчто забыл?",
				"added": 1562496798
			},
			{
				"comment_id": 4,
				"body": "> [if0](#comment_102_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Получать уведомления, пользоваться поиском, создавать группы и каналы.\n> Только все это - вторично по сравнению с известностью и удобствои использования. Путь будут \"мегафитчи\" - они окажутся никому не нужными, если ради их использования приедтся ставить клиента Tor, или i2p роутер.\n\nну, Тор можно скомпилировать через биндинги) если уже на то пошло\nтак что он (если будет нужно) может быть прямо внутри приложения",
				"added": 1562502471
			},
			{
				"comment_id": 5,
				"body": "> [geekless](#comment_216_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Лол. Кто-нибудь из отметившихся собирается писать код?\n\nя вот планирую делать в свободное время, только нужно сначала продумать что и как будет работать\nархитектуру так сказать продумать\nмне не очень нравиться идея хранить все зарегистрированные с момента начала работы сети никнеймы в одном месте\n\nдумаю чтобы у каждого сайта была своя база пользователей привязана к публичному ключу пользователя\nтогда можно будет удалять пользователей с базы которые не будут активны на протяжении какого то периода, 1 год (к примеру)\n\nтогда база данных пользователей не будет расти бесконечно, что есть более приемлемо\nесли какая то ветка форума активна, после того как пользователь создавший ее удален, то рядом с ником будет какой то знак\n\nтак же само можно с записями или отправлять их в архивные ноды, если кто то захочет такие держать\nтаким образом не будет нужды качать все с начала времен сайта, а только относительно свежую и нужную активным пользователям информацию\n\nпока все существует только на бумаге)\nтолько думаю что и как сделать, буду благодарен любым замечаниям и пожеланиям\n\nно нету смысла в первую версию очень много фич впихать, только самое востребованное\n\nпредложения \"на далекое будущее\" тоже активно принимаются",
				"added": 1562505799
			},
			{
				"comment_id": 6,
				"body": "> [fant](#comment_8_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Как в ZN и сделано.\n\nя в 0net заходжу иногда с 2х разных ПК, на одном настроил работу с 0net для работы с тор, на другом тор вообще не стоит\nи тот другой не может подключится к тор, так что сомневаюсь",
				"added": 1562506889
			},
			{
				"comment_id": 7,
				"body": "> [geekless](#comment_218_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Был у меня период, когда хотелось взять и запилить p2p сеть самому. :)\n> Насчёт архивов со старым контентом на форумах я уже как-то предлагал идею, что пользователю дается, скажем, 200 КБ под самые свежие записи в data.json, а всё остальное хранится в опциональных файлах, разбитых по диапазонам дат.\n\nвот зачем эти файлы, data.json\nпочему не пересылать сущности у которых дата изменения раньше чем какое то значение?\nможет так решается проблема которую я не вижу..\nмогли бы пояснить?\n\nтак же мне не нравится подход с использованием sqllite\nя канешно не знаю будет ли другой подход работать быстрее, но как по мне он делает слишком много IO операций что убивает производительность",
				"added": 1562524318
			},
			{
				"comment_id": 8,
				"body": "> [geekless](#comment_218_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Был у меня период, когда хотелось взять и запилить p2p сеть самому. :)\n> На мой взгляд, вся эта критика и размышления \"как лучше\" имеют тот фундаментальный недостаток, что те же вопросы можно намного проще решить доработкой ZN, а не созданием чего-то с нуля.\n\n\nпонимаю, но мне хочется это сделать на golang, у питона довольно много недостатков\nхотя и не скажу что у golang их нету)\nно для работы с сетью довольно часто выбирают golang",
				"added": 1562524422
			},
			{
				"comment_id": 9,
				"body": "> [geekless](#comment_217_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В составе дистрибутива ZN есть же тор. Я гоняю ZN в докер-контейнере, пока не сталкивался с тем, что тор не работает. Даже из поселка через yota, едва-едва добивая до вышки. В таких условиях ZN работает даже лучше, чем обычный веб.\n\nпо ходу докер контейнер включает настроенный тор просто, на то он и докер",
				"added": 1562525077
			},
			{
				"comment_id": 10,
				"body": "> [geekless](#comment_219_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Потому что данные надо как-то сериализовать, а json как раз достаточно простой и популярный формат. Если гонять по сети \"объекты\" вместо файлов, то возникает вопрос о хранилище объектов. Если мы храним объекты в СУБД, то встаёт вопрос бэкапов и читаемости средствами за пределами этой СУБД. (Да и её надежности тоже.) Простой текстовый формат эти вопросы снимает.\n\nчитать с СУБД и отправлять json-ом или другим протоколом, по моему норм\nпо поводу бекапов, то у всех других пользователей есть бекапы, если у тебя что то накрылось, скачать всегда есть откуда\nну и использовать транзакции, если запись, чтобы все четко стало",
				"added": 1562525450
			},
			{
				"comment_id": 11,
				"body": "> [if0](#comment_105_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Что будет с производительностью при количестве активных пользователей хотя бы в 10К?\n\nдумаю если будет так, тогда будут под каждую тему делать отдельный 0net сайт\nтаким образом нагрузка значительно падает на каждый отдельный сайт\nно на систему в целом, нет",
				"added": 1562526738
			},
			{
				"comment_id": 12,
				"body": "> [if0](#comment_106_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А мне хочется на С99 :-)\n\nделай :-)\nпотом посмотрим у кого что получилось и как работает\nк тому же на go есть довольно годные p2p библиотеки \nразработчики ipfs пилят",
				"added": 1562526907
			},
			{
				"comment_id": 13,
				"body": "> [if0](#comment_108_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Вы уверены в качестве (производительности, безглючности и что авторы в следующей версии не поломают их API) этих либ, и что они подойдут для ваших целей?\n\nпо поводу API более мение уверен\n>что они подойдут для ваших целей?\nда в 95 проц случаев, для p2p связи\nознакамливался и при том, что ipsf уже работает уже показатель и в принципе довольно неплохо работает",
				"added": 1562527386
			}
		]
	},
	"comment_vote": {}
}