{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1523623838_1GM5NViQbp18za5zzjhvffcHehfpemech9": [
			{
				"comment_id": 1,
				"body": "why not just set a free proxy in the telegram settings?",
				"added": 1523630992
			},
			{
				"comment_id": 2,
				"body": "> [akito](#comment_442_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): Entirely correct, you should use a different product anyway. You even need to have a phone number for Telegram. The messenger is only useful if you don't care about secure communication.\n\ntelegram is still the best chat service out there. if you have smth important to discuss or want to be anonymous there are way better alternatives, yes. but none of them has the feature set telegram has. and it's already 100x more secure than any other commercial chat service",
				"added": 1523656533
			},
			{
				"comment_id": 3,
				"body": "> [akito](#comment_443_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): Sorry to say, but that's wrong. I use a better messenger which is e2e encrypted and entirely secure while having even more features than telegram. Boom.\n\nhas it bot support? supergroups? web and desktop apps? gif support? stickers? markdown support? after sending message editing and deleting? support for in-app video/audio streaming? pip mode? channels? 2gb online storage for each file? multiplatform/device usage? customizable guis? more than 200mio users? api integration? ect...\nI doubt there's any messanger which can compete with telegram in terms of feature richness. it's privacy and closed source nature sucks, yes. but it's the only good solution for practical daily usage. more important things there are still solutions like nextcloud talk or zeronet",
				"added": 1523706245
			}
		],
		"1523757599_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 4,
				"body": "\"I love Trump\" well then you should fuckig kill yourself you dumb piece of shit",
				"added": 1523791016
			}
		],
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": [
			{
				"comment_id": 5,
				"body": "zeronet is the future. the internet is lost",
				"added": 1553641620
			}
		]
	},
	"comment_vote": {}
}