{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1577900762_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "> [aspidochelone](#comment_298_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I don't know what this is all about but you seem obsessed with sex and conspiracy, so let's get to the bottom of this. [...]\n\nI agree there is loads of HBTQ+ propaganda, ads for contraceptives for pregnancy etc.\nWhat happens when population is below replacement is welfare system fails, you can see this happening in europe.\nEconomists in Sweden is getting shaky because it will probably fail sooner than expected,\nmore than 1 in 10 swedish women refuse to get kids, and the rest gets around 1-2 kids, well below replacement rate.\n\nThey did however increase migration to over 100k people per year, completely draining the welfare systems, giving away apartments and houses otherwise needed for swedish citizens. (There is a big housing crisis)\nLeading to housing prices completely exploding meaning no one in the younger generation can afford whats available.\n\nHow could they do a miscalculation this big?\nI seriously don't understand how the nation leaders can let this happen.. It's a treason beyond my comprehension.",
				"added": 1577974706
			},
			{
				"comment_id": 2,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1499_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You have to see the problem more broadly, and understand that periodically nature erases civilizations. The important thing for people in the shadows is to maintain Civilization as a whole:so they have to bring people to where other people don't make babies anymore.\n\nAre you kidding? It's because of social pressure and failing economy that people avoid making babies.\nMigrants get housing and welfare paychecks for free plus extra welfare paychecks the more babies they make,\nmeanwhile the indigenous people is living paycheck to paycheck and cannot afford buying a basic apartment,\nnor renting a medium sized one that is appropriate for raising a kid.",
				"added": 1578011926
			}
		],
		"1578875146_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [],
		"1579429443_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE": [
			{
				"comment_id": 4,
				"body": "Do you have Lev Davidovich Bronstein / Trotsky speech  in PDF, audio or video format?",
				"added": 1579440806
			}
		],
		"1579514127_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "> [ranshit](#comment_59_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Most mechanics will use instructional Youtube videos to help find a solution to a problem on a piece of machinery they haven't worked with before. [...]\n\nAs a mechanic, I approve this. Sometimes videos on YouTube have some good information on most basic stuff.\nSometimes there is good tips there that you can use if it's a model you never worked with before.\n\n\nMost of the time however, I only look at spec sheets or manual for which torque and how many degrees screws need to be tighten at, and electronic schematics and spec sheets when i am doing troubleshooting.\nYouTube don't help very much when it comes to that..",
				"added": 1579540921
			}
		]
	},
	"comment_vote": {
		"99_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"397_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"475_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1_1LFcUMNS2edhEW33Agtzh17kphr7kBSWWM": 1,
		"1_1Hiqq5zy6pScwUbR3wzLL2MrprBEDBfK9z": 1
	}
}