{
	"next_topic_id": 27,
	"topic": [
		{
			"topic_id": 1593213955,
			"title": "Polecam - Zero Polska.",
			"body": "2020.06.27.05.text-5-G.-Wyścig zbrojeń.  - POLECAM -\n.\n   I jaki to ma związek z cywilną siecią, 5-G.",
			"added": 1593213954
		},
		{
			"topic_id": 1595964603,
			"title": "Zdrowie-Szkodzenie-PSZENICZNY BRZUCH.( P0LECAM )",
			"body": "2020.07.18.04.[PL]-text-Zdrowie-Szkodzenie-PSZENICZNY BRZUCH,.odt\n.\nhttp://127.0.0.1:43110/1PoLsKaf9eRbXEVZvQA4R5jRdDg2K65mPz/",
			"added": 1595964601
		},
		{
			"topic_id": 1603034885,
			"title": "PLANY - NA - PRZYSZŁOŚĆ.",
			"body": "PLANY - NA - PRZYSZŁOŚĆ.\nCiekawy temat w tym czasie.\nNie będę polemizował, ale za to podam coś ciekawszego.\nNiedawno poświęciłem czas aby właśnie zajrzeć w te plany. Niestety zwykle to się nie udaje ale tym razem otrzymałem rezultaty.\nPODKREŚLAM, patrzyłem na PLANY…NIE NA PRZYSZŁOŚĆ!\nJak to widziałem.\nW tej chwili zależy im na wprowadzeniu jednej wspólnej, elektronicznej waluty.\nUważają to w tej chwili za priorytet.\nWszystkie większe a nawet mniejsze banki już to wiedzą i pracują od jakiegoś czasu nad tematem. Starają się utrzymać to w tajemnicy przed niższymi pracownikami jak długo się da.\n.\nPóźniej zależy im na zniesieniu dotychczasowej mapy administracyjnej świata. Chcą w ogóle zrezygnować z podziałów etnicznych. To zabawnie wygląda , wszystko jest ułożone z kwadratów lub form podobnych. Co ciekawiej jak widzę zaaranżowane jest to bardzo sprytnie, kwadraty nie odpowiadają najczęściej obecnym podziałom.\nJest to tak zbudowane aby dążyć do podziałów ale w poprzek krajów, tak aby rozdzielić ewentualne ruchy nacjonalistyczne.\nWygląda to trochę jak podział na gubernie lub dystrykty, każdy będzie miał swojego zarządcę.\n.\nW tej chwili toczą się wielkie walki wśród polityków o to by zapewnić sobie taki dystrykt, jedni już dostali co chcieli innym leci ślinka. Wiedzą że to układ na stulecia. Kupują ich tym że będzie to przywilej o charakterze rodowym, przekazywany z ojca na syna jak za królestw.\nWidziałem że instytucją o charakterze nadrzędnym zostanie ONZ, flaga się nieco zmieni ale liście laurowe nadal są.\nWśród korporacji też już bardzo wiele osób o tym wie, trwają przygotowania do zmiany, korporacje teraz się nie buntują przeciwko rozwałkom gospodarek bo tort jaki im przedstawiono jest niezwykle imponujący.\nKorporację przejmą handel, usługi i produkcję. Teraz czekają.\nZajrzałem głębiej, kto za tym stoi?\nSą to istoty których nie rozpoznaję, są w cieniu i chcą pozostać w cieniu nawet kiedy wszystko miało by się dokonać, chcą cały czas pozostać anonimowe.\nCo ciekawe, wyglądają na ludzi ale wyczuwam wśród nich niezwykle stare istoty, może tysiącletnie, albo i więcej.\nW tej chwili nie mają do dyspozycji sztucznej inteligencji, dysponują dostępem do WSZELKICH baz danych, mają świetny sprzęt komputerowy i szpiegowski oraz o podłożu analitycznym, ale sztucznej inteligencji nie widzę, ani istot pozaziemskich, chyba że Ci starzy. \nGeneralnie jednak są sami.\nW tej chwili mają duże problemy, mniejsze kraje łatwo przekupić, ale trudności sprawia im USA (ma zostać zniszczona wewnętrznie), Rosja ( nie wiedzą co zrobić na teraz ), Chiny (nie wiedzą co zrobić teraz) oraz zestaw krajów arabskich ( próbują uzyskać sojusz Arabów aby wyłonić przywódcę który podejmie decyzję za wszystkich )\nGeneralnie jednak plan im się sypie w tych miejscach.\nMają też olbrzymie problemy z dziedzinami takimi jak historia, chcą ją ujednolicić, tylko to stanowi gigantyczne wyzwanie.\nCo jeszcze widziałem, promowany Jubileusz to marchewka. Chcą aby ludzie zbiednieli i nie mieli już forsy lub mocno się zadłużyli. Wówczas będzie Jubileusz darowania kredytów, bądź też dodatkowo w formie pieniędzy.\nJednak nic za nic, właśnie wtedy powiedzą że da się to zrobić ale warunkiem będzie chip, potwierdzający obywatelstwo „ziemskie”\nLiczą że 30-40% ludzi zgodzi się bez nacisków, pozostali zostaną przekupieni Jubileuszem, liczą że to wystarczy i pójdzie to dość gładko.\nNie ma precyzyjnych planów co do kwestii własności, czy w ogóle coś takiego zainstalować, jest to dla nich bardzo problematyczne aby ktoś miał prawo własności do czegoś.\nTo co dzieje się obecnie srovid, 3 wojna światowa czy inne wojenki, wszystkie zamknięcia, srockdowny, maseczki, to tylko gra na czas. Nie ma to dla nich absolutnie znaczenia. Podobnie bez znaczenia jest obecnie upadek gospodarczy bo wiedzą że i tak struktura wszystkiego ma się zmienić.\nJeśli macie jakieś pytania, a ja będę potrafił odpowiedzieć to odpowiem.",
			"added": 1603034882
		},
		{
			"topic_id": 1603206417,
			"title": "Kultura i łączność.",
			"body": "Ciekawy Artykuł,  który warto przeczytać, tematem jest rozwój człowieka. Text, dla średnio zaawansowanych.\n.\nhttp://127.0.0.1:43110/1PoLsKaf9eRbXEVZvQA4R5jRdDg2K65mPz/index.html?v=topic+id=1GbrGWLCUP7wZJH1sEY9nFzre9AL24hGq1topic4",
			"added": 1603206413
		},
		{
			"topic_id": 1608946398,
			"title": "Kowidowe ludobójstwo NWO.",
			"body": "Kowidowe ludobójstwo NWO\n\n„A przecież proponowana technologia mRNA nigdy nie była stosowana u ludzi. Nie znamy skutków ubocznych, które mogą pojawić się po wielu miesiącach lub latach. Rządowi pseudoeksperci zapewniają, że produkt jest bezpieczny, ale żadnego dowodu nie dostarczają. Natomiast producent został zwolniony z odpowiedzialności za działania uboczne. Czyli wyprodukował coś, czego nie jest pewny.\n(…)\nW odniesieniu do „szczepionki” na koronawirusa wprowadzone cząstki mRNA będą dodatkowo podlegać replikacji i translacji. Tak więc w „szczepionce” otrzymamy inwazyjną cząstkę, podobną do złośliwego wirusa lub złośliwych komórek nowotworowych, rzekomo dla naszego dobra. Osoby, które wahają się jeszcze przed przyjęciem tej genetycznej „szczepionki” niech uświadomią sobie, że po jej przyjęciu wprowadzą do swojego organizmu pasożytniczą cząsteczkę mRNA, podobną do wiroidów wykrytych do tej pory jedynie u roślin. Wiroidy roślinne nazywane są pasożytami transkrypcji, ponieważ przejmują one aparat transkrypcyjny swojego gospodarza, doprowadzając go do choroby lub śmierci.\n(…)\nTego preparatu nie można nazywać szczepionką. To nie jest szczepionka w swojej istocie. Nazywam to konstruktem mRNA, rekombinowanym RNA, preparatem, który jest dziełem inżynierii genetycznej. W ulotce producenta preparatu przeciwko C-19 jest jasno napisane, że nie badano wpływu tego produktu na płodność. Czyli nie wiemy czy mogą być skutki uboczne czy nie.\n(…)\nMoże to dotyczyć również konstruktu mRNA znajdującego się w szczepionce. Ten konstrukt może być też identyfikowany jako obcy mRNA, ponieważ mRNA gospodarza jest odpowiednio znakowany. Może to skutkować reakcją autoimmunologiczną. Trwałość konstruktu mRNA mają zapewnić wstawione w tym celu zmodyfikowane nukleotydy, toksycznie oddziałujące na komórkę. RNA komórkowe uczestniczy w rozlicznych szlakach sygnałowych, a obcy konstrukt mRNA może szlaki te zakłócać. Generalnie, nasza wiedza dotycząca szlaków sygnałowych w komórce jest bardzo skromna i dlatego z wielką obawą należy patrzeć na możliwe efekty tej manipulacji genetycznej po przyjęciu „szczepionki”.\n(…)\nW odniesieniu do szczepionki mRNA na SARS-CoV-2 odpowiedź immunologiczną ma wywołać jedynie pojedynczy antygen, jedno białko S, wytwarzane przez nasz organizm na wirusowej matrycy. Najnowsze badania wskazują, że taka szczepionka, np. u kotów wzmaga ich zachorowalność i śmiertelność. Podobnego zdania są naukowcy odnośnie możliwych efektów zastosowania tej szczepionki u ludzi.\n.\nTak więc, odpowiadając na Pani pytanie, odpowiedź nasuwa się taka: osoby zaszczepione na SARS-CoV-2 nie uchronią się przed zakażeniem koronawirusem, a nawet mogą mieć poważniejsze objawy COVID-19, a co za tym idzie, będą rozsadnikiem tego wirusa.\n(…)\nNie inaczej jest z COVID. Nie stanowi on zbytniego zagrożenia dla organizmu zdrowego nawet jeżeli jest to osoba nieco starsza. Zagrożeniem są choroby współistniejące, które wynikają z niezdrowego trybu życia, a więc otyłość, cukrzyca, nadciśnienie. Pan dr Marek Wasiluk w obszernym artykule na Onet, właśnie otyłość uważa za jedną z przyczyn ostrego przebiegu COVID. Otyłość jest wynikiem braku ruchu i niezdrowego żywienia. Szacuje się, że 9% wszystkich rocznych zgonów w Europie jest spowodowana brakiem ruchu. Choroby wynikające z braku ruchu kosztują rocznie UE około 80 mld dolarów (wg. WHO). I tę kwotę można zaoszczędzić promując ruch i zdrowy styl życia.\n.\nNiestety, w dobie kowidianizmu zapomniano o podstawowej zasadzie, która obowiązywała od wieków. Wprowadzono zalecenia, które przeczą prastarej wiedzy i istocie człowieka jako gatunku biologicznego. Zakaz wychodzenia z domu, maseczki, przesadna sterylizacja pomieszczeń i ciała – to są zalecenia prowadzące do zwiększenia podatności na zachorowanie, a nie takie, które chronią przed nimi. Zwłaszcza dla osób starszych zalecenia te są wyrokiem śmierci. Dlatego trudno uwierzyć, że są one wydawane dla naszego dobra. Należałoby bowiem założyć, że politycy i wielu ekspertów nagle doznało zbiorowej amnezji pod wpływem niegroźnego wirusa.\n.\nZalecenia tak bardzo przeczące dotychczasowej wiedzy o odporności człowieka na choroby bardziej przypominają działania eugeniczne niż dbałość o interes społeczny. I za te działania rządy powinny być rozliczone, gdyż naraziły one zdrowie i życie tysięcy ludzi. To właśnie obniżenie zdrowotności społeczeństwa przez tzw. środki zaradcze doprowadziły do gwałtownego wzrostu zgonów jesienią. Nie dość, że mamy poważną chorobę zwaną syndromem przewlekłej niewydolności służby medycznej, to dodatkowo mamy obniżoną odporność na skutek wielomiesięcznego noszenia inkubatorów mikroorganizmów na twarzy, siedzenia w domu i w związku z tym ograniczenia w przyjmowaniu witaminy D.\n.\nZdrowie polega na zdolności organizmu do ochrony przed wirusami, a nie na tworzeniu sterylnego organizmu. Hodowla w warunkach sterylnych zawsze prowadzi do dużej śmiertelności, gdy organizmy hodowane w taki sposób stykają się ze środowiskiem naturalnym. Zapewne wie to każdy ogrodnik, który do produkcji kwiatów wykorzystuje kultury in vitro (sterylne). Dzisiaj rządy uczyniły z ludzi organizmy hodowane in vitro i trudno się dziwić, że takie osoby po zetknięciu ze środowiskiem nie są w stanie się przed nim bronić.\n.\nDlatego nie dajmy się zwariować i prowadźmy zdrowy styl życia bez maseczek i z pełnią ruchu.\n(…)\nDzisiaj ofiarą psychopatycznych działań padło całe społeczeństwo, któremu wmówiono, że przeziębienie to zabójczy wirus, a jedynym sposobem ochrony jest całkowita eksterminacja społeczeństwa. Jasna koncepcja: nie będzie ludzi, nie będzie wirusa. Tzw. obostrzenia to nic innego niż zarządzenia kapo z obozu pracy, których jedynym celem jest upodlenie, złamanie kręgosłupa, zniszczenie woli walki i stworzenie z człowieka „zombie”, który nie myśli i nie czuje.\n.\nTaka osoba staje się marionetką, z którą można zrobić wszystko. Nakazy noszenia maseczek utrudniających oddychanie i stanowiących wylęgarnię mikroorganizmów, zakaz spacerów, śpiewu, tańców, spotkań w połączeniu z przymuszaniem do niechcianych terapii i straszeniem szczepionkami to bezprecedensowa przemoc prowadząca de facto do uśmiercenia znacznej części populacji. Może być ona jedynie porównana z podobnymi praktykami, które miały miejsce w czasie II wojny światowej, szczególnie w stosunku do określonych grup ludności lub z działaniem sekt zniewalających ludzi.\n.\nTa bezprecedensowa przemoc spotyka się z akceptacją większości społeczeństwa, które potulnie dostosowuje się do bezmiaru okrucieństwa serwowanego przez zdrajców. Społeczeństwo zachowuje się tak jakby doszło do zbiorowego syndromu sztokholmskiego. Nie tylko zgadza się na bezprawie narzucane przez warszawskich oprawców, ale niczym ofiary omawianego syndromu zdaje się z tymi sprawcami współdziałać prowadząc do jeszcze większych strat w ludziach.\n.\nGdzie są naukowcy, profesorowie, którzy zawsze mieli usta pełne frazesów, a teraz milczą w obliczu zagłady? Dlaczego milczą medycy, biolodzy, psycholodzy, socjolodzy? Dlaczego głosy rozsądku nie są powszechne?\n.\nW zamian mamy pseudoekspertów udowadniających każdym słowem, że sprzedali się za kilka srebrników. Dlaczego te tzw. elity zamykają oczy na jawne pogwałcenie godności osoby ludzkiej i jej prawa do życia zgodnie z własnymi przekonaniami, prawa do nietykalności własnego ciała? Żadna epidemia, nawet prawdziwa nie uprawnia do rujnowania ludziom życia, do zabraniania korzystania z dobroci Natury.\n.\nDla przypomnienia, chorym na hiszpankę zalecano przebywanie na świeżym powietrzu. Żadna epidemia nie uprawnia do narażania ludzi na chorobę i śmierć wskutek irracjonalnych zarządzeń. W październiku już wzrosła liczba zgonów jako efekt odłożonych operacji, braku diagnostyki nowotworowej (40-50% mniej osób kierowanych jest na szybką ścieżkę), skierowaniu wszystkich działań medycznych na niezbyt groźnego wirusa.\n.\nW kolejnych miesiącach liczba zgonów dalej będzie wzrastała jako efekt wielomiesięcznych zaniedbań. Dodatkowo, w okresie jesienno-zimowym towarzyszy nam gwałtowny wzrost liczby osób cierpiących na grypę, stany grypopodobne oraz przeziębieniowe, które zostaną okrzyknięte jako te powodowane przez koronawirusa.\n.\nNa własne życzenie, wielu zamiast leczyć przeziębienie domowymi sposobami, odda się w ręce Marsjan, którzy zamkną ich za kolczastymi drutami i poddadzą eksperymentom z niesprawdzonymi terapiami. Część się podda, bo spanikuje. Inni, gdyż przeziębienie nieco dłużej potrwa, nieco silniejsze będą objawy nie wykluczając ostrych ze względu na drastyczne obniżenie odporności całego społeczeństwa.\n.\nOsoby 70+ już są poddawane powolnej eutanazji ze względu na zakaz wychodzenia z domu, który przeszedł bez echa. W końcu kogoś trzeba poświęcić, przy okazji ratując ZUS. Czy to się różni od segregacji na rampie? Genialny pomysł psychopaty.\n.\nŻadne racjonalne głosy nie przemawiają do zamaskowanych tłumów. Nie obrażając baranów, te tłumy jak „barany” idą na rzeź. To ci zamaskowani, którzy stracili odporność, ci, którzy ograniczyli spacery i aktywność fizyczną ponoszą winę za wzrosty zgonów. To oni są winni przepełnionym szpitalom, gdyż unikając spacerów i słońca znacznie obniżyli zawartość witaminy D w swoim organizmie, doprowadzając do większej podatności na choroby. Tłumy na plażach i basenach opalające się w maseczkach – to im zawdzięczamy kolejne restrykcje.\n.\nTrzeba wyraźnie powiedzieć, że pandemia to ściema. Obostrzenia dotyczące maseczek, dystansu społecznego i kwarantanny są przeciwzdrowotne. Nie ma żadnego uzasadnienia na sianie paniki i stosowanie terroru biomedycznego w odniesieniu do obecności wirusa przeziębieniowego, którego 80% z nas przechodzi bezobjawowo. Szczepionki są niepotrzebne. Wirusy są wszędzie, od zawsze. Jedyną skuteczną obroną jest budowanie własnej odporności. Szczepienia to droga donikąd. Wirusów jest wiele.\n.\nNie zaszczepimy się na wszystkie z nich. Każde zaszczepienie, czyli próba farmakologicznej obrony nas przed nimi, jedynie nas osłabi i w zdwojony sposób wystawi na kolejne wirusy. One tylko na to czekają. Szczepienia powszechne, czyli dla wszystkich i na wszystko to marzenie przemysłu farmaceutycznego. Oni chcą abyśmy byli coraz słabsi i całkowicie uzależnieni od farmakoterapii. Oni manipulują szczepionkami, wymyślając te szkodliwe dla nas specyfiki, na rzecz których wymyślają pandemie. Skończył się 20. letni okres ochrony patentowej dla szczepionki na grypę i dlatego grypa musiała zniknąć. W jej miejsce pojawił się COVID. Następne patogeny i choroby są już w przygotowaniu.\n(…)\nPowstaje więc pytanie po co w takim razie stosować te testy. Odpowiedź jest taka, że ich intencją nie jest wykrycie obecności koronawirusa w badanej próbie z wymazu z nosogardzieli, ponieważ testy te do tego się nie nadają. Ich rola jest zgoła inna. Mają one za zadanie uwiarygodnić pandemię koronawirusa. Testy te w zależności od ustawionych parametrów przeprowadzenia analizy zawsze mogą coś wykryć lub nie. Daje to możliwość manipulowania przebiegiem pandemii w zależności od zapotrzebowania politycznego. Przykłady tego mieliśmy w odniesieniu do testowania górników na Śląsku. Podobne przykłady płynęły z USA, gdzie w niektórych hrabstwach uzyskiwano 100% testów pozytywnych. Wyników testów PCR nie koreluje się z objawami chorobowymi, ani nie prowadzi się różnicującej diagnostyki, np. na zakażenia wirusem grypy. Test sobie i choroba sobie.\n.\nJak się więc znaleźć w tym testowaniu. Po prostu należy starać się unikać tego testowania. Niewiarygodne testy PCR do diagnostyki koronawirusa mają uwiarygadniać nieistniejącą pandemię tegoż wirusa, o ile on w ogóle istnieje. Wielu naukowców przypuszcza, że SARS-CoV-2 może być wirusem złożonym komputerowo na bazie wcześniej zsekwencjonowanych wirusów SARS. Należy pamiętać, że do tej chwili nie zsekwencjonowano wirusa SARS-CoV-2, który zostałby uzyskany z hodowli komórkowej. Oznacza to brak wzorca tego wirusa (brak złotego standardu). Wirusa tego nie uzyskano również w formie krystalicznej.\n(…)”\n.\nZa: https://stolikwolnosci.pl/wywiad-z-prof-romanem-zielinskim/\n.\nPs.\nW sieci jest wiele informacji o dużej ilości powikłań poszczepiennych w wielu krajach, gdzie szczepienia już wdrożono. Już same te informacje mogą człowieka przestraszyć, a każdego powinny zmusić do myślenia. Niemniej długofalowe szkodliwe skutki – i to nie „uboczne”, a zaplanowane i pożądane przez okupanta – większość zaszczepionych pozna dopiero po tygodniach, miesiącach czy nawet latach. I będą to skutki nieodwracalne.\n.\nCzuwaj.",
			"added": 1608946393
		},
		{
			"topic_id": 1609543281,
			"title": "CIEKAWY FILM",
			"body": "Warto obejrzeć. Cykliczne epidemie, 2020 - cowid, 1920 - cholera, 1820 - cholera. 1720 - \n.\nJASNA CHOLERA!! dziad ma DEJA VU epidemia.\n.\nhttps://www.youtube.com/watch?v=HMHcVDgHLk4",
			"added": 1609543275
		},
		{
			"topic_id": 1610039932,
			"title": "AMERYKA – AMERYKA.",
			"body": "2021: Kaskada awarii i upadków systemowych\n\nArtykuł Charlesa Hugh Smitha, analityka systemowego, z 3 stycznia 2021 r.\nChociaż 2020 jest powszechnie postrzegany jako „najgorszy rok w historii”, był on jedynie przekąską. Bankiet konsekwencji będzie serwowany w 2021. W roku ubiegłym systemy nie popsuły się całkowicie. Nastąpi to w roku bieżącym. Ich naprawa nie będzie już możliwa. Źródeł systemowej kruchości jest wiele:\n\n1.    Systemy bywają ściśle powiązane z innymi kruchymi systemami, co może wywołać upadek kaskadowy. Awaria systemu pojedynczego powoduje awarię każdego połączonego systemu współzależnego.\n2.    Systemy mogą zostać wydrążone przez wtajemniczonych graczy. Osoby te błędnie wierzą, że dany system można plądrować bez końca.\n3.    Systemy mogą zostać osłabione przez przewrotne zachęty, by inwestować coraz mniej w podstawowe funkcje, a uzyskane dochody przeznaczać na spekulacje i dodatki (m.in. skup akcji własnych i premie dla menadżerów).\n4.    Systemy mogą sprawiać wrażenie solidnych, ponieważ wtajemniczeni gracze maskują postępujący zanik funkcji, odpowiedzialności i przejrzystości.\n5.    Spadek funkcjonalności/wyników może być ukrywany za parawanem biurokratycznych niejasności ( np. w zestawieniach księgowych wszystkie ważne informacje widnieją w przypisach ) i w gąszczu złożoności, który redukuje odpowiedzialność niemal do zera – nikt nie jest winny zaniku funkcji, odpowiedzialności i przejrzystości.\n6.    Proces zastępuje wyniki jako Naczelna Dyrektywa systemu. Zasoby przeznaczone na podtrzymywanie procesów – a nie na uzyskiwanie wyników – stwarzają iluzję funkcjonalności, nawet w przypadku utraty zdolności ewoluowania i adaptacji.\n7.    Bufory, które umożliwiły skuteczne reagowanie na kryzys, zostają zdemontowane, ponieważ redundacja i odporność „szkodzą zyskom” lub „stanowią niepotrzebny wydatek”.\n8.   Wtajemniczeni gracze i opinia publiczna/klienci błędnie zakładają, iż pieniądze mogą uporać się ze wszystkimi słabościami systemowymi. Niestety, nie kupią one zaufania, kompetencji, instytucjonalnej głębi, produktywnych bodźców ani czegokolwiek innego, co jest niezbędne dla systemów odpornych.\n    Amerykanie są nieprzygotowani na upadek systemów węzłowych. Świecka wiara zakłada, że systemy węzłowe należące do korporacji, scentralizowana kontrola i nieustanne karmienie chciwości przynosi najlepsze rezultaty, ponieważ wzbogacanie się przy wykorzystaniu wszelkich dostępnych środków jest tym, co czyni systemy doskonalszymi.\n    Na nieszczęście dla USA jest odwrotnie : wzbogacenie się przy wykorzystaniu wszelkich dostępnych środków jest tym, co drąży i śmiertelnie osłabia systemy. Nieustanne karmienie chciwości ( m.in. poprzez „inwestowanie” w skup akcji własnych i zalegalizowaną grabież ) zniszczyło moralny fundament społeczeństwa i gospodarki: cnoty obywatelskie i dobro publiczne przestały istnieć. Puste frazesy nie przesłonią faktu, że Ameryka jest moralnym szambem. Naród zainfekowany konsumpcjonizmem i egoizmem nie jest w stanie dostrzec własnego moralnego rozkładu.\n    Zgodnie z cyklem życia biurokracji prywatnej lub publicznej początkowy cel organizacji, który zainspirował idealistycznych innowatorów i administratorów, jest stopniowo zastępowany przez własny interes, a ci, którzy byli skłonni poświęcić się temu celowi, rezygnują z obrzydzeniem lub są marginalizowani jako „zagrożenie” dla wyrachowanych socjopatów-oportunistów.\n    Ludzie kompetentni odchodzą lub są do odejścia zmuszani. U władzy pozostają jednostki niekompetentne w stopniu najwyższym, które wyselekcjonowano ze względu na lojalność wobec Naczelnej Dyrektywy: chronią dobrze poinformowanych grabieżców przed ingerencją z zewnątrz dzięki mistrzowskiemu opanowaniu arkanów public relations ( „zarządzania narracją” ).\n    Podstawową funkcją organizacji staje się maskowanie dysfunkcji, kostnienia, sklerozy i grabieży wewnętrznej. Utrata funkcji, odpowiedzialności i przejrzystości jest skrywana przed „wścibskimi oczami”, a odważni demaskatorzy – największe zagrożenie dla grabieżców-oportunistów – są prześladowani i niszczeni.\n    To nie przypadek, że amerykańskie „sektory wzrostu” to korupcja i public relations, ponieważ najlepszym sposobem na zatuszowanie systemowych patologii i niedomagań jest „zarządzanie narracją” poprzez tłumienie sprzeciwu i eliminowanie demaskatorów.\n    Większość Amerykanów nie zdaje sobie sprawy, że wiele systemów węzłowych znajduje się już w początkowym stadium upadku. Żaden sektor korporacyjny nie radzi sobie lepiej z maskowaniem dysfunkcji i spekulacji niż opieka zdrowotna. Upadek systemów prywatnej służby zdrowia zaskoczy wszystkich, którzy dali się uwieść jej efektownemu PR.\n    Cały system finansowy jest beznadziejnie zdemoralizowany, przeżarty partykularyzmem, opętany obsesją na punkcie maksymalizacji korzyści osobistych przy wykorzystaniu wszelkich dostępnych środków. Jedną z wielu potraw na bankiecie konsekwencji, która wprawi w zdumienie liczne grono biesiadników, będzie systemowa nieskuteczność uniwersalnego lekarstwa Rezerwy Federalnej na każdy problem: drukowania i przelewania kolejnych bilionów dolarów na konta nienasyconych finansistów i korporacji.\n    .\n    Opublikowano 7 stycznia, 2021 by exignorant\n. \nPs. To też dotyczy naszego kawałka ziemi. To są już naczynia połączone.\n.\nCzuwaj.",
			"added": 1610039925
		},
		{
			"topic_id": 1610316461,
			"title": "Zmartwię Was; to Kur#$two nie ma narodowości .",
			"body": ".\n Zmartwię Was; to Kur#$two nie ma narodowości .\n.\nZauważcie, że gdyby te wiadomości i plany o,  NWO,  miały by być tajne, to nie były by podawane do publicznej opinii. Skoro władza te wiadomości upublicznia to znaczy, że ma w tym jakiś cel aby ludzie o tym dowiedzieli się,  co nie?\n Poza tym nawet, ktoś kto nie zauważa tego wszystkiego, że są one publiczne? może jednak zauważyć, że nie demontuje się tych wiadomości. Lata śledzę te tematy w sieci i zauważałem, że najbardziej skłaniają do refleksji rzekomo nawróceni byli agenci systemu, którzy organizują prelekcje na których mówią jaki to jest zły system, jakie stosuje straszne techniki kontroli umysłów i tak w ogóle. \nCo najzabawniejsze szczególnie \"**nawróceni**\" tj. wtajemniczeni wyższe tryby systemu sami zaprzeczają temu co głoszą, bo np: -skoro techniki kontroli umysłów są tak groźne to jakim cudem oni z pod nich wydostali się. -skoro system jest taki zły i niebezpieczny? \nTo dlaczego jawnie działają przeciw niemu zdradzając jego kulisy,  i tutaj kto jest zdolny do samodzielnego myślenia użyje własnego rozumu zauważając, że każda mądra i bardzo silna **władza tworzy sobie sama opozycje**, którą kontroluje, bo to się opłaca. Ta strategia nazywa się - atak uprzedzający. **Opozycja i tak by powstała z czasem**, więc najlepiej stworzyć ją samodzielnie **kontrolując** to co i jak mówi, by mieć kontrolę nad tą opozycją. By - Ludzie podniecali się rzeczami całkiem nieistotnymi a na końcu by wymanewrować ich w pole,\n jak już się połapią o co chodzi, co jest grane: \n By mieć swojego guru, jakby kapłana w sieci. Oczywiście nie mieszam do tego autora tego kanału, bo on jest spoko koleś, ( *na to wygląda* ),  widać, że sam wyszukuje wiadomości nie dorabiając do tego jakiejś magicznej dziwnej ideologii, stworzonej przez system do manipulacji ciemnym tłumem owiec. Tworząc coś jak nową religie, gdy stary system już upadnie, aby w nowym też można kontrolować ludzi poprzez sam obieg informacji, odpowiednio wyprawszy im umysły. Tym co jest bardzo chodliwe, emocjonujące i tak ciekawe, że sami dalej przekazują  to sobie - np. tak zwane **teorie spiskowe**. Świat jest ciekawy, pozory mylą i czasem bywa odwrotnie, dlatego patrzcie na różne treści z dystansem, bez fanatycznego zaufania, nie dając się wciągnąć w grę  pozorów, które mogą często mylić. Czego dotyczy ten tekst?\nDotyczy filmów, które zostały zbanowane na YouTubie. Jest to już druga próba przechwycenia tego materiału filmowego. Jest to pięć części filmu, musiał on zostać podzielony. \nPo zainstalowaniu podam linki do tych filmów. \nNa -** YOUTUBIE PL**.\n**Cenzura działa, więc musimy się bronić**.\nCzuwaj.",
			"added": 1610316453
		},
		{
			"topic_id": 1610658422,
			"title": "PRZEJŚCIE – ETAPAMI – DO – NIEWIDZIALNOŚCI. .",
			"body": "PRZEJŚCIE – ETAPAMI – DO – NIEWIDZIALNOŚCI.\n.Jak stać się niewidzialnym w sieci internetu? nie jest to prosta sprawa, ale jest to możliwe do zrobienia. Wymaga to trochę samozaparcia, ale potem jest wspaniałe uczucie. Niema na to jednoznacznego przepisu, trzeba to wypracować samemu. Poniżej krótka lista, parę punktów które mogą być pomocne aby to osiągnąć. Liczy się tutaj własna inwencja, i pomyślunek, oraz przebiegłość. W związku z tym trzeba się zapoznać z tym materiałem, jest to lekcja poglądowa. Jak do tego się zabrać? Strona przeciwna, stara się nam to maksymalnie utrudnić i uniemożliwić. Ale nasz upór, jest krokiem do zwycięstwa.Dobrze jest się z tym zapoznać i zapamiętać. Znajomość przedmiotu, jest kluczem do sukcesu. Bardzo ważny jest ostatni punkt, zacznij nauczać innych, nie rób z tego tajemnicy. Podstawą jest niezależne myślenie, dlatego nie można podać gotowej recepty. Bo przeciwnik natychmiast poprawi system i go naprawi, usunie lukę, dziurę w systemie. To jest jedyna droga. ZAPAMIĘTAJ.\n. Oto jedno z wielu możliwych podejść, które możesz wypróbować ...\n.\n. Etap 1: Etap ankieta. - Witamy w zdecentralizowanym Internecie Rozejrzeć się. Staraj się niczego nie publikować. Najprawdopodobniej łatwo Cię wyśledzić. Skorzystaj z tego etapu, aby po prostu przyjrzeć się wszystkim szalonym, nielegalnym, wypaczonym, niegodziwości ludzkich serc i lustracji sfrustrowanych patriotów tęskniących za wolnością.\n. Etap 2: Pierwszy mały krok. - Odejdź od Big Brother Information Technology, która Cię śledzi. Możesz rozważyć wyjście z systemu operacyjnego Windows, przeglądarki Chrome, Edge i innych do opensource Linux Distro, takiego jak Debian lub Linux Mint. Przyzwyczaj się do technologii informacyjnej Opensource.\n. Etap 3: Etap Czołgania się. - Zainstaluj Tora i Zeroneta w swojej dystrybucji Linuksa. Naucz się montować pamięć i spróbuj uruchomić Zeronet na tej pamięci. Spróbuj użyć innej persony. Nie publikuj niczego szalonego. Nadal mogą wyciekać twoje dane, które można prześledzić z powrotem do Ciebie.\n. Etap 4: Spacer Etap. - Naucz się szyfrować dysk twardy lub jego fragmenty, np. Debian / luks / zulucrypt i spróbuj tam uruchomić Zeronet. Modlę się, abyś był patriotą, a nie pedo. Ponownie użyj innej persony. / osoby /.\n. Etap 5: Joga Etap. - poznaj Qubes OS. Zainstaluj Zeronet / Tor /\nWhonix na zaszyfrowanej partycji.\n. Etap 6: Etap uruchamiania. - Rozłóż zawartość, którą chcesz zachować,\naby zachować historię i informacje, które chcesz, aby ludzie znali.\nWidmo zła zawsze kłamie i szerzy propagandę. Pomóż zachować prawdę ,\ni dzielić się prawdą. Inwestuj i udostępniaj terabajty i petabajty danych.\n. Etap 7: Przekaż pałeczkę. - Dowiedz się jak najwięcej o IT i przeszkol innych. Wolność nie jest za darmo. Nauka i nauczanie następnego pokolenia będzie cię kosztować czas. Informacja to potęga. Big Tech to ma. Patrioci tego nie maja. Jeśli to się nie zmieni? Najprawdopodobniej pozostaniemy niewolnikami dalej. \n.\nCzuwaj.",
			"added": 1610658413
		},
		{
			"topic_id": 1610847501,
			"title": "BANDYCKI - SYSTEM - BANKOWY.",
			"body": "Jeszcze raz o złodziejskim, bandyckim wręcz systemie bankowym…\n.\n\n99% populacji to owce przeznaczone do strzyżenia w czasie pokoju i na rzeź w czasie wojny. Politycy i biurokraci to owczarki. Właścicielem farmy jest światowa finansjera\n.\nNadal bez zastrzeżeń popieram góralskie veto i Sebastiana Pitonia, niemniej fragment tego filmu, gdy była rozmowa o drukowaniu pieniędzy (od ok. 20 minuty) po prostu mnie rozzłościł. Sebastian Pitoń ma raczej mgliste i błędne pojęcie o kreacji pieniądza (drukowaniu go), a gospodarz programu jest w tej kwestii kompletnie zielony. Poziom wiedzy ekonomicznej, a zwłaszcza znajomość funkcjonowania bandyckiego systemu bankowego jest w Polsce katastrofalnie niska.\nOtóż obaj rozmówcy wielokrotnie mówili o tym, że rząd drukuje pieniądze i ubolewali, że jest to złodziejstwo. A przecież od oszukańczej tzw. „transformacji” rządzące z nadania okupanta Polską ekipy nie mają prawa do drukowania, a raczej kreacji pieniądza. Samo drukowanie nie ma znaczenia w tym sensie, że np. zniszczone banknoty trzeba zastąpić nowymi i je ktoś musi drukować. Należy więc mówić o kreacji pieniądza i sposobie puszczania go w obieg. W czasach PRL monopol na kreację pieniądza miały władze, przez co były pod tym względem suwerenne. W przeszłości, przez tysiąclecia przywilej kreowania pieniądza (bicia monet) przysługiwał wyłącznie władcom, rządzącym. Obecnie na całym zachodzie monopol ten należy do banksterów, którzy stworzyli system kreacji pieniądza, będący niezwykle bezczelnym, wręcz zuchwałym bogaceniem się banksterów i ograbianiem całych państw.\nJest w sieci film pt. Pieniądze jak dług. Trwa ponad 2 godziny, zrobiony jest jednak fatalnie.\n\nWdaje się niepotrzebnie w drugorzędne „techniczne” szczegóły zacierając najważniejsze cechy tego bandyckiego procederu. Po jego obejrzeniu człowiek może być jeszcze głupszy niż przed jego obejrzeniem.\n.\nNo więc – jak funkcjonuje system bankowy zachodu. Zacznijmy od tzw. „kredytów”. Napisałem „tzw.”, gdyż w rzeczywistości owe „kredyty” są tworzeniem pieniędzy z powietrza, które w bezczelny sposób gigantycznie wzbogacają banksterów. Tych prawdziwych banksterów – właścicieli banków. A nie dyrektorów banków, którzy są tylko ich urzędnikami. Wprawdzie ich zarobki są wysokie, ale przy zyskach banksterów pensje dyrektorów to tylko „kieszonkowe” czy „napiwek”.\n.\nJak powinno wyglądać uczciwe przyznawanie kredytów w uczciwym systemie bankowym? Mniej więcej tak: powiedzmy, że idę do banku po kredyt w wysokości 100 000 zł. Bank ma własny kapitał w wysokości 1 000 000 zł. Bankier przyznaje mi kredyt, przelewa na moje konto 100 000, odpisując je z własnego konta (stanu posiadaniu banku). Na koncie banku pozostaje więc 900 000 zł. Po udzieleniu mi kredytu w księdze rachunkowej bankier zapisuje: stan posiadania banku – 900 000 zł., a w rubryce „dłużnicy” moje imię i nazwisko oraz pożyczoną mi kwotę – 100 000 zł. Tak więc bank po udzieleniu mi kredytu ma nadal 1000 000 zł – 900 000 na swoim koncie i 100 000, które muszę mu zwrócić, u mnie. Muszę naturalnie zapłacić jeszcze odsetki – powiedzmy 10 % czyli 10 000 zł. Tak więc na koniec bank ma 1 000 000 + 10 000 odsetek. I tyle wynosi zysk banku z racji udzielenia mi kredytu – 10 000 zł. Można to przedstawić jeszcze bardziej obrazowo: idę po 100 000 kredytu do banku. Bankier idzie do skarbca, bierze z sejfu 100 000 i mi je wręcza. W sejfie zostaje mu 900 000. Gdy zwrócę kredyt, będzie miał ponownie 1 000 000 – plus 10 000 zysku z tytułu odsetek.\nObecny złodziejski system przyznawania „kredytów” wygląda tak: idę do banku po 100 000 zł. Bankier przelewa mi je na konto. Ale z konta banku nie odpisuje przelanych mi pieniędzy. Nadal ma na swoim koncie 1 000 000 zł. Ale w rubryce dłużnicy zapisuje moje imię i nazwisko i wysokość przyznanego mi kredytu – 100 000 zł. Czyli ma bank razem 1 100 000 – 1 000 000 na swoim koncie i 100 000 u mnie – do oddania. A gdy je oddam razem z odsetkami bank będzie miał 1 110 000 złotych. Na przyznanym mi kredycie zarobił więc 110 000 zł. Opisując to jeszcze bardziej obrazowo wyglądałoby to tak: idę do banku po kredyt 100 000 zł. Bankier idzie, ale nie do skarbca, a do pokoju z drukarką. Tam drukuje 100 000 zł i mi je wręcza. I te wydrukowane pieniądze muszę mu zwrócić – wraz z odsetkami, na zapłatę których bank pieniędzy już nie drukuje.\nAby nie zarzucono mi, że zmyślam i przeinaczam funkcjonowanie bandyckiego systemu banksterskiego w sprawie tzw. „kredytów” przypomnę (o czym w przeszłości pisałem już na blogu) informację, jaką zamieścił przed laty w oficjalnej broszurze Deutsche Bank. Pisało tam na str. 88 tak:\n.\n„Im Eurosystem entsteht Geld vor allem durch die Vergabe von Krediten…”\n(„W systemie euro pieniądz powstaje przede wszystkim poprzez przydzielanie kredytów”.)\nhttps://opolczykpl.wordpress.com/2013/01/22/najwieksze-oszustwa-w-historii-ludzkosci/\n.\nW niemieckojęzycznej sieci zrobiło się głośno o tym:\n.\nDeutsche Bundesbank bestätigt, Geld entsteht aus Luft\n(Niemiecki Bank potwierdza, pieniądz powstaje z powietrza)\nhttp://alles-schallundrauch.blogspot.com/2010/03/deutsche-bundebank-bestatigt-geld.html\n.\nPrzez co broszurę zmieniono i usunięto z niej zapis o kreacji pieniądza w postaci przyznawania kredytów. Ale tak wygląda rzeczywistość. I teraz pomyślmy, bo gdy czytam publikowane przez załgane gazety listy „najbogatszych” ludzi na świecie, gdzie wymieniani mają majątki faktycznie duże, to jednak bierze mnie pusty śmiech:\nhttps://businessinsider.com.pl/rozwoj-osobisty/kariera/najbogatsi-ludzie-swiata-po-pandemii-wielkie-zmiany-w-rankingu/1e0tezr\n.\nIle posiadają pieniędzy rzeczywiście najbogatsi ludzie, nie wymieniani nigdy na tych listach – banksterzy? Ile zarobili na samej tylko Polsce w ostatnich 30 latach? Niewypłacalnie zadłużony jest budżet państwa, katastrofalnie zadłużone są województwa, powiaty, gminy i miasta. Kredyty od 30 lat zaciągają przedsiębiorcy mali i wielcy. Kredyty zaciągały i zaciągają setki tysięcy, jeśli nie miliony prywatnych osób – na domy, mieszkania, na kupno samochodu czy na urlop na Karaibach lub w Egipcie. Albo na spłatę poprzedniego kredytu. A że wszystkie te „kredyty” to tworzony z powietrza pieniądz, lądujący ostatecznie w kieszeniach właścicieli banków, zarobili oni tylko na Polsce i Polakach gigantyczne sumy idące w dziesiątki bilionów złotych. A Polska nie jest najbogatszym krajem na świecie. Ile banksterzy zarobili na usraelitach, Niemcach, Anglikach, Francuzach, Włochach, Szwajcarach, Duńczykach i innych? Ich zyski na podstępnie wyłudzonym przez Rothschildów & spółkę prawie kreacji pieniądza jako długu idą w tysiące bilionów dolarów, funtów szterlingów, szwajcarskich franków, euro (wcześniej marek, lirów, franków francuskich itp.). Przy czym zaznaczyć tu należy, że prawo tworzenia pieniędzy z powietrza i puszczania ich w obieg jako „kredytów” nie jest głównym sposobem ograbiania państw i ich mieszkańców, a jedynie jest podstawą przeogromnego bogactwa banksterów. Za ograbianie budżetów państw i ich mieszkańców odpowiedzialne są naliczane od „kredytów” odsetki. Opiszę to na prostym przykładzie.\n.\nWyobraźmy sobie małe wyspiarskie państewko. Liczy 1 000 mieszkańców. Jest egalitarne, w obiegu ma 1 000 000 złotych – średnio po 1 000 na głowę mieszkańca. Pieniądz jest ciągle w ruchu i nie znika poza granicami wyspy. Gospodarka jest państwowa, choć są i prywatne biznesy (sklepiki, restauracje, szewcy, malarze itp). Prywaciarze wydają zarobione pieniądze w innych sklepach, u innych rzemieślników, płacą za prąd itp. Państwo utrzymuje się z zysków osiąganych z państwowych firm, po czym wydaje je na pensje pracowników państwowych. Tak więc cały 1 000 000 złotych jest w ciągłym ruchu i nigdy nie znika. Nigdy na rynku nie brakuje pieniędzy. Jest i bank, ale państwowy. Udziela kredytów na niewielki procent. Zyski banku wracają do skarbu państwa.\nW pewnym momencie podstępny bankier Czerwona Tarcza chce skolonizować wyspę. Podstępnie udaje mu się osadzić we władzach skorumpowanych i uległych sobie ludzi. Wprowadzają zmiany. Oddają bank i prawo kreacji pieniądza banksterowi. Aby przekonać ludzi, że jest to dobry system, bankster drukuje 1 000 000 złotych i przydziela wszystkim mieszkańcom kredyt po 1 000 złotych na głowę. Wszyscy są zadowoleni, rozkręcają biznesy, budują nowe domy. W ciągu roku spłacają zaciągnięty kredyt. Ale na koniec muszą spłacić i odsetki – 10 %. Tyle, że bankster na spłatę odsetek nie dodrukował pieniędzy. Muszą więc mieszkańcy z własnych pieniędzy dać odsetki banksterowi. Łączna wysokość odsetek wyniosła 100 000 zł. Po ich spłaceniu w obiegu pozostało 900 000. Wszyscy nagle poczuli się niezadowoleni. Zaczęło brakować pieniędzy, gdyż każdy miał średnio 100 zł mniej w kieszeni. Musiano znów zaciągnąć kolejny kredyty. Bankster ponownie wydrukował 1 000 000 złotych i pożyczył mieszkańcom. Gdy po roku spłacili kolejny wydrukowany kredyt, a ponadto ponownie z własnych pieniędzy dali mu kolejne 100 000 zł tytułem odsetek, w obiegu pozostało 800 000 złoty. Brakowało więc jeszcze więcej pieniędzy niż spłacie pierwszego kredytu. Musieli więc brać kolejny kredyt. Łatwo jest wyliczyć, że po spłaceniu dziesiątego kredytu wraz z odsetkami mieszkańcom wyspiarskiego państewka pozostało w obiegu ZERO złotych. Bankster odsetkami ograbił ich doszczętnie. Mieszkańcy utracili cały 1 000 000 złotych, jakie posiadali przed przejęciem ich systemu bankowego przez Czerwoną Tarczę. Sam natomiast bankster w tym samym czasie wzbogacił się na nich o 11 000 000 złotych: 10 x 1 000 000 wydrukowanych kredytów, które mu zwrócono plus 10 x 100 000 spłaconych odsetek.\n.\nAby powyższa opowiastka odpowiadała rzeczywistości należy jeszcze ją uzupełnić. Gdy po kolejnych spłatach kredytów wraz z odsetkami brakować zaczynało pieniędzy, bankster zwlekał z kolejnymi kredytami wykupując krok po kroku zbankrutowane sklepy, restauracje i warsztaty. Wcześniejsi ich właściciele nadal w nich pracowali, ale już jako jego pracownicy najemni. Tyle, że zarabiali mniej, niż wcześniej, gdy byli właścicielami. Większość zysków bankster lokował w swoich skarbcach na rajskich wyspach podatkowych. Przejął też elektrownię, ujęcia wody pitnej, pocztę, telefony, linie kolejowe, szpital i szkoły. A w końcu, gdy mieszkańcy byli już całkiem zubożeni, zaczął wykupować od nich drogi, ziemię, lasy – słowem wszystko. Nim minęło kilka lat, wyspa stała się jego prywatną własnością, zaś wcześniej wolni jej mieszkańcy jego finansowymi niewolnikami i tanim ludzkim bydłem roboczym.\n.\nTak wygląda współczesna gospodarka i system gospodarczy i finansowy zachodu. Aby postawić ją na nogi, w pierwszej kolejności należy upaństwowić banki. Tylko w ten sposób można pozbawić złodziejskich banksterów źródła ich potęgi. Działalność banków powinna obejmować jedynie udzielanie rzeczywistych kredytów oraz prowadzenie kont klientów. Nadwyżka zysków z pobieranych opłat za prowadzenie kont i zbieranych odsetek odprowadzana byłyby do skarbu państwa i pieniądze te ponownie państwo mogłoby wykorzystać na pensje sektora publicznego, utrzymanie szkół, szpitali, wojska, policji itp. Banki muszą mieć całkowity zakaz prowadzenia jakichkolwiek spekulacji giełdowych i nadmuchiwania baniek inwestycyjnych. Kreację pieniądza musi posiadać wybieralny w uczciwych wyborach rząd. Jest to konieczne z różnych powodów. Gdyby dzisiaj upaństwowiono w Polsce banki, nadal by odpływały z Polski setki miliardów złotych rocznie. Wszak zbyt wiele działów gospodarki jest w obcych rękach. Zyski uzyskiwane przez obcych właścicieli wyprowadzane są z Polski i lądują na zagranicznych kontach właścicieli. Ciągły odpływ pieniądza z polskiego rynku musi być na bieżąco uzupełniany przez kreację nowego pieniądza, gdyż inaczej zabrakłoby pieniędzy w obiegu wewnętrznym. Przy czym ważnym zadaniem polskiego rządu powinno być możliwie maksymalne ograniczenia odpływu pieniądza z Polski. Wszystkie złodziejsko sprywatyzowane przedsiębiorstwa na fali tzw. „transformacji” muszą zostać ponownie upaństwowione. Zwłaszcza sprzedane za grosze obcym przedsiębiorstwa muszą stać się ponownie własnością Polski i Polaków. Generowane przez nie zyski wracałyby do budżetu. To posunięcie ogromnie by zmniejszyło odpływ pieniądza za granicę, przez co rząd nie musiałby tworzyć tylu nowych pieniędzy. Ale prawo do tego musi mieć, choćby po to, by finansować konieczne dla kraju inwestycje. Wykonawcami inwestycji musiały by być wyłącznie rodzime firmy. W ten sposób państwo bogaciłoby się i o nowe inwestycje, i o nowo wykreowane na nie pieniądze, pozostające w wewnętrznym obiegu. Zadaniem państwa musi być troska o to, by pieniędzy nie było ani za dużo, ani za mało.\n.\nSebastian Pitoń powiedział w pewnym momencie, że deflacja jest korzystna. Jest to nieprawda. Jest równie zła jak inflacja. Przy inflacji, zwłaszcza hiperinflacji, pojawia się zjawisko nadmiernego wykupowania towarów i chomikowania ich w myśl zasady – lepiej kupić coś dzisiaj, bo jutro będzie to droższe. Wywołuje to panikę na rynku, wykupywanie towarów i w efekcie daje puste półki w sklepach. Przy deflacji jest odwrotnie. Ludzie wstrzymują się z wieloma zakupami w myśl zasady – po co mam coś kupić dzisiaj, jeśli jutro kupię to taniej. Ale wtedy spada popyt, przedsiębiorstwa muszą zmniejszać produkcję, a nawet zwalniać pracowników, których państwo musi utrzymywać zasiłkami, co jest szkodliwe dla gospodarki i budżetu. Tak więc zarówno inflacja jak i deflacja są niekorzystne. Pieniądz musi mieć stałą wartość.\n.\nKolejna sprawa – jaki pieniądz: fiducjarny czy mający pokrycie np. w złocie. Bo znam wielu piewców konieczności wprowadzenia pieniądza mającego pokrycie w złocie. Jest to nonsens. Wielki kryzys w usraelu z roku 1929 wybuchł, gdy dolary miały pokrycie w złocie, co nie uratowało gospodarki usraela przed długotrwałym i głębokim kryzysem. Pieniądz fiducjarny, przy zdrowej gospodarce, wolnej od okradania jej przez banksterów, nie potrzebuje pokrycia w czymkolwiek. I bez pokrycia w złocie można mieć do niego zaufanie, pod warunkiem, że złodziejskie giełdy nie będą prokurowały kryzysów gospodarczych, a złodziejski prywatne banki nie będą drenowały rynku z pieniędzy oraz nie będą tworzyły baniek finansowych kończących się także kryzysami. Gospodarka może na zawsze uwolniona zostać od kryzysów. Warunkiem tego jest upaństwowienie banków i likwidacja złodziejskich giełd. I w takim systemie pieniądz fiducjarny nie tylko zawsze będzie stabilny, ale będzie też cieszył się zaufaniem ludności. A ono jest ważniejsze niż pokrycie pieniądza w złocie. Wszak złodziejskie giełdy manipulują i samą wartością złota, a także mogą wywołać kryzys mimo pokrycia waluty w złocie.\n.\nNa koniec jeszcze jedna sprawa: aby nie doszło do powtórki obecnego zniewolenia ludzkości, gdy znów bogacze skorumpują rządy, przejmą media i prawie całe majątki narodowe na prywatną własność, jak mamy to obecnie, konieczne jest wprowadzenie górnej granicy zarobków i posiadanego majątku. Natura ludzka jest słaba i prawie każdy bogacz prędzej czy później będzie chciał wpływać na politykę, będzie próbował przejmować kontrolę nad nią, mediami i gospodarką, by pracowały w jego interesach – by mógł się jeszcze bardziej bogacić i jeszcze bardziej kontrolować politykę, media i gospodarkę, a przez nie całe życie społeczne. Nie podaję żadnej konkretnej górnej granicy zarobków i posiadanego majątku. Może to być 10, 50 czy 100-krotność średniej krajowej. Im będzie niższa, tym mniejsze niebezpieczeństwo, że znów pojawi się klika bogaczy, która przejmie kontrolę nad całymi państwami. Niemniej taka górna granica jest konieczna, by nie narzucono ludzkości ponownie niewolnictwa jak obecnie.\n.\nopolczyk\n.\nPS\nTu wrócę jeszcze do listy rzekomo „najbogatszych” ludzi na świecie.\n.\nTak obecnie wygląda top 10 najbogatszych według Bloomberga, stan na 13 lipca (w nawiasie podajemy o ile wzbogacili się od początku 2020 r.):\n.\nJeff Bezos: 189 mld dol. (+74,5 mld)\nBill Gates: 116 mld dol. (+2,41 mld)\nMark Zuckerberg: 93 mld dol. (+14,6 mld)\nBernard Arnault: 92,6 mld dol. (-12,6 mld)\nSteve Ballmer: 76,8 mld dol. (+18,6 mld)\nLarry Page: 72,7 mld dol. (+8,11 mld)\nElon Musk: 70,6 mld dol. (+43 mld)\nSiergiej Brin: 70,4 mld dol. (+7,7 mld)\nMukesh Ambani: 70,2 mld dol. (+11 mld)\nWarren Buffett: 69,2 mld dol. (-20,11 mld)\nhttps://businessinsider.com.pl/rozwoj-osobisty/kariera/najbogatsi-ludzie-swiata-po-pandemii-wielkie-zmiany-w-rankingu/1e0tezr\n.\nLista ta nasuwa kilka refleksji. Wprawdzie dwóch z tych bogaczy utraciło sporo miliardów (nie powiadomiono ich, w co mają „inwestować”), ale ośmiu zarobiło wielokrotnie więcej. Najwięcej Bezos, który od 1 stycznia do 13 lipca, mimo lockdownu zarobił 74,5 miliardów dolców. W tym samym czasie miliony ludzi na świecie wpędzono w biedę i bankructwo. Czy jest to normalny świat, w którym jeden cwaniak należący do sitwy w kilka miesięcy zarabia sumę wystarczającą do uratowania przed bankructwem miliony drobnych przedsiębiorców, właścicieli kafejek, pizzeri, małych sklepików?\nTo pokazuje, jak chory zdegenerowany i po prostu złodziejski i bandycki jest współczesny zachodni żydo - banksterski kapitalizm. Należy go rozwalić i zbudować od zera system sprawiedliwy, bez milionów bankrutów i biedaków obok garstki złodziejskich banksterów i multimiliarderów.\n.\nPrzy okazji polecam jeszcze i te moje wcześniejsze wpisy:\n.\nhttps://opolczykpl.wordpress.com/2015/10/05/bajkolandia-i-era-bankstera/\nhttps://opolczykpl.wordpress.com/2019/11/17/christopher-jon-bjerknes-starozytny-zydowski-plan-przejecia-swiata-za-pomoca-lichwy/",
			"added": 1610847491
		},
		{
			"topic_id": 1611090757,
			"title": "MILCZENIE  OWIEC.",
			"body": "MILCZENIE  \"owiec\"?\n.\n. Kiedy zamknęli nam firmy, milczeliśmy.\n. Kiedy zabronili oddychać świeżym powietrzem, milczeliśmy. \n. Kiedy zamknęli szpitale przed chorymi, milczeliśmy. \n. Zamknęli nam cmentarze Skazali na śmierć przewlekle chorych Zabraniają spotkań w święta.\n.  Zamknęli nasze dzieci w domach, Zamknęli seniorów, Zabronili odwiedzać w szpitalu krewnych i bliskich, Zabronili matkom dostępu do dziecka po porodzie, Zabronili rodzicom odwiedzać chore dzieci \nw szpitalach, Zakładamy dzieciom szmaty na twarz generując choroby i hamując rozwój mózgu. Niszczymy im psychikę zabraniając wychodzenia z domu do godz. 16-ej, pozbawiając kontaktów\n z rówieśnikami, ucząc, że nie wolno zbliżać się do ludzi, nie wolno ich dotykać. Brak dotyku to zniszczenia w psychice. \nZabronili spotkań. Ustalili za nas, że będą wstrzykiwać chemię do naszych organizmów, Wprowadzili bezprawie, Pozbawili prawa do bycia - PODMIOTEM - prawa Pozbawili człowieczeństwa Pozbawili godności,\n - **A MY SIĘ NIE OBUDZILIŚMY** -  Naiwnie wierzymy, że to zaraz się skończy. Wbrew logice wierzymy notorycznym kłamcom, że kolejny raz nas nie oszukają. Negujemy fakty. Ileż razy pisałem, że będzie drugi lockdown na jesień, że będzie trzeci na wiosnę. Nie wierzyliście. Drugi już jest. Trzeci będzie. \nPotem czwarty. Cały następny rok będzie taki sam jak obecny. A potem kolejny. A Wy będziecie się nadal łudzić, że tym razem to już ostatnie zamknięcie. Wyłączcie telewizory.  Posłuchajcie mediów niezależnych.  Poszukajcie materiałów.  To wszystko jest zaplanowane od dawna.\n** FAŁSZYWE TESTY = FAŁSZYWA PANDEMIA **\nFałszywa pandemia = zasłona dymna ,  dla wprowadzania NWO , Możemy to powstrzymać masowymi gigantycznymi protestami. W przeciwnym razie będzie dokładnie to, co przewiduje scenariusz. \nW skrócie - wszystko co ważne na świecie jest ustalane przez światowe agendy, których nazwy ładnie brzmią, a które tak naprawdę służą do realizacji celów ustalonych i finansowanych przez globalistów. Oczywiście zawsze musi być jakaś zasłona dymna dla odwrócenia uwagi.  Kluczowe agendy to ,\nGrupa Bildeberg .\n( steruje politykami i mediami ), Bank Rozrachunków Międzynarodowych, ( co dwa tyg. spotkania szefów banków centralnych w Bazylei ), Światowe forum ekonomiczne, Światowe forum żywności, Światowa organizacja zdrowia. Wszystkie te agendy opłacane są przez Fundacje Rotschildów, Rokefelerów, Gejtsa, Morgana, Sorosa itd. Wystarczy poczytać, posłuchać, jakie tematy na tych agendach są poruszane. \nI tak w telegraficznym skrócie. \n1.  Fundacja Rokefelera – rok 2010 – dokument „Scenariusze przyszłości technologii i rozwoju międzynarodowego” – scenariusz - LOKSEPS -  przewiduje \n. a. Światowa pandemia\n. b. Wzmocnienie władzy wykonawczej \n. c. Regularne szczepienia \n. d. Całkowitą kontrolę społeczeństw przez państwo e. Maksymalną redukcję własności prywatnej \n. f. Przejście na pracę zdalną i nie wychodzenie z domów\n. g. Dochód gwarantowany w zamian za umorzenie długów ( po upadku firm )\n. h. Całkowity upadek branży turystycznej I ostatni punkt bardzo ciekawy w tym scenariuszu,\n a  mianowicie: \n. i. JESZCZE WIĘKSZY UCISK - ze strony rządów po zakończeniu pandemii \n2.  Światowe Forum Ekonomiczne założone przez Klausa Schwaba. Co Schwab postuluje?\n. a. Skanowanie mózgów jako warunek podróżowania \n. b. Wszczepianie czipów współpracujących z mózgiem Facet mówi o tym i na forum i napisał książkę w roku 2019 „Czwarta rewolucja przemysłowa” \n3.  Jakie były główne tematy Światowego Forum Ekonomicznego w tym roku ( lipiec 2020 ).\n Wielki reset żywności do roku 2030. Czyli co konkretnie? \n. a. Żywność modyfikowana genetycznie \n. b. Wycofanie mięsa i produkowanie sztucznego mięsa i białek \n. c. Wspomaganie lekami i chemią przemysłową oczywiście dla wspierania zdrowia Może w kontekście tego lepiej zrozumiecie ten cały ruch na temat wycofania hodowli bydła, norek nie tylko w Polsce ale i \nw Danii, w Norwegii, zamykanie już w tym roku w Chinach, wielkich farm hodowli zwierząt dzikich \n( aż 45 gatunków ) . Chodzi o całkowite uzależnienie człowieka od sztucznej żywności, która jest własnością globalistów. Oczywiście to wszystko dla \"naszego dobra\" i dla \"ratowania planety\" \nZabawne - sto lat temu Rokefeler i  sp-ka doprowadzili do zakazania konopi ,( na których cały świat się opierał - leki, odzież, żywność, tlen z lasów konopnych ), żeby zasypać świat plastikami i lekami na ropie \ni zamiast wycofać ten syf, ta sama zgraja proponuje syntetyczne jedzenie i jeszcze więcej chemii \"\ndla ratowania świata\" \n4. Co mówi WHO. Co chwila mówi coś innego, niejednokrotnie sobie zaprzecza, ale taki ma cel – dezinformować. Ale uważny obserwator wyłapie to co istotne. Pomimo szczepionki nie zmieni się system obostrzeń – to w ubiegłym tyg. W tym tygodniu jeden z dyr. zapowiedział trzecią falę covidu,\n a więc mamy już potwierdzenie tego, co w maju mówił Soros ( że będzie trzecia fala ),  czyli trzeci lockdown na wiosnę. Któż może to lepiej wiedzieć niż pomysłodawcy i twórcy pandemii?! \n5. Wielki reset. Na wiosnę wszyscy krzyczeli, że to teorie spiskowe. Dziś o wielkim resecie mówią wszyscy – reset gospodarki, reset systemu finansowego, reset żywności, reset cywilizacji i kultury bycia\n i zachowań międzyludzkich. Nie będzie własności prywatnej, obywatel będzie własnością państwa, \nnie będzie rodziny, o dzieciach decydować ma państwo – po to od lat 90 promuje się  - LGBT \ni rozbijanie rodzin. Mamy setki artykułów i postów a nawet książek w tym temacie \n6. Czy to teorie spiskowe? \n. a. W Chinach testuje się obecnie system totalnej kontroli obywateli przez 24-h / dobę – po co? \n. b. Elon Musk wyprowadza na orbitę kilkadziesiąt tysięcy satelitów dla sieci 5G.\n i kontroli każdego cm, Ziemi .\n. c. UE ogłasza,  Biometryczny Cyfrowy Dowód Tożsamości, oparty na technologii blockchain \ntej samej od krypto-walut i technologii 5G .\n. d. Coraz więcej informacji o tym, że bez szczepionki obywatel straci możliwość korzystania z komunikacji, ( kolejne linie lotnicze, ale to pójdzie dalej ) .\n. e. W,  UK pojawiają się informacje coraz częściej o tym, że „dwukrotny negatywny test na covid wykonany w tygodniu” będzie przepustką do wolności Rozumiecie to? Wykonasz dwa testy i oba wyjdą negatywnie to będziesz mógł wyjść z domu! I naród Jeszcze pewnie będzie dziękował władzy za przywilej wyjścia z domu, Czy Wy rozumiecie co się dzieje?! \n. f. E. Musk pracuje nad technologią Neuraling – czyli połączenie czip – mózg \n( dokładnie to proponuje wspomniany wcześniej, Klaus Schwab ) \n. g. MFW ( ten sam, który zapłacił państwom za wprowadzenie lockdown ),  poinformował na swoich stronach, że koniec pandemii nastąpi 31 marca 2025-r.  Zwróćcie uwagę na ten fakt i przestańcie się łudzić, że za miesiąc lub dwa, ten obłęd się skończy Śpijmy dalej. Zamiast wyjść z d..y, w której jako społeczeństwo się znaleźliśmy, szukajmy dalej jak się w niej urządzić. Czytam co chwila nawoływania w stylu „kupcie coś na wynos i wesprzyjcie restauratorów” , „kupcie znicze i wesprzyjcie … „.  \nA ja się pytam, czy restaurator zapłaci czesne w zamkniętym przedszkolu, czy ten od zniczy kupi bilet do zamkniętego kina, żeby wesprzeć właściciela? Ludzie – \n**OBUDŹCIE SIĘ. TO WSZYSTKO SIĘ DZIEJE NAPRAWDĘ**. Najwyższy czas stanąć w obronie wolności. Właściciele hoteli, restauracji, kin, dyskotek, fitness, przewoźnicy – branża turystyczna ma przestać istnieć. Ile lokdownów w kolejnym roku przetrzymacie? I będziecie za każdym razem prosić rząd o jałmużnę? Nie macie jaj? Nie macie godności? Nie macie, -  ODWAGI CYWILNEJ -? \nBoicie się ruszyć tyłek na protest? Będzie Wam lepiej jak zbankrutujecie? Nauczyciele – boicie się kuratorium?! Lekarze – boicie się Izby Lekarskiej? Prawnicy – boicie się Ziobry? \"Kowalski z Nowakiem\" - boicie się mandatu?! Jako ludzie - jako CZŁOWIEK - nie macie swojej godności?!    My nie mamy dziękować za to że \"poluzowali \" i dali nam trochę swobody ...mamy \n**BYĆ WOLNI. TO  NASZE  NIEZBYWALNE  PRAWO**   Czy Wy nie rozumiecie, że swoim dzieciom szykujecie niewolnictwo, że działacie przeciw sobie?! Kiedyś wasze wnuki zapytają każdego z Was / Nas - „dziadku, gdzie byłeś jak wprowadzali niewolnictwo?!’  I co powiemy, że ukryliśmy ze wstydu twarz, \nza szmatą, bo nie mieliśmy odwagi,  **BYĆ CZŁOWIEKIEM**?!  \n. Źródło: Jerzy Makara. \nhttps://m.facebook.com/story.php?story_fbid=1036360613508029&id=100014023005572 \n. Ulotka szczepionki \nhttps://www.youtube.com/watch?v=0UD12ckMOqw&t=1228s \n. Pielęgniarka z epicentrum.\n  Rozmowa z Erin Marie Olszewski - napisy PL\n https://www.youtube.com/watch?v=C3XTy4sNnjA\n.\nCzuwaj.\n.",
			"added": 1611090746
		},
		{
			"topic_id": 1611128756,
			"title": "KRYPTO - WALUTY - BITCOIN.",
			"body": "KRYPTO – WALUTY.\n.\n**Miał inwestować w krypto-waluty. A że się nie znał na temacie zaproponowali pomoc przez „zdalny pulpit”. Wyciągnęli z jego konta ~170 000 PLN**\n.\nScenariusze oszustw ze „zdalnym pulpitem” są cały czas w „modzie”. Kiedyś pisaliśmy o całych podstawionych instytucjach finansowych:\nPani Marianna też zainteresowała się reklamą na Facebooku. Kliknęła, wypełniła potrzebne dokumenty. Skontaktował się ze mną pan z ukraińskim akcentem, pytając, czy słyszałam kiedyś o kryptowalucie bitcoin. Logo wydawało mi się podobne do tego, które ma jeden z banków. Pan Daniel poinformował mnie, że Agricole Trade jest powiązany z bankiem Credit Agricole.\nPotem odezwał się do mnie pan Dariusz, miał mnie wszystkiego nauczyć. Przesłał mi w e-mailu link do pobrania programu AnyDesk.\nObecnie podobne scenariusze są cały czas ćwiczone w takiej czy innej formie. W skrócie: „ma pan problem ze zrobieniem zlecenia na tę super atrakcyjną inwestycję w bitcoin. Dobra, proszę zainstalować oprogramowanie AnyDesk i zalogować się do banku – pomożemy”.\nI rzeczywiście – pomagają, ale w wyczyszczeniu konta ofiary:\nWczoraj, do Komendy Powiatowej Policji w Kołobrzegu, zgłosił się mieszkaniec Kołobrzegu, który oświadczył, że oszuści, wykorzystując jego dane, zaciągnęli pożyczkę w wysokości 168 tysięcy złotych. W rozmowie z mężczyzną policjanci ustalili, że zdecydował się na inwestycję na rynku kryptowalut. Zarejestrował się w witrynie internetowej. Po jakimś czasie otrzymał instrukcje, jak korzystać z programu umożliwiającego transakcje. Dodatkowo pokrzywdzony zainstalował na swoim komputerze aplikację, do której link otrzymał w wiadomości. Pobrana aplikacja dała przestępcom pełen dostęp do komputera i konta. Po pewnym czasie kołobrzeżanin otrzymał informacje ze swojego banku, że jego wniosek na kredyt został pozytywnie rozpatrzony.\n…..........................................\n**Ten pan miał na dysku 7500 Bitcoinów (~1 000 000 000 PLN). Oferuje brytyjskiemu wysypisku śmieci 25% znaleźnego**.\n.\nPewnie znacie historię „najdroższej pizzy świata„? Ktoś w 2010 roku kupił dwie pizze za 10 000 BTC (wtedy było to… kilkadziesiąt USD). Obecnie to astronomiczna kwota.\nAle wracając do ciekawostki z tytułu – w 2013 James Howells wyrzucił dysk z portfelem zawierającym 7 500 BTC ( wtedy była to nieznaczna wartość – obecnie to prawie miliard PLN ).\nTeraz zastanawia się czy można jeszcze go odzyskać. Dlatego też zaoferował miastu pewien układ: w przypadku znalezienia dysku i odzyskania z niego Bitcoinów – walijskie miasto Newport miałoby dostać 25%  - znalezionej sumy. \nWłaściciele wysypiska nie chcą się zgodzić na akcję: mała szansa powodzenia, duże koszty. \nA co więcej, nawet po zlokalizowaniu dysku, szansa odzyskania czegoś z niego jest raczej mała\n ( po 7 latach na wysypisku ). A może nie mała? Czekam na ciekawe komentarze w tym temacie :-)\nW tej okolicy ponoć znajduje się tytułowy dysk:\nWYSYPISKO ŚMIECI. \n.\nJaki można do tego dodać komentarz?**OSZCZĘDZAJCIE W BITCOINY**",
			"added": 1611128744
		},
		{
			"topic_id": 1611351944,
			"title": "- SZCZEPIONKA ?",
			"body": "**Bardzo Ważny Tekst – Może uda mi się uratować jakiegoś niezdecydowanego przed szaleństwem szczepień **\n.\n„Szczepionka MRNA przeciwko koronawirusowi” zdecydowanie nie jest szczepionką! Co to jest?\nTo NIE jest szczepionka. Szczepionka mRNA COVID używana obecnie do celów wojskowych w wielu krajach na całym świecie NIE JEST szczepionką. Powtarzam: to nie jest szczepionka.\nTo wiele rzeczy, ale szczepionka nie jest . Musimy uświadomić sobie, że oszustwo COVID szybko przyspieszyło technokratyczne i transhumanistyczne aspekty Nowego Porządku Świata (NWO) do tego stopnia, że ​​ludzie ślepo ustawiają się w kolejce, aby otrzymać „leczenie”, które jest również urządzeniem chemicznym. , system operacyjny, urządzenie do produkcji patogenów syntetycznych i patogenów chemicznych. Jak opisano w poprzednich artykułach\nTen nowy wirus COVID to zupełnie nowa technologia, potencjalnie nawet bardziej niebezpieczna niż konwencjonalna toksyczna szczepionka. W tym artykule przyjrzymy się bliżej, czym jest ta szczepionka mRNA.\nDr David Martin i Judy Mikovits ujawniają, dlaczego tak zwana szczepionka COVID nie jest szczepionką\nPosłuchaj tego krótkiego fragmentu z udziałem dr Davida Martina i Judy Mikowitz (którzy do tej pory bardzo otwarcie ujawniali epidemię COVID) rozmawiających z Robertem Kennedym Jr. i adwokatem Rocco Galati, który reprezentuje kanadyjską grupę wolnościową pozywającą rząd. za całe oszustwo COVID.\nDavid Martin poczynił kilka niezwykle ważnych obserwacji, że nie możemy dokładnie zidentyfikować urządzenia, które Moderna i Pfizer promują jako szczepionkę, ponieważ nie jest to szczepionka z medycznego lub prawnego punktu widzenia:\n„To nie jest szczepionka… używając terminu„ szczepionka ”w odniesieniu do tej rzeczy w ramach wykluczeń związanych ze zdrowiem publicznym… To mRNA, które jest upakowane w błonie tłuszczowej, która jest dostarczana do komórki. Jest to wyrób medyczny przeznaczony do stymulowania przemiany komórki ludzkiej w twórcę patogenu.\nTo nie jest szczepionka! Szczepionki są w rzeczywistości prawnie zdefiniowanym terminem … zgodnie z prawem zdrowia publicznego … zgodnie ze standardami CDC i FDA, a szczepionka musi specyficznie stymulować zarówno odporność osoby, która ją otrzymuje, jak i hamować przenoszenie …\nStwierdzili bardzo jasno, że nić mRNA, która wniknie do komórki, nie powinna przerywać transmisji. To jest lekarstwo. Ale gdyby omawiano to jako leczenie, nie spotkałoby się to z sympatią władz zdrowia publicznego, ponieważ wtedy ludzie powiedzieliby: „Jakie są inne metody leczenia?”.\nUżycie terminu szczepionka jest bezwstydne … ponieważ w rzeczywistości jest to bezużyteczny cios dla otwartego i swobodnego dyskursu …\nModerna zaczynała jako firma zajmująca się chemioterapią raka, a nie jako producent szczepionki SARS … gdybyśmy powiedzieli, że zamierzamy podawać ludziom zapobiegawczą chemioterapię raka, których nie mają, byłbyś wyśmiewany z pokoju, ponieważ to głupi pomysł.\nTo jest dokładnie to! Jest to urządzenie mechaniczne w postaci bardzo małego pakietu technologii, które wprowadza się do organizmu człowieka, aby aktywować komórkę, która stanie się miejscem produkcji patogenów.\nJedynym powodem, dla którego używa się terminu [szczepionka], jest nadużycie sprawy Jacobsena z 1905 r., Która została zniekształcona od czasu jej napisania.\nGdybyśmy byli z tym szczerzy, nazwalibyśmy to tak, jak jest: jest to urządzenie patogenu chemicznego, które jest tak naprawdę zaprojektowane, aby wywołać działanie chemiczne wytwarzające patogen w komórce.\nJest to wyrób medyczny, a nie lek, ponieważ spełnia definicję urządzenia CDRH [Center for Devices and Radiological Health].\nZostał zaprojektowany, aby wywołać chorobę … 80% osób podejrzanych o kontakt z wirusem [SARS-Cov-2] nie ma żadnych objawów … 80% osób, którym wstrzyknięto tego wirusa, ma kliniczne skutki uboczne.\nOtrzymujesz substancję chemiczną w celu wywołania choroby, a nie odpowiedzi immunologicznej. Innymi słowy, nic w tym nie powstrzyma cię przed przekazaniem czegokolwiek. Chodzi o to, żebyś zachorował, a twoje własne komórki są tym, na co chorujesz. ”\nJudy Mikowitz jest również zaangażowana:\n„To syntetyczny patogen. Dosłownie wstrzyknęli tę chorobotwórczą część wirusa do każdej komórki ciała … w rzeczywistości może bezpośrednio powodować stwardnienie rozsiane, chorobę Lou Gehriga, chorobę Alzheimera … może powodować przyspieszony rozwój raka … to właśnie wyraża ten fragment wirusa. … robią to od dziesięcioleci ”.\n„Szczepionka MRNA przeciwko koronawirusowi” zdecydowanie nie jest szczepionką! Co to jest?\nSzczepionka COVID to system operacyjny, mówi Moderna\nSzczepionka COVID mRNA to system operacyjny, który może zaprogramować Twoje DNA, a tym samym zaprogramować Cię na poziomie podstawowych obwodów.\nCzy to przesada? Nie, nie jest. Moderna podaje na swojej stronie internetowej, że ich platforma technologiczna mRNA to „oprogramowanie na całe życie” i „działa podobnie jak system operacyjny na komputerze”. To jest prosto z ich strony internetowej:\n„Został zaprojektowany w taki sposób, że można go podłączyć i grać zamiennie z różnymi programami. W naszym przypadku „program” lub „aplikacja” to nasz preparat mRNA – unikalna sekwencja mRNA, która koduje białko ”.\nPlan gry: przekształcenie każdej osoby w cyfrowy węzeł w sieci sterowania\nSzybko wkraczamy w świat transhumanizmu, w którym nasze naturalne ciała biologiczne są wychwytywane i impregnowane częściami syntetycznymi, zaczynając od nanocząstek. Kontrolery NWO chcą załadować jakiś system biurowy Microsoft lub oprogramowanie do twojego ciała i mózgu i połączyć cię z chmurą JEDI i / lub Amazon-CIA, aby mieć bezpośredni dostęp do twojego mózgu.\nMogą wtedy wypuszczać „szczepionki”, które nie są szczepionkami, abyś był na bieżąco , tak jak oprogramowanie komputerowe jest regularnie aktualizowane. Wirusy, prawdziwe lub nie, i szczepionki, prawdziwe lub nie, są tylko środkami do tego celu.\nZamiana ludzi na towary za pomocą waluty kredytu społecznego\nAlison McDowell podsumowuje obecną najbardziej prawdopodobną transhumanistyczną ścieżkę NWO, która obejmuje kredyt społeczny, 5G, inteligentną sieć i sztuczną inteligencję, aby zwiększyć globalną zgodność:\n„W ramach systemu technologicznego pozbawionego logiki wymagana będzie pełna zgodność. Zatwierdzone zachowanie staje się walutą, jest tokenizowane w łańcuchu bloków i kontrolowane przez czujniki i sztuczną inteligencję.\nPrzygotowują nas na przyszłość, w której rywalizujemy między sobą, aby zobaczyć, kto jest najlepszy, najbardziej posłuszny.\nPrzetrwanie będzie oznaczało przestrzeganie ścisłych umów finansowych psychopatii. Aby uzyskać dane potrzebne do potwierdzenia twierdzeń zawartych w perwersyjnych umowach płatnych za sukces, nasza matka Ziemia musi zostać przekształcona w odizolowane geograficznie cyfrowe więzienie za pomocą 5G i konstelacji satelitarnych.\nWszystkie Twoje dane zostaną dodane do Twojej „trwałej dokumentacji”, aby ocenić Twoją wartość jako kapitału ludzkiego dla portfeli inwestorów. Miliarderzy widzą przyszłość, w której wolność jest przywilejem ograniczonym przez nich samych, ich funkcjonariuszy i roboty, które kontrolują.\nTo ponura przyszłość, ale nie jest ona wyryta w kamieniu. Całkowicie zgadzam się z McDowellem, że NIE powinniśmy akceptować tego jako naszego przeznaczenia ani doświadczać tak bolesnych ram czasowych, JEŚLI możemy szybko się obudzić i zmienić.\nMusimy jednak najpierw przyznać, że jest to prawdopodobna ścieżka, którą podążamy. Cokolwiek można powiedzieć, ale taka jest obecna trajektoria. Jak możemy to zmienić? Najpierw zajrzyj do środka. Aby zmienić siebie, musimy zmienić nasz wewnętrzny świat i nasze postrzeganie, a tym samym naszą rzeczywistość:\n„Ta planowana przyszłość NIE jest jednak z góry określona. Transhumanizm totalitarny nie jest przesądzony. Lekarstwo Trudell? Zmień nasze postrzeganie rzeczywistości poprzez aktywny brak współpracy.\nManifestuj w naszych sercach, umysłach i działaniach pokój, jakiego pragniemy. Jeśli tworzą podróż, intencja CONNECT; nie tylko między sobą, ale ze WSZYSTKIMI naszymi związkami, ziemią i istotami duchowymi, które istnieją poza naszymi zmysłami. Musimy się zsynchronizować, aby zmienić rzeczywistość wibracyjną, a ta siła istnieje w nas, dzieciach ziemi ”.\nTo nie jest frywolna paplanina, ale raczej uświadomienie sobie, że uczestniczymy w tworzeniu koszmarnego świata, pozwalając zaprogramować naszą percepcję, aby wyzwolić NWO. Wykorzystują do tego naszą energię! Aby odzyskać naszą suwerenność, musimy odzyskać naszą percepcję, niszcząc nasze wrodzone programowanie.\nKońcowe myśli: technokratyczne, transhumanistyczne narzędzie\nWażne jest, aby wiedzieć i powiedzieć innym, że obecna szczepionka COVID mRNA nie jest szczepionką.\nDzieje się tak nie tylko dlatego, że szczepienie daje firmie Big Pharma prawną odporność na krzywdę, ale ze wszystkich powodów wymienionych powyżej.\nTe urządzenia zostały zaprojektowane tak, aby przeprogramować Cię na poziomie podstawowym. To nie są szczepionki, nie są lekami i moim zdaniem nie są lekarstwem ani lekarstwem.\nChoć te terminy są przerażające, nie nazwałbym ich po prostu urządzeniami chemicznymi, systemami operacyjnymi , patogenami syntetycznymi i urządzeniami do wytwarzania patogenów chemicznych, co jest już dość jasne i straszne.\nNazwałbym je technokratycznymi, transhumanistycznymi narzędziami, które na zawsze zmieniły twoją genetykę i zmieniły cię w syntetycznego człowieka.\nSymbolizują one, jak szybko program Nowej Wojny Światowej manifestuje się w naszej fizycznej rzeczywistości i miejmy nadzieję, że jest to wezwanie do przebudzenia dla wszystkich, aby zrobili wszystko, co w ich mocy, aby powstrzymać ten mroczny, nikczemny plan, póki jest jeszcze czas.\n*\nUwaga dla czytelników: kliknij przyciski Udostępnij powyżej lub poniżej. Prześlij ten artykuł do swoich list mailingowych. Crosspost na swoim blogu, forach internetowych. itp.\nTen artykuł pierwotnie ukazał się w The Freedom Artykuły.\nMakia Freeman jest redaktorką alternatywnych mediów / niezależnego serwisu informacyjnego The Freedom Articles, autorką książki Cancer: The Lies, the Truth and the Solutions oraz starszym badaczem w ToolsForFreedom.com. Makia jest na Steemit i Parler.\n.\nPs. Pozostawiam bez komentarza.",
			"added": 1611351931
		},
		{
			"topic_id": 1611505742,
			"title": "WOJNA Z NARKOTYKAMI.",
			"body": "Wojna z narkotykami - TO FIKCJA.\n.\nFragment wywiadu z prof. Noamem Chomsky’m\n.\n**Kontrolowanie ludności**\nTermin „kontrolowanie ludności” pochodzi z literatury opracowanej za kadencji Johna F. Kennedy’ego, która instruowała, jak należy tłumić ruchy reformatorskie. Głównymi celami amerykańskich „działań przeciw-powstańczych” były ówcześnie Azja Południowo-Wschodnia i Ameryka Łacińska, gdzie wzmagał się ferment społeczny. Tamtejsi obywatele wspierali siły wzywające do głębokich zmian, których przywództwo Stanów Zjednoczonych po prostu nie tolerowało. Ludzi można „trzymać w ryzach” na różne sposoby, zatem z jednej strony stosowano terror (bombardowania napalmem itd.), z drugiej propagandę i obozy koncentracyjne. Propaganda połączona z przemocą jest skuteczniejsza.\nJako rządzący konfrontujesz się z tym samym problemem we własnym kraju. Społeczeństwo stale przejawia skłonność do niesubordynacji. Musisz podjąć stosowne kroki, aby pozostało biernym, apatycznym i posłusznym. Nie będzie wówczas ingerować w sprawy tych, którzy mają wpływy i władzę. To pierwszoplanowy temat współczesnej demokracji. Rozbudowa mechanizmów demokracji, chociażby prawa wyborczego i wzrostu, potęguje potrzebę nadzorowania mas przy użyciu innych narzędzi.\nEkspansja korporacyjnej propagandy w USA przebiega równolegle z rozwojem demokracji. Powodów nie okrywa tajemnica; omawiane są otwarcie w literaturze biznesowej i akademickich czasopismach poświęconych tematyce społecznej. Zgodnie ze standardową frazeologią chodzi o to, by „toczyć nieustającą batalię o ludzkie umysły” – indoktrynować i organizować masy na wzór armii. Umożliwiają to środki kontroli populacji. Ta inżynieria „produkowania zgody” jest esencją demokracji, ponieważ dzięki niej ignoranckie i wścibskie osoby z zewnątrz – czyli my, naród – nie przeszkadzają „ludziom poważnym”, którzy zajmują się sprawami publicznymi, mając na względzie interes jednostek uprzywilejowanych.\nZastraszanie sprawdza się w przypadku zarówno dyktatury wojskowej, jak i demokracji. Przestraszeni obywatele bez protestu pozwolą, by władza kierowała ich życiem w zamian za bezpieczeństwo i ochronę. Tak więc strach przed narkotykami i przestępczością jest intensywnie stymulowany przez propagandę państwową i biznesową. Narodowa Komisja Sprawiedliwości wielokrotnie podkreślała, że dość wysoki poziom przestępczości w Stanach Zjednoczonych mimo wszystko nie odbiega znacząco od wskaźników reszty społeczeństw uprzemysłowionych. Za to strach przed przestępczością jest o wiele większy niż w innych krajach. Generując go, Wojna z narkotykami pozwala na bezpośrednią kontrolę tzw. klas niebezpiecznych, czyli „ludzi zbędnych”, którzy tak naprawdę nie pełnią funkcji pomnażającej zyski. Trzeba coś z nimi zrobić. W USA wsadza się ich do więzienia.\nPolityka gospodarcza lat 80. szybko pogłębiła nierówności ekonomiczne. Plony umiarkowanego wzrostu gospodarczego zebrali nieliczni. Górne kilka procent populacji pomnożyło posiadany kapitał. Od lat 70. dochody najzamożniejszych rosły, a średnie zarobki cechowała stagnacja lub gwałtowna redukcja. Ogromną rzeszę ludzi dotknęła finansowa niepewność, trudności i ubóstwo. Duża jej część skończyła w celach w ramach akcji kontrolowania ludności. Wystarczy przyjrzeć się trendom związanym z marihuaną. Jej popularność osiągnęła swój szczyt w późnych latach 70. Kryminalizacja praktycznie nie istniała. Za samo posiadanie „zioła” nie karano więzieniem, ponieważ konsumentami byli „mili ludzie”, tacy jak my, dzieci dobrze sytuowanych rodziców. Nie zamyka się ich w klatkach, podobnie jak dyrektorów korporacji, mimo że przestępstwa korporacyjne są nieporównanie bardziej kosztowne i niebezpieczne od przestępstw ulicznych. W latach 80. popyt na używki wśród osób bardziej wykształconych zaczął maleć. Palenie marihuany i tytoniu, picie alkoholu i kawy utrzymywało się na niezmienionym poziomie w społecznościach biednych – zwłaszcza czarnej i latynoskiej.\n**Niewolnictwa ciąg dalszy**\nKiedy wywołujesz Wojnę z narkotykami, wiesz dokładnie, kogo zamierzasz zgarnąć: ubogich ciemnoskórych. Nie będziesz aresztował majętnych białych. Organy ścigania nie interesują się nimi. Na przedmieściach wyższej klasy średniej, gdzie mieszkam, policja nie wywarza drzwi obywatelom, którzy w domowym zaciszu wciągają kokainę. W okresie, w którym wprowadzano wspomnianą strategię gospodarczą, odsetek więźniów rósł raptownie, a przestępczość odnotowywała tendencję spadkową. U schyłku lat 80. staliśmy się absolutnym światowym liderem pod względem liczby osadzonych.\nPrzetrzymywanie młodych, ciemnoskórych mężczyzn w zakładach penitencjarnych przynosi zyski licznej grupie beneficjentów. Mamy do czynienia z przemysłem państwowym. W latach 30. każdy przedsiębiorca zrozumiał, że prywatna gospodarka kapitalistyczna nie przetrwa bez astronomicznych subwencji rządowych. W Stanach Zjednoczonych przekazywane są głównie za pośrednictwem kompleksu militarnego. Najbardziej dynamiczne aspekty gospodarki – komputeryzacja, Internet, lotnictwo czy farmaceutyki – bazują na armii.\nJednak to przemysł kontroli przestępczości – takim mianem określają go kryminolodzy – stanowi najprężniej rozwijającą się branżę w Ameryce. Oczywiście utrzymywany jest z pieniędzy publicznych. Jego składowe to budownictwo, nieruchomości, a także technologie zaawansowane. Ta gałąź gospodarki rozrosła się tak bardzo, że wykonawcy tych technologii, także wojskowych, widzą w niej potencjalny rynek zbytu dla technik kontroli i inwigilacji. Chodzi o monitorowanie prywatności za pomocą skomplikowanych urządzeń elektronicznych i superkomputerów: rozmów telefonicznych, a nawet moczu w pisuarach. Może faktycznie nadejść czas, kiedy to „zbędnych ludzi” będzie się zamykać w prywatnych mieszkaniach, a nie w więzieniach, i nadzorować, żeby nie zrobili czegoś niewłaściwego, nie powiedzieli czegoś niewłaściwego, nie udali się w niewłaściwym kierunku itd.\nNawet potentaci sektora „obronnego” są żywotnie zainteresowani więziennictwem – można o tym przeczytać w The Wall Street Journal. Podobne rzecz się ma z kancelariami prawnymi i domami maklerskimi: Merrill Lynch udziela niebagatelnych pożyczek na budowę więzień. Jeżeli weźmiemy pod uwagę cały system penitencjarny, pod względem skali dorówna on niebawem Pentagonowi. Słyszymy narzekania na temat pracy skazańców w Chinach, tymczasem u nas jest ona standardem. Więźniowie są wymarzoną siłą roboczą. Pracują prawie za darmo, nie organizują się, nie pytają o swoje prawa, a wszelkie przysługujące im świadczenia reguluje społeczeństwo. Oto „elastyczna” siła robocza, za którą tak bardzo przepadają ekonomiści: wykorzystujesz pracowników, kiedy są ci potrzebni, a wyrzucasz ich, kiedy ich usługi przestają być pożądane.\nTo stara amerykańska tradycja. Na początku XX w. w północnej Georgii, Kentucky i Alabamie dokonała się wielka rewolucja przemysłowa, której napędem była katorżnicza praca więźniów. Niewolnicy odzyskali wolność, ale tylko formalnie. Nie zdołali uciec przed tragicznym statusem. Po upływie kilku lat trafiali za kratki, by funkcjonować jako całkowicie podporządkowana siła robocza. Oto fundament nowoczesnej rewolucji industrialnej na Południu, która trwała w Georgii do lat 20., a w miejscach takich jak Missisipi do II wojny światowej. Tradycja ta odradza się. W więzieniach Oregonu i Kalifornii koncentruje się przemysł tekstylny zaopatrujący w ubrania m.in. Azję. Jedna z eksportowanych serii nosi nazwę „Więzienny blues”. Liczne branże eksploatują więzienne linie produkcyjne, w tym zaawansowane technologie, takie jak przetwarzanie danych. W stanie Waszyngton kadra Boeinga głośno protestuje przeciwko eksportowaniu miejsc pracy do Chin, ale prawdopodobnie nie jest świadoma, że są one eksportowane do pobliskich więzień, gdzie mechanicy harują dla Boeinga w warunkach, które z wiadomych względów budzą zachwyt członków zarządu koncernu.\nGros kobiet i mężczyzn skazano za posiadanie narkotyków. Za najszybsze w historii tempo przyrostu populacji więziennej odpowiadają wykroczenia narkotykowe. Ostatnie dane, które widziałem, pokazują, że ponad połowa więźniów federalnych i jedna czwarta stanowych to przestępcy narkotykowi. Przykładowo w stanie Nowy Jork za uliczną sprzedaż działki za 20 dolarów lub posiadanie uncji kokainy grozi taki sam wyrok, jak za podpalenie z zamiarem popełnienia morderstwa. Ustawa „do trzech aresztowań sztuka” doprowadzi do wykładniczego skoku liczby osadzonych. Nawet w przypadku, gdy trzecie zatrzymanie będzie dotyczyć jakiegoś drobnego wykroczenia narkotykowego, oskarżony zostanie zamknięty na dekady.\n**Inicjatywy antynarkotykowe**\nAmerykanie wydają 57 miliardów dolarów rocznie na nielegalne narkotyki. Organizacja Narodów Zjednoczonych próbuje monitorować międzynarodowy handel narkotykami. Według jej szacunków roczna jego wartość oscyluje w granicach 400–500 miliardów dolarów. To kwota wyższa niż w przypadku ropy. To 10% światowego handlu. Nie jest wiadomo, skąd pochodzi i pod jaki adres dociera większość tych pieniędzy. Z ogólnych wyliczeń wynika, że 60% przechodzi przez banki w USA. Potem duża część tej puli jest transferowana do „rajów podatkowych”. Mechanizm jest niejasny; nikt go nie śledzi, bo nikomu na tym nie zależy.\nDepartament Handlu co roku publikuje dane o bezpośrednich amerykańskich inwestycjach zagranicznych. W latach 90. z nieukrywanym entuzjazmem zasilano „nowe wschodzące rynki”, takie jak Ameryka Łacińska. Okazuje się, że jedna czwarta inwestycji kończy na Bermudach, 15% na Bahamach i Kajmanach, 10% w Panamie itd. Nie buduje się tam stalowni. W niewinnej interpretacji są to tylko „raje podatkowe”. W interpretacji mniej niewinnej są to miejsca, gdzie ukrywa się „brudne” fundusze. Żadna instytucja nie obejmuje ich dochodzeniem. Zadaniem Departamentu Sprawiedliwości jest ściganie w getcie czarnoskórego dzieciaka, który ma skręta w kieszeni.\nRząd USA wyświadcza przysługi handlowe i pomocowe państwom, które propagują tzw. inicjatywy antynarkotykowe. W rzeczywistości programy te dramatycznie eskalują zażywanie i produkcję narkotyków. W ostatnich latach taka eksplozja ogarnęła region Andów: Kolumbię, Peru i Boliwię. Dlaczego chłopi uprawiają tam kokę? Neoliberalna polityka dostosowań strukturalnych Banku Światowego i Międzynarodowego Funduszu Walutowego, którymi sterują elity Stanów Zjednoczonych, ma na celu zmuszenie chłopów do przestawienia się na eksport rolny, czyli produkowanie nie na potrzeby determinowane wielkością konsumpcji lokalnej, ale z myślą o sprzedaży za granicą. Instytucje te dążą do zredukowania świadczeń socjalnych, wydatków na służbę zdrowia i edukację, a także zmniejszenia deficytów rządowych poprzez zwiększenie eksportu. To samo robią z cłami, abyśmy mogli zalać rynki tych krajów subsydiowanymi amerykańskimi towarami, co w sposób oczywisty uderza w wytwórstwo rodzime.\nA teraz dodajmy to wszystko. Co otrzymamy? Zwyżkę kultywacji koki, która jest jedynym ratunkiem dla chłopów poszukujących przewagi komparatywnej. W Kolumbii amerykańska pomoc pod nazwą „Żywność dla pokoju” posłużyła do zniszczenia produkcji pszenicy. Artykuły żywnościowe – zafundowane przez amerykańskich podatników – rozdawali agro-eksporterzy. Cel został osiągnięty: lokalne źródła zaopatrzenia w pszenicę i kawę wyschły, producenci utracili możliwość ustalania rozsądnych cen. Rezultat końcowy był przewidywalny: poszukując alternatywy, zdesperowani rolnicy zwrócili się ku koce.\n**Sekretne wojny**\nPora wspomnieć o jeszcze jednym czynniku – sekretnych wojnach. Analizując historię CIA, czyli Białego Domu, odkryjemy, że za tajnymi działaniami wojennymi ciągnie się narkotykowy ślad. Jego początek sięga powojennej Francji. Establishment USA usiłował przywrócić tradycyjny porządek społeczny, zrehabilitować faszystowskich kolaborantów, zniszczyć ruch oporu i związki zawodowe. Najpierw odbudował struktury mafijne, by mogły one świadczyć pożyteczne usługi – np. łamać strajki. Mafia nie robi tego dla zabawy, a zatem konieczne było zawarcie kompromisu: gangsterzy uzyskali zgodę na reaktywowanie systemu produkcji heroiny. Rozmontowali go wcześniej faszyści, którzy będąc drużyną wzorowo zorganizowaną, sprawnie eliminowali konkurencję. Amerykanie wskrzesili przemysł narkotykowy, najpierw w południowych Włoszech, a następnie w południowej Francji, z mafią korsykańską u steru. Stamtąd pochodzi słynny „Francuski łącznik”.\nPrzez długi czas pełnił rolę węzłowego ośrodka handlu heroiną. Potem amerykański terror przeniósł się do Azji Południowo-Wschodniej. Do jego siania potrzebujesz lokalnych „wykonawców”, którzy cię wyręczą. Potrzebujesz też nieoficjalnego budżetu, aby ich sowicie wynagrodzić. Gdy na swoją listę płac wciągasz bandytów i oprawców, twoje opcje są ograniczone. Jedną z nich są narkotyki. Złoty Trójkąt, którego „wierzchołkami” były Birma, Laos i Tajlandia, zamienił się w obszar intensywnej produkcji narkotyków przy wsparciu Waszyngtonu, który toczył swoje sekretne wojny przeciwko ludności tych państw. Przesłuchania kongresowe dotyczące afery Iran-Contra częściowo ujawniły kulisy tego procederu. Chociaż upubliczniono niewielki wycinek informacji, to nie ma najmniejszych wątpliwości, że terrorystyczne operacje gabinetu Ronalda Reagana w Ameryce Środkowej były sprzężone z przemytem narkotyków. W latach 80. przyszła kolej na Afganistan. Rozkwit handlu narkotykami stanowił zapłatę dla sił sojuszniczych, którym administratorzy Stanów Zjednoczonych przekazywali miliony dolarów; mowa o tych samych islamskich fundamentalistach, którzy teraz rozszarpują kraj.\nTak jest na całym świecie. Aktywne zwiększanie podaży i popytu na narkotyki to naturalne następstwo realizowanej strategii dominacji.\n.\nPS.To jest interes dla państwa przemocy, więc nie liczmy na ulgi. Naszym zadaniem jest pracować posłusznie.\nCzuwaj.",
			"added": 1611505728
		},
		{
			"topic_id": 1611813988,
			"title": "Czy Watykan rządzi dziś-światem…?",
			"body": ".99% populacji to owce przeznaczone do strzyżenia w czasie pokoju i na rzeź w czasie wojny.\nPolitycy i biurokraci to owczarki.\nWłaścicielem farmy jest światowa finansjera.\n.\n..Nikogo nie muszę przekonywać, że z katolicyzmem, „cywilizacją łacińską” i papiestwem nie jest mi po drodze. Niemniej piramidalne bzdury w sprawie Watykanu muszę zdemaskować…\n.\nNie dziwi mnie katastrofalny stan Polski. Jeśli Klub Inteligencji Polskiej publikuje kosmiczne brednie, pokazuje to stan ogłupienia Polaków.\nOstatnio KIP opublikował dwa absurdalnie idiotyczne teksty:\nhttp://www.klubinteligencjipolskiej.pl/2021/01/watykan-na-szczycie-zarzadzania-systemem-prawa-morskiego-dla-niewolnikow-czyli-eksperyment-z-pudelkiem/\nhttp://www.klubinteligencjipolskiej.pl/2021/01/watykan-i-wielka-brytania-jako-wlasciciele-korporacji-rzadow-i-samorzadow/\n.\nWszystko zaczęło się w Dojczlandii, gdy z inicjatywy branży samochodowej i chemicznej stworzono internetową książkę adresową o nazwie UPIK:\nhttps://www.bisnode.de/upik/\n.\nPoczątkowo zamieszczano w niej dane dotyczące tylko firm, przedsiębiorstw i korporacji związanych z przemysłem samochodowym i chemicznym, przez co używano w niej żargonu handlowego – np. terminu „firma”. I z tego żargonu już nie zrezygnowano. Z biegiem czasu włączono w nią wszystkie inne branże, także usługowe, a nie tylko produkcyjne – oraz wszystkich potencjalnych odbiorców i kontrahentów. Także instytucje państwowe, rządowe, organizacje i stowarzyszenia społeczne posiadające siedziby – gdyż wszystkie one są potencjalnymi odbiorcami usług i produktów. Tyle, że instytucje rządowe posiadają inny kod (SIC) niż rzeczywiste firmy i przedsiębiorstwa. Numery kodu SIC (ostatnia linijka) zaczynające się cyframi od 91 do 99 oznaczają instytucje państwowe, rządowe, także ponadpaństwowe, oraz instytucje społeczne, ale nieprodukcyjne i nieusługowe. I tak Międzynarodowy Trybunał Karny w Hadze ma jako międzynarodowa instytucja sądownicza, nieprodukcyjna, numer SIC 9211:\n.\nGdybym był niepoważnym wyznawcą teorii spiskowych, ogłosiłbym niniejszym, że to Dojczlandia rządzi światem, że zarejestrowała jako podległe jej firmy usraelski kneset, senat, oraz chińską radę państwa. Byłoby to oczywistą brednią.\nWzorując się na dojczlandskim UPIKu usraelici stworzyli własną książkę adresową wszystkich potencjalnych odbiorców i kontrahentów, a użyteczni idioci dopatrują się w tym rejestracji w usraelu jako firm państw i różnych państwowych i rządowych instytucji. Analogicznie można by twierdzić, że każdy, kogo nazwisko figuruje w książce telefonicznej, został zarejestrowany jako firma telefoniczna.\n.\nI jeszcze krótko o rzekomym „prawie morskim”. Obecnie na całym żydo-banksterskim zachodzie najważniejszym prawem jest „prawo bankowe”, dające bankom prawo tworzenia pieniądza z powietrza i puszczania go w obieg pod postacią kredytów, które wraz z lichwiarskimi odsetkami banki mają prawo ściągać z wierzycieli – nawet przy pomocy sądów, komorników i policji. To jest najważniejsze „prawo” obowiązujące na zachodzie. A nie wymyślony „wiatrak” – „prawo morskie”. Co za idioci odwracają uwagę od rzeczywistego zagrożenia – ograbienia nas doszczętnie i wywłaszczenia ze wszystkiego przez prawo bankowe?\nNiższym, podrzędnym i usługowym wobec prawa bankowego jest zachodni system prawny mający korzenie w prawie rzymskim (nie mylić go z prawem kościelnym czy watykańskim). Prawo rzymskie miało kilka dobrych zapisów, jak choćby te: Audiatur et altera pars (Niech będzie wysłuchana i druga strona) czy In dubio pro reo (Wątpliwości rozstrzygać na korzyść oskarżonego). Niemniej było prawo rzymskie niesprawiedliwe, stanowe, klasowe. Było narzędziem trzymania przez elity poddanych za pysk. No i inne prawa i obowiązki mieli obywatele rzymscy, inne nie-Rzymianie a całkiem inne mówiące narzędzia” – czyli niewolnicy. Ci ostatni w sumie nie mieli żadnych praw. Na Zachodzie długo utrzymywano kamuflaż praworządności, mający sugerować, że wszystkim obywatelom przysługują prawa odpowiadające w rzymskim prawie obywatelom Rzymu. Obecnie, na fali narzucanego nam pod pretekstem zmyślonej „pandemii” totalitaryzmu NWO, kamuflaż zarzucono ukazując jawnie, że dla władców zachodu jesteśmy mówiącymi narzędziami – niewolnikami. Wszelkie prawa ludzkie i obywatelskie gwarantowane wcześniej konstytucjami i deklaracjami praw człowieka są nam odbierane – rzekomo dla naszego dobra i bezpieczeństwa. Z bredniami o „prawie morskim” obecna sytuacja nie ma nic wspólnego. Po prostu władcy pieniądza realizują ich plan zniewolenia gojów – zgodnie z wieloma cytatami z żydo-biblii i z „Protokołami Mędrców Syjonu”. A nie z jakimś bzdurnym „prawem morskim”.\n.\nA teraz biorę się za drugi tekst z KIP (http://www.klubinteligencjipolskiej.pl/2021/01/watykan-i-wielka-brytania-jako-wlasciciele-korporacji-rzadow-i-samorzadow/)\n.\nCały ten artykuł Anny von Reiz to stek bzdur i dezinformacji, którego zadaniem jest odwracanie uwagi od rzeczywistych właścicieli korporacji i państw. Są nimi żydo-banksterzy. Nie wiem, czego trzeba się naćpać by napisać: „Kuria Rzymska. Stąd te wszystkie „rzeczy”. Wszystkie etykiety, pudełka, struktury biznesowe, jednostki i podjednostki polityczne są wymyślone przez Kurię Rzymską i tak jest od prawie 3000 lat, a właściwie 4100 lat.”\n.\nI czego się trzeba naćpać, by takie brednie kolportować i w nie wierzyć.? Też bym chciał mieć takie odloty.\n.\n„Kuria rzymska” miała polityczne znaczenie w cesarstwie rzymskim od Konstantyna do upadku zachodniej jego części, a potem od sojuszu z Frankami i powstania państwa kościelnego ok. 750 roku. Tyle, że zajmowała się wszystkim poza żydo-kapitalizmem i korporacjami, których wtedy nie było. Polityczne wpływy kurii obejmowały jedynie państwa katolickie. Prawosławna wschodnia Europa zawsze pozostawała poza jej zasięgiem. Wpływy polityczne kuria rzymska zaczęła tracić w zachodniej Europie po reformacji na terenach protestanckich, a później i w krajach nominalnie katolickich na skutek oświecenia i laicyzacji, gdy wprowadzano rozdział państwa od kościoła. Gospodarką, korporacjami nie zajmowała się. One powstawały u protestantów – tam zrodził się współczesny żydo-kapitalizm. Jeszcze w I połowie XIX wieku państwo kościelne pozostawało średniowiecznym skansenem gospodarczym – papież Grzegorz XVI urzędujący w latach 1831-1846 zakazał budowy kolei żelaznych oraz wprowadzenia oświetlenia gazowego ulic Rzymu. Po likwidacji państwa kościelnego znaczenie polityczne kurii rzymskiej jeszcze bardziej zmalało. Jedynie za pośrednictwem katolików kuria nadal posiadała pośrednie wpływy na politykę w państwach katolickich. W gospodarkę i kapitalizm Watykan włączył się dopiero po zawarciu z rządem Mussoliniego „Traktatów laterańskich” (luty 1929) przyznających Watykanowi szereg różnych przywilejów (oraz jednorazowo 750 milionów lirów):\nhttps://pl.wikipedia.org/wiki/Traktaty_latera%C5%84skie\n.\nZ inicjatywy papieża Piusa XI powołano w czerwcu 1929 IOR:\nhttps://pl.wikipedia.org/wiki/Instytut_Dzie%C5%82_Religijnych\n.\nJego pierwszym szefem został Bernardino Nogara:\nhttps://en.wikipedia.org/wiki/Bernardino_Nogara\n.\nPostawił jednak, zaakceptowany przez papieża warunek: w działalności gospodarczej kierowany przez niego IOR zwolniony jest z przestrzegania wszelkich kościelnych „nauk moralnych” i „przykazań”. I tak w roku 1929 kuria rzymska włączyła się zachłannie w chciwy banksterski kapitalizm, pozostając w nim do dzisiaj. I mamy tak: papieże urządzają modlitwy o pokój, a Watykan posiada udziały w koncernach zbrojeniowych. Kościół wyklął i zakazał pigułek antykoncepcyjnych, a równocześnie ma udział w firmach farmaceutycznych produkujących te pigułki. Tak wygląda moralność kościoła, kurii rzymskiej, katolicyzmu. Niemniej to, co zarabia na współudziale w kapitalistycznych firmach i korporacjach Watykan, kuria rzymska, to tylko okruchy i ochłapy z żydo-banksterskiego stołu. Watykan jedynie wkupuje się jako mniejszościowy udziałowiec w banksterskie korporacje, a nie zakłada je i nie rządzi nimi. Dokładnie to samo dotyczy „Wielkiej Brytanii” – czyli potocznie Anglii. Potęgą stała się dopiero po pokonaniu na morzu Francji na początku XIX wieku. Szybko stała się królową mórz i imperium, nad którym nie zachodzi Słońce. Ale w tym samym czasie została podbita od wewnątrz przez klan Rothschildów. W czasach gdy państwo kościelne nadal było tylko gospodarczym skansenem Europy…:\n.\n„W 1848 r. mówiono o wychowanku żydowskiego getta we Frankfurcie Nathanie Rothschildzie (1777-1836): „Właściciel bezgranicznych bogactw chełpi się tym, że decyduje dziś o wojnie i pokoju na świecie, a pozycja poszczególnych krajów zależy od jego jednego skinienia. Koresponduje z niezliczoną liczbą osób, a do swej dyspozycji ma więcej kurierów niż którykolwiek książę lub monarcha. Ma na swoim żołdzie licznych ministrów. Potężny i posiadający wpływy w gabinetach rządowych na kontynencie, chce także przejąć kontrolę nad naszym rządem”. Pisali o nim historycy: „Rothschild zna wszystkich europejskich książąt i każdego gońca giełdowego. Zna na pamięć wszystkie ich rachunki, rachunki dworzan i rachunki królów. Rozmawia z tymi ludźmi nie zaglądając nawet do swych ksiąg. I powiada np. do któregoś z nich: «Nie uzyska pan u mnie kredytu jeśli mianuje pan tego a tego ministra»”. Benjamin Disraeli (1804-1881), premier Wielkiej Brytanii w roku 1868 i ponownie w latach 1774-1880, pobożny i praktykujący Żyd napisał o Rothschildach: „Oni zdominowali światowe rynki pieniężne, można by rzec, że w istocie nadzorują wszelkie interesy. Rothschildowie wykorzystują całą sumę wpływów podatkowych w południowych Włoszech jako kapitał hipoteczny. Królowie i ministrowie ze wszystkich krajów Europy postępują tak, jak dyktują im Rothschildowie”. Rothschildowie i Disraeli mówili o sobie wzajemnie: „najlepszy i najbardziej wiarygodny przyjaciel rodziny” lub „mój najlepszy przyjaciel”. Disraeli i jego żona Mary Anne nie mieli dzieci, a cały majątek przepisali córce małżeństwa Charlotte Rothschild (1819-1884) i Lionela Rothschilda (1808-1879) – Evelina Gertrude Rothschild (1839-1865).\n.\nSam Nathan Rothschild przekonywał: „Żadna intryga nie osłabi N.[athana] M.[eyera] Rothschilda, który ma pieniądze, potęgę i władzę […]. Król pruski, książę Hardenberg i minister [Skarbu Christian] Rother powinni być wdzięczni Rothschildowi, który posyła im tak wiele pieniędzy [i] udziela Prusom tak dużej pożyczki”. A innym razem: „Nie dbam o to jaka marionetka jest umieszczana na tronie królewskim by panować nad tym wielkim imperium, nad którym nigdy nie zachodzi słońce. Ten, kto kontroluje podaż pieniądza w Imperium Brytyjskim, ten kontroluje Imperium Brytyjskie. A tym człowiekiem jestem ja”. W swoim testamencie napisał m.in.: „Małżeństwa członków rodziny [Rothschildów] mogą być zawierane tylko między kuzynami aby uniknąć rozproszenia i odpływu majątku. Obowiązuje absolutny zakaz ujawniania wartości środków trwałych istniejącego majątku. […] Każdy kto ośmieli się złamać którąś z powyższych zasad, ma zostać pozbawiony prawa do spadku”.\n.\nAutor znaczącego studium o imperializmie, w którym dowodził, że u podstaw powstania imperializmu leżała potrzeba zainwestowania nadwyżek finansowych powstałych z wyzysku mas, zapytywał: „Czy ktokolwiek przypuszcza, że jakieś państwo europejskie mogłoby zaangażować się w poważną wojnę lub zaciągnąć znaczącą pożyczkę bez zgody Rothschildów i powiązanych z nimi osób?” W 1912 r. Żydzi stanowili 20% wszystkich milionerów w Wielkiej Brytanii i Prusach, w okresie 1908-11 w Niemczech stanowili 0,95% ludności i aż 31% najbogatszych rodzin, na Węgrzech w okresie międzywojennym aż 90% całego przemysłu było pod kontrolą kilku spokrewnionych żydowskich rodzin bankierskich (w 1921 r. Żydzi stanowili 87,8% grających na giełdzie i 91% członków stowarzyszenia pośredników walutowych), w 1875 r. Żydzi stanowili 70% kupców w Kurlandii, 75% w Kownie, 76% w Mohylewie, 81% w Czernihowie, 86% w Kijowie, 87% w Mińsku, i po 96% na Wołyniu, w Grodnie i na Podolu, a w latach 1828-1832 byli właścicielami 93,3% nieszlacheckich zakładów przemysłowych na Wołyniu.”\nhttp://dylewski.com.pl/menu-boczne/iluzja-pieniadza/osobliwosc-zydowska-czesc-2/\n.\nObecnie fundamentem potęgi Rothschildów jest City of London (https://pl.wikipedia.org/wiki/City_of_London) – wyłączony spod jurysdykcji brytyjskiej kawałek ziemi w Londynie – mila kwadratowa. Jego roczne zyski są kilkakrotnie wyższe niż PKB całej Wielkiej Brytanii. To pokazuje, czym owa „Wielka Brytania” jest – jest kolonią gospodarczą i finansową Rothschildów, którzy ponadto bezpośrednio lub przez podstawionych pobratymców dzierżą w łapskach wszystkie korporacje i firmy nominalnie „brytyjskie”. Przy ich faktycznych zyskach i bogactwach i Watykan, i Wielka Brytania to biedaki, chudopachołki. Politycznie i militarnie Anglia stoczyła się do pozycji wasala usraela.\n.\nKto więc i po co wymyśla i kolportuje brednie, jakoby Watykan i Wielka Brytania były właścicielami korporacji, państw i samorządów? Jest to z jednej strony popychanie gojów do walki z wiatrakami, a z drugiej strony odwracanie ich uwagi od rzeczywistych właścicieli zachodu i prawie całego już świata. Dziwi mnie niepomiernie, że takie brednie kolportuje Klub Inteligencji Polskiej. Przecież wystarczy tylko chwilę pomyśleć, by zrozumieć, że są to po prostu brednie. Są to piramidalne brednie, większe niż Piramida Słońca w Meksyku:\n.\nI jeszcze te brednie o Trampku ultrasyjoniście…\n.\n„Cóż, Trump miał na tyle rozsądku, by zniszczyć Korporację Miejską, którą papiści wyczarterowali dla rządu terytorialnego, ale od razu wrócił przez obrotowe drzwi i teraz proponuje, aby brytyjskie wojsko terytorialne Stanów Zjednoczonych zaczęło wszystko od nowa i stoczyło kolejną całą wojnę o niezależność naszym kosztem, a my tymczasem powinniśmy zaakceptować kolejną Zastąpioną Kukułkę przez ich brytyjską „Republikę” w miejsce naszej Amerykańskiej Republiki Federalnej.”\n.\nTrampka wypromowały środowiska żydowskie. Nie bez przyczyny na spotkaniu z żydowską AIPAC publicznie mówił:\n.\n„Kocham ludzi na tej sali. Kocham Izrael. Kocham Izrael. Byłem z Izraelem tak długo w sensie, że otrzymałem jedne z moich największych odznaczeń od Izraela, jak mój ojciec wcześniej, niesamowite. Moja córka, Ivanka, spodziewa się wkrótce pięknego żydowskiego dziecka.”\nhttps://opolczykpl.wordpress.com/2016/11/07/donald-trump-patriota-usraelski-nadzieja-dla-wolnego-od-lichwy-usraela-i-swiata-czy-syjonistyczny-trampek/\n.\nWidziałem teksty, w których ujawnia się nazwiska żydowskich funkcjonariuszy w ekipie Bidy (Bidena). A u Trampka takich nie było? A co z jego najbliższym doradcą i jednocześnie zięciem, Jaredem Kushnerem (https://pl.wikipedia.org/wiki/Jared_Kushner)? To Kushner przekonał pobratymców do wsparcia Trampka w poprzedniej farsie wyborczej. Wiedział, że teść zrobi wszystko dla Izraela. I zrobił! Jerozolimę uznał jego stolicą:\n.\nI przyznał Izraelowi zaanektowane w 1967 roku syryjskie Wzgórza Golan. Oraz przedstawił jako swój plan zięcia dla Bliskiego Wschodu, oznaczający w sumie wstęp do ostatecznego rozwiązania kwestii palestyńskiej. Swoje Trampek zrobił – i odszedł na zieloną trawkę.\n.\nDziwi mnie to, że tylu Polaków widziało w nim usraelskiego patriotę i nadzieję dla wolności. Wszak to ta marionetka wydała nakaz budowy okupacyjnych baz wojskowych w Polsce i to ona podpisała haniebną i bezprawną ustawę 447. I mimo to ma ta żydowska marionetka tylu w Polsce wyznawców, tylu rozdzierających z żalu po nim szaty naiwniaków i użytecznych idiotów. Aż wstyd mi, jacy durni mogą być Polacy.\n.\nJedynym właścicielem państw zachodu są żydo-banksterzy. Nie Watykan i nie Wielka Brytania. Kto tego nie pojmuje, ma pod czaszką spleśniały ser zamiast mózgu. I walczyć należy z żydo-banksterami i z ich marionetkami politycznymi. A nie z wiatrakami. Nie dajmy agenturze wpływu i użytecznym idiotom robić z siebie don Kichotów walczących z „prawem morskim”, Watykanem i Wielką Brytanią. Kariera Watykanu i tak dobiega końca. W ciągu następnych dwóch, trzech pokoleń krystowierstwo (nie tylko katolicyzm) wymrze ostatecznie. Te infantylne wymysły, żydowskie bajania, po prostu już się przeżyły. Mam nadzieję, że w Polsce w ich miejsce powróci kultura słowiańska.\n.\nKończąc zamieszczam ciekawy film – Legendy Polskie. Film Jaga. Allegro:\n.Pisałem o nim obszerniej w 2016 roku:\nhttps://opolczykpl.wordpress.com/2016/12/12/wojna-slowianszczyzny-z-zydowskimi-wymyslami-czyli-legendy-polskie-film-jaga-allegro/\n.\nFilm jest w sumie alegorią walki jahwizmu (w Polsce żydogennego katolicyzmu) z kulturą słowiańską. Przy czym jahwizm (żydo-banksteryzm także) nadal boi się odrodzenia kultury słowiańskiej. Boi się odrodzenia wartości słowiańskich, pogańskich – wolności, równości, egalitaryzmu, solidarności wspólnotowej, odrzucenia podziału na garstkę bogaczy i rzesze biedoty. Film strach jahwizmu przed kulturą słowiańską ujął bardzo dobrze. Co jednak obecnie jest najważniejsze w nim – to zakończenie piosenki na jego końcu:\n.\n„Wolność kocham i rozumiem,\nWolności oddać nie umiem”\n.\nZamiast wypisywać i wygadywać brednie o „prawie morskim”, o władzy Watykanu nad światem, zamiast rozpaczać za ultrasyjonistą Trampkiem, należy uświadomić sobie, kto nami naprawdę rządzi i co nam obecnie szykuje – totalne zniewolenie, wywłaszczenie ze wszystkiego, zaczipowanie, depopulację. I nie robi tego Watykan a żydo-banksterzy i ich marionetki polityczne. Watykan co najwyżej nadal ogłupia owieczki kultem żydowskich idoli, straszy je piekłem i kupczy „zbawieniem” i „niebem”. I zbiera okruchy z banksterskiego stołu. Robi za banksterskiego szabas-goja.\n.\nWolność kocham i rozumiem\nWolności oddać nie umiem\n.\nWalka o wolność trwa. Nie dajmy zawieść się na fałszywe barykady ani do walki z wiatrakami. Nie dajmy prowadzić się ślepcom, ignorantom, użytecznym idiotom ani agenturze wpływu…\n.\nWalka o wolność trwa…\n.\nopolczyk",
			"added": 1611813973
		},
		{
			"topic_id": 1612560660,
			"title": "04-Sekurak-Amazon.",
			"body": "Koszmar obrońców prywatności nadchodzi. Amazon planuje w USA wyposażenie tysięcy dostawczaków w kamery – przód/boki/spięcie z AI…\n\nNiektórzy ten ruch nazywają „największą ekspansją korporacyjnej inwigilacji w dziejach ludzkości” (nieco pompatycznie, trzeba przyznać):\n\nZ drugiej strony pewnie wielu z nas przyzwyczaiło się do licznych kamer w biurach, sklepach czy nieco mniej licznych – monitoringu miejskiego.\nTutaj mamy potencjalnie jednak coś o wiele mocniejszego – tysiące samochodów, cały czas w ruchu, cały czas analizujących kierowcę (no OK), widok przed samochodem, widok po bokach samochodu. Całość sprzęgnięta z AI i służąca do zapewnienia bezpieczeństwa kierowców (oraz przesyłek):\n“We are investing in safety across our operations and recently started rolling out industry leading camera-based safety technology across our delivery fleet,” an Amazon spokesperson tells The Verge. “This technology will provide drivers real-time alerts to help them stay safe when they are on the road.”\nDodajmy do tego wytkniętą ostatnio współpracę Amazona ze służbami (policja, straż pożarna) – w kontekście przekazywania nagrań z kamer użytkowników (Amazon Ring):\nAll but two US states — Montana and Wyoming— now have police or fire departments participating in Amazon’s Ring network, which lets law enforcement ask users for footage from their Ring security cameras to assist with investigations.\nPuśćmy jeszcze wodze fantazji – Amazon lada chwila ma dostarczać towar dronami – i kto wie, czy ktoś nie wpadnie na pomysł doposażyć je w kamery.\nObserwowanie z samochodów, powietrza, własnej furtki i z wewnątrz mieszkania – w imię naszego bezpieczeństwa. Ale czy na pewno tego chcemy?\nCzy Amazon wdroży całość? W jakim zakresie? Tego dowiemy się zapewne niebawem…\n.\nPs. Dowiemy, się albo poczujemy jak to działa?\nCzuwaj.",
			"added": 1612560644
		},
		{
			"topic_id": 1615135071,
			"title": "Świrus, jako choroba popromienna? część-1/1.",
			"body": "2020.10.25.02.text-Wiedza-Świrus, jako choroba popromienna? część-1.\nCzy „Świrus” jest w rzeczywistości chorobą popromienną,  powodowaną przez promieniowanie elektromagnetyczne, w tym 5G, Wi-Fi, 4G ? \nPrzypominamy ważny artykuł i  z bardzo bogatą dokumentacją na temat: związku „Świrusa” z chorobą popromienną oraz fundamentów dominującej obecnie medycyny rockefellerowskiej opartej na „teorii spiskowej” zarazków ze sfałszowanych badań Ludwika Pasteura. Ten artykuł ukazał się po raz pierwszy w dniu 22 maja na naszej stronie. W związku z tym, odniesiemy się do niektórych kluczowych wątków z perspektywy 5 miesięcy:\n1. W związku z tym, że prognozy i zapowiedzi śmiertelności przez WHO, amerykańskie CDC i wielu „ekspertów” od promocji histerii strachu, były kilkadziesiąt  do kilkuset razy większe, niż faktyczne zgony, wyłącznie na Covid -19, a nie na choroby współtowarzyszące, postawiliśmy cztery pytania, które teraz tu przypominamy:\n1) Czy jest to efekt adaptacji organizmów ludzkich do zmieniających się gwałtownie warunków środowiskowych ?\n2) Czy jest to skutek przyspieszenia zmian świadomości u rosnącej gwałtownie liczby ludzi na świecie ?\n3) Czy powodem tego jest oddziaływanie naszego Słońca i dalej Słońca galaktycznego ( tak jak organizm jest bioelektryczny, co udowodnił W. Sedlak, tak samo i wszechświat jest elektryczny; „jako, na górze tako na dole”), które emitują specyficzne promieniowanie, podnoszące wibrację Ziemi i istot na niej żyjących ?\n4) Czy są to jeszcze inne czynniki i inne oddziaływania ?\nOdpowiedź na te pytania może być twierdząca, jeśli nie dla wszystkich to przynajmniej połowy.\n2. W Polsce na świrusa ( SARS-CoV-2 ), bez chorób współistniejących, od 4 marca do 11 sierpnia 2020 r. zmarło 296 osób (sic!!!! ) według oficjalnej odpowiedzi Ministerstwa Zdrowia z dnia 14.08.2020 ( znak: ZMP.051.447.2020.AO ) udzielonej na wniosek Stowarzyszenia Centrum Informacji o Zdrowiu DOBROSTAN. Według tej odpowiedzi, tym samym czasie zmarło razem z chorobami współtowarzyszącymi 1844 osoby, a na dzień dzisiejszy czyli 21.10.2020 r. – 3851 osób w Polsce i 1 127 797 osób na świecie. Tylko, że w tych przypadkach przyczyny śmierci były inne, a świrus jedynie „podczepiony”, by stwarzał wrażenie, że jest główną przyczyną. To tak jakby człowiekowi choremu na serce, którego na przejściu dla pieszych przejechał samochód, przypisać zgon z powodu choroby serca.\nPrzyjrzyjmy się statystykom, ile ludzi umiera lub ginie w Polsce z  w ciągu jednego dnia:\nwyłącznie z powodu koronawirusa – 2 osoby dziennie,\nw wypadkach na drodze – około 10 osób dziennie,\nsamobójstwa popełnia – 15 osoby dziennie,\nznika bez śladu – 52 osoby dziennie, w tym dzieci i młodzieży poniżej 17 roku życia – 14 osób dziennie,\n(za: https://publicystyka.ngo.pl/zaginieni-bez-sladu.)\nłącznie umiera – około 1100 osób dziennie.\nTo zestawienie pokazuje, jak GIGANTYCZNYM OSZUSTWEM jest cała PLANDEMIA ŚCIEMO-ŚWIRUSA.\n3. Maseczki nie chronią przed wirusami, ponieważ ich pory są wielokrotnie większe niż wirusy. A więc są taką samą osłoną jak furka w drzwiach lub oknie przed komarami. Ale jest coś znacznie groźniejszego powodowanego przez noszenie maseczek. Powodują one zatrucie organizmu wydychanym dwutlenkiem węgla, a w konsekwencji osłabienie układu odpornościowego i tym samym zwiększają podatność na choroby. W poniższej rozmowie Janusza Zagórskiego z Jerzym Ziębą ( od 3minuty 30 sek.\npokazują wskaźnik dwutlenku węgla pod nieszczelną maską dochodzący do 5000 ppm, co przekracza dopuszczalną normę wynoszącą 1000 ppm, aż 5 razy. Rozmówcy wspominają, że pomiar, który przeprowadzili przy szczelnej masce, doszedł do 10 000 ppm, czyli 10 razy przekroczył dopuszczalna normę.\n4. Na szkodliwość noszenia maseczek nakłada się szkodliwość przebywania w środowisku pól elektromagnetycznych 4G, Wi-Fi i 5G. Szczególnie niebezpieczne jest to w szkołach i szpitalach gdzie zainstalowano Wi-Fi. Płk. brytyjski Barie Trower, ekspert od mikrofalowych broni stwierdził, że:\n„ KAŻDY KTO ZAKŁADA Wi-Fi W SZKOŁACH, POWINIEN BYĆ ZAMKNIĘTY DO KOŃCA ŻYCIA. TA OSOBA NIE POWINNA CHODZIĆ PO POWIERZCHNI PLANETY !!!”\n5. W związku z powyższym należy stwierdzić, że rozpoczęty jak co roku sezon grypowy, powodujący  zwiększoną zachorowalność, w połączeniu ze szkodliwym noszeniem maseczek oraz przebywaniem w środowisku pól elektromagnetycznych 4G, Wi-Fi i 5G, być może „podkręconych”, może spowodować zwiększoną zachorowalność i umieralność  w ramach zapowiadanej kilka miesięcy temu II Fali Plandemii. I będzie to przypisywane nie grypie, nie szkodliwości noszonych maseczek, nie falom 5G, Wi-Fi, 4G, które mogą być użyte jako broń mikrofalowa przeciw ludziom, lecz wirusowi Covid19 i umożliwi dalsze nakręcenie psychozy PORNOGRAFII STRACHU oraz wprowadzanie totalitarnych absurdalnych ograniczeń wolności. Jedyna nadzieja w tym, że adaptacja ludzkich organizmów, co przedstawiliśmy na wstępie, osłabi te skutki planowane przez globalnych satanistów. \nPrzypominamy poniższy długi artykuł, który na podstawie ogromnej ilości dowodów z całego świata, dokumentuje związek świrusa z promieniowaniem\nelektromagnetyczny.\n\n\n\nMotta\n prof. Włodzimierza Sedlaka twórcy bioelektroniki.\nWielu uczonym wydaje się, że są u wrót nieomylności poznawczej, a są to tylko epizody, które tworzą niepotrzebny nikomu tuman informacji. Mityczny Olimp mózgów, geniusze dwuwymiarowego świata twierdzą, że innego świata nie ma. To należy do poezji i bajkopisarstwa. Ci uczeni są jak bębenki tybetańskie: cięgiem gadają bzdury, cięgiem eksplodują zawiścią, cięgiem wybijają ten sam rytm… (s.64) \nŻycie w całkowitym spokoju, bez jakichkolwiek przeszkód i trudności, oznaczałoby, nadzwyczaj szybką degenerację człowieka. Nasza inwencja eksploduje zazwyczaj w sytuacjach przegranych, a wysiłek jest najlepszym segregatorem na mędrców i idiotów; mędrzec łamie przeszkody, idiota łamie siebie… Człowiek z natury musi być czynny, twórczy, bez względu na to, czy posługuje się nową generacją komputerów, czy też obsiewa dziesięć akrów pola. (s.68) \nBioelektronika zakłada, że życie i świadomość na poziomie kwantowym mają identyczną naturę – elektromagnetyczną. Tym co niejako zszywa chemiczne reakcje metabolizmu i elektryczne własności związków organicznych są kwanty światła. (NŚ) \nZa książką: K. Dymel, „Tako Sedlak rzecze”,\nwyd. KAW, Lublin 1990 r. i „Nieznanym Światem”\nSzczyt szczytów zaprogramowanej ignorancji: Osłona ze szkodliwej maski przeciw iluzji nieistniejącego „wirusa” i promieniowanie smartfona wywołującego reakcję obronną organizmu, poprzez wydzielanie egzosomów, nazywanych fałszywie „wirusami”.\n\nCenzura lub dyskredytowanie informacji, tekstów oraz osób  łączących przyczynowo zachorowalność na świrusa z promieniowaniem elektromagnetycznym instalacji 5G, Wi-Fi, 4G i innych sieci, jest powszechna w mediach nie tylko głównego ścieku, ale także o dziwo w społecznej blogosferze. W tej drugiej sferze, wydawałoby się bardziej rzetelnej, włączyło się bardzo wielu dez-informatorów, którzy do tej pory zbudowali sobie markę wiarygodności.  Dają się na to nabrać, także dość rzetelni blogerzy i autorzy tekstów oraz filmów, także pod wpływem dez-informatorów.\nNależy więc jednoznacznie stwierdzić:\nNIE NALEŻY UFAĆ NIKOMU, KTO KONSEKWENTNIE ZAPRZECZA O ZWIĄZKU „KORONAWIRUSA” Z CHOROBĄ POPROMIENNĄ, KTÓRA JEST POWODOWANA PRZEZ SIECI BEZPRZEWODOWE: Wi-Fi, 4G 5G, ale i wiele innych.\nNa naszej stronie jest zamieszczonych od początku marca, co najmniej 10 artykułów i filmów ( linki do tych materiałów zamieszczone na końcu) , które omawiają fragmentarycznie lub szeroko ten związek. Natomiast trzy artykuły: poprzedni, poniższy i następny, będący formalnym aktem oskarżenia dr Diany Wojtkowiak do prokuratury, omawiają te zagadnienia kompleksowo z fachową terminologicznie argumentacją i podpierając się dużą liczbą dowodów. Dlaczego ten związek jest cenzurowany lub dyskredytowany, a także same osoby, które to wykazują, wykażemy na końcu naszego wprowadzenia do artykułu.\nTrzeba przyznać, że istnieje cały łańcuch nawarstwionych kłamstw związanych z fałszywą pandemią, takich jak: fałszywe modele prognoz zachorowalności, robione powszechnie fałszywe testy , fałszywe statystki zachorowalności i zgonów, że epidemia rozpoczęła się w Chinach, że świrus przenosi się przez kontakty międzyludzkie, poprzez dyskredytowanie użyteczności skutecznych leków, promowanie powszechnych przymusowych szczepień i wiele innych. To że pandemia jest fałszywa ( ze względu na skalę zasięgu i skutków ), to nie znaczy, że problem świrusa nie istnieje, chociaż skutki są mniejsze, lub co najwyżej takie same jak sezonowej grypy, nawet ze sfałszowanymi w dużej części przyczynami zgonów, przypisywany świrusowi.\nWięc co powoduje tę chorobę o objawach takich samych lub podobnych do grypy ? Odpowiedź, którą akceptują prawie wszyscy brzmi: WIRUS !!!      Otóż jest to fundamentalne kłamstwo założycielskie całej powszechnie rozumianej wirusologii, jako wnikanie do organizmów z zewnątrz zarazków wirusowych poprzez: kichanie, kontakty, uściski dłoni bez rękawic, oddychanie bez maseczek itp.\nOtóż WIRUS nie istnieje !!! Ani żywy ani martwy !!! Nie wyizolował go ani Koch, ani John Franklin Enders odkrywca „wirusa” odry, ani  Luc Montagnier odkrywca „wirusa” HIV, mimo, że za to kłamstwo ci dwaj ostatni dostali nagrody Nobla. Później jednak przyznali się do kłamstwa, że żadnego żywego wirusa nie wyodrębnili.\nPoprzedni artykuł omawia szeroko fikcję istnienia „wirusów” na podstawie spójnej logicznie i merytorycznie medycyny germańskiej Hamera. W tekście zawarte jest przyznanie się do winy sfałszowania swoich wyników badań przez Ludwika Pasteura. Te badania  posłużyły na zbudowanie fundamentów obecnej medycyny rockefellerowskiej. Jak ją tworzono ? Co koncerny farmaceutyczne nie chcą abyś wiedział ? I jak wygląda statystyka w medycynie ? Przeczytasz na linku: http://www.klubinteligencjipolskiej.pl/2020/05/page/4/\n„Wirus” to nie jest coś żywego, jest to wymaz w komórkach i jeżeli komórka jest zanieczyszczona, to wypuszcza taki płyn do spłukiwania. To nie jest żywa substancja. Ona zawiera genom, ponieważ każdy dotyk pozostawia ślad genetyczny.\nSłowo „virus” oznacza truciznę”, a słowo „korona” opisuje promieniowanie pola, które czasem emitują wysokiego napięcia urządzenia! \nW ten sposób słowo świrusy dosłownie oznacza zatrucie promieniowaniem!\n „Wirusami”, są nazywane egzosomy  wydzielane przez organizm i NIE SĄ ONE PROBLEMEM  w organizmie. One są tam po to, aby POMÓC ORGANIZMOWI W DETOKSYKACJI TRUCIZN !!!\nW tym miejscu przytoczymy obszerną wypowiedź  dr Roberta O. Younga udokumentowaną jego badaniami pt. „Wpływ promieniowania elektromagnetycznego na ludzkie komórki”. Ten niezwykle odważny naukowiec, nie tylko podważa oszustwo istnienia świrusa i wirusów w ogóle, ale także podważa fundamenty całej farmaceutyczno-medyczno-eugenicznej „RELIGII” Rockefellerowskiej, której „bogiem” jest fałszerz Ludwik Pasteur.\nPrzytaczamy większość wypowiedzi dr Roberta O. Younga ( za: https://youtu.be/tIwXxYhIBLQ – blokowane wyświetlanie ):\n„Gdy antybiotyk lub szczepionka wchodzi do ciała to zanieczyszcza krew. Krew wypycha je do największego organu w ludzkim ciele ( Interstitium), który został odkryty w ludzkim organizmie i uznany dopiero w czerwcu 2018 r. Czyli dopiero niecałe dwa lata temu medyczny świat zaakceptował, że istnieje organ większy od skóry, który zawiera płyn tkankowy, w przedziałach gdzie trzyma odpady.  I może je usunąć poprzez naczynia limfatyczne, a następnie poprzez skórę i mocz.\nWięc jak ktoś dostaje szczepionkę, czyli z truciznami, jak formaldehyd i aluminium, które działają jak anteny, przyciągając elektromagnetyczne trucizny, to trafiają do tych przedziałów na odpady. Także trafia tam wiele szkodliwych substancji, głównie kwasów z: antybiotyków, mięsa, kurczaka, wieprzowiny, wołowiny i ryb. Dlatego wielu ludzi rezygnuje z mięsa, ponieważ ono produkuje w organizmie kwasy: azotowy i mlekowy.\nKwasy wywołują efekt korony, uszkadzają błony komórkowe w połączeniu z innymi czynnikami takimi m. in. jak: antybiotyki i pola elektromagnetyczne pochodzące z 1G, 2G, 3G, 4G, 5G Wi-Fi i innych źródeł.\nW rzeczywistości nie ma bezpiecznego pola energii tego typu, które nie miałoby wpływu na błony komórkowe. Jest to temat opublikowanych przeze mnie badań pt. „Wpływ promieniowania elektromagnetycznego na ludzkie komórki”.\nTe trucizny nie koniecznie identyfikuje się w dużych ilościach, ani na żadnym wysokim poziomie, ponieważ są one wypychane do INTERSTITIUM,  do tego nowego narządu, o którym wielu lekarzy nie wie i nie wie jak to mierzyć. Nie mają jeszcze narzędzi by zmierzyć chemiczne zatrucie, które się odbywa, ponieważ jest wypchnięte do INTERSTITIUM.\nKomórki rozpadają się, ponieważ płyny międzykomórkowe biegną przez każdy organ, każdy system ciała i dlatego SEPSA  jest wiodącą przyczyna chorób na świecie zabijając 100 tysięcy ludzi dziennie ( czyli 36,5 mln rocznie – red. kip ).\nJaki jest zatem powód tego ?\nNie możesz dotrzeć do przyczyny, chyba, że testujesz gdzie przyczyna jest magazynowana, gdzie się zaczyna. Ten powód ma źródło w otoczeniu. Tak jak w makro-świecie mamy kwaśne deszcze, tak i tu mamy taki „kwaśny deszcz” na poziomie komórkowym.\nKomórka ludzkiego ciała wystawiona jest na działanie pól EMF, tym bardziej z częstotliwościami 60 GHz, którą Bill Gates nazwał paradoksalnie częstotliwością Wi. Dla mnie oznacza to, że wirus bez wątpienia ma częstotliwość Wi ( 60 GHz ) która jest 100 razy bardziej toksyczna niż częstotliwość 4G.\nCiało jest zanurzone w tych wszystkich elektromagnetycznych urządzenia: mikrofale, telefony komórkowe, wieże elektromagnetyczne. Więc zastanawiam się jakim cudem my jeszcze nie chorujemy, bo pszczoły od tego umierają. A bez pszczół co zrobimy, przecież one zapylają rośliny i są niezbędne do regeneracji życia. Nasza planeta umiera, a my umieramy jako rezultat tego.\nI to wszystko próbujemy zamknąć w teorii o zarazkach Ludwika Pasteura, która nigdy nie była udowodnioną. \nZARAZKI NIE POWODUJĄ CHORÓB. ONE SĄ ICH REZULTATEM. TO NIE JEST KWESTIA WIRUSA.\nChodzi o efekt, dlaczego komórki zbijają się w skrzepy ? Dlaczego to zrobiły ? Nie dlatego, że są zainfekowane, ale dlatego, żyją zanurzone w polu brudów. ( tu pokazane są w filmie zdjęcia skrzepów; w poniższym artykule jest zamieszczone zdjęcie skrzepu krwi nauczycielki po kilku godzinach pracy w polach elektromagnetycznych m. in. Wi-Fi ).\nPłyny naszego ciała są zatrute przez to co: \nJEMY, PIJEMY, ODDYCHAMY, W JAKIM ŚRODOWISKU ŻYJEMY, CO MYŚLIMY, CO CZUJEMY I W CO WIERZYMY !!!\nA na szczycie tego wszystkiego żyjemy w zupie elektromagnetycznego zatrucia promieniowaniem i oczekujemy, że to przetrwamy. To dlatego, gdy ludzie jadą na wakacje, jadą na plaże. Smuci mnie to, że je teraz zamykają. To najlepsze lekarstwo, jakie teraz możesz zdobyć. Możesz chodzić, oddychać, gdy te fale się rozbijają, sól się wtedy unosi, wdychasz ją, a to jest najlepsze lekarstwo. Czym jest sól ? Sól odnosi się bezpośrednio do twojego ducha. Sól jest klejem, który powoduje, że ludzkie ciało połączone jest z ciałem subtelnym. Jeśli zabierzesz z diety sól – umrzesz. Jak możesz zabrać z diety sól, możesz ją ograniczyć i dodać w zamian cukier. \n( Carry Cassidy ) I to musi być sól morska, nie ta jodowana. Prawda , którą nam serwują  ? \nR.O.Y. Oni dodają wszystko co najgorsze, dodają aluminium, robią to samo z wodo…nem sodu. Kiedy to przyjmujesz te cząsteczki aluminium działają jak anteny, które przyciągają więcej promieniowania kwaśno-twórczego do twoich komórek. Stajesz się wieżą przyciągającą te trucizny. To dlatego ludzie mają te symptomy jak: bóle, czy zawroty głowy, zanik pamięci, depresje, zimne dłonie i stopy, ponieważ to się dzieje, gdy promieniowanie wpada do twojego ciała z wieży komórkowej, czy z Wi-Fi, czy z telefonu komórkowego. \nKontrola umysłu, a promieniowanie elektromagnetyczne wywołujące „wirusy”.\nTo promieniowanie uszkadza błonę komórkową i uszkadza takie komórki ( obraz czarnych komórek ). Pewnie się zastanawiacie jak wyglądają zdrowe komórki ? Zdrowe komórki maja równy kolor równy kształt ( pokazane zdjęcie luźnych komórek z białymi plamami w środku ). Więc gdy błony są uszkodzone, mamy zjawisko odwróconej polaryzacji. Normalnie jest + w środku, a – na zewnątrz. Polaryzacja odwraca: – jest w środku, a + na zewnątrz. Sprawia to, że komórki zaczynają się sklejać ( obraz sklejonych komórek ) i są złączone łańcuchem. Gdy one się tak sklejają, nie mogą przemieścić się po systemie, aby transportować tlen ( chodzi o krew ).\nWięc jak masz tzw. chorobę korona, to nie jest żadna infekcja wewnętrzna, lecz zewnętrzna, z powodu tych wszystkich czynników, które psują twoje środowisko, powodując efekt korona. Powodując, że komórki się sklejają i nie cyrkulują do głowy, do rąk, do stóp, masz bóle głowy , zimne kończyny, bo masz zatory, a ciało nie może podtrzymać swojej zasadowości, bo fluidy ciała nie mogą płynąć, ponieważ są posklejane. A płynąć mogą wtedy, gdy są pojedyncze. A gdy są posklejane, nie mogą wyłapać tlenu z płuc jako grupa. Muszą to robić pojedynczo.”\nJeszcze szerzej wielorakie zagrożenia dla ludzi i innych organizmów żywych ze strony pól elektromagnetycznych, których niektóre skutki próbuje się obecnie przypisać świrusowi, prezentuje „MIĘDZYNARODOWY APEL o powstrzymanie 5G na Ziemi i w przestrzeni kosmicznej” podpisany ( także przez nasze Stowarzyszenie ponad rok temu ) na dzień dzisiejszy            ( 21.05.2020 r ) przez 286 tysięcy organizacji i osób z 217 krajów świata.        W Apelu tym, zaadresowanym do ONZ, WHO, UE, Rady Europy oraz rządów wszystkich państw, czytamy m. in.:\n„My niżej podpisani naukowcy, lekarze, organizacje pro-środowiskowe i obywatele z (217 na dzień 21.05.2020 r.) krajów, apelujemy o bezzwłoczne wstrzymanie wdrażania bezprzewodowej sieci 5G ( piątej generacji ), łącznie z 5G z satelitów w przestrzeni kosmicznej. 5G zwiększy ogromnie ilość promieniowania radiofalowego ( RF) , nakładając się na już istniejące sieci telekomunikacyjne 2G, 3G i 4G. Dowiedziono, że promieniowanie RF jest szkodliwe dla ludzi i środowiska. Wdrażanie technologii 5G to eksperyment na ludzkości i środowisku naturalnym, a więc przestępstwo w świetle prawa międzynarodowego.\n(…) Choć powszechnie się temu zaprzecza, istnieje przytłaczająca ilość dowodów na szkodliwość radiofal (RF) dla żywych organizmów. Zgromadzone dotąd dowody kliniczne, że powodują one dolegliwości i choroby u ludzi, doświadczalne dowody uszkodzenia DNA, komórek i układów narządów u szerokiej gamy roślin i zwierząt oraz dowody epidemiologiczne na to, że jedne z najpoważniejszych chorób cywilizacyjnych – rak, choroby serca i cukrzyca – są w dużej mierze spowodowane przez zanieczyszczenie elektromagnetyczne środowiska składają się na bazę naukową zawierającą ponad 10.000 recenzowanych publikacji.\n(…) W 2015 roku 215 naukowców z 41 krajów poinformowało Organizację Narodów Zjednoczonych (ONZ) i Światową Organizacje Zdrowia (WHO)9 o swoim zaniepokojeniu obecną sytuacją. Stwierdzili oni, że „wiele najnowszych publikacji naukowych wykazało, iż pola elektromagnetyczne ( ang. electromagnetic fields – EMF ) wpływają na żywe organizmy przy poziomie promieniowania dużo poniżej wytycznych międzynarodowych i krajowych”. Ponad 10.000 recenzowanych badań naukowych dowodzi, że promieniowanie radiofalowe ( RF ) jest szkodliwe dla ludzkiego zdrowia.10,11\n(…) Promieniowanie radiofalowe wywołuje zarówno stany ostre jak i przewlekłe. Przykładowym efektem długoterminowym jest rak i choroby serca. Zaburzenia rytmu serca100 i zmiany w funkcji mózgu (EEG)101 to przykłady efektów natychmiastowych. Zespół objawów określony w dawnym Związku Radzieckim mianem choroby mikrofalowej102, a obecnie nazywany na całym świecie nadwrażliwością elektromagnetyczną ( electrohypersensitivity – EHS )103 może być dolegliwością ostrą lub przewlekłą. Szczegółową historię  tego zespołu chorobowego opublikował Profesor Dr. Karl Hecht, opierając się na przeglądzie ponad 1.500 rosyjskich publikacji naukowych i na historii klinicznej ponad 1.000 swoich własnych pacjentów w Niemczech. Obiektywnie stwierdzone objawy obejmują zaburzenia snu, nieprawidłowe ciśnienie krwi, zaburzenia rytmu serca, dolegliwości trawienne, wypadanie włosów, szumy lub dzwonienie w uszach i wysypki skórne. Subiektywne objawy to zawroty głowy, mdłości, bóle głowy, trudności w koncentracji, zmęczenie, objawy grypopodobne i bóle w klatce piersiowej.104″\nCałość apelu na: http://www.klubinteligencjipolskiej.pl/2019/02/miedzynarodowy-apel-o-powstrzymanie-5g-na-ziemi-i-w-przestrzeni-kosmicznej/ \nSasza Stone członek Trybunału Prawa Naturalnego i autor głośnego filmu 5G Apokalipsa ( będzie zamieszczony jako jeden z kolejnych w tym cyklu ) w nagraniu ( na linku: https://youtu.be/dXFH_FxFY10 – nie wyświetla się ) mówi m.in. że:\n„Nie ma czegoś takiego jak wirus. Tzw. „wirus” to wydzielina z żywych komórek, do której dochodzi w akcie detoksykacji tych komórek. Komórki pozbywają się zatrucia, toksyn, obumarłe ich cząstki można nazwać wirusem.”\nCały ten łańcuch kłamstw nakładanych na siebie, wiedzie głęboko do „króliczej nory”, gdzie na końcu są dwa kłamstwa fundamentalne: o istnieniu „wirusów” i o braku związku zachorowań grypowych lub grypopodobnych ( świrus ) z choroba popromienną spowodowaną oddziaływaniem pól elektromagnetycznych: 5G, Wi-Fi, 4G i innych.\nOsoby i teksty, które to obnażają są najbardziej atakowane, dyskredytowane, cenzurowane i usuwane przez: media głównego ścieku, tzw. „naukę” i dez-informatorów w mediach społecznych i społecznościowych:\nMendia głównego ścieku określają to „teoriami spiskowymi”, fejk newsami, działaniami „szkodliwymi dla zdrowia” itp. Trzeba tu zauważyć, że knebel w postaci „teorii spiskowych” wymyśliło CIA po zabójstwie prezydenta USA Kennedy’ego, dla ośmieszania tych co kwestionowali oficjalną, prymitywną i fałszywą wersję jego śmierci. Od tego czasu stosowano ten knebel bardzo często do ośmieszania każdej prawdy,  często bardzo niewygodnej dla rządzących w każdym kraju i w świecie. Choć ten knebel się mocno już zużył dzięki internetowi. Ścierwomedia jednak w dalszym ciągu go używają, nie tylko do wymienionych fundamentalnych kłamstw. \nW tzw. „nauce” upowszechniono tzw. naukawe pojęcie „brzytwy Ockhama”. Zgodnie z tą zasadą w wyjaśnianiu zjawisk należy dążyć do prostoty, wybierając takie wyjaśnienia, które opierają się na jak najmniejszej liczbie założeń i pojęć. O ile może ona mieć ostrożne zastosowanie w teorii, to praktyce nie ma jednak zastosowania do oceniania prawdziwości hipotez. Ta zasada często służy do zaganiania do stadnego myślenia, czy to powszechnie, czy w tzw. „nauce”, co blokuje jej rozwój i postęp, zamykając ją w dogmatach, jak religie. \nW całej sferze społeczności internetowej stosowany jest bardzo bogaty zestaw, który zastępuje merytoryczne podejście i argumenty. Są to zwykłe inwektywy anonimowych trolli internetowych, albo deprecjonujące zwroty np. „ruski troll”, „ruska onuca”, „antysemita”. Często stosowane też są „etykietki”: agent SB, agent CIA, mesjasz, hipis, jaszczurka, reptilianin, syn pułkownika itp. itd. i nie ważny jest wtedy logiczny sens i merytoryczna spójność wypowiedzi, zwłaszcza o charakterze interdyscyplinarnym. Dużą karierę, podobną do „teorii spiskowych”, zrobiło w czasie transformacji kolonialnej w Polsce określenie agent: SB, WSI, albo KGB, FSB, GRU i… „wszystko jasne”. Co ciekawe najczęściej tym określeniem szermowali agenci, tylko że nigdy nie przyznawali się, jakiego wywiadu obcego  byli agentami. \nPierwszym który powiązał wiele „puzzli” z różnych dyscyplin naukowych w całość był Robert David Steel,  analityk amerykańskiego wywiadu wojskowego ( napisał 2000 recenzji do książek i artykułów oraz był nominowany w 2017 r do pokojowej Nagrody Nobla ),  pokazując powiązania: ataku „fałszywej flagi świrusem w Chinach, z technologią 5G, próbą wywołania wojny lub załamania gospodarczego Chin i wywołania globalnego kryzysu finansowo-gospodarczego,  z globalną psychozą strachu przez media,  z bronią biologiczną w postaci szczepionek, przepływami na rynkach finansowych i wielu innych aspektów.\nW wywiadzie z 12 lutego  dla irańskiej gazety Teheran Times ( https://www.tehrantimes.com/news/445094/Interview-A-Counterintelligence-Perspective-on-the-Wuhan-Virus ) stwierdza m. in. tak:\n„…był to syjonistyczny atak na Chiny (…)\nNikt nigdzie nie koncentruje się na przecięciu biowojny i wojny elektromagnetycznej. Wuhan jest zerowy dla 5G, która jest ludobójczą i ekobójczą technologią, zabronioną w Izraelu i wokół prezydenta Donalda Trumpa ( zarówno w Waszyngtonie, jak i w Mar-A-Lago ). Promieniowanie 5G nie tylko obniża odporność wszystkich ludzi i zwierząt, które wypromieniowuje, ale także może wytwarzać oryginalne efekty biologiczne i pogarszać naturalne bio-upadki. (…)\nNie ma rozdziału między biologią, energią i informacją. (…)\nChoroba popromienna występuje jako grypa – objawy są identyczne z tym, że całe samoloty zostały poddane kwarantannie przeciw rzekomej grypie, gdy wszyscy pasażerowie faktycznie cierpieli z powodu  promieniowania nowego satelitarnego Wi- Fi, które nie zostało odpowiednio skalibrowane. (…)\nOdkryłem w literaturze faktu, że zjadliwe wirusy można zarówno tworzyć, jak i pokonywać za pomocą wyrafinowanych środków elektromagnetycznych.”\nW kolejnym nagraniu na youtube   z dnia 3 marca 2020 r. ( link: https://youtu.be/ztO5ePtxcW0 ) Robert David Steel potwierdził, że świrus jest syjonistycznym atakiem pod fałszywą flagą i odczytał swoją odpowiedź na list Premiera dużego kraju będącego we Wspólnocie  Brytyjskiej, ( Commonwealth ) ( prawdopodobnie z Indii ) jak powinien postępować z epidemią świrusa w 10 następujących punktach:\n„1. Choroba popromienna i wszystkie formy grypy maja takie same symptomy. Fakt ten musi stać się przedmiotem edukacji na szczeblu publicznym. Obniży to znacznie panikę w społeczeństwie w związku z nieznanym świrusem i w związku ze znaną technologią 5G.\n2. 5G to czynnik, którego nie wolno ignorować. Jeśli zostanie zignorowany rząd poniesie porażkę we właściwej ocenie i rozumieniu co się naprawdę dzieje. \n3. Olbrzymim błędem Chińczyków było zignorowanie technologii 5G i niskich częstotliwości anten, które w Wuhan zajęły powierzchnię równą Nowemu Jorkowi i zanieczyszczenie smogiem elektromagnetycznym w ich początkowych szacowaniach. Kolejnym błędem, który pogorszył sytuacje było spędzenie w jedno miejsce osób z choroba popromienna ( radiacyjną ), z obniżona odpornością oraz osób zarażonych bezpośrednio świrusem. \n4. Medyczna diagnoza w obecnym czasie jest kompletnie podejrzana. Wiele osób z normalną grypa jest źle diagnozowana jako zarażona świrusem. Wiele osób cierpiących na chorobę popromienną od 5G, szczególnie pasażerów samolotów, również są diagnozowani jako zarażeni świrusem. \n5. Nie można ufać Amerykanom. Prezydent Trump ma dobre pojęcie sprawy. Jednak agenci CIA, CDC ( ministerstwo zdrowia w USA ) sieją propagandę strachu, a ich motywacją jest obok ignorancji, chęć obrony budżetu i zbudowanie nowego (…) Kluczowa część działalności CDC jest prowadzona przez przeciwników Trumpa i  niedobitki po Obamie. \n6. Prezydentowi Trumpowi można zaufać. Powinniśmy wszyscy poprosić, aby zażądał  pełnej dokumentacji wywiadu odnośnie każdego: telefonu,  a-maila, rachunku i każdej innej formy dokumentacji  między Billem Gatesem, a uczestnikami Konferencji  I went 201. Były tam zgromadzone osoby, które odpowiedzialne są za Agendę depopulacji  Ziemi poprzez przymusową szczepionkę zawierającą cyfrowy  ID,  nigdy nie testowaną przez niezależne podmioty. Muszę tu podkreślić, że Robert Kennedy Junior udowodnił w sądzie tekst w sprawie szczepionek. Żadna szczepionka nie była nigdy właściwie przetestowana. A ta szczepionka, która ma być  teraz wmuszona ludziom będzie działać również jako sterylizator. Ten sam składnik, który niedawno znaleziono w szczepionkach  Billy Gatesa  dla  Afryki. \n7. Następujące oświadczenie powinno być przeczytane przez Pana Premiera społeczeństwu, z pełnym szacunkiem dla gubernatora z  Włoch z rejonu Veneto o imieniu  Zaja, który powiedział, cyt: 80% zarażonych ludzi zdrowieje sama, 15% potrzebuje leków,  a 5% pobytu w szpitalu. Wszystkie 17 osób, które zmarły we Włoszech miały poważne problemy zdrowotne. Żadna zdrowa osoba, która złapała świrusa nie umarła. Jest to alarm be żadnej podstawy. Na początku służby zareagowały tak jak zareagowały, ponieważ nie miały prawdziwych informacji. Ale po bliższym zbadaniu wszyscy stwierdzili, że informacja jest bardzo przesadzona. \n8. Z całym szacunkiem dla premiera i kraju którego to dotyczy, ten drakoński akt, który został zaproponowany jest najgorszym z możliwych do podjęcia. Zniszczy on wiarygodność tego kraju Korony z Commonwealthu. Kiedyś powiedziano, że to czego najbardziej powinniśmy się bać, to sam strach. Teraz musimy powiedzieć to wyraźnie, że jedyną rzeczą, której powinniśmy się bać, to głupota rządów i nieadekwatne reakcje. \n9. Punkt przedstawię w dwóch podpunktach: \n10. a) Wiele lat temu cieszący się dobrą reputacją wiceprezes floty Merck uznawany za eksperta odnośnie ataków pirackich u wybrzeży Somali powiedział amerykańskiej marynarce wojennej, mnie i wielu innym w tamtym czasie, że potrzeba całości obrazu. Pojedynczy atak terrorystyczny taki  jak przejęcie statku przez piratów jest niczym więcej niż wypadek pociągu. To dalsze działania rządów w postaci nowych regulacji, inspekcji i całej reszty utrudnień w postaci ingerencji w  biznes dokonuje szkód, które są głębokie i długotrwałe. Do tego wszystkiego dodam tzw. żółte dziennikarstwo i propagandę strachu siane przez media, które jest totalnie nieetyczne i pozbawione podstaw intelektualnych. \n11. b) Liczba osób, które umierają od zwykłej grypy, chorób serca, raka płuc, wypadków samochodowych, a  nawet domowych morderstw jest znacznie wyższa niż liczba osób zmarłych od rzekomego wirusa. Nie widzimy nic na ten temat w mediach. Oni napędzają propagandę strachu. Ludzie zaczynają gromadzić papier toaletowy, wodę, a perspektywa szczepionki z cyfrowym ID i elementami sterylizującymi ludzi, co jest elementem planu depopulacji planety jest destruktywna i naruszy tkankę społeczna Pana Kraju. \n12. Z pełnym szacunkiem rekomenduję Premierowi, aby zatrzymał ten drakoński  plan i wprowadził narodowy dzień śledztwa  wszelkimi dostępnymi środkami. PRAWDA  ZA  WSZELKĄ  CENĘ  OBNIŻA WSZYSTKIE  INNE  KOSZTY. \n13. Punkt muszę powiedzieć go z lekkim humorem, ale też z całą powagą. Jestem gotów przyjechać do waszego Kraju bez maseczki  i publicznie to wszystko ogłosić w narodowej telewizji całując jednocześnie z języczkiem atrakcyjną panią prezenterkę zdiagnozowaną  z  świrusem. Zrobię to w służbie dla ludzkości.  \nPrzedstawiona przez Roberta Davida Steele rada Premierowi dużego kraju, jeszcze na początku marca, jak należy podejść do problemu świrusa, była słuszna, co kolejne 3 miesiące w pełni potwierdziły. Tak należało podejść, kiedy nie było jeszcze tylu danych co obecnie.\nNatomiast rządy krajów postąpiły inaczej, wybierając najgorszy z możliwych scenariusz, który został zaplanowany co najmniej 10 lat wcześniej  i  zamieszczony w  Raporcie Fundacji Rockefellera z maja 2010 roku.  Omawiane są tam cztery scenariusze rozwoju świata w najbliższym czasie. W poniżej pierwszej części, pierwszego scenariusza Lock Step ( Blokada postępu ), na str. 18-19, piszą tak:  „Świat ściślejszej kontroli rządu od góry i  bardziej autorytarnego przywództwa, z ograniczonymi innowacjami i rosnącą presją obywateli… całość na linku: https://www.nommeraadio.ee/meedia/pdf/RRS/Rockefeller%20Foundation.pdf] \nPlany tej epidemii są przygotowywane starannie od co najmniej 40 lat, co omawiane jest też w poniższym artykule. Zakładano w nich znacznie większą śmiertelność oraz kolejne fale zachorowalności. Jednak zarówno terminy są mocno przesuwane, jak i śmiertelność kolejnych epidemii: Ebola, Sars, ADIS, świńska grypa, ptasia grypa, wiele pomniejszych, a zwłaszcza obecna są co najmniej wielokrotnie niższe niż zakładano.  Tak jak nie udaje się globalnym czcicielom szatana, rozpętać jądrowej III wojny światowej, mimo bardzo wielu prób, tak nie udaje się to zrobić obecnie, przez jednoczesne połączenie: bio-wojny, wojny elektromagnetycznej i wojny informacyjnej.  Należy tu postawić następujące pytania badawcze:\nCzy jest to efekt adaptacji organizmów ludzkich do zmieniających się gwałtownie warunków środowiskowych ?\nCzy jest to skutek przyspieszenia zmian świadomości u  rosnącej gwałtownie liczby ludzi na świecie ?\nCzy powodem tego jest oddziaływanie naszego Słońca i dalej Słońca galaktycznego ( tak jak organizm jest bioelektryczny, co udowodnił W. Sedlak, tak samo i wszechświat jest elektryczny; „jako, na górze tako na dole”), które emitują specyficzne promieniowanie, podnoszące wibrację Ziemi i istot na niej żyjących ?\nCzy są to jeszcze inne czynniki i inne oddziaływania ?\nDavid Icke był drugą osobą, która powiązała wiele puzzli z interdyscyplinarnych zagadnień w całość, razem planowanymi zamierzeniami na przyszłość oraz związek  świrusa  z  promieniowaniem elektromagnetycznym 5G i przymusowymi szczepionkami,  w wywiadzie z nim z dnia 6 kwietnia 2020 w LONDONREAL.TV. To nagranie obejrzało w ciągu 2 dni ponad 7 milionów, więc zostało usunięte najpierw z youtube i  vimeo, a następnie po pewnym czasie usunięto jego całe konto z Facebooka pod pretekstem upowszechniania „teorii spiskowych”. Nagranie dostępne jest obecnie na linku:  https://www.bitchute.com/video/yrgOyP8jrW6f/?fbclid=IwAR0oZVIdr7NmLg2FrsKu4JR0Q0ljEYpr8Kt36R17FJn7eJgmSGApoRDZ2Eg\nDavid  Icke jest największym światowym demaskatorem tajnych działań globalnej władzy od 30 lat. Najpierw w latach dziewięćdziesiątych był wyśmiewany, że głosi „teorie spiskowe”, ale kiedy one zaczęły się sprawdzać w postaci konkretnych działań globalnych satanistów, zaczął być bardzo popularny on i pisane przez niego książki.\nZ uwagi na to, że oglądalność tego znakomitego wywiadu szybko rosła w dziesiątki milionów widzów, więc globalni organizatorzy fałszywej pandemii  z pod znaku NWO, przerazili się tak bardzo, że spowodowali usunięcie  konta Davida Icke z Facebooka, a formalny pretekst stanowił opublikowany po zamknięciu konta  list Centrum Przeciwdziałania Nienawiści Cyfrowej ( CCDH )  wzywający firmy technologiczne do zakazania kont  Ickego .\nW liście napisano, że aby Amazon, Facebook, Twitter i YouTube wzmocniły „rasizm i dezinformację Icke o Covid-19 dla milionów ludzi”.\nZostał podpisany wspólnie przez posła Damiana Collinsa, a także sławnych medyków dr Christiana Jessena, dr Dawn Harper i dr Pixie McKenna. CCDH powiedział, że filmy Icke’a przedstawiającego „nieprawdziwe i spiskowe twierdzenia o Covid-19” były oglądane w Internecie ponad 30 milionów razy.\nJako przykłady list przytoczył:\nwywiad na YouTube, w którym Icke fałszywie twierdził, że za świrusem stoi grupa żydowska;\npost na Instagramie, w którym fałszywie twierdził, że sieci komórkowe 5G uniemożliwiają ludziom wchłanianie tlenu;\nfilm na YouTube, w którym fałszywie twierdził, że nie można złapać wirusa z uścisku dłoni.\nZa: https://kochanezdrowie.blogspot.com/2020/05/facebook-usuna-oficjalna-strone-pana.html \nTo zachowanie globalnych organizatorów tej niespotykanej w historii operacji, jedynie w pełni uwiarygodniło to, co powiedział David Icke w wywiadzie i innym nagraniu.\nTakże w Polsce najbardziej atakowane są osoby, które potrafiły interdyscyplinarne powiązać wiele elementów tej układanki w całość, w tym przede wszystkim związek fałszywej pandemii z 5G i szczepionkami. Są to przede wszystkim dr Diana Wojtkowiak ( autorka oskarżenia do prokuratury w kolejnym materiale na stronie ) i Ewa Pawela. Ta ostatnia tak jak Robert David Stele, David Icke i Autor poniższego tekstu twierdzą ponadto, że za tym stoją syjoniści z Izraelem na czele ( patrz nagranie na linku: https://www.youtube.com/watch?v=3FXdH9jQTSw \nNiniejsze  dwuczęściowe opracowanie jest niezależnym potwierdzeniem nie tylko: że istnienie  „wirusów” w ogóle jest nieprawdą, a brak związku  zachorowań na fałszywego „świrusa”  z promieniowaniem elektromagnetycznym, w tym 5G, Wi-FI, 4G i innych, jest także  kłamstwem.\nKolejnym potwierdzeniem związku 5G  z zachorowalnością na chorobę popromienną  jest ciche przyspieszone instalowanie stacji bazowych i anten 5G w bardzo wielu krajach świata pod przykrywką niespotykanego w dziejach medycznego stanu wojennego w  związku  z fałszywą pandemią.\nPrzykładem może być sam Izrael posiadacz patentu na technologie 5G, który do czasu obecnego „stanu wyjątkowego”, rozbudowywał tą sieć tylko przez światłowody. Obecnie w całym Izraelu, a głównie w miastach, zaczęto pod osłoną  zakazu wychodzenia  z domów, instalować głównie w nocy  w przyśpieszonym trybie stacje bazowe i anteny 5G. Jak donoszą osoby  mające prywatne kontakty  w Izraelu, ludzie po zainstalowaniu i uruchomieniu  tej technologi: wymiotują, mają zawroty i bóle głowy, nie mogą spać, maja zaburzenia świadomości  i inne skutki  zdrowotne.\nCzy obecny satanistyczny rząd Izraela  boi się własnych obywateli, że to zastosował aby ich spacyfikować?\nCzy rząd Izraela chce zmusić Izraelczyków do szybkiego  opuszczenia kraju, zgodnie z  prognozą  / zaleceniem , Henry Kissingera sprzed  blisko 10 lat,            że Izrael w obecnych latach ma przestać  istnieć ?\nTo oznacza znaczne przyspieszenie exodusu z Bliskiego Wschodu do krajów Europy Środkowo-Wschodniej, głównie do Polski  i na Ukrainę.\nAle wracając do głównego wątku, należy postawić pytanie jeśli nie istnieje  „wirus”, który przenosi się przez kontakty międzyludzkie, to w jaki sposób następuje zakażenie przez aktywujące cząstki genomu ?\nOtóż przyśpieszaczem zachorowalności powodowanym  przez  pola elektromagnetyczne, u osób ze słabym już systemem immunologicznym, są jakieś fragmenty genomu w szczepionkach. We Włoszech  osoby starsze, które zmarły z przypisaniem do  Covid-19, w 70 procentach  były  wcześniej szczepione na grypę. Czyli mamy tu te „dobrodziejstwo” szczepionek, które jeszcze chcą nam zaaplikować pod przymusem.  Dosyć kompleksowy materiał o szczepionkowym ludobójstwie w ciągu wieku, przedstawia artykuł na linku: Zbrodnie ludobójstwa za pomocą szczepionek nie ulegają przedawnieniu. Demograficzna zagłada, czyli mistyfikacja H1N1\nPlaniści tej pandemii przygotowując  ją  przez kilkadziesiąt lat, z pewnością zadbali, aby takie aktywatory białkowe obok oczywiście aluminium, dostały się powszechnie do organizmów ludzi. Te aktywatory  i natężenie ich działania prawdopodobnie mogą być wyzwalane przez odpowiednie pasma fal  GSM.   W  jaki sposób do organizmów się dostają ?\nSzczepionki są  podstawowym źródłem zakażenia truciznami  aktywowanymi m. in. przez pola elektromagnetyczne. W pożywieniu częstym składnikiem  jest np. glifosfat  i wiele innych trucizn. Chemtrails rozsiewało m. in. aluminium i patogeny niszczące  pożywienie dla układów odpornościowych, a  więc  z pewnością  zawierały aktywatory dla  fal elektromagnetycznych.  Chemia domowa i kosmetyki są  jednym ze źródeł trucizn dla organizmu np. aluminium w antyperspirantach, fluor  w paście do zębów  i wiele innych.\nPolecamy ten cały  artykuł, dokumentujący naukowo związek 5G z Covid-19, SKORUMPOWANYM  KŁAMCOM  z  ELIT: medycznych, ścierwomediów, rządu i opozycji oraz agentury wpływu i dezinformacji. Także adresujemy go do różnych domorosłych „badaczy” i „znawców” przedmiotu, aby na przyszłość wiedzieli co piszą lub mówią, zamiast pisać i mówić  jedynie to, co wiedzą !!!\nCzy „Świrus” jest w rzeczywistości chorobą popromienną ?\n-Jeanice Barcelo\nwww.RadiationDangers.com \nwww.BirthofaNewEarth.com\n.\nAby dowiedzieć się więcej na temat wpływu  5G i  innych form niejonizującego promieniowania,  zapoznaj się z moją książkę „Ciemna strona prenatalnego usg i zagrożenia niejonizującego promieniowania”.\n ” czy bezprzewodowe promieniowanie naprawdę bezpieczne”  i  „usg połączenie z autyzmem”.\n.\nPozwól mi przejść od razu do rzeczy. Nikomu, kto zaprzecza związkowi między  tym  rzekomo śmiertelnym „świrusem” i  objawami  związanymi   z  chorobą popromienną, nie należy ufać.\nIstnieją powody, aby sądzić, że ludzie naprawdę chorują od promieniowania z sieci bezprzewodowej.\nPROBLEM NIE TYLKO W 5G!\nWszystkie rodzaje sztucznego promieniowania są szkodliwe, w tym fale radiowe, mikrofale i fale milimetrowe.\nIstnieją dziesiątki tysięcy badań, potwierdzających to       Ale nam ciągle kłamali o tym fakcie, i teraz nadszedł czas, aby naprawić ten rekord.\nObjawy, które doświadczają ludzie, które są przypisane do „wirusa”, są dokładnie takie same, jak objawy choroby popromiennej. Spójrzcie tylko na te objawy!\n. utrata smaku i węchu\n. udar mózgu i drgawki\n. „syczenie” i elektryczne uczucie na skórze\n. palące uczucie na skórze ( dokładnie to, co dzieje się z 5G wojskowej broni )\n. problemy neurologiczne, takie jak zawroty głowy, bóle głowy i zaburzenia świadomości\n. problemy z sercem i ataki serca ( które wyraźnie są wynikiem oddziaływania impulsowych mikrofal, które naruszają elektryczną sygnalizację ludzkiego organizmu-zob. )\n. PĘKNIĘCIE SERCA! ( Nawiasem mówiąc, serce nie pęka od wirusa! Ale mogą i robią przerwę od oddziaływania impulsów akustycznych i / lub kuchenki częstotliwości  [patrz tutaj])\n. uszkodzenie jąder !!! ( w przypadku, gdy nie wiedzieli-wpływ dowolny kształt sztucznego promieniowania niszczy płodność )\n. krzepnięcia krwi, który od razu sprawia, że myślę o tym, co się dzieje z krwią, gdy jest ona narażona na promieniowanie wi-fi\nNa zdjęciu poniżej pokazano zmiany w krwi kobiety, która unika bezprzewodowego promieniowania, gdy jest to możliwe, ale jest narażona na działanie promieniowania wi-fi poprzez swoją pracę jako nauczyciel. Oto co dzieje się z jej krwią po zaledwie kilku godzin ekspozycji.\nCzy to może być ten typ „krzepnięcia”, który obserwują lekarze?\nŹródło: Lena Pu – https://www.youtube.com/watch?v=D1pzeTFmCn8\nPtaki spadają z nieba, niezdolne latać i chodzić, i obwiniają, w tym także wirus. \nDzieci rozwijają „podżegającym” i doświadczają objawy ciężkiej wysypki, problemy żołądkowo-jelitowe, a nawet zatrzymania akcji serca ! \nWszystko to objawy choroby popromiennej . Wirusy nie powodują takich szkodliwych objawów. W rzeczywistości, jak można przeczytać poniżej, dowiesz się, że wirusy nie powodują żadnych objawów, a zamiast tego, są w naszym organizmie w odpowiedzi na nasze komórki, gdy są zatrute. Wirusy są tam, aby pomóc organizmowi w detoksykacji trucizn. ONE NIE SĄ PROBLEMEM!\nDwa badania potwierdziły korelację między tym domniemanym „śmiertelnym wirusem” i wdrażaniem 5G. teraz trzecie badanie również została zakończona i szuka profesjonalnej publikacji.\nDowody płyną szeroką  rzeką. Jak długo będziemy, im  pozwalać   na kłamstwa?\nCovid-19 przypadków na milion powyżej 95% i covid-19 zgonów na milion powyżej 126% w stanach Zjednoczonych z 5G.\nźródło\nUzyskane wyniki wykazują wyraźny i ścisły związek między częstością występowania świrusowych zakażeń i położeniem anteny 5G.\nŹródło\nTam wyraźnie dzieje się masowe ukrywanie już teraz, a jeśli nie разоблачим,  to wstyd dla nas.\nKoniec części pierwszej. ",
			"added": 1615135054
		},
		{
			"topic_id": 1615196015,
			"title": "NIE MA SMIERTELNEGO WIRUSA.cz.2/1",
			"body": "2020.10.25.03.-text-Wiedza-Swirus-NIE MA SMIERTELNEGO WIRUSA.cz.1/2\n.\nNIE MA ŚMIERTELNEGO WIRUSA. cz.druga.\n.  Fakty są podane poniżej. Proszę, podziel się szeroko.\nDrodzy przyjaciele - w internecie krąży wiele informacji na temat świrusa -„pandemii”, która rzekomo rozpoczęła się w  Chinach.\nAlarmistyczne nagłówki obfitują w takich, jak ten z Infowars Alexa Jonesa:\n„Modele komputerowe pokazują 183 mln zakażonych коронавирусом 29 lutego”\na to od Mike ‚ a Adamsa  z  Natural News:\n„W ciągu ostatnich 7 dni ilość Коронавирусных zakażeń wzrosła o 1000%”\nGłówne tytuły w ruchu dbałości o zdrowie „krzyczą” w pisanych artykułach o tym, co musimy zrobić, aby chronić się przed tym zbliżającym się, niebezpiecznym dla życia „wirusem” ( patrz tutaj i tutaj ).   I, tuż przy kolejce, Światowa organizacja zdrowia ogłosiła ” globalną pandemię koronawirusa„. Stany Zjednoczone również publicznie ogłosili  świrusy „sytuacji kryzysowej w dziedzinie zdrowia publicznego„.”\nWszystko to wydarzyło się w ciągu zaledwie kilku dni.\nSądząc po szybkości, z jaką ten okropny „wirus”, wydaje się „rozciąga” się wokół Ziemi, wydaje się, że teraz jest właściwy czas, aby zrobić kilka kroków do tyłu, aby zobaczyć, czy możemy stwierdzić,  co w świecie tak naprawdę się dzieje tutaj?\nNiewątpliwie, ciemne siły przygotowują się do wprowadzenia jeszcze jednej rzekomo dla „ratowanie życia” szczepionki, i, bez wątpienia, oni zacierają ręce z radości, wyobrażając sobie, że ta ostatnia „wirusowe pandemia” będzie tą, która w końcu pozwoli im uzyskać zezwolenie na szczepionki na całym świecie.\nFaktycznie, artykuł, opublikowany 31 stycznia 2020 roku, ostrzegał nas o tym, że „szczepionka” dla tego „wirusa” ma być opracowana w USA przez trzy miesiące. A izraelscy naukowcy ogłosili, że szczepionka będzie gotowa w przeciągu kilku tygodni.\nW czwartek zespół izraelskich naukowców jeden-upped -USA, pokazując, że mogą one mieć szczepionki gotowe w ciągu kilku tygodni.” Zgodnie  z oświadczeniem, które cytuje ” The Jerusalem Post”, zespół  izraelskich naukowców znajduje się na progu tworzenia pierwszej szczepionki  przeciwko nowemu świrusowi, według słów ministra nauki i techniki Izraela Ofir Akunisa. Jeśli wszystko pójdzie zgodnie z planem, szczepionka może być gotowa  w ciągu kilku tygodni  i  jest dostępny do użytku przez człowieka w ciągu 90 dni.\nŹródło\nCDC po prostu „przypadkowo” ma testy diagnostyczne dla tego „wirusa” i „ zacznie wysyłać zestawy testowe dla państwowych i lokalnych partnerów w dziedzinie zdrowia publicznego w najbliższych dniach .”\nOczywiście, badania te są całkowicie fałszywe i właściwie nic nie wykrywają!   Źródło\nCiekawe, że obraz, który pojawia się w górnej części artykułu, omówione powyżej, mówi o tym, że faktycznie może mieć miejsce.\nZwróć uwagę, jak wszyscy ci  ludzie mają swoje twarze w swoich telefonach. Ci ludzie wierzą, że noszenie masek uchroni ich przed tym zbliżającym się „wirusowym” zagrożeniem. Jednak, prawdę mówiąc, ich radiacyjne urządzenia nie tylko osłabiają układ odpornościowy i uczynią je bardziej narażone na śmiertelne choroby, ale i same te urządzenia mogą być przyczyną rosnącego zainteresowania stanem zdrowia, która ma miejsce na całym świecie.\nPrzypuszczam, że to, co może dziać się w Chinach nie ma nic wspólnego z jakimś wirusem w ogóle (szczególnie z uwzględnieniem zespołu i już od wielu lat i jest określony w literaturze medycznej nic więcej niż zwykłe przeziębienie), a funkcja promieniowanie wywołane choroby, spowodowane wzrostem gęstości kuchenki wież telefonii komórkowej w połączeniu z 5г.\nAma encyklopedia medycyny, 1989, źródło\nŹródło\nMiliady domowych środków czyszczących, które, jak mówią, są w stanie zabić świrusy.\nŹródło \nSource \nPonadto, wygląda na to, że planowali rozwiązać te tak zwane „wirusowe” zagrożenie w ciągu kilku lat! Obrazy, które chcesz zobaczyć, to jest to, co nazywa się ” objawienie metody” – proces, za pomocą którego psychopatyczna „elita” z góry informuje nas, co planują zrobić. Robią te reklamy z wyprzedzeniem, ponieważ w swoim szalonym umyśle wierzą, że jeśli mówią nam, co mają zamiar zrobić, i nam to nie przeszkadza, to u nich jest nasza milcząca lub zgoda dorozumiana. \nW ten sposób, oni uważają, że nie można uznać ich duchowej odpowiedzialności lub odpowiedzialności za szkody, które powodują, ponieważ wszyscy byli z tym w porządku !!!\nOto szaleństwo tych, którzy przez dziesięciolecia i wieki sprytnie planowali sposoby, którymi chcieli nam zaszkodzić i / lub uzyskać kontrolę nad nami. Książka ta została opublikowana w 1981 roku.\n„Koontz”, najwyraźniej, napisał wiele książek pod różnymi aliasami. I tak było w przypadku The Eyes of Darkness, która pierwotnie została wydana w 1981 roku pod fałszywym nazwiskiem Leigh Nichols. W tej książce nie tylko wspomniana „broń biologiczna” z Wuhan, Chiny, ale i na następnej stronie jest również określana „wirus Ebola” z Afryki.\nJeden wnikliwy badacz (którego wolałbym nie nazywać ) zasugerował, że” Koontz”, najprawdopodobniej, nie jest ani jednym człowiekiem ( bo ten „człowiek” rzekomo napisał osiem książek w ciągu jednego roku! ), ale raczej grupą psychopatów, piszących konkretne rzeczy dla publicznej konsumpcji.\nJeszcze bardziej interesujący jest fakt, że Dean Koontz, nie jest to jedyny autor, który „przewiduje” ten nieprzyjemny „wirus”. Jak donosi The Sun, Daily, autor Sylvia Brown opublikowała w 2008 roku książkę pod tytułem  End of  Days: Predictions  and  Przepowiednie  About the End of  the  World.                       Sprawdź jej „przepowiednie”!!!!\nŹródło: The Sun Daily\nNa szczycie tego wszystkiego, właściwie zorganizowali pandemiczne „ćwiczenie” ( inaczej zwane wiertarką ) o nazwie Event 201 w Nowym Jorku    w  październiku  2019 roku.\nImpreza 201 stanowiło 3,5-godzinne konferencyjne ćwiczenie pandemii, która naśladować serię dramatycznych, opartych na luźnej dyskusji, kolidującej  z trudnymi, prawdziwymi dylematami  związanymi  z odpowiedzią  na hipotetyczną, ale naukowo wiarygodną pandemię. 15 globalnych liderów biznesu, rządu i zdrowia publicznego były  uczestnikami    symulacji eksperymentu, który oświetla nierozwiązane problemy polityczne i gospodarcze w  świecie rzeczywistym, które mogą być rozwiązane przy wystarczającej woli politycznej, finansowymi inwestycjami  i uwagą teraz i  w przyszłości.\nTo wydarzenie obejmowało nagrane wiadomości z kamery, bezpośrednie spotkania informacyjne „personelu” i moderowane dyskusje na konkretne tematy. Te pytania zostały starannie zaprojektowane w przekonywującej narracji, która przeszkoliła uczestników i odbiorców.\nŹródło\nI … 10 000 żołnierzy z 110 krajów zebrali się w Ухане, Chiny, w ten sam dzień na ” wojskowe gry  na całym świecie  2019  roku „!\nJednym z aspektów, który jest bardzo ciekawy i został szczegółowo omówiony tutaj, jest  zdarzenie 201   pandemicznego ćwiczenia, symulującego globalną pandemię świrusa, które odbyło się 18 października 2019 roku w ciągu zaledwie  6 tygodni przed tym, jak pierwszy przypadek wirusa  został zarejestrowany w Wuhan w Chinach. To, że nie wielu ludzi mówiło o tym, że  w ten sam dzień, 18 października 2019 roku, wojskowe drużyny   z całego świata  przeprowadzili swoją ceremonię otwarcia  zawodów, za którym poszedł amerykański  męski mecz,  w Wuhan Chiny, ground  zero błysku!\nŹródło\nNie można zrobić tych rzeczy; !? Oni już od dawna planowali to w hollywoodzkim stylu. I teraz wiem, że planują wydać jeszcze jedną rundę jesienią 2020 roku.\nNależy się spodziewać, że świrus  wróci jesienią, mówi  Fauci\nhttps://youtu.be/IM3sIf7aMfU\nTo, co ci psychopaci faktycznie robią, dosłownie powodując chorobę za pomocą swoich mikrofalowych i milimetrowych broni, jednocześnie ukrywają prawdziwą przyczynę chorób, na które ludzie cierpią, twierdząc, że są one spowodowane „wirusem”.”\nZałóżmy na chwilę odczytamy słowo „świrusy”, i od razu zauważmy, że słowo „virus” oznacza truciznę”, a słowo „korona” opisuje promieniowanie pola, które czasem emitują wysokiego napięcia urządzenia! ( Zobacz tutaj, tutaj  i tutaj aby uzyskać więcej  informacji ).\nW ten sposób słowo świrusy dosłownie oznacza zatrucie promieniowaniem!\nWyładowania koronowe – to wyładowanie elektryczne spowodowane jonizacją cieczy, takich jak powietrze, nowoczesny przewodnik, który jest elektrycznie naładowany.\nSamoistne wyładowania koronowe występują w sposób naturalny  w wysokonapięciowych układach, jeśli nie  zostaną podjęte kroki  w celu ograniczenia natężenia   pola elektrycznego…\nW wielu zastosowaniach wysokonapięciowych, nadmiar promieniowania „korona” stanowi efekt uboczny. Promieniowanie „koronowe” od wysokonapięciowych linii przesyłowych stanowi ekonomicznie znaczące straty zużycia energii przesyłanej na potrzeby komunalne. W akumulatorze sprzęcie, takim jak telewizory kineskopowe, nadajniki radiowe, rentgenowskie urządzenia i akceleratory cząstek, wyciek prądu spowodowana koronami, może stanowić niepożądane obciążenie łańcucha. W powietrzu korony wytwarzają gazy takie jak ozon (O3) i tlenek azotu (NO), a z kolei, dwutlenek azotu (NO2) i, w konsekwencji, kwas azotowy (HNO3), jeśli jest para wodna. Gazy te  są korozyjnymi  i mogą biodegradacji i охрупчивать pobliskie materiały, a także toksyczne dla ludzi  i środowiska.\nŹródło\nŹródło\nCzy jest to tylko zbieg okoliczności, że objawy tego „wirusa” odpowiadają dokładnie objawom choroby popromiennej, objawy które bez wątpienia są spowodowane zwiększoną gęstością anten wież telekomunikacyjnych i wdrożeniem 5G, do którego doszło w Wuhan ( patrz tutaj i tutaj ) i  innych częściach Chin . Zobacz także tutaj wiele informacji na temat promieniowania sytuacji w Chinach.\nSpójrz na  analizę tego obrazu, co dzieje się z wdrożeniem 5G w Ameryce i w miejscach, gdzie ludzie zachorowali na tego „wirusa”.\nNastępnie przeczytaj ten artykuł, który dokumentuje, jak lampy błyskowej „koronawirusa” odbywają się w tych samych miejscach, w których został wdrożony 5G .\nClaire Edwards znakomicie udokumentowało to na poniższych zdjęciach.\nGłówne media i władze, które nie powinny być, nigdy nie powiedzą nam prawdy o tym. Zamiast tego będą rozmawiać o rzekomo niebezpiecznym wirusie, jednocześnie prezentując nam fikcyjne pomysły o tak zwanej „zmianie klimatu”, tak, że nikt nigdy się nie spodziewał, że każde ocieplenie naszej planety, prawdopodobnie związane z radiacyjnym ciepłym od dużej gęstości wież komórkowych i bezprzewodowych urządzeń ( w końcu, mikrofale naprawdę gotowane rzeczy ), lub że wszelkie epidemie, które doświadczamy w ciągu 5-15 lat, będą związane z radiacyjnym zatruciem od wpływu rosnącej gęstości trującego, неионизирующего promieniowania.\nWięc zacznijmy od samego początku. Ale najpierw, to jest komentarz, który niedawno zrobił na  Jajo-tubie wideo, które są cenzurowane…\nPonieważ wiadomo, że częstotliwości 5G negatywnie wpływają na wchłanianie tlenu w komórkach i organizmie ( patrz tutaj i tutaj );\nI ponieważ wszystkie objawy, o których donoszą, również wymienione jako  te same objawy, związane z mikrofalową chorobą ” ( tj. na chorobę popromienną, która może być spowodowana działaniem wszystkich urządzeń bezprzewodowych, w tym urządzenia 4G-patrz tutaj http://www.radiationdangers.com/microwave-sickness/ );\nI tak jak „grypa” i mikrofalowa choroba mają wiele wspólnych objawów ( patrz tutaj: http://www.radiationdangers.com/microwave-sickness/the-flu-and-microwave-sickness-share-many-of-the-same-symptoms/ );\nA ponieważ „grypa” została pokazana nie jako wynik „wirusa”, a raczej jako spowodowana elektrycznością choroba  ( patrz książkę Artura Фирстенберга „niewidzialna Tęcza” ); To sprawiedliwa ocena, aby przypuszczać, że wszędzie tam, gdzie 5G funkcjonuje, ludzie będą szybko stawali się śmiertelnie chorymi. Obudzić ludzi. Cała sieć bezprzewodowa jest przeznaczona do tego, aby nas zniszczyć. Będą oskarżać te wywołane napromienianiem choroby na różnych rzeczach, ale jest jedna rzecz, której nie będą robić, to powiedzieć ci, że twoje urządzenia i wszystkie twoje bezprzewodowe społeczeństwo są problemem. Musisz sam wiedzieć.\n https://www.birthofanewearth.com/1/paperback-release-the-dark-side-of-prenatal-ultrasound/\nLudzie, ci, którzy noszą maski, oczywiście, nie zamierzają chronić się przed promieniowaniem wywołującym choroby. Wyjątek promieniowania i / lub promieniowanie ekranowanej odzieży-to jedyne rzeczy, które działają.\nŹródło\n1. 5G - AKTYWNIE DZIAŁA  W  WUHAN . \n„Wuhan-Centralna chińska prowincja Hubei zbudowała ponad 300 stacji bazowych 5G i osiągnęła pełne pokrycie sygnału 5G w swoich miastach na poziomie prefektury, powiedziały lokalne źródła telekomunikacji.\nHubeiski oddział China Mobile poinformował, że od lutego 2018 roku wybudowano ponad 300 stacji bazowych 5G, i  kilkanaście ośrodków 5G eksperymentalnych zostało zakończone w miastach, w tym Сяогань, Yichang   i  Цзинмэнь.”\nŹródło\n„Do tej pory China Mobile ustaliła 100 stacji bazowych 5G w Wuhan, stolicy prowincji Hubei, i rozpoczyna zakrojone na szeroką skalę testy, według fana Бинхэна, dyrektora oddziału w Hubai.”\nŹródło\nChiny, w swoim dążeniu, aby zająć pozycję lidera w wyścigu 5G, do końca 2019 roku… zainstalowały 130 000 anten 5G na terenie całego kraju, [19]  Z 10 000 antenami zainstalowanymi tylko w Wuhan .[20]…\nChiny już mają w sumie ponad 80 000 stacji bazowych 5G makro , jak zwykle, wieże komórkowe z anten  i innych urządzeń, które emitują sygnały radiowe na rozległych terenach, stwierdzili urzędnicy państwowi. Powiedzieli, że Chiny zakończą rok z około 130 000, podczas gdy szacuje się, że Bernstein Researcher  Korea Południowa będzie na drugim miejscu  z 75 000… \n\nTo w zasadzie oznacza, że Chiny nagle włączyły przełącznik 5G, zaledwie dwa miesiące przed wybuchem COVID-19, nagle obejmujące wiele miast w tym bezprzewodowym promieniowaniu 5G. I w momencie pisania tego artykułu, liczba przypadków COVID-19 w Korei Południowej również zaczyna szybko rosnąć. Jak widzimy z powyższego artykułu, Korea Południowa ma największą liczbę anten 5G z 75 000 .  To bardzo wiele dla kraju tej wielkości. Czy  istnieje  tu  związek?  Myślę, że jest.”\nŹródło\n2. CZĘSTOTLIWOŚCI 5G, JAK WIADOMO, POWODUJĄ POWAŻNE ZABURZENIA W ZDOLNOŚCI ORGANIZMU DO WCHŁANIANIA I WYKORZYSTANIA TLENU . \n„FCC otworzyła pasmo fal milimetrowych i będą nadawać na 60 GHz… dla nowego 5G i nowego Wi-fi. To się nazywa wi-gig … ta rzecz jest po prostu okropna. 60 GHz-to widmo absorpcji cząsteczek tlenu… to częstotliwość, na której zaczynają reagować cząsteczki tlenu… będą korzystać 5G, aby się mylić z tlenem… gdy trafisz cząsteczki tlenu z 60 GHz milimetrowymi emisjami, to wpływa na orbicie właściwości elektronów… [to wpłynie], jak tlen jest wchłaniany w organizmie. kiedy zaczniesz wpływać na zdolność cząsteczek tlenu kontaktujących się z hemoglobiną we krwi, nie będzie można transportować tlenu do tkanek… to również wpływa na twoją zdolność do wytwarzania witaminy D. W Stanach Zjednoczonych istnieją dwa miejsca, gdzie było to stosowane w szkołach. To powodowało paraliż, zaburzenia rytmu serca, problemy neurologiczne, problemy z mrowieniem w kończynach, ludzie mdleli, ludzie odczuwali zmęczenie, złe samopoczucie, wszystkie te dziwaczne choroby. Ci ludzie potrafili zmusić cię zabić, i cieszyć się tym, i zabijać swoich dzieci, i za to zapłacić.”\nŹródło\n„60 GHz … utknie w powietrzu. Ono  w ogóle źle się propaguje. Więc jest to trochę dziwne, że Ofcom [ sterowanie komunikacji w wielkiej Brytanii ] zamierzają oddać [ tę część widma ] daleko od… gdybym miał wysadzić wystarczy amplitudę 60 GHz w cząsteczkę tlenu, mógłbym go złamać. I ten atom tlenu dołączy do innych molekuł tlenu i stworzy 03. 03 morderstwa. Na 50ppm, zabije całe biologiczne życie. Więc jest to trochę dziwne, że Ofcom nawet chciałby, aby ktoś wykorzystał tę część widma – i nie ma znaczenia, do czego?.”\nŹródło\n„Dopiero zaczynamy zdawać sobie sprawę, że świrus-owe  zapalenie płuc początkowo powoduje pozbawienie tej formy tlenu , którą nazywamy „ciche niedotlenienie – „milczące” ze względu na jej  zdradę, trudnym dla  natury…\nZapalenie płuc – jest to infekcja płuc, w której powietrzne worki wypełnione płynem lub ropą. Zazwyczaj u pacjentów, rozwija się dyskomfort w klatce piersiowej, ból przy oddychaniu i inne problemy z oddychaniem. Ale kiedy Covid powoduje zapalenie płuc po raz pierwszy uderza, pacjenci nie czują braku oddechu, nawet gdy ich poziom tlenu spada. I do czasu, kiedy oni to robią, mają niepokojąco niski poziom tlenu , przy zapaleniu płuc, umiarkowane        i ciężkie powikłania. ( jak widać na zdjęciu rentgenowskim klatki piersiowej ). Normalne nasycenie tlenem dla większości ludzi na poziomie morza wynosi od 94 do 100 procent; u pacjentów z covidowym  zapaleniem płuc, których widziałem, nasycenie tlenem było niskie , tylko -50 procent.”\nŹródło\nProszę obejrzeć ten krótki film nowojorskiego lekarza intensywnej terapii, explainer, że widzi się w stosunku do swoich pacjentów z „świrusem”.\n„To wygląda na to, jakby dziesiątki tysięcy moich rodaków z Nowego Jorku byli w samolocie na wysokości 30 000 stóp i ciśnienie w kabinie  powoli отпускалось.  Pacjenci  powoli  umierają  z  braku  tlenu.”\nhttps://www.bitchute.com/video/i1lCAUEcMtlg/\nNie są to typowe objawy zapalenia płuc! W rzeczywistości, to jest dokładnie to, co może i będzie się działo, kiedy ludzie są narażeni na częstotliwości 60 GHz 5G. Należy pamiętać, że 5G został uruchomiony w Nowym Jorku ( patrz tutaj i tutaj  ). A także we Włoszech. Proszę zobaczyć ten link , aby  uzyskać więcej informacji  na  temat sposobu wdrażania 5G we Włoszech.\nOstatnie 48 godzin widzieli wielkie objawienie: COVID-19 powoduje długie i postępujące niedotlenienie ( głodzenie organizmu tlenu ), wiążąc się z grupami hemu w hemoglobinie w swoich erytrocytów. Ludzie po prostu desaturować ( tracąc o2 we krwi ), a to ostatecznie prowadzi do uszkodzenia narządów, które zabijają ich… pacjenci wracający do ponownej hospitalizacji w ciągu kilku dni lub tygodni po wyleczeniu, cierpiących z wyraźnie opóźnionym niedotlenieniem lejkoèncefalopatii, wzmacniają pojęcie COVID-19 pacjentów cierpią  z powodu niedotlenienia, pomimo braku  oznak oddychania „zmęczenie lub zmęczenie.\nŹródło \nPunkt, który chcielibyśmy podkreślić tutaj - gdzie jest doktor, zauważa w szpitalu w Kirkland  w stanie Waszyngton, gdzie wskaźnik śmiertelności wyniósł około 60% – był nie tylko obszarem, przodującym do wdrażania -5G – również poziom  wi-fi elektrosmogu mierzony tam był najwyższy, który kiedykolwiek  zmierzono.\nZaproponowano również hipotezę, że nie tylko Wuhan jest liderem  we wdrażaniu -5G, ale i to, co Princess cruise schip – to motania się -5G.              ( duże miasta, prowadzące wdrożenie, prowadzą do śmierci?? ) – Mamy w końcu trochę zagłębić się w bardziej zaawansowanej biofizyce tutaj o tym, jak hi GHz w -5G powoduje utratę tlenu w krwi / wirusowej podatność -intro: https://www.youtube.com/watch?v=CtfqUtW_8AA … proponuję, kiedy obliczamy biofizyczną prędkość spinów elektronów w węzłach  tlenowej względu na hemoglobinę – dowiemy się, dlaczego w krytycznym GHz w gęstość elektronów -5G, przekracza określony próg, wzbudzenia elektronowego plecy, wymagana dla fazowej blokady tlenowej związku, hamuje. Harald mówi, że stało się to w pobliżu Berlina, kiedy uruchomili  dodatkowe  mikrosatelity  w celu  zwiększenia  nasycenia  -5G.\nŹródło\nŹródło\n3. TWIERDZI SIĘ, ŻE „KORONAWIRUSY „POWODUJE” ATYPOWE ZAPALENIE PŁUC I CIĘŻKIE CHOROBY UKŁADU ODDECHOWEGO, ZABURZENIA, KTÓRE DOPROWADZIŁY DO ŚMIERCI. \n– Wszystko zaczęło się od lekkiego kaszlu. Ciągle bekał i skarżył się na trudności w oddychaniu… lekarz powiedział, że u niego, wydaje się, problemy z sercem i zaproponował mu zostać w szpitalu. Wyglądał zdrowo, za wyjątkiem niewielkiej infekcji w jednym lekkim okolicy. Przez dwa tygodnie był martwy, oba płuc zakażone i odmówiły organy. Jego lekarze w szpitalu w Wuhan Jinyintan ustalili przyczynę śmierci jako ” nieznane zapalenie płuc.” To było na kilka dni przed tym, jak chińskie władze służby zdrowia ustaliły przyczynę nowego wirusowego zapalenie płuc jak 2019-nCoV, świrusy, który po raz pierwszy pojawił się w grudniu w handlowym mieście Wuhan, jego rodzinnym mieście.”\nŹródło\n„Świrusy – to typy wirusa, które zwykle wpływają na drogi oddechowe ssaków, w tym człowieka. Są one związane z przeziębieniem, zapaleniem płuc i ciężkim ostrym zespołem niewydolności oddechowej (sars), a także mogą mieć wpływ na jelita.”\nŹródło\n„Objawy świrusa początkowo naśladują grypy -gorączka, ból głowy, kaszel, zmęczenie i bóle mięśni. U 41 pacjentów przyjmowanych do szpitala, każdy miał zapalenie płuc.”\nŹródło\n4. Wszystkie radiacyjne częstotliwości, w tym w zakresie radiowym, mikrofalowym i zakresie fal milimetrowych (3G, 4G i 5G) – mogą powodować poważne choroby układu oddechowego, zaburzenia. \n„W pierwszym badaniu tego rodzaju naukowcy przywiązany monitory pola magnetycznego na ciężarnych kobietach, aby określić ich poziom oddziaływania i studiowali, czy było to związane z ryzykiem rozwoju astmy u ich dzieci. Okazało się, że dzieci urodzone przez kobiety z wysokim poziomem oddziaływania pól elektromagnetycznych (EMF) — w tym od kuchenek mikrofalowych, suszarkach i linii energetycznych — mieli ponad trzy razy wyższy poziom astmy w porównaniu z tymi, których matki miały najniższy poziom oddziaływania.”\nŹródło\n„Naświetlanie tłumiło szybkość zużycia tlenu przez dzwonić … i zwolniło tempo oddychania wskutek wyczerpania ATP.”\nŹródło: Nn. P. Залюбовская, działanie biologiczne milimetrowych fal radiowych, Kijów, lekarskie sprawa, w języku rosyjskim, 1977, nr 3: 116-199 .\n5. PLACÓWKA OD KILKU LAT WIE, ŻE WPŁYW ICH TAK ZWANYCH „PROMIENIOWANIE METOD LECZENIA MOŻE PROWADZIĆ DO ZAPALENIA PŁUC. \n„Promieniowanie zapalenie płuc, są to ostre objawy promieniowania wywołane przez choroby płuc … objawy zwykle obejmują:\nkaszel \nduszność ( podczas wysiłku lub w spoczynku ) \nstany podgorączkowe \ndyskomfort w klatce piersiowej \nплевритная ból” \nŹródło\n6. ODDZIAŁYWANIE MIKROFAL MOŻE RÓWNIEŻ PROWADZIĆ DO RÓŻNYCH FORM CHORÓB PŁUC I ZAPALENIE PŁUC. \nObjawy „mikrofalowej choroby” – stan, po raz pierwszy opisany przez Rosjan w 1970 roku, obejmują astmę, zapalenie oskrzeli, zapalenie płuc, zapalenie zatok przynosowych, itp. ZOBACZ TUTAJ WIĘCEJ INFORMACJI.\nNALEŻY ZWRÓCIĆ UWAGĘ NA OBJAWY, KTÓRE LUDZIE MAJĄ W CHINACH, I PORÓWNAĆ JE Z OBJAWAMI PODANYMI PONIŻEJ MIKROFALOWEJ CHOROBY.\nObjawy świrusa obejmują gorączkę, kaszel, duszność i trudności  z oddychaniem. Jednak, według chińskich MEDIÓW państwowych, niektóre z nich nie mają żadnego z tych objawów i zamiast tego doświadczają nudności, biegunki, zmęczenie, brak koncentracji uwagi, bóle głowy, nieregularne bicie serca, ból  w klatce piersiowej, zapalenie rogówki  i  mięśni, ból  w kończynach, bóle pleców i talii .\nŹródło\nJak donosi NY Post w tej historii od 10 kwietnia, prawie połowa ciężkich przypadków covid-19 wykazały również objawy neurologiczne, w tym zawroty głowy, bóle głowy i zaburzenia świadomości. \nI z Daily Mail sprawozdawczości w kwietniu tego roku 11 historia , że jeden bardzo dziwny objaw ludzie donoszą, że było swego rodzaju ‚syczenie’ lub ‚brzęczenie’ lub ‚elektryczne wrażenia’ na lub pod skórę, nie mogliśmy nie zauważyć, że te wszystkie „objawy” są również objawami choroby kuchenki mikrofalowej…\nźródło\n– Syk, elektryczne wrażenie, ataki serca i uczucie utonięcia-to tylko niektóre  z bardzo niekonwencjonalny przejawów Covida-19. Tyle, że jest to nie tyle wirusa, ile narażenia na zatrucie… ”\nźródło\nWiele [lekarze] także donoszą o dziwnych, niepokojących przypadkach, które, jak się wydaje, nie przestrzegają zasad, na których studiowali. Opisują pacjentów z zaskakująco niską zawartością tlenu – są tak niskie, że normalnie bez świadomości lub są zbliżone do śmierci – rozmawiając i przesuwając po swoich telefonów. U bezobjawowych kobiet w ciąży nagle następuje zatrzymanie akcji serca. Pacjenci, którzy dla wszystkich ogólnie przyjętych standardów, jak się wydaje, mają lekkie choroby, zmniejszające się w ciągu kilku minut i umierające w swoich domach.\nŹródło\n7. TAK ZWANA „GRYPA” I MIKROFALOWE CHOROBY MAJĄ WIELE WSPÓLNYCH OBJAWÓW \n„Jak człowiek, który doświadczył objawy mikrofalowej choroby z pierwszej ręki ( dzięki instalacji bezprzewodowego układu Słonecznego w moim domu i z jednoczesnym umieszczeniem cyfrowego inteligentnego licznika „opt-out”, który od tego czasu został usunięty ), mogę potwierdzić, że wyżej wymienione objawy mogą szybko i wściekle atakować i przybliżać człowieka do śmierci, zanim człowiek zrozumie, co go uderzyło. W ciągu roku, po tym, jak słoneczny moduł wi-fi i cyfrowy inteligentny licznik „opt-out” zostały zainstalowane w naszym domu, u jednego członka rodziny rozwinęły się poważne wysypki skórne, wypadanie włosów, przewlekłe owrzodzenia w jamie ustnej  i dwukrotnie występuje niewydolność oddechowa. Jeszcze jeden członek rodziny cierpiał na szybką utratą pamięci, problemy z równowagą, przewlekłe skurcze w nogach i mięśni, węchowych zmian, w tym utratę smaku i zapachu, i rak tarczycy. Sam cierpiał na „ szum w uszach, „bezsenność, dziwna funkcja serca, przewlekłe zawroty głowy i nudności, problemy ze wzrokiem, problemy ze słuchem, tymczasowa utrata zapachu i smaku, intensywne bóle głowy, ostry ból i ucisk w głowie, bóle stawów i mięśni, skurcze mięśni, uczucie skrajnej słabości i zmęczenia, które zmuszały mnie czuć, że byłem bliski śmierci,  i powtarzające się, ciężkie ataki z „grypą.”\nŹródło\nW swojej serii artykułów o epidemii w Chinach ( archiwum tutaj ) i wskazał,  że zapalenie płuc—kluczowy wskaźnik „świrusa”—może być spowodowane wieloma innymi czynnikami… i chińskie władze nie wymagają bezpośredniego testowania na świrusy. Zamiast tego używana jest tomografia komputerowa klatki piersiowej. Jeśli te zdjęcia pokazują oznaki zapalenia płuc, to do pacjenta śmiesznie stosuje się skrót” epidemia świrusa”.\nJak również zauważyć, że historycznie zapalenie płuc było jedną z głównych chorób w Chinach. Na długo przed pojawieniem się nowego świrusa  ludzie  w Chinach umierali na zapalenie płuc z prędkością około 300 000 rocznie. Teraz te osoby, odchodzą na choroby w 2020 r., mogą być błędnie nazwani „zabójczymi epidemicznymi skrzynkami”.” Jak wygodniej.\nCóż, okazuje się, że amerykańskie centra kontroli chorób (CDC) już od dawna prowadzą własną metodę przekrętu z  zapaleniem płuc.\nKilka lat temu, gdy pisałem o grypie, otrzymałem e-mail od Petera Dosha  i Marcina Малоуни. Podali mi dane z własnych kart CDC, dokumentujące śmiertelność grypy w USA. I wskazywały na kłamstwo. Dalej Dosha napisał analizę dziennika BMJ Online (grudzień 2005 roku). Oto kluczowy cytat  z raportu::\n„[Według statystyk CDC], w 2001-2001 latach „grypa i zapalenie płuc” zabrano 62 034 życia, 777 z nich były związane z zapaleniem płuc i 257-z grypą, a tylko w 18 przypadkach wirus grypy został pozytywnie zidentyfikowany.”\nWidzisz, CDC stworzył jedną wspólną kategorię, która łączy w sobie śmierć od grypy i zapalenia płuc. NAZYWAJĄ TĘ KATEGORIĘ NA GRYPĘ.” Dlaczego oni to robią? Dlaczego oni pozornie twierdzą, że śmierć od zapalenia płuc, to powikłania związane z grypą? Bo chcą sprzedać lekarzom i opinii publicznej historię  o „szkodliwości grypy”.”\n– Jon Raport.\nŹródło\n8. W SWOJEJ KSIĄŻCE ” NIEWIDZIALNA TĘCZA ” ARTUR ФИРСТЕНБЕРГ TWIERDZI, ŻE GRYPA TO WCALE NIE JEST CHOROBĄ WIRUSOWĄ, A RACZEJ ELEKTRYCZNIE WYWOŁANĄ CHOROBĄ! \nSzybkość, z jaką rozprzestrzenia się grypa, i jego przypadkowy i jednoczesny charakter dystrybucji na przestrzeni wieków, stawia w ślepy zaułek naukowców, i to było najbardziej przekonujący powód, dla niektórych, nadal podejrzewać atmosferyczne oddziaływanie energii elektrycznej jako przyczynę, pomimo znanej obecność szeroko studiowanego wirusa. Oto próbka opinii, starych i współczesnych:\nMoże nigdy jeszcze nie zaobserwowano, aby choroba w tak krótkim czasie dotknęła tak wielu ludzi, jak grypa, prawie całe miasto, miasto lub powiat, uderzył w ciągu kilku dni, naprawdę dużo wcześniej, niż można by przypuszczać, aby rozprzestrzeniać od zakażenia.\nMerc,kat opowiada, że gdy królował w Hiszpanii, w 1557 roku, duża część ludzi  została zaatakowana  w jeden dzień.\nDoktor Glass mówi, że kiedy to było szeroko rozpowszechnione w Exeter, w 1729 roku, dwa tysiące zostały  zaatakowane przez jedną noc.\nШадрах Рикетсон, doktor nauk medycznych (1808), Krótka historia  grypy:\n„Należy pamiętać o tym prostym fakcie, że ta epidemia dotyka cały region w ciągu jednego tygodnia; ponadto, cały kontynent, tak samo duży, jak Ameryka Północna, wraz z całym West - India, w ciągu kilku tygodni, gdzie mieszkańcy na tak ogromnym terytorium kraju, nie mogli by w ciągu tak krótkiego okresu czasu mieć najmniejszego komunikacji lub komunikowania się w ogóle. Już z samego tego faktu wystarczy, aby wykluczyć wszelką możliwość rozprzestrzeniania się zakażenia z jednego osobnika do drugiego. \nAlexander Jones, doktor medycznych i nauk fizycznych (1827), Филадельфийский  magazyn:\n„W przeciwieństwie do cholery, ona wyprzedza w swoim biegu prędkość komunikacji międzyludzkiej. \nТеофилус Thompson, doktor nauk medycznych ( 1852 ), roczniki grypy lub epidemicznej катаральной gorączki w wielkiej Brytanii z 1510 w 1837 roku:\n„Sama infekcja jest niewystarczająca, aby wyjaśnić nagły wybuch choroby w tym samym czasie w bardzo odległych krajach i ten ciekawy sposób, w jaki ona, jak wiadomo, atakuje załogi statków na morzu, gdzie kontakt  z  infekującymi miejsc lub ludzi została wykluczona.\nSir Моррел Mc,kenzie, Doktor Medycyny (1893 ), Dwutygodnik - Publiczny\n„Zazwyczaj grypa rozprzestrzenia się z taką samą prędkością, że i człowiek, ale czasami wydaje się, wybucha jednocześnie w szeroko oddzielonych częściach świata. \nJorgen Birkeland (1949), mikrobiologia i antropologia ‚\nSource\n———\nCO DZWONI „HISZPANKA” Z 1918 ROKU?\nTo już nie pierwszy przypadek, gdy strach przed pandemią wirusa ogarnął cały świat. Wcześniej słyszeliśmy prognozy —  z  których żadne nie spełniło się: świńskiej grypy, ptasiej grypy, SARS, БВРС, wirusem Zachodniego Nilu, wirus zike ‚ a  i  gorączka Ebola  giną  miliony ludzi.\nWarto zauważyć, że wszystkie te lęki miały miejsce po tym, jak internet zastąpił kontakt z człowiekiem, jako zdominowanego przez środki komunikacji, a słowa i obrazy na ekranie zastąpiły rzeczywistość. Dziś to zaszło tak daleko, że w końcu ludzie gotowi zamknąć świat, a nie widzieć, co dzieje się wokół nich.\nNie znam się na tym, ale do tych prognoz w ogóle nie ma żadnych podstaw. Za całą tą histerią warto obawiać, że katastrofa, która była „grypą” 1918 - 1921 roku, wróci ponownie. W końcu, od grypy 1918 roku  zachorowała jedna trzecia ludności świata i  zginęło około pięćdziesięciu  milionów osób.\nAle jest kilka ważnych faktów na temat grypy  w 1918 roku, które nie są powszechnie znane:\nGrypa z 1918 roku nie była spowodowana wirusem. \nGrypa z 1918 roku nie była zaraźliwa i nie rozprzestrzeniała się przy bezpośrednim kontakcie człowieka z człowiekiem. \nGrypa z 1918 roku rozpoczęła się w amerykańskich bazach wojskowych, gdzie żołnierzy szkolono bezprzewodowej telegrafii. Rozprzestrzenił się na całym świecie na dziesięciu tysiącach statków MARYNARKI wojennej stanów ZJEDNOCZONYCH, wyposażonych w nowoczesne stacje bezprzewodowe. Stało się to o wiele bardziej śmiercionośne we wrześniu 1918 roku, kiedy pierwsza całodobowa głosowa stacja radiowa, na tyle mocna, aby być odebrana w większości części świata, emitowana w New Брансуике, w stanie New Jersey, w służbie działań wojennych USA, tym samym uruchamiając nowoczesną erę komunikacji radiowej. \nWysiłki lekarzy, pracujących na państwowej służbie zdrowia w USA, aby udowodnić zakaźny charakter grypy  1918 roku były heroiczne  i doprowadziły do głośnej i kilkakrotnie porażki. W listopadzie i grudniu 1918 roku, a także  w lutym i marcu 1919 roku próbowali zarazić grypą  sto zdrowych ochotników w następujący sposób:\nSą one umieszczone wydzielina z jamy ustnej, nosa, gardła i oskrzeli od hospitalizowanych chorych na grypę w nos, gardło i oczy wolontariuszy; \nŻe wstrzyknięto krew od pacjentów w wolontariuszy; \nSą filtrowane śliski materiał od chorych la petite i wstrzykuje się go pod skórę wolontariuszy; \nKazali wolontariuszy podają sobie ręce chorych pacjentów, rozmawiać  z nimi, zbliżenie twarzy do siebie, w ciągu pięciu minut, a następnie zmuszony do pacjenta wydech z całych sił, podczas gdy ochotnik, znajdujący się w dwóch calach od nich, wdychał, a następnie zmuszony do pacjenta kaszel prosto w twarz dobrowolny, pięć razy. \nŻaden z ochotników w żadnym z tych eksperymentów nie zachorował  w każdym przypadku. Podobne próby aby zarazić zdrowe konie wydzielinami  z koni, chorych na grypę, doprowadziły do takiej głośnej kompromitacji.\nTe eksperymenty, a także inne fakty na temat grypy w 1918 roku, jak i o grypie w ogóle, szczegółowo omawiane są i dokumentowane w rozdziałach 7, 8 i 9 w mojej książce „niewidzialna Tęcza: historia elektryczności i życia” (AGB Press 2017, Chelsea Green 2020).\nHistorycznie złożyło się tak, że grypa był nieprzewidywalną chorobą, która uderzała bez ostrzeżenia i bez rozkładu jazdy i zniknęła tak nagle i tajemniczo, jak się pojawiła, nie pojawiając się ponownie w ciągu wielu lat lub dziesięcioleci. Ona nie istniała na tej ziemi jak coroczna choroba do Światowego wdrażania sieciowego do oświetlenia i zasilania, które miało miejsce w 1889 roku. Wielu z lekarzy osób, które przechodziły grypę w 1889 roku, twierdziło, że nigdy wcześniej nie widziało takiego przypadku. Ale od tego czasu grypa nie zniknęła nigdzie indziej na ziemi.\nAle najtrudniejsze dla ludzi – to pozbyć się widoku, tak głęboko zakorzenionego w naszym społeczeństwie, że choroba, to jest to samo, co bakteria lub wirus. Takie spojrzenie na świat, jak na bitwę, a nie na społeczność, nie jest prawidłowe. Tak, jest zespół wirusa związany z grypą. Nie, wirus nie powoduje choroby.\nGrypa to zaburzenie neurologiczne, które może mieć wpływ na niemal wszystkie narządy, z respiratorami objawów lub bez nich. Jest to spowodowane elektrycznością.\n– Artur Фирстенберг\n==============================================\n9. WSZYSTKIE MOJE BADANIA NA TEMAT WIRUSÓW POKAZUJĄ, ŻE SĄ ONE NATURALNĄ CZĘŚCIĄ UKŁADU ODPORNOŚCIOWEGO I NIE SĄ SZKODLIWE! WYDZIELAJĄ JAKIŚ CHEMICZNY LUB ROZPUSZCZALNIK, KTÓRY POMAGA DEZINTEGRACJI TOKSYN, CO SPRAWIA, ŻE TOKSYNY SĄ ŁATWIEJSZE DLA ORGANIZMU, ABY JE WYDALIĆ. \nWirusy – to cząsteczki DNA lub RNA, z wieloma innymi białkami…zdarzają się, gdy komórki są zatrute. Nie są one przyczyną czegokolwiek … kiedy twoje komórki są zatrute. Starają się oczyścić siebie, pozbywając się  śmieci, który nazywamy wirusami…\nWięc co stało się w 1918 roku? Była ogromna pandemia – i każda pandemia w ciągu ostatnich 150 lat, to był skok w elektryfikacji Ziemi, w 1918 roku, za późno, jesienią 1917 roku, było wprowadzenie fal radiowych na całym świecie.\nZa każdym razem, gdy użytkownik dopuszcza dowolny system biologiczny na działanie nowego pola elektromagnetycznego, można zatruć ją i zabić niektórych, a inni popadają w swego rodzaju pozornej śmierci, więc zastanawiam się, co żyją trochę dłużej – i boli.\nA potem zaczyna się Druga wojna Światowa, z następnej pandemii.\nWraz z wprowadzeniem sprzętu radarowego na całej Ziemi, obejmujące całą Ziemię w radarowych polach, był pierwszy raz, kiedy ludzie kiedykolwiek byli blisko.\nW 1968 roku była w Hong Kongu grypa, i to był pierwszy raz, kiedy Ziemia ma warstwę ochronną w pasie Van Allena, który w istocie łączy kosmiczne pola od Słońca i Ziemi od Księżyca i Jowisza, itp., to integruje i zasadniczo rozdziela to żywym istotom na Ziemi.\nI umieściliśmy satelity, emitujące radioaktywną częstotliwość  w pasie                Van Allena. Przez pół roku u nas rozpoczęła się wirusowa pandemia. Dlaczego wirusowa? Bo ludzie byli zatruwani. Wydzielają toksyny. Wyglądają  jak wirusy. Ludzie myślą, że to epidemia grypy…\nI skończę tylko na tym, że pragnę zauważyć, że w ciągu ostatnich sześciu miesięcy nastąpił dramatyczny  skok  z elektryfikacji Ziemi. I jestem pewien,  że wielu z was wie, co to jest, to się nazywa: -5G, gdzie teraz jest, 20 000 emitujących promieniowanie satelitów, dokładnie tak samo, jak emitująca promieniowanie rzecz w kieszeni, i na twoim nadgarstku, i że używasz tego cały czas. Jest to niezgodne ze zdrowiem.\n– Thomas Cowan, MD\nSource\nŹródło\n„Istnieją bardzo przekonujące dowody na to, że twoje ciało jest w rzeczywistości tworzy cząsteczki te [tj. wirusy] w ramach procesu samooczyszczania. Tak więc, nie jest to wirus, który atakuje cię z zewnątrz      [a następnie] kradnie DNA z twojej komórki i niszczy komórkę. Nie. Twoje ciało tworzy ich particles in aby zniszczyć uszkodzone komórki, zanim będą     w stanie sprawić, że komórki obok nich będą chorymi… Więc to, co nam powiedziano, to wirusy, które sprawiają, że są chorymi, w rzeczywistości cząstki, które twoje ciało tworzy, aby cię zdrowym.”\nŹródło\n„Istnieją  bardzo poważne pytania o to, czy były kiedykolwiek wyróżnione różne wirusy, sprawdzone, czy ich istnienie jest udowodnione, że powodują choroby. Między badaczami, w tym niezależnych badaczy, należy przeprowadzić otwarte, długotrwałe, stale publikowane debaty.”\nŹródło\n„Nie ma co dyskutować w tym kierunku… to zawiera w sobie zadawać pytania: \n„jak naukowcy mogą właściwie izolować nowy wirus i go zidentyfikować? \ni: „jakie są właściwe standardy dla dowodów na to, że dana bakteria powoduje tę lub inną chorobę?” \nKiedy zadajesz te pytania i szukasz odpowiedzi, a następnie znaleźć się po pas w bagnie. Śmieci, unoszące się wokół ciebie, to jest po prostu okropne.\n„Źródło\n— Jon Rappoport\nWirusy - to w zasadzie bity informacji genetycznej / materiału, który, myślę, że to sprawiedliwe, by powiedzieć, zawsze odbywa się wewnątrz naszych własnych ciał. One są wytwarzane z różnych powodów, do przekazywania informacji genetycznej między komórkami itp. \nKsiążka Janine Roberts „strach przed niewidzialnym”\n1- bardzo często są one produkowane w odpowiedzi na stres i mikrofale, substancje chemiczne itp.\n2- wirus – jest to około jedna miliardowa wielkości normalnej komórki w organizmie, a on nie jest „żywy”, nie ma własnego metabolizmu, aby się rozmnażać lub robić coś.\n3- ten pomysł o tym, że wirus „mutuje”, nie jest dokładna. Są one stale różnią się, ponieważ tworzymy je w odpowiedzi na różne  wyzwania      i sytuacje.\n– Patrick R.\n==============================================\nJoe Имбриано uważa, że wirus – jest to zespół oczyszczania ciała. On mówi, że oskarżać wirusy, to tak, jakby oskarżać ratowników w wypadku tylko dlatego, że oni są zawsze tam gdzie  są.\n==============================================\n„Niemcy przygotowywali się zadeklarować -i byli blisko udowodnienia, że wirusy zostały prawidłowo opisane, i faktycznie elektromagnetyczne z natury … wirus może być najlepiej opisany jako elektromagnetyczny wampir …” źródło\n– James \nOd 1933 roku i do dnia dzisiejszego wirusolodzy nie byli w stanie przedstawić ani jednego badania pilotażowego, udowadniającego, że grypa rozprzestrzenia się za pośrednictwem normalnego kontaktu między ludźmi. Wszystkie próby, aby to zrobić nie udały się.\n– Artur Фирстенберг\nTak, jak by to zabrzmieć szokująco, nawet tak zwany wirus Aids jest również wielkim oszustwem. AIDS, oczywiście istnieje, ale nie jest spowodowany jakimś konkretnym wirusem. Wręcz przeciwnie, AIDS dzwoni bardzo osłabionym układem odpornościowym od narkotyków rekreacyjnych dla wzmocnienia dewiacyjnego seksu, zbyt dużej ilości antybiotyków i innych legalnych narkotyków, chorób przenoszonych drogą płciową, zwłaszcza od sodomitów/dewiacyjne seksu z wieloma partnerami z biegiem czasu i złego jedzenia w ogóle. I leki do leczenia ludzi, którzy rzekomo zainfekowali się  wirusem Aids, również dość zabójcze, zwłaszcza chemiczne preparaty, takie jak AZT, które kiedyś wiele lat temu stosowano do leczenia Aids.\n– Jschmitt\nTylko w Stanach Zjednoczonych są tysiące przypadków Aids bez HIV. Peter Дюсберг odkrył 4 621 wydarzenie, które miały miejsce w literaturze, z nich 1 691 w tym kraju.\n– Naukowcy Charles Thomas, Karen Маллис i Philip Johnson\n\nNie ma żadnych wirusologicznych lub epidemiologicznych dowodów potwierdzających hipotezę na temat HIV / Aids… wirus jest biochemicznie nieaktywny i nieszkodliwy. [Tam prawdziwe przyczyny Aids obejmują] AZT, chemioterapia, napromienianie i radioterapia, uliczne narkotyki, takie jak popper i MDMA, itp., wraz z antybiotykami, które niszczą układ odpornościowy, niedożywienie i głód, jak to obserwuje się w Afryce.\n„To przyczyny Aids, a AIDS nie przenosi się drogą płciową i HIV nie istnieje.’”\n– Dr Peter Дьюсберг\n\nJednak dla tych, kto doszedł do nieszczęśliwego, ale nieuchronnego wniosku, że globalne zbrodnie i spiski nie tylko istnieją, ale i w rzeczywistości są jednym z głównych czynników napędowych, tworzących historię, zupełnie nie dziwi rozważanie możliwości, że nie ma HIV lub Aids, i wszystkie oszustwa są w rzeczywistości globalnej haczykiem do sprzedaży podrobionych leków i ukrywania prawdziwej przyczyny milionów zgonów. Źródło\n– Louis James\nAnd here’s an astute observation by Jim Stone:\nMoja ocena wstępna już od samego początku polegała na tym, że świrusy były w zasadzie nieszkodliwymi wirusami, które powodowały u ludzi katar. Teraz, gdy statek wycieczkowy stoczył się do ponad 550 osób zakażonych w stanie zero na  śmierć, wydaje się mało prawdopodobne, że któraś z nich była prawdziwa… jutro Japonia wypuści wszystkich na statku wycieczkowym. Żaden człowiek nie umarł i nawet nie jest poważnie chory. Gdzie to jest blef, blef z motywem. Źródło\n– Jim Stone\nOto krótki film, który wyjaśnia, co to są wirusy i dlaczego nie można złapać lub rozprzestrzeniać wirusa.\nhttps://www.brighteon.com/7134f098-46f8-4dd2-bf5a-653b251046f1\n11. OBRAZY TEGO DOMNIEMANEGO KORONAWIRUSA  SĄ DOKŁADNE TAKIE SAME JAK ZDJĘCIA, KTÓRE ZOSTAŁY WYKORZYSTANE DO ZILUSTROWANIA SARS, БВРС I INNYCH RZEKOMYCH WIRUSÓW „COV”. TAK WIĘC WYDAJE SIĘ, ŻE TU W OGÓLE NIE MA NIC NOWEGO.\nZnalazłem zdjęcia korona-wirusa, które rzekomo zostały uzyskane za pomocą mikroskopów elektronowych, i są one identyczne, w rzeczywistości te same dokładne zdjęcia, wykorzystane do nadużyć z wirusem Sars i Mers w przeszłości. To te same dokładne zdjęcia!!!\nRobert Arnette Auteuil\nŹródło: <url> https://www.ncbi.nlm.nih.gov/genomes/SARS/SARS.html\nŹródło: <url> https://newyork.cbslocal.com/2014/05/19/experts-mers-virus-still-poses-low-risk-to-general-public/\nŹródło: <url> https://en.wikipedia.org/wiki/Coronavirus\nŹródło: <url> https://ufospotlight.wordpress.com/2020/02/13/chinese-intelligence-officer-reveals-true-magnitude-of-chinas-coronavirus-crisis/\nhttps://www.youtube.com/watch?v=S-CkBVqFjh0&feature=youtu.be\n12. CAŁY TEN STRACH PRZED KORONAWIRUSEM, TO OSZUSTWO. A BEZPRZEWODOWA SIEĆ OTACZAJĄCA NAS TERAZ, JEST CZĘŚCIĄ DOBRZE OPRACOWANEGO SYSTEMU BRONI PRAWDZIWEJ, KTÓREJ CELEM JEST ZNISZCZYĆ NAS! \n– Mikrofalowa broń, stymulując obwodowy układ nerwowy, może ogrzewać ciało, powodować napady padaczkowe lub być przyczyną niewydolności serca. Depresja – częstotliwość promieniowania wpływa na aktywność elektryczną mózgu i może powodować objawy grypopodobne i mdłości.”\nŹródło\n\n– Oni chcą mnie zabić. Ludzie…by dając im objawy grypopodobne [które] spowoduje napływ płynu do ich płuc i zapalenie płuc… wtedy to doprowadzi do tego, że ciało zacznie wpadać w drgawki, a następnie bicie serca. I wtedy serce po prostu się podda.”\nŹródło \n13. NALEŻY ZWRÓCIĆ UWAGĘ NA SZEŚCIORAMIENNĄ GWIAZDĘ W CENTRUM TEJ ZŁOWROGIEJ BRONI I WIEDZCIE, ŻE TO NIE PRZYPADEK. IZRAEL JEST NAPRAWDĘ W CENTRUM TWORZENIA TYCH ŚMIERCIONOŚNYCH TECHNOLOGII . \nŹródło\n14. TEN FILM POKAZUJE NAM ROZWIĄZANIE. NALEŻY PAMIĘTAĆ, ŻE GDY TELEFON KOMÓRKOWY POŁĄCZENIE, W KOŃCU ODSZEDŁ, TO W KOŃCU LUDZIE DOŚWIADCZAJĄ ŚWIATA. NALEŻY ZWRÓCIĆ UWAGĘ RÓWNIEŻ NA STATKU, PŁYWAJĄCYM PO MORZU (MOŻESZ TO ZROBIĆ!), I FAKT, ŻE PARA TA NIE PODLEGA ZWROTOWI W BEZPRZEWODOWY ŚWIAT!\nhttps://www.youtube.com/watch?v=XToHkp3mVZ8&feature=youtu.be&t=109\nWNIOSKI\nTO, CO DZIEJE SIĘ W WUHANIE, NAJPRAWDOPODOBNIEJ, JEST REAKCJĄ NA PROMIENIOWANIE. JEDNAK MEDIA I INSTYTUCJE MEDYCZNE BĘDĄ KŁAMAĆ O TYM, TWIERDZĄC, ŻE CHOROBY SĄ SPOWODOWANE PRZEZ WIRUSA I ŻE TEN WIRUS MOŻE BYĆ ZAŻEGNANY ZA POMOCĄ JEDNEJ Z ICH DZIAŁAJĄCYCH SZCZEPIONEK.\nNIE ODBIERAJ ŻADNYCH SZCZEPIEŃ!\nZAMIAST TEGO, POZBĄDŹ SIĘ WSZYSTKICH URZĄDZEŃ BEZPRZEWODOWYCH I WYMIEŃ JE PRZEWODOWYMI URZĄDZENIAMI , OTRZYMASZ RADIACYJNĄ OCHRONĘ DLA TWOJEGO DOMU, KUP NA PROMIENIOWANIE DODATKOWE UBRANIA I ZRÓB WSZYSTKO, ABY CHRONIĆ SIEBIE I SWOJĄ RODZINĘ OD WPŁYWU BEZPRZEWODOWEGO I USG PROMIENIOWANIA .\nIM WIĘCEJ OSÓB DOWIE SIĘ O TYM, TYM SZYBCIEJ BĘDZIEMY MOGLI ZDEMASKOWAĆ KŁAMSTWA MEDIÓW I INSTYTUCJI MEDYCZNYCH.\nPlacówka kontynuuje swoją sztukę, promuje go jako silnie toksyczny,[i] [ii] jest bardzo niebezpieczny,[III, V] z[IV] i całkowicie bezużyteczne,[w] [V] szczepionki na grypę, ale jakoś zapomina wspomnieć, że choroby większość ludzi, którzy cierpią, nie mają nic wspólnego z grypą, a raczej są objawami kuchenki napromieniowania mikrofalowego .[vii] \nźródło\n[i] Gary Null PhD and Richard Gale, The Toxic Science of Flu Vaccines , GreenMedInfo.com 2 listopada 2016 roku. http://www.greenmedinfo.com/blog/toxic-science-flu-vaccines\n[ii] W. Myers, szczepionki przeciw grypie są toksyczne , MyersDetox.com, https://myersdetox.com/flu-vaccines-are-toxic/\n[iii] Brian Шильхави, zrobisz szczepionka przeciw grypie? Raport ministerstwa Sprawiedliwości od szczepionka replikacji sądu pokazuje, że szczepionka przeciw grypie jest najbardziej niebezpieczna szczepionką w USA , HealthImpactNews.com, 7 września 2018 roku. http://healthimpactnews.com/2018/get-your-flu-shot-doj-report-from-vaccine-court-reveals-flu-shot-is-most-dangerous-vaccine-in-u-s/\npaul val di Fassa, jeśli znasz kogoś, kto rozważa możliwość szczepienia przeciw grypie w tym roku , pokaż im to, RealFarmacy.com-tak. https://realfarmacy.com/ditch-flu-shot-instead/\n[v] C. Del Mar i P. Collingnon , szczepionka przeciw grypie jest do 99% nieskuteczne, LifeHacker.com 8 czerwca. 2018. https://www.lifehacker.com.au/2018/06/the-flu-vaccine-is-99-per-cent-ineffective/\nMike Стоббе , zeszłej zimy szczepionka od grypy była niesprawna dla osób w wieku powyżej 65 lat, DenverPost.com 21 czerwca 2017 roku https://www.denverpost.com/2017/06/21/flu-vaccine-elderly-ineffective/ \n[vii] Artur Фирстенберг, zapis ~ ukryte niebezpieczeństwo bezprzewodowego i mobilnego promieniowania ~ аудиоинтервью ~ Część 2 , https://multerland.files.wordpress.com/2019/01/2-the-hidden-dangers-of-wireless-and-cell-phone-radiation.pdf . Video: 2/4 ~ ukryte niebezpieczeństwo promieniowania bezprzewodowych i telefonów komórkowych ~ Arthur Firstenberg ~ angielskie napisy, kanał YouTube Multerland, 3 lutego 2019 roku, https://youtu.be/yqxQZZM1K7I\n\n. Aktualizacja 3/12/20\nLudzie w Wuhanie otwarcie twierdzą, że wirus ten jest fałszywy.\nhttps://youtu.be/Ytr16VQwrhY\nTo wideo pokazuje, jak fałszuje się dane!\nhttps://www.bitchute.com/video/8wxxHr378n2S/ \nKONIECZNIE ZOBACZ WIDEO\nhttps://www.youtube.com/watch?v=zFN5LUaqxOA&feature=emb_title – FILM NIESTETY USUNIETY\nAktualizacja – 2/3/20\nWideo poniżej musi umieścić Kabasa na wszelkie rozmowy o tym rzekomo śmiertelnym świrusie, który jest coś nowego, coś, co zagraża w całym świecie. Teraz rozgrywa się cała farsa w próbie ciemnych, aby promować swój szatański system zarządzania, w tym trzymać ludzi pod kluczem i przepisywać śmiercionośne szczepionki. Nie możemy pozwolić im uciec od tego wszystkiego. Teraz nadszedł czas, nic więcej nie mówić!\n„Dziś Ameryka byłaby oburzona, gdyby wojska ONZ weszły do Los Angeles, aby przywrócić porządek. Jutro będą ci wdzięczni! Jest to szczególnie prawdziwe, jeśli mówiono im, że istnieje zagrożenie zewnętrzne, prawdziwe lub deklarowane, które zagraża naszemu istnieniu. To właśnie wtedy wszystkie narody świata będą błagać, aby uwolnić ich od tego zła. Jedyne, czego boi się każdy człowiek, jest strach przed niewiadomą. Przy takim scenariuszu ludzie będą dobrowolnie rezygnować z poszczególnych praw, w zamian za gwarancję ich dobrego samopoczucia i bezpieczeństwa, dając im władzę jako Globalnemu Rządowi.” — Dr Henry Kissinger, Evian, Francja, 1991 Rok\nStyczeń 31, 2020 i kolejne aktualizacje\nOpublikowano za: http://www.radiationdangers.com/5g/is-the-coronavirus-actually-microwave-illness/\nTłumacz automatyczny: https://translate.yandex.com/translate\nOd Redakcji KIPU uzupełniający zestaw opracowań dokumentujący związek promieniowania elektromagnetycznego, w tym 5G, Wi-Fi i 4G z świrusem     Jak zwalczyć 5G, koronawirusa i rządzących kryminalistów, aby zapobiec ludobójstwu ?\nByły pracownik Vodafone UJAWNIA- prawdziwe OBLICZE KORONAWIRUSA- Wezwanie POWSTAŃMY!\nCzy to możliwe, że technologia 5G prowokuje rozprzestrzenianie się koronawirusa ?\nGrypa, czy Choroba Radiacyjna\nZabójcze promieniowanie elektromagnetyczne\nPandemia? Albo głupota i fantazja … I co dalej? 13 kwietnia 2020 Obudź się !\nNIESAMOWITY WYWIAD DAVIDA ICKE O AKTUALNEJ SYTUACJI W ŚWIECIE I PLANACH GLOBALNYCH PSYCHOPATÓW [ usuwany z youtube, vimeo i innych sieci]\nKorelacja 5G z koronawirusem, a kościół katolicki i rząd\nWywiad: Perspektywa kontrwywiadu w sprawie wirusa Wuhan – syjonistyczny atak wojenny pod fałszywą flagą?\nJuż oficjalnie! KORONAWIRUS operacją „fałszywej flagi”! Robert D. Steele- list do Premiera Steele & Cassidy update, KORONAVIRUS i Memy, reset finansowy i więcej, 20 Marca 2020\nMożliwe współzależności: koronawirusów, 5G, chemtrails, broni etnicznej i psychozy strachu – Ewa Pawela\nCo kryje za sobą epidemia koronowirusa ?, Cz.1\nNie możesz złapać wirusa, nie jest żywą częścią naszego świata – 14.04.2020.\nBrak naukowego dowodu na istnienie tzw. Wirusa-patogenu.\nZbrodnie ludobójstwa za pomocą szczepionek nie ulegają przedawnieniu. Demograficzna zagłada, czyli mistyfikacja H1N1\nSensacyjna wypowiedź Ambasadora USA o zdalnym zabijaniu ludzi\ntechnologią 5G\nUliczne latarnie LED wspierające sygnały 5G mają charakter ludobójczej broni\nGoogle, Facebook, Neuralink pozwane za transfer broni technologicznej AI, współudział w ludobójstwie w Chinach i narażanie ludzkości na niewłaściwe użycie AI\nKoniec części drugiej.\nPozdrawiam.",
			"added": 1615195997
		},
		{
			"topic_id": 1618368827,
			"title": "TWARDE LĄDOWANIE.",
			"body": "TWARDE LĄDOWANIE.\n.\n*Jest to przedruk, który pokazuje błędy jakie się wydarzyły rzekomo w samolocie prezydenta? Pomijam faktyczny stan wydarzenia. To jest opowiadanie pilota, który ma wylatane, 25,000-godz. Są tutaj opisane absurdy z prawa Lotniczego. Za samo to stwierdzenie, należy się kara. W tej chwili pomijam fakty historyczne. I zarazem Faktyczne. Ten opis przedstawia zeznania ludzi władzy i absurdy.warto się z tym zapoznać.*\n.\nPrezydencki samolot.\nPilot Jerzy Grzędzielski ur. 4 maj1933r.zm. 27 lutego 2017r. mówił całą prawdę o katastrofie smoleńskiej!„Doczekałem się pięknej, wolnej POLSKI. Nie chcę jej stracić, o Katastrofie smoleńskiej mam prawo mówić. Poświęciłem lotnictwu niemal 50 lat. z czego jako kapitan w liniach lotniczych ponad 30. Przewiozłem bezpiecznie miliony pasażerów od Alaski po Australię, od Tokio i wyspę Guam na środku Pacyfiku po Amerykę Północną i Południową. W cywilizowanym świecie do kokpitu samolotu wiozącego VIP-ów nikt nie ma wstępu.\nDam przykład: w 2013 roku pani kanclerz Merkel leciała ze swą świtą do Indii. Samolotu nie wpuszczono w przestrzeń powietrzną Iranu. Kapitan prawie dwie godziny krążył po stronie tureckiej, po uzyskaniu zgody poleciał dalej. Pani kanclerz dowiedziała się o tym siedem godzin po wylądowaniu. Proszę sobie wyobrazić naszą polityczną gawiedź. Pewnie kapitana wyrzucono by za burtę, a politycy sami wiedzieliby najlepiej co robić.\nOd momentu katastrofy pojawia się podejrzenia o spisek na życie prezydenta i zdradę stanu z obcym państwem. O bredniach głoszonych na temat katastrofy można napisać książkę lub nawet kilka. Wspomnę tylko wybrane.Pan minister Macierewicz zaraz po katastrofie twierdził, że Rosjanie na lądowanie premiera Tuska przywieźli w teczce ILS (Instrument Landing System), a na lądowanie prezydenta już nie przywieźli. Dalej Rosjanie nie odpędzili, powtarzam kuriozalne określenie „nie odpędzili*, naszego kapitana i nie zamknęli lotniska.\nOdpowiem panu ministrowi: ILS waży kilkaset kilogramów. Na lotnisku Okęcie był montowany 4 lata. Specjalnie wyposażony samolot kalibrował go, stabilizował ścieżkę schodzenia i centralną oś pasa. Na lotnisku Modlin instalowano ILS przez 3 lata. Koszt wyniósł 62 min złotych. Panie Ministrze – kapitana nie odpędza się. To komary lub muchę z czoła można odpędzać. Lotniska nigdy nie zamyka się kapitanom, wyjątkiem jest sytuacja jeśli na pasie stoi inny, uszkodzony samolot. O lądowaniu lub nie decyduje tylko i wyłącznie kapitan.\nPani poseł Kempa biegała po stacjach TV z rewelacją, że przyczyną katastrofy było nie zabranie rosyjskiego nawigatora. Kosmiczna bzdura i kompromitacja pani poseł. Ma się to tak. jakby chirurgowi tuż przed operacją przyprowadzono salową i powiedziano, że jeśli pan doktor nie podoła, to ona pomoże przy operacji.\nKatastrofę smoleńską mozolnie, przez głupotę, brak wiedzy, chciwość i cynizm, przygotowywała polityczna czołówka PIS. Zaczęło się w 2006 roku za rządów premiera Jarosława Kaczyńskiego. W czasie publicznego wystąpienia minister obrony z PIS-u zapytany został przez oficerów- pilotów samolotu Tu 154 za Spec-pułku dlaczego nie ćwiczą na symulatorach. Odpowiedź była następująca i niebywale skandaliczna: „Nie. bo to ruskie symulatory”. Dla mnie powiało grozą i jęknąłem: „będziemy mieli katastrofy”. Nomen omen ten minister zginął w katastrofie smoleńskiej.\nĆwiczenia na symulatorach są niebywale ważne, uratowały wiele istnień i nie do pomyślenia jest. aby z nich rezygnować. Cały świat lotniczy z nich korzysta. Prezesi nawet najbiedniejszych linii lotniczych klną, ale płacą za ćwiczenia swoich załóg. Ogrom głupoty i braku odpowiedzialności powala tu na ziemię.\nMogę dać dziesiątki przykładów, ale pozostanę przy swoim doświadczeniu. W mozolnych ćwiczeniach na symulatorze wielokrotnie wraz z załogą zabiłem się. Ale przyszła jeden raz okrutna rzeczywistość. Po 10-cio godzinnym locie, niewiele minut przed lądowaniem na moim lotnisku zrobiło się tragicznie. Mgła do samej ziemi, chmury, widzialność 50 m. Do zapasowego lotniska 800 km a paliwa resztki.\nPanie Ministrze Macierewicz, nikt mnie nie odpędzał, nikt mi nie zamykał lotniska ale widziałem śmierć w oczach i warunki ponad moje uprawnienia i siły. Myślałem już o straży pożarnej i karetkach. Pierwszy kontakt wzrokowy z ziemią miałem na dziesięciu metrach wysokości, błysnęła zielona lampa progu pasa i centralnej linii. Do portu samodzielnie bez pomocy „Follow me” nie mogłem pokołować. Nie było cudu. tylko wyszkolona załoga po wielu godzinach treningu na symulatorze. Wracający z urlopu w Singapurze, kolega kapitan i mój instruktor, wszedł przed lądowaniem do mojego kokpitu.\nNatychmiast został wyproszony. Nikt w takiej sytuacji nie może być w kabinie, w odróżnieniu od tego, co nasi politycy urządzili temu biednemu pilotowi pełniącemu funkcję kapitana TU154. Żałość i rozpacz. Kiedy uderzycie się w piersi?\nPolityka PIS w imię idiotycznych i partykularnych fobii pozbawiła pilotów Spec-pułku ćwiczeń w symulatorze, obniżając bezpieczeństwo lotów w tym lotów z najważniejszymi osobami w Polsce. To był wstęp do katastrofy.\nRok 2008. Prezydent Lech Kaczyński wraz z zaproszonymi gośćmi, prezydentami i premierami, lecieli do Gruzji przez Azerbejdżan. Gruzja była w stanie wojny z Rosją. Dlatego Pan Prezydent akceptuje taką trasę. W trakcie lotu Pan Prezydent zmienia swoją decyzję i poleca kapitanowi zmianę trasy lotu wprost do Tbilisi. Kapitan odmawia, bo nie zezwalają na to przepisy, ponadto gdyby niezidentyfikowany obiekt pojawił się w strefie działań wojennych mógłby być zestrzelony przez Gruzinów lub Rosjan. Mielibyśmy przez głupotę niebywały skandal międzynarodowy i na sumieniu prezydentów i premierów.\nKapitan został obrażony przez Pana Prezydenta, nazwany tchórzem. Po przylocie do Warszawy straszony konsekwencjami. A wystarczyło polecić jednemu z licznych doradców-prawnik&o acute;w zajrzeć do prawa lotniczego i naszego AIP. Wtedy kapitan zostałby przeproszony.\nNie posądzam o samodzielny, nierozsądny pomysł samego Prezydenta. W samolocie był odcięty od światowych informacji, a newsy podały, że prezydenci Francji i Rosji lecą aktualnie z Moskwy do Tbilisi w asyście myśliwców. Pewnie jakiś usłużny poddał więc panu Prezydentowi przez telefon przednią myśl zmiany trasy lotu. Po tym zdarzeniu pozostało już w Spec-pułku niewielu doświadczonych pilotów, którzy chcieli latać z prezydentem. Kapitan nie może odmówić lotu. ale może. np. zachorować. To była kolejna cegła przyłożona do katastrofy.\nNa lot do Smoleńska w fotelu kapitańskim zasiadł więc pilot nieposiadający w pełni uprawnień kapitańskich, jak stwierdziła komisja. Opowiem jak to jest w liniach lotniczych. Na przykład jeśli ważność ćwiczeń w symulatorze przeciągnie się nawet o jeden dzień kapitan odmawia lotu. Kapitan odmówił lotu rano w słoneczny dzień do Wrocławia i z powrotem, bo zapomniano wyposażyć kokpit w ręczną, wymaganą instrukcją, latarkę. Ten młody kapitan miał rację. W tym locie mogło np. nastąpić zadymienie kabiny i ta latarka ratowałaby wszystko – odczyty przyrządów.\nSkładam Jego Magnificencji Rektorowi Politechniki Rzeszowskiej gratulacje. Ten młody pilot od Pana wyszedł, tak jak wielu innych. Dziś latają oni jako kapitanowie w najlepszych liniach świata. Uważam, że gdyby tego młodego pilota Tu154 potraktowano jak w cywilizowanych społeczeństwach, to znaczy uszanowano jego kwalifikacje i decyzje oraz pozostawiono kokpit zamknięty, to po otrzymaniu standardowej informacji o pogodzie z wieży kontrolnej smoleńskiego lotniska i jeszcze bardziej nadzwyczajnej i dodatkowej informacji o godz. 08.24 że „warunków do przyjęcia nie ma”, to kapitan po stwierdzeniu, że na wysokości 100 m nie widzi ziemi i pasa. Odleciałby ma lotnisko zapasowe lub postawił samolot w krąg.\nZgodnie z instrukcją wykonywania lotów. I to jest cała wiedza. Jednak chciwość, zarozumialstwo i cynizm możnych polityków zwyciężyły.\nPrzed wejściem pasażerów na pokład, honorem i przywilejem kapitana jest witanie najważniejszej osoby wraz z małżonką, czyli pana Prezydenta. Odebrał ten przywilej kapitanowi Dowódca Wojsk Lotniczych – generał Błasik. Po prostu pokazał mu jego miejsce i to, że jest tu nikim – poniżające i podłe.\nJa w takiej sytuacji odmówiłbym lotu. Niby niewyobrażalne, ale nie dla tych którzy wiedzą o co idzie, zwłaszcza dla pilotów. Jest to kolejna cegła budująca to nieszczęście. Na 11 minut przed katastrofą kapitan otrzymuje wiadomość że „Pan Prezydent jeszcze nie podjął decyzji co robimy dalej’. To oburzające i paraliżujące oświadczenie. To kapitan ma wiedzieć, co robić i on decyduje! To on odpowiada za życie wszystkich na pokładzie, a nie pasażer, nawet najważniejszy! Kokpit winien być absolutnie sterylny i tylko kapitan może wydawać polecenia.\nTam był po prostu bałagan. Nie wiadomo było, kto dowodził, kapitan nie był w stanie pozbyć się gości (intruzów) z kokpitu, samolot pędził do ziemi, nic nie było widać poniżej nieprzekraczalnych 100 m. Generał, Dowódca Wojsk Lotniczych zamiast wrzasnąć w tym momencie „do góry!” nawet nie wyrzucił i nie uciszył intruzów – horror.\nPan minister Macierewicz z uporem twierdzi, że załoga zamierzała odejść na drugi krąg. Panie Ministrze, już byli tak nisko, że zadziałała instalacja TAWS. „Pull up. terrain ahead”. To paraliżująca informacja, każdy pilot natychmiast ucieka do góry, jeśli zdąży.\nA co robi załoga?\nKapitan wycisza sygnalizację zmieniając nastawy wysokościomierza barycznego. tym samym pozbawiając się wskazania wysokości progu pasa – czyste samobójstwo. Robi to po to. aby sygnalizacja przy dalszym zniżaniu mu nie przeszkadzała! Chciał zobaczyć ziemię jak najszybciej przed minięciem radiolatarni. Po prostu na siłę chciał lądować. Naciski na niego, niekoniecznie słowne, były niewyobrażalnie mocne, tak aż uderzyli w ziemię 900 m od progu pasa. Dokładnie, jak przez kalkę w Mirosławcu, gdzie samolot CASA także uderzył 900 m przed progiem, taka sama pogoda.\nJednak informacja od Prezydenta nie była ostatnim ani najmocniejszym ciosem dla kapitana.\nNajboleśniej ugodził go kolega-kapitan samolotu JAK40. który kilkanaście minut wcześniej „spadł” na pas w odległości 700 m od progu. Dlaczego spadł? Bo pogoda była już fatalna i zniżając się poniżej dopuszczalnej wysokości 100 m ujrzał ziemię będąc już nad pasem. Nie zgłosił obowiązującej formuły, że widzi pas i prosi o zgodę na lądowanie. Zrobił to bez zgody wieży. Czym to się kończy, dam przykład: podczas identycznej pogody na Teneryfie kapitan B747 otrzymał zgodę z wieży na start i gdy się rozpędzał kapitan drugiego B747 bez zgody wierzy w kołował na środek pasa. Wynik – 862 osoby spłonęły.\nPasażerowie rejsu JAK40 winni wygrać ogromne odszkodowania za narażenie ich życia. Otóż kapitan Tu154 zapytał przez radio kolegę- kapitana JAK40 o pogodę. Ten odpowiedział, cytuję: „Pizdowata, widać 200-400 m, podstawa chmur 50 m, mnie się udało, możesz próbować”. To jest haniebne. Życie Prezydenta i ponad 90 innych osób to nie rosyjska ruletka, albo się uda albo nie. Winien krzyknąć „Uciekaj jak najszybciej”.\nTen kapitan bryluje teraz na salonach pana ministra Macierewicza i jest jego pupilem. Panie Ministrze, różnimy się. ja też mam swojego guru. Jest nim dr nauk technicznych, emerytowany pułkownik pilot doświadczalny Antoni Milkiewicz. Jako młody oficer-inżynier brał udział w komisji badającej katastrofy naszych IŁ62. Mimo nacisków potężnego ZSRR udowodnił winę producenta siników, narażając tym samym przyszłość swoją i swojej rodziny. Gratuluję Panie Ministrze pupila. Tak rodziła się katastrofa smoleńska, w której wybitny udział mieli politycy karmiący nas kłamstwami. Pomaga im kler. a szczególnie episkopat. Od sześciu lat słyszę z ambon: „Żądamy prawdy”. A ta prawda jest znana.\nNasza znakomicie wykształcona (pozazdrościć może nam wiele państw) komisja badania wypadków lotniczych ogłosiła wyniki. Zapewniam wszystkich, gdyby rozpatrywałaby to najlepsza amerykańska komisja NTSB, to wynik byłby identyczny Jedynie zdjęto by jakąkolwiek odpowiedzialność z pracowników wieży, tak jak zrobił to nasz sąd po katastrofie w Mirosławcu. Ponadto dowiedzielibyśmy się o treści rozmów braci, tak przed katastrofą, jak i w locie do Azerbejdżanu.\nZ rozgłośni toruńskiej leje się rzeka bzdur o katastrofie, a „Najważniejszy&rdqu o; orzekł, że jej uczestnicy byli „prowadzeni na specjalne zamordowanie”.\nTo jest rozpaczliwie chore. Biskup zamyka z błahych powodów nie wiadomo na jak długo nam, wiernym, świątynię – a nie potrafi zareagować, gdy na drugi dzień po tragedii, w środku metropolii, najbardziej katoliccy dziennikarze ogłaszają światu, że Rosjanie dobijali pasażerów. Do dziś nie ma nagany kościoła ani sprostowania i przeprosin. Ja to teraz robię – przepraszam Rosjan. Każdego 10-tego dnia miesiąca na czele z duchownym, z wizerunkiem Chrystusa i Matki Bożej, z flagami narodowymi o napisach niewybrednych i ubliżających Prezydentowi Państwa i Premierowi, odbywają się partyjne wiece i modły o wolną Polskę.\nŻadnego biskupa to nie boli Dzisiaj upominają nas i nazywają Targowiczanami. Już zrozumiałem nauki Kościoła. Służy temu. który więcej da lub więcej obieca. Gdzie jest biskup, który mówił „Największą mądrością jest umieć jednoczyć – nie rozbijać”. Tego dzisiejsi pasterze katoliccy nawet nie wspominają. Był to prymas Wyszyński.\nNajwiększym naszym wstydem jest zespół pana Macierewicza wraz z jego „profesorami” . Otóż wszystkie komisje świata badające katastrofy lotnicze zaczynają od analizy wyszkolenia i przygotowania załogi, ostatniego wypoczynku, posiłku, sytuacji w pracy, w domu i lotu od samego przygotowania do startu. Panowie w zespole zaczynali od kolejnego wybuchu wskazanego przez guru, tak jakby samolot sam leciał.\nProf. Nowaczyk oświadczył, że samolot był wprowadzony na zły pas. Panie profesorze to nie Frankfurt lub Amsterdam, w Smoleńsku jest tylko jeden pas! Dziwi się Pan, że zwolniono go z Uniwersytetu Maryland, ja dziwię się. że Pana w ogóle przyjęto. Nie wspomnę już o parówkach i różnych puszkach. Proponuję profesorom przed następnymi dociekaniami kupić godzinę lotu na symulatorze z instruktorem. Zapytać instruktora jak zachowują się piloci po sygnale „Puli up”. Podpowiem natychmiast: pełen gaz i do góry.\nA co robiła nasza załoga?\nGnała do ziemi nadal, wyłączając sygnalizację. Żal mi bardzo rodzin ofiar po dwakroć. Za stratę bliskich i za drwiny ze strony polityków.\nRadziłbym, a szczególnie Pani poseł-mecenas. zapytać pana Prezydenta, pana Sasina, pana Łozińskiego i innych, którzy byli najbliższymi doradcami Prezydenta: jaki dureń z ich otoczenia wymyślił lotnisko Smoleńsk, stare, zdewastowane, nieczynne od dawna lotnisko j wojskowe, mając w pobliżu dwa międzynarodowe, cywilne, czynne i sprawne porty lotnicze!\nJaki skończony dureń wsadził do jednego samolotu tyle ważnych osobistości, zamiast rozlokować w trzech środkach transportu. I nie ubezpieczył ich. Czy to też wina Tuska?\nGłosowałem z wielką nadzieją na mojego idola pana Lecha Kaczyńskiego – spokojnego, średniej klasy urzędnika. Zimny prysznic otrzymałem wieczorem jak prezydent elekt zameldował swojemu pierwszemu sekretarzowi wykonanie zadania. Wiedziałem, że będziemy mieli dwóch prezydentów: de jurę i de facto . I tak pozostało.\nByło wiele zamachów na carów, bojarów, książąt, króli, papieży i prezydentów mocarstw. Pojedynczo, nie zbiorowo. Nasz Prezydent nie zagrażał nikomu, nie miał armii z bronią nuklearną. Nie był wybitnym mężem stanu, tylko mężem wspaniałej Pierwszej Damy. Nie bywał zapraszany na salony polityczne świata, ani sam nie zapraszał.\nZginął przez cynizm najbliższych, ich chciwość i głupotę Stąd dzisiaj ta żądza wynagrodzenia mu przez stawianie pomników, nazwy placów i ulic, a może wkrótce i miast. Piszę to w wielkim żalu i smutku, bo miałem sentyment do tego człowieka.”\n.\n. Jerzy Grzędzielski\nur. 4 maj1933 zm. 27 lutego 2017r.\n. Emerytowany kapitan linii lotniczych\n. Pilot doświadczalny samolotowy i szybowcowy\n. Instruktor samolotowy i szybowcowy\n. Inspektor Wyszkolenia Lotniczego\n. Oficer rezerwy Wojsk Lotniczych\n. Nalot w powietrzu ponad 25.000 godzin\n.\nMariusz Pomianowski \n.\n*Od siebie dodam to co zawsze. Tam nie było katastrofy całą ekipę zamordowano na lotnisku w Warszawie w pewnym zrównanym z ziemią zaraz po zdarzeniu hangarze który 2 miesiące wcześniej został wyremontowany za 10mln zł. Dodatkowo Zimnego LECH’a nie było w Warszawie od wyjazdu na Litwę. Nie ma żadnego dowodu filmowego, że wrócił z Litwy, wyraźnie ma żadnego dowodu filmowego, że 10-tego wyleciał z Warszawy. Rozumiecie koledzy i koleżanki. Prezydent RP leci z wizytą do Rosji i nie ma żadnej telewizji z kamerą i reporterami?    \nNiema nikogo. Czy to nie jest dziwne?*\nCzuwaj.",
			"added": 1618368808
		},
		{
			"topic_id": 1626943982,
			"title": "POLECAM-Rozwój człowieka.",
			"body": "2021.07.21.01.[PL]-Wiedza-Nasze DNA-K.Swistelnicka-P.Kaminski-[47min]-\nTo dla tych co chcą się zmienić na lepsze. \nKatarzyna i Piotr, mówią o naszym ewoluującym DNA. W kontekście naszego rozwoju wewnętrznego.",
			"added": 1626943962
		},
		{
			"topic_id": 1629763452,
			"title": "PASOŻYTY-",
			"body": "PASOŻYTY-Trochę Historii.\nCofnijmy się trochę w czasie, do roku 1012-.\nTrochę o pasożytach : \n. 1012 rok - Cesarz Niemiecki Henryk II wypędza Żydów z Moguncji \n. 1288 rok - Regent Królestwa Neapolu Robert d'Artois nakazuje wypędzenie Żydów z całych południowych Włoch \n. 1290 rok - Król Anglii Edward I wydaje edykt o wygnaniu Żydów (wszystkich Żydów, w liczbie ok. 16 tys., załadowano na statki i odesłano na kontynent, dotarli tylko nieliczni, bo większość Anglicy najpierw obrabowali, a potem potopili)\n.  1346 rok - wygnano Żydów z Bazylei w Szwajcarii \n. 1360 rok - wygnano ich z Węgier \n. 1394 rok - z Francji \n. 1421 rok - z Austrii \n. 1491 rok - wygnanie Żydów z Rawenny \n. 1492 rok - Królowie Hiszpanii Izabela I Kastylijska i Ferdynand II Aragoński wydali edykt nakazujący wypędzenie Żydów z Królestwa Hiszpanii i wszystkich jej posiadłości \n. 1493 rok - Król Sycylii Ferdynand II Aragoński wyrzuca Żydów ze swojego królestwa \n. 1495-1503 Żydzi zostali wygnani z Litwy \n. 1496 rok - Żydów wypędzono z Portugalii (edykt Króla Manuela I Szczęśliwego), również w tym samym roku Cesarz Rzymski Maksymilian I Habsburg wypędził Żydów ze wszystkich swoich dziedzicznych ziem \n. 1510 rok - Żydzi zostają wygnani z Brandenburgii \n. 1547 rok - Car \"Wszech Rusi\" Iwan Grozny odmawia Żydom prawa zamieszkania w Rosji, a nawet przejazdu przez swoje państwo! \n. 1550 rok - Żydzi zostają wygnani z Genui \n. 1571 rok - Republika Wenecka podejmuje decyzje o wygnaniu wszystkich Żydów z Wenecji i z wysp adriatyckich . \n. 1528 roku – Kiedy w Niderlandy dostają się pod władzę Cesarza Rzymskiego Karola V Habsburga wszyscy Żydzi zostają wypędzeni \n. 1590 rok - Król Hiszpanii Filip II nakazuje wyrzucenie Żydów z Lombardii... ...wszystkim wygnaniom Żydów towarzyszyły krwawe pogromy i powszechne prześladowanie... uciekali głównie do Polski, która sami nazwali \"Paradisus Ludaeorum\" ( Żydowski Raj ). W XVI wieku 3/4 wszystkich Żydów żyjących na świecie mieszkało w Polsce! Teraz doszło do tego, ze ich premier, Benjamin Netanjahu w przemówieniu wygłoszonym w dniu 14.02.br., na terenie Polski, w gmachu Muzeum Historii Żydów Polskich .....\nJaki komentarz do tego napisać? Czy jest potrzebny jakiś komentarz? Czy ta lista nie jest dziwna? Czy wszyscy się uwzięli na biednych i nieszczęśliwych pasożytów? Jak jest naprawdę oceńcie sami i samodzielnie.\n.\nczuwaj.",
			"added": 1629763431
		},
		{
			"topic_id": 1631639264,
			"title": "Samoczynna zmiana linku?",
			"body": "Dlaczego zmienia link samoczynnie? Kto coś wie, na ten temat? Powinien być pierwszy link. A tymczasem drukuje drugi?\n.\n. 1- http://127.0.0.1:43110/1PoLsKaf9eRbXEVZvQA4R5jRdDg2K65mPz/index.html?v=topic+id=1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4xtopic1\n. 2-0net://1PoLsKaf9eRbXEVZvQA4R5jRdDg2K65mPz/index.html?v=topic+id=1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4xtopic1\n. Jakieś porady???",
			"added": 1631639242
		},
		{
			"topic_id": 1632945787,
			"title": "Teroryści którzy zgineli.",
			"body": "Amerykańskie dokumenty po raz pierwszy ujawniają informacje o wojnie syryjskiej oraz zagranicznych terrorystach w Syrii i ich narodowości. Liczba zagranicznych terrorystów w Syrii jest szczerze przerażająca, a oni wciąż mówią o syryjskiej rewolucji! szczegóły Z dokumentów ONZ:\nLiczba zagranicznych terrorystów w Syrii : 171400 Informacje i dokumenty dotyczące narodowości i liczby zagranicznych terrorystów, którzy wkroczyli do Syrii od początku brudnej wojny z Syrią. 24 500 terrorystów z Arabii Saudyjskiej zabiło 5990 terrorystów, w tym 19 kobiet-\n, a 2700 z nich zaginęło. 25800 terrorystów z Turcji, 5760 z nich zginęło, a 380 zaginęło. Zginęło 21 000 terrorystów z Czeczenii, 5230 z nich zginęło, 1950 zaginęło, a wśród zabitych było 16 kobiet.\n14000 terrorystów z okupowanej Palestyny , większość z nich z Bractwa Hamas, z czego 4920 terrorystów zginęło, a 670 z nich zaginęło. 10500 terrorystów z Tunezji, z których 4200 zginęło, w tym 45 kobiet, a 1260 z nich zaginęło.\n9500 terrorystów z Libii , 3940 terrorystów zginęło, a 1650 zaginęło. 13000 terrorystów z Iraku zabiło 3780 terrorystów, a 1200 z nich zaginęło. 11000 terrorystów z Libanu zabiło 3110 terrorystów, a 1080 terrorystów straciło, wśród zabitych 7 kobiet.\n8600 terrorystów z Turkmenistanu, zabito 3050, w tym 11 kobiet, oraz zgubiło/schwytało 900 terrorystów. 7500 terrorystów z Egiptu , 2100 z nich zginęło, a 870 z nich zaginęło. 3800 terrorystów z Jordanii, z których 1990 zginęło, a 265 zginęło.\n4600 terrorystów z Pakistanu , 1380 terrorystów zginęło, a 590 terrorystów zaginęło. 3600 terrorystów z Afganistanu , 1380 z nich zginęło, a 630 zaginęło. 2800 terrorystów z Jemenu , z których 1440 zginęło, 700 zaginęło.\n2550 terrorystów z Kazachstanu , 1130 z nich zginęło. 2700 terrorystów z Uzbekistanu , 780 terrorystów zginęło i 390 terrorystów zaginęło, wśród zabitych 4 kobiety. 1900 terrorystów z Kuwejtu , z których 640 zginęło, 8 z nich zaginęło.\n1950 terrorystów z Algierii , 620 z nich zginęło, a 44 z nich zaginęło. 2100 terrorystów z Maroka , 610 terrorystów zginęło, w tym 7 kobiet, a 630 terrorystów zaginęło.\n30 000 terrorystów z Europy Zachodniej i różnych narodowości (Ameryka, Francja, Rosja, Wielka Brytania, Belgia, Nowa Zelandia, Szwecja, Finlandia, Dania i Norwegia). Oznacza to, że całkowita liczba terrorystów, którzy weszli do Syrii wynosi (171400)\nSto siedemdziesiąt jeden tysięcy czterysta terrorystów, z których (51910) zostało zabitych przez syryjską armię arabską (51.910) pięćdziesiąt jeden tysięcy dziewięćset dziesięciu terrorystów i straciło albo aresztowanie, albo ucieczka (33847) trzydzieści trzy tysiące osiem stu czterdziestu siedmiu terrorystów.",
			"added": 1632945764
		},
		{
			"topic_id": 1634582490,
			"title": "SPORT - TO ZDROWIE.",
			"body": "Pewien znajomy podesłał mi garść linków. Oto one – podaję również daty ich publikacji jak i telegraficzny skrót informacji z linków:\n. 30.06.2021 Z przygotowań do sezonu jesiennego wyłączony jest bramkarz Herty BSC Jarstein. Powód – zapalenie mięśnia sercowego:\nhttps://www.kicker.de/herzmuskelentzuendung-jarstein-weiter-mit-sportverbot-808692/artikel\n. 11.07. 2021 Podczas meczu ligi amatorskiej zasłabł piłkarz. Musiano go reanimować:\nhttps://www.braunschweiger-zeitung.de/region/article232757649/Gifhorner-Amateurfussballer-musste-reanimiert-werden-wie-Eriksen.html\n. 24.07.2021 U piłkarza z Bielefeld podczas meczu doszło do zatrzymania akcji serca. Artykuł przypomina podobny przypadek w zespole TuS Hoberge Uerentrup:\nhttps://www.nw.de/lokal/bielefeld/mitte/23056624_Bielefelder-Fussballer-erleidet-Herzstillstand-auf-dem-Platz.html\n. 13.08.2021 Były piłkarz belgijski, 37 lat, zmarł na zawał serca:\nhttps://www.t-online.de/sport/fussball/international/id_90623930/franck-berrier-37-ex-fussballer-stirbt-nach-herzstillstand.html\n. 29.08.2021 Podczas meczu zasłabł kibic Wolfsburga Konieczna była reanimacja. Wylądował w szpitalu:\nhttps://rblive.de/fans-tickets/bei-niederlage-von-rb-leipzig-fan-des-vfl-wolfsburg-auf-der-tribuene-reanimiert-72445\n. 04.09. 2021 Podczas paraolimpiady niemieccy lekarze musieli reanimować belgijskiego tenisistę na wózku inwalidzkim:\nhttps://rp-online.de/sport/olympia-sommer/paralympics/paralympics-deutsche-aerzte-reanimieren-belgier_aid-62554749\n. 06.09 2021 W Austrii podczas drugoligowego meczu na murawę upadł zawodnik. Konieczna była reanimacja. Helikopterem przetransportowano go do szpitala:\nhttps://www.fanreport.com/at/news/spieler-bricht-bei-unterhaus-partie-zusammen-1360143\n. 07.09.2021 Angielski piłkarz, 17-latek, podczas meczu dostaje zawału serca. W drodze do szpitala dopada go drugi zawał. Zmarł w szpitalu:\nhttps://www.rtl.de/cms/fussball-drama-nach-doppeltem-herzinfarkt-17-jaehriges-talent-dylan-rich-stirbt-an-herzversagen-4826938.html\n. 16.09.2021 W Danii przerwano drugoligowy mecz. Jeden z zawodników (22 lata) zasłabł. Wylądował w szpitalu. Meczu nie wznowiono:\nhttps://www.kicker.de/spielabbruch-in-daenemark-zweitligaspieler-kollabiert-871300/artikel\n. 17.09.2021 Piłkarz Bayern Monachium Coman musiał poddać się operacji serca:\nhttps://www.stern.de/sport/fc-bayern–kingsley-coman-muss-nach-herz-op-pausieren-30751028.html\n. 24.09. 2021 Gracz golfa Felton podczas gry nagle padł na murawę. Wylądował w szpitalu:\nhttps://www.n-tv.de/leute/Harry-Potter-Star-kollabiert-auf-Golfplatz-article22825314.html\n. 28.09. 2021 17-letni piłkarz pada na murawie. Konieczna była reanimacja. Wylądował w szpitalu:\nhttps://www.goettinger-tageblatt.de/Die-Region/Hann-Muenden/Hann.-Muenden-Nach-Kollaps-17-jaehrigem-Fussballer-geht-es-besser\n. 30.09.2021 U zawodnika ligi okręgowej podczas meczu doszło do zatrzymania akcji serca. Konieczna była reanimacja. Wylądował w szpitalu:\nhttps://www.schwaebische.de/landkreis/landkreis-sigmaringen/bad-saulgau_artikel,-hossircher-spieler-erleidet-herzstillstand-_arid,11417526.html\n. 16.10.21 Podczas pierwszoligowego meczu piłki nożnej zasłabł na trybunie kibic. Konieczna była reanimacja. Kibic wylądował w szpitalu:\nhttps://www.focus.de/sport/fussball/bundesliga1/gesundheitszustand-unklar-notarzt-einsatz-in-der-bundesliga-fan-muss-bei-freiburg-partie-reanimiert-werden_id_24339189.html\n. 17.10.2021 Podczas pierwszoligowego meczu w Anglii jeden z kibiców zasłabł. Konieczna była reanimacja. Kibic wylądował w szpitalu:\nhttps://www.kicker.de/medizinischer-notfall-spurs-profis-erzwingen-spielunterbrechung-in-newcastle-875099/artikel\n. 17.10.2021 Podczas meczu piłki ręcznej zasłabł na trybunie kibic. Mecz przerwano. Kibic wylądował na kardiologii:\nhttps://www.hessenschau.de/sport/handball/hsg-wetzlar/handball-bundesliga-spielabbruch-bei-hsg-wetzlar,wetzlar-bhc-102.html\n.\n.Na pewno nie są to wszystkie podobne przypadki. O ilu nic nie wiemy? O ilu łże-media milczą? Znalazłem na pewnym forum podobną wyliczankę. Wprawdzie bez linków – ale jest wiarygodna – sporo nazwisk i przypadków pochodzi z powyższej wyliczanki udokumentowanej linkami. Zamieszczam kulawe tłumaczenie OKULARY. Oryginalny tekst jest tu:\nhttps://www.hansaforum.de/viewtopic.php?f=2&t=751502&start=2940\n.\n„Zatrzymanie serca i problemy z sercem, właśnie na tym poziomie, teraz było to w zasięgu mojej ręki. Oto wiadomości, tylko z ostatnich 7 tygodni! Wielu będzie teraz gwałtownie się z tym nie zgodzić; dla jednego lub drugiego może to być okazja do przeprowadzenia badań i spojrzenia na całość bardziej krytycznie.\nMecz siatkówki przerwany z powodu zatrzymania akcji serca sędziego w meczu Lauber SV (dzielnica Donauwörth).\n17-letni piłkarz JSG Hoher Hagen musi zostać w trakcie meczu reanimowany w Hannoversch Münden.\nSiatkarz ASV Baden (Dolna Austria) upada na boisku i trzeba go reanimować.\nMarvin Schumann-amator Gifhorn musi zostać reanimowany po zatrzymaniu akcji serca.\nAsystent sędziego siatkówki na meczu Kreisliga Augsburg w Emersacker załamuje się z powodu problemów z sercem.\nZawodnik ligi okręgowej SpVgg. Oelde II musi zostać wskrzeszony przez swojego przeciwnika.\nSiatkarka z Birati Club Münster cierpi w meczu ligi regionalnej z FC Nordkirchen II Eriksen. Los: zapaść z zatrzymaniem akcji serca. Gra została anulowana.\n17-letni piłkarz Dylan Rich umiera na atak serca podczas meczu w Anglii.\nTrener bramkarzy SV Niederpöring doznaje po treningu zawału serca.\nSiatkówka Lucas Surek (24) z BFC Chemie Leipzig cierpi na zapalenie mięśnia sercowego.\nSiatkówka Kingsley Coman (25) z Bayernu Monachium przeszedł operację serca po arytmii.\nSiatkówka 19-letni piłkarz FC Nantes doznał zatrzymania akcji serca podczas treningu 16 września 21 września.\nTrener siatkówki Dirk Splitsteser z SG Traktor Divitz pada martwy na uboczu.\nRune Coghe (18) z Eendracht Hoglede (Belgia) podczas gry doznaje ataku serca.\nSiatkówka Na meczu kwalifikacyjnym kobiet do Mistrzostw Świata pomiędzy Niemcami i Serbią w Chemnitz angielski sędzia liniowy z problemami z sercem musi zostać usunięty z boiska.\n16-letni nienazwany piłkarz z Bergamo doznał zatrzymania akcji serca (6.9.2021).\nLider drużyny siatkówki Dietmar Gladow z Thalheim (Bitterfeld) przed meczem doznaje śmiertelnego ataku serca.\n53-letni trener piłki nożnej Antonello Campus upada podczas treningu ze swoją drużyną młodzieżową na Sycylii.\nSiatkówka Anil Usta z VfB Schwelm (Ennepetal) upada na boisku z problemami z sercem.\nDimitri Liénard z FC Strasbourg załamuje się w meczu Ligue 1 z problemami z sercem.\nSiatkówka ASPTT Caen Diego Ferchaud (16 lat) doznał zatrzymania akcji serca w meczu ligowym U-18 w Saint-Lô.\nAin / Francja: Frédéric Lartillot ulega zawałowi serca po meczu towarzyskim w szatni.\nSiatkówka Belgijska piłkarka Jente Van Genechten (25) cierpi na zatrzymanie akcji serca na wczesnym etapie gry pucharowej.\nBelgijski piłkarz amator Jens De Smet (27) z Maldegem doznaje ataku serca podczas meczu i umiera w szpitalu.\nSiatkarz 13-letni piłkarz z klubu Janus Nova z Saccolongo (Włochy) upada na boisku z zatrzymaniem akcji serca.\nAndrea Astolfi, dyrektor sportowy Calcio Orsago (Włochy) po powrocie z treningów doznaje piorunującego ataku serca i umiera w wieku 45 lat bez żadnej wcześniejszej choroby.\nSiatkówka Abou Ali (22) upada z powodu zatrzymania akcji serca podczas dwupoziomowego meczu w Danii.\nZawodowiec z Bordeaux, Samuel Kalu, załamuje się z powodu zatrzymania akcji serca podczas meczu Ligue 1.\nFabrice N’Sakala (31) z Besiktas Istanbul upada na boisku bez żadnej akcji ze strony przeciwnika i musi zostać przewieziony do szpitala.\n22 lipca spotkały się SV Olympia Schlanstedt i Germania z Kroppenstedt. Podczas meczu zawodnik Schlanstedts Nicky Dalibor upadł i musiał zostać ożywiony na boisku.\nWiadomość z 30.09.21 Zawodnik upadł w meczu ligi regionalnej A 2 pomiędzy SV Hoßkirch i TSV Sigmaringendorf. Doznał zatrzymania akcji serca i musiał zostać reanimowany.\nWiadomość z 30.09.21 Chwała ratownikom. Badania przyczynowe? Ankieta SPORTBUZZER: Osoby udzielające pierwszej pomocy, które spotkały 17-latka na boisku sportowym w Hann. Niech ożywione usta są „bohaterami tygodnia”.\nPedro Obiang z włoskiego pierwszoligowego klubu Sassuolo Calcio (22) po szczepieniu przeciwko Covidowi w szpitalu na zapalenie mięśnia sercowego.\nSiatkówka Patrick Sinessamy, 38-letni mężczyzna z Saint-Denis pod Paryżem, doznaje na boisku śmiertelnego zawału serca.\nZawodnik Red Black Pfaffenthal (Luksemburg) upada na boisku i trzeba go reanimować.\nSiatkówka 18-letni nienazwany zawodnik w Burgenland (Austria) upada na boisku i można go uratować dzięki użyciu helikoptera.\nTim B. z SV Hamberge (Schleswig-Holstein) załamuje się po powrocie z turnieju piłki nożnej i umiera.\nSiatkówka Gracz z TuS Hoberge-Uerentrup (Bielefeld) upada na boisku z zatrzymaniem akcji serca.”\nW powyższej wyliczance znalazłem pewne nieścisłości – w kilku przypadkach zasłabnięcia podczas meczów piłki nożnej przypisano meczom siatkówki. Podaję konkretny przykład:\nSiatkówka Na meczu kwalifikacyjnym kobiet do Mistrzostw Świata pomiędzy Niemcami i Serbią w Chemnitz angielski sędzia liniowy z problemami z sercem musi zostać usunięty z boiska.\nW rzeczywistości był to mecz piłki nożnej:\n21.09.2021 Podczas meczu piłki nożnej kobiet Niemcy przeciwko Serbii przytomność straciła sędzina boczna. Odwieziono ją do szpitala\nhttps://www.n-tv.de/sport/fussball/Drama-um-Linienrichterin-bei-DFB-Pflichtsieg-article22818410.html\n.\nSkąd nagle pojawił się taki wysyp zasłabnięć, zawałów i zgonów na stadionach – i to na boiskach jak i na trybunach? Oczywiście, że łże media nie poinformują czytaczy i oglądaczy, że wszystkie, a przynajmniej prawie wszystkie te przypadki idą na konto ludobójczych szpryc z opóźnionym zapłonem. Jeśli segregacja sanitarna w jej najostrzejszej formie – tylko dla zaszprycowanych – zostanie na stałe wprowadzona, już teraz organizatorzy jakichkolwiek imprez sportowych powinni zamawiać większe ilości karetek pogotowia i sprzętu do reanimacji. A jeśli akcja szprycowania nie zostanie powstrzymana, to po czwartej, najpóźniej po piątej serii szpryc stadiony opustoszeją całkowicie – nie będzie miał kto grać i kto oglądać.\n.\nIgrzyska śmierci…\nhttps://opolczykpl.wordpress.com/2021/10/09/igrzyska-smierci/\n.\n… jakie narzuciła nam globalna sitwa, idą pełną parą…\n.\n.\nopolczyk",
			"added": 1634582466
		},
		{
			"topic_id": 1636109745,
			"title": "Poezja -  covidianin.",
			"body": "Autor: Barbara Cicha\nZ nudów trochę rymów\nWierszyk dla wszystkich zapatrzonych w telewizor zastraszonych nieszczęśników. Więcej, odwagi...\n.   ** covidianin**\nJestem sobie covidianin\nJak ostatni mohikanin\nBiegam w masce do lekarza\nKrawca, szewca i piekarza.\n.\nPunkty szczepień znam dogłębnie\nTesty robię ze 3 dziennie\nBy uniknąć czwartej fali\nNawet mi z odbytu brali\n.\nTak się bałem o swe życie\nŻe modliłem się choć skrycie\nDo Horbana i Simona\nI Pfizera i Johnsona.\n.\nDziś przeklinam mediów ściemy\nTefałpe i tefałeny\nBo po drugiej dawce szprycy\nNop w postaci zakrzepicy\n.\nZator w sercu i wątrobie\nWidzę kwiaty na mym grobie\nTym pocieszam się kolego\nUmrę, lecz na co innego\n.\nPozdrawiam.",
			"added": 1636109720
		},
		{
			"topic_id": 1636327067,
			"title": "Szczepionka zawiera twój kod kreskowy.",
			"body": "Szczepionka zawiera twój kod kreskowy.\n.\nCzy urządzenie Jabbed jest połączone z Bluetooth?\nFakt, że liczby zmieniają się wraz z przechodzącymi ludźmi, ma sens tylko wtedy, gdy sami ludzie są tymi urządzeniami?   / chodzi o ciało /.\nTo jest, ich własny numer-znacznik-bestii. / jak w obozie koncentracyjnym /.\n.\nWygląda na to, że wszystkie zaszczepione mają swój indywidualny ( rodzaj ) adres IP, \nktóry pojawia się na ekranie, gdy aktywowany jest bluetooth i skanuje otoczenie w poszukiwaniu dostępnych urządzeń bluetooth.\nJak widać, robiłem to przez pięć minut, a cyfry zmieniają się wraz z ciągłym strumieniem pieszych i pojazdów. Wszystkie adresy mają ten sam format.\nDwanaście cyfr oddzielonych dwukropkiem, mieszanka cyfr i znaków alfabetycznych.\nZdecydowanie nie tak wygląda dostępne urządzenie Bluetooth na ekranie. Zwykle otrzymujesz nazwę urządzenia i symbol, Który pokazuje jakiego rodzaju urządzenie, np. zestaw słuchawkowy, telefon, samochodowy sprzęt hi-fi itp.\nIm więcej jest osób jest w pobliżu, tym więcej pojawia się liczb, a lista zmienia się z sekundy na sekundę.\nNie jestem profesjonalistą, ale znam się trochę na komputerach i nigdy wcześniej czegoś takiego nie widziałem.\nMoje poszukiwania w sieci nie dały absolutnie nic poza kilkoma innymi, którzy zauważyli to samo zjawisko. Fakt, że liczby zmieniają się wraz z przechodzącymi ludźmi, ma sens tylko wtedy, gdy sami ci ludzie są urządzeniami.\nJeśli to prawda, każdy posiadacz smartfona ( oprócz iphone'a ) może teraz na własne oczy zobaczyć, o co chodzi w tym wszystkim? Czyli całej agendzie Corona. Każdy może to sprawdzić sam. Nawet zaszczepieni niewierzący mogą udać się do lasu lub gdzie indziej, gdzie są sami i spróbować. Ten sam numer, który zawsze widzą na ekranie, bez względu na to, kiedy na niego patrzą, jest ich własnym numerem identyfikacyjnym „bestii”.\nWygląda na to, że tp tb stworzył ten cały scenariusz Corona. między innymi, aby wstrzyknąć każdemu zastrzyk zawierające tlenek grafenu i samo organizujące się ( ta zdolność jest jedną z cech tlenków grafenu ) w ciele do jakiegoś sztucznego układu nerwowego, która łączy osobę do inteligentnej sieci bezpośrednio przez 5G lub przez smartfon tej osoby.\nI przypuszczam, że to tylko jeden z aspektów tego potencjału; Ciosu jaki został zadany ludzkości.\nTemat jest rozwojowy.\nCzuwaj.",
			"added": 1636327041
		}
	],
	"topic_vote": {
		"1613863319_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	},
	"next_comment_id": 83,
	"comment": {
		"1598188181_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "Też się spotkałem że znika. Albo nie można się dostać. Komunikat, niema takiej strony, sprawdź adres.Strona została usunięta, strona nie odpowiada, i tym podobne komunikaty. Ale inaczej, można wejść, na patent.",
				"added": 1600363024
			}
		],
		"1595401739_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 2,
				"body": "Lbry, niczym się nie różni od okularów. Musisz wszystkie dane swoje podać. Nie możesz pozostać anonimowy. To tylko są wyselekcjonowani ludzie z tłumu. Ci co są aktywni. WSZYSTKO JEST KONTROLOWANE.\nMożesz tylko zmienić kontrolera z zachodniego; na wschodniego, co jest lepszym rozwiązaniem. Jego nasze problemy nie interesują. Więc dla niego nie istniejesz.",
				"added": 1602333376
			},
			{
				"comment_id": 5,
				"body": "Dla Tuby alternatywą jest, Yandex. Niema takich ograniczeń. Cenzury.",
				"added": 1602715290
			}
		],
		"1601331592_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 3,
				"body": "Taka prawda, ona jest nie bardzo lubiana.Jest wręcz prześladowana.",
				"added": 1602333505
			}
		],
		"1602407103_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 4,
				"body": "Daje do myślenia, jak się przyjrzeć dokładnie. A co na to Watykan? Państwo w państwie.",
				"added": 1602407653
			}
		],
		"1606779945_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 6,
				"body": "Odebrane, obejrzę. Dzięki.",
				"added": 1606796797
			}
		],
		"1605552425_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 7,
				"body": "Ciekawe sprawy poruszacie, coś się ruszyło na Zero? Znowu żyje ta strona.",
				"added": 1606798752
			},
			{
				"comment_id": 74,
				"body": "Do końca roku jest jeszcze daleko. Ale to nie jest głównym problemem? Zobaczcie co się dzieje  dokoła, i wyciągnijcie sami wnioski. Ta akcja jest przygotowywana od dawna, i zrobią wszystko żeby im się udało.\nczuwaj.",
				"added": 1634248908
			}
		],
		"1607981410_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 8,
				"body": "Ale lista, wymiata. Dwa razy czytalem, straszna perfidia. trudno uwierzyc.Wydrukowalem i przesle dalej.\ndzieki.",
				"added": 1608040044
			},
			{
				"comment_id": 13,
				"body": "@gafel2,- Na wszystkie trzy wpisy. Manifestacja była przygotowana od dawna, to nie ulega wątpliwości. Przyszła ta chwila, padła komenda; Zbiórka, idziemy, Ta decyzja zapadła w gabinecie niewidzialnego. Rozesłano wici, i poszli.\n.\nJęzyk Słowiański, z tego co wiem; To jest bardzo stary język i naród, który tym językiem się posługuje. A Filistyni? pewnie byli po drodze. \n.\n.(*prawdziwy naród wybrany*), \n.postawię pytanie, do czego wybrany? I kto go wybrał? \"JA\" go nie wybierałem, a może ktoś, z tutaj obecnych to zrobił. Ich charakter, mówi sam za siebie. Zresztą ta lista powyżej, coś opisuje. Jakimi prawami, i zasadami, się tam rządzą. Są to ich przykazania na co dzień. To co musi być od święta????\nCzuwaj.",
				"added": 1608326018
			}
		],
		"1608039600_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 9,
				"body": "Ciekawy temat zostal poruszony tutaj. Jestem pod wrazeniem, musze sie przyznac. To sklonilo mnie do zabrania glosu w tej sprawie. @gafel2, ladnie opisane i udokumentowane zjawisko. Ja to tez widzialem i  spostrzegalem, ale nie zaieralem glosu w tej sprawie. Co sie bede  wyroznial? Temat stanal na wokandzie, i trzeba chyba zabrac glos w tej sprawie. Porownanie tego do testow? jest bardzo adekwatne i prawdziwe. Testuja nas, na ile jestesmy zidioceni?\nPanowie tego jest znacznie wiecej, to jest czubek gory lodowej. Dobrze ze ktos zabiera wreszcie glos w tej sprawie. Musze zebrac mysli do kupy, wtedy napisze cos wiecej; Przepraszam za bledy, klawiatura. Chwilowo nie moge tego zmienic. To co zostalo tutaj napisane przez kolege,  to jest kompletna prawda. Ja o tym tez wiem, i jeszcze pare osob znajomych. Byli tez zdziwieni? Tym ze wczesniej tego nie zuwazyli. Jest pelna konsternacja, ludzie po studiach, zaradni, na wyjezdzie zagranicznym, piastuja stanowiska zgodne z wyksztalceniem. Szok.\nTemat dwutlenku jest znany, i jest zamieciony pod dywan. Warto sie tym zajac, tak na powaznie.\nWidze tutaj doborowe towarzystwo.\nCzuwaj.   ( bylem harcerzem ).",
				"added": 1608135219
			},
			{
				"comment_id": 10,
				"body": "@fornakter; Proponuję obejrzeć filmy na YouTube PL, \n.1-   2018.11.11.02.[PL]-Zdrowie-Nauka-Dwutlenek węgla a długowieczność-[39min]-\n.2-   2019.01.04.01.[PL]-Nauka-Ksieżyc nie jest KULĄ-EN-(PL napisy)-[22min]-\n.3-   2018.12.31.01.[PL]-Fizyka-Astronomia-Gwiazdy Nie są tym czym myślisz-[17min]-\n.4-   2017.09.26.01.[PL]-Nauka-200-razy-że Ziemia NIE jest wirującą kulą-Eric Dubay-PL-\nTo tylko jest parę tematów, w tym temacie. Te filmy odpowiedzą na twoje wszystkie pytania postawione tutaj?\n Obejrzyj je uważnie, i ze zrozumieniem; ZeroNet jest zbiorem Wiedzy której nie znajdziesz gdzie indziej. Poświęć trochę swojego czasu dla dobra nauki.\nJa obejrzałem 400-szt. zebranych tutaj filmów, I zmieniłem swój stosunek do całego świata. Już nie jestem tym kim byłem.\nMiłego oglądania.",
				"added": 1608223602
			},
			{
				"comment_id": 11,
				"body": "Tak masz rację; zbyt dużo negatywnych skutków. Dla kogo??? Dla bogatych, przede wszystkim. Farmacja, poniosła by ogromne straty, Producenci kiepskiego Jedzenia, Handel kiepskim jedzeniem, ( MacDonald ).\nUderz w stół, nożyce się odezwą. Konopie, i inne lecznicze zioła? Które Leczą, faktycznie. A nie chemiczne przeciw bólowe. Aby, tylko uśmierzyć ból.\nIndie, Księgi Wedy. Wiedza, którą próbuje się pozamiatać bezskutecznie. \nPOLECAM- FILM.   2020.12.17.01.[PL]-Polityka-Zdrowie-Zastrzyk-To port USB-do naszego umysłu.",
				"added": 1608232760
			},
			{
				"comment_id": 12,
				"body": "@gafel2,     -Dzięki za obszerne wyjaśnienie. Słyszałem sporo o leczniczych właściwościach Konopi. Traktowałem to na luzie, może prawda? a może NIE. W internecie tylko same złe recenzje na temat Konopi. Jakie to szkodliwe, i niebezpieczne. Ze znajomymi dyskutowaliśmy na ten temat; To wyśmiali mnie. Byłem zaskoczony ich, twardością stanowiska. Myślę sobie, a może mają rację? Zacząłem poszukiwania na ten temat. Nic nie mogłem znaleźć z początku. Potem trafiłem na stronę , gdzie po przeczytaniu zbaraniałem całkowicie. Dzisiaj już wiem, że to jest kłamstwo. Dlatego nie pozwolą tego zioła używać, jest ono za tanie, i za dobre; zbyt szybko można uzyskać pozytywny skutek. Rozmawiałem z pewnym fachowcem, występuje w internecie. J. Zięmba,  ten to dopiero otworzył mnie oczy. I teraz Ty dodatkowe Ciekawe rzeczy mówisz. To są łobuzy i kanalie, ile ludzi można by wyleczyć, uzdrowić, postawić na nogi. Żaden specjalista tego ci nie powie, o takiej alternatywie leczenia. Z tego co wiem, to Konopia pita jako napar, skutecznie uśmierza ból. I co ważne, nie można się uzależnić od tego zioła.\nA o tej komorze też słyszałem.  Nawet miałem taki pomysł, aby coś takiego zbudować sobie samemu na działce, ale żona się wydarła na mnie, że jestem nawiedzony. O na tylko seriale ogląda, w TV. I tylko o tym z sąsiadkami rozmawia. Jaka to fryzura, i sukienka. Albo ,że została zdradzona, przez męża . Dom wariatów. Ale to nie jest na temat. Potrzebuję więcej czasu, aby to wszystko zrozumieć.\nCzuwaj.",
				"added": 1608316005
			}
		],
		"1608360093_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 14,
				"body": "Głos poparcia: **Bardzo ważna sprawa**, jest już nas, dwóch, trzech, a może więcej? Ciekawi mnie ilu ludzi czyta te artykuły? Gdyby zechcieli tak, dać jakiś znak, życia?\n. Bardzo fachowy opis, i merytoryczny. Światełko w tunelu, są ludzie z Wiedzą i trzeźwo myślący. Piszesz o specjaliście od nadajników radiowych, Jest jeden znany, nazywa się \"Gelzok\" , albo jakoś tak, mogę się mylić, piszę z pamięci. Spróbuję go odnaleźć, i jego sprawy sądowe, które wygrywa z korporacjami. On bazuje tylko na przepisach, i żadnej sprawy nie przegrał w sądzie. Prawdziwy postrach dla sieci telekomunikacyjnych. Boja się go jak ognia. Facet ma fenomenalną pamięć, wszystko pamięta, wszystkie decyzje, daty, i orzeczenia ma w głowie. Chodzący komputer. Prawdziwy postrach na sali sądowej. Najlepsi obrońcy wymiękają przy nim.\nJak coś znajdę w jego wydaniu to opublikuję tutaj. Gość zna temat jak mało kto. Dziesiątki wygranych spraw w całym kraju. \n. A co do wirusów, patogenów, bakterii, to moja wiedza jest trochę ograniczona. Ale nie aż tak, żebym nie wiedział z czym to się je. Potrafię odróżnić prawdę od kłamstwa, są ludzie którzy posiadają wiedzę w tym temacie. Jedyny problem - wyszukiwarka goglowska niechętnie pozwala coś użytecznego znaleźć.  Wszech obecna  \"CENZURA\" , daje znać o sobie. Zresztą ostatnio nasiliło się mocno wycinanie w internecie. Znikają całe strony, znikają wpisy, znikają ludzie. Przydała by się jakaś pantoflowa reklama - ZeroNeta, wśród znajomych, sąsiadów i rodziny. Ja wiem jak mało skuteczne jest namawianie kogoś do zdobycia prawdziwej wiedzy. Praktycznie jest to czynność bezskuteczna.          Ale warto próbować, tak jak reklamy w TV. Z czasem ludzie ulegną.\n. Leczenie Boreliozy przy pomocy ( grypy ). To jest rewelacja, słyszałem już to od kogoś? Ale patrzałem na ten opis trochę nieufnie, ( nowość ). To tylko świadczy o tym jaki nam zrobili bajzel w głowach. Trudno ludzi przekonać do prawdy, a ona leży na samym wierzchu, i wszyscy na nią patrzą. ( przeciętny lekarz ), jest tyle warty co \"NIC\". Dawny Felczer, Pielęgniarka, bystra salowa, może pomóc więcej choremu pacjentowi, człowiekowi. \nCzuwaj.\nPs. Nowa klawiatura już działa, niewielki wydatek, a \"szlag\" przestaje człowieka trafiać przy pisaniu.",
				"added": 1608457036
			},
			{
				"comment_id": 15,
				"body": "@sasza, Dzięki, i dla żony również. Chyba jedyna kobieta tutaj. \nJeśli jest jeszcze jakaś kobieta niech się odezwie, i nie chowa za spodniami chłopa.\nCzuwaj.",
				"added": 1608464292
			},
			{
				"comment_id": 16,
				"body": "POST,- CZYLI OGRANICZONE JEDZENIE; Występuje we wszystkich stanach chorobowych, pomijając złamanie nogi. Wszystkie zwierzęta jak są chore? To przestają jeść. Wystarczy je uważnie obserwować, Pies, czy Kot. Jak jest chory, to przechodzi na dietę, tylko pije wodę. To o czymś musi świadczyć. Stan gorączki? to też jest  stan walki organizmu z chorobą. Co robi lekarz? Zbija, likwiduje gorączkę. Przeszkadza w samo-naprawie organizmu. Podaje antybiotyk, który niszczy florę bakteryjną organizmu. I to niszczy bezpowrotnie. Odbudowa może już być bardzo utrudniona.\n. Szkoła, miała uczyć? a tak naprawdę co robi? Naucza być posłusznym korporacjom, bo one płacą kasę. Kółko się zamknęło. A my w tym kółku bezradni, i ogłupieni.\n. Alkohol; wszyscy wiedzą, tylko nikt nie zważa na \"TO\". Ten film Rosyjskiego naukowca, stawia do pionu co niektórych. Jest wiedza, i WIEDZA-.\nCzuwaj.",
				"added": 1608478761
			}
		],
		"1608325060_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 17,
				"body": "TYLKO, - 32-składniki,  ( PSEUDO - szczepionki ), mam pytanie? Tablica Mendelejewa ile ma składowych? bo zapomniałem, niech ktoś przypomni.  Czy dużo brakuje, aby osiągnąć ten poziom? \nTaki ponury żart, \nSkładniki jakie tam są? mówią bardzo wiele. Trzeba być niedorozwiniętym umysłowo, aby dać sobie to gówno wstrzyknąć.",
				"added": 1608758706
			}
		],
		"1605668877_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 18,
				"body": "Jednak taka Dania, się trochę postawiła. Czyli \"MOŻNA\" było, jak się chce? Co trzeba zrobić, żeby się tak zachciało? \nOczywiście to dotyczy inne wolne kraje, niezależne. \nNie mam na myśli Polin i Pinokia. Bo to jest zależny kraj.  Jakie dwie zbieżne nazwy powstały. Pinokio i Polin.\nCzuwaj.",
				"added": 1608764819
			}
		],
		"1608488270_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 19,
				"body": "Tutaj raczej chodzi o dodatkową cząstkę tlenową. Na przykład, H2O,  zamienione na H2O2, Inna moc działania. Dodatkowa cząstka, która wchodzi w reakcję z rodnikami choroby, nie naruszając przy tym zdrowych komórek.\nA co do dwutlenku węgla? To jest budulec naszego organizmu, bardzo potrzebny dla naszego istnienia. \nDwutlenek nam pomaga, w odpowiedniej proporcji, a nie szkodzi. Wszystko co nam pomaga jest nie zalecane i szkodliwe. Więc trzeba to w jakiś sposób wyeliminować z naszego otoczenia. Oraz z naszej głowy.\nCzuwaj.",
				"added": 1608988525
			},
			{
				"comment_id": 21,
				"body": "Zwalnianie oddechu w Indiach, słyszałem. Tylko myślałem , że to dotyczy medytacji i i takich wyższych stanów duchowych. Zaciekawił mnie ten Pokrywka. muszę to sprawdzić .\nCzuwaj.",
				"added": 1609058524
			}
		],
		"1608946398_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 20,
				"body": "**TAK*, Najprostsze rozwiązania są najlepsze, trudno je jest zauważyć. Każdy szuka czegoś skomplikowanego. \nA nie zwraca uwagi na proste rozwiązania. Witamina \"D\", to nasze Słońce i do tego za darmo. Pierwsza przeszkoda do pokonania. Więc co zrobiono? Zagonili nas do pracy, i Słoneczka nie widzimy, siedzimy w murach z dala od potrzebnej nam Witaminy \"D\". Jest to jedna z ważniejszych witamin, które można otrzymać o określonej godzinie.\nInne witaminy zjadamy, i czas nie odgrywa takiej roli. \nPrzypadkowo, Chemitralsy też przysłaniają nam słońce. W zamian aplikując  Aluminium i inne zbędne pierwiastki. \nCzy to też jest może depopulacja? żartuję sobie na ponuro.\nCzuwaj.",
				"added": 1608989291
			},
			{
				"comment_id": 22,
				"body": "Ludzie muszą się dowiedzieć o tej możliwości. A  - glifosat  w naszym pożywieniu, trzeba będzie popytać chemików. Jak zablokować wchłanianie, albo usuwanie, oczyszczanie z organizmu. Nic nie słyszałem na ten temat. Przy okazji rozejrzę się, może coś wpadnie , jakaś podpowiedź. Może ktoś z czytelników?\nCzuwaj.",
				"added": 1609059255
			},
			{
				"comment_id": 25,
				"body": "Chemia to zawsze choroba i śmierć. Im więcej tym gorzej. Kierunek Depopulacja i ubezwłasnowolnienie. Przejęcie kontroli nad wszystkim. Traktują nas jak bydło rzeźne, i mięso armatnie.\nCzuwaj.",
				"added": 1609257286
			},
			{
				"comment_id": 26,
				"body": "Panowie, złazić na ziemię z drzewa. Przestańcie bujać w obłokach. Jak chcecie przestawić parę milionów kupujących. To jest nie wykonalne. \"Nie kupować\".  Gówno zapakowane w sreberko kupią, jeśli będzie napisane,\nEKOLOGICZNE.  Pomału kończą się dobre pomysły, i zaczyna ich brakować. Jak temu zaradzić   ?\nCzuwaj.",
				"added": 1609347207
			}
		],
		"1609085684_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 23,
				"body": "To wyjaśnia dlaczego zachód tak przebiera nogami. To pokazuje zakulisowe rozgrywki. Jednak Niedźwiedź nie zapadł w zimowy Sen. To wiele wyjaśnia.\nCzuwaj.",
				"added": 1609110754
			}
		],
		"1609163095_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 24,
				"body": "Akurat zajrzałem, i jest znowu coś ciekawego. Jest o Rosji, ale my jesteśmy jej sąsiadami, a to zobowiązuje do uwagi w tym kierunku. Z sąsiadami trzeba żyć w zgodzie i pokoju. Rosja jakoś cowidem się nie przejmuje, to tylko znaczy że to jest lipa, którą nam zaserwowano. Oni wiedzą o tym, i palą głupa. Mówiąc gwarą podwórkową. Co ciekawe, nikt tam nikogo do niczego nie zmusza, i żadnych obostrzeń niema. Całkowita wolna amerykanka. Tylko w Moskwie paru ćwiczy głupa. Nie wiadomo dlaczego. Pewnie dla zmylenia przeciwnika. Znam autora, pisze ciekawe teksty i prawdziwe. Można mu zaufać.\n.\nCzuwaj.",
				"added": 1609164574
			}
		],
		"1608998976_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 27,
				"body": "@fornakter,\nZapewne po cenie rozpoznasz takie buty.  żartowałem.\nNa mój rozum to musi być skóra, żadna guma czy plastyk. Skarpetki, to wełna, albo bawełna. Jeśli skarpetki plastykowe, to buty nic tutaj nie pomogą. \nPrymitywnie, to bym gwoździe metalowe na wylot wbił i rozklepał jak nity. Żeby nie uwierały w nogi, stopy. Trzeba by zobaczyć czy coś niema w internecie? Moje przemyślenie. Naturalne skarpetki, i  zdejmowanie obuwia, gdzie tylko się da. (czyste nogi ).\nWyrzucić wszystkie na gumowej podeszwie. Wtedy się okaże, że możemy tylko biegać na bosaka jak Cejrowski.\n.\nCzuwaj.",
				"added": 1609795705
			}
		],
		"1609543281_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 28,
				"body": "Dobre z tą szczypionką, ( zamierzone ). \nPołowa jest ograniczona w myśleniu. A druga połowa, niema czasu na pierdoły. Dla nich zmiana, - DNA, i  - RNA,              = to głupota. A do kataru się już przyzwyczaili, i nie zwracają na to uwagi. \nCzuwaj.",
				"added": 1609796093
			},
			{
				"comment_id": 29,
				"body": "Twój układ odpornościowy jest niewydolny. Zdrowy człowiek nie miewa katarów. Trzeba zmienić , słowo ZDROWY,  na słowo, odporny na infekcje. Masz rację, katar mają tylko nieodporni ludzie. Braki w odżywianiu są tego przyczyną.\nPlus zatrucie chemią. Powoduje osłabienie.\nCzy jest coś co pozwala ludziom odróżnić prawdę od fałszu? Jasne, Intuicja. Zanim skończy mówić, już wiesz że to jest kłamstwo. Do tego mowa Ciała, kłamca inaczej się zachowuje, od kogoś mówiącego prawdę. To od razu przecież widać. Tego nie da się ukryć.\nWirusy istnieją, tak długo jak my istniejemy. Czyli od zawsze. To są nasi ochroniarze. Ktoś kiedyś nazwał to sanepidem. To jest dobre określenie. Walka z nimi, to strzał w kolano. Chodzi o sztuczną walkę. \nIQ, dobre sobie, testy na inteligencję. Z tym się rodzisz, i masz zawsze. Szkoła nic w tym nie pomaga.\nCzuwaj.",
				"added": 1609817457
			}
		],
		"1609762064_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 30,
				"body": "Słyszałem o tym, ale jakoś tym się nie zainteresowałem. Dobrze że zwracasz uwagę na to. Warto to ponownie sprawdzić, i może ponownie przetestować. - Wiedzy nigdy nie jest za dużo. Poczytam na ten temat, w internecie.\nCzuwaj.\n.\n@fornakter, pytał ilu jest ludzi? Podpowiadam: Główna strona.\n . Otwórz Statystyki→Połączenia→Ja mam w tej chwili, 26 / 1848 użytkowników.  Onion, mam 63,- osoby.\nPoniżej Polska ma 22- Osoby.  To jest na głównej stronie, →otwieram zakładkę, gdzie jest globus.\n. Połączony, 12-\n. Onion,  7-\n. Możliwy do 138-\n. Sumarycznie  139-\nTak wygląda o godz, 10:00- rano. Wieczorem, albo w nocy, będzie inaczej.",
				"added": 1609922987
			},
			{
				"comment_id": 31,
				"body": "Przejrzałem pobieżnie, jeszcze raz przeczytałem. Jest tego trochę do przyswojenia . Dosyć to mocno skomplikowane, dużo tekstów do zapamiętania. Terminal, niema mowy o pomyłce. Zrobienie ściągi, może być pomocne. Zakładam łączność pomiędzy dwoma punktami na początek. Zwiększenie ilości punktów, dalej to komplikuje obsługę. To jedna sprawa: Następna trudność, to ewentualne systemy dystrybucji, Linux - winda. Różne rodzaje poczt. Bezpośrednio niema to wpływu na szyfrowanie, ale pomyślałem o napisaniu instrukcji. Jednej dla wszystkich systemów. W celu możliwości ogarnięcia tematu tym słabszym technicznie. Taka instrukcja, dla przedszkolaka. ( naciśnij prawy klawisz ).\nPorównam do ZeroNeta, o ile pierwsza instalacja jest trochę trudna. I zapoznanie się z zawiłościami tego systemu.\nTo potem pracując na tym systemie, wszystko jest w miarę proste. Poczta tutaj jest też szyfrowana, z automatu. Niema pośrednika, parametry Poczty też można poprawić. Na początku te parametry były lepsze, potem zostały zmienione na gorsze, ktoś o tym zdecydował i zmienił. Dobry informatyk może to przywrócić z powrotem. Wniosek nasuwa się jeden, najlepiej samemu trzeba to umieć zrobić. ZeroNet, też był kiedyś lepszy. Wszystkie poprawki zawsze wprowadzają pogorszenie. Dobry system, to prosty system. Tak jak łom. ( otwiera każdą kłódkę ).\nPodczas czytania historii, PGP  -  GPG . Nasunął się jeden wniosek. Kiedyś to też było proste, potem zostało opatentowane, i zaczęła się przepychanka. Zmiany, obejścia, usprawnienia, Kod źródłowy jest bardzo długi. czyli niemożliwy do sprawdzenia i zweryfikowania. A to już jest nieprzyjemne uczucie w informatyce. \nSam pomysł jest dobry, ale jak to się ma do Backdoora  umieszczonego w centralnym procesorze. \nKtoś powie, że się czepiam drobiazgów. Ale to mi przypomina drzwi w nowym budownictwie, zrobione z płyty pilśniowej: i zamontowane na nich cztery patentowe zamki. Same drzwi nie stanowią problemu wejścia na -KOPA-\nZamki pozostaną dalej zamknięte. Takie drzwi, powinny być,  jak w starożytnym Egipcie. Blok kamienia o wadze      20-ton. Do dzisiaj nikt nie może wejść.  Skuteczne szyfrowanie, też takie powinno być. Proste i skuteczne.\nNie mam zastrzeżeń co do jakości tego szyfrowania. Zastrzeżenia mam co do systemu w jakim jest używane.\nPatrząc z góry na to wszystko, To nasz ZeroNet ma wciąż wiele zalet, które trudno nie docenić. Trzeba zrobić tylko parę poprawek w nim. Poprawki musi zrobić swój człowiek o dużym zaufaniu społecznym i nie przekupny. Sprawdzony przez innych, chodzi o naszą przyszłość. Takie, być albo nie być, oto jest pytanie.\nZeroNet, to dobra struktura, szkoda tylko, że nie może się przebić przez lenistwo i patologię ludzką. Gdzie znaleźć odpowiedniego informatyka. Jak namówić ludzi do używania ZeroNeta, Jego siła tkwi w ilości użytkowników.\nTrochę się rozpisałem, taka nostalgia mnie naszła, wraz z Nowym Rokiem.\nCzuwaj.",
				"added": 1609958707
			},
			{
				"comment_id": 32,
				"body": "Słusznie zauważyłeś, że duża reklama jest zawsze podejrzana. Sama reklama, To jeszcze pewnie nic, co do reszty wypowiedzi reklamodawcy. sprawa wspierania szczypionek, to już jest trochę podejrzane. Kogo wspiera. \n następnie firma która to wyprodukowała? Sprzedaje, czy daje za darmo. ( firma )? Od kiedy firma daje za darmo?\n Czyli znowu mamy pośrednika. To też jest troszkę podejrzane. Dlaczego to robią.\nPrzejrzeć kod źródłowy,  to jest sprawdzian rzeczywisty. Kto może to zrobić? Otwarty - Dostęp do tej możliwości. Open Source. Jest jakąś tam gwarancją. Brak zamkniętych fragmentów Kodu. Jest już jakąś wykładnią uczciwości. \nKto jest w wstanie to wszystko sprawdzić? I czy można jemu wierzyć. \nCiągłe poprawki i zmiany, też dobrze o tym nie świadczą. Wiele pytań, komu można dzisiaj wierzyć? Ktoś o tym już pisał. Posługując się logiką to wszystko jest jednym wielkim kłamstwem, takie mam czasami wrażenie. \nKiedyś wszystko było proste. Teraz sztuczna inteligencja mocno przeszkadza w tym wszystkim. A informatycy dla kasy zrobią każde gówno. ( wybory w stanach i liczenie głosów ). A tutaj kontrola służb. \nWiem, że Nic nie wiem.\nCzuwaj.",
				"added": 1610114133
			},
			{
				"comment_id": 43,
				"body": "@krzotr.\nDobrze to opisałeś, całkowicie się z tobą zgadzam. Pierwsza opinia, Mnie się podoba, \nObsługa w miarę prosta, wymaga troszkę pomyślunku. Niema cenzury? To jest ważne, jest przyzwoicie.\n\nInformacja zwrotna,\n.\n*brakuje mi informacji zwrotnych od użytkowników (feedback), co ulepszyć, co usunąć, jakieś propozycje? Społeczność korzysta z ZeroNet, to oni powinni mieć znaczący wpływ na rozwój systemu. To oni korzystają z systemu na co dzień.*\n.\nMoją bolączką jest ograniczona trochę poczta?Mogła by być deko większa. Akurat ja korzystam dużo z poczty.\n / jest szyfrowana /.\nDla pozostałych zapewne ta poczta wystarcza. Większych zastrzeżeń nie mam. Co do reszty ZeroNeta,\n.\nZ innych propozycji? To może kanał z muzyką, ktoś by uruchomił, i prowadził. Typowy dla polski.\nOgólnie to mało jest ludzi. Polska to specyficzny kraj, bardzo różny od innych. Od jakiegoś czasu obserwuję i zaglądam tutaj. Na ile czas pozwala. Dwie trzy osoby się udzielają. To wszystko.\nTematów przecież nie brakuje? Każdy niech coś wrzuci ciekawego. \nTo co uważa za ciekawe? Jak dwudziestu to zrobi, to mamy co czytać i oglądać.\n.\nCzuwaj.",
				"added": 1613750152
			}
		],
		"1610039932_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 33,
				"body": "Zawsze były złodziejskie i bandyckie. Napadały i grabiły. A teraz my  jesteśmy ich kolonią . To nic dobrego nie wróży dla nas i naszych dzieci. Sowiecka komuna, to był śpiew Słowika. Do tego co nas czeka.  Wpadliśmy z deszczu pod rynnę. To nie jest rynna, to jest Niagara.\nCzuwaj.",
				"added": 1610114732
			}
		],
		"1610225804_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 34,
				"body": "Ciekawe rzeczy piszesz. Czy -  Chcesz nas zastraszyć? To co napisałeś to jest porażające. Aż trudno jest w to uwierzyć.  Kto by pomyślał, że linux już nie jest linuxem. Co te Gady zrobiły. To co jeszcze nadaje się do bezpiecznego  urzytku? \nPiszesz, że to jest, mocno na skruty? To ile jest tego materiału bez skrutów?  Może byś wiecej  napisał  w tym temacie. Jeśli tylko  możesz? \n\nCzuwaj.",
				"added": 1610226717
			},
			{
				"comment_id": 36,
				"body": "Dobrze powiedziane, Linux to jest świat wiecznego kreowania i rozwoju. \nMyślę Samodzielnie, bez niczyjej pomocy.  ( sztuczna inteligencja ).",
				"added": 1610658659
			}
		],
		"1610653930_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 35,
				"body": "Ludzie są kompetentni? Co to znaczy, i kto jest taki kompetentny? Ja nikogo takiego nie widzę, w pobliżu. \nA co do resetu, to zależy dla kogo on będzie miękki? To jest dalej piramida, i ci na dole mają przechlapane. Oni nie ogarniają niczego. Po za, flaszka i pętko kiełbasy. \nA co do skasowania pindowsa, Ja to dawno zrobiłem. Ale kogoś przekonać do tego, to już trudna sprawa.\nKażdy uważa,  że to nie dotyczy jego. On jest nietykalny i siedzi w kinie i ogląda Film.\nczuwaj.",
				"added": 1610655172
			}
		],
		"1610658422_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 37,
				"body": "To jest przedruk, który uznałem za dobry, wartościowy. Jest, zwarty, i logiczny. I z nim w większości się zgadzam. była jeszcze część religijna ale uznałem, że nie jest w temacie i obciąłem. Religia to jest jedno, a technika to drugie. Nie należy tego mieszać razem. Przedruk, to przedruk - więc bez zmian poszedł do druku.\nCzuwaj.",
				"added": 1610741584
			}
		],
		"1610376246_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 38,
				"body": "U mnie jest odebrany, trzy razy na odebrane. Moja uwaga, wszystko odbywa się z dużym opóźnieniem. To tak przy okazji tego tematu. Peery szwankują, i Trackery też? Co się dzieje, koniec świata?\nCzuwaj.",
				"added": 1611241451
			},
			{
				"comment_id": 39,
				"body": "Przeczytałem, dzięki. Ja mam kompa cały czas włączony. Nie wyłączam nigdy. Wtedy można zawsze pobrać.\nczuwaj.",
				"added": 1611398221
			}
		],
		"1611766514_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 40,
				"body": "Jak zawsze, od Sekuraka ciekawe wiadomości. Mam tą stronę, i ją obserwuję. Czy zauważyliście, że od Linuxa, jest niewiele problemów? To tak przy okazji. Lata mijają a windows wciąż jest dziurawy, nie mogą GO naprawić? Łatają, poprawiają, naprawiają, a on jest jak sito dziurawy. Zastanawia mnie tylko jedno. Użytkownicy tego giganta Nieszczęścia. Wciąż są na posterunku, wciąż trwają na posterunku, z uporem Maniaka przewlekle Chorego.\n Sekuraka prenumeruję parę ładnych lat. Przez te lata nie widać żadnych zmian. Poprawy w windowsie. Wychodzi nowa dystrybucja windowsa? I ona jest już dziurawa od pierwszego dnia, wydania. Coś w tym musi być, zapewne jakieś siły Obce z kosmosu przeszkadzają, windowsowi. A na Linux-ie, cisza i błogi spokój.\n.\nCzuwaj.",
				"added": 1611773919
			}
		],
		"1610316461_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 41,
				"body": "Czasami się zdarza taka sytuacja. Zdążyłem zauważyć. Zwróć uwagę jak wysyłasz na peery z prawej strony, zielone kółko. Ono szybko znika, Jaka tam jest liczba, Jeśli jest niska, na przykład, 2/2, 3/3, To masz gwarantowane, że się nie zapisze. Trzeba o innej godzinie, spróbować powtórnie wysłać. To oznacza że w twojej sieci, jest mało użytkowników. w tym momencie. Dobrze jest, jak jest, 5/5, albo 6/6, peerów. To idealny stan. Można poprawić, zwiększając liczbę czynnych Trackerów.\n.\nCzuwaj.",
				"added": 1611774587
			}
		],
		"1612186153_1HxF6zesCAqUtGzUYJ8WpE1TnLFsnQZw8s": [
			{
				"comment_id": 42,
				"body": "Robi się ciekawie? Jakieś kontr argumenty?\n.\n. *Jeśli macie jakieś pytania lub problemy z wykonaniem całego procesu pisać śmiało.*\n. Jak wygląda sprawa bezpieczeństwa, tej instalacji? Co to daje, użytkownikowi. Jaki jest zysk.\n.\nczuwaj.",
				"added": 1612200701
			}
		],
		"1613863319_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 44,
				"body": "Pamiętam jak reklamowali Brave? Jaka jest bezpieczna i dobra. Mineło trochę czasu i wyszło szydło z worka. \nI powiem wam jedną rzecz, TAK - JEST - ZE - WSZYSTKIMI - PRZEGLĄDARKAMI. Zastanawiam się, czy tam są same debile opłacani przez -NWO-? Bo na to wychodzi , że tak. \nJa zrobiłem pewien wyłom, i zaczełem korzystać z Yandex-a, Rosyjskiego. Ciekawi mnie kiedy się u niego pojawią jakieś błędy???? Taki eksperyment. \nCzuwaj.",
				"added": 1613928733
			}
		],
		"1614897242_181pxua95EmDYcDgDUZ7r7QGr2ti6VKtMa": [
			{
				"comment_id": 45,
				"body": "Czarna lista jest Ok. A może tak zrobić białą listę? Co warto czytać, oglądać?",
				"added": 1615098299
			}
		],
		"1615329718_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 46,
				"body": "@arione, Wreszcie jakaś sensowna wypowiedź. Która ma ręce i nogi.\nczuwaj.",
				"added": 1615413147
			}
		],
		"1616448209_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 47,
				"body": "Jeden z tych co się nie ugiął, nie ukleknął. Nie przyjął łapówki, Dlatego GO, zamordowali.\nCzuwaj.",
				"added": 1616448881
			},
			{
				"comment_id": 48,
				"body": "*Zrobi wszystko, żeby przeżyć.*\nZROBI WSZYSTKO, ŻEBY ZOSTAĆ u WŁADZY. Tylko władza się liczy w tych kręgach.",
				"added": 1616662772
			}
		],
		"1618791207_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 49,
				"body": "Na gorąco przeczytałem, to jest porażające ile tego jest? Takie niby niewinne - E -, coś tam.\n I my to wszystko zjadamy i się trujemy. Jakie są efekty tego zatrucia to możemy zobaczyć na naszych ulicach. Bardzo dobry materiał, warty polecenia innym do przeczytania.\n.Brawo Sasza.",
				"added": 1618792932
			}
		],
		"1619237581_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 50,
				"body": "Przebudzenie bedzie bolesne, co dla niekturych. Pod jednym warunkiem, że się obudzą. A nie umrą na stojąco.",
				"added": 1619260308
			}
		],
		"1618368827_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 51,
				"body": "On niema żadnych ograniczeń. Nikt nad nim nie stoi, i go nie kontroluje. Niektóre składniki są wręcz zalecane.\nCzuwaj.",
				"added": 1620579259
			}
		],
		"1620938699_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 52,
				"body": "Chyba to jest  prawda. Polecam przeczytać uważnie.\nCzuwaj.",
				"added": 1620947447
			}
		],
		"1621774948_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 53,
				"body": "Interesujący przekaz? My to już wszyscy wiemy.\n A MINISTER TO OLEWA TOTALNIE.\n.\nczuwaj.",
				"added": 1621783886
			}
		],
		"1623191172_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 54,
				"body": "Słyszałem co nieco na ten temat? Ale nigdy się nie zastanawiałem nad tym zjawiskiem. Wiemy, ale nie zwracamy uwagi. Przechodzimy obojętnie dalej.\nCzuwaj.",
				"added": 1623492268
			},
			{
				"comment_id": 56,
				"body": "Ludzie są w letargu? Albo inaczej, są uśpieni. Są zablokowani, są nieprzytomni. Kto za to odpowiada? To tylko pytania do ściany? A co na to ściana? Nic nie widzi, nic nie słyszy.\nCzuwaj.",
				"added": 1625961193
			}
		],
		"1623615171_193fCp5MWKjfmbNuSd5thzbfDsCj5whHTQ": [
			{
				"comment_id": 55,
				"body": "Też przejrzałem? Kto za tym stoi? Jakie służby mają w tym interes? Ja podejrzewam dodatkowo przekręt finansowy? A na służby stawiam od pejsatych. Chcesz kontrolować konkurencję? To ją stwórz samemu, i zarządzaj nią, od podstaw? Jest zbyt piękne, żeby było prawdziwe?\nczuwaj.",
				"added": 1623679322
			},
			{
				"comment_id": 57,
				"body": "Jeśli są pieniądze na reklamę? To jest sygnał, że ktoś to finansuje. Jeśli finansuje? To czegoś oczekuje w zamian, czego on oczekuje? Pieniędzy? Informacji? Czy twoich danych? Można uzupełnić według własnego widzimisię. Dystrybutor czeka na coś? To nie jest robione na piękne oczy? Każdy dystrybutor jest równocześnie pośrednikiem, Twoich rozmów, twoich listów, w sumie, ON wszystko wie o tobie, a to tylko oznacza, że może tobą manipulować. Może Tobą Sterować zdalnie na odległość. Co chcesz jeszcze wiedzieć? \n. Czy Signal, jest Dobry?  Pytanie? A do czego to ma służyć? Jaki wysoki stopień jawności publicznej? To jest odpowiedź dla Ciebie. Ta ocena sytuacji, należy tylko do Ciebie.\npozdr.",
				"added": 1625964460
			}
		],
		"1625955253_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 58,
				"body": "Jestem z wami, macie moje wsparcie.",
				"added": 1625971296
			}
		],
		"1626571418_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 59,
				"body": "Ale nazbierałeś tych punktów? Dobre. Ale niestety prawdziwe.",
				"added": 1626582217
			},
			{
				"comment_id": 60,
				"body": "Bo sąsiad się zaszczepił?\nBo to jest trendy?\nBo tak trzeba.",
				"added": 1626878167
			},
			{
				"comment_id": 61,
				"body": "@svvarog .\nMa więcej mądrości, bo nikt go nigdy nie zaszczepił? Jak myślisz, czemu ludzie są takie durne??? \nBo dostali dużo szczepionek, one są po to aby ogłupić od małego dziecka. Zobacz ile teraz jest debili w szkołach? Prostego zadania nie potrafią rozwiązać.",
				"added": 1626946443
			}
		],
		"1627505214_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 62,
				"body": "Dobre, dawno tak się nie ubawiłem? A tak ogólnie, to się zastanawiam nad tym fenomenem, typu kawały i humor? Kiedyś jak pamięcią sięgnę,  to każdy napotkany znajomy, miał jakiś kawał w zanadrzu. Dzisiaj to już praktycznie nie spotykane zdarzenie? Sam siebie zapytuję, co się stało z tymi ludźmi, gdzie się podziało poczucie humoru???\n.\nCzuwaj.",
				"added": 1627620291
			}
		],
		"1626943982_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 63,
				"body": "Tak to jest dobre, ale nie dla wszystkich? Tylko dla tych co latają wysoko.\n.\nCzuwaj?",
				"added": 1627620422
			}
		],
		"1626719398_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 64,
				"body": "Co masz na myśli. pisząc *rzetelne źródło*\nCzy chodzi tobie o wpisy tutaj umieszczane? Jeśli tak, to te źródło jest dosyć rzetelne i sprawdzone. To nie jest tuba i troling. Większość wpisów, jest udokumentowana i sprawdzona. Czas pokazuje, że te wpisy były zawsze prawdziwe.\n.\nCzuwaj.",
				"added": 1628796926
			}
		],
		"1628313902_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 65,
				"body": "Lucyfer, to nic innego, jak oświecony? Ale my to odbieramy jako coś innego. Oświecony, - to jest mądry. Kogo on ma na przeciw? Głupiego Idiotę. Kto jest tym idiotą? To my jesteśmy tymi, którymi można nami manipulować. Tak już wychodzi że my nie rozumiemy co do siebie mówimy? Nam podmieniono, zamieniono słowa których używamy.\nCzuwaj.",
				"added": 1628941064
			}
		],
		"1629535835_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 66,
				"body": "Wyjaśniam co następuje. Zastrzyk ma coś co przyrząd pomiarowy rozpoznaje? / tlenek grafenu /. Na granicy, przechodzisz przez bramkę i ona rozpoznaje, czy był zastrzyk, czy nie był? Zaświadczenie możesz mieć przy sobie, i tak Ciebie zawrócą. To jeszcze nie jest we wszystkich krajach wprowadzone. Nowsza wersja ma mieć numer szczepionki? który będzie się wyświetlał, w świetle UV-u. Na grandę chcą dać wszystkim te zastrzyki. Ten temat jest rozwojowy. Kupienie zaświadczenia? Może się okazać lipą. W jednym kraju funkcjonuje, a już w drugim mają inne metody. Chcą żebyśmy wzieli zastrzyki i siedzieli w domowym areszcie. Ta gra jest już prowadzona 18-miesięcy. Trochę późno się obudziłeś. Temat rzeka.\nPozdrawiam.",
				"added": 1629557238
			},
			{
				"comment_id": 68,
				"body": "Raczej chyba to jest niemożliwe. Dlatego zastosowano właśnie Tlenek Grafenu. Prawdopodobnie właśnie w tym celu wymyślono Grafen. Wszystko jest robione na zmówienie.\nczuwaj.",
				"added": 1630770834
			},
			{
				"comment_id": 69,
				"body": "@fornakter.\nZ rtęci można oczyścić. Ale z Grafenu, już nie można. Na tym polega ten szatański plan? Tego nie można usunąć. Chyba że zrobimy, kilkukrotną wymianę krwi?\nczuwaj.",
				"added": 1631550722
			}
		],
		"1629763452_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 67,
				"body": "Witam. Chyba trzeba by było uzupełnić i dopisać ten fakt? Rozumiem że chodzi o rok 1942- Czy jakiś inny?Możesz więcej jakiś szczegółów podać, to uzupełnię i dopiszę. Napisz pełny Rok.\nczuwaj.",
				"added": 1630017402
			}
		],
		"1632945787_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 70,
				"body": "To są statystyki. Ile są warte? Pochodzą od koniokradów.",
				"added": 1632951611
			}
		],
		"1633477933_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 71,
				"body": "Ciekawy temat? Komunikator, który jest w pełni. / kontrolowany /. Co on pokazuje, że jesteśmy w czarnej  - DUPIE.\n. czuwaj.",
				"added": 1633485374
			},
			{
				"comment_id": 73,
				"body": "Myślę że nadszedł czas nawiązywania znajomości niezależnych. I nie kontrolowanej łączności internetowej. Już jutro, to może się mocno przydać nam. Szkoda że ludzie tego nie rozumieją?\nczuwaj.",
				"added": 1634034960
			}
		],
		"1633712778_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 72,
				"body": "Ciekawy tekst. Trochę jestem zdezorientowany. Muszę to wszystko przemyśleć od początku. Kto komu, i co jest winien? Wiem że mam braki historyczne, zresztą historia nie jest moją mocną stroną.\nczuwaj.",
				"added": 1633721869
			}
		],
		"1634582490_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 75,
				"body": "Macie całkowitą rację, ale tam cenzura nie pozwoli na taką działalność.\nczuwaj.",
				"added": 1634895734
			},
			{
				"comment_id": 77,
				"body": "Sprawy są zakładane. A może coś powiesz o skazujących wyrokach??? Chociaż jeden taki wyrok? Gdzie ktoś został skazany? Chyba że to był szatniarz , który zgubił numerek.\nczuwaj.",
				"added": 1634939056
			}
		],
		"1634884167_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 76,
				"body": "Zainstalowane, macie moje wsparcie. Takie sprawy trzeba dodawać na ZeroSite-PL. To tam można sprawdzić co jest nowego zainstalowane? Na XD- nikt nie zagląda? Przynajmniej JA. Trzeba tam koniecznie dodać...\nczuwaj.",
				"added": 1634910334
			}
		],
		"1635374346_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": [
			{
				"comment_id": 78,
				"body": "Potwierdzam, dobre.",
				"added": 1635382155
			}
		],
		"1636543084_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 79,
				"body": "@kapec  Uwaga. Wytyczne dla straży granicznej, to jest jedno. A propaganda w telewizorni to drugie. Tutaj masz dwie telewizornie, zachodnia i wschodnia. Obie się różnią przekazem dla gawiedzi? Pozostaje samemu przeprowadzić analizę. Podstawą jest wiedza zdobyta samodzielnie, a nie ze szkoły???\nczuwaj.",
				"added": 1636711486
			}
		],
		"1636327067_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 80,
				"body": "Tak traktują nas jak sprzęt, maszynę, przedmiot. Nie traktują nas jako żywe istoty. Jesteśmy w tej grze, Bio - Robotami.\nczuwaj.",
				"added": 1637177114
			},
			{
				"comment_id": 82,
				"body": "@kapec. \n *wnioski z kosmosu*\n. Proponuję obejrzeć dwie części filmu - Jak wyjść z Matrixa? To tylko jest początek drogi do przejścia.",
				"added": 1637509083
			}
		],
		"1637232450_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 81,
				"body": "Ciekawe, spostrzeżenie?\n\nOstatnio się dowiedziałem, że grafen ma 6 protonów, 6 elektronów i 6 neutronów, 666. Jest to ciekawy przypadek, spiskowy. Taki, że mówi się, że jest w szczypawkach, od razu mi \"TO\" : Się kojarzy, znamię bestii 666,\n i inne \"teorie spiskowe\".",
				"added": 1637264833
			}
		]
	},
	"comment_vote": {}
}