{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "123123",
			"body": "1231231",
			"added": 1562683217
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 1,
				"body": "спасибо за пояснение",
				"added": 1562683534
			},
			{
				"comment_id": 2,
				"body": "а мне интересно стало, если кто-то создаст аналог гидры то как его будут удалять?",
				"added": 1562684060
			},
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_228_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Аналог чего?\nну сайт где продают нарокоту и оружие и прочую запрещённую фигню",
				"added": 1562684196
			},
			{
				"comment_id": 4,
				"body": "> [geekless](#comment_230_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Поймать владельца и выпытать приватный ключ.\n> Принуждает государство ловить реальных преступников, а не заниматься имитацией бурной деятельности закрывая их сайты. Будто наркота от сайтов заводится, а не от тех, кто её производит.\n\nТо-есть, если кто-то создаст тут сайт и выложит детское порно, даже разработчики zero не смогут удалить?)",
				"added": 1562684871
			},
			{
				"comment_id": 5,
				"body": "> [fant](#comment_10_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Никто не удалит. Но люди просто могут не сидировать.\n\nахринеть)",
				"added": 1562685123
			},
			{
				"comment_id": 6,
				"body": "> [geekless](#comment_232_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): @tridvaraz:\n> Сайты продолжают функционировать без владельца\nэтож пипец читерство)))\nЯ тут на ютюбе еше аналоги нашел https://www.youtube.com/watch?v=HXV1x0WUaWg",
				"added": 1562685534
			},
			{
				"comment_id": 7,
				"body": "> [fant](#comment_11_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Если не заниматься моральными аспектами, то надо помнить что ZN - сеть не анонимная. И если что-то выкладывать, то всегда надо включать Тор в настройках.\n\nнадо в настройках зеро или достаточно поднять тор на роутере?",
				"added": 1562685877
			},
			{
				"comment_id": 8,
				"body": "> [geekless](#comment_233_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): FreeNet только для статических сайтов, и он сам скорее мертв, чем жив. Под капотом некоторые механизмы интересные, можно в ZeroNet украсть.\n> GNUNet еще в живые и не выбирался, сколько там, тысяча узлов наберётся на всю планету?\n> Netsukuku немного из другой области. И кстати вроде тоже помер.\n> Так что...\n\nда кстати FreeNeet мне не понравился",
				"added": 1562685945
			},
			{
				"comment_id": 9,
				"body": "> [geekless](#comment_234_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если в настройках зеро поставить режим всегда через тор, этого в принципе достаточно, чтобы пиринговой сети не разгласить свой настоящий IP. Но как всегда, остаётся возможность вычислить человека по другим характерным признакам, или через трояны и дыры в софте.\n> Вот тут я писал разные про способы подключения и что они дают: http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/?Post:5Если кратко, для обычного пользователя, сидящего за файрволом провайдера, нет смысла использовать режимы, отличные от \"всегда тор\".\n\nнорм описано",
				"added": 1562688931
			}
		]
	},
	"comment_vote": {}
}