{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1525248944,
			"title": "[feature request] Профиль пользователя",
			"body": "Хорошо бы иметь на каждого юзера профиль со списком его тем, комментариев, датой последней активности и полем \"о себе\".",
			"added": 1525248943
		},
		{
			"topic_id": 1525928087,
			"title": "Stickied topics корректно работают?",
			"body": "На [Ru-ZeroTalk](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/) движок старый, там есть баг — закреплённые топики перестают всплывать наверх, если уходят достаточно глубоко в прошлое. Вероятно, движок отображает stickied из выборки текущей страницы, а не отдельным запросом к БД.\n\nКто-нибудь проверял, этот баг исправлен в новых версиях ZT, или так и продолжается?",
			"added": 1525928085
		},
		{
			"topic_id": 1535439560,
			"title": "Баг позиционирования STICKIED топиков?",
			"body": "Сабж: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/stickied-topic-position-bug.png\n\nЗамечал только на Infonesy.Talk, что странно.\n\nUPD: О, и на этом форуме тоже.",
			"added": 1535439557
		}
	],
	"topic_vote": {
		"1525669678_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1524297715_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1524304010_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [],
		"1525248944_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 2,
				"body": "> [calmaquesse](#comment_1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Это уже фича ZeroID, наверное.\n\nУ ZeroID нет фич, кроме выдачи сертификата.",
				"added": 1525249629
			},
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): У ZeroID нет фич, кроме выдачи сертификата.\n\nБлин, таки надо написать статью, как устроены механизмы авторизации и аутентификации в ZN. Второй месяц ленюсь.",
				"added": 1525249803
			},
			{
				"comment_id": 4,
				"body": "> [calmaquesse](#comment_2_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): То есть статистика каждолго сертификата учитывается не централизованно, а каждый сайтом в отдельности?\n\nВ настоящее время вообще никем не учитывается. :) Я всё мечтаю о зайте-агрегаторе апдейтов, который будет объединять все действия сертификата в одну ленту. (Со всех известных агрегатору зайтов.) Но пока никто не запилил.\n\nВ полной мере централизованно её считать невозможно в силу распределённой природы сети. ZeroID просто подписывает пару ник + ключ, гарантируя, что \"владелец этого публичного ключа известен мне под таким-то ником\".",
				"added": 1525250647
			},
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_7_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В приложениях такого нет и быть не может по сути ZN. В конкретной инфо о пользователе там, где её можно ввести, всегда можно дать ссылку на блог, который предварительно несложно завести :)\n\nНе распарсил.",
				"added": 1525253220
			},
			{
				"comment_id": 6,
				"body": "@balancer73, я вижу проблему как раз в том, что нет единого такого места на сайте, где пользователь может вбить ссылку на свой сайт.\n\nВот здесь на форуме было бы круто, например, если бы было так: пользователь наводит мышку на твой ник в заголовке поста, и в выпадающем меню сразу видно, мол, \"вот мой блог — раз, вот я в ZeroMe — два, вот еще пара форумов, где я общаюсь, — три\".\n\nЭто намного удобнее, чем искать, где же на форуме был коммент или пост, в котором пишущий дал ссылку на свои сайты.\n\nТехнически это одно дополнительное поле в data.json. И это полностью лежит в той прадигме работы с зайтами, которую ты считаешь удобной. (И я тоже.)\n\nИ это сразу поднимает второй вопрос:\n\nЕсли я хочу посмотреть, что на форуме писал конкретный ник (всего его недавние комментарии, например), движок не даёт такой возможности. Нужно лезть в data.json и читать это в плейнтексте там.\n\n\nЯ бы и сам прислал патч... найти бы силы разобраться с проклятым coffee script, чтож им на JS-то не писалось...",
				"added": 1525333155
			}
		],
		"1524295020_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 7,
				"body": "Кстати. Можно движком сайта парсить контент текущей веб-страницы, и если там есть адресация изображений, расположенных на других ZeroNet-доменах, делать запрос на доступ к этим доменам через стандартное API.\n\nТочно, добавлю в список задач по двиглу блога.",
				"added": 1525611715
			},
			{
				"comment_id": 8,
				"body": "> [x86128](#comment_3_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): А как будет это выглядеть когда будет много разных доменов в запросе?\n\nКак спам уведомлений, наверное. Придётся ограничить количество запросов по времени?",
				"added": 1525615483
			},
			{
				"comment_id": 9,
				"body": "Самое близкое к движку галлереи изображений — http://127.0.0.1:43110/1D2C23aAoHeoJsvPjZZxS9bt3i93uRVfUP/ Но что-то он у меня не работает как надо.\nДумаю, готовых решений с удобным интерфейсом нет. Кому-нибудь еще предстоит их накодить.",
				"added": 1525616985
			},
			{
				"comment_id": 10,
				"body": "> [balancer73](#comment_12_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Судя по попадающимся «escape from iframe» рассчитано на старые версии ZeroNet.\n\nВозможно. Но я эту надпись подозрительно часто вижу даже при загрузке вполне обычных зайтов. Не знаю, отчего так.",
				"added": 1525617394
			}
		],
		"1535439560_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 11,
				"body": "Да, отследил на ванильном движке тоже. Непостоянный баг.",
				"added": 1535530390
			},
			{
				"comment_id": 13,
				"body": "> [balancer73](#comment_16_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Видимо, пиры найтись не могут с источником.\n\nПодозреваю, что мы с anotherneko сидим в tor-only сегменте сети.",
				"added": 1535530593
			},
			{
				"comment_id": 14,
				"body": "Наверное, ноут уже забраковал все пиры, к которым не смог подключиться, так что при обнаружении сайта на новом пире, сразу подключился туда.",
				"added": 1535536244
			}
		]
	},
	"comment_vote": {}
}