{
	"title": "diamond farm",
	"description": "My Blog.",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)",
	"next_post_id": 18,
	"demo": false,
	"modified": 1495441671,
	"post": [
		{
			"post_id": 17,
			"title": "New blog post",
			"date_published": 1495441671.124,
			"body": "Blog post body"
		},
		{
			"post_id": 16,
			"title": "wall dimentions",
			"date_published": 1495441326.503,
			"body": "the ground floor part - wider, 50 cm, with 20 cm for the horizontal support for the first floor\n\nthe first floor part - normal, 30 cm"
		},
		{
			"post_id": 15,
			"title": "logs ",
			"date_published": 1484096701.215,
			"body": "the diameter of the log should be 16 cm, that is the size of the steel tube for the corner column"
		},
		{
			"post_id": 14,
			"title": "New blog post",
			"date_published": 1481615239.939,
			"body": "Queensland grows about 600 ha of strawberries each year, mainly along the coastal strip from Caboolture to Eumundi. The Bundaberg area has also become a significant production region in recent years, and small areas of strawberries are also grown on the Atherton Tableland, around Brisbane, in the Lockyer Valley, and on the Darling Downs and Granite Belt. Approximately 150 growers are involved in the industry, and farms range in size from 5000 to 5 million plants. The industry is worth about $130 million to the Queensland economy. \n\neResearch Archive\n\neResearch Archive (eRA)\nPublished papers, reports and presentations from the department\nCrop management\n\nIncorporating best practice into your business\n\nStrawberry: best soil, water and nutrient management practices (PDF downloads from eRA)\nA guide to better soil, water and nutrient management practices for the South East Queensland strawberry industry\nStrawberry information kit (PDF downloads from eRA)\nInformation on all aspects of growing and marketing strawberries\nPests and diseases\n\nPests and diseases \nA guide to the major pests and diseases that affect strawberry crops in Queensland\nAgvet chemicals and residues \nUse of chemicals in agriculture\nHarvesting\n\nHarvesting, yields and prices \nWhen to harvest, and what yields and prices to expect when producing strawberries\nProducing horticultural crops\n\nTips for a successful business \nCharacteristics of a successful horticultural enterprise, markets, production areas and risks\nHorticulture and climate change \nClimate change challenges and opportunities for horticulture industries\nInformation for new growers\n\nFrequently asked questions \nInformation on varieties, planting, nutrition, irrigation, chemical spraying and more\nStrawberry land and climate requirements \nInformation about the ideal growing conditions for strawberries"
		},
		{
			"post_id": 13,
			"title": "Layers in the construction of a mortarless pavement: A.) Subgrade B.) Subbase C.) Base course D.) Paver base E.) Pavers F.) Fine-grained sand",
			"date_published": 1481273852.302,
			"body": "Blog post body"
		},
		{
			"post_id": 12,
			"title": "subgrade",
			"date_published": 1481273782.158,
			"body": "In transport engineering, subgrade is the native material underneath a constructed road,[1] pavement or railway (US: railroad) track. It is also called formation level."
		},
		{
			"post_id": 11,
			"title": "hardpan",
			"date_published": 1481270128.366,
			"body": "In soil science, agriculture and gardening, hardpan or ouklip is a dense layer of soil, usually found below the uppermost topsoil layer.[1] There are different types of hardpan, all sharing the general characteristic of being a distinct soil layer that is largely impervious to water. Some hardpans are formed by deposits in the soil that fuse and bind the soil particles. These deposits can range from dissolved silica to matrices formed from iron oxides and calcium carbonate. Others are man-made, such as hardpan formed by compaction from repeated plowing, particularly with moldboard plows, or by heavy traffic or pollution."
		},
		{
			"post_id": 10,
			"title": "farm business explored in diamond farm",
			"date_published": 1481270098.582,
			"body": "Blog post body"
		},
		{
			"post_id": 9,
			"title": "mini farm on pendragon?",
			"date_published": 1481270081.511,
			"body": "Blog post body"
		},
		{
			"post_id": 8,
			"title": "current focus - pendragon",
			"date_published": 1481269774.34,
			"body": "Blog post body"
		},
		{
			"post_id": 7,
			"title": "regarding the design of the swales ",
			"date_published": 1481267206.414,
			"body": "from protection of the house perspective, it should go across the right side of the house; \n\nbut we should make sure to find out exactly where the underground water and plumbing things are;\n\nthe builder should have the accurate info. talk to metricon\n\nwhere are the water goes: onto the street? or to the storm well?"
		},
		{
			"post_id": 6,
			"title": "special clothing for and snake proof boot",
			"date_published": 1481250630.762,
			"body": "Blog post body"
		},
		{
			"post_id": 5,
			"title": "handheld drilling machine ",
			"date_published": 1481250574.243,
			"body": "this we will need to drill into the ground and obtain earth sample, rock situation, and so on"
		},
		{
			"post_id": 4,
			"title": "New blog post",
			"date_published": 1481189579.704,
			"body": "http://www.houzz.com/Rock-Drainage-Swale"
		},
		{
			"post_id": 3,
			"title": "New blog post",
			"date_published": 1481188467.19,
			"body": "\n \nDefinition of riprap\n1\n:  a foundation or sustaining wall of stones or chunks of concrete thrown together without order (as in deep water); also :  a layer of this or similar material on an embankment slope to prevent erosion"
		},
		{
			"post_id": 2,
			"title": "house design",
			"date_published": 1475912046.596,
			"body": "let professor sun design a house for the farm; basic thoughts:\n- small, workable by ourselves;\n- itallian style;\n- rammed earth construction;"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}