{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1552737596_1Gr9aFEWAUK46TMkEQ8diA7BmnTcWL4MXK": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1553289965_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 1,
				"body": "Może uchylisz rąbka tajemnicy? Co znaczy \"blokowane\"? Cenzura? Napisz coś więcej !",
				"added": 1553359425
			}
		],
		"1553622843_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 2,
				"body": "> [kasiarzyna](#comment_5_1PMJncxnJAR5UnoxHX7ymFrEZEedmbSdku): Według mnie umieszczenie informacji na ten temat mogłoby odbywać się na stronie \"ZeroWiki Polska\". [...]\n\nTo jest dobry pomysł! Popieram. Stronę \"ZeroWikiPolska\" dopisać do spisu stron np. ZeroSites (jeśli jeszcze jej tam nie ma).",
				"added": 1553662373
			}
		],
		"1553627501_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": [
			{
				"comment_id": 3,
				"body": "> [tomasz21](#comment_95_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Procesor; to jest furtka przez którą mogą wejść, ci co znają hasło. Gdzie są produkowane procesory Intela?Są produkowane w izraelu. Mając dostęp do procesora ; mamy dostęp do całej maszyny, jak i procesów zachodzących tam. Czyli mamy kontrolę na Pc-tem. Ciekawostka , Rosjanie w urzędach zmienili dystrybucję windy, na dystrybucję Astra-Linux. Pochodna Debiana. + wojsko + policja. Jakby mało tego było, zaczęli produkcję swoich procesorów, jest ich cała gama. I mają dobre parametry. Plus dodatkowo płyta główna, ona też zawiera komponenty współpracujące , umożliwiające wejście od tyłu. Bardzo to się nie spodobało, ale nie wszystko musi się podobać. Jak to mówią; Jeden woli, teściową a drugi córkę. Druga sprawa Chiny i Huawei. Pytanie? O co tam poszło? Wiecie? Poszło o kontrolę telefonu; Usmany nie mogą kontrolować procesora w tym telefonie. Kropka. Znowu jest procesor i kontrola. Tak myślę sobie musi coś w tym być. To taki żart. Pozdr.\n\nMożesz podać jakieś, chociażby jedno źródło swoich informacji? Piszesz, że procesor to furtka i potem, że rosjanie zmienili s.o. Jeśli procesor jest \"be\" to po kiego zmieniać system operacyjny?! Nie słyszałem o prockach rosyjskich, masz jakiś namiar na taki sprzęt?",
				"added": 1556702509
			},
			{
				"comment_id": 4,
				"body": "> [tomasz21](#comment_107_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Witam; namiaru na taki sprzęt na razie nie mam.Sam jestem zainteresowany. Żadnych źródeł nie podaję, z przyczyn oczywistych; to tylko informacja jedna z wielu, jeśli temat interesuje trzeba go drążyć samodzielnie. Ja tylko udzielam wskazówek ,że coś takiego jest już w produkcji masowej. Co mogę polecić? Rosyjskie strony. Tam niema cenzury. \"Jeśli procesor jest \"be\" to po kiego zmieniać system operacyjny?!\"Odpowiadam; aby nie ułatwiać, -  ale aby utrudniać. Ci co to - tym się zajmują, niech zapracują na swój łatwy, zarobek i duży. Jeśli baran wierzga, to trudno go ostrzyc. Zajmuje dużo czasu, na każdego barana. Jak będzie coś nowego, to opisze okólnikami  znowu. Pozdr.A linkowanie i przekierowywanie to jest zły patent.\n\n- Jeśli to \"informacja jedna z wielu\" to może plotka jakich masa? Szkoda czasu na drążenie wszystkich plotek i wymysłów. \n- Jeśli jest w produkcji masowej to skąd ty o tym wiesz, gdzie o tym przeczytałeś? Podaj źródło. \n- Na Rosyjskich stronach też pełno plotkarzy, tak jak i na każdych. \n- Niczego nie jesteś w stanie utrudnić jeśli procesor będzie działał ponad s.o. a tak by musiało być jeśli ma być furtką. \nPodsumowując: piszesz by pisać, a nie by coś przekazać. Taka jest moja opinia na temat Twoich wpisów na tym forum.",
				"added": 1556727899
			}
		],
		"1557338480_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc": [
			{
				"comment_id": 5,
				"body": "Dziwnie jakoś zaczynasz ten temat... od komentarza?! To w stylu \"tomasz21\" :)",
				"added": 1557339919
			},
			{
				"comment_id": 6,
				"body": "> [tomasz21](#comment_109_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): [...]A jeśli ktoś ma wątpliwości, to proszę o pytania. To postaram się odpowiedzieć, jest tutaj wiele wątków tematycznych, i trudno znaleźć odpowiedź na wszystko.Pozdr.Ps. Brak możliwości, zmiany pisma jak i koloru nie pozwala na czytelne pisanie. Co utrudnia późniejsze czytanie.\nTo może ja pierwszy:\n- Dlaczego myślisz, że nie wiemy skąd się wzięła ludzkość? Szukałeś informacji na ten temat?\n- Nic nie wiemy o tym świecie?? Co masz na myśli? Ja uważam, że wiemy bardzo dużo.\n- Podzieliłeś ludzi na dwie kategorie, a Ty jesteś bio-robotem czy wybudzonym człowiekiem? Jak rozróżnić te dwa stany? \n- Jest jakiś test na sprawdzenie czy się jest \"myślącym samodzielnie\" czy \"zaprogramowanym\"? Kto ma to oceniać?\n- Co rozumiesz przez \"błędną hierarchię\"? Masz na myśli, że jest jakaś prawidłowa? Jeśli tak to jaka?\n- Jak rozumiesz słowo wolność?",
				"added": 1557419541
			}
		]
	},
	"comment_vote": {
		"5_1PMJncxnJAR5UnoxHX7ymFrEZEedmbSdku": 1,
		"6_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": 1
	}
}