{
	"title": "Empire's Blog",
	"description": "A blog about life on the farm,\nwhich is basically me complaining\nabout broken equipment.",
	"links": "- Current Ranch Stats\n- number of bolts broken: 13\n- Cans of WD-40 used: 1\n- Gallons of fuel burned: ???³\n\n\n- [Source code for ZeroNet](https://github.com/HelloZeroNet)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1471314181,
	"post": [
		{
			"post_id": 4,
			"title": "Fun with Trikes!",
			"date_published": 1471297303.872,
			"body": "<fixed now because prev. post didn't post right>\n\nIn our fleet of ranch vehicles, we've got two ATV's. A new Polaris 570, and a 1983 Honda ATC200e, marketed as the \"Big Red\". It was the golden age of utility ATV's, at least for Honda's threewheeler line (before some SJW's got pissed off about the fact that idiots were flipping them, and got them eliminated in favor of the 4-wheeled versions.)\n\nThis one's been giving me grief about the clutch for about a month, slipping in the higher gears and occasionally slipping when I take off from a start. Because of that and the fact that I didn't want to ruin the clutch if I couldn't help it, I parked it. Of course, I forgot to drain the carburetor or anything, silly me. \n\nToday, I finally got around to changing the oil and readjusting the clutch tension. And lo and behold, it quit slipping! Revelling in my final fix, I drove it around a bunch. Up to the house, back to the barn, around a couple back fields, etc. Then it started sputtering, and eventually died. Couldn't get it to idle, and even if it did start running it was crap. \n\nSomething, I don't know what, flattened the end of the sparkplug in. Even after I fixed that, the sparkplug was wet and it still ran like crap. Looks like the carburetor gunked up and now it's flooding the engine with fuel. It feels like battling the hydra sometimes, fix one thing and two more break."
		},
		{
			"post_id": 3,
			"title": "Hay loading",
			"date_published": 1471151028.868,
			"body": "So I had some fun loading hay today.\n\nWe run exclusively small bales, and because we don't have a stacker wagon we've been loading them with a custom-built spear attachment on our little John Deere loader. It's slow, but it's easier than hand-bucking.  \n\nI got a bit of a scare today when I went to pick up bale #391, when suddenly I found myself sprayed with hydraulic oil. That's usually a bad thing. \nNow, when the engineers at John Deere built this tractor, in their brilliance they decided to put the lines feeding the steering ram halfway up the side of the engine before turning back into a steel tube. Because of their position and a partially dust clogged radiator, everything got _plenty_ hot. And apparently it got hot enough to melt part of the rubber hose.  \n\nSo yea, now we're down till Monday when the parts store opens and we can buy a new hydraulic line. _sigh_"
		},
		{
			"post_id": 2,
			"title": "Start of Ze Blog",
			"date_published": 1471121806.643,
			"body": "Start of the blog! \n\nI'm a farm boy from Oregon, and I just got on ZeroNet a couple of days ago. Im excited to be part of a fully P2P network that bypasses some of the bottlenecks of a standard server-client system. \n\nI really don't know what I plan to put in a blog like this, other than my constant griping about broken equipment. (Either that or my ISP up to their usual shenanigans.) \n\nFollow. Don't follow. At this point it's just going to be a rant spot, so do what you want."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}