{
    "article": [
        {
            "title": "anapanasati",
            "text": "{{Buddhism}}\n{{Mindfulness}}\n'''Ānāpānasati''' ([[Pali]]; [[Sanskrit]] ''ānāpānasmṛti''), meaning \"[[Sati (Buddhism)|mindfulness]] of [[breathing]]\" (\"sati\" means mindfulness; \"ānāpāna\" refers to [[inhalation]] and [[exhalation]]<ref>{{cite web|title=Ānāpāna|url=http://dsalsrv02.uchicago.edu/cgi-bin/philologic/getobject.pl?c.0:1:2728.pali|work=The Pali Text Society's Pali-English Dictionary|publisher=Digital Dictionaries of South Asia, University of Chicago}}</ref>), is a form of [[Buddhist meditation]] originally taught by [[Gautama Buddha]] in several [[suttas]] including the ''[[Anapanasati Sutta|Ānāpānasati Sutta]]''.<ref>In the Pali canon, the instructions for anapanasati are presented as either one tetrad (four instructions) or four tetrads (16 instructions). The most famous exposition of four tetrads – after which [[Theravada]] countries have a national holiday (see [[Uposatha#Special uposatha days|uposatha]]) – is the ''Anapanasati Sutta'', found in the ''[[Majjhima Nikaya]]'' sutta 118 (for instance, see [http://www.accesstoinsight.org/tipitaka/mn/mn.118.than.html Thanissaro, 2006]). Other discourses which describe the full four tetrads can be found in the [[Samyutta Nikaya]]'s ''Anapana-samyutta'' (Ch. 54), such as SN 54.6 (Thanissaro, 2006a), SN 54.8 (Thanissaro, 2006b) and SN 54.13 (Thanissaro, 1995a). The one-tetrad exposition of anapanasati is found, for instance, in the ''Kayagata-sati Sutta'' ([[Majjhima Nikaya|MN]] 119; Thanissaro, 1997), the ''Maha-satipatthana Sutta'' ([[Digha Nikaya|DN]] 22; Thanissaro, 2000) and the ''[[Satipatthana Sutta]]'' (MN 10; Thanissaro, 1995b).</ref> (MN 118)\n\nĀnāpānasati is now common to [[Tibetan Buddhism|Tibetan]], [[Zen]], [[Tiantai]] and [[Theravada]] Buddhism as well as Western-based [[mindfulness]] programs. Simply defined, Anapanasati is to feel the sensations caused by the movements of the breath in the body as is practiced in the context of mindfulness meditation. \n\n== Origins in Buddhism ==\nAnapanasati is a core meditation practice in Theravada, Tiantai and Chan traditions of Buddhism as well as a part of many [[mindfulness]] programs. In both ancient and modern times, anapanasati by itself is likely the most widely used Buddhist method for contemplating bodily phenomena.{{sfn|Anālayo|2003|p=125}}\n\nThe ''[[Anapanasati Sutta|Ānāpānasati Sutta]]'' specifically concerns mindfulness of inhalation and exhalation, as a part of paying attention to one's body in quietude, and recommends the practice of anapanasati meditation as a means of cultivating the [[Seven Factors of Enlightenment]]: sati (mindfulness), [[dhamma vicaya]] (analysis), [[vīrya|viriya]] (persistence), which leads to [[pīti]] (rapture), then to [[passaddhi]] (serenity), which in turn leads to [[samadhi]] (concentration) and then to [[upekkha|upekkhā]] (equanimity). Finally, the Buddha taught that, with these factors developed in this progression, the practice of anapanasati would lead to release (Pali: ''vimutti''; Sanskrit ''mokṣs'') from [[dukkha]] (suffering), in which one realizes [[nirvana|nibbana]].{{citation needed|date=April 2015}}\n\n== The practice ==\n\n===Traditional sources===\n{{See also|Anapanasati Sutta}}\nA traditional method given by the Buddha in the ''[[Satipatthana Sutta]]'' is to go into the forest and sit beneath a tree and then to simply watch the breath, if the breath is long, to notice that the breath is long, if the breath is short, to notice that the breath is short.<ref>Majjhima Nikaya, Sutta No. 118, Section No. 2, translated from the Pali</ref><ref>[[Satipatthana Sutta]]</ref>\n\nWhile inhaling and exhaling, the meditator practises:\n*training the mind to be sensitive to one or more of: the entire body, rapture, pleasure, the mind itself, and mental processes\n*training the mind to be focused on one or more of: inconstancy, dispassion, cessation, and relinquishment\n*steadying, satisfying, or releasing the mind.\n\nA popular non-[[Pali Canon|canonical]] method used today, loosely based on the [[Visuddhimagga]], follows four stages:\n#repeatedly counting exhalations in cycles of 10\n#repeatedly counting inhalations in cycles of 10\n#focusing on the breath without counting\n#focusing only on the spot where the breath enters and leaves the nostrils (i.e., the nostril and upper lip area).<ref>{{cite book | last= Kamalashila | first= | coauthors= | year= 2004 | title=Meditation: The Buddhist Way of Tranquillity and Insight  | publisher=Windhorse Publications; 2r.e. edition | location= Birmingham | isbn = 1-899579-05-2 | pages=}}. Regarding this list's items, the use of counting methods is not found in the [[Pali Canon]] and is attributed to the Buddhaghosa in his [[Visuddhimagga]].  According to the Visuddhimagga, counting (Pali: ''{{IAST|gaṇanā}}'') is a preliminary technique, sensitizing one to the breath's arising and ceasing, to be abandoned once one has consistent mindful connection (''anubandh{{IAST|ā}}'') with in- and out-breaths ([[Visuddhimagga|Vsm]] VIII, 195-196). ''Sustained'' breath-counting can be soporific or cause thought proliferation (see, e.g., An{{IAST|ā}}layo, 2006, p. 133, ''n''. 68).</ref>\n\n[[Vasubandhu]]'s [[Abhidharmakośakārikā]] also teaches the counting of breaths to 10 as does the [[dhyāna sutras]] translated into Chinese by [[An Shigao]].<ref name=\"ahandfulofleaves.files.wordpress.com\">Deleanu, Florin; Mindfulness of Breathing in the Dhyāna Sūtras. Transactions of the International Conference of Orientalists in Japan (TICOJ) 37, 1992, 42-57. https://ahandfulofleaves.files.wordpress.com/2012/02/mindfulness-of-breathing-in-the-dhayana-sutra_florin-deleanu_1992.pdf</ref> This is organized into a teaching called \"the six aspects\" or \"the six means\" which according to Florin Deleanu:\n\n{{quote|The practice starts with \"counting\" (ganana), which consists in counting breathing from one to ten. When this is accomplished without any counting failure ([[dosha]]), the practitioner advances to the second step, i.e., \"pursuing\" (anugama), which means intently following the inhalation as it enters the body and moves from the throat, through the heart, the navel, the kidneys, the thighs to the toes and then the reverse movement of the exhalation until it leaves the body. Next comes \"concentration\" (sthapana) which denotes focusing one's attention on some part of the body from the tip of the nose to the big toe. In the fourth step, called\" observation\" (upalaksana), the practitioner discerns that the air breathed in and out as well as form (rupa), mind (citta), and mental functions (caitta) ultimately consists of the four great elements. He thus analyzes all the [[five aggregates]]. Next follows \"the turning away\" (vivarta) which consists of changing the object of observation from the air breathed in and out to \"the wholesome roots\" of purity (kusalamula) and ultimately to \"the highest mundane dharma\". The last step is called \"purification\" (parisuddhi) and it marks entering the stage of \"realization of the Way\", which in Abhidharma literature denotes the stage of \"the stream entry\" ([[Sotāpanna]]) that will inevitably lead the adept to [[Nirvana]] in no more than seven lives.<ref name=\"ahandfulofleaves.files.wordpress.com\">Deleanu, Florin; Mindfulness of Breathing in the Dhyāna Sūtras. Transactions of the International Conference of Orientalists in Japan (TICOJ) 37, 1992, 42-57. https://ahandfulofleaves.files.wordpress.com/2012/02/mindfulness-of-breathing-in-the-dhayana-sutra_florin-deleanu_1992.pdf</ref>}}\n\n===''Anapanasati sutta''===\nAnapanasati is described in detail in the ''Anapanasati Sutta'':\n{{Quote|Breathing in long, he discerns, 'I am breathing in long'; or breathing out long, he discerns, 'I am breathing out long.' Or breathing in short, he discerns, 'I am breathing in short'; or breathing out short, he discerns, 'I am breathing out short.' He trains himself, 'I will breathe in sensitive to the entire body.' He trains himself, 'I will breathe out sensitive to the entire body.' He trains himself, 'I will breathe in calming bodily fabrication.' He trains himself, 'I will breathe out calming bodily fabrication.'<ref name=\"Bhikku\">this is cited from [http://www.accesstoinsight.org/tipitaka/mn/mn.118.than.html Anapanasati sutta] translated by Thanissaro Bhikkhu(2006)</ref>}}\nIf it is pursued and well developed, it is said to bring great benefit according to the Anapanasati Sutta: \"This is how mindfulness of in-&-out breathing is developed & pursued so as to be of great fruit, of great benefit.<ref name=\"Bhikku\"/>\" As for the training, the ''Anapanasati sutta'' states:\n{{Quote|On whatever occasion the monk remains focused on the body in & of itself — ardent, alert, & mindful — putting aside greed & distress with reference to the world, on that occasion his mindfulness is steady & without lapse. When his mindfulness is steady & without lapse, then mindfulness as a factor for awakening becomes aroused. He develops it, and for him it goes to the culmination of its development.<ref name=\"Bhikku\"/>}}\n\n===Modern sources===\nFirst, for the practice to be successful, one should dedicate the practice, and set out the goal of the meditation session.<ref>John Dunne talks on Buddhist phenomenology from the Indo-Tibetan textual point of view at {{cite web|url=http://ccare.stanford.edu/node/21 |title=Archived copy |accessdate=2016-02-05 |deadurl=yes |archiveurl=https://web.archive.org/web/20121120171057/http://ccare.stanford.edu/node/21 |archivedate=2012-11-20 |df= }}</ref> One may decide to either practice anapanasati while [[Meditation#seated|seated]] or while [[kinhin|walking]], or to alternate seated and walking meditation.<ref name=\"The Three Pillars of Zen\">''The Three Pillars of Zen'' (New York: Anchor Books, 2000) {{ISBN|0-385-26093-8}}</ref> Then one may concentrate on the breath going through one's nose: the pressure in the nostrils on each inhalation, and the feeling of the breath moving along the upper lip on each exhalation.<ref name=\"The Three Pillars of Zen\"/> Other times practitioners are advised to attend to the breath at the [[tanden]], a point slightly below the [[navel]] and beneath the surface of the body.<ref name=\"The Three Pillars of Zen\"/> Practitioners may choose to count each inhalation, \"1, 2, 3,...\" and so on, up to 10, and then begin from 1 again. Alternatively people sometimes count the exhalation, \"1, 2, 3,...,\" on both the inhalation and exhalation.<ref name=\"The Three Pillars of Zen\"/> If the count is lost then one should start again from the beginning.\n\nThe type of practice recommended in ''[[The Three Pillars of Zen]]'' is for one to count \"1, 2, 3,...\" on the inhalation for a while, then to eventually switch to counting on the exhalation, then eventually, once one has more consistent success in keeping track of the count, to begin to pay attention to the breath without counting. There are practitioners who count the breath all their lives as well.<ref name=\"Zen training\">\"Zen Training: Methods and Philosophy\" by Katsuki Sekida</ref> Beginning students are often advised to keep a brief daily practice of around 10 or 15 minutes a day. Also, a teacher or guide of some sort is often considered to be essential in Buddhist practice, as well as the sangha, or community of Buddhists, for support.\n\nWhen one becomes distracted from the breath, which happens to both beginning and adept practitioners, either by a thought or something else, then one simply returns their attention back to the breath. Philippe Goldin has said that important \"learning\" occurs at the moment when practitioners turn their attention back to the object of focus, the breath.<ref>Philippe Goldin in Cognitive Neuroscience of Mindfulness Meditation https://www.youtube.com/watch?v=sf6Q0G1iHBI</ref>\n\n===Active breathing, passive breathing===\n{{see also|Pranayama}}\nAnapanasati is most commonly practiced with attention centered on the breath, without any effort to change the breathing.\n\nIn the [[Overtone singing|throat singing]] prevalent amongst the [[Buddhist]] monks of [[Tibet]] and [[Mongolia]]<ref>[http://home3.inet.tele.dk/hitower/voice.html The One Voice Chord<!-- Bot generated title -->]</ref> the long and slow outbreath during chanting is the core of the practice. The sound of the chant also serves to focus the mind in one-pointed concentration [[samadhi]], while the sense of self dissolves as awareness becomes absorbed into a realm of pure sound.\n\nIn some Japanese [[Zen]] meditation, the emphasis is upon maintaining ''\"strength in the abdominal area\"''<ref>[http://www.zbtc.org/kongo-tanden.html Tanden: Source of Spiritual Strength<!-- Bot generated title -->]</ref> ([[dantian]] or \"tanden\") and slow deep breathing during the long outbreath, again to assist the attainment of a mental state of one-pointed concentration. There is also a \"bamboo method,\" during which time one inhales and exhales in punctuated bits, as if running one's hand along the stalk of a bamboo tree.<ref name=\"Zen training\" />\n\nAlan Watts noted something more in watching the breath with regards to Zen Buddhism. Active or voluntary breathing (\"I will breath in\" etc) is clearly something the person is doing. Passive breathing (involuntary daily breathing) is something we imagine is being done, but not by us, it is something that just happens. In a watching-the-breath type of meditation we might experience both types. But suddenly it can dawn upon us that we are doing both: the involuntary breathing also seems to be something we are doing because we experience \"being everything\"- we are doing everything. And it can flip - both are just happening: the voluntary breathing also seems to be something that just happens, again because we are \"being everything\" - but now, everything is just happening. Thus we may see our very decisions to do things as just happening, just spontaneously arising - he asks \"Do you decide to decide?\". Be careful to note that Alan Watts points out that both things are true: we decide (and have free will) and (we don't) decisions just happen.  This is the Zen perspective where we embrace this paradox. We might say that, this (or any) paradox exists only as a human thought and in this case, we cannot understand (think) how these opposites can exist together; yet in reality, that is not burdened by thought, this is our experience. Thus watching the breath is one way to experience these things.\n\n[[Pranayama]], or Yogic breath control, is very popular in traditional and modern forms of Yoga.\n\n===Scientifically demonstrated benefits===\n{{see also|Research on meditation}}\nThe practice of focusing one's attention changes the brain in ways to improve that ability over time; the brain grows in response to meditation.<ref name=\"fa and open\">{{cite journal| pmc=2693206 | pmid=18329323 | doi=10.1016/j.tics.2008.01.005 | volume=12 | title=Attention regulation and monitoring in meditation | date=April 2008 | journal=Trends Cogn. Sci. (Regul. Ed.) | pages=163–9 | last1 = Lutz | first1 = A | last2 = Slagter | first2 = HA | last3 = Dunne | first3 = JD | last4 = Davidson | first4 = RJ}}</ref> Meditation can be thought of as mental training, similar to learning to ride a bike or play a piano.\n\nMeditators experienced in focused attention meditation (anapanasati is a type of focused attention meditation) showed a decrease in habitual responding a 20-minute [[Stroop effect|Stroop test]], which, as suggested by Richard Davidson and colleagues, may illustrate a lessening of emotionally reactive and automatic responding behavior.<ref name=\"fa and open\" />  It has been scientifically demonstrated that ānāpānasati slows down the natural aging process of the brain.<ref>[http://www.memory-key.com/research/news/long-term-meditation-fights-age-related-cognitive-decline \"Long-term meditation fights age-related cognitive decline\" at Mempowered!, August 2011]</ref>\n\n== Stages ==\nFormally, there are sixteen stages – or contemplations – of ''anapanasati''. These are divided into four tetrads (i.e., sets or groups of four). The first four steps involve focusing the mind on breathing, which is the 'body-conditioner' ([[Pāli|Pali]]: ''kāya-sankhāra''). The second tetrad involves focusing on the feelings (''vedanā''), which are the 'mind-conditioner' ([[Pāli|Pali]]: ''citta-sankhāra''). The third tetrad involves focusing on the mind itself ([[Pāli|Pali]]: ''citta''), and the fourth on 'mental qualities' ([[Pāli|Pali]]: ''[[dharma|dhamma]]'').  (Compare [[Noble Eightfold Path#Concentration|right mindfulness]] and [[satipatthana]].)\n\nAny anapanasati meditation session should progress through the stages in order, beginning at the first, whether the practitioner has performed all stages in a previous session or not.{{Citation needed|date=November 2007}}\n\n{| class=\"wikitable\"\n|-\n! Satipaṭṭhāna || Ānāpānasati || Tetrads\n|-\n| 1. Contemplation of the body||1. Breathing long (Knowing Breath)|| rowspan=4 |First Tetrad\n|-\n| &nbsp;||2. Breathing short (Knowing Breath) \n|-\n| &nbsp;||3. Experiencing the whole body\n|-\n| &nbsp;||4. Tranquillising the bodily activities\n|-\n| 2. Contemplation of feelings||5. Experiencing rapture|| rowspan=4 |Second Tetrad\n|-\n| &nbsp;||6. Experiencing bliss\n|-\n| &nbsp;||7. Experiencing mental activities\n|-\n| &nbsp;||8. Tranquillising mental activities\n|-\n| 3. Contemplation of the mind||9. Experiencing the mind|| rowspan=4 |Third Tetrad\n|-\n| &nbsp;||10. Gladdening the mind\n|-\n| &nbsp;||11. Centering the mind in samadhi\n|-\n| &nbsp;||12. Releasing the mind\n|-\n| 4. Contemplation of Dhammas||13. Contemplating impermanence|| rowspan=4 |Fourth Tetrad\n|-\n| &nbsp;||14. Contemplating fading of lust\n|-\n| &nbsp;||15. Contemplating cessation\n|-\n| &nbsp;||16. Contemplating relinquishment\n|}\n\n==In the Theravada tradition==\nAccording to several teachers in Theravada Buddhism, anapanasati alone will lead to the removal of all one's defilements (''[[kilesa]]'') and eventually to [[Enlightenment in Buddhism|enlightenment]]. According to Roger Bischof, the Ven. [[Webu Sayadaw]] said of anapanasati: \"This is a shortcut to [[Nibbana]], anyone can use it. It stands up to investigation and is in accordance with the teachings of the Buddha as conserved in the scriptures. It is the straight path to [[Nibbana]].\"\n\nAnapanasati can also be practised with other traditional meditation subjects including the [[satipatthana|four frames of reference]]<ref>In regards to practicing anapanasati in tandem with other frames of reference (''[[satipatthana]]''), Thanissaro (2000) writes:\n:At first glance, the four frames of reference for satipatthana practice sound like four different meditation exercises, but MN 118 [the ''Anapanasati Sutta''] makes clear that they can all center on a single practice: keeping the breath in mind. When the mind is with the breath, all four frames of reference are right there. The difference lies simply in the subtlety of one's focus.... [A]s a meditator get more skilled in staying with the breath, the practice of satipatthana gives greater sensitivity in peeling away ever more subtle layers of participation in the present moment until nothing is left standing in the way of total release.\n</ref> and [[mettā bhāvanā]],<ref>According to Kamalashila (2004), one practices anapanasati with mettā bhāvanā in order to prevent withdrawal from the world and the loss of compassion.</ref> as is done in modern Theravadan Buddhism.\n\n==In the Chinese tradition==\n[[File:Buddhacinga Fotudeng.png|thumb|right|upright|Buddhacinga, a monk who came to China and widely propagated ānāpānasmṛti methods.]]\n\nIn the second century, the Buddhist monk [[An Shigao]] came from Northwest India to China and became one of the first translators of Buddhist scriptures into Chinese. He translated a version of the ''Ānāpānasmṛti Sūtra'' between 148 and 170 CE. This version is a significantly longer text than what appears in the [[Ekottara Agama|Ekottara Āgama]], and is entitled, \"The Great Ānāpānasmṛti Sūtra\" (Ch. 大安般守意經) ([[Taishō Tripiṭaka]] 602).\n\nAt a later date, Buddhacinga, more commonly known as [[Fotudeng]] (佛圖澄) (231-349 CE), came from Central Asia to China in 310 and propagated Buddhism widely. He is said to have demonstrated many spiritual powers, and was able to convert the warlords in this region of China over to Buddhism.<ref>Nan, Huai-Chin. ''Basic Buddhism: Exploring Buddhism and Zen.'' 1997. pp. 80-81</ref> He is well known for teaching methods of meditation, and especially ānāpānasmṛti. Fotudeng widely taught ānāpānasmṛti through methods of counting breaths, so as to temper to the breathing, simultaneously focusing the mind into a state of peaceful meditative concentration.<ref name=\"Nan, Huai-Chin 1997. p. 81\">Nan, Huai-Chin. ''Basic Buddhism: Exploring Buddhism and Zen.'' 1997. p. 81</ref> By teaching meditation methods as well as doctrine, Fotudeng popularized Buddhism quickly. According to [[Nan Huaijin]], \"Besides all its theoretical accounts of emptiness and existence, Buddhism also offered methods for genuine realization of spiritual powers and meditative concentration that could be relied upon. This is the reason that Buddhism began to develop so vigorously in China with Fotudeng.\"<ref name=\"Nan, Huai-Chin 1997. p. 81\"/>\n\nAs more monks such as [[Kumārajīva]], Dharmanandi, Gautama Saṃghadeva, and [[Buddhabhadra (translator)|Buddhabhadra]] came to the East, translations of meditation texts did as well, which often taught various methods of ānāpānasmṛti that were being used in India. These became integrated in various Buddhist traditions, as well as into non-Buddhist traditions such as [[Taoism|Daoism]].\n\nIn the sixth century, the [[Tiantai]] school was formed, teaching the One Vehicle (Skt. ''[[Ekayāna]]''), the vehicle of attaining [[Buddhahood]], as the main principle, and three forms of [[samatha|śamatha]]-[[vipassanā|vipaśyanā]] correlated with the meditative perspectives of emptiness, provisional existence, and the mean, as the method of cultivating realization.<ref>Nan, Huai-Chin. ''Basic Buddhism: Exploring Buddhism and Zen.'' 1997. p. 91</ref> The Tiantai school places emphasis on ānāpānasmṛti in accordance with the principles of śamatha and vipaśyanā. In China, the Tiantai understanding of meditation has had the reputation of being the most systematic and comprehensive of all.<ref name=\"Luk, Charles 1964. p. 110\">Luk, Charles. ''The Secrets of Chinese Meditation.'' 1964. p. 110</ref> The founder of the Tiantai school, [[Zhiyi]], wrote many commentaries and treatises on meditation. Of these texts, Zhiyi's ''Concise Śamatha-vipaśyanā'' (小止観 ''Xiǎo Zhǐguān''), his ''[[Mohe Zhiguan|Mahāśamatha Vipaśyanā]]'' (摩訶止観 ''Móhē Zhǐguān''), and his ''Six Subtle Dharma Gates'' (六妙法門 ''Liù Miào Fǎmén'') are the most widely read in China.<ref name=\"Luk, Charles 1964. p. 110\"/> Zhiyi classifies breathing into four main categories: panting (喘 \"chuǎn\"), unhurried breathing (風 \"fēng\"), deep and quiet breathing (氣 \"qì\"), and stillness or rest (息 \"xi\"). Zhiyi holds that the first three kinds of breathing are incorrect, while the fourth is correct, and that the breathing should reach stillness and rest.<ref>Luk, Charles. ''The Secrets of Chinese Meditation.'' 1964. p. 125</ref> Venerable [[Hsuan Hua]], who taught [[Chan Buddhism|Chan]] and [[Pure Land Buddhism]], also taught that the external breathing reaches a state of stillness in correct meditation:\n{{quote|A practitioner with sufficient skill does not breathe externally. That external breathing has stopped, but the internal breathing functions. With internal breathing there is no exhalation through the nose or mouth, but all pores on the body are breathing. A person who is breathing internally appears to be dead, but actually he has not died. He does not breathe externally, but the internal breathing has come alive.<ref>Hsuan Hua. ''The Chan Handbook.'' 2004. p. 44</ref>}}\n\n==In the Indo-Tibetan tradition==\nIn the Tibetan Buddhist lineage, ānāpānasmṛti is done to calm the mind in order to prepare one for various other practices.\n\nTwo of the most important Mahāyāna philosophers, Asaṅga and Vasubandhu, in the ''Śrāvakabhūmi'' chapter of the ''[[Yogācārabhūmi-śāstra]]'' and the [[Abhidharma-kośa]], respectively, make it clear that they consider ānāpānasmṛti a profound practice leading to vipaśyanā (in accordance with the teachings of the Buddha in the Sutra pitika).<ref>''Study and Practice of Meditation: Tibetan Interpretations of the Concentrations and Formless Absorptions'' by Leah Zahler. Snow Lion Publications: 2009 pg 107-108)</ref> However, as scholar Leah Zahler has demonstrated, \"the practice traditions related to Vasubandhu's or Asaṅga's presentations of breath meditation were probably not transmitted to Tibet.\"<ref>''Study and Practice of Meditation: Tibetan Interpretations of the Concentrations and Formless Absorptions'' by Leah Zahler. Snow Lion Publications: 2009 pg 108)</ref> Asaṅga correlates the sixteen stages of ānāpānasmṛti with the four smṛtyupasthānas in the same way that the Ānāpānasmṛti Sutra does, but because he does not make this explicit the point was lost on later Tibetan commentators.<ref>Zahler 119-126</ref>\n\nAs a result, the largest Tibetan lineage, the [[Gelug]], came to view ānāpānasmṛti as a mere preparatory practice useful for settling the mind but nothing more.<ref>Zahler 108</ref> Zahler writes:\n{{quote|The practice tradition suggested by the Treasury itself--and also by Asaṅga's Grounds of Hearers--is one in which mindfulness of breathing becomes a basis for inductive reasoning on such topics as the five aggregates; as a result of such inductive reasoning, the meditator progresses through the Hearer paths of preparation, seeing, and meditation. It seems at least possible that both Vasubandhu and Asaṅga presented their respective versions of such a method, analogous to but different from modern Theravāda insight meditation, and that Gelukpa scholars were unable to reconstruct it in the absence of a practice tradition because of the great difference between this type of inductive meditative reasoning based on observation and the types of meditative reasoning using consequences (''thal 'gyur, prasaanga'') or syllogisms (''sbyor ba, prayoga'') with which Gelukpas were familiar. Thus, although Gelukpa scholars give detailed interpretations of the systems of breath meditation set forth in Vasubandu's and Asaṅga's texts, they may not fully account for the higher stages of breath meditation set forth in those texts. . . it appears that neither the Gelukpa textbook writers nor modern scholars such as Lati Rinpoche and Gendun Lodro were in a position to conclude that the first moment of the fifth stage of Vasubandhu's system of breath meditation coincides with the attainment of special insight and that, therefore, the first four stages must be a method for cultivating special insight.<ref>Zahler 108, 113</ref>}}\n\nZahler continues,\n{{quote|[I]t appears . .that a meditative tradition consisting of analysis based on observation—inductive reasoning within meditation—was not transmitted to Tibet; what Gelukpa writers call analytical meditation is syllogistic reasoning within meditation. Thus, Jamyang Shaypa fails to recognize the possibility of an 'analytical meditation' based on observation, even when he cites passages on breath meditation from Vasubandhu's ''Treasury of Manifest Knowledge'' and, especially, Asaṅga's ''Grounds of Hearers'' that appear to describe it.<ref>Zahler 306</ref>}}\n\n[[Stephen Batchelor (author)|Stephen Batchelor]], who for years was monk in the Gelukpa lineage, experienced this firsthand. He writes, \"such systematic practice of mindfulness was not preserved in the Tibetan traditions. The Gelugpa lamas know about such methods and can point to long descriptions of mindfulness in their Abhidharma works, but the living application of the practice has largely been lost. (Only in ''dzog-chen'', with the idea of 'awareness' [''rig pa''] do we find something similar.) For many Tibetans the very term 'mindfulness' (''sati'' in Pali, rendered in Tibetan by ''dran pa'') has come to be understood almost exclusively as 'memory' or 'recollection.'\"<ref>''The Faith to Doubt: Glimpses of Buddhist Uncertainty''. by Stephen Batchelor. Parallax Press\nBerkeley: 1990 pg 8</ref>\n\nAs Batchelor noted, however, in other traditions, particularly the [[Kagyu]] and [[Nyingma]], mindfulness based on ānāpānasmṛti practice is considered to be quite profound means of calming the mind to prepare it for the higher practices of [[Dzogchen]] and [[Mahamudra]]. For the Kagyupa, in the context of mahāmudrā, ānāpānasmṛti is thought to be the ideal way for the meditator to transition into taking the mind itself as the object of meditation and generating vipaśyanā on that basis.<ref>Pointing Out the Great Way: The Stages of Meditation in the [[Mahamudra]] tradition by Dan Brown. Wisdom Publications: 2006 pg 221-34</ref> The prominent contemporary Kagyu/Nyingma master [[Chogyam Trungpa]], echoing the Kagyu Mahāmudrā view, wrote, \"your breathing is the closest you can come to a picture of your mind. It is the portrait of your mind in some sense. . .The traditional recommendation in the lineage of meditators that developed in the Kagyu-Nyingma tradition is based on the idea of mixing mind and breath.\"<ref>''The Path is the Goal'', in ''The Collected Works of Chogyam Trungpa, Vol Two''. Shambhala Publications. pgs 49, 51</ref> The Gelukpa allow that it is possible to take the mind itself as the object of meditation, however, Zahler reports, the Gelukpa discourage it with \"what seems to be thinly disguised sectarian polemics against the Nyingma Great Completeness [Dzogchen] and Kagyu Great Seal [mahāmudrā] meditations.\"<ref>(Zahler 131-2)</ref>\n\nIn the ''Pañcakrama'' tantric tradition ascribed to (the Vajrayana) [[Nagarjuna]], ānāpānasmṛti counting breaths is said to be sufficient to provoke an experience of vipaśyanā (although it occurs in the context of \"formal tantric practice of the completion stage in highest yogatantra\").{{sfn|Brown|2006|p=221}}{{sfb|Mathes|2013|p=378}}\n\n==References==\n{{Reflist|30em}}\n\n===Bibliography===\n* {{cite book|author1=Anālayo|authorlink1=Bhikkhu Analayo|title=Satipaṭṭhāna : the direct path to realization|date=2003|publisher=Windhorse|location=Birmingham|isbn=1-899579-54-0|ref=harv}}\n* {{cite book|ref=harv|last=Brown|first=Daniel P.|title=Pointing Out the Great Way: The Stages of Meditation in the Mahamudra Tradition|url=https://books.google.com/books?id=rFvbxdspTHoC&pg=PA8|year=2006|publisher=Simon and Schuster|isbn=978-0-86171-304-2}}\n* {{cite book|ref=harv|last=Mathes|first=Klaus-Dieter|title=A Direct Path to the Buddha Within: Go Lotsawa's Mahamudra Interpretation of the Ratnagotravibhaga|url=https://books.google.com/books?id=t3qgaH7TNlEC&pg=PA378|date=8 February 2013|publisher=Wisdom Publications|isbn=978-0-86171-915-0}}\n* Kamalashila (1996; 2004 [2nd ed.]). Meditation: The Buddhist Way of Tranquillity and Insight. Birmingham: Windhorse Publications. {{ISBN|1-899579-05-2}}.\n\n=== Primary sources ===\n* [[Thanissaro Bhikkhu]] (trans.) (1995a). ''Ananda Sutta: To Ananda (On Mindfulness of Breathing)'' ([[Samyutta Nikaya|SN]] 54.13). Retrieved on 2007-05-20 from \"Access to Insight\" at: http://www.accesstoinsight.org/tipitaka/sn/sn54/sn54.013.than.html.\n* Thanissaro Bhikkhu (trans.) (1995b). ''Satipatthana Sutta: Frames of Reference'' ([[Majjhima Nikaya|MN]] 10). Retrieved on 2007-05-20 from \"Access to Insight\" at: http://www.accesstoinsight.org/tipitaka/mn/mn.010.than.html.\n* Thanissaro Bhikkhu (trans.) (1997). ''Kayagata-sati Sutta: Mindfulness Immersed in the Body'' ([[Majjhima Nikaya|MN]] 119). Retrieved on 2007-05-20 from \"Access to Insight\" at: http://www.accesstoinsight.org/tipitaka/mn/mn.119.than.html.\n* Thanissaro Bhikkhu (trans.) (2000). ''Maha-satipatthana Sutta: The Great Frames of Reference'' ([[Digha Nikaya|DN]] 22). Retrieved on 2007-05-20 from \"Access to Insight: Readings in Theravada Buddhism,\" at http://www.accesstoinsight.org/tipitaka/dn/dn.22.0.than.html.\n* Thanissaro Bhikkhu (trans.) (2006a). ''Arittha Sutta: To Arittha (On Mindfulness of Breathing)'' ([[Samyutta Nikaya|SN]] 54.6). Retrieved on 2007-05-20 from \"Access to Insight\" at: http://www.accesstoinsight.org/tipitaka/sn/sn54/sn54.006.than.html.\n* Thanissaro Bhikkhu (trans.) (2006b). ''Dipa Sutta: The Lamp'' ([[Samyutta Nikaya|SN]] 54.8). Retrieved on 2007-05-20 from \"Access to Insight\" at: http://www.accesstoinsight.org/tipitaka/sn/sn54/sn54.008.than.html.\n\n== Further reading ==\n* ''Mindfulness with Breathing'' by Buddhadāsa Bhikkhu. Wisdom Publications, Boston, 1996. {{ISBN|0-86171-111-4}}.\n* ''Breath by Breath'' by Larry Rosenberg. Shambhala Classics, Boston, 1998. {{ISBN|1-59030-136-6}}.\n* ''Tranquillity and Insight'' by Amadeo Sole-Leris. Shambhala, 1986. {{ISBN|0-87773-385-6}}.\n* \"The Anapanasati Sutta / A Practical Guide to Mindfulness of Breathing and Tranquil Wisdom Meditation\" by Bhante Vimalaramsi. Yin Shun Foundation, January 1999; First edition (1999). ASIN: B00183T9XW\n\n== External links ==\n{{wikisource|Ekottara Āgama 17.1: Ānāpānasmṛti Sūtra}}\n\n* [http://lapislazulitexts.com/anapanasmrti_sutra.html Ekottara Āgama 17.1: The Ānāpānasmṛti Sūtra]\n* [http://www.accesstoinsight.org/lib/bps/leaves/bl115.html Analysis of the Ānāpānasati Sutta]\n* [https://web.archive.org/web/20140327084119/http://www.buddhanet.net/pdf_file/anapanasati.pdf Ānāpānasati], a free e-book by [[Buddhadasa]]\n* [http://www.dhammatalks.net/Books3/Bhikkhu_Buddhadasa_Anapanasati_Mindfulness_with_Breathing.htm Ānāpānasati – Mindfulness with Breathing: Unveiling the Secrets of Life] by Buddhadasa\n* [http://www.sinc.sunysb.edu/Clubs/buddhism/vimalaramsi/main.html Ānāpānasati instructions] from Bhante Vimalaramsi\n* [https://web.archive.org/web/20120327185337/http://www.dhammatalks.net/Books10/Pa_Auk_Sayadaw-Mindfulness_of_Breathing.pdf Ānāpānasati: A concise instruction] by Pa Auk Sayadaw\n* [http://www.accesstoinsight.org/lib/authors/thanissaro/breathmed.html Basic Breath Meditation Instructions] by [[Thanissaro Bhikkhu]]\n\n{{Buddhism topics}}\n{{Meditation}}\n\n[[Category:Pali words and phrases]]\n[[Category:Buddhist meditation]]\n[[Category:Theravada Buddhist terminology]]\n[[Category:Mindfulness (Buddhism)]]",
            "slug": "anapanasati",
            "date_updated": 1531838689400,
            "imported": "https://en.wikipedia.org/wiki/anapanasati"
        }
    ]
}