{
    "article": [
        {
            "title": "Buddhahood",
            "text": "{{for|the historical founder of Buddhism|Gautama Buddha}}\n{{redirects here|Buddhas|other uses|Buddha (disambiguation)}}\n[[File:Korea-Gyeongju-Silla Art and Science Museum-Seokguram model-01.jpg|thumb|280px|Seated Buddha, from the [[Seokguram]], [[Silla]].]]\n{{Contains Indic text}}\n\nIn [[Buddhism]], '''buddhahood''' ({{lang-sa|buddhatva}}; {{lang-pi|buddhatta}} or {{lang|pi|buddhabhāva|italic=no}}) is the condition or rank of a [[Buddha (title)|buddha]] \"awakened one\".<ref>buddhatva, बुद्धत्व. [http://spokensanskrit.de/index.php?script=HK&beginning=0+&tinput=buddhatva&trans=%E7%BF%BB%E8%A8%B3&direction=AU Spoken Sanskrit Dictionary]. (accessed: January 10, 2016)</ref>\n\nThe goal of [[Mahayana]]'s [[bodhisattva]] path is Samyaksambuddhahood, so that one may benefit all sentient beings by teaching them the path of cessation of ''[[dukkha]]''.<ref name=gethin1998p224>{{cite book|last1=Gethin|first1=Rupert|title=The foundations of Buddhism|date=1998|publisher=Oxford University Press|location=Oxford [England]|isbn=0-19-289223-1|pages=224–234|edition=1. publ. paperback}}</ref> Mahayana theory contrasts this with the goal of the [[Theravada]] path, where the goal is individual [[arhat]]ship.<ref name=gethin1998p224/>\n\n==Explanation of the term ''Buddha''==\n{{Buddhism}}\nIn [[Theravada]] [[Buddhism]], ''Buddha'' refers to one who has become [[Enlightenment in Buddhism|awakened]] through their own efforts and insight, without a teacher to point out the [[dharma]] (Sanskrit; Pali ''dhamma''; \"right way of living\"). A samyaksambuddha teaches the dharma to others after his awakening. A [[pratyekabuddha]] also reaches Nirvana through his own efforts, but does not teach the dharma to others. An [[arhat]] needs to follow the teaching of a Buddha to attain Nirvana, but can also preach the dharma after attaining Nirvana.<ref name=\"Snelling, John 1987 Page 81\">Snelling, John (1987), ''The Buddhist handbook. A Complete Guide to Buddhist Teaching and Practice''. London: Century Paperbacks. Page 81</ref> In one instance the term buddha is also used in Theravada to refer to all who attain [[Nirvana (Buddhism)|Nirvana]], using the term [[Sāvakabuddha]] to designate an arhat, someone who depends on the teachings of a Buddha to attain Nirvana.<ref name=\"autogenerated1\">''Udana Commentary''. Translation Peter Masefield, volume I, 1994. Pali Text Society. page 94.</ref> In this broader sense it is equivalent to the arhat.\n\nBuddhahood is the state of an enlightened being, who having found the path of cessation of suffering,<ref>{{cite book|last1=Gethin|first1=Rupert|title=The foundations of Buddhism|date=1998|publisher=Oxford University Press|location=Oxford [England]|isbn=0-19-289223-1|page=32|edition=1. publ. paperback}}</ref> is in the state of \"No-more-Learning\".<ref>{{cite book|author1=Damien Keown |author2=Charles S. Prebish |title=Encyclopedia of Buddhism |url=https://books.google.com/books?id=NFpcAgAAQBAJ |year=2013|publisher=Routledge |isbn=978-1-136-98588-1|page=90}}</ref><ref>{{cite book|author=Rinpoche Karma-raṅ-byuṅ-kun-khyab-phrin-las|title=The Dharma: That Illuminates All Beings Impartially Like the Light of the Sun and Moon|url=https://books.google.com/books?id=N4wVW91BLAYC |year=1986|publisher=State University of New York Press|isbn=978-0-88706-156-1|pages=32–33}}; Quote: \"There are various ways of examining the Complete Path. For example, we can speak of Five Paths constituting its different levels: the Path of Accumulation, the Path of Application, the Path of Seeing, the Path of Meditation and the Path of No More Learning, or Buddhahood.\"</ref><ref>{{cite book|author1=Robert E. Buswell|author2=Robert M. Gimello|title=Paths to liberation: the Mārga and its transformations in Buddhist thought|url=https://books.google.com/books?id=hu0oIf0n87IC |year=1990|publisher=University of Hawaii Press|isbn=978-0-8248-1253-9|page=204}}</ref>\n\nThere is a broad spectrum of opinion on the universality and method of attainment of Buddhahood, depending on [[Gautama Buddha]]'s teachings that a school of Buddhism emphasizes. The level to which this manifestation requires [[ascetic]] practices varies from none at all to an absolute requirement, dependent on doctrine. Mahayana Buddhism emphasizes the [[bodhisattva]] ideal instead of the Arhat.\n\nThe Tathagatagarba and [[Buddha-nature]] doctrines of Mahayana Buddhism consider Buddhahood to be a universal and innate property of absolute wisdom. This wisdom is revealed in a person's current lifetime through Buddhist practice, without any specific relinquishment of pleasures or \"earthly desires\".\n\nBuddhists do not consider Gautama to have been the only Buddha. The [[Pāli Canon]] refers to many previous ones (see [[list of the named Buddhas]]), while the Mahayana tradition additionally has many Buddhas of celestial origin (see [[Amitābha]] or [[Vairocana]] as examples, for lists of many thousands of Buddha names (see ''[[Taishō Tripiṭaka]]'' numbers 439–448).\n\n==Nature of the Buddha==\n{{further|Buddhology}}\nThe various Buddhist schools hold some varying interpretations on the nature of Buddha (see below).\n\n===Spiritual realizations===\n[[File:Gandhara Buddha (tnm).jpeg|thumb|The Buddha, in [[Greco-Buddhism|Greco-Buddhist style]], first-second century, [[Gandhara]] (now Pakistan). ([[Standing Buddha]]).]]\nAll Buddhist traditions hold that a Buddha is fully awakened and has completely purified his mind of the [[three poisons]] of [[taṇhā|craving]], [[Dvesha_(Buddhism)|aversion]] and [[avidyā (Buddhism)|ignorance]]. A Buddha is no longer bound by [[saṃsāra]], and has ended the [[suffering]] which unawakened people experience in life.\n\nMost schools of Buddhism have also held that the Buddha was [[omniscience|omniscient]]. However, the early texts contain explicit repudiations of making this claim of the Buddha.<ref>[[A. K. Warder]], ''Indian Buddhism.'' Third edition published by Motilal Banarsidass Publ., 2000, pages 132–133.</ref><ref>{{cite book|last=Kalupahana|first=David|authorlink=David Kalupahana|title=A History of Buddhist Philosophy: Continuities and Discontinuities|url=https://books.google.com/books?id=SlDArya3YvcC&pg=PA43|year=1992|publisher=University of Hawaii Press|isbn=978-0-8248-1402-1|page=43}}</ref>\n\n===Ten characteristics of a Buddha===\nSome Buddhists meditate on (or contemplate) the Buddha as having ten characteristics (Ch./Jp. 十號). These characteristics are frequently mentioned in the Pāli Canon as well as Mahayana teachings, and are chanted daily in many Buddhist monasteries:\n#Thus gone, thus come (Skt: ''{{IAST|[[tathāgata]]}}'')\n#Worthy one (Skt: ''[[arhat]]'')\n#Perfectly self-enlightened (Skt: ''{{IAST|samyak-saṃbuddha}}'')\n#Perfected in knowledge and conduct (Skt: ''{{IAST|vidyā-caraṇa-saṃpanna}}'' )\n#Well gone (Skt: ''sugata'')\n#Knower of the world (Skt: ''lokavida'')\n#Unsurpassed (Skt: ''anuttara'')\n#Leader of persons to be tamed (Skt: ''{{IAST|puruṣa-damya-sārathi}}'')\n#Teacher of the gods and humans (Skt: ''{{IAST|śāsta deva-manuṣyāṇaṃ}}'')\n#The Blessed One or fortunate one (Skt: ''bhagavat'')<ref>Japanese-English Buddhist Dictionary (Daitō shuppansha) 147a/163</ref>\n\nThe tenth epithet is sometimes listed as \"The World Honored Enlightened One\" (Skt. ''Buddha-Lokanatha'') or \"The Blessed Enlightened One\" (Skt. ''Buddha-Bhagavan'').<ref>[http://www.tientai.net/teachings/dharma/buddha/10titles.htm], also see [[Thomas Cleary]] and [[J. C. Cleary]] ''The Blue Cliff Record'', page 553.</ref>\n\n===Buddha as a supreme human===\nIn the Pāli Canon, Gautama Buddha is known as being a \"teacher of the gods and humans\", superior to both the gods and humans in the sense of having [[nirvana (Buddhism)|nirvana]] or the greatest bliss, whereas the [[deva (Buddhism)|devas]], or gods, are still subject to anger, fear and sorrow.{{fact|date=September 2017}}\n\nIn the Madhupindika Sutta (MN 18),<ref>[http://www.accesstoinsight.org/tipitaka/mn/mn.018.than.html Majhima Nikaya 18 Madhupindika Sutta: The Ball of Honey]</ref> Buddha is described in powerful terms as the Lord of the Dhamma (Pali: Dhammasami, skt.: Dharma Swami) and the bestower of immortality (Pali: Amatassadata).\n\nSimilarly, in the ''Anuradha Sutta'' (SN 44.2)<ref>[http://www.accesstoinsight.org/tipitaka/sn/sn44/sn44.002.than.html Sutta Nikaya 44.2 Anuradha Sutta: To Anuradha]</ref> Buddha is described as \n{{quote|the Tathagata—the supreme man, the superlative man, attainer of the superlative attainment.<br/>[Buddha is asked about what happens to the Tathagatha after death of the physical body. Buddha replies],<br/>\"And so, Anuradha—when you can't pin down the Tathagata as a truth or reality even in the present life—is it proper for you to declare, 'Friends, the Tathagata—the supreme man, the superlative man, attainer of the superlative attainment—being described, is described otherwise than with these four positions: The Tathagata exists after death, does not exist after death, both does & does not exist after death, neither exists nor does not exist after death'?}}\n\nIn the Vakkali Sutta (SN 22.87) Buddha identifies himself with the Dhamma:<ref>[http://www.accesstoinsight.org/tipitaka/sn/sn22/sn22.087x.wlsh.html Sutta Nikaya 22.87 Vakkali Sutta: Vakkali]</ref>\n{{quote|O Vakkali, whoever sees the Dhamma, sees me [the Buddha]}}\n\nAnother reference from the [[Aggañña Sutta]] of the [[Digha Nikaya]], says to his disciple Vasettha:\n{{quote|O Vasettha! The Word of Dhammakaya is indeed the name of the Tathagata}}\n\n[[Shravasti Dhammika]], a Theravada monk, writes:\n\n{{quote|In the centuries after his final Nibbāna it sometimes got to the stage that the legends and myths obscured the very real human being behind them and the Buddha came to be looked upon as a god. Actually, the Buddha was a human being, not a 'mere human being' as is sometimes said but a special class of human called a 'complete person' (mahāparisa). Such complete persons are born no different from others and indeed they physically remain quite ordinary.<ref>{{cite book|last=Dhammika|first=Shravasti|authorlink=Shravasti Dhammika|title=The Buddha and His Disciples|publisher=Buddhist Publication Society|year=2005|page=16|ISBN=9789552402807}}</ref>}}\n\n[[Sangharakshita]] also states that \"The first thing we have to understand - and this is very important - is that the Buddha is a human being. But a special kind of human being, in fact the highest kind, so far as we know.\"<ref>{{cite book|author=Sangharakshita|authorlink=Sangharakshita|title=A Guide to the Buddhist Path|publisher=Windhorse Publications|year=1996|page=45|ISBN=9781899579044}}</ref>\n\n===Buddha as \"just a human\"===\n\nWhen asked whether he was a [[Deva (Buddhism)|deva]] or a human, he replied that he had eliminated the deep-rooted unconscious traits that would make him either one, and should instead be called a Buddha; one who had grown up in the world but had now gone beyond it, as a lotus grows from the water but blossoms above it, unsoiled.<ref>Peter Harvey, ''An Introduction to Buddhism: Teachings, History, and Practices.'' Cambridge University Press, 1990, page 28</ref>\n\nAndrew Skilton writes that the Buddha was never historically regarded by Buddhist traditions as being merely human:<ref>Skilton, Andrew. ''A Concise History of Buddhism.'' 2004. pp. 64-65</ref>\n\n{{quote|It is important to stress that, despite modern Theravada teachings to the contrary (often a sop to skeptical Western pupils), he was never seen as being merely human. For instance, he is often described as having the thirty-two major and eighty minor marks or signs of a ''mahāpuruṣa'', \"superman\"; the Buddha himself denied that he was either a man or a [[Deva (Buddhism)|god]]; and in the ''[[Mahaparinibbana Sutta|Mahāparinibbāna Sutta]]'' he states that he could live for an [[Kalpa (aeon)|aeon]] were he asked to do so.}}\n\nHowever, [[Thích Nhất Hạnh]], a [[Vietnamese people|Vietnamese]] [[bhikkhu|Buddhist monk]] in the [[Zen]] tradition, states that \"Buddha was not a god. He was a human being like you and me, and he suffered just as we do.\"<ref>{{cite book|last=Nhất Hạnh|first=Thích|authorlink=Thích Nhất Hạnh|title=The Heart of the Buddha's Teaching|publisher=[[Broadway Books]]|year=1999|page=3|ISBN=0-7679-0369-2}}</ref>\n\nJack Maguire writes that Buddha is inspirational based on his humanness.\n\n{{quote|A fundamental part of Buddhism's appeal to billions of people over the past two and a half millennia is the fact that the central figure, commonly referred to by the title \"Buddha\", was not a god, or a special kind of spiritual being, or even a prophet or an emissary of one. On the contrary, he was a human being like the rest of us who quite simply woke up to full aliveness.<ref>{{cite book|last=Maguire|first=Jack|title=Essential Buddhism|publisher=[[Simon & Schuster]]|year=2013|page=2|ISBN=9781476761961}}</ref>}}\n\nThe founder of [[Nichiren]] [[Buddhism]] states that the real meaning of the Lord Shakyamuni Buddha’s appearance in this world lay in his behavior as a human being.\n<ref name=Yampolsky1990>{{Cite book|url=https://www.worldcat.org/oclc/21035153|title=Selected writings of Nichiren |date=1990|chapter=Introduction|publisher=Columbia University Press|others=Yampolsky, Philip B. (Philip Boas), 1920–1996. Rogers D. Spotswood Collection.|isbn=0231072600|location=New York|oclc=21035153}}</ref>{{rp|336¬-37}}\n\n===Mahāsāṃghika supramundane Buddha===\nIn the early Buddhist schools, the [[Mahāsāṃghika]] branch regarded the buddhas as being characterized primarily by their supramundane nature. The Mahāsāṃghikas advocated the transcendental and supramundane nature of the buddhas and bodhisattvas, and the fallibility of arhats.<ref name=\"autogenerated1b\">Baruah, Bibhuti. ''Buddhist Sects and Sectarianism.'' 2008. p. 48.</ref> Of the 48 special theses attributed by the ''Samayabhedoparacanacakra'' to the Mahāsāṃghika [[Ekavyāvahārika]], [[Lokottaravāda]], and the [[Kukkuṭika]], 20 points concern the supramundane nature of buddhas and bodhisattvas.<ref>Sree Padma. Barber, Anthony W. ''Buddhism in the Krishna River Valley of Andhra.'' 2008. p. 56.</ref> According to the ''Samayabhedoparacanacakra'', these four groups held that the Buddha is able to know all dharmas in a single moment of the mind.<ref name=\"Yao, Zhihua 2005. p. 11\">Yao, Zhihua. ''The Buddhist Theory of Self-Cognition.'' 2005. p. 11</ref> Yao Zhihua writes:<ref name=\"Yao, Zhihua 2005. p. 11\"/>\n\n{{quote|In their view, the Buddha is equipped with the following supernatural qualities: transcendence (''lokottara''), lack of defilements, all of his utterances [[Dharmachakra|preaching his teaching]], expounding all his teachings in a single utterance, all of his sayings being true, his physical body being limitless, his power (''prabhāva'') being limitless, the length of his life being limitless, never tiring of enlightening sentient beings and awakening pure faith in them, having no sleep or dreams, no pause in answering a question, and always in meditation (''[[Samadhi|samādhi]]'').}}\n\nA doctrine ascribed to the Mahāsāṃghikas is, \"The power of the tathāgatas is unlimited, and the life of the buddhas is unlimited.\"<ref>Tanaka, Kenneth. ''The Dawn of Chinese Pure Land Buddhist Doctrine.'' 1990. p. 8</ref> According to Guang Xing, two main aspects of the Buddha can be seen in Mahāsāṃghika teachings: the true Buddha who is omniscient and omnipotent, and the manifested forms through which he liberates sentient beings through skillful means.<ref>Guang Xing. ''The Concept of the Buddha: Its Evolution from Early Buddhism to the Trikaya Theory.'' 2004. p. 53</ref> For the Mahāsaṃghikas, the historical Gautama Buddha was one of these transformation bodies (Skt. ''[[trikaya|nirmāṇakāya]]''), while the essential real Buddha is equated with the [[Dharmakāya]].<ref>Sree Padma. Barber, Anthony W. ''Buddhism in the Krishna River Valley of Andhra.'' 2008. pp. 59-60</ref>\n\nAs in Mahāyāna traditions, the Mahāsāṃghikas held the doctrine of the existence of many contemporaneous buddhas throughout the ten directions.<ref name=\"autogenerated65\">Guang Xing. ''The Concept of the Buddha: Its Evolution from Early Buddhism to the Trikaya Theory.'' 2004. p. 65</ref> In the Mahāsāṃghika ''Lokānuvartana Sūtra'', it is stated, \"The Buddha knows all the dharmas of the countless buddhas of the ten directions.\"<ref name=\"autogenerated65\"/> It is also stated, \"All buddhas have one body, the body of the Dharma.\"<ref name=\"autogenerated65\"/> The concept of many bodhisattvas simultaneously working toward buddhahood is also found among the Mahāsāṃghika tradition, and further evidence of this is given in the ''Samayabhedoparacanacakra'', which describes the doctrines of the Mahāsāṃghikas.<ref>Guang Xing. ''The Concept of the Buddha: Its Evolution from Early Buddhism to the Trikaya Theory.'' 2004. p. 66</ref>\n\n[[File:BuddhaTwang.jpg|thumb|300px|A statue of Gautama Buddha at [[Tawang Monastery]], [[India]].]]\n\n==Depictions of the Buddha in art==\n{{main|Buddharupa}}\n[[File:ShwedagonIMG 7662.JPG|thumb|[[Buddharupa|Buddha statues]] at [[Shwedagon Pagoda]]]]\nBuddhas are frequently represented in the form of statues and paintings. Commonly seen designs include:\n* The Seated Buddha\n* The Reclining Buddha\n* The Standing Buddha\n*''Hotei'' or ''[[Budai]]'', the obese Laughing Buddha, usually seen in [[China]] (This figure is believed to be a representation of a medieval Chinese monk who is associated with [[Maitreya]], the future Buddha, and is therefore technically not a Buddha image.)\n* the Emaciated Buddha, which shows Siddhartha Gautama during his extreme ascetic practice of starvation.\n\nThe Buddha statue shown calling for rain is a pose common in [[Lao Buddhist sculpture|Laos]].\n\n===Markings===\nMost depictions of Buddha contain a certain number of ''markings'', which are considered the signs of his enlightenment. These signs vary regionally, but two are common:\n\n*a protuberance on the top of the head (denoting superb mental acuity)\n*long earlobes (denoting superb perception)\n\nIn the Pāli Canon, there is frequent mention of a list of thirty-two [[physical characteristics of the Buddha]].\n\n===Hand-gestures===\nThe poses and hand-gestures of these statues, known respectively as [[asana]]s and [[mudra]]s, are significant to their overall meaning. The popularity of any particular mudra or asana tends to be region-specific, such as the ''[[Vajra]]'' (or ''Chi Ken-in'') mudra, which is popular in [[Japan]] and [[Korean Buddhist sculpture|Korea]] but rarely seen in [[India]]. Others are more common; for example, the ''Varada'' (Wish Granting) mudra is common among standing statues of the Buddha, particularly when coupled with the ''Abhaya'' (Fearlessness and Protection) mudra.\n\n==Names of the Buddha==\n[[Aśvaghoṣa]] in his ''[[Buddhacarita]]'' gives a long list of names for the Buddha:\n{{quote|Buddha, Self-existent, Lord of Law (Dharmaraja), Nayaka, Vinayaka, Caravan Leader, Jina (Victorious One), the Master-giver of Dharma, The Teacher, Master of the Dharma, the Lord of the World, the consoler, the loving-regarder [cf. Avalokiteshvara,] the Hero, the champion, the victorious one in conflict, Light of the World, Illuminator of the Knowledge of True Wisdom, The dispeller of the darkness of ignorance, Illuminator of the Great Torch,  Great Physician, Great Seer, the Healer, Attainer of the Great Vehicle (Mahayana), Lord of all Dharma, the Ruler, Monarch of All Worlds, the Sovereign, Lord of all wisdom, the wise, the destroyer of the pride of all disputers, the omniscient, the Arhat, Possessor of Perfect Knowledge, the Great Buddha, Lord of Saints, The Victorious, the Perfect Buddha, Sugata, the wise one who fulfills the wishes of all beings, The ruler of the world, bearer of the world, master of the world, sovereign of the world,  teacher of the world, preceptor of the world, The Fount of Nectar, the powerful luminary, Bringer of all virtue and all real wealth, possessor of perfect excellence and all good qualities, the guide on the road of wisdom who shows the way to Nirvana, Tathagata without stain, without attachment, without uncertainty.<ref>{{cite book|author1=E. B. Cowell|author2=Francis A. Davis|authorlink1=Edward Byles Cowell|title=Buddhist Mahayana Texts|date=1894|publisher=[[Oxford University Press]]|isbn=0486255522|page=183|volume=49|url=https://books.google.com/books?id=LYIfAwAAQBAJ&pg=PA183|accessdate=3 September 2015}} The Buddha-karita of [[Aśvaghoṣa]], translated from the Sanskrit, in the ''[[Sacred Books of the East]]''</ref>}}\n\nIn his commentary to the ''[[Śūraṅgama Sūtra]]'', [[Hsuan Hua]] tells the following fable: \n{{quote|Originally every Buddha had ten thousand names. In time these ten thousand names were reduced to one thousand because people got confused trying to remember them all. For a while every Buddha had a thousand names, but people still couldn’t remember so many, so they were again reduced to one hundred names. Every Buddha had a hundred different names and living beings had a hard time remembering them, so they were shortened again to ten.<ref>From the Chapter on \"The General Explanation of the Title\", ''The Surangama Sutra'', English translation by the Buddhist Text Translation Society.</ref>}}\n\n==See also==\n{{refbegin|2}}  \n*[[Amitābha]]\n*[[Buddha-nature]]\n*[[Buddhism in Indonesia]]\n*[[Dona Sutta]]\n*[[Enlightenment in Buddhism]]\n*[[Eternal Buddha]]\n*[[Five Tathagatas]]\n*[[Gautama Buddha]]\n*[[List of Buddha claimants]]\n*[[List of the named Buddhas]]\n*''[[Mahāyāna Mahāparinirvāṇa Sūtra]]''\n*[[Maitreya]]\n*[[Mankiala stupa]]\n*[[Physical characteristics of the Buddha]]\n*[[The unanswered questions]]\n*[[Vairocana]]\n{{refend}}\n\n==Notes==\n{{reflist|group=lower-alpha|2}}\n\n==References==\n{{reflist|2}}\n\n==Further reading==\n*''What the Buddha Taught'' (Grove Press, Revised edition July 1974), by [[Walpola Rahula]]\n*''Buddha: The Compassionate Teacher'' (2002),  by K. M. M. Swe\n\n==External links==\n{{Sister project links|Buddha|n=no}}\n*[http://www.buddhanet.net/index.html BuddhaNet]\n\n{{Buddhism topics}}\n\n{{Authority control}}\n\n[[Category:Buddhas| ]]\n[[Category:Buddhist terminology]]\n[[Category:Buddhist philosophical concepts]]",
            "slug": "buddhahood",
            "date_updated": 1531839767800,
            "imported": "https://en.wikipedia.org/wiki/Buddhahood"
        }
    ]
}