{
    "article": [
        {
            "title": "Buddhism_and_sexuality",
            "text": "{{Buddhism}}\nIn [[Dhammacakkappavattana Sutta|the Buddha's first discourse]] he identifies craving (''[[tanha]]'') as the cause of suffering (''[[dukkha]]''). He then identifies three objects of craving: the craving for existence; the craving for non-existence and the craving for sense pleasures (''[[kama]]''). ''[[Kama]]'' is identified as one of [[five hindrances]] to the attainment of ''[[jhana]]'' according to the Buddha's teaching. Throughout the [[Sutta Pitaka]] the Buddha often compares sexual pleasure to arrows or darts. So in the ''Kama Sutta'' from the ''[[Sutta Nipata]]'' the Buddha explains that craving sexual pleasure is a cause of suffering.\n\n{{quote|If one, longing for sexual pleasure, achieves it, yes, he's enraptured at heart. The mortal gets what he wants. But if for that person — longing, desiring — the pleasures diminish, he's shattered, as if shot with an arrow.''|Kama Sutta, Sutta Nipata<ref>Kama Sutta, Sutta Nipata 4.1</ref>}}\n\nThe Buddha then goes on to say:\n{{quote|So one, always mindful, should avoid sexual desires. Letting them go, he will cross over the flood like one who, having bailed out the boat, has reached the far shore.}}\n\nThe 'flood' refers to the deluge of human suffering. The 'far shore' is ''[[nibbana]]'', a state in which there is no sexual desire.\n\nThe meaning of the ''Kama Sutta'' is that sexual desire, like any habitual sense pleasure, brings suffering. To lay people [[Buddha Gautama|the Buddha]] advised that they should at least avoid ''[[sexual misconduct]]'' which meant following generally accepted norms of sexual morality and behavior. From the Buddha's full-time disciples, the ordained monks and nuns, strict celibacy (called ''[[brahmacarya]]'') had always been required.\n\n==Overview==\nFormer Vice President of the [[Buddhist Society]] and Chairman of the English Sangha Trust, Maurice Walshe, wrote an essay called 'Buddhism and Sex' in which he presented Buddha's essential teaching on human sexuality and its relationship to the goal (''nibbana''). The third of the [[five precepts]] states:\n\n::''Kamesu micchacara veramani sikkhapadam samadiyami'',\n\nThe literal meaning of this statement is, \"I undertake the course of training in refraining from wrong-doing in respect of sensuality.\" Walshe comments,\n\n::There is, in the Buddhist view, nothing uniquely wicked about sexual offenses or failings. Those inclined to develop a guilt-complex about their sex-life should realize that failure in this respect is neither more, nor, on the other hand, less serious than failure to live up to any other precept. In point of fact, the most difficult precept of all for nearly everybody to live up to is the fourth — to refrain from all forms of wrong speech (which often includes uncharitable comments on other people's real or alleged sexual failings!)...What precisely, then, does the Third Precept imply for the ordinary lay Buddhist? Firstly, in common with all the other precepts, it is a rule of training. It is not a \"commandment\" from God, the Buddha, or anyone else saying: \"Thou shalt not...\" There are no such commandments in Buddhism. It is an undertaking by you to yourself, to do your best to observe a certain type of restraint, because you understand that it is a good thing to do. This must be clearly understood. If you don't think it is a good thing to do, you should not undertake it. If you do think it is a good thing to do, but doubt your ability to keep it, you should do your best, and probably, you can get some help and instruction to make it easier. If you feel it is a good thing to attempt to tread the Buddhist path, you may undertake this and the other precepts, with sincerity, in this spirit.<ref>{{cite web|url=http://www.accesstoinsight.org/lib/authors/walshe/wheel225.html |title=Buddhism and Sex |publisher=Accesstoinsight.org |date=2012-12-01 |accessdate=2013-09-14}}</ref>\n\nThe Buddha's teaching arises out of a wish for others to be free from dukkha. According to the doctrine he taught, freedom from suffering involves freedom from sexual desires and the training (Pali: ''sikkha'') to get rid of the craving involves to a great extent abstaining from those desires. This is based on the understanding that indulging in such desires perpetuates the underlying craving.\n\n==Celibacy and monasticism==\nApart from certain schools in Japan and Tibet, most who choose to practice Buddhism as ordained [[Bhikkhu|monks]] and [[Bhikkhuni|nuns]], also choose to live in [[celibacy]].<ref>{{cite book | last =Saddhatissa | first =Hammalawa | authorlink = | coauthors = | title =Buddhist Ethics: The Path to Nirvana | publisher =Wisdom Pubns; New Ed edition |date=December 1987 | location = | page =88 | url =\n  | doi = | isbn = 0-86171-053-3}}</ref>\n\nSex is seen as a serious monastic transgression. Within [[Theravada]] Buddhism there are four principal transgressions which entail expulsion from the monastic [[Sangha (Buddhism)|Sangha]]: sex, theft, murder, and falsely boasting of superhuman perfections.<ref>Lopez, Donald S. Critical Terms for the Study of Buddhism. Chicago: The University of Chicago Press. 2005</ref> ''Sexual misconduct'' for monks and nuns includes [[masturbation]].<ref name=CAOL>Olson, Carl. The Different Paths of Buddhism: A Narrative-Historical Introduction. New Jersey: Rutgers University Press. 2005</ref> In the case of monasticism, abstaining completely from sex is seen as a necessity in order to reach enlightenment. The Buddha's criticism of a monk who broke his celibate vows—without having disrobed first—is as follows:\n\n{{quote|\"'Worthless man, [sexual intercourse] is unseemly, out of line, unsuitable, and unworthy of a [[Shramana|contemplative]]; improper and not to be done... Haven't I taught the [[Dhamma]] in many ways for the sake of dispassion and not for passion; for unfettering and not for fettering; for freedom from [[Upādāna#Buddhism|clinging]] and not for clinging? Yet here, while I have taught the Dhamma for dispassion, you set your heart on passion; while I have taught the Dhamma for unfettering, you set your heart on being fettered; while I have taught the Dhamma for freedom from clinging, you set your heart on clinging.\"\n\n\"'Worthless man, haven't I taught the Dhamma in many ways for the fading of passion, the sobering of intoxication, the subduing of thirst, the destruction of attachment, the severing of the round, the ending of craving, dispassion, cessation, unbinding? Haven't I in many ways advocated abandoning sensual pleasures, comprehending sensual perceptions, subduing sensual thirst, destroying sensual thoughts, calming sensual fevers? Worthless man, it would be better that your penis be stuck into the mouth of a poisonous snake than into a woman's vagina. It would be better that your penis be stuck into the mouth of a black viper than into a woman's vagina. It would be better that your penis be stuck into a pit of burning embers, blazing and glowing, than into a woman's vagina. Why is that? For that reason you would undergo death or death-like suffering, but you would not on that account, at the break-up of the body, after death, fall into [[Naraka (Buddhism)|deprivation, the bad destination, the abyss, hell]]...\"\n\n\"'Worthless man, this neither inspires faith in the faithless nor increases the faithful. Rather, it inspires lack of faith in the faithless and wavering in some of the faithful.'\" <ref>{{cite web|title=Introduction|url=http://www.accesstoinsight.org/lib/authors/thanissaro/bmc1/bmc1.intro.html|work=The Buddhist Monastic Code I: The Patimokkha Training Rules Translated and Explained|publisher=Access to Insight|accessdate=18 August 2012}}</ref>}}\n\n==Lay Buddhism==\nThe most common formulation of Buddhist ethics are the [[The Five Precepts|Five Precepts]] and the [[Noble Eightfold Path|Eightfold Path]], which say that one should neither be attached to nor crave sensual pleasure.  These precepts take the form of voluntary, personal undertakings, not divine mandate or instruction. The third of the Five Precepts is \"To refrain from committing sexual misconduct.<ref name=HIGG>{{cite web\n  | last =Higgins\n  | first =Winton\n  | title =Buddhist Sexual Ethics\n  | work =\n  | publisher =BuddhaNet Magazine\n  | date =\n  | url =http://www.buddhanet.net/winton_s.htm\n  | accessdate = 2007-01-15 }}\n</ref>\n\nFornication, or sex outside of marriage, is seen as a violation of the Brahmacharya vow from the Five Precepts.\n\nAccording to the [[Theravada]] traditions there are some statements attributed to [[Gautama Buddha]] on the nature of sexual misconduct. In ''Everyman's Ethics'', a collection of four specific [[suttas]] compiled and translated by [[Narada Thera]], it is said that adultery is one of four evils the wise will never praise.<ref>{{cite web|url=http://dharmaflower.net/_collection/everymanethics.pdf |title=Everyman's Ethics Four Discourses of the Buddha|accessdate=2010-04-16|publisher=Buddhist Publication Society |last=Thera |first=Narada }}</ref> Within the [[Anguttara Nikaya]] on his teachings to Cunda the Silversmith this scope of misconduct is described: <blockquote>\"...one has intercourse with those under the protection of father, mother, brother, sister, relatives or clan, or of their religious community; or with those promised to someone else, protected by law, and even with those betrothed with a garland\" <ref>{{cite web|url=http://www.accesstoinsight.org/tipitaka/an/an10/an10.176.than.html |title=Cunda Kammaraputta Sutta |accessdate=2010-04-16|publisher=Access to Insight |last=Thanissaro Bhikkhu }}</ref></blockquote>  This and other teachings within the [[Pali Canon]] are important and fundamental guidance for Theravada Buddhists.\n\n==Sexual Yoga==\n{{See also|Tantra techniques}}\nAccording to some Tibetan authorities, the physical practice of sexual yoga is necessary at the highest level for the attainment of Buddhahood.<ref>Routledge ''Encyclopedia of Buddhism'', page 781</ref> The use of sexual yoga is highly regulated. It is only permitted after years of training.<ref name=HARVEY>{{cite book|url=https://books.google.com/books?id=URZNk9noWJEC&pg=PA141&dq=sexual+yoga&sig=ACfU3U1N2atsSlWp73ApspY1F1AOb5eAMA#PPA142,M1 |title=An Introduction to Buddhist Ethics: Foundations, Values and Issues - Peter Harvey - Google Boeken |publisher=Books.google.com |date=2000-06-22 |accessdate=2013-09-14}}</ref> The physical practice of sexual yoga is and has historically been extremely rare.<ref name=LAIRD>{{cite book|url=https://books.google.com/books?id=CaV2y65qb4EC&pg=PA81&dq=sexual+yoga&sig=ACfU3U0WkWe21VOnhT12tQIDlX7ntA4OSA#PPA82,M1 |title=The Story of Tibet: Conversations with the Dalai Lama - Thomas Laird - Google Boeken |publisher=Books.google.com |date= |accessdate=2013-09-14}}</ref> A great majority of Tibetans believe that the only proper practice of tantric texts is metaphorically, not physically, in rituals and during meditative visualizations.<ref name=LAIRD/> The dominant [[Gelug]] sect of Tibetan Buddhism holds that sexual yoga as an actual physical practice is the only way to attain Buddhahood in one lifetime. The founder of the sect [[Tsongkhapa]] did not, according to tradition, engage in this practice, but instead attained complete enlightenment at the moment of death, that being according to this school the nearest possible without sexual yoga. The school also taught that they are only appropriate for the most elite practitioners, who had directly realized emptiness and who had unusually strong compassion. The next largest school in Tibet, the Nyingma, holds that this is not necessary to achieve Buddhahood in one lifetime.<ref>Routledge ''Encyclopedia of Buddhism'', page 781; the briefer statement in this article by Powers should be understood in the light of his fuller statement in his book ''Introduction to Tibetan Buddhism'', Snow Lion, 1995, pages 252f</ref> The fourteenth [[Dalai Lama]] of the Gelug sect, holds that the practice should only be done as a visualization.<ref name=LAIRD/>\n\n==Homosexuality==\n{{Main article|Buddhism and sexual orientation}}\nAmong Buddhists there is a wide diversity of opinion about homosexuality. [[Buddhism]] teaches that sensual enjoyment and desire in general, and sexual pleasure in particular, are hindrances to [[Bodhi|enlightenment]], and inferior to the kinds of pleasure (see, e.g. [[pīti]], a [[Pāli]] word often translated as \"rapture\") that are integral to the practice of [[jhāna]]. \n\nThe [[Five Precepts]] of the \"Sexual misconduct\" is a broad term, subject to interpretation according to followers' social norms. Early Buddhism appears to have been silent regarding homosexual relations.<ref name=\"James William Coleman 2002, page 146\">James William Coleman, ''The New Buddhism: The Western Transformation of an Ancient Tradition.'' Oxford University Press 2002, page 146.</ref> Still, Some Buddhists of Asian background hold prejudices against gay/lesbian or transgender persons, despite no saying that same or opposite gender relations have anything to do with sexual misconduct in the Early Buddhist scriptures and many later Buddhist texts.\n\nAccording to the [[Pāli Canon]] and [[Āgama (Buddhism)|Āgama]] (the Early Buddhist scriptures), there is not any saying that same or opposite gender relations have anything to do with sexual misconduct,<ref name=\"cunda kammaraputta sutta\">{{cite web|title=Cunda Kammaraputta Sutta|trans-title=To Cunda the Silversmith|others=Translated from the Pali by Thanissaro Bhikkhu|publisher=Access to Insight|year=1997|id=[[Anguttara Nikaya|AN]] 10.176|url=http://www.accesstoinsight.org/tipitaka/an/an10/an10.176.than.html| accessdate = 2011-03-14|quote=Abandoning sensual misconduct, he abstains from sensual misconduct. He does not get sexually involved with those who are protected by their mothers, their fathers, their brothers, their sisters, their relatives, or their Dhamma; those with husbands, those who entail punishments, or even those crowned with flowers by another man}}</ref><ref>[http://www.dhammatalks.net/suttacentral/sc/zh/ma128.html 優婆塞經](Upāsaka Sutra from Madhyam āgama):復次，舍梨子！白衣聖弟子離邪婬、斷邪婬，彼或有父所護，或母所護，或父母所護，或兄弟所護，或姉妹所護，或婦父母所護，或親親所護，或同姓所護，或為他婦女，有鞭罰恐怖，及有名雇債至華鬘親，不犯如是女。彼於邪淫淨除其心，白衣聖弟子善護行，此第三法</ref> and some [[Theravada]] monks express that same-gender relations do not violate the rule to avoid sexual misconduct, which means not having sex with someone underage (thus protected by their parents or guardians), someone betrothed or married and who have taken vows of religious celibacy.<ref>\n* {{cite web|author1=Ajahn Punnadhammo|title=Same Sex Marriage|url=http://www.arrowriver.ca/torStar/samesex.html|quote=The lay man is told to abstain from sex with \"unsuitable partners\" defined as girls under age, women betrothed or married and women who have taken vows of religious celibacy. This is clear, sound advice and seems to suggest that sexual misconduct is that which would disrupt existing family or love relationships. This is consonant with the general Buddhist principle that that which causes suffering for oneself or others is unethical behaviour. (\"Unskillful behaviour\" would be closer to the original.) There is no good reason to assume that '''''homosexual relations which do not violate this principle''''' should be treated differently. }}\n* {{cite book|author1=Somdet Phra Buddhaghosacariya|title=Uposatha Sila The Eight-Precept Observance|date=1993|url=http://www.accesstoinsight.org/lib/authors/nanavara/uposatha.html}}There are '''four factors of the third precept''' (kamesu micchacara)\n#agamaniya vatthu — that which should not be visited (the 20 groups of women).\n#asmim sevana-cittam — the intention to have intercourse with anyone included in the above-mentioned groups. \n#sevanap-payogo — the effort at sexual intercourse. \n#maggena maggappatipatti — sexual contact through that adhivasanam effort.\n* {{cite book|author1=Bhikkhu Bodhi|title=Going for Refuge & Taking the Precepts (The Five Precepts)|date=1981|publisher=Buddhist Publication Society|url=http://bodhimonastery.org/going-for-refuge-taking-the-precepts.html#prec2}}\n</ref>\n\nSome later traditions feature restrictions on non-vagina sex, though its situations seem involving coerced sex.<ref name=\"harvey 2000 421\">{{cite book| last = harvey | first = peter | title = An Introduction to Buddhist Ethics | publisher = Cambridge University Press | year = 2000 | isbn = 9780511800801 | pages=421-}}</ref><ref name=\"coerced\">{{cite web|last1=Huifeng|title=Re: Gay Marriage: What Would Buddha Do?|url=http://www.dharmawheel.net/viewtopic.php?t=380&start=20#p15496|website=Dharma Wheel|accessdate=13 January 2017}}</ref><ref name=\"Mahā-prajñāpāramitā-śāstra\">《Great Treatise on the Perfection of Wisdom》（Sanskrit: Mahā-prajñāpāramitā-śāstra; 中文: 大智度論）卷13：非道之處，則非女根，女心不樂，強以非理，故名邪婬。（The wrong orifice is not through the female organ, the lady does not like this, and so forcing it [upon her] is inappropriate, therefore it is said to be \"sexual misconduct）</ref> This non-vagina sex view is not based on what Buddha's said, but from some later [[Abhidharma]] texts.<ref>{{cite book|author1=Thubten Chodron|title=Dealing  With  Life’s  Issues|url=https://thubtenchodron.org/wp-content/uploads/2015/04/Dealing-With-Lifes-Issues.pdf|quote=The Pali scriptures make no mention of homosexuality being unwise sexual conduct. For monastics, all sexual intercourse is a root downfall. It doesn't specify the gender of one's partner. Vasubandhu, a teacher who came several centuries after the Buddha, discouraged homosexuality. Personally speaking, I think what's most important is the motivation behind how we use our sexuality. In other words, if people use their sexuality unkindly or unwisely, it doesn't matter if it is directed to someone of their own sex or the opposite sex.}}</ref><ref>{{cite web|last1=José Ignacio Cabezón|title=Thinking through Texts: Toward a Critical Buddhist Theology of Sexuality|url=http://info-buddhism.com/Buddhism-Sexuality-Cabezon.html|accessdate=17 February 2017|quote=Now the obvious historical question then becomes this: If the early doctrine of sexual misconduct is so simple and elegant, when and why did it get so complex and restrictive – that is, when do we find the transition to “organ/orifice mode”? The answer to the “when” question is simple. We don’t find any examples of the more elaborate formulation of sexual misconduct before the third century CE.}}</ref>\n\nConservative Buddhist leaders like Chan master [[Hsuan Hua]] have spoken against the act of homosexuality.<ref>Prebish, Charles: ''The Faces of Buddhism in America'', page 255. University of California Press, 1998.</ref> Some Tibet Buddhist leaders like the [[14th Dalai Lama]] spoke about the restrictions of how to use your [[sex organ]] to insert other's body parts based on [[Je Tsongkhapa]]'s work.<ref name=REFDonLattin>\"Even with your wife, using one's mouth or the other hole is sexual misconduct. Using one's hand, that is sexual misconduct\". (Dalai Lama, at a meeting with lesbian and gay Buddhists, June 11, 1997). Reported widely, including in: ''Dalai Lama Speaks on Gay Sex – He says it's wrong for Buddhists but not for society''. By Don Lattin, Chronicle Religion Writer, Tuesday, June 11, 1997, San Francisco Chronicle. [http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/1997/06/11/MN24029.DTL Text online]</ref><ref name=REFDennisConkin>''Dalai Lama urges \"respect, compassion, and full human rights for all\", including gays'', by Dennis Conkin, Bay Area Reporter, June 19, 1997. [http://quietmountain.org/links/teachings/gayrites.htm Text online]</ref><ref name=REFJackNichols>''Dalai Lama says 'oral and anal sex' not acceptable,'' Jack Nichols, May 13, 1997. [https://web.archive.org/web/19990221081940/http://badpuppy.com/gaytoday/garchive/events/051397ev.htm Text online]</ref> Though the Dalai Lama expressed ''“the possibility of understanding these precepts in the context of time, culture and society\"'', he doesn't seem to change his view about what constitutes \"sexual misconduct\" after that.<ref name=José/><ref>The Huffington Post, 07/13/09, Gay Marriage: What Would Buddha Do?, http://www.huffingtonpost.com/james-shaheen/gay-marriage-what-would-b_b_230855.html</ref> the Dalai Lama called for further research and dialogue on this topic, \"and concluded by reiterating the fact that, however the notion of sexual misconduct comes to be defined, it can never be used to justify discrimination against sexual minorities.\"<ref name=José>[http://info-buddhism.com/Buddhism-Sexuality-Cabezon.html Thinking through Texts: Toward a Critical Buddhist Theology of Sexuality] by José Ignacio Cabezón, Public Lecture, Naropa University, September 23, 2008</ref>\n\nOther prominent Buddhists diverge from this position. The Bhutanese lama [[Dzongsar Jamyang Khyentse Rinpoche|Dzongsar Khyentse Rinpoche]] has argued that sexual orientation is irrelevant to Buddhist concerns about sexuality, explaining that culture is to blame for homophobia.<ref>[https://www.youtube.com/watch?v=qA_Kp9v9ZtA Dzongsar Khyentse Rinpoche about Homosexuality and Buddhism] Public Speech, uploaded January 2015</ref>\n\nThe situation is different for monastics. For them, the [[Vinaya]] (code of monastic discipline) bans all sexual activity, but does so in purely physiological terms, making no moral distinctions among the many possible forms of intercourse.<ref>George E. Haggerty, ''Gay histories and cultures: an encyclopedia''. Taylor and Francis 2000, pages 146–147.</ref>\n\nRegarding transsexual people, the earliest texts mention the possibility of a person supernaturally changing sexes; such a person is not barred from ordination, and if already ordained, simply changes orders.<ref>Peter Harvey, ''An Introduction to Buddhist Ethics''. Cambridge University Press, 2000, page 412.</ref>\n\n===Western Buddhism===\nWestern Buddhism is often relatively gay-friendly,<ref>{{cite web|url=http://www.religioustolerance.org/hom_budd2.htm |title=Buddhism and homosexuality |publisher=Religioustolerance.org |date= |accessdate=2013-09-14}}</ref> often carrying these views prior to their conversion to Buddhism, and the interpretation of what is [[sexual misconduct]] is an individual decision and not subject to judgment by any central authority. A notion of accepting all peoples while rejecting certain types of sexual acts is more predominant.<ref name=\"sexualethics\">{{cite web|url=http://www.buddhanet.net/winton_s.htm |title=BuddhaNet Magazine Article: Buddhist Sexual Ethics |publisher=Buddhanet.net |date= |accessdate=2013-09-14}}</ref>\n\nWhen applying Buddhist philosophy to the question of homosexuality, Western Buddhists often emphasize the importance the Buddha placed on tolerance, compassion, and seeking answers within one's mind.<ref name=\"sexualethics\"/>\n\n==See also==\n*[[Buddhist ethics]]\n*[[Religion and sexuality]]\n*[[Tachikawa-ryu]]\n\n==References==\n{{Reflist|2}}\n\n==External links==\n*[http://studybuddhism.com/en/tibetan-buddhism/path-to-enlightenment/karma-rebirth/buddhist-sexual-ethics-main-issues Buddhist Sexual Ethics: Main Issues] – Alexander Berzin\n*[http://studybuddhism.com/en/tibetan-buddhism/path-to-enlightenment/karma-rebirth/buddhist-western-views-on-sex Buddhist & Western Views on Sex] – Alexander Berzin\n*[http://info-buddhism.com/Buddhism-Sexuality-Cabezon.html Thinking through Texts: Toward a Critical Buddhist Theology of Sexuality] by José Ignacio Cabezón, Public Lecture, Naropa University, September 23, 2008\n\n{{Buddhism topics}}\n{{Sex}}\n\n[[Category:Sexuality and religion|Buddhism]]\n[[Category:Buddhism and sexuality| ]]",
            "slug": "buddhism-and-sexuality",
            "date_updated": 1531840013300,
            "imported": "https://en.wikipedia.org/wiki/Buddhism_and_sexuality"
        }
    ]
}