{
    "article": [
        {
            "title": "Buddhist_texts",
            "text": "[[Image:Kyauksa.JPG|thumb|Stone inscriptions of the [[World's largest book]] at [[Kuthodaw]], Myanmar]]\n\n'''Buddhist texts''' were initially passed on orally by monks, but were later written down and composed as [[manuscripts]] in various [[Indo-Aryan languages]] which were then translated into other local languages as Buddhism spread. They can be categorized in a number of ways. The Western terms \"scripture\" and \"canonical\" are applied to [[Buddhism]] in inconsistent ways by Western scholars: for example, one authority<ref>Macmillan ''Encyclopedia of Buddhism'' (Volume One), page 142</ref> refers to \"scriptures and other canonical texts\", while another<ref>Bechert & Gombrich, ''World of Buddhism'', Thames & Hudson, London, 1984, page 79</ref> says that scriptures can be categorized into canonical, commentarial and pseudo-canonical. Buddhist traditions have generally divided these texts with their own categories and divisions, such as that between [[Buddhavacana]] \"word of the [[Gautama Buddha|Buddha]],\" many of which are known as \"[[Sutra|Sutras]],\" and other texts, such as [[Shastras]] (treatises) or [[Abhidharma]]. \n\nThese religious texts were written in many different languages and scripts but memorizing, reciting and copying the texts were of high value. Even after the development of printing, Buddhists preferred to keep to their original practices with these texts.<ref>Lyons, Martyn, ''Books: A Living History'', J. Paul Getty Museum, 2011, page 33</ref>\n\n==Buddhavacana==\n{{see also|Buddhavacana}}\n\n===Traditional criteria===\nAccording to Donald Lopez, criteria for determining what should be considered buddhavacana were developed at an early stage, and that the early formulations do not suggest that [[Dharma]] is limited to what was spoken by the historical Buddha.<ref>Lopez, Donald. ''Elaborations on Emptiness: Uses of the Heart Sutra.'' 1998. p. 28</ref> The [[Mahāsāṃghika]] and the [[Mulasarvastivada|Mūlasarvāstivāda]] considered both the Buddha's discourses, and of his disciples, to be buddhavacana.<ref>Lopez, Donald. ''Elaborations on Emptiness: Uses of the Heart Sutra.'' 1998. p. 28</ref> A number of different beings such as buddhas, disciples of the buddha, [[rishi|ṛṣi]]s, and [[deva (Buddhism)|deva]]s were considered capable to transmitting buddhavacana.<ref>Lopez, Donald. ''Elaborations on Emptiness: Uses of the Heart Sutra.'' 1998. p. 28</ref> The content of such a discourse was then to be collated with the [[sūtras]], compared with the [[Vinaya]], and evaluated against the nature of the Dharma.<ref>Lopez, Donald. ''Elaborations on Emptiness: Uses of the Heart Sutra.'' 1998. p. 29</ref><ref>Skilton, Andrew. ''A Concise History of Buddhism.'' 2004. p. 83</ref> These texts may then be certified as true buddhavacana by a buddha, a [[Sangha (Buddhism)|saṃgha]], a small group of elders, or one knowledgeable elder.<ref>Lopez, Donald. ''Elaborations on Emptiness: Uses of the Heart Sutra.'' 1998. p. 29</ref><ref>Skilton, Andrew. ''A Concise History of Buddhism.'' 2004. p. 83</ref>\n\n===In Theravada Buddhism===\nIn [[Theravada]] Buddhism, the standard collection of buddhavacana is the [[Pāli Canon]].\n\nSome scholars believe that some portions of the Pali Canon and [[Āgama (Buddhism)|Agamas]] could contain the actual substance of the historical teachings (and possibly even the words) of the Buddha.{{refn|group=note|\"It is therefore possible that much of what is found in the [[Sutta Pitaka]] is earlier than c. 250 BCE, perhaps even more than 100 years older than this. If some of the material is so old, it might be possible to establish what texts go back to the beginning of Buddhism and may include the substance of the Buddha's teaching, and in some cases, maybe even his words.\"  Alexander Wynne, 2003, p.22 [https://web.archive.org/web/20070929000202/http://www.ocbs.org/research/Wynne.pdf ''How old is the Suttapitaka?'']}}{{refn|group=note|\"It would be hypocritical to assert that nothing can be said about the doctrine of earliest Buddhism ... the basic ideas of Buddhism found in the canonical writings could very well have been proclaimed by him [the Buddha], transmitted and developed by his disciples and, finally, codified in fixed formulas.\" J.W. De Jong, 1993: \"The Beginnings of Buddhism\", in ''The Eastern Buddhist'', vol. 26, no. 2, p. 25}}\n\n===In East Asian Buddhism===\nIn East Asian Buddhism, what is considered buddhavacana is collected in the [[Chinese Buddhist canon]]. The most common edition of this is the [[Taisho Tripitaka|Taishō Tripiṭaka]].\n\nAccording to Venerable [[Hsuan Hua]] from the tradition of [[Chinese Buddhism]], there are five types of beings who may speak the sutras of Buddhism: a buddha, a disciple of a buddha, a deva, a ṛṣi, or an emanation of one of these beings; however, they must first receive certification from a buddha that its contents are true Dharma.<ref>Hsuan Hua. ''The Buddha speaks of Amitabha Sutra: A General Explanation.'' 2003. p. 2</ref> Then these sutras may be properly regarded as buddhavacana.<ref>Hsuan Hua. ''The Buddha speaks of Amitabha Sutra: A General Explanation.'' 2003. p. 2</ref>\n\nSometimes texts that are considered commentaries by some are regarded by others as Buddhavacana.<ref>For example, Honen, the founder of Japanese Puree Land, says that the writings of Shan-tao come from Amitabha Buddha and are of the same value as sutras. in: Eliot, ''Japanese Buddhism'', Edward Arnold, London, 1935, page 6</ref>\n\n[[Shingon Buddhism]] developed a system that assigned authorship of the early sutras to Gautama Buddha in his physical manifestation, of the ''Ekayana'' sutras to the Buddhas as [[Trikaya|Sambhoghakaya]], and the [[Vajrayana]] texts to the Buddha as [[Dharmakaya]].\n\n===In Tibetan Buddhism===\nIn [[Tibetan Buddhism]], what is considered buddhavacana is collected in the [[Kangyur]]. The East Asian and Tibetan Buddhist canons always combined Buddhavacana with other literature in their standard collected editions. However, the general view of what is and is not buddhavacana is broadly similar between East Asian Buddhism and Tibetan Buddhism. The Tibetan Kangyur, which belongs to the various schools of Tibetan [[Vajrayana]] Buddhism, in addition to containing sutras and vinaya, also contains [[tantras]].\n\n==Textual traditions==\n[[File:Buddhist sects.png|thumb|Map showing the three major Buddhist divisions]]\nThe earliest Buddhist texts were passed down orally in Middle [[Indo-Aryan languages]] called [[Prakrits]], including [[Gāndhārī language]], the early [[Magadhan]] language and [[Pali]] through the use of repetition, communal recitation and mnemonic devices.<ref>Gethin, Rupert; The Foundations of Buddhism, 1998; pp 39-41</ref> Doctrinal elaborations were preserved in [[Abhidharma]] works and later Karikas (verse expositions). As Buddhism spread geographically, these texts were translated into the local language, such as Chinese and Tibetan. \n\nThe [[Pali canon]] was preserved in [[Sri Lanka]] where it was first written down in the first century BCE and the [[Pali Literature|Theravadan Pali textual tradition]] developed there.<ref>Gethin, Rupert; The Foundations of Buddhism, 1998; pp 42</ref> The Sri Lankan Pali tradition developed extensive commentaries ([[Atthakatha]]) as well as sub-commentaries for the [[Pali Canon]] as well as treatises on [[Abhidhamma]]. Sutra commentaries and Abhidharma works also exist in [[Classical Tibetan|Tibetan]], [[Chinese language|Chinese]], [[Korean language|Korean]] and other [[East Asian languages]]. Important examples of non-canonical Pali texts are the ''[[Visuddhimagga]]'', by [[Buddhaghosa]], which is a compendium of [[Theravada|Theravada teachings]] and the ''[[Mahavamsa]]'', a historical Sri Lankan chronicle.\n\nThe [[Gandhāran Buddhist Texts|earliest known Buddhist manuscripts]], recovered from the ancient civilization of [[Gandhara]] in north central [[Pakistan]] (near [[Taxila]] just south west of the capital [[Islamabad]]) are dated to the 1st century and constitute the Buddhist textual tradition of [[Gandharan Buddhism]] which was an important link between Indian and East Asian Buddhism.<ref>{{cite web|url=http://depts.washington.edu/ebmp/|title= The University of Washington Early Buddhist Manuscripts Project|publisher= www.ebmp.org|date=|accessdate=13 April 2008}}</ref> \n\nAfter the rise of the [[Kushans]] in India, [[Sanskrit]] was also widely used to record Buddhist texts. [[Sanskrit Buddhist literature]] later became the dominant tradition in India until the [[decline of Buddhism in India]].<ref>Johannes Bronkhorst, Buddhism in the Shadow of Brahmanism Handbook of Oriental Studies (Leiden: Brill, 2011), 46-47.</ref> Around the beginning of the Christian era, a new genre of sutra literature began to be written with a focus on the [[Bodhisattva]] idea, commonly known as Mahayana (great vehicle) sutras.<ref>Johannes Bronkhorst, Buddhism in the Shadow of Brahmanism Handbook of Oriental Studies (Leiden: Brill, 2011), 56.</ref> Many of the [[Mahayana sutras]] were written in Sanskrit and then translated into the Tibetan and Chinese Buddhist canons (the [[Kangyur]] and the [[Taishō Tripiṭaka]] respectively) which then developed their own textual histories. The Mahayana sutras are traditionally considered by Mahayanists to be the word of the Buddha, but transmitted either in secret, via lineages of supernatural beings (such as the [[naga (mythology)|nagas]]), or revealed directly from other [[Buddhahood|Buddhas]] or [[bodhisattva]]s. Some 600 Mahayana Sutras have survived in Sanskrit, or in [[Chinese language|Chinese]] and/or [[Classical Tibetan|Tibetan]] translation. \n[[File:Tripitaka Koreana sutra page.jpg|left|thumb|Korean Koryo Period Sutra Page]]\n\nIn the Mahayana tradition there are important works termed [[Shastras]], or treatises which attempt to outline the sutra teachings and defend or expand on them. The works of important Buddhist philosophers like [[Nagarjuna]], [[Vasubandhu]] and [[Dharmakirti]] are generally termed Shastras, and were written in Sanskrit. The treatise ''[[Awakening of Faith in the Mahayana]]'' (attributed by the faithful to [[Aśvaghoşa]]) strongly influenced east Asian Mahayana doctrine and inspired numerous commentaries authored by early Korean<ref>{{cite web |url= https://books.google.com/books?id=VQ-GhVWTH84C&pg=PA603&lpg=PA603&dq=Awakening+of+Faith+in+the+Mahayana+Korean#v=onepage&q=Awakening%20of%20Faith%20in%20the%20Mahayana%20Korean&f=false |title= Routledge encyclopedia of philosophy |author= Edward Craig |date= |work=Awakening of Faith in the Mahayana Korean |publisher= |accessdate=6 July 2011}}</ref> and Chinese Buddhist teachers. \n\nThe late Seventh century saw the rise of another new class of Buddhist texts, the [[Tantras]], which outlined new ritual practices and yogic techniques such as the use of [[Mandalas]], [[Mudras]] and Fire sacrifices.<ref>RONALD M. DAVIDSON\nCHARLES D. ORZECH; TANTRA, Encyclopedia of Buddhism, Buswell (editor)</ref> Buddhist Tantras are key texts in [[Vajrayana]] Buddhism, which is the dominant form of Buddhism in [[Tibet]].\n\nThe division of texts into the traditional three [[yana (Buddhism)|yana]]s may obscure the process of development that went on, and there is some overlap in the traditional classifications. For instance, there are so-called ''proto-Mahayana'' texts, such as the ''[[Ajitasena Sutra]]'', which are missing key features that are associated with Mahayana texts.  Some Pali texts also contain ideas that later became synonymous with the Mahayana. The ''[[Garbhāvakrānti Sūtra]]'' is included in both the ''[[Vinaya Pitaka]]'' of the [[Mulasarvastivada]], one of the early schools, and the ''[[Mahāratnakūṭa Sūtra|Ratnakuta]]'', a standard collection of Mahayana sutras.<ref>Skilling, ''Mahasutras'', volume II, Parts I & II, [[Pali Text Society]][http://www.palitext.com], Lancaster, 1997, pages 93f</ref> Some Mahayana texts are also thought to display a distinctly [[Tantra|tantric]] character, particularly some of the shorter [[Perfection of Wisdom]] sutras. An early tantra, the ''Mahavairocana Abhisambodhi Tantra'', is also known as the ''[[Mahavairocana Sutra]]''.  At least some editions of the Kangyur include the ''[[Heart Sutra]]'' in the tantra division.<ref>Conze, ''The Prajnaparamita Literature'', Mouton, the Hague, 1960, page 72; Rgyud is Tibetan for tantra</ref> Such overlap is not confined to \"neighbouring\" yanas: at least nine \"Sravakayana\" (\"[[Hinayana]]\") texts can be found in the tantra divisions of some editions of the Kangyur.<ref>''Journal of the Pali Text Society'', volume XVI, pages 161f</ref> One of them, the ''[[Atanatiya Sutra]]'', is also included in the Mikkyo (esoteric) division of the standard modern collected edition of Sino-Japanese Buddhist literature.<ref>Skilling, ''Mahasutras'', Volume II, Parts I & II, 1997, Pali Text Society, Lancaster</ref> (A variant of it is also found in the [[Digha Nikaya]] of the [[Pali Canon]].)\n\nSome Buddhist texts evolved to become a virtual canon in themselves, and are referred to as ''vaipulya'' or extensive sutras. The ''[[Flower Garland Sutra]]'' is an example of a single sutra made up of other sutras, many of which, particularly the ''[[Gandavyuha Sutra]]'' still circulate as separate texts. <ref>Huayan, Encyclopedia of Religion, 2nd ed., pg 41-45</ref>\n\n[[Tibetan Buddhism]] has a unique and special class of texts called [[Terma (Buddhism)|terma]] (Tibetan: gTer-ma). These are texts (or ritual objects, etc.) believed either composed or hidden by tantric masters and/or elementally secreted or encoded in the elements and retrieved, accessed or rediscovered by other tantric masters when appropriate. Termas are discovered by [[tertön]]s (Tibetan: gTer-stons), whose special function is to reveal these texts. Some termas are hidden in caves or similar places, but a few are said to be 'mind termas,' which are 'discovered' in the mind of the tertön. The [[Nyingma]] school (and [[Bön]] tradition) has a large terma literature. Many of the terma texts are said to have been written by [[Padmasambhava]], who is particularly important to the Nyingmas. Probably the best known terma text is the so-called ''[[Tibetan book of the dead]]'', the ''Bardo Thodol''.\n\n==Texts of the Early schools ==\n{{refimprove-section|date=June 2016}}\n{{further|Early Buddhist Texts}}\n[[File:Burmese-Pali Manuscript Wellcome L0067947.jpg|thumb|Burmese Pali manuscript]]\nAlthough many versions of the texts of the [[early Buddhist schools]] exist, the only complete collection of texts to survive in a Middle Indo-Aryan language is the [[Tipiṭaka]] (triple basket) of the [[Theravada|Theravadin school]].<ref>Bodhi, In the Buddha's words, p 13</ref> The other (parts of) extant versions of the Tripitakas of early schools include the [[Āgama (Buddhism)|Āgamas]], which includes texts by the [[Sarvastivada]] and the [[Dharmaguptaka]]. The [[Chinese Buddhist canon]] contains a complete collection of early sutras in Chinese translation, their content is very similar to the Pali, differing in detail but not in the core doctrinal content.\n\nParts of what is likely to be the canon of the [[Dharmaguptaka]] can be found amongst the [[Gandharan Buddhist Texts]]. Several early versions of the ''[[Vinaya Pitaka]]'' (from various schools) are also kept in the Chinese (Mahayana) Canon.\n\n===Vinaya===\n{{further|Vinaya}}\nThe [[vinaya]] literature is primarily concerned with aspects of the monastic discipline. However, vinaya as a term is also contrasted with Dharma, where the pair (Dhamma-Vinaya) mean something like 'doctrine and discipline'. The vinaya literature in fact contains a considerable range of texts. There are, of course, those that discuss the monastic rules, how they came about, how they developed, and how they were applied. But the vinaya also contains some doctrinal expositions, ritual and liturgical texts, biographical stories, and some elements of the \"[[Jataka tales|Jatakas]]\", or birth stories.\n\nParadoxically, the text most closely associated with the vinaya, and the most frequently used portion of it, the ''[[Pratimoksha]]'', is in itself not a canonical text in Theravada, even though almost all of it can be found in the canon.\n\nSix complete [[vinaya]]s survive:\n\n*Theravada, written in [[Pāli|Pali]]\n*Mula-Sarvāstivāda, written in [[Sanskrit]], but surviving complete only in Tibetan translation\n*Mahāsānghika, Sarvāstivāda, Mahīshāsika, and Dharmagupta, originally in Indian languages, but only surviving in [[Chinese language|Chinese]] translation.\n\nIn addition, portions survive of a number of vinayas in various languages.\n\nThe ''[[Mahāvastu]]'' compiled by the Lokottaravadin sub-school of the Mahāsānghika was perhaps originally the preamble to their vinaya that became detached; hence, rather than dealing with the rules themselves, it takes the form of an extended biography of the Buddha, which it describes in terms of his progression through ten bhumis, or stages. This doctrine was later taken up by the Mahayana in a modified form as [[Vasubandhu]]'s [[Ten Stages Sutra]].\n\n===Sutra===\nThe Sutras ([[Sanskrit]]; Pali ''Sutta'') are mostly discourses attributed to the Buddha or one of his close disciples. They are all, even those not actually spoken by him, considered to be ''[[Buddhavacana]]'', the word of the Buddha, just as in the case of all canonical literature. The Buddha's discourses were perhaps originally organised according to the style in which they were delivered. There were originally nine, but later twelve, of these. The Sanskrit forms are:\n\n*Sūtra: prose discourses, especially short declarative discourses.\n*Geya: mixed prose and verse discourse. Identified with the Sagāthāvagga of the Saṁyutta Nikāya\n*Vyākarana: explanation, analysis. Discourses in question and answer format.\n*Gāthā: verse\n*Udāna: inspired speech\n*Ityukta: beginning with 'thus has the Bhagavan said'\n*Jātaka: story of previous life\n*Abhutadharma: concerning wonders and miraculous events\n*Vaipulya either 'extended discourses' or 'those giving joy' (cf Mahayana Texts)\n*Nidāna: in which the teachings are set within their circumstances of origin\n*Avadāna: tales of exploits\n*Upadesha: defined and considered instructions\n\nThe first nine are listed in all surviving agamas, with the other three added in some later sources. In Theravada, at least, they are regarded as a classification of the whole of the scriptures, not just suttas. The scheme is also found in Mahayana texts. However, some time later a new organizational scheme was imposed on the canon, which is now the most familiar. The scheme organises the suttas into:\n\n====Long discourses ====\nThese range in length up to 95 pages. The Pali [[Digha Nikaya]] contains 34 texts, including the ''[[Mahāparinibbāna Sutta]]'' and the ''[[Brahmajāla Sutta]]''. The ''[[Dīrghāgama]]'' of the [[Dharmagupta]] also survives, in Chinese translation, and contains 30 sutras.\n\n====Medium-length discourses ====\nThese are the rest of the sutras of any length, and the Pali [[Majjhima Nikaya]] has 152 suttas. The Madhyamāgama of the Sarvāstivada containing 222 sutras survives in Chinese translation.\n\n====Connected discourses ====\nThis grouping consists of many short texts connected by theme, setting, or interlocutor. The Pali [[Samyutta Nikaya]] contains more than 2,800 sutras. The Samyuktāgama of the Sarvāstivada containing only 1,300 sutras survives in Chinese translation.\n\n====Numbered discourses ====\nSutras with the same number of doctrinal items, comprise over 2,300 suttas in the Pali [[Anguttara Nikaya]]. The Chinese canon contains an Ekottarāgama that some scholars think belongs to the Mahāsanghika school.\n\n==== Miscellaneous texts ====\nNot all schools had this category, but the Pali [[Khuddaka Nikaya]] has several well-known and loved texts, including:\n\n* The [[Dhammapada]]:  a collection of sayings and aphorisms.\n* The [[Udana]] : a collection of inspired sayings in verse usually with a prose introduction that sets a context of sorts for the saying.\n* The ''[[Sutta Nipata]]'': parts of the Sutta Nipata, such as the [[Atthakavagga and Parayanavagga|Aṭṭhakavagga and Pārāyanavagga]],  are thought by some scholars{{Citation needed|date=January 2008}} to represent the earliest strata of the written canon. Many of the features of later texts, such as numbered lists of teachings, or complex doctrinal categories, are not present.\n* [[Theragatha|Theragāthā]] and [[Therigatha|Therīgāthā]] two collections of biographical verse related to the disciples of the Buddha.\n* [[Jataka]]: poems related to the so-called 'birth stories,' which recount former lives of the Buddha. These remain popular in many forms of Buddhism.\n\nMany of these texts are available in translation as well as in the original language. The Dhammapada, for instance, has a Pali version, three Chinese versions, a Tibetan version, and a [[Khotanese language|Khotanese]] version.\n\n===Abhidharma===\n{{further|Abhidharma}}\n[[Abhidharma]] (in [[Pāli|Pali]], ''Abhidhamma'') means 'further Dharma' and is concerned with the analysis of phenomena. It grew initially out of various lists of teachings such as the 37 Bodhipaksika-dharmas or the 37 Factors leading to Awakening. The Abhidharma literature is chiefly concerned with the analysis of phenomena and the relationships between them.\n\nThe Theravāda Abhidhamma survives in the Pali Canon.  Outside of the Theravada monasteries the Pali Abhidharma texts are not well known.\n\nA Sarvastivada Abhidharma, composed in Sanskrit, survives in Chinese and Tibetan traditions. Though the Theravādin Abhidhamma is well preserved and best known, it should be noted that a number of the early [[Eighteen Schools]] each had their own distinct Abhidharma collection with not very much common textual material, though sharing methodology.\n\nNot all schools accepted the Abhidharma as canonical. The Sautrāntika, for instance, held that the canon stopped with the vinaya and sutras. The rejection by some schools that dharmas (i.e. phenomena) are ultimately real, which the Theravada Abhidhamma, for instance, insists, is thought to be an important factor in the origin of the [[Mahayana]].\n\n===Other texts===\nOne early text not usually regarded as [[Buddhavacana]] is probably the ''[[Milinda Panha|Milinda pañha]]'' (literally ''The Questions of Milinda''). This text is in the form of a dialogue between [[Nagasena]], and the [[Indo-Greek Kingdom|Indo-Greek]] King [[Menander I|Menander]] (Pali: Milinda). It is a compendium of doctrine, and covers a range of subjects. It is included in some editions of the Pali Canon.\n\nOther early texts which are usually not considered 'canonical' are the [[Nettipakarana]] and the [[Petakopadesa]] - \"The Book of Guidance\" and \"Instruction on the Pitaka\".\n\nThe [[Dhyāna sutras]] (Chan-jing) are a group of early Buddhist meditation texts which contain meditation teachings from the [[Sarvastivada]] school along with some early proto-Mahayana meditations. They were mostly the work of Buddhist Yoga teachers from [[Kashmir]] and were influential in [[Chinese Buddhism]].\n\nThe Buddhist poet [[Aśvaghoṣa]] composed an epic poem on the life of the Buddha called the ''[[Buddhacarita]]'' in the early second century CE.\n\n== Texts in the Theravada tradition ==\n{{further|Pali literature}}\n[[File:Burmese-Pali Manuscript. Wellcome L0026547.jpg|thumb|Burmese-Pali manuscript copy of the Buddhist text [[Niddesa|Mahaniddesa]], showing three different types of [[Burmese alphabet|Burmese script]], (top) medium square, (centre) round and (bottom) outline round in red lacquer from the inside of one of the gilded covers]] The Pali texts have an extensive [[Atthakatha|commentarial literature]] much of which is still untranslated. These are attributed to scholars working in Sri Lanka such as [[Buddhaghosa]] (5th century CE) and Dhammapala. There are also sub-commentaries (tikka) or commentaries on the commentaries. Buddhaghosa was also the author of the ''[[Visuddhimagga]]'', or ''Path of Purification'', which is a manual of doctrine and practice according to the [[Anuradhapura Maha Viharaya|Mahavihara]] tradition of Sri Lanka and according to [[Nanamoli Bhikkhu]] is regarded as \"the principal non-canonical authority of the Theravada.\"<ref>The Path of Purification (Visuddhimagga) by Bhadantācariya Buddhaghosa. Translated from the Pali. First edition 1956. 3rd ed. 1991.</ref> A similar albeit shorter work is the [[Vimuttimagga]]. Another highly influential Pali Theravada work is the [[Abhidhammattha-sangaha]] (11th or 12th century), a short introductory summary to the Abhidhamma.  \n\nBuddhaghosa is known to have worked from Buddhist commentaries in the Sri Lankan [[Sinhala language]], which are now lost. [[Sri Lankan literature]] in the vernacular contains many Buddhist works, including as classical Sinhala poems such as the ''Muvadevāvata'' (The Story of the Bodhisattva's Birth as King Mukhadeva, 12th century) and the ''Sasadāvata'' (The Story of the Bodhisattva's Birth as a Hare, 12th century) as well as prose works like the ''Dhampiyātuvā gätapadaya'' (Commentary on the Blessed Doctrine), a commentary on words and phrases in the Pāli [[Dhammapada]].\n\nThe Pali textual tradition spread into Burma and Thailand where Pali scholarship continued to flourish with such works as the ''Aggavamsa'' of Saddaniti and the ''[[Jinakalamali]]'' of Ratanapañña.<ref>W. A. R. WOOD; A HISTORY OF SIAM, FROM THE EARLIEST TIMES TO THE A.D. 1781, WITH A SUPPLEMENT DEALING WITH MORE RECENT EVENTS, https://archive.org/stream/historyofsiam035038mbp/historyofsiam035038mbp_djvu.txt</ref> Pali literature continued to be composed into the modern era, especially in Burma, and writers such as [[Mahasi Sayadaw]] translated some of their texts into Pali. \n\nThere are numerous [[Tantric Theravada]] texts, mostly from [[Southeast Asia]].<ref>Cousins, L.S. (1997), \"Aspects of Southern Esoteric Buddhism\", in Peter Connolly and Sue Hamilton (eds.), Indian Insights: Buddhism, Brahmanism and Bhakd Papers from the Annual Spalding Symposium on Indian Religions, Luzac Oriental, London: 185-207, 410. {{ISBN|1-898942-153}}</ref> This tradition flourished in [[Cambodia]] and [[Thailand]] before the 19th century reformist movement of [[Rama IV]]. One of these texts has been published in English by the [[Pali Text Society]] as \"Manual of a Mystic\".<ref>Woodward, F.L. Manual of a mystic, Being a Translation from the Pali and Sinhalese Work Entitled The Yogāvachara's Manual.</ref>\n\nBurmese Buddhist literature developed unique poetic forms form the 1450s onwards, a major type of poetry is the pyui' long and embellished translations of Pali Buddhist works, mainly [[jatakas]]. A famous example of pyui'  poetry  is the Kui khan pyui' (the pyui' in nine sections, 1523). Burmese  commentaries or ''nissayas'' and were used to teach Pali.<ref>Jason A. Carbine; 'Burmese, Buddhist Literature in', ''Encyclopedia of Buddhism''</ref> The nineteenth century saw a flowering of Burmese Buddhist literature in various genres including religious biography, Abhidharma, legal literature and meditation literature.\n\nAn influential text of Thai literature is the \"Three Worlds According to King Ruang\" (1345) by Phya Lithai, which is an extensive Cosmological and visionary survey of the Thai Buddhist universe.\n\n==Mahayana texts==\n{{refimprove-section|date=June 2016}}\n''See [[Mahayana Sutras]] for historical background and a list of some sutras categorised by source.''\n[[File:Jingangjing.jpg|thumb|Frontispiece of the Chinese ''Diamond Sūtra'', the oldest known dated [[Woodblock printing|printed]] book in the world]]\n[[File:Prajnyaapaaramitaa Hridaya Pel.sogd.jpg|thumb|right|[[Sanskrit]] manuscript of the ''Heart Sūtra'', written in the [[Siddhaṃ script]]. [[Bibliothèque nationale de France]]]]\n=== Perfection of Wisdom Texts ===\nThese deal with prajñā ([[wisdom]] or [[insight]]). Wisdom in this context means the ability to see reality as it truly is. They do not contain an elaborate philosophical argument, but simply try to point to the true nature of reality, especially through the use of paradox. The basic premise is a radical non-dualism, in which every and any dichotomist way of seeing things is denied: so phenomena are neither existent, nor non-existent, but are marked by sunyata, emptiness, an absence of any essential unchanging nature. The [[Perfection of Wisdom]] in One Letter illustrates this approach by choosing to represent the perfection of prajñā with the Sanskrit/Pali short ''a'' vowel (\"अ\", pronounced {{IPAblink|ə}})&mdash;which, as a prefix, negates a word's meaning (e.g., changing ''[[svabhava]]'' to ''asvabhava'', \"with essence\" to \"without essence\"; cf. ''[[Mu (negative)|mu]]''), which is the first letter of Indic alphabets; and that, as a sound on its own, is the most neutral/basic of speech sounds (cf [[Om|Aum]] and [[Bīja|bija]]).\n\nMany sutras are known by the number of lines, or slokas, that they contained.\n\n[[Edward Conze]], who translated nearly all of the Perfection of Wisdom sutras into English, identified four periods of development in this literature:\n\n# 100 BCE-100 CE: Ratnagunasamcayagatha and the Astasaharika (8,000 lines)\n# 100-300 CE: a period of elaboration in which versions in 18,000, 25,000, and 100,000 lines are produced. Possibly also the [[Diamond Sutra]]\n# 300-500 CE: a period of condensation, producing the well known [[Heart Sutra]], and the Perfection of Wisdom in one letter\n# 500-1000 CE: texts from this period begin to show a tantric influence\n\nThe Perfection of Wisdom texts have influenced every Mahayana school of Buddhism.\n\n===Saddharma-pundarika===\nAlso called the ''[[Lotus Sutra]]'', ''White Lotus Sutra'', or ''Sutra on the [[Nelumbo nucifera|White Lotus]] of the Sublime Dharma''; (Sanskrit: सद्धर्मपुण्डरीकसूत्र ''Saddharmapundarīka-sūtra''; 妙法蓮華經 Cn: ''Miàofǎ Liánhuā Jīng''; Jp: ''Myōhō Renge Kyō''.\nProbably composed in its earliest form in the period 100 <span style=\"font-variant:small-caps\">bce</span>&ndash;100 <span style=\"font-variant:small-caps\">ce</span>, the sutra proposes that the three [[yana (Buddhism)|yana]]s (Shravakayana, Pratyekabuddhayana, and Bodhisattvayana) are not in fact three different paths leading to three goals, but one path, with one goal. The earlier teachings are said to be of 'skillful means' in order to help beings of limited capacities. Notable for the (re)appearance of the Buddha [[Prabhutaratna]], who had died several aeons earlier, because it suggests that a Buddha is not inaccessible after his parinirvana, and also that his life-span is said to be inconceivably long because of the accumulation of merit in past lives. This idea, though not necessarily from this source, forms the basis of the later [[Trikaya]] doctrine. Later associated particularly with the [[Tien Tai]] in China, [[Tendai]] school in Japan, and the [[Nichiren Buddhism|Nichiren]] schools in Japan.\n\n===Pure Land Sutras===<!-- This section is linked from [[Pure Land Buddhism]] -->\n\nThere are three major sutras that fall into this category: the ''[[Infinite Life Sutra]]'', also known as the ''Larger Pure Land Sutra''; the ''[[Amitabha Sutra]]'', also known as the ''Smaller Pure Land Sutra''; and the ''[[Contemplation Sutra]]'' (also known as the ''Visualization Sutra'').  These texts describe the origins and nature of the Western [[Pure Land]] in which the Buddha [[Amitabha]] resides.  They list the forty-eight vows made by Amitabha as a [[bodhisattva]] by which he undertook to build a Pure Land where beings are able to practise the Dharma without difficulty or distraction. The sutras state that beings can be reborn there by pure conduct and by practices such as thinking continuously of Amitabha, praising him, recounting his virtues, and chanting his name. These Pure Land sutras and the practices they recommend became the foundations of [[Pure Land Buddhism]], which focus on the salvific power of faith in the vows of Amitabha.\n\n===The Vimalakirti Nirdesha Sutra===\n{{main|Vimalakirti Sutra}}\nComposed in its earliest form some time before 150 CE, the Bodhisattva [[Vimalakirti]] appears in the guise of a layman in order to teach the Dharma. Seen by some as a strong assertion of the value of lay practice. Doctrinally similar to the [[Perfection of Wisdom]] texts, a major theme is the Buddhafield (Buddha-kshetra), which was influential on Pure Land schools. Very popular in [[China]], [[Korea]] and [[Japan]] where it was seen as being compatible with [[Confucian]] values.\n\n===Samadhi Sutras===\nAmongst the very earliest Mahayana texts, the Samadhi Sutras are a collection of sutras focused on the attainment of profound states of consciousness reached in meditation, perhaps suggesting that meditation played an important role in early Mahayana. Includes the ''[[Pratyutpanna Sutra]]'' and the ''[[Shurangama Samadhi Sutra]]''.\n\n===Confession Sutras===\nThe ''Triskandha Sutra'', and the ''Suvarnaprabhasa Sutra'' (or ''[[Golden Light Sutra]]''), which focus on the practice of confession of faults. The ''Golden Light Sutra'' became especially influential in Japan, where one of its chapters on the 'Universal Sovereign' (Sanskrit: [[Chakravartin]]) was used by the Japanese emperors to legitimise their rule, and it provided a model for a well-run state.\n\n===The Avatamsaka Sutra ===\n{{main|Avatamsaka Sutra}}\nA large composite text consisting of several parts, most notably the ''[[Dasabhumika Sutra]]'' and the ''[[Gandavyuha Sutra]]''. It exists in three successive versions, two in Chinese and one in Tibetan. New sutras were added to the collection in both the  intervals between these. The ''Gandavyuha Sutra'' is thought to be the source of a sect that was dedicated specifically to [[Vairocana]], and that later gave rise to the ''[[Mahavairocana Tantra|Mahavairocana-abhisambodhi tantra]]''. The ''Mahavairocana-abhisambodhi'' became one of the two central texts in [[Shingon Buddhism]] and was included in the [[Tibetan canon]] as a [[tantra]] of the carya class. The ''[[Avatamsaka Sutra]]'' became the central text for the [[Kegon|Hua-yen]] (Jp. Kegon) school of Buddhism, the most important doctrine of which is the interpenetration of all phenomena.\n\n===Third Turning Sutras===\nThese sutras primarily teach the doctrine of ''vijnapti-matra'' or 'representation-only', associated with the Yogacara school. The ''[[Sandhinirmocana Sutra]]'' (c 2nd Century CE) is the earliest surviving sutra in this class (and according to some [[Gelugpa]] authorities the only one). This sutra divides the teachings of the Buddha into three classes, which it calls the \"Three Turnings of the Wheel of the Dharma.\" To the first turning, it ascribes the ''Agamas'' of the Shravakas, to the second turning the lower Mahayana sutras including the ''Prajna-paramita Sutras'', and finally sutras like itself are deemed to comprise the third turning. Moreover, the first two turnings are considered, in this system of classification, to be provisional while the third group is said to present the final truth without a need for further explication (''nitartha'').\n\n===Tathagatagarbha Class Sutras===\n{{see also|Tathagatagarbha doctrine}}\nEspecially the ''[[Tathagatagarbha Sutra]]'', the ''Shrīmālādevi-simhanāda Sūtra'' (''[[Srimala Sutra]]''), the ''[[Angulimaliya Sutra]]'', the ''[[Anunatva-Apurnatva-Nirdesa]] Sutra'', and the ''[[Mahayana Mahaparinirvana Sutra]]'' (which differs in character from the [[Pāli|Pali]] ''[[Mahaparinibbana Sutta]]''). These texts teach that every being has a Tathagatagarbha: variously translated as [[Buddha nature]], Buddha seed, Buddha matrix. It is this Buddha nature, Buddha Essence or Buddha Principle, this aspect of every being that is itself already enlightened, that enables beings to be liberated. One of the most important responses of Buddhism to the problem of immanence and transcendence. The Tathagatagarbha doctrine was very influential in East Asian Buddhism, and the idea in one form or another can be found in most of its schools.\nThe well-known ''[[Lankavatara Sutra]]'', composed sometime around the 4th century, is sometimes included in the''vijnapti-matra'' group associated with the [[Yogacara|Yogacara teachings]], however [[D.T. Suzuki]] sees the ''Lankavatara'' as clearly pre-dating and distinguished from Yogacara.<ref>''Studies in the Langavatara Sutra'', by D.T. Suzuki, Routledge & Kegan Paul Ltd., London, 1930, p. 170</ref> The ''Lankavatara'' teaches ''cittamatra'' (mind only) not that of ''vijnaptimatra'' of the Yogacara.{{refn|group=note|\"The difference is this: According to the Vijnaptimatra, the world is nothing but ideas, there are no realities behind them; but the Cittamatra states that there is nothing but Citta, Mind, in the world and that the world is the objectification of Mind. The one is pure idealism and the other idealistic realism.\" ''The Lankavatara  Sutra, A Mahayana Text'', Routledge & Kegan Paul Ltd., London, 1932, introduction p. xi.}} Also, central to the Lankavatara is the identity of the ''[[alaya]]vjnana'' with the ''tathagata-garbha'' and the ''Lankavatara'''s central message that the ''tathagata-garbha'' is what makes possible the turning inward (''paravritti'' or ''paravrtti'') of awareness to realize the Buddha's psychological transformation in practical life,<ref>''The Lankavatara  Sutra, A Mahayana Text\", Routledge & Kegan Paul Ltd., London, 1932, introduction p. xvii.</ref> while the ''tathagata-garbha'' system was unknown or ignored by the progenitors of the Yogacara system. The ''Lankavatara Sutra'' was influential in the [[Zen|Chan]] or [[Zen]] schools.\n\n===Collected Sutras===\nThese are two large sutras, which are actually collections of other sutras. The [[Mahāratnakūta Sūtra]] contains 49 individual works, and the [[Mahāsamnipāta Sūtra]] is a collection of 17 shorter works. Both seem to have been finalised by about the 5th century, although some parts of them are considerably older.\n\n===Transmigration Sutras===\nThese include a number of sutras that focus on actions that lead to existence in the various spheres of existence, or that expound the doctrine of the twelve links of [[pratitya-samutpada]] or [[dependent-origination]].\n\n===Discipline Sutras===\nThese focus on the principles that guide the behaviour of Bodhisattvas. They include the [[Kāshyapa-parivarta]], the [[Bodhisattva-prātimoksa Sūtra]], and the [[Brahmajala Sutra]].\n\n===Sutras devoted to individual figures===\nThis is a large number of sutras that describe the nature and virtues of a particular Buddha or Bodhisattva and/or their Pure Land, including [[Mañjusri]], [[Ksitigarbha]], the Buddha [[Five Wisdom Buddhas|Akshobhya]], and [[Bhaishajyaguru]] also known as the [[Medicine Buddha]].\n\n===Proto-Mahayana Sutras===\nEarly in the 20th Century, a cache of texts was found in a mound near [[Gilgit, Afghanistan]]. Among them was the ''[[Ajitasena Sutra]]''. The ''Ajitasena Sutra'' appears to be a mixture of Mahayana and pre-Mahayana ideas. It occurs in a world where monasticism is the norm, which is typical of the Pali Suttas; there is none of the usual antagonism towards the Shravakas (also called the Hinayana) or the notion of Arahantship, which is typical of Mahayana Sutras such as the ''White Lotus'', or ''Vimalakirti Nirdesha''. However, the sutra also has an Arahant seeing all the Buddha fields, it is said that reciting the name of the sutra will save beings from suffering and the hell realms, and a meditative practice is described that allows the practitioner to see with the eyes of a Buddha, and to receive teachings from them that are very much typical of Mahayana Sutras.\n\n===Non-Buddhavacana texts===\nThe Mahayana commentarial and exegetical literature is vast. Many commentarial texts are called [[Shastras]], a by-word used when referring to a scripture. Extending this meaning, the ''shastra'' is commonly used to mean a treatise or text written in explanation of some idea, especially in matters involving religion. In [[Buddhism]], a ''shastra'' is often a commentary written at a later date to explain an earlier scripture or [[sutra]].\n\nThe ''[[Mulamadhyamakakarika|Mūlamadhyamika-karikā]]'', or Root Verses on the Middle Way, by [[Nagarjuna]] is a seminal text on the [[Madhyamika]] philosophy, shares much of the same subject matter as the Perfection of Wisdom Sutras, although it is not strict a commentary on them.\n\nThe 9th Century Indian Buddhist [[Shantideva]] produced two texts: the ''[[Bodhicaryāvatāra]]'' has been a strong influence in many schools of the Mahayana. It is notably a favorite text of the fourteenth Dalai Lama. The text begins with an elaborate ritual worship section, but goes on to expound the six perfections. The 9th chapter is a critique of various views on perfect wisdom from the Madhyamika point of view. Shantideva also produced the Shikshasamuccaya, which is a compendium of doctrines from a huge range of Mahayana Sutras &ndash; some of which no longer exist and therefore are known only through his quotes.\n\n[[Asanga]], associated with the [[Yogacara]] school of Mahayana thought, is said to have received many texts directly from the Bodhisattva Maitreya in the Tushita god realm, including ''[[Madhyāntavibhāga]]'', the ''[[Mahāyāna-sūtrālamāra]]'', and the ''[[Abhisamayālamkara]]''. He is also said to have personally written the ''[[Mahāyāna-samgraha]]'', the ''[[Abhidharma-samuccaya]]'' (a compendium of [[Abhidharma]] thought that became the standard text for many Mahayana schools especially in Tibet), and the ''[[Yogācāra-bhūmi]]'' (although the latter text appears to have had several authors.)\n\nAsanga's brother [[Vasubandhu]] wrote a large number of texts associated with the Yogacara including: ''[[Trivabhāva-nirdesha]]'', ''[[Vimshatika]]'', ''[[Trimshika]]'', and the ''[[Abhidharmakośa-bhāsya]]'' although this work predates his conversion to the Mahayana and a minority{{Citation needed|date=February 2008}} of scholars speculate that there may have been two different Vasubandhus who composed these works. Most influential in the [[East Asian Buddhist]] tradition was probably his [[Thirty Verses on Consciousness-only]].\n\n[[Dignaga|Dignāga]] is associated with a school of [[Buddhist logic]] that tried to establish which texts were valid sources of knowledge (see also [[Epistemology]]). He produced the ''[[Pramāna-samuccaya]]'', and later [[Dharmakirti]] wrote the ''[[Pramāna-vārttikā]]'', which was a commentary and reworking of the Dignaga text.\n\n''The [[Awakening of Faith in the Mahayana]]'' attributed to [[Ashvaghosha]] was influential in East Asian Buddhism, especially the [[Huayan school|Hua-yen]] school of [[China]], and its [[Japan]]ese equivalent, Kegon. Ashvaghosha is also celebrated for his plays.\n\n===East Asian works===\n[[File:Korea-Haeinsa-Tripitaka Koreana-01.jpg|thumb|right|The Tripiṭaka Koreana, an early edition of the Chinese Buddhist canon]]\nThe early period of the development of [[Chinese Buddhism]] was concerned with the collection and translation of texts into Chinese and the creation of the [[Chinese Buddhist canon]]. This was often done by traveling overland to [[India]], as recorded in the [[Great Tang Records on the Western Regions]], by the monk [[Xuanzang]]. East Asian Buddhism began to develop its own unique literature with the rise of the [[Tiantai]] School and its major representative, [[Zhiyi]] (538–597 CE) who wrote important commentaries on the [[Lotus sutra]] as well as the first major comprehensive work on meditation composed in China, the [[Mohe Zhiguan]] (摩訶止観). Another important school of Chinese Buddhism is [[Huayan]], which focused on developing their philosophical texts from the [[Avatamsaka Sutra]]. An important patriarch of this school is [[Fazang]] who wrote many commentaries and treatises. \n\n[[Zen Buddhism]] developed a [[Zen_and_Sutras#Zen_literature|large literary tradition]] based on the teachings and sayings of Chinese Zen masters. One of the key texts in this genre is the ''[[Platform Sutra]]'' attributed to [[Zen]] patriarch [[Huineng]], it gives an autobiographical account of his succession as [[Ch'an]] Patriarch, as well as teachings about Ch'an theory and practice. Other texts are Koan collections, which are compilations of the sayings of Chinese masters such as the ''[[Blue Cliff Record]]'' and ''[[The Gateless Gate]]''. Another key genre is that of compilations of Zen master biographies, such as the ''[[Transmission of the Lamp]]''. Buddhist poetry was also an important contribution to the literature of the tradition. \n\nAfter the arrival of Chinese Buddhism in Japan, Korea and Vietnam; they developed their own traditions and literature in the local language.\n\n==Vajrayana texts==\n{{refimprove-section|date=June 2016}}\n[[File:Thar pa chen po’i mod = Sūtra of great liberation..JPG|thumb| Image of leaves and the upper book cover of Thar pa chen po’i mod (The Sūtra of Great Liberation), showing Tibetan writings on black paper with an ink that contain gold, silver, copper, coral, lazurite, malachite, and mother of pearl. The unbound sheets are kept between two wooden boards covered with green brocade. The upper book cover shows the images of four of the Eight Medicine Buddhas.]]\n===Buddhist tantras===\n{{Main article|Buddhist Tantras}}\nThe [[Tibetan Buddhist canon]] includes a number of [[Nikaya]]-related texts from the Mula-[[Sarvastivada]] school, as well as [[Mahayana sutras]]. However, it is the specifically [[Vajrayana]] texts that most strongly characterise it. They are considered to be the word of the Buddha ([[Buddhavacana]]), and the Tibetan Kangyur contains translations of almost 500 [[tantra]]s. The texts are typically concerned with elaborate rituals and meditations.\n\nA late Tibetan tradition has made a fourfold classification into:\n\n====Kriyā Tantras====\n'''Kriyā tantras'''. These form a large subgroup that appeared between the 2nd and 6th centuries. The Kriya tantras focus on ritual actions. Each centres on a particular [[list of Buddhas|Buddha]] or [[Bodhisattva]], and many are based on [[dharani]]s. Examples include the ''Mahāmegha Sutra'', the ''Ārya-mañjushrī-mūla-kalpa'', the ''Subhāhu-pariprcchā Sutra'', and the ''Aparimitāyur-jñāna-hrdaya-dhāranī''. Also included in this category are some Mahayana texts such as the ''[[Heart Sutra]]'' and, in some editions, versions of some texts found in the [[Pali Canon]].\n\n====Charya Tantras====\n'''Carya tantras'''. This is a small class of texts that probably emerged after the 6th century and are entirely centred on the worship of the Buddha [[Vairocana]]. The best known example is the ''Mahā-vairocanābhisambodhi Tantra'', also known as the [[Mahavairocana Sutra]], which became a foundational text for the [[Shingon Buddhism|Shingon]] School of [[Japan]].\n\n====Yoga Tantras====\n'''Yoga tantras''' likewise focus on [[Vairocana]], and include the ''Sarva-tathāgata-tattva-samgraha Tantra''  and the ''Sarva-durgati-parishodhana Tantra''.  The [[Shurangama Sutra]] and the [[Shurangama Mantra]] from which it (called the [[Shitatapatra]] [[Ushnisha]] [[Dharani]]) comes can be included in this category. According to Venerable [[Tripitaka]] Master [[Bhikshu]] [[Shramana]] [[Hsuan Hua]]'s \"Shurangama Mantra Commentary\" ([[Buddhist Text Translation Society]] of the [[City of Ten Thousand Buddhas]], 1981, Volume 1), the Shurangama Mantra mystically and literally includes all of the Buddha Dharma in its entirety, and its focus is on the Five Dhyana Buddhas ([[Vairochana]], [[Amitabha]]), [[Akshobhya]], [[Ratnasambhava]], and [[Amoghasiddhi]], with stress on Vairochana and Ashobhya Buddhas) and their retinues of [[Dharmapalas]] and wrathful deities in male and female forms, such as [[Vajrapani]], wrathful [[Manjushri]], [[Mahakala]], [[Tara (Buddhism)|Tara]], [[Pandaravasini]], [[Prakruti]], [[Uchushma]] Fire Head Vajra, [[Brahma]], [[Indra]], [[Shiva]] as [[Rudra]], [[Raudri]]-[[Parvati|Umapati]] form of [[Vajrayogini]], [[Narayana]],  [[Ganapati]], various [[Dhakinis]], [[Naga people|Naga]] kings, [[Yaksha]] kings, [[Rakshasha]] kings, and many other Dharma Protectors of the [[Buddhist Pantheon]] and [[Vedic]] pantheon.  The primary wrathful [[Goddess]] of the Shurangamma Mantra tantric practice is the Great [[Shitatapatra|White Umbrella Deity]] form of [[Avalokiteshvara]] Bodhisattva, an important practice in Tibetan Buddhism.\n\n====Anuttara Tantras====\n'''Anuttara tantras'''. The most advanced class of tantra is the [[Anuttarayoga tantra]], which focus on mental transformation and less on ritual actions. These are sometimes further divided into the so-called Father Tantras and Mother Tantras.\n\n*First there are the ''yogottara'', or higher union, tantras, also known as father tantras, or  skilful means, ([[Sanskrit]]: ''[[upāya]]'') tantras. They focus on the Buddha [[Five Wisdom Buddhas|Akshobhya]] and his consort [[Mamaki|Māmaki]]. The ''[[Guhyasamāja tantra|Guhya-samāja Tantra]]'' comes from this class of tantras, dating probably from the 8th century.\n*Secondly ''[[prajña]]'' or ''mother tantras'', also known as yogini tantras, dating from the late 8th century. [[Akshobhya]] is still the central figure, but he now appears in his [[wrathful deities|wrathful form]] as [[Heruka]]. Female figures take on a much greater significance, becoming as important as male figures, if not more so. The ''Samvara Tantra'' was translated into Tibetan in the 8th century. Other members of this class, such as the ''[[Hevajra]] Tantra'', appeared in the 10th century.\n*The ''[[Kalachakra]] tantra'' is sometimes said to be an advaya or non-dual tantra. It appeared very late in the development of tantric Buddhism - in the mid-11th century - and is written in classical [[Sanskrit]], rather than the usual mixture of [[Prakrit]] and the characteristic \"allusive speech\" of [[twilight language]], (Sanskrit:''samdhyābhāshā'').  For the first time the teachings refer to the ādhibuddha, or [[primordial Buddha]].\n\nAnuttaratantra is known in the [[Nyingma]] school as Mahayoga. This school also has a collection of tantras of its own, not found in the other Tibetan schools.\n\nTextual evidence suggests that some of these texts are in fact [[Hinduism|Shaivite]] Tantras adopted and adapted to Buddhist purposes, and many similarities in iconography and ritual can be seen in them.{{Citation needed|date=September 2008}}\n\n===Other products of the Vajrayana literature===\nA [[sadhana]] is a [[vajrayana|tantric]] spiritual practices text used by practitioners, primarily to practice the [[mandala]] or a particular [[yidam]], or meditation deity. The ''Sādhanamālā'' is a collection of sadhanas.\n\n[[Vajrayana]] adepts, known as [[mahasiddha]], often expounded their teachings in the form of [[songs of realization]]. Collections of these songs such as the ''Caryāgīti'', or the [[Charyapada]] are still in existence. The ''Dohakosha'' is a collection of ''doha'' songs by the [[yogi]] [[Saraha]] from the 9th century. A collection known in English as ''The Hundred Thousand Songs of Milarepa'' was composed by [[Tibetan Buddhist]] yogi [[Milarepa]] and is especially popular amongst members of the [[Kagyu]] school.\n\n''Terma'' are [[Tibetan Buddhist]] texts, hidden to be rediscovered at a later date. [[Padmasambhava]] and [[Yeshe Tsogyal]] wrote and hid most [[terma (Buddhism & Bon)|terma]]s, although texts have also been hidden by figures such as [[Machig Labdron]]. The best known terma text is probably the ''Bardo thodol'', or 'Awakening in the [[Bardo]] State', also known as the [[Tibetan Book of the Dead]]. The person who finds a terma text is known as a [[terton]].\n\nThe ''[[Blue Annals]]'' ({{lang-bo|deb ther sngon po}}) completed in 1476<small>CE</small>, authored by [[Gölo Zhönnupel]] (Tibetan: ''gos lo gzhon nu dpal'', 1392–1481), is a historical survey of [[Tibetan Buddhism]] with a marked [[ecumenical]] view, focusing upon the dissemination of various sectarian traditions throughout [[Tibet]].<ref>Source:  [https://web.archive.org/web/20090210175520/http://thdl.org/collections/history/blueannals/index.html the Tibetan and Himalayan Library] (accessed: November 5, 2007)</ref>\n\n[[Namtar (biography)|Namtar]], or spiritual biographies, are another popular form of [[Tibetan Buddhist]] texts, whereby the teachings and spiritual path of a practitioner are explained through a review of their lifestory.\n\n[[Kūkai]] wrote a number of treatises on [[Vajrayana]] Buddhism that are distinct from his [[Shingon Buddhism]].\n\n==See also==\n{{refbegin|2}}  \n* [[Abhidharma Pitaka]]\n* [[Āgama (Buddhism)]]\n* [[Buddhavacana]]\n* [[Chinese Buddhist canon]]\n* [[Gandharan Buddhist Texts]], the earliest known Buddhist manuscripts\n* [[List of historic Indian texts]]\n* [[List of suttas]]\n* [[Mahayana Sutras]]\n* [[Pali Canon]]\n* [[Sutra]]\n* [[Sutta Pitaka]]\n* [[Tibetan Buddhist canon]]\n* [[Timeline of Buddhism]]\n* [[Tripiṭaka Koreana]]\n* [[Vinaya Pitaka]]\n* [[Sanskrit Buddhist literature]]\n* [[Yana (Buddhism)|Yana]], Buddhist schools into \"yanas\" or \"vehicles\"\n{{refend}}\n\n==Notes==\n{{reflist|group=note|2}}\n\n==References==\n{{Reflist|2}}\n\n===Bibliography===\n* ''The Rider encyclopedia of eastern philosophy and religion''. London, Rider, 1989.\n* Nakamura, Hajime. 1980. ''Indian Buddhism: A Survey with Bibliographical Notes''. 1st edition: Japan, 1980. 1st Indian Edition: Delhi, 1987. {{ISBN|81-208-0272-1}}\n* Skilton, Andrew. ''A concise history of Buddhism''. Birmingham, Windhorse Publications, 1994.\n* [[A. K. Warder|Warder, A. K.]] 1970. Indian Buddhism. Motilal Banarsidass, Delhi. 2nd revised edition: 1980.\n* Williams, Paul. ''Mahayana Buddhism : the doctrinal foundations''. London, Routledge, 1989.\n* Zürcher, E. 1959. ''The Buddhist Conquest of China: The Spread and Adaptation of Buddhism in early Medieval China''. 2nd edition. Reprint, with additions and corrections: Leiden, E. J. Brill, 1972.\n* Susan Murcott. ''The First Buddhist Women'' Translations and Commentary on the Therigatha, 1991.\n\n==External links==\n*[http://dharmanet.org/learning.htm Online Dharma Libraries]\n*[http://www.cttbusa.org/cttb/btts.asp The Buddhist Text Translation Society]\n*[http://www.accesstoinsight.org/tipitaka/index.html Pali Canon] in English translation (incomplete).\n*[http://mbingenheimer.net/tools/bibls/transbibl.html Bibliography of Translations from the Chinese Buddhist Canon]\n*[http://thecompassionnetwork.org/tripitaka-lists/ Buddhist Canonical Text Titles and Translations in English]\n*[https://web.archive.org/web/20040406214720/http://www.accesstoinsight.org/canon/postcanon.html Beyond the Tipitaka: A Field Guide to  Post-canonical Pali Literature]\n*[http://faculty.washington.edu/kpotter/ckeyt/home.htm Bibliography of Indian Philosophy], Karl Potter; includes lists of available translations and known or estimated dates of composition of many Buddhist sutras.\n*[http://www.budsas.org/ebud/ebsut055.htm How old is the Suttapiṭaka? The relative value of textual and epigraphical sources for the study of early Indian Buddhism] by Alexander Wynne, St John's College, Oxford University, 2003.\n*[http://mahavamsa.org History of early Buddhism in Sri Lanka, The Mahawansa]\n\n{{Buddhism topics}}\n\n{{Authority control}}\n\n{{DEFAULTSORT:Buddhist Texts}}\n[[Category:Buddhist texts| ]]",
            "slug": "buddhist-texts",
            "date_updated": 1531838290100,
            "imported": "https://en.wikipedia.org/wiki/Buddhist_texts"
        }
    ]
}