{
    "article": [
        {
            "title": "Faith_in_Buddhism",
            "text": "{{short description|Important element of the teachings of the Buddha}}\n{{about|the mental quality of faith in Buddhism|a description of Buddhist devotional practices|Buddhist devotion}}\n{{good article}}\n{{Use Oxford English|date=June 2017}}\n[[File:九天禅院 释迦牟尼佛.jpg|alt=Buddha image, with images of two disciples at the sides.|thumb|The disciple [[Ananda|Ānanda]] (at left) is the traditional example of the faithful disciple of the Buddha.|upright=1.2]]\n{{Buddhist term|title=''Faith''\n|pi=saddhā\n|sa=śraddhā\n|si=[[:si:ශ්‍රද්ධ|ශ්‍රද්ධ]]\n|bo=དད་པ\n| bo-Latn=[[Wylie transliteration|Wylie]]: dad pa<br />[[THL Simplified Phonetic Transcription|THL]]: dat pa\n|bn=শ্রাদ্ধের\n|bn-Latn=shraddher\n|zh=[[:zh:信|信]](T&S)\n|zh-Latn=xìn\n|ja=[[:ja:信|信]]\n|ja-Latn=shin\n|ko=[[:ko:믿음|믿음]]\n|ko-Latn=sin-eum\n|vi=[[:vi:Đức tin|đức tin]]\n|th=[[:th:ศรัทธา|ศรัทธา]]\n|th-Latn=satthaa\n}}\n\nIn [[Buddhism]], '''faith''' ({{lang-pi|saddhā|italic=yes}}, {{lang-sa|śraddhā|italic=yes}}) refers to a serene commitment to the practice of [[Gautama Buddha|the Buddha]]'s teaching and trust in enlightened or highly developed beings, such as [[Buddha (title)|Buddhas]] or ''[[bodhisattvas]]'' (those aiming to become a Buddha). Buddhists usually recognize multiple objects of faith, but many are especially devoted to one in particular, such as one particular Buddha. Faith may not only be devotion to a person, but exists in relation to Buddhist concepts like the efficacy of [[karma (Buddhism)|karma]] and the possibility of [[enlightenment (Buddhism)|enlightenment]].\n\nFaith in [[early Buddhism]] focused on the [[Triple Gem]], that is, the Buddha; his teaching (the [[Dharma (Buddhism)|dharma]]); and finally, the community of spiritually developed followers or the monastic community seeking enlightenment (the [[saṅgha]]). A faithful devotee was called an [[upasaka and Upasika|''upāsaka'' or ''upāsika'']], a status for which no formal initiation was required. Early Buddhism valued personal verification of spiritual truth highest in attaining such truth, and considered sacred scriptures, reason or faith in a teacher less valuable sources of authority. As important as faith was, it was merely a first step on the path to [[Paññā|wisdom]] and [[enlightenment (Buddhism)|enlightenment]], and was made obsolete or redefined at the final stage of that path. Early Buddhism did not morally condemn peaceful offerings to [[deva (Buddhism)|deities]]. Throughout the history of Buddhism, the worship of deities, often from pre-Buddhist and [[animism|animist]] origins, was [[cultural appropriation|appropriated]] or transformed into Buddhist practices and beliefs. As part of this process, such deities were explained as subordinate to the Triple Gem, which still kept a central role.\n\nIn the later stratum of Buddhist history, especially in [[Mahāyāna Buddhism]], faith was given a much more important role. Mahāyāna developed the concept of the [[Buddha Nature]], as devotion to Buddhas and ''bodhisattvas'' residing in [[Pure Land]]s became commonplace. With the rise of the cult of the [[Lotus Sūtra]], faith gained a central role in Buddhist practice, and the development of devotion to the [[Amitābha Buddha]] in [[Pure Land Buddhism]] further amplified this trend. The Japanese form of Pure Land Buddhism, under the teachers [[Hōnen]] and [[Shinran]], believed that only [[shinjin|entrusting faith]] toward the Amitābha Buddha was a fruitful form of practice, as it dismissed celibacy, meditation and other Buddhist practices as no longer effective, or as contradicting the virtue of faith. Pure Land Buddhists defined faith as a state similar to enlightenment, with a sense of self-negation and humility. The impact of faith in Buddhist religiosity became pivotal in [[millenarianism|millenarian]] movements in several Buddhist countries, which sometimes resulted in the destruction of royal dynasties and other important political changes.\n\nThus, the role of faith increased throughout Buddhist history. However, from the nineteenth century onward, in countries like Sri Lanka and Japan, and also in the West, [[Buddhist modernism]] has downplayed and criticized the role of faith in Buddhism. Faith in Buddhism still has a role in modern Asia and the West, but is understood and defined differently from traditional interpretations, with modern values and [[eclecticism]] becoming more important.  The [[Dalit Buddhist movement|''Dalit'' Buddhist]] community, specifically the [[Navayāna]] movement, has interpreted Buddhist concepts in the light of the political situation of the ''Dalits'', in which there is tension between modernist rationalism and local devotion.\n\n== Role in Buddhist teaching ==\n\nFaith is defined as serene trust <!--both refs--> that the practice of the Buddha's teaching will bring fruit.<!--Gomez-->{{sfn|Gómez|2004b|p=277}}{{sfn|Buswell|Lopez|2013|loc=Śraddhā}} It is trust and surrender to enlightened or highly developed beings, such as Buddhas or ''[[bodhisattva]]s'',<!--Gomez--> or even certain highly respected [[Bhikkhu|monks]] or [[lama]]s<!--Kinnard--> sometimes seen as living Buddhas.<!--Melton-->{{sfn|Gómez|2004b|p=277}}{{sfn|Kinnard|2004|p=907}}<ref>{{cite encyclopedia|last1=Melton|first1=J. Gordon|authorlink1=J. Gordon Melton|editor1-last=Melton|editor1-first=J. Gordon|editor2-first=Martin|editor1-link=J. Gordon Melton|editor2-last=Baumann|encyclopedia=Religions of the world: a comprehensive encyclopedia of beliefs and practices|title=Relics|date=2010|publisher=[[ABC-CLIO]]|location=Santa Barbara, California|isbn=978-1-59884-204-3|url=http://ebook.umaha.ac.id/E-BOOK%20OF%20RELIGIOUS%20STAUDIES/ENCYCLOPEDIAS%20_%20DICTIONARY/RELEGIONS%20OF%20THE%20WORLD,%20A%20COMPREHENSIF%20ENCYCLOPEDIA.pdf|archive-url=https://www.webcitation.org/6vAE2WMY7?url=http://ebook.umaha.ac.id/E-BOOK%20OF%20RELIGIOUS%20STAUDIES/ENCYCLOPEDIAS%20_%20DICTIONARY/RELEGIONS%20OF%20THE%20WORLD%2C%20A%20COMPREHENSIF%20ENCYCLOPEDIA.pdf|archive-date=22 November 2017|dead-url=no|page=2392|edition=2nd|df=}}</ref> Buddhists usually recognize multiple objects of faith, but many are especially devoted to one particular object of faith, such as one particular Buddha.{{sfn|Gómez|2004b|p=277}} Buddhism has, however, never been organized around one central authority, neither as a person or a scripture. Scriptures have usually acted as guidance, and consensus about practices has come about through debate and discussion.{{sfn|Nakamura|1997|page=392}}\n\nSeveral terms are used in Buddhism for faith, which have both cognitive and affective aspects:{{sfn|Buswell|Lopez|2013|loc=Śraddhā}}\n* ''Śraddhā'' ([[Sanskrit]]; {{lang-pi|saddhā|italics=yes}}; [[classical Chinese]]: ''wen-hsin'') refers to a sense of commitment to or trust in someone else, or a sense of engagement and commitment to practise.{{sfn|Gómez|2004b|p=277}}{{sfn|Jayatilleke|1963|pp=388–9}} Traditional examples of this are the monks [[Ananda|Ānanda]],<!--Conze only supports this part--> the attendant of Gautama Buddha, and Vakkali, another disciple. ''Śraddhā'' is often seen as the counteragent of ill-will in the mind.{{sfn|Buswell|Lopez|2013|loc=Ānanda, Pañcabala, Śraddhā}}{{sfn|Conze|2003|page=14}} The opposite of ''śraddhā'' is ''āśraddhya'', which refers to the lack of capacity to develop faith in a teacher and the teachings, and therefore being unable to develop energy on the spiritual path.{{sfn|Buswell|Lopez|2013|loc=Āśraddhya}} The word ''śraddhā'' originates from the roots ''śrat'', \"to have conviction\", and ''dhā'', \"to uphold\",{{refn|group=note|Some scholars disagree with these glosses, however. Also, in the [[Veda]]s ''śraddhā'' is understood as an \"attitude of mind based on truth\".{{sfn|Rotman|2008|loc=Footnotes n.23}}}} and thus, according to religious studies scholar Sung-bae Park, indicates \"sustaining confidence, remaining steadfast, or supporting trust, in the sense of abiding firmly\".{{sfn|Park|1983|page=15}}\n* ''Prasāda'' ([[Sanskrit]]; {{lang-pi|pasāda|italics=yes}}; [[classical Chinese]]: ''ching-hsin'') is more affective than ''śraddhā''. Being used with regard to rituals and ceremonies, it refers to a sense of serene acceptance of the blessings and greatness of the object of one's devotion.{{sfn|Gómez|2004b|p=278}} The word ''prasāda'' derives from the prefix ''pra'' and the root ''sād'', which mean \"to sink down, to sit\", and is defined by Park as \"being firmly seated in a state of clearness and tranquility\".{{sfn|Park|1983|page=15}} Thus, ''prasāda'' refers to the focus of the devotee's mind, its commitment and its heightened quality.{{sfn|Findly|2003|page=200}} It is described in more spontaneous terms than ''śraddhā''.{{sfn|Rotman|2008|loc=Seeing and Knowing}}\n\nFaith is usually related to the [[Triple Gem]], that is the Buddha, the [[Dharma (Buddhism)|dharma]] (his teaching) and the [[sangha|saṅgha]] (the community). Thus, faith may often have certain individuals as its object, but is different from devotion in other Indian religions (''[[bhakti]]'') in that it is connected with impersonal objects such as the working of karma and the efficacy of [[merit transfer]].{{sfn|Rotman|2008|loc=Seeing and Knowing, Getting and Giving}} It is seen to focus on or lead to a [[right view]] or understanding of the main aspects of the Buddha's teaching, such as the working of [[karma (Buddhism)|karma]], [[merit (Buddhism)|merit]] and [[Rebirth (Buddhism)|rebirth]].{{sfn|Buswell|Lopez|2013|loc=Śraddhā, Mūrdhan, Pañcabala, Xinxin}}{{sfn|Conze|2003|p=78}}{{sfn|Findly|2003|p=203}} Regarding the Triple Gem, faith focuses on and rejoices in the characteristics of the Buddha, the dharma and the saṅgha.{{sfn|Barua|1931|pages=332–3}} With regard to the working of karma, faith refers to a conviction that deeds have effects, good deeds having positive effects, and wrong deeds negative.{{sfn|Findly|2003|pp=205–6}} Thus, faith gives guidance in leading a life of charity, morality and religious qualities.{{sfn|Barua|1931|page=333}} Faith also covers ideas such as the nature of existence, its [[Anicca Dukkha Anatta|impermanence and conditioned nature]], and finally, the Buddha's [[enlightenment (Buddhism)|enlightenment]] or [[Nirvana]] and the path of practice leading up to Nirvana.{{sfn|Buswell|Lopez|2013|loc=Śraddhā, Mūrdhan, Pañcabala, Xinxin}}{{sfn|Conze|2003|p=78}}{{sfn|Findly|2003|p=203}} Faith entails a belief that there are people who have attained Nirvana and are able to teach it.{{sfn|Robinson|Johnson|1997|page=35}}\n\n== History ==\n[[Hajime Nakamura]] distinguishes two currents in Buddhism, which he describes as the devotional approach and the approach of \"inner knowledge\".{{sfn|Nakamura|1997|p=392}} Anthropologist [[Melford Spiro]] discusses ''[[bhakti#Buddhism|bhakti]]'' (devotion) on the one hand and ''[[magga]]'' (the path to deliverance) on the other hand.{{sfn|Spiro|1982|p=34 n.6}} In Buddhism, in the development of the understanding of faith, two historical layers can be distinguished: early Buddhism and the later Mahāyāna Buddhism. Some early twentieth-century scholars, such as [[Louis de La Vallée-Poussin]], [[Arthur Berriedale Keith]] and [[Caroline Rhys Davids]], have been criticized by Sri Lankan scholars for not distinguishing the two sufficiently.{{sfn|Suvimalee|2005|p=601}}{{sfn|Jayatilleke|1963|pp=384–5}}\n\n=== Early Buddhism ===\n\n{{Main|Early Buddhism}}\nIn early Buddhist texts, such as [[Pāli]] texts, ''saddhā'' is usually translated as \"faith\", but with a different connotation than the English word.{{sfn|De Silva|2002|p=214}} It is sometimes also translated as \"confidence\", as in  confidence in doctrine.{{sfn|Findly|2003|p=203}}{{sfn|Gombrich|1995|pages=69–70}} Faith in early Buddhism, in the words of scholar John Bishop, is essentially \"religious without being theistic\".<ref>{{cite encyclopedia|url=https://plato.stanford.edu/entries/faith/|archive-url=https://www.webcitation.org/6vADVlHDt?url=https://plato.stanford.edu/entries/faith/|archive-date=22 November 2017|dead-url=no|encyclopedia=The Stanford Encyclopedia of Philosophy|edition=Winter 2016|title=Faith|date=30 March 2016|access-date=17 August 2017|first=John|last=Bishop|editor-first=Edward N.|editor-last=Zalta|publisher=Metaphysics Research Lab, [[Stanford University]]|df=}}</ref> It does not [[theocentrism|focus on a God as the centre of the religion]].{{sfn|Gombrich|1995|page=71}} As opposed to [[Vedic Brahmanism]], which preceded Buddhism, early Buddhist ideas of faith are more connected with the teachings that are learnt and practised, rather than focused on an outward deity.{{sfn|Findly|1992|p=258}} This does not mean that Buddhism's approach of reality had not been influenced by other traditions: at the time when Buddhism arose, several Indian religious communities taught a critical approach in understanding the truth.{{sfn|Jayatilleke|1963|page=277}}\n\nFaith is not just a mental commitment to a set of principles,{{sfn|Lamotte|1988|pp=74–5}} but also has an affective quality.{{sfn|Buswell|Lopez|2013|loc=Śraddhā}}{{sfn|Werner|2013|page=45}} Scholars in early Buddhism distinguish between faith as [[Pīti|joy]] and serenity, raising the mind to a higher level;{{sfn|Werner|2013|page=45}} and\nfaith as an [[Vīrya|energy]] producing self-confidence,<!--Buswell--> required for dealing with temptations and for self-mastery.<!--De Silva-->{{sfn|Buswell|Lopez|2013|loc=Śraddhā}}{{sfn|De Silva|2002|p=216}} Because faith helps remove perplexity, it inspires and gives energy to the devotee.{{sfn|Barua|1931|page=332}}\n\nA Buddhist thus aspires to faith in the Triple Gem, that is, the Buddha, the [[Dharma (Buddhism)|dharma]] and the saṅgha, as well as the value of discipline. In early Buddhist texts, however, faith does not mean a hostile response or lack of recognition of other deities. Although the Buddha refutes the bloody sacrifice of animals, he does not in itself condemn peaceful offerings to deities, but considers those far less useful than alms offerings to the monastic saṅgha.<ref>{{cite journal|last=Giustarini|first=G.|year=2006|archive-url=https://web.archive.org/web/20140918115715/http://www.fupress.net/index.php/rss/article/view/2451/2286|url=http://www.fupress.net/index.php/rss/article/view/2451/2286|archive-date=18 September 2014|title=Faith and renunciation in Early Buddhism: ''saddhā'' and ''nekkhamma''|journal=Rivista di Studi Sud-Asiatici|issue=I|p=162}}</ref>{{sfn|Lamotte|1988|pp=74–5}} Thus, everything is given its place in a hierarchy of usefulness, in which moral behavior is much more highly regarded than rites and rituals.{{sfn|Lamotte|1988|p=81}}\n\nFaith is the consequence of impermanence and a wise perception of suffering (''[[dukkha]]''). Reflection on suffering and impermanence leads the devotees to a sense of [[samvega|fear and agitation]] ({{lang-pi|saṃvega|italic=yes}}), which motivates them to take refugee in the Triple Gem and cultivate faith as a result.{{sfn|Trainor|1989|pages=185–6}} Faith then leads to many other important mental qualities on the path to ''[[Nirvana]]'', such as joy, concentration and insight.<ref>{{cite encyclopedia|last1=Harvey|first1=Peter|author-link=Peter Harvey|editor1-last=Emmanuel|editor1-first=Steven M.|encyclopedia=A companion to Buddhist philosophy|title=''Dukkha'', non-self, and the \"Four Noble Truths\"|date=2013|publisher=[[Wiley-Blackwell]]|location=Chichester, West Sussex|isbn=978-0-470-65877-2|url=http://www.ahandfulofleaves.org/documents/A%20Companion%20to%20Buddhist%20Philosophy_Emmanuel.pdf|archive-url=https://www.webcitation.org/6vADr7eR4?url=http://www.ahandfulofleaves.org/documents/A%20Companion%20to%20Buddhist%20Philosophy_Emmanuel.pdf|archive-date=22 November 2017|dead-url=no|pages=31, 49|df=}}</ref> Faith in itself, however, is never regarded as sufficient for the attainment of ''Nirvana''.{{sfn|Thomas|1953|p=258}}{{sfn|Jayatilleke|1963|p=384}}\n[[File:Terenuri cultivate în lângă Orheiul Vechi.JPG|alt=Green plains.|thumb|The [[sangha|saṅgha]] is described as a \"[[field of merit]]\", because Buddhists regard offerings to them as particularly karmically fruitful.{{sfn|Harvey|2013|p=246}}]]\n\nA faithful Buddhist layman or laywoman is called an ''[[upasaka and Upasika|upāsaka or upāsika]]'', respectively. To become a layperson, no formal ritual is required.<ref>{{cite encyclopedia|last1=Tremblay|first1=Xavier|editor1-last=Heirman|editor1-first=Ann|editor2-last=Bumbacher|editor2-first=Stephan Peter|encyclopedia=The spread of Buddhism|title=The spread of Buddhism in Serindia|date=2007|publisher=[[Brill Publishers]]|archive-url=https://www.webcitation.org/6vADtlDZJ?url=http://www.ahandfulofleaves.org/documents/The%20Spread%20of%20Buddhism_HDO_Vol.16_2007.pdf|archive-date=22 November 2017|dead-url=no|location=Leiden|isbn=9789004158306|edition=online|url=http://www.ahandfulofleaves.org/documents/The%20Spread%20of%20Buddhism_HDO_Vol.16_2007.pdf|page=87|df=}}</ref>{{sfn|Lamotte|1988|p=247}} Some [[Pāli Canon]] passages, as well as later commentators such as [[Buddhaghosa]], state that a Buddhist layman can go to heaven only by the strength of his faith in and love for the Buddha, yet in other passages faith is listed together with other virtues, such as morality, as qualities that lead the devotee to heaven.{{sfn|De Silva|2002|p=215}}{{sfn|Thomas|1953|pp=56, 117}} Regardless, faith is an important part of the ideal of Buddhist laypeople, as they are described to be in the habit of seeing the saṅgha, listening to their teachings, and most importantly, providing charity for the saṅgha. ''Saddhā'' in the lay life is strongly connected with [[dana (Buddhism)|''dāna'' (generosity)]]: the faithful gift is the most spiritually important gift.{{sfn|Findly|2003|pp=200, 202}}\n\nFaith is included in lists of virtues for laypeople, and is therefore described as a progressive quality for devotees, as a devotee who is new to the Buddhist religion is characterized as \"young in devotion\".{{sfn|Findly|2003|p=202}} Thus, there are various lists of virtues in which faith is included,{{sfn|Lamotte|1988|p=74}}{{sfn|De Silva|2002|p=215}} and other early traditions have also given faith a prominent role, such as the [[Sarvāstivāda]] tradition.{{sfn|Buswell|Lopez|2013|loc=Śraddhā}} Moreover, early Buddhism describes faith as an important quality in [[Sotāpanna|stream-enterers]], a state preceding enlightenment.{{sfn|Harvey|2013|pp=85, 237}}{{sfn|De Silva|2002}} In standard descriptions of people [[Pabbajja|going forth]] (taking ordination as a monk), faith is mentioned as an important motivation. Despite this role, some Indologists such as [[André Bareau]] and Lily De Silva believed early Buddhism did not assign the same value to faith as in some other religions, such as Christianity. Bareau argued that \"Buddhism has no comparable [idea of] pure faith as in Christianity, ... The idea of blind faith, an absolute faith in a master's word, goes completely against the spirit of early Buddhism.\"{{sfn|De Silva|2002|pp=214–5}}<ref>{{cite book|last1=Ergardt|first1=Jan T.|title=Faith and knowledge in early Buddhism : an analysis of the contextual structures of an arahant-formula in the Majjhima-Nikāya|date=1977|publisher=Brill (publisher)|location=Leiden|isbn=9004048413|doi=10.2307/2054272|page=1|quote=Der Buddhismus kennt keinen dem des Christentums vergleichbaren reinen Glauben, ... Die Idee eines blinden Glaubens, eines absoluten Vertrauens in die Worte eines Meisters ist dem Geist des alten Buddhismus ganz entgegengesetzt.}}</ref> Translator [[Caroline Rhys Davids]] disagreed with such statements, however, stating that \"faith is no less important than it is for all religions worthy of the name\".{{sfn|Jayatilleke|1963|p=383}}{{sfn|Findly|2003|p=201}} Indologist [[Richard Gombrich]] argues that Buddhism does not prescribe [[credo quia absurdum|believing in someone or something to the extent of going against reason]].<!--pp=119-20--> Also, Gombrich believes the Buddha did not aim to create a religion that focuses on devotion to his person, though he recognizes that such devotion already started when the Buddha was still alive.{{sfn|Gombrich|2006|pages=119–22}}{{sfn|Gombrich|2009|p=199}} Gombrich notes that there is a lot of material in the early scriptures emphasizing how important faith is,{{sfn|Gombrich|2006|pages=120–22}} but argues that \"the growth of Buddhist rites and liturgies was surely a wholly [[unintended consequence]]s of the Buddha's preaching\".{{sfn|Gombrich|2009|p=200}}\n\n==== Taking refuge ====\n\n{{Main|Refuge (Buddhism)}}\n[[File:Alms giving to several thousand monks, next to Central World in Bangkok on the morning of Sunday 18th March 2012.png|alt=Alms giving to several thousand monks in Bangkok, in an organized event|thumb|In the [[Pāli Canon]], the [[Buddhist monk]] is given a significant role in promoting and upholding faith among [[Upāsaka and Upāsikā|laypeople]].{{sfn|Wijayaratna|1990|pages=130–1}}{{sfn|Buswell|Lopez|2013|loc=Kuladūșaka}}]]\nSince early Buddhism, devotees expressed their faith through the act of taking refuge, which is [[Three Refuges|threefold]]. In this, it centres on the authority of a Buddha as a supremely awakened being, by assenting to a role for a Buddha as a teacher of both humans and ''[[deva (Buddhism)|devās]]'' (heavenly beings). This often includes other Buddhas from the past, and Buddhas who have not yet arisen. Secondly, the taking of refuge honours the truth and efficacy of the Buddha's [[Dharma (Buddhism)|spiritual doctrine]], which includes the characteristics of [[saṅkhāra|phenomenon]] ({{lang-pi|saṅkhāra|italic=yes}}) such as their [[anicca|impermanence]] ({{lang-pi|anicca|italic=yes}}), and the path to liberation.{{sfn|Harvey|2013|p=245}}<ref name=\"Kariyawasam\">{{cite book|last=Kariyawasam|first=A.G.S.|year=1995|title=Buddhist Ceremonies and Rituals of Sri Lanka|series=The Wheel Publication|location=Kandy, Sri Lanka|publisher=[[Buddhist Publication Society]]|accessdate=23 October 2007|url=http://www.accesstoinsight.org/lib/authors/kariyawasam/wheel402.html|deadurl=no|archiveurl=https://web.archive.org/web/20130328021534/http://www.accesstoinsight.org/lib/authors/kariyawasam/wheel402.html|archivedate=28 March 2013|df=}}</ref> The taking of refuge ends with the acceptance of worthiness of the [[sangha (Buddhism)|community of spiritually developed followers]] (the saṅgha), which is mostly defined as the monastic community, but may also include lay people and even ''devās'' provided they are [[Four stages of enlightenment|nearly or completely enlightened]].{{sfn|Harvey|2013|p=246}}{{sfn|Robinson|Johnson|1997|p=43}} Early Buddhism did not include ''[[bodhisattva]]s'' in the Three Refuges, because they were considered to still be on the path to enlightenment.{{sfn|Buswell|Lopez|2013|loc=Paramatthasaṅgha}}\n\nEarly texts describe the saṅgha as a \"[[field of merit]]\", because early Buddhists regard offerings to them as particularly karmically fruitful.{{sfn|Harvey|2013|p=246}} Lay devotees support and revere the saṅgha, of which they believe it will render them merit and bring them closer to enlightenment.{{sfn|Werner|2013|page=39}} At the same time, the Buddhist monk is given a significant role in promoting and upholding faith among laypeople. Although many examples in the canon are mentioned of well-behaved monks, there are also cases of monks misbehaving. In such cases, the texts describe that the Buddha responds with great sensitivity to the perceptions of the lay community. When the Buddha sets out new rules in the [[Patimokkha|monastic code]] to deal with the wrongdoings of his monastics, he usually states that such behavior should be curbed, because it would not \"persuade non-believers\" and \"believers will turn away\". He expects monks, nuns and novices to not only to lead the spiritual life for their own benefit, but also to uphold the faith of the people.<!--p.130--> On the other hand, they are not to take the task of inspiring faith to the extent of hypocrisy or inappropriateness,<!--p.131--> for example, by taking on other professions apart from being a monastic, or by courting favours by giving items to the laypeople.{{sfn|Wijayaratna|1990|pages=130–1}}{{sfn|Buswell|Lopez|2013|loc=Kuladūșaka}}\n\nThus, taking refuge is a form of aspiration to lead a life with the Triple Gem at its core. Taking refuge is done by a short formula in which one names the Buddha, the dharma and the saṅgha as refuges.{{sfn|Irons|2008|p=403}}{{sfn|Robinson|Johnson|1997|p=43}} In early Buddhist scriptures, taking refuge is an expression of determination to follow the Buddha's path, but not a relinquishing of responsibility.<ref name=\"Kariyawasam\" />\n\n==== Through verification ====\n\n[[File:Kesariya.jpg|thumb|upright=1.3|Buddhist [[stūpa]] in [[Kesaria|Kesariya]], [[Bihar]], India, erected in honour of the [[Kalama Sutta|Kalāma Sutta]]|alt=Buddhist [[stūpa]] in [[Kesaria|Kesariya]], [[Bihar]], India]]\nFaith can lead practitioners to take refuge in the Triple Gem, which opens them up to new spiritual experiences previously unknown to them. This is the devotional or mystical aspect of faith. But there is also a rational aspect, in that the value of taking refuge is rooted in personal verification.{{sfn|Nakamura|1997|p=392}} In the [[sutra|discourse]] (''sutta'') called the ''[[Kalama Sutta|Kalāma Sutta]]'', the Buddha argues against following sacred authority, tradition, a doctrine of logic, or respecting teachers for the mere fact that they are one's teachers.{{sfn|Suvimalee|2005|p=604}} Knowledge coming from such sources is based on [[kilesa|greed, hatred and delusion]] and Buddhist devotees should consider such knowledge impartially and not blindly. However, it should not all be refuted either. They should find out whether a teaching is true by personal verification of spiritual truth instead, distinguishing what leads to happiness and benefit, and what does not.{{sfn|Jayatilleke|1963|p=390}}{{sfn|Fuller|2004|page=36}}{{refn|group=note|The discourse can be found online at [http://www.accesstoinsight.org/tipitaka/an/an03/an03.065.soma.html The Kalāma Sutta, translated by [[Soma Thera]]]}} Giving an example of such an approach, the Buddha states that the practice of abandoning greed, hatred and delusion will benefit the practitioner, regardless of whether there is such a thing as karmic retribution and rebirth.<ref name=\"Blakkarly\">{{cite news|last1=Blakkarly|first1=Jarni|title=The Buddhist Leap of Faith|url=http://www.abc.net.au/religion/articles/2014/11/05/4122342.htm|accessdate=24 July 2017|work=[[ABC (Australia)|ABC]]|date=5 November 2014|deadurl=no|archiveurl=https://web.archive.org/web/20170727125253/http://www.abc.net.au/religion/articles/2014/11/05/4122342.htm|archivedate=27 July 2017|df=}}</ref> Thus, personal experience and judgement are emphasized in accepting the Buddha and Buddhism. A person should, however, also heed the counsel of the wise.{{sfn|De Silva|2002|p=215}}\n\nIn the discourse called the ''Canki Sutta'', the Buddha points out that people's beliefs may turn out in two different ways: they might either be genuine, factual and not mistaken; or vain, empty and false. Thus, when a person holds a certain belief, they should not derive the conclusion \"Only this is true, anything else is false,\" but instead \"preserve the truth\" with the awareness \"This is my belief\".{{sfn|Suvimalee|2005|p=603}}{{sfn|Fuller|2004|page=36}}{{refn|group=note|The discourse can be found at:\n {{cite web|title=Canki Sutta: With Canki|url=http://www.accesstoinsight.org/tipitaka/mn/mn.095x.than.html|first=Thanissaro|last=Bhikkhu|author-link=Thanissaro Bhikkhu|access-date=2017-05-26}}}} Thus, the discourse criticizes, among others, [[divine revelation]], tradition and report, as leading to \"groundless faith\" and as an incomplete means of acquiring spiritual knowledge or truth.{{sfn|De Silva|2002|p=215}}{{sfn|Kalupahana|1976|pp=27–8}} But in the ''Sandaka Sutta'', the Buddha also criticizes mere reasoning or logic as a means of attaining to truth.{{sfn|Suvimalee|2005|p=603}}{{sfn|Kalupahana|1976|pp=27–8}} Instead, personal and direct intuitive knowledge are required to attain the truth, when such knowledge is not affected by bias.<!--p.29-->{{sfn|Kalupahana|1976|pp=27–9}}{{sfn|Holder|2013|pp=225–6}} Thus, belief and faith are not considered sufficient for arriving at truth, even in spiritual matters where other religious traditions would refer to faith. The Buddha does not agree with traditions that demand blind faith in scriptures or teachers.{{sfn|Suvimalee|2005|page=601}}{{sfn|Holder|2013|pp=225–6}} In one discourse, when asked on which authority the Buddha bases his teachings on, he answers that he does not base them on tradition, faith, or reason, bur rather on personal experience as a source of authority.{{sfn|Jayatilleke|1963|pp=169–71}}\n[[File:Buddha Kopf.jpg|alt=Head of the Buddha|thumb|The Buddha states in several discourses, including the ''Vimaṁsaka Sutta'', that his disciples should investigate even him as to whether he really is enlightened and pure in conduct, by observing him for a long time.{{sfn|De Silva|2002|pp=215–6}}{{sfn|Jayatilleke|1963|pp=390–3}}]]\nIn conclusion, the Buddhist devotee should verify moral judgment and truth by personal experience. This then leads to a provisional acceptance, called \"preserving the truth\". Faith goes hand-in-hand with an open attitude of willing to learn and try out, familiarizing oneself with the teaching. Through personal verification a person's faith deepens, ultimately changing from \"preserving\" to \"discovering\" the truth.{{sfn|De Silva|2002|p=215}}{{sfn|Fuller|2004|page=36}} This verification process involves ordinary experience, but also the [[yoga|yogic]] experience of cultivation of the mind.<ref>{{cite encyclopedia|url=https://historiadelartecursos.files.wordpress.com/2012/08/brian-carr-indira-mahalingam-companion-encyclopedia-of-asian-philosophy.pdf|last1=Jackson|first1=Roger R.|editor1-last=Carr|editor1-first=Brian|editor2-last=Mahalingam|editor2-first=Indira|encyclopedia=Companion encyclopedia of Asian philosophy|title=Buddhism in India|date=1997|publisher=[[Routledge]]|location=London|isbn=0-415-03535-X|page=290|deadurl=no|archiveurl=https://web.archive.org/web/20170730062207/https://historiadelartecursos.files.wordpress.com/2012/08/brian-carr-indira-mahalingam-companion-encyclopedia-of-asian-philosophy.pdf|archivedate=2017-07-30|df=}}</ref>{{sfn|Hoffmann|1987|page=409}} Furthermore, the Buddha applies these criteria to his own teaching: he is qualified to teach his dharma because he has verified it for himself, not learnt it from someone else or reasoned it out.{{sfn|Holder|2013|p=227}} The Buddha states in several discourses, including the ''Vimaṁsaka Sutta'', that his disciples should investigate even him as to whether he really is enlightened and pure in conduct, by observing him for a long time.{{sfn|De Silva|2002|pp=215–6}}{{sfn|Jayatilleke|1963|pp=390–3}} Several people are described in the Pāli Canon observing the Buddha in such way, and arriving at grounded faith.{{sfn|De Silva|2002|pp=215–6}} This does not mean, however, that the Buddha does not accept any acts of reverence to his person: he teaches that devotional acts can help to uplift the lay practitioners' minds, and help them on the path to a better rebirth and enlightenment.{{sfn|Werner|2013|pages=43–4}} Devotion is therefore a subject that requires the serious practitioner's interest.<ref>{{cite encyclopedia|last1=Tuladhar-Douglas|first1=William|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Pūjā: Buddhist pūjā|date=2005|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865980-5|page=7496|edition=2nd|url=https://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%2011.pdf|volume=11|deadurl=yes|archiveurl=https://web.archive.org/web/20170302005458/https://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%2011.pdf|archivedate=2017-03-02|df=}}</ref>\n\n==== As initial step ====\n\nFaith is an initial trust in the Buddha as a spiritual teacher and an initial acceptance of the Buddha's teachings. Faith is considered of great benefit to a beginning practitioner of the Buddhist teaching.{{sfn|Nakamura|1997|p=392}}{{sfn|De Silva|2002|p=216}} In the ''Cula-hatthipadopama Sutta'', the Buddha describes the path of enlightenment as starting with faith in him, but continuing with the practise of virtue, meditation and wisdom, culminating in the achievement of enlightenment. Thus, the initial faith provides the confidence to continue the path up unto the final aim,{{sfn|Suvimalee|2005|pp=602–3}} and for this reason, in early Buddhist teachings faith is usually listed as the first quality in progressive lists of virtues.{{sfn|Findly|2003|p=202}}\n\nBesides ''saddhā'', another word, ''pasāda'', and its related synonyms ''pasanna'' and ''pasidati'', are sometimes also translated as 'faith', but are given a higher value than ''saddhā''.<!--p=214--> ''Saddhā'' deepens when someone progresses along the spiritual path, and early texts sometimes describe this as ''pasāda'',<!--p=216-->{{sfn|De Silva|2002|pp=214, 216}}{{sfn|Harvey|2013|p=31}}{{sfn|Trainor|1989|page=187}} and sometimes as ''bhakti''.{{sfn|Barua|1931|page=333}} ''Pasāda'' is faith and attraction towards a teacher, but is accompanied by clarity of mind, placidity and understanding.{{sfn|Trainor|1989|page=187}} The practicing disciple develops and stabilizes his faith, basing it on spiritual insight.{{sfn|De Silva|2002|p=216}}{{sfn|Jayatilleke|1963|p=297}} This leads his faith to become \"unshakeable\".{{sfn|Suvimalee|2005|pp=601–2}}{{sfn|De Silva|2002|p=217}}\n\nThus, faith is by itself not enough to attain deliverance, but is a first step on the path leading to [[paññā|wisdom]] and enlightenment.{{sfn|Findly|1992|page=265}} Many teachings in early Buddhism mention faith as the first step, whereas wisdom is mentioned as the last.{{sfn|Harvey|2013|p=237}}{{sfn|Jayatilleke|1963|pp=396–7}} On the last stage of the Buddhist path, the attainment of ''arahant'', the practitioner has completely replaced faith by wisdom. At that point, the ''arahant'' no longer relies on faith at all,{{sfn|Barua|1931|p=336}}{{sfn|Lamotte|1988|pp=49–50}}{{sfn|Jayatilleke|1963|p=384}} although at this stage sometimes a form of realized faith is described.{{sfn|Hoffmann|1987|pages=405, 409}} Therefore, the Buddha praises most of his disciples for their wisdom, rather than their faith. The exception to that, the monk Vakkali, praised by the Buddha as \"the highest of those who had faith\", is also taught by the Buddha to concentrate on the teaching, rather than the Buddha's person.{{sfn|De Silva|2002|p=216}}{{sfn|Lamotte|1988|pp=49–50}}{{sfn|Jayatilleke|1963|p=384}} The Buddha is seen admonishing his disciple Ānanda in a similar way.{{sfn|Findly|1992|pp=268–9}}\n\nIn the Pāli Canon, different approaches of faith are described. Developing faith in someone's person, even the Buddha himself, is of little use when it is too much connected with superficial features—such as physical appearance—and too little with the Buddha's teaching. Such an approach to faith is said to lead to affection and anger and has other disadvantages. It is an impediment to walking in the steps of the Buddha and attaining enlightenment, such as in the case of Vakkali. Faith and devotion must always go hand-in-hand with a sense of [[upekkha|equanimity]].{{sfn|Harvey|2013|p=28}}{{sfn|Jayatilleke|1963|p=388}}{{sfn|Werner|2013|page=47}}\n\n=== Mahāyāna Buddhism ===\n[[File:Shakyamuni Buddha with Avadana Legend Scenes - Google Art Project.jpg|alt=Painting with Gautama Buddha with scenes from Avadana legends depicted|thumb|upright=1.1|[[Gautama Buddha]] with scenes from [[Avadāna]] legends depicted]]\nDuring the period of [[Ashoka|emperor Ashoka]] (third to second century BCE), Buddhists placed more emphasis on faith, as Ashoka helped develop Buddhism as a popular religion to unify his empire. This new trend led to an increased worship of ''stūpas'' and an increase of [[Avadāna]] faith-based literature.{{sfn|Harvey|2013|p=103}}<ref>{{cite book|last1=Swearer|first1=Donald K.|title=The Buddhist world of Southeast Asia|date=2010|publisher=[[State University of New York Press]]|location=Albany|isbn=978-1-4384-3251-9|page=77|edition=2nd|url=http://www.ahandfulofleaves.org/documents/the%20buddhist%20world%20of%20southeast%20asia_swearer.pdf|archive-url=https://www.webcitation.org/6vADhQmDu?url=http://www.ahandfulofleaves.org/documents/The%20Buddhist%20World%20of%20Southeast%20Asia_Swearer.pdf|archive-date=22 November 2017|dead-url=no|df=}}</ref> In the second century CE, it became more common to depict the Buddha through images, and there was a shift in emphasis in [[Indian religion]] towards [[Bhakti|emotional devotionalism]].<!--Smart; Harvey 105--> This led to new perspectives in Buddhism, summarized by [[Buddhist studies]] scholar Peter Harvey as \"compassion, faith and wisdom\". These perspectives paved the way to the arising of [[Mahāyāna]] Buddhism.<!--p=105-->{{sfn|Harvey|2013|pp=103, 105}}{{sfn|Smart|1997|page=282}}\n\nIn general, the role of faith in Mahāyāna Buddhism is similar to that of Theravāda{{sfn|Harvey|2013|p=31}}{{sfn|Spiro|1982|p=34 n.6}}—in both, faith is an unavoidable part of practice.<ref name=\"Blakkarly\" /> Even in present-day Theravāda Buddhism, originating from Pāli Budhism, faith is still important in traditional Buddhist societies. Theravādins see faith in the Triple Gem as a protective force in daily life, especially when combined with a [[Buddhist ethics|moral life]].{{sfn|Spiro|1982|p=15m1}} However, with the rising of Mahāyāna Buddhism, the depth and range of teachings on faith intensified. A great number of ''[[bodhisattva]]s'' became focus of devotion and faith, giving Mahāyāna Buddhism a \"theistic\" side.{{sfn|Harvey|2013|p=172}}{{sfn|Leaman|2000|page=212}} In early Buddhism, there were already some passages that suggested the Buddha and other enlightened beings had a world-transcending nature. Later Theravādins believed that [[Maitreya]], the future Buddha, was waiting for them in heaven and they honoured him gradually more. Nevertheless, Mahāyānists took this idea much further.<ref>{{cite encyclopedia|url=https://historiadelartecursos.files.wordpress.com/2012/08/brian-carr-indira-mahalingam-companion-encyclopedia-of-asian-philosophy.pdf|last1=Werner|first1=Karel|author-link=Karel Werner|editor1-last=Carr|editor1-first=Brian|editor2-last=Mahalingam|editor2-first=Indira|encyclopedia=Companion encyclopedia of Asian philosophy|title=Non-orthodox Indian philosophies|date=1997|publisher=[[Routledge]]|location=London|isbn=0-415-03535-X|pages=116–7|deadurl=no|archiveurl=https://web.archive.org/web/20170730062207/https://historiadelartecursos.files.wordpress.com/2012/08/brian-carr-indira-mahalingam-companion-encyclopedia-of-asian-philosophy.pdf|archivedate=2017-07-30|df=}}</ref>{{sfn|Reynolds|Hallisey|1987|p=1064}}{{sfn|Conze|2003|p=154}} After the [[parinirvāṇa|Buddha's death]], there was a sense of regret among Buddhist communities about the absence of the Buddha in the world, and a desire to \"see\" the Buddha ({{lang-sa|[[Darśana#In Mahayana Buddhism|darśana]]}}) and receive his power.{{sfn|Getz|2004|page=699}}{{sfn|Barber|2004|page=707}} Mahāyānists extended the meaning of the Triple Gem to include Buddhas that reside in heavens, and later called these ''[[sambhogakāya]]'' Buddhas ('embodiment of the enjoyment of the Dharma').{{sfn|Barber|2004|p=707}}{{sfn|Smart|1997|pp=283–4}} The increased emphasis on these celestial Buddhas, manifest all the time and everywhere, started to overshadow the role of Gautama Buddha in the Buddhist faith.{{sfn|Reynolds|Hallisey|1987|p=1067}}{{sfn|Snellgrove|1987|pp=1078–9}} [[Pure Land Buddhism]] mostly focused its faith to these celestial Buddhas, especially the Buddha Amitābha.{{sfn|Harvey|2013|p=175}}{{sfn|Leaman|2000|p=215}}\n\nStarting from this devotion to celestial Buddhas,{{sfn|Harvey|2013|p=175}}{{sfn|Leaman|2000|p=215}} advanced ''bodhisattva'' beings, representing Mahāyāna ideals, gradually became focus of an extensive worship and cult. These ''bodhisattvas'' had no basis in historical fact.{{sfn|Conze|2003|p=150}} By the sixth century, depiction of ''bodhisattvas'' in [[Buddhist iconography]] had become common,{{sfn|Harvey|2013|p=175}} such as the ''bodhisattva'' Avalokiteśvara representing compassion, and [[Manjusri]] wisdom.{{sfn|Higham|2004|p=210}} Accounts about the ''bodhisattvas'' and their good deeds often included actions with great stakes, and it is likely that writers meant these accounts as devotional more than exemplary.{{sfn|Derris|2005|page=1084}}\n\nThus, in the twelfth and thirteenth centuries the emphasis in Japanese Buddhism shifted from personal enlightenment to [[hongaku|connecting with the universal Buddha nature]] and the realms in which the Buddhas live.{{sfn|Bielefeldt|2004|pages=389–90}} With the development of the [[Mādhyamaka]] system of thought, the Buddha was no longer regarded as only a historical person, and the idea of essential unity in all living beings became an intrinsic part of Buddhist theory and practice.<ref>{{cite book|last1=Murti|first1=T.R.V.|authorlink1=Tiruppattur_R._Venkatachala_Murthi|title=The central philosophy of Buddhism: a study of the Mādhyamika system|date=2008|orig-year=1955|publisher=[[Routledge]]|location=London|isbn=1-135-02946-6|page=6|url=https://www.academia.edu/16004454/The_Central_Philosophy_of_Buddhism_A_Study_of_Madhyamika_System_by_T.R.V._Murti|deadurl=no|archiveurl=https://web.archive.org/web/20171122120355/https://www.academia.edu/16004454/The_Central_Philosophy_of_Buddhism_A_Study_of_Madhyamika_System_by_T.R.V._Murti|archivedate=2017-11-22|df=}}</ref> This development led to the devotion movement of Pure Land Buddhism, whereas in Zen Buddhism it led to the emphasis of seeking the [[Buddha Nature]] within oneself.<ref>{{cite journal|last1=Kiyota|first1=Minoru|title=Tathāgatagarbha Thought: A Basis of Buddhist Devotionalism in East Asia|journal=[[Japanese Journal of Religious Studies]]|date=1985|volume=12|issue=2/3|page=222|doi=10.2307/30233958|url=http://nirc.nanzan-u.ac.jp/nfile/2311|doi-broken-date=2018-01-29|deadurl=no|archiveurl=https://web.archive.org/web/20160320232345/https://nirc.nanzan-u.ac.jp/nfile/2311|archivedate=2016-03-20|df=}}</ref>\n\nTerms for faith that are primarily used in Mahāyāna Buddhism are ''Xin'' (Chinese) and ''shin'' (Japanese):<!--only Buswell--> these terms can refer to trust, but also an unquestioned acceptance of the object of one's devotion. They are also used, as it is in [[Chan Buddhism|Chan]] and [[Zen Buddhism]], with regard to a confidence that the Buddha nature (''tathāgatagarbha'') is hidden within one's mind, and can be found as one suspends the habits of the mind.{{sfn|Gómez|2004b|p=278}}{{sfn|Bielefeldt|2004|page=390}}{{sfn|Buswell|Lopez|2013|loc=Śraddhā}} As such, Chan and Zen Buddhists consider faith as one of the ''[[Three Essentials]]'' in meditation practice, together with resolve and doubt.{{sfn|Buswell|Lopez|2013|loc=Sanyao, Zongmen huomen}}{{sfn|Powers|2013|loc=dai funshi (\"great resolve\")}} Pure Land Buddhists, on the other hand, make a distinction between the aspect of the mind which is faithful, and which is awakened by practising devotion and humility to the Buddha [[Amitābha]], known as ''xinji'' (Chinese) or ''[[shinjin]]'' (Japanese);<!--all three--> and the joy and confidence of being able to meet the Buddha  Amitābha, known as ''xinfa'' (Chinese) or ''shingyō'' (Japanese).<!--Gomez and Buswell-->{{sfn|Bielefeldt|2004|page=390}}{{sfn|Gómez|2004b|p=279}}{{sfn|Buswell|Lopez|2013|loc=Xinxin}} Pure Land traditions describe the awakening of faith as a transcendental experience beyond time, similar to a state preceding enlightenment.{{sfn|Harvey|2013|p=255}} In the teachings of the Japanese Pure Land teacher [[Shinran]], such experience of faith, which he called \"the Light\" (''[[Japanese language|Japanese]]: kōmyō'') involved devotees not only feeling completely assured about the Buddha Amitābha as to his determination and wisdom to save them, but also feeling fully reliant on Amitābha because of their personal incapacity.{{sfn|Dobbins|2002|p=29}}<ref>{{cite encyclopedia|last1=Bloom|first1=Alfred|author-link=Alfred Bloom (Buddhist)|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Shinran|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865981-3|edition=2nd|url=https://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%2012.pdf|volume=12|p=8355|deadurl=bot: unknown|archiveurl=https://web.archive.org/web/20170302052813/https://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%2012.pdf|archivedate=2017-03-02|df=}}</ref>\n\nDespite the important developments that took place in the arising of Mahayana Buddhism, it would be simplistic to state that no devotional movement existed before Mahāyāna. Devotionalism had become common in texts and practices in the same period that the [[Abhidhamma]] texts were compiled, even before Mahāyāna developed.{{sfn|Schopen|2004|p=496}} Furthermore, later Theravāda Buddhism started emphasizing hagiographical accounts of the Buddha and ''bodhisattva'' more,<!--p=1085--> and in many accounts the Buddha played a major role in other people's enlightenment.<!--pp=1085, 7-->{{sfn|Derris|2005|pp=1085, 1087}}\n\n==== Tiantai, Tendai and Nichiren Buddhism ====\n{{Main|Lotus Sūtra}}\n[[File:5th century Lotus Sutra fragment.JPG|thumb|Fifth-century fragment of a Sanskrit [[Lotus Sutra]] manuscript from [[Rouran Khaganate|Rouran]], [[Northern Wei]], unearthed from [[Hetian County|Hetian]], [[Xinjiang]] province. Housed in the&nbsp;[[Museum of the Mausoleum of the Nanyue King]].|alt=Fragment of a manuscript]]\nThe [[Lotus Sūtra]], one of the most worshiped texts ({{lang-sa|sūtra|script=Latn}}) in Southeast Asia ,<!--p.512-->{{sfn|Shields|2013|p=512}} embraces the ideal of faith.{{sfn|Shields|2013|pp=512, 514}}\nIn medieval China and Japan, many miraculous legends were related to the Lotus Sūtra, contributing to its popularity. Scholars have suggested that the ''sūtra's'' emphasis on the Buddha as a father has helped make the ''sūtra'' popular.<!--p.515-->{{sfn|Shields|2013|pp=512, 514–5}}\n\nThe Lotus Sūtra was composed in the first two centuries of the [[Common Era]].<!--p=471--> Part of the \"[[Cult of the Book]]\", Mahāyānists honoured and worshiped the Lotus Sūtra just like many other Mahāyāna sutras, similar to the worship of ''stūpas'' before the arising of Mahāyāna Buddhism. They worshiped the Lotus Sūtra more than most ''sūtras''. The ''sūtra'' itself describes different types of devotion to it—receiving and keeping, reading, reciting, teaching and transcribing it—and was actually worshiped in a large variety of ways. In some copies, scribes depicted every letter similar to a Buddha, enshrined in a ''stūpa''.<!--p=474-->{{sfn|Stone|2004a|pp=471, 474}}{{sfn|Buswell|Lopez|2013|loc=Saddharmapuṇḍarīkasūtra}}<ref>{{cite encyclopedia|last1=Gummer|first1=Natalie|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Buddhist books and texts: Ritual uses of books|date=2005|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|edition=2nd|url=https://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%202.pdf|volume=2|p=1262|deadurl=yes|archiveurl=https://web.archive.org/web/20170302073830/https://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%202.pdf|archivedate=2017-03-02|df=}}</ref>\n\nAlthough the theoretical implications of the Lotus Sūtra influenced traditional scholars, the devotional practices surrounding the ''sūtra'' affected Buddhism even more.{{sfn|Stone|2004a|p=474}} The Chinese [[Tiantai]] school (6th century) and its later Japanese form, [[Tendai]], further promoted worship of the Lotus Sūtra, combined with devotion toward Amitābha Buddha.{{sfn|Harvey|2013|p=227}}{{sfn|Stone|2004a|p=475}} These schools believed the ''sūtra'' to be supreme among all of the Buddha's teachings,<!--p=475--> and leading to enlightenment in the present lifetime.<!--p=476-->{{sfn|Stone|2004a|pp=475–6}} Some schools of the [[Kamakura period]] (twelfth–fourteenth century), took reverence towards the Lotus Sūtra to the extent that they saw it as the [[Ekayāna|single one vehicle or path of the dharma]],<!--p.514, 519--> and they believed only this practice led society to an ideal Buddha land.<!--p.521-->{{sfn|Shields|2013|pp=514, 519, 521}}\n\nFor example, the Japanese teacher [[Nichiren]] (1222–82) promoted faith in and worship of the ''sūtra'' for this reason, criticizing other schools and types of worship sharply.{{sfn|Harvey|2013|pp=233–4}}{{sfn|Araki|1987|p=1244}} Seeing the ''sutra'' as a prophecy of the mission of his own movement,{{sfn|Stone|2004a|p=476}}{{sfn|Irons|2008|p=366}} Nichiren believed that through devotion to the ''sutra'' a [[Pure Land]] on earth could be realized,<!--Stone--> a land which is a depiction of the ideal of enlightenment in Māhayāna Buddhism.{{sfn|Stone|2004a|p=477}}<ref>{{cite encyclopedia|last1=Kotatsu|translator-first=Kenneth K.|translator-last=Tanaka|first1=Fujita|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Pure and Impure Lands|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865743-8|page=7502|edition=2nd|url=http://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%2011.pdf|volume=11|deadurl=bot: unknown|archiveurl=https://web.archive.org/web/20170302005458/http://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%2011.pdf|archivedate=2017-03-02|df=}}</ref> He taught that worship of the ''sūtra'' led the practitioner to unite with the [[Eternal Buddha|primordial Buddha]], of whom he believed all Buddhas are manifestations.{{sfn|Stone|2004a|p=474}} Nichiren promoted the invocation of the sutra title based \"on faith alone\".{{sfn|Stone|1998|p=123}} Despite this great devotion to the Lotus Sūtra, Nichiren de-emphasized the study of the sutra, believing that chanting the [[Namu Myōhō Renge Kyō|title of the sutra]], was the most effective practice for people living in the [[mappō|\"Age of Dharma Decline\"]].<ref>{{cite encyclopedia|last1=Cabezón|first1=José Ignacio|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Scripture|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=http://www.ahandfulofleaves.org/documents/Encyclopedia%20of%20Buddhism_2%20Vols_%20Buswell.pdf|page=757|deadurl=no|archiveurl=https://web.archive.org/web/20170614204648/http://www.ahandfulofleaves.org/documents/Encyclopedia%20of%20Buddhism_2%20Vols_%20Buswell.pdf|archivedate=2017-06-14|df=}}</ref> {{See below|Pure Land Buddhism}}\n\nIn the present day, more than forty organizations continue upon the Nichiren tradition, some of which are lay organizations.<ref>{{cite encyclopedia|last1=Stone|first1=Jacqueline I.|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Nichiren|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=http://www.ahandfulofleaves.org/documents/Encyclopedia%20of%20Buddhism_2%20Vols_%20Buswell.pdf|page=595|deadurl=no|archiveurl=https://web.archive.org/web/20170614204648/http://www.ahandfulofleaves.org/documents/Encyclopedia%20of%20Buddhism_2%20Vols_%20Buswell.pdf|archivedate=2017-06-14|df=}}</ref>{{sfn|Stone|2004b|page=595}}\n\n==== Pure Land Buddhism ====\n{{Main|Pure Land Buddhism|Shinjin}}\n[[File:Chinesischer Maler des 8. Jahrhunderts 001.jpg|thumb|[[Amitābha]] Buddha|alt=Image of Amitābha Buddha]]\nIt is perhaps in the \"Pure Land\" ''sūtras'' that faith and devotion reach a pinnacle of [[soteriological]] importance. When devotion to celestial Buddhas developed in Mahāyāna Buddhism, the idea arose that these Buddhas were able to create 'Buddha-fields' {{lang-sa|buddha-kṣetra|italic=yes}}), or Pure Lands ({{lang-sa|sukhāvatī|italic=yes}}).{{sfn|Smart|1997|p=282}} In Pure Land Buddhism, it is one's faith in the salvific compassion of the Buddha Amitābha,{{sfn|Green|2013|p=122}} coupled with the earnest wish to enter his Pure Land that is said to bring deliverance there. This Pure Land  prepares the devotee for entry into awakening and Nirvana.{{sfn|Hsieh|2009|pp=236–7}}{{sfn|Green|2013|p=123}} Pure Land Buddhism differed in many ways from most forms of Buddhism at the time, which were based on personal effort and techniques of self-mastery.{{sfn|Irons|2008|p=394}}\n\nMahāyānist Buddhists considered Amitābha ([[Sanskrit]], 'limitless light') as one of the celestial Buddhas.{{sfn|Smart|1997|page=282}}{{sfn|Gómez|2004a|p=14}} The [[Longer Sukhāvatīvyūha Sūtra]] describes the Buddha Amitābha as a monk who, practicing under a Buddha in a previous age, vowed to create a land through his spiritual powers. Through this ideal land he would easily be able to guide many [[sentient beings (Buddhism)|living beings]] to final enlightenment.{{sfn|Harvey|2013|p=173}} He therefore vowed that once he had attained [[Buddhahood]], just calling his name would be enough for living beings to be born in this Pure Land.{{sfn|Buswell|Lopez|2013|loc=Dharmākara}} Widespread in Japan, Korea, China and Tibet,<!--Smart--> devotion to the Buddha Amitābha arose in India around the beginning of the Common Era.<!--Gomez-->{{sfn|Gómez|2004a|p=14}}{{sfn|Smart|1997|page=284}} Central to Pure Land Buddhism is the idea that the current age humans live in is the Age of Dharma Decline (''[[Chinese language|Chinese:]] mofa'', ''[[Japanese language|Japanese:]] mappō''), the final stage of the [[Gaurama Buddha|current Buddha]]'s dispensation.{{sfn|Hsieh|2009|pp=236–7}}{{sfn|Green|2013|p=123}} Pure Land Buddhists believe that in this period people are severely limited in their own capability for attaining salvation. They must therefore rely on external power (the Buddha Amitābha) to find salvation, and delay their attainment of Nirvana to another life (during their rebirth in the Pure Land).{{sfn|Hsieh|2009|pp=236–7}}{{sfn|Green|2013|p=123}} This shared sentiment may have been due to the violent civil conflicts, famines, fires and decay of monastic institutions.{{sfn|Andrews|1987|p=4119}} But the idea of reliance on an external power might also have been a consequence of the Mahāyāna teachings on the nature of the Buddha, which made the distance between the unenlightened and [[Buddhahood]] much greater.{{sfn|Williams|2008|page=247}}\n[[File:Two Patriarchs - Shandao (Otani University Museum).jpg|thumb|upright=1.3|Painting of the Chinese priest and writer [[Shandao]]|alt=Painting of the Chinese priest and writer Shandao]]\n\nPure Land Buddhism was established as an institution by the teacher [[Huiyuan (Buddhist)|Huiyuan]] (334–416 CE) on [[Mount Lu]] with the founding of the [[White Lotus Society]].{{sfn|Barber|2004|p=707}} [[Shandao]] (613–681) started emphasizing reciting mantras in honour of Amitābha Buddha (''[[Chinese language|Chinese]]'': ''[[nianfo]]''; ''[[Japanese language|Japanese]]'': ''[[nembutsu]]''), combined with several other practices.{{sfn|Getz|2004|page=701}}{{sfn|Harvey|2013|p=255}} There seems to have been a paradox in Pure Land faith from the start, in that two ideals were advocated simultaneously: on the one hand, Pure Land teachers taught that the ''bodhisattvas'' who created their Pure Lands were exemplary in their own efforts to make merits as an energy to create the Pure Land from, inspiring the devotee to follow this example. On the other hand, it was taught that practitioners should solely rely on their devotion to the Buddhas in the Pure Land, in particular Amitābha, who would come to their rescue. In Japanese Pure Land Buddhism, the latter ideal became prevalent.{{sfn|Getz|2004|pages=698–9}} But even in Japan, there was much debate as to what emphasis to give to [[Jiriki|the {{em|active}} efforts of the devotee]] on the one hand, and the [[tariki|{{em|passive}} reliance]] on Amitābha Buddha and his vow on the other hand.<ref name=\"Hirota\">{{cite encyclopedia|url=https://plato.stanford.edu/entries/japanese-pure-land/|archive-url=https://www.webcitation.org/6vAEpCKMW?url=https://plato.stanford.edu/entries/japanese-pure-land/|archive-date=22 November 2017|dead-url=no|encyclopedia=The Stanford Encyclopedia of Philosophy|edition=Winter 2016|title=Japanese Pure Land Philosophy|date=19 November 2012|access-date=18 August 2017|first=Dennis|last=Hirota|editor-first=Edward N.|editor-last=Zalta|publisher=Metaphysics Research Lab, [[Stanford University]]|df=}}</ref>{{sfn|Dobbins|2002|page=19}}{{refn|group=note|Religious studies scholar Allan A. Andrews points out that apart from the mainstream lay devotee Pure Land Buddhism, monastic-oriented schools also existed. These emphasized visualization more than the reciting of [[Amitābha]] Buddha's name, and emphasized enlightenment in the present lifetime more than attaining to a Pure Land after death.<ref>{{cite journal|last1=Andrews|first1=Allan A.|title=Lay and Monastic Forms of Pure Land Devotionalism: Typology and History|journal=[[Numen (journal)|Numen]]|date=1993|volume=40|issue=1|doi=10.2307/3270396|pages=passim.|nopp=yes|jstor=3270396}}</ref>}}\n\nPure Land Buddhism is currently still one of the most popular forms of religion in East Asia,<!--all refs--> and is practised by most East Asian monks.<!--Welch, Hudson-->{{sfn|Hsieh|2009|p=236}}{{sfn|Welch|1967|p=396}}{{sfn|Hudson|2005|page=1293}} As of the 1990s, the older generation of Chinese people still used the Amitābha mantra in common everyday greetings.{{sfn|Robinson|Johnson|1997|page=198}}\n\n===== Japan =====\nThe Tendai scholar [[Genshin]] (942–1017), Tendai priest [[Hōnen]] (1133–1212) and his student Shinran (1173–1262) applied Shandao's teachings in Japan, creating Pure Land Buddhism there as a separate school for the first time.{{sfn|Abe|1997|page=689}}{{sfn|Barber|2004|p=708}}{{sfn|Andrews|1987|p=4119}} They believed and taught that mindfully reciting the ''nembutsu'' would be enough to secure the faithful person's entrance into the Western Paradise.{{sfn|Harvey|2013|p=229}}{{sfn|Green|2013|pp=121–3}} Although Hōnen had initially stated that {{em|often}} repeating the mantra would make salvation more certain, Shinran later said that {{em|one}} utterance would be enough for salvation (''[[Japanese language|Japanese]]: ichinengi'').{{refn|group=note|Nevertheless, in some texts [[Shinran]] argued that the number of times the ''[[nembutsu]]'' was recited, whether once or many, did not provide a complete answer to the question of salvation.{{sfn|Buswell|Lopez|2013|loc=Ichinengi}}}} Subsequent repetitions would be mere expressions of gratitude to the Buddha Amitābha, which also held for other religious routines and practices. Deep understanding of the Buddha's teachings, moral practice and meditation were not necessary, Shinran concluded,{{sfn|Green|2013|pp=122–3}}{{sfn|Harvey|2013|pp=230, 255}} even considering some practices such as meditation as detrimental to reliance on Amitābha Buddha.{{sfn|Hudson|2005|page=1294}}\n\nThe concept of faith that Shinran adopted originated with Shandao:{{sfn|Williams|2008|page=262}} firstly, a sincere belief in the person of Amitābha Buddha; secondly, a deep trust in the vow that Amitābha Buddha had taken, and a conviction one's own low nature, and finally, a desire to dedicate the merits accrued from doing good deeds to be born in the Pure Land where Amitābha Buddha was believed to live.<!--both--> These three were together known as 'singleness of heart' (''[[Japanese language|Japanese]]: isshin'').<!--only Dobbins-->{{sfn|Conze|2003|p=158}}{{sfn|Dobbins|2002|pp=34–5}} Shinran further taught that such full faith would make people equal to [[Maitreya]], the coming Buddha, because their full enlightenment would be irreversibly assured.{{sfn|Dobbins|2002|pp=42–3}}{{sfn|Williams|2008|p=264}}\n\nShinran took Hōnen's teaching to the extreme: since he was convinced that he was destined to fall in hell without the help of the Buddha Amitābha, devotion to the Buddha Amitābha and trust in his vow was the single way to salvation.{{sfn|Abe|1997|p=692}}{{sfn|Porcu|2008|page=17}} Whereas Hōnen had emphasized mostly devotion to the Buddha Amitābha, he did not do so exclusively: Shinran, on the other hand, taught a path of devotion to only the Buddha Amitābha.{{sfn|Irons|2008|page=258}} Thus, Shinran's Pure Land Buddhism focused on a limited set of practices, in contrast to the many practices of Tendai Buddhism. Characteristic of this period in Japanese Buddhism was the selective nature of faith: Japanese Pure Land teachers such as Shinran taught that Pure Land was the {{em|only}} form of Buddhism that was the right path;<!--both refs--> other forms of Buddhism were criticized as ineffective for the Age of Dharma Decline. (This development of 'selective Buddhism', [[Japanese language|Japanese]]:''senchaku bukkyō'', would also affect Nichiren Buddhism.<!--Bielefeldt-->{{sfn|Bielefeldt|2004|pages=388–9}}{{sfn|Dobbins|2004a|page=412}}) Thirdly, although early Buddhism already emphasized letting-go of self-conceit by practicing the dharma, in the later Pure Land tradition this was drawn further by stating that people should give up all \"self-power\" and let the healing power of Amitābha do the work of attaining salvation for them.{{sfn|Harvey|2013|p=230}}{{sfn|Conze|2003|p=159}} This power was even believed to transcend the law of karma.<!--4934--> Moreover, whereas Honen had taught faith could be built up by the ''nembutsu'' practice, Shinran stated that faith needed to {{em|precede}} practice, and could not be built up through it.<!--4935-->{{sfn|Shōto|1987|page=4934–5}} A fourth characteristic of the movement was its democratic nature:{{sfn|Andrews|1987|p=4119}}{{sfn|Abe|1997|page=689}} in some passages Shinran stated that \"wicked\" people have just as much chance of attaining to the Pure Land as \"good\" people, an idea similar to the Christian concept of \"[[salvation of sinners]]\".<ref>{{cite book|url=http://www.e-reading.club/bookreader.php/142060/An_Introduction_to_Buddhist_Ethics.pdf|last1=Harvey|first1=Peter|title=An Introduction to Buddhist Ethics: Foundations, Values and Issues|date=2000|publisher=[[Cambridge University Press]]|location=New York|isbn=978-0-511-07584-1|page=143}}</ref>{{refn|group=note|However, some scholars have downplayed the role of new movements like Pure Land Buddhism in the [[Kamakura period]], stating that reform also took place in old Buddhist schools, and that some of the new movements only gained significance much later.{{sfn|Dobbins|2004a|page=414}}}}\n\nThe old Buddhist orders highly condemned the movement, for starting a new school, distorting Buddhist teachings, and reviling Gautama Buddha. When the emperor felt that some of Honen's monastics acted inappropriately, Hōnen was banished to a remote province for four years.{{sfn|Abe|1997|pp=691–2}}{{sfn|Andrews|1987|p=4120}}{{sfn|Buswell|Lopez|2013|loc=namu Amidabutsu}} When Shinran started to teach against the custom of celibacy, stating it indicated a lack of trust in Amitābha Buddha, he was banished as well.{{sfn|Abe|1997|pp=691–2}}{{sfn|Dobbins|2004a|page=413}} Apart from Shinran, other priests that emphasized faith in their interpretations were also banished, as their teachings were often embraced by a following which did not accept the authority of the aristocrats in power.{{sfn|Dobbins|2002|page=19}}\n\nIn the fifteenth century, [[Rennyo]] (1415–99), a disciple of Shinran considered the second founder of Shinran's [[Jōdo Shinshu]] school, tried to reform the school. He opposed Shinran's idea that morality was not required to enter the Pure Land and meet Amitābha Buddha. He believed that morality should go hand-in-hand with faith, and was a way to express gratitude to Amitābha.{{sfn|Harvey|2013|p=234}}{{sfn|Porcu|2008|page=18}} Jōdo Shinshu is still the most popular and largest Buddhist sect in Japan today,{{sfn|Green|2013|p=121}}{{sfn|Abe|1997|p=694}}{{sfn|Shōto|1987|page=4933}} surviving as the [[Hongan-ji#Nishi Hongan-ji|Nishi Hongwanji]] and the [[Hongan-ji#Higashi Hongan-ji|Higashi Hongwanji]] traditions.{{sfn|Irons|2008|p=268}}{{sfn|Buswell|Lopez|2013|loc=Jodo Shinshu}}\n\n==== Zen Buddhism ====\n{{Main|Zen Buddhism}}\n[[File:DogenP2.JPG|thumb|Painting of [[Dōgen]], a Japanese [[Zen]] teacher|alt=Painting of Dōgen, a Japanese Zen teacher]]\nJust like in Jōdo Shinshu, some forms of Zen Buddhism arose as a reaction to Tendai Buddhism. Just like Pure Land Buddhism, faith also played a role here, that is, in [[Sōtō Zen]]. This form of Zen, also known as \"farmer's Zen\" because of its popularity in agrarian society, was developed by [[Dōgen]] (1200–53).<!--p=231--> Apart from the focus on meditation practice which was common in Zen Buddhism, Dōgen led a revival of interest in the study of the ''sūtras'', which he taught would inspire to a faith based on understanding. Inspired by Chinese [[Chan Buddhism]], Dōgen was attracted to a return of the simple life as exemplified by the Buddha in the ''sūtras''. He further believed that sitting meditation was not only the path to enlightenment, but also a way to {{em|express}} the Buddha nature within. The practitioner should have the faith that the Buddha nature is already within, Dōgen taught, although Dōgen did not believe this was in the form of a [[Ātman (Buddhism)|permanent self]].<!--p=232-->{{sfn|Harvey|2013|pp=231–2}} Dōgen believed enlightenment was possible in this life—even the secular life—and he did not believe in the idea of the Age of Dharma Decline.{{sfn|Araki|1987|p=1245}}\n\n==== Avalokiteśvara ====\n{{Main|Avalokiteśvara}}\n[[File:Sculpture of Khasarpana Lokeshvara (c 11th–12th century), Indian Museum, Kolkata, India - 20150807.jpg|thumb|Sculpture of [[Avalokiteśvara]], with the five Celestial Buddhas on the top outer edge|alt=Sculpture of Avalokiteśvara, with the five Celestial Buddhas on the top outer edge]]\nIn East Asian Buddhism, there has been a strong focus on worship of the ''bodhisattva'' Avalokiteśvara. His cult originated in the northern borders of India, but he has been honoured for his compassion in many countries, such as China, Tibet, Japan, Sri Lanka and other parts of Southeast Asia, and among diverse levels of society.{{sfn|Higham|2004|p=29}}{{sfn|Birnbaum|1987|p=704}}\n\nThe text called the ''Avalokiteśvara Sūtra'' states that Avalokiteśvara will help anyone who speaks his name with faith, fulfilling many kinds of wishes, and awakening people to their compassionate Buddha nature.{{sfn|Harvey|2013|pp=250–1, 253}}{{sfn|Irons|2008|p=98}} Avalokiteśvara is strongly connected to the Buddha Amitābha, as it has been believed he lives in the same Pure Land, and will come to the rescue of those who invoke the name of the Buddha Amitābha.{{sfn|Gómez|2004a|p=15}}{{sfn|Birnbaum|1987|p=705}} Focusing on both mundane benefits and salvation,<!--Ford--> devotion to Avalokiteśvara was promoted through the spread of the Lotus Sūtra, which includes a chapter about him,<!--Stone and Birnbaum-->{{sfn|Stone|2004a|p=474}}{{sfn|Birnbaum|1987|p=705}}<ref>{{cite book|url=https://books.google.com/?id=ACnfqhZUgXYC|last=Ford|first=J.L.|year=2006|title=Jōkei and Buddhist Devotion in Early Medieval Japan|publisher=[[Oxford University Press]]|page=90|isbn=978-0-19-972004-0}}</ref> as well as through the [[Prajnaparamita|Perfection of Wisdom]] ''sūtras''.{{sfn|Powers|2013|loc=Avalokiteśvara}} Avalokiteśvara's devotees often depict him as a female, and in this female form she is known as [[Guanyin]] in China,<!--all refs--> originating from an association with the female Buddhist deity [[Tara (Buddhism)|Tārā]].<!--Snellgrove-->{{sfn|Harvey|2013|pp=250–1, 253}}{{sfn|Irons|2008|p=98}}{{sfn|Snellgrove|1987|p=1079}} Presently, Avalokiteśvara and his female form Guanyin are among the most depicted figures in Buddhism, and Guanyin is also worshiped by [[Daoist]]s.<ref>{{cite encyclopedia|last1=Irons|first1=Edward A.|editor1-last=Melton|editor1-first=J. Gordon|editor2-first=Martin|editor1-link=J. Gordon Melton|editor2-last=Baumann|encyclopedia=Religions of the world: a comprehensive encyclopedia of beliefs and practices|title=Statues-Buddhist|date=2010|publisher=[[ABC-CLIO]]|location=Santa Barbara, California|isbn=978-1-59884-204-3|url=http://ebook.umaha.ac.id/E-BOOK%20OF%20RELIGIOUS%20STAUDIES/ENCYCLOPEDIAS%20_%20DICTIONARY/RELEGIONS%20OF%20THE%20WORLD,%20A%20COMPREHENSIF%20ENCYCLOPEDIA.pdf|archive-url=https://www.webcitation.org/6vAE2WMY7?url=http://ebook.umaha.ac.id/E-BOOK%20OF%20RELIGIOUS%20STAUDIES/ENCYCLOPEDIAS%20_%20DICTIONARY/RELEGIONS%20OF%20THE%20WORLD%2C%20A%20COMPREHENSIF%20ENCYCLOPEDIA.pdf|archive-date=22 November 2017|dead-url=no|page=2721|edition=2nd|df=}}</ref>\n\n=== Other historical developments ===\n==== Deities ====\n\n{{Main|Buddhist deities}}\nIn Buddhism, Buddhas and other enlightened beings are the main focus of honour, comparable to that of gods in other religions. Although Buddhism does recognize the existence of deities, Buddhas and other enlightened beings are considered to be different, in that they are seen as outside of the [[samsara|cycle of existence]].<!--p=465--> This does not mean that worship of deities did not exist in Buddhism. However, worship of deities has often been considered a form of superstition or a form of [[skillful means]] to guide the unenlightened to a better life, and not much more than that.<!--p=466-->{{sfn|Rambelli|2004|pages=465–6}}\n\nIn the history of the diffusion of Buddhism, the relation between Buddhism and local deities was an important aspect of success, but Buddhists have often denied this because of local movements for orthodoxy. Furthermore, scholars have paid little interest to the role of local deities, since it is not covered by any of the standard academic disciplines studying Buddhism, such as Buddhist studies or anthropology. Nevertheless, deities had a role in Buddhist cosmology from early onward. Buddhist traditions saw them, however, as subordinate to the Buddha, and related many stories of them embracing the Buddhist teaching and even becoming protectors of it. When Buddhist teachers adopted existing cosmologies, but placed the Buddha on top of these systems, a [[Buddhist cosmology]] arose.<ref>{{cite encyclopedia|last1=Glassman|first1=Hank|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Sexuality|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=http://www.ahandfulofleaves.org/documents/Encyclopedia%20of%20Buddhism_2%20Vols_%20Buswell.pdf|page=762|deadurl=no|archiveurl=https://web.archive.org/web/20170614204648/http://www.ahandfulofleaves.org/documents/Encyclopedia%20of%20Buddhism_2%20Vols_%20Buswell.pdf|archivedate=2017-06-14|df=}}</ref>{{sfn|Rambelli|2004|page=466}} Part of this process was depicting these deities as violent and disorganized, as opposed to Buddhism and its practitioners—this was not far from the truth, as Buddhist missionaries often came from more ordered and less violent cultures. In this way snake-like deities (''[[nāga]]''), [[garuda|bird-like deities]] and [[yaksha|violent spirits]] which previously were the focus of pre-Buddhist cults became guardians of the Buddhist teaching.{{sfn|Rambelli|2004|page=467}} This process of adopting deities as part of Buddhism often occurred when Buddhist devotees or monks did not fully renounce their former devotions when embracing Buddhism.{{sfn|Snellgrove|1987|p=1076}} In the early Pāli scriptures, as well as in some customs in traditional Buddhist societies, traces can still be found of the period that Buddhism competed with ''nāga'' worship and assimilated some of its features.<ref>{{cite book|last1=Gombrich|first1=Richard F.|authorlink1=Richard F. Gombrich|title=How Buddhism began: the conditioned genesis of the early teachings|date=2006|publisher=[[Routledge]]|location=London|isbn=0-415-37123-6|url=http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.694.6690&rep=rep1&type=pdf|pages=72–5|edition=2nd|deadurl=no|archiveurl=https://web.archive.org/web/20171122123610/http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.694.6690&rep=rep1&type=pdf|archivedate=2017-11-22|df=}}</ref>\n\nIn some Buddhist countries like Japan, a perspective arose of the human world as a [[Macrocosm and microcosm|microcosm]] of the macrocosmic realms of the Buddhas. This allowed for an increased tolerance of local traditions and [[folk religion]], which were seen as connected with this macrocosmos, and thus part of Buddhism.{{sfn|Bielefeldt|2004|p=390}} All of these developments led Buddhism to include many deities into its system of faith, but each deity was given his place and role, subordinate to the Buddha.{{sfn|Rambelli|2004|pages=465–7}}{{sfn|Swearer|1987|page=3154}} Even the exclusive Jōdo Shinshu taught not to denigrate the worship of [[Shinto]] deities called ''[[kami]]'', though the school did not allow the worship either.{{sfn|Dobbins|2002|pp=39, 58}} Furthermore, in many Buddhist countries ritual specialists of pre-Buddhist traditions were given a duty besides Buddhist monks.<!--p=467--> These specialists were usually laypeople, who performed these functions besides their normal lay life.<!--p=468-->{{sfn|Rambelli|2004|pages=467–8}}<ref name=\"Kariyawasam\" />\n\nBuddhism did not only [[cultural appropriation|appropriate]] deities into the religion, but also adapted its own teachings. According to religious studies scholar Donald Swearer, ''bodhisattvas'', relic worship and hagiographies of Buddhist masters were ways for Buddhism to adapt to pre-Buddhist deities and [[animism|animistic]] beliefs, by fitting these into the Buddhist thought system. East Asian Buddhist movements like the Chinese White Lotus were transformations of such animistic beliefs. Such transformation of pre-Buddhist beliefs also explains the popularity of movements like Japanese Pure Land Buddhism under Hōnen and Shinran, even though in their teachings they opposed animism.{{sfn|Swearer|1987|page=3155–6}}\n\n==== Millenarianism ====\n\n{{Main|Millenarianism}}\n{{See also|Merit (Buddhism)#Phu Mi Bun movements}}\n<!--\"Merit#Phu Mi Bun movements\" links here. Please adjust wikilink over there if this section is (re)moved.-->\nBuddhism is the strongest form of non-western millenarianism.<ref name=\"Landes\">{{cite encyclopedia|last1=Landes|first1=Richard A.|author-link=Richard Landes|editor1-last=Landes|editor1-first=Richard A.|editor1-link=Richard Landes|encyclopedia=Encyclopedia of Millennialism and Millennial Movements|title=Millennialism in the Western World|date=2000|publisher=[[Taylor & Francis]]|location=Hoboken|isbn=0-203-00943-6|url=http://www.encyclopedias.biz/dw/Encyclopedia%20of%20Millennialism%20and%20Millennial%20Movements.pdf|archive-url=https://www.webcitation.org/6vAExhb2K?url=http://www.encyclopedias.biz/dw/Encyclopedia%20of%20Millennialism%20and%20Millennial%20Movements.pdf|archive-date=22 November 2017|dead-url=no|page=463|df=}}</ref> In many Buddhist traditions, there is a concept of a [[apocalypse|time when the world will end]].<!--p=537--> The concept of a [[millenarian]] figure arising in the world at an apocalyptic age exists in many Buddhist traditions. In Buddhism, the growth and decline of the world is believed to come in [[kalpa (aeon)|cycles]], and the declining period is believed to end with the arising of the ''cakravartin'' and finally, the coming of the future Buddha who will start a new prosperous period. Devotion to such a [[messianism|messianic]] Buddha figure has been part of almost every Buddhist tradition.<!--p=538-->{{sfn|DuBois|2004|pp=537–8}} Millenarian movements are typically a form of cultural defiance of the dominant culture, resisting \"the attempt to put reason and logic over faith\", according to political scientist William Miles.<ref>{{cite journal|last1=Miles|first1=W. F. S.|title=Millenarian Movements as Cultural Resistance: The Karen and Martinican Cases|journal=Comparative Studies of South Asia, Africa and the Middle East|date=29 March 2011|volume=30|issue=3|page=647|doi=10.1215/1089201x-2010-041|url=http://ocean.sci-hub.tw/70932cef9ffd16083cc608c774b7033f/10.1215%401089201X-2010-041.pdf|deadurl=no|archiveurl=https://web.archive.org/web/20180127004601/http://ocean.sci-hub.tw/70932cef9ffd16083cc608c774b7033f/10.1215%401089201X-2010-041.pdf|archivedate=27 January 2018|df=}}</ref>\n\nEast Asian traditions especially associated the end of the world with the coming of the future Buddha, that is Maitreya.<!--p=537, p=66--> The early Pāli texts only briefly mention him, but he features prominently in later Sanskrit traditions such as the [[Mahāsāṃghika]]. China, Burma and Thailand, came to honour him as part of millenarian movements, and they believed that Maitreya Buddha would arise during times of suffering and crisis, to usher in a new era of happiness.<!--p=538, p=67 (last sentence)-->{{sfn|DuBois|2004|pp=537–8}}{{sfn|Lazich|2000|pp=66–7}} From the fourteenth century onward, [[White Lotus]] sectarianism arose in China, which encompassed beliefs in the coming of Maitreya during an apocalyptic age.{{sfn|DuBois|2004|p=537}} Devotees of White Lotus societies believed that their faith in the correct teachings would save them when the new world era would come.<ref>{{cite book|last1=Naquin|first1=Susan|title=Millenarian Rebellion in China: The Eight Trigrams Uprising of 1813|date=1976|publisher=[[Yale University Press]]|location=New Haven|isbn=0-300-01893-2|page=13|url=http://hdl.handle.net/1811/5983}}</ref> White Lotus millenarianist beliefs would prove persistent, and survived all the way into the nineteenth century, when the Chinese associated the coming of Maitreya's age with political revolution. But the nineteenth century had not been the first century in which millenarian beliefs sparked political changes: during most of China's history, faith in and worship of Maitreya Buddha often inspired rebellions to change society for the better, to await Maitreya.{{sfn|DuBois|2004|pp=537, 539}}{{sfn|Lazich|2000|pp=67–8}} Some of these rebellions led to powerful revolutions and the destruction of royal dynasties.<ref name=\"Landes\" /> Nevertheless, faith in the coming of a new era of Maitreya was not just political propaganda to incite rebellion, but was, in the words of Chinese Studies scholar Daniel Overmyer, \"rooted in continuously existing cultic life.\"<ref>{{cite book|last1=Overmyer|first1=Daniel L.|title=Folk Buddhist Religion: Dissenting Sects in Late Traditional China|date=2013|publisher=[[Harvard University Press]]|isbn=978-0-674-18316-2|pages=83–4|url=http://booksc.org/dl/44859454/58bb3f}}</ref>\n\nIn Japan, millenarian trends can be observed in the idea of the Age of Dharma Decline, which was most prominent in Nichiren Buddhism. However, more full-fledged forms of millenarianism developed from the nineteenth century onward, with the arising of [[Japanese new religions|new religions]].<ref>{{cite encyclopedia|last1=Reader|first1=Ian|editor1-last=Landes|editor1-first=Richard A.|editor1-link=Richard Landes|encyclopedia=Encyclopedia of Millennialism and Millennial Movements|title=Japan|date=2000|publisher=[[Taylor & Francis]]|location=Hoboken|isbn=0-203-00943-6|url=http://www.encyclopedias.biz/dw/Encyclopedia%20of%20Millennialism%20and%20Millennial%20Movements.pdf|archive-url=https://www.webcitation.org/6vAExhb2K?url=http://www.encyclopedias.biz/dw/Encyclopedia%20of%20Millennialism%20and%20Millennial%20Movements.pdf|archive-date=22 November 2017|dead-url=no|pages=350–1|df=}}</ref>\n\n=== Modern developments ===\n==== Buddhist modernism ====\n{{Main|Buddhist modernism}}\nAlthough in pre-modern times some schools of Buddhism de-emphasized faith in Buddhist practice,{{sfn|Buswell|Lopez|2013|loc=Baotang zong}} the role of faith really was only criticized widely in modern times. During the eighteenth century [[Age of Enlightenment|Enlightenment]], western intellectuals came to see religion as culturally relative, as opposed to the single truth of reason. By the end of the nineteenth century, this view on religion had informed how the West responded to Buddhism. Western writers such as [[Edwin Arnold]] began to present Buddhism as the answer to the contradiction between science and religion, as a rational religion devoid of culture. As western science and rationalism spread to Asia, Asian intellectuals such as in Sri Lanka developed similar ideas.{{sfn|Robinson|Johnson|1997|p=302}} Because of the threat of colonial powers and Christianity,<!--all refs--> and the rise of an urban middle class,<!--only Gombrich--> at the end of the nineteenth century Sri Lankan Buddhism started to change. Described by present-day scholars as [[Buddhist modernism|\"Buddhist modernism\" or \"protestant Buddhism\"]], westerners and British-educated Sri Lankans advocated Buddhism as a rational philosophy,<!-- all refs--> free from blind faith and idolatry, congruent with science and modern ideas.<!--all refs-->{{sfn|Baumann|1987|page=1187}}{{sfn|Harvey|2013|p=378}}{{sfn|Gombrich|2006|pp=196–7}} They saw traditional practices such as relic worship and other devotional routines as corruptions of an ideal, rational form of Buddhism,<ref>{{cite book|url=https://books.google.com/?id=ckSBgvtU42YC|last1=Trainor|first1=Kevin|title=Relics, ritual, and representation in Buddhism : rematerializing the Sri Lankan Theravāda tradition|date=1997|publisher=[[Cambridge University Press]]|location=Cambridge [u.a.]|isbn=0-521-58280-6|pages=19–20|edition=digital}}</ref>{{sfn|McMahan|2008|pp=65, 69}} while assimilating [[Victorian Age|Victorian]] and other modern values and designating them as traditional Buddhist, often without awareness.{{sfn|Gombrich|2006|pp=191–2}}\n\n[[File:Daisetsu Teitarō Suzuki photographed by Shigeru Tamura.jpg|left|thumb|upright|[[Daisetsu Teitarō Suzuki]], as photographed by [[Shigeru Tamura (photographer)|Shigeru Tamura]]|alt=Photograph of Daisetsu Teitarō Suzuki]]\nIn Japan, from the [[Meiji period]] onward, the Japanese heavily attacked Buddhism as a foreign and superstitious belief system. In response to this, Buddhist schools such as Zen developed a movement called \"New Buddhism\" (''Japanese: [[D. T. Suzuki#New Buddhism|shin bukkyo]]''), emphasizing rationalism, modernism and warrior ideals.<ref>{{cite encyclopedia|last1=Ahn|first1=Juhn|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Popular conceptions of Zen|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=http://www.ahandfulofleaves.org/documents/Encyclopedia%20of%20Buddhism_2%20Vols_%20Buswell.pdf|page=924|deadurl=no|archiveurl=https://web.archive.org/web/20170614204648/http://www.ahandfulofleaves.org/documents/Encyclopedia%20of%20Buddhism_2%20Vols_%20Buswell.pdf|archivedate=2017-06-14|df=}}</ref> Still in Japanese Buddhism, in the twentieth century, a critical response to traditional Buddhism arose, led by the two academics Hakamaya Noriaki and Matsumoto Shirō, called [[Critical Buddhism]]. Noriaki and Shirō's school of thought has criticized Chinese and Japanese Buddhist ideas for undermining critical thinking, promoting blind faith and laxity to improve society. [[East Asian Studies]] scholar Peter Gregory comments, however, that the attempt of Critical Buddhists at finding a pure, unadulterated Buddhism, ironically, reeks with the very same essentialism it criticizes.<ref name=\"Dennis 2005\">{{cite encyclopedia|last1=Dennis|first1=Mark|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Buddhism, Schools of: East Asian Buddhism|date=2005|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|page=1250|edition=2nd|url=https://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%202.pdf|volume=2|deadurl=yes|archiveurl=https://web.archive.org/web/20170302073830/https://www.politicalavenue.com/PDF/ENCYCLOPEDIAS/The%20Gale%20Encyclopedia%20of%20Religion%202nd%20Ed%20Vol.%202.pdf|archivedate=2017-03-02|df=}}</ref><ref>{{cite encyclopedia|last=Gregory|first=P.N.|year=1997|title=Is Critical Buddhism Really Critical?|encyclopedia=Pruning the Bodhi Tree: The Storm Over Critical Buddhism|pages=passim|nopp=yes|url=http://www.thezensite.com/ZenEssays/CriticalZen/Critical_Buddhism_Gregory.pdf|deadurl=no|archiveurl=https://web.archive.org/web/20160817164907/http://www.thezensite.com/ZenEssays/CriticalZen/Critical_Buddhism_Gregory.pdf|archivedate=2016-08-17|df=}}</ref> Other scholars have made similar arguments. Critical Buddhism criticizes blind faith and a belief in the Buddha Nature, but it does reserve a place for faith: Buddhist faith, states Noriaki, is the uncompromising critical capacity to distinguish between true and false Buddhism, and to commit to what is true Buddhism. Noriaki contrasts faith with [[Wa (Japanese culture)|the Japanese ideal of harmony]] (''wa''), which he believes goes hand-in-hand with uncritical acceptance of non-Buddhist ideals, including violence.{{sfn|Swanson|1993|pages=133–4}}{{sfn|Williams|2008|p=324 n.61}}\n\nDespite these widespread modernist trends in Asia, scholars have also observed decline of rationalism and resurfacing of pre-modern religious teachings and practices: From the 1980s onward, they observed that in Sri Lankan Buddhism devotional religiosity, magical practices, honouring deities as well as moral ambiguity had become more widespread, as the effects of Protestant Buddhism were becoming weaker. Richard Gombrich and anthropologist [[Gananath Obeyesekere]] have therefore spoken of ''{{dfn|post-protestant Buddhism}}'' to describe this trend.{{sfn|Harvey|2013|p=384}}<ref>{{cite encyclopedia|url=https://www.academia.edu/1417358/Aspects_of_Esoteric_Southern_Buddhism|url-access=registration|last=Cousins|first=L.S.|year=1997|title=Aspects of Esoteric Southern Buddhism|editor1-last=Connolly|editor1-first=P.|editor2-last=Hamilton|editor2-first=S.|encyclopedia=Indian Insights: Buddhism, Brahmanism and Bhakti: Papers from the Annual Spalding Symposium on Indian Religions|publisher=Luzac Oriental|page=188|deadurl=no|archiveurl=https://web.archive.org/web/20171122131255/https://www.academia.edu/1417358/Aspects_of_Esoteric_Southern_Buddhism|archivedate=2017-11-22|df=}}</ref><ref>{{cite book|last1=Gombrich|first1=Richard|last2=Obeyesekere|first2=Gananath|authorlink1=Richard Gombrich|authorlink2=Gananath Obeyesekere|title=Buddhism transformed: religious change in Sri Lanka|date=1990|publisher=[[Motilal Banarsidass]]|location=Dehli|isbn=8120807022|url=https://books.google.com/?id=rpN9atSFua0C|pages=415–7}}</ref>\n\n==== Twentieth-century Buddhism in the West ====\n[[File:Bhikku Bodhi.jpg|thumb|upright|[[Bhikkhu Bodhi]]|alt=Bhikkhu Bodhi]]\nWith the spread of Buddhism to the West in the twentieth century, devotional practices still played an important role among Asian ethnic communities, though much less so in Western \"convert\" communities. The influence of Buddhist modernism could also be felt in the West, where lay-led organizations often offered meditation courses without much emphasis on devotion. Writers like [[D. T. Suzuki]] described meditation as a trans-cultural and non-religious practise, which greatly appealed to westerners.{{sfn|Robinson|Johnson|1997|p=303}}{{refn|group=note|In reality, [[D. T. Suzuki]] made a point in some of his writings that [[Zen]] could not be separated from Buddhism.{{sfn|Robinson|Johnson|1997|p=303}}}} Thus, in Western, [[secular Buddhism]], meditation was more emphasized than in traditional Buddhist communities, and faith or devotion less.{{sfn|McMahan|2008|page=5}}{{sfn|Harvey|2013|pp=429, 444}} Just like in modern Asia, the rational and intellectual aspects of Buddhism were mostly emphasized in the West, as Buddhism was often favourably compared with Christianity.{{sfn|Baumann|1987|page=1189}} The author and Buddhist teacher [[Stephen Batchelor (author)|Stephen Batchelor]] has endeavoured to advocate a form of Buddhism which he believes to be original, ancient Buddhism, as it was before it became \"institutionalized as a religion\".{{sfn|McMahan|2008|page=244}}\n\nIn contrast to these typical modernist trends, it has also been observed that some western Buddhist communities show great commitment to their practice and belief, and for that reason are more traditional religious than most forms of [[New Age]] spirituality.<ref>{{cite journal|last1=Phillips|first1=Tim|last2=Aarons|first2=Haydn|title=Choosing Buddhism in Australia: towards a traditional style of reflexive spiritual engagement|journal=[[The British Journal of Sociology]]|date=June 2005|volume=56|issue=2|page=228|doi=10.1111/j.1468-4446.2005.00056.x}}</ref> Furthermore, several Buddhist teachers have spoken out against interpretations of Buddhism that do away with all faith and devotion, including translator and monastic [[Bhikkhu Bodhi]]. Bhikkhu Bodhi argues that many Westerners have misunderstood the ''[[Kalama Sutta|Kalāma Sutta]]'' {{see above|Verification|mid=yes}}, as Buddhism teaches that faith and personal verification should go hand-in-hand, and faith should not be discarded.{{sfn|McMahan|2008|p=248}}\n\nThe latter part of the twentieth century has seen a unique situation arising with regard to Buddhism in the West: for the first time since Buddhism left India many Buddhist traditions are able to communicate in the same language. This has led to an increased [[eclecticism]] between the different traditions.{{sfn|Robinson|Johnson|1997|p=307}} Furthermore, with the increase of scientific research in meditation methods, prominent Buddhist authors are pointing to scientific evidence to verify whether Buddhist practice is really effective or not, rather than referring to scriptural or monastic authority.<ref>{{cite journal |doi=10.1111/zygo.12391|title='The New Science of Health and Happiness': Investigating Buddhist Engagements with the Scientific Study Of Meditation|first=Jeff|last=Wilson|work=[[Zygon (journal)|Zygon]]|volume=53|issue=1}}</ref>\n\n==== Navayāna ====\n{{Main|Navayāna|Dalit Buddhist movement}}\nIn 1956, the Indian ''[[Dalit]]'' (untouchable) and icon [[Babasaheb Ambedkar|Ambedkar]] (1891–1956) led a mass conversion to Buddhism, starting a [[navayana|new Buddhist movement]] (''Navayāna''). This new movement led to a pattern of mass conversions, some of them reaching up to 500,000 people simultaneously converting. ''Dalits'' that were dissatisfied with the Indian [[caste system]] took refuge in Buddhism as a way out. In the 2010s, violent incidents affecting ''dalits'' led to a revival of mass conversions in [[Gujarat]] and other states. Some converts admit that the conversion is a political choice to reorganize themselves, as conversion could help them to no longer be classified by the Hindu caste system.<ref>{{cite news|last1=Dore|first1=Bhavya|title=Rising caste-related violence pushes many Indians to new faith|url=http://www.houstonchronicle.com/life/houston-belief/article/Rising-caste-related-violence-pushes-many-Indians-9523647.php|accessdate=23 September 2017|work=[[Houston Chronicle]]|agency=[[Hearst Newspapers]]|publisher=[[Religion News Service]]|date=1 October 2016|deadurl=no|archiveurl=https://web.archive.org/web/20170924045746/http://www.houstonchronicle.com/life/houston-belief/article/Rising-caste-related-violence-pushes-many-Indians-9523647.php|archivedate=24 September 2017|df=}}</ref>\n\nScholars have described [[Ambedkarism|Ambedkar's perspective on Buddhism]] as secular and modernist rather than religious, as he emphasized [[Buddhist atheism|the atheist aspects of Buddhism]] and rationality, and rejected [[Hindu soteriology]] and hierarchy.{{sfn|Ganguly|2006|pags=54}}<ref>{{cite journal|last1=Contursi|first1=Janet A.|title=Militant Hindus and Buddhist Dalits: Hegemony and Resistance in an Indian Slum|journal=[[American Ethnologist]]|date=1989|volume=16|issue=3|page=448|jstor=645267}}</ref> Other scholars have interpreted Ambedkarism as a form of critical traditionalism, in which Ambedkar reinterprets traditional Hindu concepts rather than rejecting them altogether.<!--p=54--> Specifically, scholar {{ill|Gauri Vishwanathan|de}} states that Ambedkar's ''Dalit'' conversions give belief a more central, worldly role than it had before.<!--p=55--> Cross-cultural researcher Ganguly Debjani, however, points at  religious elements in Ambedkar's description of the Buddha's life and teaching,<!--pp=56-7--> and states that Ambedkar [[deification|deifies]] the Buddha as the \"fount of Rationality\".<!--p=57--> Several scholars have argued that the Buddha and Ambedkar are honoured by his followers through traditional devotional practices ({{lang-sa|bhakti|script=Latn}}), such as story-telling, songs and poetry, festivals, and images, despite Ambedkar's rejection of such practices.<!--pp=59-60; Gokhale-->{{sfn|Ganguly|2006|pages=54–7, 59–60}}<ref>{{cite journal|title=\"Bhakti\" or \"Vidroha\": Continuity and Change in Dalit Sahitya|url=http://ocean.sci-hub.tw/c4d988922fd310f9b97bab85f5f45aec/10.1163%40156852180x00031.pdf|last=Gokhale-Tuerner|first=J.B.|year=1980|journal=[[Journal of Asian and African Studies]]|volume=15|issue=1|pp=38–9|deadurl=no|archiveurl=https://web.archive.org/web/20180128132543/http://ocean.sci-hub.tw/c4d988922fd310f9b97bab85f5f45aec/10.1163%40156852180x00031.pdf|archivedate=2018-01-28|df=}}</ref>\n\n== See also ==\n* [[Faith in Christianity]]\n* [[Faith in the Bahá'í Faith]]\n* [[Faith in Nyingma Buddhist Dharma]]\n\n== Notes ==\n{{Reflist|group=note}}\n\n== Citations ==\n{{Reflist|20em}}\n\n== Sources ==\n{{refbegin}}\n*{{Citation|url=https://books.google.com/?id=KYmLokZwVG0C|last1=Abe|first1=Masao|author-link=Masao Abe|editor1-last=Carr|editor1-first=Brian|editor2-last=Mahalingam|editor2-first=Indira|encyclopedia=Companion encyclopedia of Asian philosophy|title=Buddhism in Japan|date=1997|publisher=[[Routledge]]|location=London|isbn=0-415-03535-X|pages=675–719}}\n* {{Citation|last1=Andrews|first1=Allen A.|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Hōnen|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865739-X|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ|volume=6|}}\n*{{citation|last1=Araki|first1=Michio|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Buddhism, Schools of: Japanese Buddhism|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|pages=1241–6|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ}}\n*{{citation|last1=Barber|first1=A.W.|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Pure Land Schools|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=5n0YAAAAIAAJ|pages=706–9}}\n* {{Citation|editor-last=Law|editor-first=B.C.|year=1931|encyclopedia=Buddhistic studies|title=Faith in Buddhism|last=Barua|first=B.M.|url=https://archive.org/download/in.ernet.dli.2015.279751/2015.279751.Buddhistic-Studies.pdf|publisher=[[Thacker's Indian Directory]]|oclc=701790696|pages=329–49}}\n*{{citation|last1=Baumann|first1=Martin|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Buddhism: Buddhism in the West|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|pages=1186–92|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ}}\n*{{Citation|last1=Bielefeldt|first1=Carl|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Japan|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=L34YAAAAIAAJ|pages=384–91}}\n*{{citation|last1=Birnbaum|first1=Raoul|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Avalokiteśvara|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|pages=704–7|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ}}\n*{{citation|last1=Buswell|first1=Robert E. Jr.|author1-link=Robert Buswell Jr.|last2=Lopez|first2=Donald S. Jr.|author2-link=Donald S. Lopez Jr.|title=Princeton Dictionary of Buddhism|date=2013|publisher=[[Princeton University Press]]|location=Princeton, NJ|isbn=978-0-691-15786-3|url=https://books.google.com/?id=DXN2AAAAQBAJ}}\n* {{Citation|last1=Conze|first1=Edward|authorlink1=Edward Conze|title=Buddhism, its essence and development|date=2003|orig-year=1951|publisher=[[Dover Publications]]|location=Mineola, N.Y.|isbn=0-486-43095-2|url=https://www.scribd.com/document/86358877/Buddhism-Its-Essence-and-Development-Edward-Conze}}\n*{{Citation|last1=Derris|first1=Karen|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Buddhas and Bodhisattvas: Ethical practices|date=2005|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|page=1084|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ}}\n* {{Citation|editor1-last=Malalasekera|editor1-first=Gunapala Piyasena|editor1-link=G. P. Malalasekera|first=Lily|last=De Silva|encyclopedia=Encyclopaedia of Buddhism|title=Faith|date=2002|volume=V|publisher=Government of Ceylon|url=https://www.scribd.com/document/283215709/Enceylopaedia-of-Buddhism-Vol-V}}\n* {{Citation|last1=Dobbins|first1=James C.|authorlink1=James C. Dobbins|title=Jodo Shinshu: Shin Buddhism in medieval Japan|date=2002|publisher=[[University of Hawaii Press]]|location=Honolulu|isbn=0-8248-2620-5|url=https://books.google.com/?id=Xb3BImNUdRAC}}\n*{{citation|last1=Dobbins|first1=James C.|author1-link=James C. Dobbins|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Kamakura Buddhism, Japan|encyclopedia=Encyclopedia of Buddhism|date=2004a|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=L34YAAAAIAAJ|pages=411–5}}\n*{{citation|last1=DuBois|first1=Thomas|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Millenarianism and millenarian movements|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=5n0YAAAAIAAJ|pages=537–40}}\n* {{citation|first=Ellison Banks|last=Findly|year=1992|title=Ānanda's Hindrance: Faith (''Saddha'') in early Buddhism|journal=Journal of Indian Philosophy|volume=20|issue=3|pages=253–273|doi=10.1007/bf00157758}}\n* {{Citation|last1=Findly|first1=Ellison Banks|title=Dāna: giving and getting in Pali Buddhism|date=2003|publisher=[[Motilal Banarsidass Publishers]]|location=Delhi|isbn=81-208-1956-X|url=https://books.google.com/?id=88HcN_9muXcC|series=Buddhist Traditions|volume=52}}\n*{{citation|last1=Fuller|first1=Paul|title=The notion of diṭṭhi in Theravāda Buddhism : the point of view|date=2004|publisher=[[RoutledgeCurzon]]|location=London|isbn=0-203-01043-4|url=https://books.google.nl/books?id=Ork586jWfK4C}}\n*{{Citation|last1=Ganguly|first1=Debjani|title=Buddha, ''Bhakti'' and Superstition: A Post‐secular Reading of Dalit Conversion|journal=[[Postcolonial Studies]]|date=7 August 2006|volume=7|issue=1|doi=10.1080/1368879042000210621}}\n*{{citation|last1=Getz|first1=Daniel A.|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Pure Land Buddhism|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=5n0YAAAAIAAJ|pages=698–703}}\n* {{Citation|last1=Gombrich|first1=Richard F.|authorlink1=Richard F. Gombrich|title=Buddhist precept and practice: traditional Buddhism in the rural highlands of Ceylon|date=1995|publisher=[[Kegan Paul]]|location=London [u.a.]|isbn=0-7103-0444-7|url=https://books.google.com/?id=V3Z-dHpBsBsC}}\n* {{Citation|last1=Gombrich|first1=Richard F.|authorlink1=Richard F. Gombrich|title=Theravāda Buddhism: a social history from ancient Benares to modern Colombo|url=https://books.google.com/?id=AbJ_AgAAQBAJ|date=2006|publisher=[[Routledge]]|location=London [u.a.]|isbn=0-415-36508-2|edition=2nd}}\n* {{Citation|last1=Gombrich|first1=Richard F.|authorlink1=Richard F. Gombrich|title=What the Buddha thought|date=2009|publisher=[[Equinox Publishing (Sheffield)|Equinox Publishing]]|location=London [u.a.]|isbn=978-1-84553-612-1|url=https://books.google.com/?id=YMIlAQAAMAAJ}}\n*{{citation|last1=Gómez|first1=Luis O.|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Amitābha|encyclopedia=Encyclopedia of Buddhism|date=2004a|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=L34YAAAAIAAJ|pages=14–5}}\n*{{citation|last1=Gómez|first1=Luis O.|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Faith|encyclopedia=Encyclopedia of Buddhism|date=2004b|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=L34YAAAAIAAJ|pages=277–9}}\n*{{Citation|last1=Green|first1=Ronald S.|editor1-last=Emmanuel|editor1-first=Steven M.|encyclopedia=A companion to Buddhist philosophy|title=East Asian Buddhism|date=2013|publisher=[[Wiley-Blackwell]]|location=Chichester, West Sussex|isbn=978-0-470-65877-2|url=https://books.google.com/?id=P_lmCgAAQBAJ}}\n*{{citation|last1=Harvey|first1=Peter|title=An introduction to Buddhism: teachings, history and practices|date=2013|publisher=[[Cambridge University Press]]|location=New York|isbn=978-0-521-85942-4|edition=2nd|url=https://books.google.com/?id=u0sg9LV_rEgC}}\n*{{Citation|last1=Higham|first1=Charles F.W.|author-link=Charles Higham (archaeologist)|title=Encyclopedia of ancient Asian civilizations|date=2004|publisher=[[Facts On File]]|location=New York|isbn=0-8160-4640-9|url=https://archive.org/download/Encyclopedia-of-ancient-asian-civilzations/encyclopedia-of-ancient-asian-civilizations1.pdf}}\n* {{Citation|url=https://www.academia.edu/29254384/The_pragmatic_efficacy_of_saddh|doi=10.1007/BF00178816|url-access=registration|last=Hoffmann|first=Frank J.|year=1987|title=The pragmatic efficacy of \"Saddha\"|journal=[[Journal of Indian Philosophy]]|volume=15|issue=4|issn=1573-0395|pages=399–412}}\n*{{Citation|last1=Holder|first1=John J.|editor1-last=Emmanuel|editor1-first=Steven M.|title=A survey of early Buddhist epistemology|encyclopedia=A companion to Buddhist philosophy|date=2013|publisher=[[Wiley-Blackwell]]|location=Chichester, West Sussex|isbn=978-0-470-65877-2|url=https://books.google.com/?id=P_lmCgAAQBAJ}}\n* {{Citation|editor-last1=Cheng|editor-first1=Linsun|editor-last2=Brown|editor-first2=Kerry|last=Hsieh|first=Ding-hwa|encyclopedia=Berkshire encyclopedia of China|title=Buddhism, Pure Land|date=2009|publisher=[[Berkshire Publishing Group]]|location=Great Barrington, MA|isbn=978-0-9770159-4-8|url=https://books.google.com/?id=0_Z2AQAACAAJ}}\n*{{citation|last1=Hudson|first1=Clarke|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Buddhist meditation: East Asian Buddhist meditation|date=2005|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|pages=1290–5|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ}}\n*{{citation|last1=Irons|first1=Edward A.|series=Encyclopedia of World Religions|title=Encyclopedia of Buddhism|date=2008|publisher=[[Facts on File]]|location=New York|isbn=978-0-8160-5459-6|url=https://books.google.com/?id=IKVKOAAACAAJ}}\n* {{Citation|url=https://books.google.com/?id=6pBTAQAAQBAJ|last1=Jayatilleke|first1=K.N.|authorlink1=K.N. Jayatilleke|title=Early Buddhist theory of knowledge|date=1963|publisher=[[George Allen & Unwin]]|isbn=1-134-54287-9}}\n* {{Citation|title=Buddhist Philosophy: A Historical Analysis|first=David J.|last=Kalupahana|author-link=Kalupahana|year=1976|publisher=[[University of Hawaii Press]]|location=Honolulu|url=https://books.google.com/?id=EBggX7yZkCQC|isbn=0-8248-0360-4}}\n*{{citation|last1=Kinnard|first1=Jacob N.|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Worship|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=5n0YAAAAIAAJ|pages=905–7}}\n* {{Citation|url=https://books.google.com/?id=sJwEAAAAYAAJ|last1=Lamotte|first1=Etienne|authorlink1=Etienne Lamotte|translator-first=Sara|translator-last=Webb-Boin|title=Histoire du Bouddhisme Indien, des origines à l'ère Śaka|language=french|trans-title=History of Indian Buddhism: from the origins to the Saka era|date=1988|publisher=[[Université catholique de Louvain]], Institut orientaliste|location=Louvain-la-Neuve|isbn=906831100X|df=}}\n*{{citation|last1=Lazich|first1=Michael C.|editor1-last=Landes|editor1-first=Richard A.|editor1-link=Richard Landes|encyclopedia=Encyclopedia of Millennialism and Millennial Movements|title=Asia|date=2000|publisher=[[Taylor & Francis]]|location=Hoboken|isbn=0-203-00943-6|url=https://books.google.com/?id=NbIMmAEACAAJ|pages=64–71|}}\n* {{Citation|last1=Leaman|first1=Oliver|author-link=Oliver Leaman|url=https://books.google.com/?id=FLuEAgAAQBAJ|title=Eastern philosophy: key readings|date=2000|publisher=[[Routledge]]|location=London [u.a.]|isbn=0-415-17357-4}}\n* {{Citation|url=https://books.google.com/?id=KYmLokZwVG0C|last1=Lindtner|first1=Chr.|editor1-last=Carr|editor1-first=Brian|editor2-last=Mahalingam|editor2-first=Indira|encyclopedia=Companion encyclopedia of Asian philosophy|title=Nāgārjuna|date=1997|publisher=[[Routledge]]|location=London|isbn=0-415-03535-X|pages=314–33}}\n* {{Citation|last1=McMahan|first1=David L.|title=The Making of Buddhist Modernism|date=2008|publisher=[[Oxford University Press]]|isbn=978-0-19-972029-3|url=https://books.google.com/?id=XU6HNwlxhCAC}}\n*{{Citation|url=https://books.google.com/?id=KYmLokZwVG0C|last1=Nakamura|first1=Hajime|author-link=Hajime Nakamura|editor1-last=Carr|editor1-first=Brian|editor2-last=Mahalingam|editor2-first=Indira|encyclopedia=Companion encyclopedia of Asian philosophy|title=Knowledge and reality in Buddhism|date=1997|publisher=[[Routledge]]|location=London|isbn=0-415-03535-X|pages=391–406}}\n* {{Citation|url=https://books.google.com/?id=_A2QS03MP5EC|last1=Park|first1=Sung Bae|title=Buddhist faith and sudden enlightenment|date=1983|publisher=[[State University of New York Press]]|location=Albany, N.Y.|isbn=0-87395-673-7}}\n*{{Citation|url=https://books.google.com/?id=JaAMAQAAMAAJ|last=Porcu|first=E|year=2008|title=Pure Land Buddhism in Modern Japanese Culture|location=Leiden|publisher=[[Brill Publishers]]}}\n* {{Citation|last1=Powers|first1=John|authorlink1=John Powers (academic)|title=A Concise Encyclopedia of Buddhism|date=2013|publisher=[[Oneworld Publications]]|isbn=978-1-78074-476-6|url=https://books.google.com/?id=kZycAwAAQBAJ}}\n*{{citation|last1=Rambelli|first1=Fabio|author-link=Fabio Rambelli|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Local divinities and Buddhism|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=L34YAAAAIAAJ|pages=465–9}}\n* {{Citation|last1=Reynolds|first1=Frank E.|last2=Hallisey|first2=Charles|author-link2=Charles Hallisey|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Buddha|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|pages=1075–83|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ}}\n* {{Citation|url=https://books.google.com/?id=LhUSAQAAIAAJ|last1=Robinson|first1=Richard H.|last2=Johnson|first2=Willard L.|title=The Buddhist religion: a historical introduction|date=1997|publisher=[[Cengage]]|location=Belmont, California|isbn=0-534-20718-9|edition=4th}}\n* {{Citation|last1=Rotman|first1=Andy|title=Thus Have I Seen: Visualizing Faith in Early Indian Buddhism|date=2008|publisher=[[Oxford University Press]]|isbn=978-0-19-045117-2|url=https://books.google.com/?id=a-0JCAAAQBAJ}}\n*{{citation|last1=Schopen|first1=Gregory|author-link=Gregory Schopen|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Mahāyāna|encyclopedia=Encyclopedia of Buddhism|date=2004|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=5n0YAAAAIAAJ|pages=492–9}}\n* {{Citation|last1=Shields|first1=James Mark|editor1-last=Emmanuel|editor1-first=Steven M.|encyclopedia=A companion to Buddhist philosophy|title=Political Interpretations of the ''Lotus Sūtra''|date=2013|publisher=[[Wiley-Blackwell]]|location=Chichester, West Sussex|isbn=978-0-470-65877-2|url=https://books.google.com/?id=P_lmCgAAQBAJ}}\n* {{Citation|last1=Shōto|first1=Hase|editor1-last=Jones|translator-last=Becker|translator-first=Carl|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Jōdo Shinshu|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865740-3|pages=4933–6|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ|volume=7}}\n*{{citation|url=https://books.google.com/?id=KYmLokZwVG0C|last1=Smart|first1=Ninian|author-link=Ninian Smart|editor1-last=Carr|editor1-first=Brian|editor2-last=Mahalingam|editor2-first=Indira|encyclopedia=Companion encyclopedia of Asian philosophy|title=The Buddha|date=1997|publisher=[[Routledge]]|location=London|isbn=0-415-03535-X|pages=276–85}}\n* {{Citation|last1=Snellgrove|first1=David L.|author-link=David Snellgrove|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Buddhas and Bodhisattvas: Celestial Buddhas and Bodhisattvas|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865997-X|pages=1059–71|edition=2nd|volume=2|url=https://books.google.com/?id=ODIOAQAAMAAJ}}\n* {{Citation|url=https://books.google.com/?id=GnYou0owQ5MC|title=Buddhism and society: a great tradition and its Burmese vicissitudes|date=1982|publisher=[[University of California Press]]|isbn=0-520-04672-2|edition=2nd|location=Berkeley u.a.|last1=Spiro|first1=Melford E.|author-link=Melford Spiro}}\n* {{Citation|last=Stone|first=Jacqueline, I.|url=http://www.princeton.edu/~jstone/lotus-sutra-tendai-nichiren.html|archive-url=https://web.archive.org/web/20150104034316/http://www.princeton.edu/~jstone/lotus-sutra-tendai-nichiren.html|archive-date=4 January 2015|dead-url=no|title=Chanting the August Title of the Lotus Sutra: Daimoku Practices in Classical and Medieval Japan|editor-last=Payne|editor-first=Richard, K.|encyclopedia=Re-Visioning Kamakura Buddhism|publisher=[[University of Hawaii Press]]|year=1998|pages=116–66|isbn=0-8248-2078-9}}\n\n*{{citation|last1=Stone|first1=Jacqueline I.|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Lotus Sūtra (Saddharmapuṇḍarīka-Sūtra)|encyclopedia=Encyclopedia of Buddhism|date=2004a|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=5n0YAAAAIAAJ|pages=471–7}}\n* {{Citation|last1=Stone|first1=Jacqueline I.|editor1-last=Buswell|editor1-first=Robert E.|editor1-link=Robert Buswell Jr.|title=Nichiren School|encyclopedia=Encyclopedia of Buddhism|date=2004b|publisher=Macmillan Reference USA, [[Thomson Gale]]|location=New York [u.a.]|isbn=0-02-865720-9|url=https://books.google.com/?id=5n0YAAAAIAAJ|pages=595–8}}\n* {{citation|editor1-last=Malalasekera|editor1-first=Gunapala Piyasena|editor1-link=G. P. Malalasekera|first=Samaneri|last=Suvimalee|encyclopedia=Encyclopaedia of Buddhism|title=Saddhā|date=2005|volume=VII|publisher=Government of Ceylon|url=https://www.scribd.com/doc/283220451/Enceylopaedia-of-Buddhism-Vol-Vii|oclc=781859662}}\n* {{Citation|doi=10.1163/156852793x00112|last=Swanson|first=P.L.|year=1993|title='Zen Is Not Buddhism': Recent Japanese Critiques of Buddha-Nature|journal=[[Numen (journal)|Numen]]|volume=40|issue=2|pages=115–49}}\n* {{Citation|last1=Swearer|first1=Donald K.|editor1-last=Jones|editor1-first=Lindsay|encyclopedia=Encyclopedia of religion|title=Folk Religion: Folk Buddhism|date=1987|publisher=[[Thomson Gale]]|location=Detroit|isbn=0-02-865738-1|edition=2nd|url=https://books.google.com/?id=ODIOAQAAMAAJ}}\n* {{Citation|title=The History of Buddhist Thought|first=Edward J.|last=Thomas|author-link=Edward J. Thomas|location=London|publisher=[[Routledge and Kegan Paul]]|edition=2nd|year=1953|series=History of Civilization|url=https://archive.org/download/historyofbuddhis031559mbp/historyofbuddhis031559mbp.pdf|oclc=499999025}}\n* {{Citation|last=Trainor|first=K.M.|year=1989|title=Pasanna/Pasada in the Pali Vamsa Literature |journal=Vidyodaya |issn=1391-1937|volume=3 |url=http://dr.lib.sjp.ac.lk/bitstream/123456789/451/1/Pasanna%20Pasada%20in%20the%20Pali.pdf|pages=185–90}}\n*{{citation|last=Welch|first=Holmes|title=The Practice of Chinese Buddhism, 1900–1950|publisher=[[Harvard University Press]]|year=1967|url=https://archive.org/download/practiceofchines00welc/practiceofchines00welc_encrypted.pdf}}\n* {{Citation|url=https://books.google.com/?id=yMxdAgAAQBAJ|editor-last=Werner|editor-first=Karel|last1=Werner|first1=Karel|authorlink1=Karel Werner|encyclopedia=Love Divine Studies in Bhakti and Devotional Mysticism|title=Love and Devotion in Buddhism|date=2013|publisher=[[Taylor and Francis]]|location=Hoboken|isbn=1-136-77461-0}}\n*{{citation|last1=Wijayaratna|first1=Mohan|translator1-first=Claude|translator1-last=Grangier|translator2-first=Steven|translator2-last=Collins|title=Buddhist monastic life: according to the texts of the Theravāda tradition|date=1990|publisher=[[Cambridge University Press]]|isbn=0-521-36428-0|url=https://books.google.com/?id=ftlu5U-Mw8QC}}\n* {{citation|last=Williams |first=Paul |author-link=Paul_Williams_(Buddhist_studies_scholar)|title=Mahayana Buddhism: The Doctrinal Foundations |url=https://books.google.com/?id=Z3FuzkBnOxAC |year=2008 |edition=2 |publisher=[[Taylor & Francis]]|isbn=0-203-42847-1}}\n{{refend}}\n\n== External links ==\n* [https://www.youtube.com/watch?v=koCvglXxtHE BBC documentary about the nature of Buddhist faith in traditional Buddhist countries, with comments from notable scholars]\n* [https://www.youtube.com/watch?v=G6KyQIo9Q7M BBC documentary about self-power and other-power in Japanese Buddhism], by [[Ronald Eyre]], part of the awarded ''[[The Long Search]]'' series\n* [https://www.theguardian.com/commentisfree/belief/2013/oct/07/is-buddhism-a-religion Is Buddhism a Religion?] First of a series of articles in the British newspaper ''[[The Guardian]]'' about the religious and secular aspects of Buddhism\n* [https://www.youtube.com/watch?v=MuHi9Zpx7zo Debate held by the Melbourne Insight Meditation Group about being Buddhist, orthodoxy and faith], between  Ajahn Brahmali and [[Stephen Batchelor (author)|Stephen Batchelor]]\n\n{{Buddhism topics}}\n\n[[Category:Buddhist belief and doctrine]]\n[[Category:Buddhist texts]]\n[[Category:Pure Land Buddhism]]\n[[Category:Nichiren Buddhism]]\n[[Category:Early Buddhist texts]]\n[[Category:Faith]]",
            "slug": "faith-in-buddhism",
            "date_updated": 1531839340500,
            "imported": "https://en.wikipedia.org/wiki/Faith_in_Buddhism"
        }
    ]
}