{
    "article": [
        {
            "title": "maitreya",
            "text": "{{About|the Buddhist bodhisattva Maitreya}}\n{{Infobox Buddha\n| name             = Maitreya Buddha\n| image            = KushanMaitreya.JPG\n| caption          = Maitreya from [[Gandhara]], 2nd Century\n| sanskrit_name    = मैत्रेय<br>(Maitreya)\n| devanagari_name  = मैत्रिय <br>(Maitreya)\n| pali_name        = Metteyya\n| bengali_name     = মৈত্রেয় বুদ্ধ <br>(Moitreyo Buddho)\n| sinhala_name     = මෛත්‍රී බුදුන් <br>(Maithri Budun)\n| chinese_name     = 彌勒菩薩 <br>(Mílè Púsa)\n| japanese_name    = 弥勒菩薩 <br>(Miroku Bosatsu)\n| okinawan_name    = 弥勒御迎 <br>(Miruku Unkee)\n| tibetan_name     = བྱམས་པ་\n| khmer_name       = ព្រះសិអារ្យមេត្រី<br>(Preah Se A Metrey)\n| korean_name      = 미륵보살 <br>(Mireuk Bosal)\n| thai_name        = พระศรีอริยเมตไตรย <br>(Phra Si Ariya Mettrai)\n| vietnamese_name  = Di-lặc (bồ-tát)\n| mongolian_name   = ᠮᠠᠶᠢᠳᠠᠷᠢ᠂ ᠠᠰᠠᠷᠠᠯᠲᠣ;<br /><small>Майдар, Асралт;<br />Mayidari, Asaraltu</small>\n| burmese_name     = အရိမေတ္တယျ <br>{{IPA-my|ʔəɹḭmèdja̰|}}\n| shan_name        = {{my|ဢရီႉမိတ်ႈတေႇယႃႉ}}\n| karen_name      = မဲၣ်တယါ ဘူးဒး<br> (Mehtuhyah Boodah)\n| veneration       = [[Mahayana]], [[Theravada]], [[Vajrayana]]\n| attributes       = [[Metta|Loving Kindess]]\n| shakti           =\n| preceded_by      = [[Gautama Buddha]]\n| succeeded_by     =\n}}\n{{buddhism}}\n{{Eschatology}}\n[[File:Maitreya Koryuji.JPG|thumb|A statue of the bodhisattva Maitreya, at [[Kōryū-ji]]]]\n'''Maitreya''' ([[Sanskrit]]), '''Metteyya''' ([[Pali]]), is regarded as a future [[Buddhahood|Buddha]] of this world in [[Buddhist eschatology]]. In some [[Buddhist texts|Buddhist literature]], such as the ''[[Amitabha Sutra]]'' and the ''[[Lotus Sutra]]'', he is referred to as '''Ajita'''.\n\nAccording to [[Buddhism|Buddhist]] tradition, Maitreya is a [[bodhisattva]] who will appear on Earth in the future, achieve complete [[Enlightenment in Buddhism|enlightenment]], and teach the pure [[dharma]]. According to scriptures, Maitreya will be a successor to the present Buddha, [[Gautama Buddha]] (also known as Śākyamuni Buddha).<ref name=Horner97>[[#refHorner1975|Horner (1975)]], ''The minor anthologies of the Pali canon'', p. 97. Regarding Metteyya, Bv XXVII, 19: \"I [Gautama Buddha] at the present time am the Self-Awakened One, and there will be Metteyya....\"</ref><ref name=BDEA>{{cite web|author=Buddha Dharma Education Association|title=Suttanta Pitaka: Khuddaka Nikāya: 14.Buddhavamsa-History of the Buddhas|work=Guide to Tipiṭaka|publisher=Buddha Dharma Education Association|location=Tullera, NSW, Australia|year=2014|url=http://www.buddhanet.net/budvamsa.htm|accessdate=2014-12-21}}</ref> The prophecy of the arrival of Maitreya refers to a time in the future when the dharma will have been forgotten by most on the [[Jambudvipa|terrestrial world]].\n\nMaitreya has also been adopted for his millenarian role by many non-Buddhist religions in the past, such as the [[White Lotus]], as well as by modern [[new religious movement]]s, such as [[Yiguandao]].\n\n==Sources==\nThe name ''Maitreya'' is derived from the Sanskrit word ''maitrī'' \"loving-kindness\", which is in turn derived from the noun ''[[mitra]]'' \"friend\". The Pali form ''Metteyya'' is mentioned in the ''Cakkavatti-Sīhanāda Sutta'' ([[Digha Nikaya]] 26) of the [[Pāli Canon]], and also in chapter 28 of the [[Buddhavamsa]].<ref name=Horner97/><ref name=BDEA/> Most of the Buddha's sermons are presented as having been presented in answer to a question, or in some other appropriate context, but this sutta has a beginning and ending in which the Buddha is talking to monks about something totally different. This leads scholar [[Richard Gombrich]] to conclude that either the whole sutta is apocryphal or that it has at least been tampered with.<ref>[[Richard Gombrich]], ''Theravada Buddhism: A Social History from Ancient Benares to Modern Colombo.'' Routledge and Kegan Paul, 1988, pages 83–85.</ref>\n\nIn the [[Greco-Buddhist art]] of [[Gandhara]], in the first centuries CE in northern India, Maitreya was the most popular figure to be represented along with [[Gautama Buddha]] (often called ''Śākyamuni'' \"sage of the [[Shakya]]\"). In 4th to 6th-century China, \"Buddhist artisans used the names [[Gautama Buddha|Shakyamuni]] and Maitreya interchangeably... indicating both that the distinction between the two had not yet been drawn and that their respective iconographies had not yet been firmly set\".<ref>Angela Falco Howard et al., ''Chinese Sculpture'', Yale University Press, 2006, p. 228</ref> An example is the stone sculpture found in the Qingzhou cache dedicated to Maitreya in 529 CE as recorded in the inscription (currently in the Qingzhou Museum, Shandong). The religious belief of Maitreya apparently developed around the same time as that of [[Amitābha]], as early as the 3rd century CE.<ref>{{Citation | language = zh | url = http://www.tt034.org.tw/Download/pdf/20_03.pdf | title = 中國早期的彌勒信仰 | publisher = TT034 | place = [[Formosa|TW]] | format = [[Portable document format|PDF]] | deadurl = yes | archiveurl = https://web.archive.org/web/20131230234200/http://www.tt034.org.tw/Download/pdf/20_03.pdf | archivedate = 2013-12-30 | df =  }}</ref>\n\n==Characteristics==\nOne mention of the prophecy of Maitreya is in the ''{{IAST|Maitreyavyākaraṇa}}''. It implies that he is a teacher of meditative trance [[sādhanā]] and states that gods, men and other beings:\n{{quote|Will lose their doubts, and the torrents of their cravings will be cut off: free from all misery they will manage to cross the ocean of becoming; and, as a result of Maitreya's teachings, they will lead a holy life. No longer will they regard anything as their own, they will have no possession, no gold or silver, no home, no relatives! But they will lead the holy life of oneness under Maitreya's guidance. They will have torn the net of the passions, they will manage to enter into trances, and theirs will be an abundance of joy and happiness, for they will lead a holy life under Maitreya's guidance.<ref>(Trans. in Conze 1959:241</ref>}}\n\n==General description==\nMaitreya is typically pictured seated, with either both feet on the ground or crossed at the ankles, on a throne, waiting for his time. He is dressed in the clothes of either a [[bhikkhu|bhikṣu]] or Indian royalty. As a [[bodhisattva]], he would usually be standing and dressed in jewels. Usually he wears a small [[stupa]] in his headdress that represents the stupa with relics of Gautama Buddha to help him identify it when his turn comes to lay claim to his succession and can be holding a [[dharmachakra]] resting on a [[Nelumbo nucifera|lotus]]. A [[khata]] is always tied around his waist as a girdle.{{citation needed|date=May 2015}}\n\nIn the [[Greco-Buddhist art]] of [[Gandhara]], Maitreya is represented as a Central Asian or northern Indian nobleman, holding a [[kumbha]] in his left hand. Sometimes this is a \"wisdom urn\" (Tibetan: ''[[Bumpa]]''). He is flanked by his two acolytes, the brothers [[Asanga]] and [[Vasubandhu]].\n\nThe ''[[:de:Maitrisimit|Maitreyasamiti]]'' was an extensive Buddhist play in pre-Islamic Central\nAsia.<ref>[http://www.eurasianhistory.com/data/upload/mile.doc 古代维吾尔语说唱文学《弥勒会见记》]</ref><ref>[http://www.gengo.l.u-tokyo.ac.jp/~hkum/pdf/Maitreya_Paris.pdf The Maitreya-samiti and Khotanese] {{webarchive|url=https://web.archive.org/web/20121114113551/http://www.gengo.l.u-tokyo.ac.jp/~hkum/pdf/Maitreya_Paris.pdf |date=2012-11-14 }}</ref> The ''Maitreyavyakarana'' (in Sataka form) in Central Asia and the ''Anagatavamsa'' of [[South India]] also mention him.<ref>[http://www.iahs.fudan.edu.cn/pdf/%B4%D3%B0%D9%CB%CC%CC%E5%A1%B6%C3%D6%C0%D5%CA%DA%BC%C7%BE%AD%A1%B7%C0%B4%BF%B4%D6%D0%D3%A1%BC%B0%D6%DC%B1%DF%B5%C4%CE%C4%BB%AF%BD%BB%C1%F7.pdf 刘震：从百颂体《弥勒授记经》来看中印及周边的文化交流]{{dead link|date=January 2018 |bot=InternetArchiveBot |fix-attempted=yes }}</ref><ref>[http://maungpaw.blogspot.com/2006/12/anagatavamsa-desana.html The Teaching of the Elders – Thera-vada: 'Anagatavamsa Desana]</ref>\n\n==Maitreya's {{IAST|Tuṣita}} Heaven==\nMaitreya currently resides in the [[Tushita|''{{IAST|Tuṣita}}'' Heaven]] (Pāli: ''Tusita''), said to be reachable through [[meditation]]. Gautama Buddha also lived here before he was born into the world as all bodhisattvas live in the {{IAST|Tuṣita}} Heaven before they descend to the human realm to become Buddhas. Although all bodhisattvas are destined to become Buddhas, the concept of a bodhisattva differs greatly in Theravada and Mahayana Buddhism. In Theravada Buddhism, a bodhisattva is one who is striving for full enlightenment ([[Arahant]]ship in Pali), whereas in Mahayana Buddhism, a bodhisattva is one who has already reached a very advanced state of grace or enlightenment but holds back from entering nirvana so that he may help others.\n\nIn Mahayana Buddhism, Buddhas preside over [[pure land]]s, such as [[Amitābha]] over [[Sukhavati]]. Once Maitreya becomes a buddha, he will rule over the Ketumati [[pure land]], an earthly paradise sometimes associated with the city of [[Varanasi]] (also known as Benares) in Uttar Pradesh, India.<ref>[http://enlight.lib.ntu.edu.tw/FULLTEXT/JR-BJ013/51013.pdf 《彌勒上生經》與《彌勒下生經》簡介]</ref>\n\nIn Theravada Buddhism, Buddhas are born as unenlightened humans, and are not rulers of any paradise or pure land. Maitreya's arising would be no different from the arising of Gautama Buddha, as he achieved full enlightenment as a human being and died, entering [[parinirvana|parinibbana]].\n\n==Activity of Maitreya in the current age==\n{{Main article|Maitreya-nātha}}\nIn [[Mahayana]] schools, Maitreya is traditionally said to have revealed the [[Tibetan Buddhist canon#Five treatises of Maitreya|Five Treatises of Maitreya]] through [[Asanga]]. These texts are the basis of the [[Yogacara]] tradition and constitute the majority of the third turning within the [[Three Turnings of the Wheel of Dharma]].\n\n==Future coming of Maitreya==\n[[File:Statue of Maitreya Buddha in Patan Museum.jpg|thumb|Statue of Maitreya Buddha in Patan Museum, [[Kathmandu]]]]\n{{Further information|List of the named Buddhas}}\n\nAccording to Buddhist tradition, each [[Kalpa (aeon)|kalpa]] has 1,000 [[Buddha (title)|Buddhas]].<ref name=Buddhistdoor>{{cite web|author=|title=Chapter 36: The Buddhas in the three periods of time|work=Buddhism in a Nutshell Archives|publisher=Buddhistdoor International|location=Hong Kong|year=|url=http://www.buddhistdoor.com/OldWeb/bdoor/archive/nutshell/teach36.htm|accessdate=2014-12-21}}</ref> The previous kalpa was the ''vyuhakalpa'' (Glorious aeon), and the present kalpa is called the ''bhadrakalpa'' (Auspicious aeon).<ref name=Buswell106>{{cite book|last=Buswell Jr.|first=RE|last2=Lopez Jr.|first2=DS|title=The Princeton Dictionary of Buddhism|edition=1st|pages=106|publisher=Princeton University Press|location=Princeton, New Jersey|year=2014|isbn=978-0-691-15786-3|url=https://books.google.com/?id=DXN2AAAAQBAJ&pg=PA106&lpg=PA106&dq=Buddhas+of+the+present+kalpa#v=onepage&q=Buddhas%20of%20the%20present%20kalpa&f=false}}</ref> The [[List of the named Buddhas#The Seven Buddhas of Antiquity|Seven Buddhas of Antiquity]] (''Saptatathāgata'') are seven Buddhas which bridge the vyuhakalpa and the bhadrakalpa:<ref name=Buswell776>{{cite book|last=Buswell Jr.|first=RE|last2=Lopez Jr.|first2=DS|title=The Princeton Dictionary of Buddhism|edition=1st|pages=776|publisher=Princeton University Press|location=Princeton, New Jersey|year=2014|isbn=978-0-691-15786-3|url=https://books.google.com/?id=DXN2AAAAQBAJ&pg=PA106&lpg=PA106&dq=Buddhas+of+the+present+kalpa#v=onepage&q=Seven%20Buddhas%20of%20Antiquity&f=false}}</ref>\n#[[Vipassī Buddha|Vipassī]] (the 998th Buddha of the vyuhakalpa)\n#[[Sikhī Buddha|Sikhī]] (the 999th Buddha of the vyuhakalpa)\n#[[Vessabhū Buddha|Vessabhū]] (the 1000th and final Buddha of the vyuhakalpa)\n#[[Kakusandha Buddha|Kakusandha]] (the first Buddha of the bhadrakalpa)\n#[[Koṇāgamana Buddha|Koṇāgamana]] (the second Buddha of the bhadrakalpa)\n#[[Kassapa Buddha|Kassapa]] (the third Buddha of the bhadrakalpa)\n#[[Gautama Buddha|Gautama]] (the fourth and present Buddha of the bhadrakalpa)\n\nMaitreya will be the fifth and future Buddha of the bhadrakalpa, and his arrival will occur after the [[Buddhist philosophy#Basic teachings|teachings of Gautama Buddha]] are no longer practiced.\n\nThe coming of Maitreya will be characterized by a number of physical events. The oceans are predicted to decrease in size, allowing Maitreya to traverse them freely. Maitreya will then reintroduce true dharma to the world.\n\nHis arrival will signify the end of the middle time, the time between the fourth Buddha, Gautama Buddha, and the fifth Buddha, Maitreya, which is viewed as a low point of human existence. According to the ''Cakkavatti Sutta: The Wheel-turning Emperor'', [[Digha Nikaya]] 26 of the [[Sutta Pitaka]] of the [[Pāli Canon]]), Maitreya Buddha will be born in a time when humans will live to an age of eighty thousand years, in the city of Ketumatī (present Varanasi), whose king will be the Cakkavattī Sankha. Sankha will live in the palace where once dwelt King Mahāpanadā, but later he will give the palace away and will himself become a follower of Maitreya Buddha.<ref>Vipassana.info, [http://www.vipassana.info/me_mu/metteyya.htm Pali Proper Names Dictionary: Metteyya]</ref>\n\nThe scriptures say that Maitreya will attain ''[[bodhi]]'' in seven days (which is the minimum period), by virtue of his many lives of preparation for [[buddhahood]] similar to those reported in the [[Jataka tales]].\n\nAt this time a notable teaching he will start giving is that of the ten non-virtuous deeds (killing, stealing, sexual misconduct, lying, divisive speech, abusive speech, idle speech, covetousness, harmful intent and wrong views) and the ten virtuous deeds (the abandonment of: killing, stealing, sexual misconduct, lying, divisive speech, abusive speech, idle speech, covetousness, harmful intent and wrong views).\n\nThe [[Arya Maitreya Mandala]], founded by [[Anagarika Govinda]] is based on the idea of the future coming of Maitreya.\n\nPali sources say that beings in Maitreya's time will be much bigger than during the time of Sakyamuni. In one prophecy his disciples are contemptuous of Mahakasyapa, whose head is no larger than an insect to them. Buddhas robe barely covers two fingers making them wonder how tiny Buddha was. [[Mahākāśyapa]] is said to be small enough in comparison to cremate in the palm of Maitreya's hand.<ref>{{cite book|title=Relics of the Buddha|author=John S. Strong|year=2007|page=220|url=https://books.google.com/books/about/Relics_of_the_Buddha.html?id=_KLAxmR8PZAC|isbn=0691117640}}</ref>\n\n==Nichiren Buddhism and Maitreya as metaphor==\n[[File:Maitreya Buddha, Nubra.jpg|thumb|Maitreya - 33 metre symbol of peace facing Pakistan, [[Nubra Valley]], [[India]]]]\n\nAccording to the [[Lotus Sutra]] in [[Nichiren Buddhism]], all people possess the potential to reveal an innate Buddha nature during their own lifetimes, a concept which may appear to contradict the concept of Buddha as savior or messiah.\n\nAlthough Maitreya is a significant figure in the Lotus Sutra, the explanation of Nichiren is that Maitreya is a metaphor of stewardship and aid for the Bodhisattvas of the Earth, as written in the Lotus Sutra:\n{{quote|Moreover... all the bodhisattvas, Bodhisattva Maitreya... will guard and protect the votaries of the Lotus Sutra, so one may indeed rest assured.<ref>{{cite web|url=http://www.sgilibrary.org/view.php?page=1074&m=3&q=all%20the%20bodhisattvas,%20Bodhisattva%20Maitreya|title=SGI Library Online – The Writings of Nichiren Daishonin|publisher=Sgilibrary.org|date=|accessdate=2012-08-15}}</ref>}} In much of his writing, Nichiren mentions the traditional buddhist views on Maitreya but explains that the propagation of the Eternal Dharma of the Lotus Sutra was entrusted by Shakyamuni to the Bodhisattvas of earth: {{quote|The Buddha did not entrust these five characters to Maitreya, Medicine King, or the others of their group. Instead he summoned forth the bodhisattvas... from the great earth of Tranquil Light and transferred the five characters to them.<ref>{{cite web|url=http://www.sgilibrary.org/view.php?page=437&m=3&q=The%20Buddha%20did%20not%20entrust%20these%20five%20characters|title=SGI Library Online – The Writings of Nichiren Daishonin|publisher=Sgilibrary.org|date=|accessdate=2012-08-15}}</ref>}} Thus, each individual can embody the character of the Maitreya because he is a metaphor for compassion: {{quote|The name Maitreya means ‘Compassionate One’ and designates the Votaries of the Lotus Sutra.<ref>The Record of Orally Transmitted Teachings p 143.Translated by Burton Watson</ref>}}\n\n==Maitreya claimants==\n[[File:Maitreya Buddha the next Buddha.jpg|thumb|right|Close-up of a statue depicting Maitreya at the [[Thikse Monastery]] in [[Ladakh]], India. Depictions of Maitreya vary among Buddhist sects.]]\n\n{{Main article|List of Buddha claimants}}\nThe following list is just a small selection of those people who claimed or claim to be the incarnation of Maitreya. Many have either used the Maitreya incarnation claim to form a new Buddhist sect or have used the name of Maitreya to form a new religious movement or cult.\n* In 613 the monk Xiang Haiming claimed himself Maitreya and adopted an imperial title.<ref name=\"Notable Maitreyan Rebellions\">[https://web.archive.org/web/20060911211331/http://academic.hws.edu/chinese/huang/fysm068/outline13.ppt#10 Notable Maitreyan Rebellions], FYSM068—Collective Violence and Traumatic Memory in Asia. 16 October 2005. Retrieved 29 November 2006.</ref>\n* In 690 [[Wu Zetian]], [[empress regnant]] of the Wu Zhou interregnum (690–705), proclaimed herself an incarnation of the future Buddha Maitreya, and made [[Luoyang]] the \"holy capital.\" In 693 she replaced the compulsory ''[[Dao De Jing]]'' in the curriculum temporarily with her own ''Rules for Officials''.<ref name=\"Tang Dynasty Empire 618-906\">[http://www.san.beck.org/AB3-China.html#4 Tang Dynasty Empire 618–906], SAN-BECK. Retrieved 29 November 2006.</ref>\n*[[Gung Ye]], a [[Koreans|Korean]] warlord and king of the short-lived state of [[Taebong]] during the 10th century, claimed himself as the living incarnation of Maitreya and ordered his subjects to worship him. His claim was widely rejected by most Buddhist monks and later he was dethroned and killed by his own servants.\n* [[Lu Zhongyi]], the 17th patriarch of [[Yiguandao]], claimed to be an incarnation of Maitreya.\n* [[L. Ron Hubbard]], founder of the belief systems [[Dianetics]] and [[Scientology]], suggested he was \"Metteya\" (Maitreya) in the 1955 poem ''Hymn of Asia''. Numerous editors and followers of Hubbard claim that in the book's preface, specific physical characteristics said to be outlined—in unnamed [[Sanskrit]] sources—as properties of the coming Maitreya were properties with which Hubbard's appearance supposedly aligned.\n* [[Samael Aun Weor]] – stated in ''The Aquarian Message'' that \"the Maitreya Buddha Samael is the Kalki Avatar of the New Age.\" The Kalkian Avatar and Maitreya Buddha, he claimed, are the same \"White Rider\" of the ''[[Book of Revelation]]''.\n* [[Ram Bahadur Bomjon]], openly identifies himself with the \"Next Buddha\" Maitreya, calls himself Maitriya Guru and his followers claim \"He plans to unite the world through a single Maitri religion, Maitri language and Maitri culture.\"\n* [[Adi Da]] was suggested by his devotees to be Maitreya: {{quote|An All-Surpassing God-Man yet to come – a final Avatar, the ultimate Messiah, a consummate Prophet or Enlightened Sage, a Spiritual Deliverer who will appear in the 'late-time', the 'dark' epoch when humanity is lost, apparently cut off from Wisdom, Truth and God. Buddhists call that Expected One 'Maitreya'.<ref>{{Cite book|author=Carolyn Lee|title=Adi Da: The Promised God-Man Is Here by The Ruchira Sannyasin Order of Adidam Ruchiradam|isbn=1570971439|publisher=Amazon.com|date=}}</ref>|sign=|source=}}\n\n==Maitreya sects in China==\n[[File:Leshan Buddha Statue View.JPG|thumb|right|Seated stone-carved Maitreya, [[Leshan Giant Buddha]] in [[Sichuan]], [[China]]]]\n\n===Pre-Maitreyan Buddhist messianic rebellions===\n\n====Southern and Northern Dynasties====\n* 515: The ''Mahayana Rebellion''. In the late summer of that year, the renegade monk Faqing 法慶 married a nun and formed a sect in the [[Northern Wei]] province of Jizhou 冀州 (in the southern part of today’s Hebei province) with the assistance of a local aristocrat named Li Guibo 李歸伯. The sect was named the ''Mahayana'' (\"The Great Vehicle\", in reference to [[Mahayana]] Buddhism), and Li Guibo was given the titles of ''Tenth-stage Bodhisattva'', ''Commander of the Demon-vanquishing Army'', and ''King who Pacifies the Land of Han by Faqing''.\n\n:Using drugs to send its members into a killing frenzy, and promoting them to Tenth-Stage Bodhisattva as soon as they killed ten enemies, the Mahayana sect seized a prefecture and murdered all the government officials in it. Their slogan was \"A new Buddha has entered the world; eradicate the demons of the former age\", and they would kill all monks and nuns in the monasteries that they captured, also burning all the sutras and icons. After defeating a government army and growing to a size of over 50,000, the rebel army was finally crushed by another government army of 100,000. Faqing, his wife, and tens of thousands of his followers were beheaded, and Li Guibo was also captured later and publicly executed in the capital city [[Luoyang]].\n\n:The Fozu Tongji (Comprehensive Records of the Buddha), a chronicle of Buddhist history written by the monk Zhipan in 1269, also contains an account of the Mahayana Rebellion, but with significant deviations from the original account, such as dating the rebellion to 528 rather than 515.<ref name=\"Buddhist Political Ideology in the Mahayana Rebellion and Moonlight Child Incident of 6th century China\">[Yang Shao-yun, \"Buddhist Political Ideology in the Mahayana Rebellion and Moonlight Child Incident of 6th century China\" (Honors thesis, National University of Singapore, 2004).</ref>\n\n* 516: The ''Moonlight Child Rebellion''. Toward the end of that year, another sect was discovered by local authorities in Yanling, [[Jizhou District, Hengshui|Jizhou]]. A man named Fa Quan and his associates were claiming that an eight-year-old child Liu Jinghui was a [[Bodhisattva]] called the ''Moonlight Child'' (yueguang tongzi pusa； 月光童子菩萨), and that he could transform into a [[snake]] or a [[pheasant]]. They were arrested and sentenced to death on suspicion of seditious intent, but Jinghui had his sentence commuted to banishment on account of his youth and ignorance.<ref name=\"Buddhist Political Ideology in the Mahayana Rebellion and Moonlight Child Incident of 6th century China\"/>\n* 517: Early in the spring of that year, surviving remnants of the Mahayana rebels regrouped and mounted a sudden attack on the capital of Yingzhou province, which lay just northwest of their original base in Bohai prefecture. They were repelled only after a pitched battle with an army of slaves and attendants led by Yuwen Yan, the son of the provincial governor, and nothing more is known of their fate.<ref name=\"Buddhist Political Ideology in the Mahayana Rebellion and Moonlight Child Incident of 6th century China\"/>\n\nAlthough a \"new Buddha\" was mentioned, these rebellions are not considered \"Maitreyan\" by modern scholars.<ref name=\"Buddhist Political Ideology in the Mahayana Rebellion and Moonlight Child Incident of 6th century China\"/> However, they would be a later influence on the rebel religious leaders that made such claims. Therefore, it is important to mention these rebellions in this context.\n\n===Maitreyan rebellions===\n{{main article|Maitreya teachings}}\n\n====Sui Dynasty====\n* 610: On the first day of the [[Chinese New Year]], dozens of rebels dressed in white, burning incense and holding flowers proclaimed their leader as Maitreya Buddha and charged into the imperial palace through one of its gates, killing all the guards before they were themselves killed by troops led by an imperial prince. A massive investigation in the capital ([[Chang'an]]) implicated over a thousand families.<ref name=\"Buddhist Political Ideology in the Mahayana Rebellion and Moonlight Child Incident of 6th century China\"/>\n* 613: A skilled magician named Song Zixian claimed to be Maitreya in [[Tang County]] (northwest of Yingzhou), and allegedly could transform into the form of a Buddha and make his room emit a glow every night. He hung a mirror in a hall that could display an image of what a devotee would be reincarnated as: a snake, a beast or a human being. Nearly a thousand \"from near and far\" joined his sect every day, and he plotted to first hold a Buddhist vegetarian banquet, or ''wuzhe fohui'', and then attack the emperor who was then touring Yingzhou. The plot was leaked, and Song was arrested and executed, along with over a thousand families of his followers.<ref name=\"Buddhist Political Ideology in the Mahayana Rebellion and Moonlight Child Incident of 6th century China\"/>\n* 613: The monk Xiang Haiming claimed to be Maitreya in Fufeng prefecture (western Shaanxi) and led a rebellion. The elite of the Chang’an area hailed him as ''dasheng'', or holy man, because they had auspicious dreams after following him, and his army swelled to several tens of thousands before he was defeated by government troops.<ref name=\"Buddhist Political Ideology in the Mahayana Rebellion and Moonlight Child Incident of 6th century China\"/>\n\n====Tang Dynasty====\n* 710: Wang Huaigu declared, \"The [[Shakyamuni]] Buddha has declined; a new Buddha is about to appear. The House of [[Li (李)|Li]] is ending, and the House of [[Liu]] is about to rise\".<ref name=\"Notable Maitreyan Rebellions\"/>\n\n====Song Dynasty====\n* 1047: Army officer [[Wang Ze]] led a revolt of Buddhists expecting Maitreya; they took over the city of Beizhou in [[Hebei]] before they were crushed.<ref name=\"Song Dynasty Renaissance 960-1279\">[http://www.san.beck.org/AB3-China.html#5 Song Dynasty Renaissance 960–1279], SAN-BECK. Retrieved 29 November 2006.</ref> The [[Song Dynasty]] government declared Maitreya Sects to be \"heresies and unsanctioned religions\". Tens of thousands of Maitreya Sect followers were killed.<ref name=\"Is Qigong Political? A new look at Falun Gong\">[http://qi-journal.com/Qigong.asp?-Token.FindPage=4&-Token.SearchID=Is%20Qigong%20Political Is Qigong Political? A new look at Falun Gong] QI: The Journal of Traditional Eastern Health & Fitness. Retrieved 29 November 2006.</ref>\n\n====Yuan and Ming Dynasty====\n* 1351: The [[Red Turban Rebellion]] (aka The First White Lotus Rebellion). [[Han Shantong]] (韓山童), leader of the [[White Lotus]] Society, and Army Commander Liu Futong ({{zh|c=劉福通}}) rebelled against the [[Mongols]] of the [[Yuan dynasty]]. Shantong's anti-Mongol slogan was \"The empire is in utter chaos. Maitreya Buddha has incarnated, and the [[Manichaeism|Manichaean]] King of Light has appeared in this world.\"<ref name=\"Notable Maitreyan Rebellions\"/>\n* In 1355, Han Shantong's son, Han Lin'er ({{zh|c=韓林兒}}, 1355–1368?), was proclaimed \"Emperor of the Great [Latter] Song\" (大宋, referring to the defunct [[Song dynasty]]) by Liu Futong. Liu Futong claimed Han Lin'er was a direct descendent of the [[Zhao (surname)|Zhao]] royal family who ruled the Song Dynasty. After Liu Futong's death, Zhu Yuanzhang took up command of the Red Turban Rebellion and later assassinated Han Lin'er to become the [[Hongwu Emperor]] of the [[Ming dynasty]]. (See [[Bozhou#History|History]]) According to Beijing University,\n{{quote|The leader of White Lotus sect, Han Shantong called himself ''Ming Wang'' (明王 – \"King of Brightness\"), while his son, Han Lin'er called himself ''Xiao Ming Wang'' (小明王 – \"Small King of Brightness\"), both names reflecting the sect's beliefs. Zhu Yuanzhang had been a member of the White lotus Sect, and admitted to have been a branch of the White Lotus rebel army (being at one time vice-marshal of Xiao Ming Wang). When Zhu Yuanzhang took power, he chose the dynastic name \"Ming\".<ref name=\"Beijing University\">\"白莲教的首领韩山童称\"明王\"（他的儿子韩林儿称\"小明王\"），都体现其教义宗旨。朱元璋不仅曾经信仰白莲教，而且承认自己是白莲教起义军的一支（他曾为小明王左副元帅）。朱元璋取得政权后，国号称\"明\"。[http://www.hist.pku.edu.cn/club/printpage.asp?BoardID=2&ID=1804 Beijing University] {{webarchive|url=https://web.archive.org/web/20150924030246/http://www.hist.pku.edu.cn/club/printpage.asp?BoardID=2&ID=1804 |date=2015-09-24 }}</ref>}}\n\nThis suggests that the Ming dynasty was named after the White Lotus figures of the \"Big and Little Bright Kings\".\n\n====Qing Dynasty====\n* 1796: The [[White Lotus Rebellion]] (aka The Second White Lotus Rebellion). It broke out among impoverished settlers in the mountainous region that separates [[Sichuan]] province from [[Hubei]] and [[Shaanxi]] provinces. It apparently began as a [[White Lotus|White Lotus Society]] protest against heavy taxes imposed by [[Manchu]] rulers of the Qing Dynasty.<ref name=\"White Lotus Rebellion\">[http://www.bartleby.com/65/wh/WhiteLot.html White Lotus Rebellion], The Columbia Encyclopedia, Sixth Edition. May 2001. Retrieved 29 November 2006.</ref>\n\n:The Yi He Tuan (義和團), often called in English the \"[[Fists of Righteous Harmony|Society of Harmonious Fists]]\" was a 19th-century [[Triad society|martial-sect]] inspired in part by the White Lotus Society. Members of the \"Harmonious Fists\" became known as \"Boxers\" in the west because they practiced [[Chinese martial arts]].\n\n* 1899: The [[Boxer Rebellion]] (義和團之亂). [[Military history of China (pre-1911)|Chinese]] [[rebellion]] from November 1899 to September 7, 1901 against foreign influence in such areas as [[trade]], [[politics]], religion and technology that occurred in [[China]] during the final years of the [[Qing Dynasty]]. By August 1900, over 230 foreigners, tens of thousands of [[Christianity in China|Chinese Christian]]s, an unknown number of rebels, their sympathizers and other innocent bystanders had been killed in the chaos. The uprising crumbled on August 14, 1900 when 20,000 foreign troops entered the Chinese capital, Peking ([[Beijing]]).\n\nAlbeit not in the name of Maitreya, both rebellions were perpetrated solely or in part by the [[White Lotus|White Lotus Society]], a rebellious Maitreya sect.\n\n==Speculation==\nSome have speculated that inspiration for Maitreya may have come from [[Mithra]], the ancient [[Proto-Indo-Iranian religion|Indo-Iranian]] deity.  The primary comparison between the two characters appears to be the similarity of their names, while a secondary comparison is that both were expected to come in the future.<ref name=Tiele1912>{{cite book | last =Tiele|first=CP|authorlink=Cornelis Tiele|title=The religion of the Iranian peoples | volume = I. (from the German) with Darmesteter's sketch of \"Persia\" and Goldziher's \"Influence of Parsism on Islam | edition =1st|chapter=Appendix: some Buddhistic parallels|quote = No one who has studied the Zoroastrian doctrine of the [[Saoshyant]]s or the coming saviour-prophets can fail to see their resemblance to the future Maitreya.|page =159|publisher=The Parsi Publishing Co | location =Bombay|year=1912|url= https://archive.org/stream/religionofirania00tielrich#page/159/mode/1up}}</ref>\n\n[[Paul Williams (British professor)|Paul Williams]] claims that some [[Zoroastrian]] ideas like [[Saoshyant]] influenced the beliefs about Maitreya, such as \"expectations of a heavenly helper, the need to opt for positive righteousness, the future millennium, and universal salvation\". Possible objections are that these characteristics are not unique to Zoroastrianism, nor are they necessarily characteristic of the belief in Maitreya.\n\nIt is also possible that Maitreya Buddha originated with the Hindu [[Kalki]], and that its similarities with the Iranian [[Mithra]] have to do with their common [[Indo-Iranians|Indo-Iranian]] origin.\n\n==Non-Buddhist views==\n\n===Theosophy===\nIn [[Theosophy (Boehmian)|theosophy]], the [[Maitreya (Theosophy)|theosophical Maitreya]] has multiple aspects signifying not just the future Buddha, but similar concepts from other religious or spiritual traditions.<ref>[[Charles Webster Leadbeater|Leadbeater, Charles W.]] (2007) [originally published 1925. [[Adyar (Chennai)|Adyar]], India: Theosophical Publishing House]. ''The Masters and the Path'' (reprint ed.). New York: Cosimo Classics. {{ISBN|978-1-60206-333-4}}. The theosophical Maitreya features prominently in the entire work. Some instances pertinent here: pp. 4–5, 10, 31–32, 34, 36, 74; \"Part IV: The Hierarchy\" pp. 211–301. As it did with practically every major religious, philosophical, and cultural tradition, theosophy ascribed additional [[occult]] or [[esoteric]] significance to many Buddhist concepts. In the theosophical [[Spiritual Hierarchy]] the Maitreya is currently high in the ranks of the so-called \"[[Masters of the Ancient Wisdom]]\" where he also holds the \"Office of the [[World Teacher]]\". According to theosophical writers he has had a number of manifestations or [[incarnation]]s in the physical plane, and he has been further identified with [[Christ]]; [[Annie Besant|Besant, Annie]] & [[Charles Webster Leadbeater|Leadbeater, Charles W.]] (1913). ''Man: How, Whence, and Whither; a record of clairvoyant investigation''. [[Adyar (Chennai)|Adyar]], India: Theosophical Publishing House. pp. 339, 520. {{OCLC|871602}}. Presumed prior Maitreya incarnations.</ref>\n\nIn early 20th century, leading theosophists became convinced that an appearance of the Maitreya as a so-called \"[[World Teacher]]\" was imminent. A [[South Indian]] boy, [[Jiddu Krishnamurti]], was thought to be destined as the \"vehicle\" of the soon-to-manifest Maitreya; however the manifestation did not happen as predicted, and did not fulfil theosophists' expectations.<ref>[[Mary Lutyens|Lutyens, Mary]] (1975). ''[[Krishnamurti: The Years of Awakening]]''. New York: [[Farrar Straus and Giroux]]. {{ISBN|0-374-18222-1}}. Biography (partial) of Jiddu Krishnamurti, the presumed \"vehicle\" of the Maitreya in the 20th century, describes the events in some detail.</ref>\n\n===Post-theosophical movements===\nSince the growth of the theosophical movement in the 19th century, and influenced by theosophy's articulations on the Maitreya, non-Buddhist religious and spiritual movements have adopted and reinterpreted the concept in their doctrines. [[Share International]], which equates [[Maitreya (Benjamin Creme)|Maitreya]] with the prophesied figures of multiple religious traditions, claims that he is already present in the world, but is preparing to make an open declaration of his presence in the near future. They claim that he is here to inspire mankind to create a new era based on sharing and justice.<ref>[http://shareintl.org/  Share International].</ref>\n\nIn the beginning of the 1930s, the [[Ascended Master Teachings]] placed Maitreya in the \"Office of World Teacher\" until 1956, when he was described as moving on to the \"Office of Planetary Buddha\" and \"Cosmic Christ\" in their concept of a Spiritual Hierarchy.\n\nIn 1911, Rudolf Steiner claimed \"Roughly three thousand years after our time the world will experience the Maitreya Buddha incarnation, which will be the last incarnation of Jeshu ben Pandira. This Bodhisattva, who will come as Maitreya Buddha, will also come in a physical body in our century in his reincarnation in the flesh — but not as Buddha — and he will make it his task to give humanity all the true concepts about the Christ Event.\" Steiner is careful to distinguish Jeshu ben Pandira as somebody entirely distinct from Jesus of Nazareth, as the Maitreya is entirely distinct from the Christ being. The Maitreya does work in support of the Christ being, as does Guatama, the current Buddha. <ref>[http://wn.rsarchive.org/Lectures/GA130/English/RSP1984/19110917p01.html].</ref>\n\n===Ahmadiyya===\nThe [[Ahmadiyya]]s believe the 19th-century [[Mirza Ghulam Ahmad]] fulfilled expectations regarding the Maitreya Buddha.<ref>{{Citation | title = Review of Religions | date = March 2002 | volume = 97 | number = 3 | page = 24}}.</ref>\n\n===Bahá'í Faith===\n[[Bahá'í Faith|Bahá'ís]] believe that [[Bahá'u'lláh]] is the fulfillment of the prophecy of appearance of Maitreya.<ref name = \"momenbook\">{{cite book|title=Buddhism And The Baha'i Faith: An Introduction to the Baha'i Faith for Theravada Buddhists|first = Moojan |last=Momen|year=1995|isbn=0-85398-384-4|publisher= George Ronald |location=Oxford|pages=50–52}}</ref><ref name = \"buck_eschatologic\">{{cite book|title=Studies in Modern Religions, Religious Movements and the Bābī-Bahā'ī Faiths|editor-last =Sharon | editor-first = Moshe|chapter=The eschatology of Globalization: The multiple-messiahship of Bahā'u'llāh revisited|first= Christopher | last = Buck|isbn=90-04-13904-4|pages=143–178|location=Boston | publisher = Brill|year=2004|url= http://bahai-library.com/buck_eschatology_globalization}}</ref> Bahá'ís believe that the prophecy that Maitreya will usher in a new society of tolerance and love has been fulfilled by Bahá'u'lláh's teachings on world peace.<ref name =\"momenbook\" />\n\n==Gallery==\n<gallery>\nFile:MathuraMaitreya.JPG|Maitreya (water bottle on left thigh), art of [[Mathura]], second century CE\nFile:Maitreya Komering Srivijaya Front.JPG|A 9th-century [[Srivijaya]]n art bronze Maitreya from [[South Sumatra]], a [[stupa]] adorns his crown\nFile:TheFutureBuddhaGandhara3rdCentury.jpg|The future Buddha Maitreya, Gandhara, 3rd century CE\nFile:Nepal Kathmandu Boudhanath 2.jpg|A statue of Maitreya Buddha inside Trikal Maitreya Buddha Vihara (Jamchen Lhakhang Monastery) at [[Boudhanath|Bouddhanath premises]], [[Kathmandu]], [[Nepal]]\nFile:SeatedMaitreyaKoreaMuseeGuimet.jpg|Seated Maitreya, Korean, 4-5th century CE. [[Guimet Museum]]\nFile:Budai Statue flipped.jpg|The monk [[Budai]] as an incarnation of Maitreya\nFile:Maitreya and discilples carving in Feilai Feng Caves.jpg|Maitreya and disciples in [[budai]] form, as depicted at the Feilai Feng grottos near [[Lingyin Temple]] in [[Hangzhou]], [[China]]\n</gallery>\n\n==See also==\n*[[Budai]], a traditional manifestation of Maitreya\n*[[Kalki]]\n*[[Kalki Purana]]\n*[[Leshan Giant Buddha]]\n*[[Lord of Light]]\n*[[Mahdi]]\n*[[Maitreya (Mahābhārata)]]\n*[[Maitreya Project]]\n*[[Saoshyant]]\n\n==Notes==\n{{Reflist|30em}}\n\n==Further reading==\n* <span id=\"refHorner1975\" class=\"citation\">{{cite book|editor-last=Horner|editor-first=IB|editor-link=Isaline Blew Horner|title=The minor anthologies of the Pali canon. Volume III: Buddhavaṁsa (Chronicle of Buddhas) and Cariyāpiṭaka (Basket of Conduct)|publisher=[[Pali Text Society]]|location=London|edition=|year=1975|isbn=0-86013-072-X|url=}}</span>\n* Iida, Shōtarō; Goldston, Jane, trans. (2016). [http://www.bdkamerica.org/system/files/pdf/dBET_Maitreya_Manjusri_2016.pdf Descent of Maitreya Buddha and his Enlightenment], (Taishō Volume 14, Number 454), Bukkyo Dendo Kyokai\n\n==External links==\n{{Commons category}}\n* [http://maitreyaproject.org The Maitreya Project, building a huge statue of Maitreya in Kushinagar, India]\n* [http://www.smithsonianmag.com/arts-culture/Glimpses-of-the-Lost-World-of-Alchi.html April 2010 Smithsonian Magazine Article]\n* [http://what-buddha-said.net/library/DPPN/me_mu/metteyya.htm About the Future Buddha Ariya Ajita Metteyya]\n* [http://what-buddha-said.net/library/Metteyya/arimet00.htm The Story of the Coming Buddha: Ariya Metteyya]\n\n{{TibetanBuddhism}}\n{{Buddhism topics}}\n{{Bodhisattvas}}\n{{Time in religion and mythology}}\n\n{{Authority control}}\n\n[[Category:Bodhisattvas]]\n[[Category:Buddhist eschatology]]\n[[Category:Buddhist terminology]]\n[[Category:Messianism]]\n[[Category:Sinhala Buddhist deities]]",
            "slug": "maitreya",
            "date_updated": 1531840302000,
            "imported": "https://en.wikipedia.org/wiki/maitreya"
        }
    ]
}