{
    "article": [
        {
            "title": "Nirvana_(Buddhism)",
            "text": "{{About|Nirvana in Buddhism|other uses|Nirvana (disambiguation)}}\n[[File:Gautama Buddha gains nirvana.jpg|thumb|238px|[[Khmer people|Khmer]] traditional mural painting depicts [[Gautama Buddha]] entering parinirvana, Dharma assembly pavilion, [[Wat Botum|Wat Botum Wattey Reacheveraram]], [[Phnom Penh]], [[Cambodia]].]]\n{{Buddhist term\n|title=  Nirvana \n|en=     blowing out,<br />extinguishing,<br /> liberation\n|pi=     nibbāna (निब्बान)\n|bn=     নির্বাণ\n|si=     [[:si:නිවන|නිවන]]<br />(Nivana)\n|sa=     nirvāṇa (निर्वाण) \n|vi=     Niết bàn\n|zh=     涅槃\n|zh-Latn=nièpán\n|mn=     γasalang-aca nögcigsen\n|mnw=    နဳဗာန်\n|mnw-Latn=nìppàn\n|my=     နိဗ္ဗာန်\n|my-Latn=neɪʔbàɴ\n|ja=     涅槃\n|ja-Latn=nehan\n|idn=     nirwana\n|km=     និព្វាន\n|km-Latn=nippean\n|ko=     열반\n|ko-Latn=yeolban\n|shn=    ၼိၵ်ႈပၢၼ်ႇ\n|shn-Latn=nik3paan2\n|th=     นิพพาน<br>({{RTGS|nipphan}})\n|bo=     མྱ་ངན་ལས་འདས་པ།<br></span>(mya ngan las 'das pa)\n}}\n'''''Nirvana''''' ([[Sanskrit]]: ''{{IAST|nirvāṇa}}''; [[Pali]]: ''{{IAST|nibbana}}'', ''{{IAST|nibbāna}}'') is the earliest and most common term used to describe the goal of the [[Buddhism|Buddhist]] path.{{sfn|Buswell|Lopez|2013|pp=589-590}} The literal meaning is \"blowing out\" or \"quenching.\"<ref>{{cite book|author=Steven Collins |title=Nirvana and Other Buddhist Felicities |url=https://books.google.com/books?id=Z2go_y5KYyoC |year=1998|publisher=Cambridge University Press |isbn=978-0-521-57054-1 |pages=191 }}</ref> It is the ultimate spiritual goal in Buddhism and marks the soteriological release from rebirths in ''[[Saṃsāra (Buddhism)|saṃsāra]]''.{{sfn|Buswell|Lopez|2013|pp=589-590}}{{Sfn|Keown|2004|pp=194-195}} Nirvana is part of the Third Truth on \"cessation of ''[[dukkha]]''\" in the [[Four Noble Truths]],{{sfn|Buswell|Lopez|2013|pp=589-590}} and the ''[[summum bonum]]'' destination of the [[Noble Eightfold Path]].{{Sfn|Keown|2004|pp=194-195}}\n\nWithin the Buddhist tradition, this term has commonly been interpreted as the extinction of the \"three fires\",{{sfn|Gombrich|2006|p=65}} or \"three poisons\",{{sfn|Gombrich|2006|p=66}}{{sfn|Buswell|Lopez|2013|loc=Kindle loc. 44535}}{{refn|group=note|name=\"Gombrichthreefires\"|According to Gombrich, the use of the term \"three fires\" alludes to the three fires which a brahmin householder had to keep alight, and tend daily. In later Buddhism, the origin of this metaphor was forgotten, and the term was replaced with \"the three poisons.{{sfn|Gombrich|2006|p=66}}}} passion, (''[[Raga (Buddhism)|raga]]''), aversion (''[[dvesha]]'') and ignorance (''[[Moha (Buddhism)|moha]]'' or ''[[Avidyā (Buddhism)|avidyā]]'').{{sfn|Buswell|Lopez|2013|loc=Kindle loc. 44535}} When these ''fires'' are extinguished, release from the cycle of rebirth (''[[Saṃsāra (Buddhism)|saṃsāra]]'') is attained.\n\nNirvana has also been deemed in Buddhism to be identical with ''[[anatta]]'' (non-self) and ''[[sunyata]]'' (emptiness) states.<ref>{{cite book|author=Steven Collins|title=Selfless Persons: Imagery and Thought in Theravada Buddhism|url=https://books.google.com/books?id=8sLMkNn26-gC&pg=PA5|year=1990|publisher=Cambridge University Press|isbn=978-0-521-39726-1|pages=82–84}};<br>{{cite book|author=Genjun Sasaki |title=Linguistic Approach to Buddhist Thought|url=https://books.google.com/books?id=vUBPAzlxJPUC |year=1986|publisher=Motilal Banarsidass |isbn=978-81-208-0038-0 |pages=124–125 }};<br>{{cite book|author=Sue Hamilton |title=Early Buddhism: A New Approach : the I of the Beholder |url=https://books.google.com/books?id=pE9lwuScpWwC |year=2000|publisher=Routledge |isbn=978-0-7007-1280-9 |pages=18–21 }}</ref><ref name=\"Choong1999p85\">{{cite book|author=Mun-Keat Choong|title=The Notion of Emptiness in Early Buddhism|url=https://books.google.com/books?id=HJafx7uO0VsC| year=1999| publisher=Motilal Banarsidass| isbn=978-81-208-1649-7| pages=1–4, 85–88}};<br>{{cite book|author= Ray Billington|title= Understanding Eastern Philosophy|url=https://books.google.com/books?id=dACFAgAAQBAJ |year=2002|publisher=Routledge |isbn=978-1-134-79348-8 |pages=58–60 }};<br>{{cite book|author=David Loy|title=Awareness Bound and Unbound: Buddhist Essays|url=https://books.google.com/books?id=R5KHnVVjwKQC |year=2009|publisher=State University of New York Press|isbn=978-1-4384-2680-8 |pages=35–39}}</ref> In time, with the development of Buddhist doctrine, other interpretations were given, such as the absence of the weaving (''vana'') of activity of the mind,{{sfn|Cousins|1998|p=9}} the elimination of desire, and escape from the woods, cq. the five ''[[skandha]]s'' or aggregates.\n\nBuddhist scholastic tradition identifies two types of nirvana: ''sopadhishesa-nirvana'' (nirvana with a remainder), and ''[[parinirvana]]'' or ''anupadhishesa-nirvana'' (nirvana without remainder, or final nirvana).{{sfn|Buswell|Lopez|2013|p=590}} The founder of Buddhism, the Buddha, is believed to have reached both these states.{{sfn|Buswell|Lopez|2013|p=590}} \n\n''Nirvana'', or the liberation from cycles of rebirth, is the highest aim of the [[Theravada]] tradition. In the [[Mahayana]] tradition, the highest goal is ''Buddhahood'',  in which there is no abiding in Nirvana, but a Buddha continues to take rebirths in the world to help liberate beings from ''saṃsāra'' by teaching the Buddhist path.\n\n==Etymology==\nThe term ''nirvana'' describes a state of freedom from suffering and rebirth,{{sfn|Buswell|2004|p=600}} but different Buddhist traditions have interpreted the concept in different ways.{{sfn|Buswell|2004|p=600}}{{refn|group=quote|Buswell: \"It is found in dictionaries as an English word, nirvana, and has acquired a patina that makes many assume its meaning is obvious. Yet, it is a word about which Buddhists themselves have never reached agreement.{{sfn|Buswell|2004|p=600}}}} The origin is probably pre-Buddhist,{{sfn|Buswell|2004|p=600}}{{sfn|Cousins|1998|p=9}} and its etymology may not be conclusive for its meaning.{{sfn|Cousins|1998|p=9}} The term was a more or less central concept among the Jains, the Ajivikas, the Buddhists, and certain Hindu traditions, and it may have been imported into Buddhism with much of its semantic range from other [[Sramanism|sramanic]] movements.{{sfn|Buswell|2004|p=600}}\n\nNirvana has a wide range of meanings,{{sfn|Buswell|2004|p=600}} although the literal meaning is \"blowing out\" or \"quenching\".{{sfn|Cousins|1998|p=9}} It refers both to the act and the effect of blowing (at something) to put it out, but also the process and outcome of burning out, becoming extinguished.{{sfn|Buswell|2004|p=600}}{{refn|group=quote|Buswell: \"The Sanskrit term nirvana is an action noun signifying the act and effect of blowing (at something) to put it out, to blow out, or to extinguish, but the noun also signifies the process and outcome of burning out, becoming extinguished, cooling down, and hence, allaying, calming down, and also taming, making docile. Technically, in the religious traditions of India, the term denotes the process of accomplishing and experiencing freedom from the unquenchable thirst of desire and the pains of repeated births, lives, and deaths.{{sfn|Buswell|2004|p=600}}}}\n\nThe term ''nirvana'' in the [[Soteriology|soteriological]] sense of \"blown out, extinguished\" state of liberation does not appear in the [[Veda]]s nor in the pre-Buddhist [[Upanishad]]s. According to [[Steven Collins (Buddhist studies scholar)|Collins]], \"the Buddhists seem to have been the first to call it ''nirvana''.\"<ref>{{cite book|author=Steven Collins|title=Nirvana and Other Buddhist Felicities|url=https://books.google.com/books?id=Z2go_y5KYyoC |year=1998|publisher=Cambridge University Press|isbn=978-0-521-57054-1|pages=137–138}}</ref> However, the ideas of spiritual liberation using different terminology, is found in ancient texts of non-Buddhist Indian traditions, such as in verse 4.4.6 of the [[Brihadaranyaka Upanishad]] of Hinduism.<ref>{{cite book|author=Max Müller |title=Theosophy Or Psychological Religion |url=https://books.google.com/books?id=PjiD_XWea7cC |year=2011|publisher=Cambridge University Press |isbn=978-1-108-07326-4 |pages=307–310 }}</ref>\n\n===Extinction===\nThe prevalent interpretation of nirvana as \"extinction\" is based on the etymology of ''nir√vā'' to \"blow out\".{{sfn|Swanson|1997|p=10}} ''Nir'' is a negative, while ''va'' is commonly taken to refer to \"to blow\".{{sfn|Swanson|1997|p=10}}\n\nThe term ''nirvana'' is part of an extensive metaphorical structure that was probably established at a very early age in Buddhism. According to Gombrich, the number of three fires alludes to the three fires which a Brahmin had to keep alight, and thereby symbolise life in the world, as a family-man.{{sfn|Gombrich|2006|p=66}}{{sfn|Hwang|2006|p=12}} The meaning of this metaphor was lost in later Buddhism,{{sfn|Gombrich|2006|p=66}}{{refn|group=quote|Gombrich: \"I hope it is not too farfetched to suggest that this may have contributed to an important development in the Mahayana: that it came to separate nirvana from bodhi, 'awakening' to the truth, Enlightenment, and to put a lower value on the former (Gombrich, 1992d). Originally nirvana and bodhi refer to the same thing; they merely use different metaphors for the experience. But the Mahayana tradition separated them and considered that nirvana referred only to the extinction of craving, with the resultant escape from the cycle of rebirth. This interpretation ignores the third fire, delusion: the extinction of delusion is of course in the early texts identical with what can be positively expressed as gnosis, Enlightenment.{{sfn|Gombrich|2006|p=66-67}}}} and other explanations of the word ''nirvana'' were sought. Not only passion, hatred and delusion were to extinguished, but also all cankers (''asava'') or defilements (''khlesa'').{{sfn|Hwang|2006|p=12}}{{refn|group=note|Not only the three fires, but also the extinction of the defilements and ''tanha'' are mentioned as ''nirvana'':{{sfn|Walpola Rahula|2007|loc=Kindle Locations 934-953}}\n* \"Calming of all conditioned things, giving up of all defilements, extinction of \"thirst\", detachment, cessation, Nibbāna.\" (Saṃyutta-nikāya I (PTS), p. 136)\n* \"O Rādha, the extinction of 'thirst' (Taṇhakkhayo) is Nibbāna.\" (Saṃyutta-nikāya I (PTS), p. 190)\n* ''Sutta-nipata'': \"Where there is nothing; where naught is grasped, there is the Isle of No-Beyond. Nirvāṇa do I call it—the utter extinction of aging and dying.\"{{citation needed|date=June 2016}}\n* ''[[Majjhima Nikaya]] 2-Att. 4.68'': \"The liberated mind ([[citta]]) that no longer clings' means nibbāna.\"}} Later exegetical works developed a whole new set of folk etymological definitions of the word nirvana, using the root ''vana'' to refer to \"to blow\", but re-parsing the word to roots that mean \"weaving, sewing\", \"desire\" and \"forest or woods\":{{sfn|Hwang|2006|p=12-13}}{{sfn|Collins|2010|p=64}}\n* ''vâna'', derived from the root word ''√vā'' which means \"to blow\":<ref group=web name=\"Langheld\">[http://www.vwsp.eu/tathagata/nirvana/amngs.htm ''Possible ancient meanings of nirvana''] {{webarchive |url=https://web.archive.org/web/20140406193511/http://www.vwsp.eu/tathagata/nirvana/amngs.htm |date=April 6, 2014 }} Victor Langheld, {{better source|date=June 2016}}</ref>\n** (to) blow (of wind); but also to emit (an odour), be wafted or diffused;<ref group=web name=\"Langheld\" /> ''nirvana'' then means \"to blow out\";{{refn|group=quote|Bhikkhu Bodhi: \"Etymologically, the word nibbāna — the Pali form of the better known Sanskrit nirvāṇa — is derived from a verb nibbāti meaning \"to be blown out\" or \"to be extinguished.\" It thus signifies the extinguishing of the worldly \"fires\" of greed, hatred, and delusion. But the Pali commentators prefer to treat it as the negation of, or \"departure from\" (nikkhantatta), the entanglement (vāna) of craving, the derivation which is offered here. For as long as one is entangled by craving, one remains bound in saṃsāra, the cycle of birth and death; but when all craving has been extirpated, one attains Nibbāna, deliverance from the cycle of birth and death.{{sfn|Bhikkhu Bodhi|2012|loc=Kindle Locations 5193-5198}}}}{{sfn|Smith|Novak|2009|pp=51-52, Quote: Etymologically [nirvana] means \"to blow out\" or \"to extinguish,\" not transitively, but as a fire ceases to draw. Deprived of fuel, the fire goes out, and this is nirvana.}}\n* ''vāna'', derived from the root ''vana'' or ''van'' which mean \"desire\",{{sfn|Collins|2010|p=64}}<ref group=web name=\"Langheld\" />\n** ''nirvana'' is then explained to mean a state of \"without desire, without love, without wish\" and one without craving or thirst ([[taṇhā]]);{{sfn|Collins|2010|p=64}}<ref group=web name=\"Langheld\" />\n** adding the root ''√vā'' which means \"to weave or sew\";{{sfn|Hwang|2006|p=12}}{{sfn|Collins|2010|p=64}} ''nirvana'' is then explained as abandoning the desire which weaves together life after life.{{sfn|Collins|2010|p=64}}{{refn|group=note|Even [[Buddhaghosa]], the great Theravada commentator, ignored the original etymological meaning of the word, and presented an interpretation of ''nirvana'' based on the root ''√vā'', \"to weave.\"{{sfn|Hwang|2006|p=12}}}}<ref group=web name=\"Langheld\" />\n* ''vāna'',{{sfn|Hwang|2006|p=12}} derived from the root word ''vana'' which also means \"woods, forest\":{{sfn|Hwang|2006|p=12}}<ref group=web name=\"Langheld\" />\n**  based on this root, ''vana'' has been metaphorically explained by Buddhist scholars as referring to the \"forest of defilements\",{{sfn|Collins|2010|p=64}} or the [[skandha|five aggregates]];{{sfn|Hwang|2006|p=12}} ''nirvana'' then means \"escape from the aggregates\",{{sfn|Hwang|2006|p=12}} or to be \"free from that forest of defilements\".{{sfn|Collins|2010|p=64}}{{refn|group=note|Gombrich explains that the five ''skandhas'' or aggregates are the bundles of firewood that fuel the three fires.{{sfn|Gombrich|2006|p=67}} The Buddhist practitioner ought to \"drop\" these bundles, so that the fires are no longer fueled and \"blow out\".{{sfn|Gombrich|2006|p=67-68}}}}\n\nThe \"blowing out\" does not mean total annihilation,{{sfn|Cousins|1998|p=9}} but the extinguishing of a flame, which returns, and exists in another way.{{sfn|Schreiber|Ehrhard|Diener|2008|p=262}} The term ''nirvana'' can also be used as a verb: \"he or she nirvāṇa-s,\" or \"he or she parinirvānṇa-s\" (''parinibbāyati'').{{sfn|Gethin|1998|p=75}}{{refn|group=quote|Rupert Gethin: \"Literally nirvāṇa means 'blowing out' or 'extinguishing', although Buddhist commentarial writings, by a play on words, like to explain it as 'the absence of craving'. But where English translations of Buddhist texts have 'he attains nirvāṇa/parinirvāṇa', the more characteristic Pali or Sanskrit idiom is a simple verb: 'he or she nirvāṇa-s' or more often 'he or she parinirvānṇa-s' (parinibbāyati). What the Pali and Sanskrit expression primarily indicates is the event or process of the extinction of the 'fires' of greed, aversion, and delusion.\"{{sfn|Gethin|1998|p=75}}}}\n\nThe term ''nirvana'', \"to blow out\",{{sfn|Smith|Novak|2009|pp=51-52}} has also been interpreted as the extinction of the \"three fires\",{{sfn|Gombrich|2006|p=65}} or \"three poisons\",{{sfn|Gombrich|2006|p=66}}{{sfn|Buswell|Lopez|2013|loc=Kindle loc. 44535}} namely of passion or sensuality (''[[Raga (Buddhism)|raga]]''), aversion or hate (''[[dvesha]]'') and of delusion or ignorance (''[[Moha (Buddhism)|moha]]'' or ''[[Avidyā (Buddhism)|avidyā]]'').{{sfn|Buswell|Lopez|2013|loc=Kindle loc. 44535}} Another explanation of nirvana is the absence of the weaving (''vana'') of activity of the mind.{{sfn|Cousins|1998|p=9}}\n\n===To uncover===\nAuthor Paul Swanson states that some contemporary Buddhism scholars have questioned the above etymologies and whether these are consistent with the core doctrines of Buddhism, particularly about ''anatman'' (non-self) and ''pratityasamutpada'' (causality).{{sfn|Swanson|1997|pp=119-124}} Matsumoto Shirō, for example, states that the original etymological root of ''nirvana'' should not be considered as nir√vā which means \"extinction\", but should be considered to be nir√vŗ, to \"uncover\".{{sfn|Swanson|1997|p=124}} The problem with considering it as extinction or liberation, is that it presupposes a \"self\" to be extinguished or liberated.{{sfn|Swanson|1997|p=124}} According to Matsumoto, the original meaning of ''nirvana'' was therefore not \"to extinguish\" but \"to uncover\" the ''atman'' from that which is ''anatman'' (not atman).{{sfn|Swanson|1997|pp=123-124, Swanson cites Matsumoto Shiro (1989), Engi to ku-Nyoraizo shiso hihan [Causality and emptiness – A critique of tathagata-garbha thought], Tokyo Daizo Shuppan, pages 191-192, 195-219}} Other Buddhist scholars such as Takasaki Jikidō disagree, states Swanson, and call the Matsumoto proposal as \"too far and leaving nothing that can be called Buddhist\".{{sfn|Swanson|1997|p=124}}\n\n===Moksha, Mukti===\n''Nirvana'' is used synonymously  with ''[[moksha]]'' (Sanskrit), also ''vimoksha'', or ''vimutti'' (Pali), \"release, deliverance from suffering\".{{sfn|Buswell|2013|p=547}}<ref group=web name=\"Bowker-vimutti\">[http://www.encyclopedia.com/doc/1O101-Vimutti.html John Bowker (1997), ''Vimutti'', The Concise Oxford Dictionary of World Religions]</ref>{{refn|group=note|\"''Vimoksha'' [解脱] (Skt; Jpn gedatsu ). Emancipation, release, or liberation. The Sanskrit words vimukti, mukti, and moksha also have the same meaning. Vimoksha means release from the bonds of earthly desires, delusion, suffering, and transmigration. While Buddhism sets forth various kinds and stages of emancipation, or enlightenment, the supreme emancipation is nirvana, a state of perfect quietude, freedom, and deliverance.\"<ref group=web name=\"vimoksha\">[http://www.sgilibrary.org/search_dict.php?id=2602 The Soka Gakkai Dictionary of Buddhism, ''vimoksha''] {{webarchive|url=https://web.archive.org/web/20140222011614/http://www.sgilibrary.org/search_dict.php?id=2602 |date=2014-02-22 }}</ref>}} In the Pali-canon two kinds of vimutti are discerned:<ref group=web name=\"Bowker-vimutti\" /> \n* ''Ceto-vimutti'', freedom of mind; it is the qualified freedom from suffering, attained through the practice of concentration meditation (samādhi). Vetter translates this as \"release of the heart\" which means conquering desire thereby attaining a desire-less state of living.{{Sfn|Vetter|1988|pp=63-65 with footnotes}}\n* ''Pañña-vimutti'', freedom through understanding (prajña); it is the final release from suffering and the end of rebirth, attained through the practice of insight meditation (vipassanā).<ref group=web name=\"Bowker-vimutti\" />\n\nCeto-vimutti becomes permanent, only with the attainment of pañña-vimutti.<ref group=web name=\"Bowker-vimutti\" /> According to Gombrich and other scholars, these may be a later development within the canon, reflecting a growing emphasis in earliest Buddhism on ''prajña'', instead of the liberating practice of ''dhyana''; it may also reflect a successful assimilation of non-Buddhist meditation practices in ancient India into the Buddhist canon.{{sfn|Gombrich|2006|p=96-134}}{{Sfn|Vetter|1988|pp=63-65 with footnotes}}\n\n==Interpretations==\n\n===Release from ''samsara''===\n{{see also|Samsara (Buddhism)|Rebirth (Buddhism)}}\n\nBy following the [[Noble Eightfold Path]], which culminates in the practice of four ''[[Dhyana in Buddhism|dhyana]]'', which starts with extinction of the three fires (passion, hate, delusion), proceeds to ceasing all discursive thoughts and apperceptions, then ceasing all feelings (happiness and sadness) unto nothingness, which leads to nirvana of the [[Arhat]]s.{{sfn|Vetter|1988|pp=68-69}}{{Sfn|Trainor|2004|pp=80-81}} In later Buddhism, this practice was deemed sufficient only for the extinguishing of passion and hatred, while delusion was extinguished by insight.{{sfn|Gombrich|2006|p=66-67}}\n\nThe cycle of rebirth and suffering continues until a being attains nirvana. One requirement for ending this cycle is to extinguish the fires of attachment (''[[Raga (Buddhism)|raga]]''), aversion (''[[dvesha]]'') and ignorance (''[[Moha (Buddhism)|moha]]'' or ''[[Avidya (Buddhism)|avidya]]''):\n{{quote|For as long as one is entangled by [[Taṇhā|craving]], one remains bound in saṃsāra, the cycle of birth and death; but when all craving has been extirpated, one attains Nibbāna, deliverance from the cycle of birth and death.{{sfn|Bhikkhu Bodhi|2012|loc=Kindle Locations 5188-5193}}<!---START OF NOTE--->{{refn|group=quote|See:\n* Rupert Gethin: \"Literally nirvāṇa means 'blowing out' or 'extinguishing' [...] What the Pali and Sanskrit expression primarily indicates is the event or process of the extinction of the 'fires' of greed, aversion, and delusion. At the moment the Buddha understood suffering, its arising, its cessation, and the path leading to its cessation, these fires were extinguished. This process is the same for all who reach awakening,{{refn|group=lower-roman|Vetter, Gombrich, and Bronkhorst, among others, notes that the emphasis on \"liberating insight\" is a later development.{{sfn|Vetter|1988}}{{sfn|Bronkhorst|1993}}{{sfn|Gombrich|1996}} In the earliest Buddhism, the practice of ''dhyana'' may have been the sole liberating practice, with ''bodhi'' denoting the insight that ''dhyana'' is an affective means to still the fires.{{sfn|Vetter|1988}}}} and the early texts term it either nirvāṇa or parinirvāṇa, the complete 'blowing out' or 'extinguishing' of the 'fires' of greed, aversion, and delusion. This is not a 'thing' but an event or experience.{{sfn|Gethin|1998|p=75}}{{refn|group=lower-roman|Robert Sharf notices that \"experience\" is a typical modern, western word. In the 19th century, \"experience\" came to be seen as a means to \"prove\" religious \"realities\".{{sfn|Sharf|1995-B}}{{sfn|Sharf|2000}}}}\n* Paul Williams: \"[Nirvana] means 'extinguishing', as in 'the extinguishing of a flame', and it signifies soteriologically the complete extinguishing of greed, hatred, and fundamentally delusion (i.e. ignorance), the forces which power samsara.\"{{sfn|Williams|2002|pp=47-48}}\n* Paul Williams: \"Nirvana is broadly speaking the result of letting-go, letting-go the very forces of craving which power continued experiences of pleasure and inevitably suffering throughout this life, death, rebirth, and redeath. That, in a nutshell, is what nirvana is. It is the complete and permanent cessation of samsara, thence the cessation of all types of suffering, resulting from letting-go the forces which power samsara, due to overcoming ignorance (thence also hatred and delusion, the 'three root poisons') through seeing things the way they really are.\"{{sfn|Williams|2002|pp=47-48}}\n* Donald Lopez: \"[Nirvana] is used to refer to the extinction of desire, hatred, and ignorance and, ultimately, of suffering and rebirth.\"<ref group=web name=\"EB=Nirvana\">[http://www.britannica.com/EBchecked/topic/415925/nirvana Donald S. Lopez Jr., ''Nirvana'', Encyclopedia Britannica]</ref>\n* Damien Keown states: \"When the flame of craving is extinguished, rebirth ceases, and an enlightened person is not reborn.\"{{sfn|Keown|2000|loc=Kindle Locations 1025-1032}}}}<!---END OF NOTE--->}}\n\nThere are two stages in ''nirvana'', one in life, the second is final nirvana upon death; the former is imprecise and general, the latter is precise and specific.<ref name=\"Steven Collins 1982, page 207\">Steven Collins, ''Selfless Persons: Imagery and Thought in Theravada Buddhism.'' Cambridge University Press, 1982, pages 206-208.</ref> The nirvana-in-life marks the life of a monk who has attained complete release from desire and suffering but still has a body, name and life. The nirvana-after-death, also called nirvana-without-substrate, is the complete cessation of everything, including consciousness and rebirth.<ref name=\"Steven Collins 1982, page 207\"/>\n\n====Goals====\nIn early Buddhism, Nirvana is used as a synonym for ''vimutti'', release from samsara, as the ultimate goal of the Buddhist path.{{refn|group=quote|Vimutti:\n* Joseph Goldstein: \"It is Nibbana that the Buddha declared to be the final goal of the spiritual journey: 'This holy life [...] does not have gain, honor, and renown for its benefit, or the attainment of virtue for its benefit, or the attainment of concentration for its benefit, or knowledge and vision for its benefit. But it is this unshakable deliverance of mind{{refn|group=lower-roman|''Ceto-vimutti''}} that is the goal of this holy life, its heartwood and its end.'{{sfn|Goldstein|2011|pp=158-159}}{{refn|group=lower-roman|Goldstein is quoting from the final paragraph of the ''Maha Saropama Sutta''; see [http://www.accesstoinsight.org/tipitaka/mn/mn.029.than.html Maha Saropama Sutta].}}\n* Smith and Novak: \"Nirvana [is] the word the Buddha used to name life's goal as he saw it. [...] Nirvana is the highest destiny of the human spirit and its literal meaning is \"extinction,\" but what is to be extinguished are the boundaries of the finite self [...]\"{{sfn|Smith|Novak|2009|pp=51-52}}\n* Donald Lopez: \"Nirvana is [...] the oldest and most common designation for the goal of the Buddhist path \"<ref group=web name=\"EB=Nirvana\">[http://www.britannica.com/EBchecked/topic/415925/nirvana Donald S. Lopez Jr., ''Nirvana'', Encyclopedia Britannica]</ref>}} It remains the highest goal in contemporary Theravada tradition.{{refn|group=quote|Nirvana is the highest goal in Theravada:\n* Bhikkhu Bodhi: \"Nibbana is the ultimate goal of the Buddha's path. The Buddha says 'Just as the water of a river plunges into the ocean and merges with the ocean, so the spiritual path, the Noble Eightfold Path, plunges into Nibbana and merges with Nibbana.'\"<ref group=web name=\"nibbana-bodhi\">[http://hkims.org/documents/Nibbana%20by%20Bhikkhu%20Bodhi.pdf Nibbana], Bhikkhu Bodhi (2007),  {{webarchive |url=https://web.archive.org/web/20070509005227/http://hkims.org/documents/Nibbana%20by%20Bhikkhu%20Bodhi.pdf |date=May 9, 2007 }}</ref>\n* Ajahn Sucitto states: \"Nibbāna is held to be the ultimate goal in Buddhism.\"{{sfn|Ajahn Sucitto|2010|pp=162-163}}}} According to the Lotus Sutra of the Mahayana tradition, the attainment of ''nirvana'' is a lesser goal; the highest goal is the attainment of [[Buddhahood]].{{sfn|Clarke|2004|p=540}}{{sfn|Baroni|2002|p=36}}{{sfn|Kornberg Greenberg|2008|p=88}} A being who has attained the Buddhahood does not abide in an isolated nirvana, but out of [[Karuṇā|compassion]] seeks to liberate all sentient beings by teaching the Buddhist path.{{sfn|Duckworth|2011|loc=Kindle loc. 430-436}}{{refn|group=quote|name=nonabiding1}} Most other sutras of the Mahayana tradition, states Jan Nattier, present three alternate goals of the path: Arhatship, Pratyekabuddhahood, and Buddhahood, in which \"extinction is forever\" is a dictum.<ref>{{cite book|author=Jan Nattier |title=The Bodhisattva Path: Based on the Ugraparipṛcchā, a Mahāyāna Sūtra |url=https://books.google.com/books?id=M5mWcbAXqb0C |year=2007|publisher=Motilal Banarsidass |isbn=978-81-208-2048-7 |pages=7–8 }}</ref>\n\n===''Nirvana'' with and without remainder of fuel===\nIn the Buddhist tradition, a distinction is made between the extinguishing of the fires during life, and the final \"blowing out\" at the moment of death:{{sfn|Gombrich|2006|p=68-69}}{{refn|group=quote|Nirvana during life and beyond death:\n* Donald Lopez states: \"Two types of nirvana are [...] described. The first is called 'nirvana with remainder.' [...] The second type is called 'nirvana without remainder', or final nirvana.\"{{sfn|Lopez|2001|p=47}}\n* Peter Harvey states: \"The first aspect of Nibbana is described as 'with remainder of what is grasped at' (''sa-updadi-sesa''), meaning that the ''khandas'', the result of past grasping, still remain for him; the second is described as 'without remainder of what is grasped at' (''an-upadi-sesa'') (''It.''38-39).{{sfn|Harvey|1990|p=61}}}}\n* ''Sa-upādisesa-nibbāna'' (Pali; Sanskrit ''sopadhiśeṣa-nirvāṇa''), \"nirvana with remainder\", \"nirvana with residue.\"{{sfn|Gombrich|2006|p=68-69}} Nirvana is attained during one's life, when the fires are extinguished.{{sfn|Gombrich|2006|p=68}} There is still the \"residue\" of the five [[skandhas]], and a \"residue of fuel\", which however is not \"burning\".{{sfn|Gombrich|2006|p=68-69}}{{refn|group=quote|Rupert Gethin: \"Like the Buddha, any person who attains nirvāṇa does not remain thereafter forever absorbed in some transcendental state of mind. On the contrary he or she continues to live in the world; he or she continues to think, speak, and act as other people do—with the difference that all his or her thoughts, words, and deeds are completely free of the motivations of greed, aversion, and delusion, and motivated instead entirely by generosity, friendliness, and wisdom. This condition of having extinguished the defilements can be termed 'nirvāṇa with the remainder [of life]' (''sopadhiśeṣa-nirvāṇa/sa-upādisesa-nibbāna''): the nirvāṇa that comes from ending the occurrence of the defilements (''kleśa/kilesa'') of the mind; what the Pali commentaries call for short ''kilesa-parinibbāna''.{{refn|group=lower-roman|name=gethincite1|Gethin cites: Dhammapada-atthakathā ii. 163; Vibhaṇga-atthakatha 433.}} And this is what the Buddha achieved on the night of his awakening.\"{{sfn|Gethin|1998|pp=75-76}}}} Nirvana-in-this-life is believed to result in a transformed mind with qualities such as happiness,{{refn|group=note|In the [[Dhammapada]], the Buddha describes ''nirvāṇa'' as \"the highest happiness\",<ref>Verse 204, ''nibbanam paramam sukham''</ref> an enduring happiness qualitatively different from the limited, transitory happiness derived from [[anicca|impermanent]] things.}} freedom of negative mental states,<!---START OF NOTE--->{{refn|group=quote|Freedom from negative states:\n* [[Walpola Rahula]]: [one who has achieved nirvana is] \"free from all 'complexes' and obsessions, the worries and troubles that torment others.\"{{sfn|Walpola Rahula|2007|loc=Kindle Locations 1095-1104}}\n* Damien Keown: \"Nirvana [...] involves a radically transformed state of consciousness which is free of the obsession with 'me and mine'.\"{{sfn|Keown|2000|loc=Kindle Locations 1016-1025}}\n* Rupert Gethin: \"Any person who attains nirvāṇa [...] continues to think, speak, and act as other people do—with the difference that all his or her thoughts, words, and deeds are completely free of the motivations of greed, aversion, and delusion, and motivated instead entirely by generosity, friendliness, and wisdom.{{sfn|Gethin|1998|pp=75-76}}}}<!---END OF NOTE---> peacefulness<!---START OF NOTE--->{{refn|group=quote|Peacefulness:\n* Bhikkhu Bodhi states: \"The state of perfect peace that comes when craving is eliminated is Nibbāna (nirvāṇa).\"{{sfn|Bhikkhu Bodhi|2011|p=25}}\n* Joseph Goldstein states: \"It is also described as the deathless, absolute peace, freedom, and so forth.\"{{sfn|Goldstein|2011|pp=158-159}}\n* Lama Surya Das states: \"Nirvana is inconceivable inner peace, the cessation of craving and clinging.\"{{sfn|Lama Surya Das|1997|p=76}}\n* Walpola Rahula states:{{sfn|Walpola Rahula|2007|loc=Kindle Locations 1095-1104}} \"He who has realized the Truth, Nirvāṇa, is (...) joyful, exultant, enjoying the pure life, his faculties pleased, free from anxiety, serene and peaceful.\"{{refn|group=lower-roman|Rahula cites: Majjhima-nikāya II (PTS), p. 121}}\n* Damien Keown states:{{sfn|Keown|2000|loc=Kindle Locations 1016-1025}} \"It is clear that nirvana-in-this-life is a psychological and ethical reality, a transformed state of personality characterized by peace, deep spiritual joy, compassion, and a refined and subtle awareness. Negative mental states and emotions such as doubt, worry, anxiety, and fear are absent from the enlightened mind. Saints in many religious traditions exhibit some or all of these qualities, and ordinary people also possess them to some degree, although imperfectly developed. An enlightened person, however, such as a Buddha or an Arhat, possesses them all completely.\"}}<!---END OF NOTE---> and non-reactiveness.<!---START OF NOTE--->{{refn|group=quote|Non-reactiveness:\n* Phillip Moffitt states:{{sfn|Moffitt|2008|loc=Kindle Locations 1654-1656}} \"Nibbana literally means \"cooled\" and is analogous to a fire that's no longer burning. Thus, when there is cessation, your mind no longer burns in response to the arising of pleasant and unpleasant in your life; it isn't reactive or controlled by what you like or dislike.\"\n* Ringu Tulku explains:{{sfn|Ringu Tulku|2005|pp=34-35}} \"Someone who has attained [...] the state of nirvana, will no longer react within the pattern of aversion and attachment. The way such a person sees things will be nondualistic and therefore non-conceptual. [...] When this dual reaction is gone, nothing is haunting or fearful anymore. We see clearly, and nothing seems imposing, since nothing is imposed from our part. When there is nothing we do not like, there is nothing to fear. Being free from fear, we are peaceful. There is no need to run away from anything, and therefore no need to run after anything either. In this way there is no burden. We can have inner peace, strength, and clarity, almost independent from circumstances and situations. This is complete freedom of mind without any circumstantial entanglement; the state is called \"nirvana\" [...]. Someone who has reached this state has gone beyond our usual way of being imprisoned in habitual patterns and distorted ways of seeing these things.\"}}\n* ''An-up ādisesa-nibbāna'' (Pali; Sanskrit ''nir-upadhiśeṣa-nirvāṇa''), \"nirvana without remainder,\" \"nirvana without residue\". This is the final ''nirvana'', or ''parinirvana'' or \"blowing out\" at the moment of death, when there is no fuel left.{{sfn|Gombrich|2006|p=68}}{{refn|group=quote|Rupert Gethin: \"Eventually 'the remainder of life' will be exhausted and, like all beings, such a person must die. But unlike other beings, who have not experienced 'nirvāṇa', he or she will not be reborn into some new life, the physical and mental constituents of being will not come together in some new existence, there will be no new being or person. Instead of being reborn, the person 'parinirvāṇa-s', meaning in this context that the five aggregates of physical and mental phenomena that constitute a being cease to occur. This is the condition of 'nirvāṇa without remainder [of life]' (nir-upadhiśeṣa-nirvāṇa/an-up ādisesa-nibbāna): nirvāṇa that comes from ending the occurrence of the aggregates (skandha/khandha) of physical and mental phenomena that constitute a being; or, for short, khandha-parinibbāna.{{refn|group=lower-roman |name=gethincite1}} Modern Buddhist usage tends to restrict 'nirvāṇa' to the awakening experience and reserve 'parinirvāṇa' for the death experience.\"{{sfn|Gethin|1998|p=76}}}}\n\nGombrich explains that the five ''skandhas'' or aggregates are the bundles of firewood that fuel the three fires.{{sfn|Gombrich|2006|p=67}} The Buddhist practitioner ought to \"drop\" these bundles, so that the fires are no longer fueled and \"blow out\".{{sfn|Gombrich|2006|p=67-68}} When this is done, the bundles still remain as long as this life continues, but they are no longer \"on fire.\"{{sfn|Gombrich|2006|p=68}}\n\nWhat happens with one who has reached ''nirvana'' after death is an [[Acinteyya|unanswerable question]].{{sfn|Walpola Rahula|2007|loc=Kindle Locations 1059-1073}}{{refn|group=quote|Walpola Rahula: \"Now another question arises: What happens to the Buddha or an Arahant after his death, parinirvāṇa? This comes under the category of unanswered questions ([[Avyakata|avyākata]]). [Samyutta Nikaya IV (PTS), p. 375 f.] Even when the Buddha spoke about this, he indicated that no words in our vocabulary could express what happens to an Arahant after his death. In reply to a Parivrājaka named Vaccha, the Buddha said that terms like 'born' or 'not born' do not apply in the case of an Arahant, because those things—matter, sensation, perception, mental activities, consciousness—with which the terms like 'born' and 'not born' are associated, are completely destroyed and uprooted, never to rise again after his death. [Majjhima Nikaya I (PTS), p. 486].\"{{sfn|Walpola Rahula|2007|loc=Kindle Locations 1059-1073}}}} According to Walpola Rahula, the five aggregates vanish but there does not remain a mere \"[[nothingness]].\"{{sfn|Walpola Rahula|2007|loc=Kindle Locations 1059-1073}} {{refn|group=quote|Walpola Rahula: \"An Arahant after his death is often compared to a fire gone out when the supply of wood is over, or to the flame of a lamp gone out when the wick and oil are finished.[Majjhima Nikaya I (PTS), p. 487] Here it should be clearly and distinctly understood, without any confusion, that what is compared to a flame or a fire gone out is not Nirvāṇa, but the 'being' composed of the Five Aggregates who realized Nirvāṇa. This point has to be emphasized because many people, even some great scholars, have misunderstood and misinterpreted this simile as referring to Nirvāṇa. Nirvāṇa is never compared to a fire or a lamp gone out.{{sfn|Walpola Rahula|2007|loc=Kindle Locations 1059-1073}}}} Rahula's view, states Gombrich, is not accurate summary of the Buddhist thought, and mirrors the Upanishadic thought.{{refn|group=quote|Richard Gombrich, who studied with Walpola Rahula, notes: \"[T]here is one point where the great scholar monk has let us down: his account of nirvana, in Chapter IV, is unclear and, to my mind, even at points self-contradictory [...] In proclaiming (in block capitals) that 'Truth is', Rahula has for a moment fallen into Upanisadic mode.{{sfn|Gombrich|2009|p=155-156}}}}{{refn|group=quote|In the ''Yamaka Sutta (SN 22.58)'', the monk [[Sariputta]] teaches that to state that a person who attains nirvana \"does not exist\" after death is not the correct view; the correct view is that ''nirvana-after-death'' is outside of all conceivable experience. The only accurate statement that can be made about ''nirvana-after-death'' is \"That which is stressful (''[[dukkha]]''; suffering) has ceased and gone to its end.\"<ref group=web name=\"Yamaka Sutta\">[http://www.accesstoinsight.org/tipitaka/sn/sn22/sn22.085.than.html Yamaka Sutta, SN 22.85.]</ref><br><br>The ''Aggivacchagotta Sutta'' states that the state of being after death cannot be described as either being reborn after death, not being reborn, being and not being reborn, or neither being nor not being reborn. The sutra concludes: \"Any fire burning dependent on a sustenance of grass and timber, being unnourished — from having consumed that sustenance and not being offered any other — is classified simply as 'out' (unbound).<br>Even so [...] any physical form by which one describing the Tathagata [the Buddha] would describe him: That the Tathagata has abandoned, its root destroyed, made like a [[Borassus|palmyra]] stump, deprived of the conditions of development, not destined for future arising. Freed from the classification of form [...] the Tathagata is deep, boundless, hard to fathom, like the sea. 'Reappears' doesn't apply. 'Does not reappear' doesn't apply. 'Both does & does not reappear' doesn't apply. 'Neither reappears nor does not reappear' doesn't apply.\"<ref>Aggivacchagotta Sutta; In the Buddha's Words, p367-369. Bhikku Bodhi</ref><ref group=web>[http://www.accesstoinsight.org/tipitaka/mn/mn.072.than.html Aggi-Vacchagotta Sutta: To Vacchagotta on Fire], by Thanissaro Bhikkhu</ref>}}\n\n===''Anatta'', ''Sunyata''===\nNirvana is also described in Buddhist texts as identical to ''[[anatta]]'' (''anatman'', non-self, lack of any self).<ref>{{cite book|author=Steven Collins|title=Selfless Persons: Imagery and Thought in Theravada Buddhism|url=https://books.google.com/books?id=8sLMkNn26-gC&pg=PA5|year=1990|publisher=Cambridge University Press|isbn=978-0-521-39726-1|pages=82–84}}</ref><ref>{{cite book|author=Genjun Sasaki |title=Linguistic Approach to Buddhist Thought|url=https://books.google.com/books?id=vUBPAzlxJPUC |year=1986|publisher=Motilal Banarsidass |isbn=978-81-208-0038-0 |pages=124–125 }}</ref><ref>{{cite book|author=Sue Hamilton |title=Early Buddhism: A New Approach : the I of the Beholder |url=https://books.google.com/books?id=pE9lwuScpWwC |year=2000|publisher=Routledge |isbn=978-0-7007-1280-9 |pages=18–21 }}</ref> ''Anatta'' means there is no abiding self or soul in any being or a permanent essence in any thing.<ref name=\"Hamilton-Blyth2013\"/><ref>[a] {{cite book|author=Christmas Humphreys|title=Exploring Buddhism|url=https://books.google.com/books?id=V3rYtmCZEIEC |year=2012|publisher=Routledge|isbn=978-1-136-22877-3 |pages=42–43 }}<br>[b] {{cite book|author=Brian Morris |title=Religion and Anthropology: A Critical Introduction |url=https://books.google.com/books?id=PguGB_uEQh4C&pg=PA51 |year=2006|publisher=Cambridge University Press |isbn=978-0-521-85241-8|pages=51 }}, '''Quote:''' \"(...) anatta is the doctrine of non-self, and is an extreme empiricist doctrine that holds that the notion of an unchanging permanent self is a fiction and has no reality. According to Buddhist doctrine, the individual person consists of five skandhas or heaps - the body, feelings, perceptions, impulses and consciousness. The belief in a self or soul, over these five skandhas, is illusory and the cause of suffering.\"<br>[c] {{cite book|author=Richard Gombrich|title=Theravada Buddhism|url=https://books.google.com/books?id=jZyJAgAAQBAJ|year=2006|publisher=Routledge|isbn=978-1-134-90352-8|page=47}}, '''Quote:''' \"(...) Buddha's teaching that beings have no soul, no abiding essence. This 'no-soul doctrine' (anatta-vada) he expounded in his second sermon.\"</ref> This interpretation asserts that all reality is of [[Pratītyasamutpāda|dependent origination]] and a worldly construction of each human mind, therefore ultimately a delusion or [[avidya (Buddhism)|ignorance]].<ref name=\"Hamilton-Blyth2013\">{{cite book|author=Sue Hamilton-Blyth |title=Early Buddhism: A New Approach: The I of the Beholder |url=https://books.google.com/books?id=cR2PAQAAQBAJ |year=2013|publisher=Routledge|isbn=978-1-136-84293-1 |pages=19–28 }}</ref><ref name=\"Southwold1983p209\"/> In Buddhist thought, this must be overcome, states Martin Southwold, through \"the realization of anatta, which is nirvana\".<ref name=\"Southwold1983p209\">{{cite book|author=Martin Southwold |title=Buddhism in Life: The Anthropological Study of Religion and the Sinhalese Practice of Buddhism |url=https://books.google.com/books?id=R9dRAQAAIAAJ |year=1983|publisher=Manchester University Press |isbn=978-0-7190-0971-6 |pages=209–210 }}</ref>\n\nNirvana in some Buddhist traditions is described as the realization of ''[[sunyata]]'' (emptiness or nothingness).<ref name=\"Choong1999p85\"/> Madhyamika Buddhist texts call this as the middle point of all dualities (Middle Way), where all subject-object discrimination and polarities disappear, there is no conventional reality, and the only ultimate reality of emptiness is all that remains.<ref>{{cite book|author=Merv Fowler |title=Buddhism: Beliefs and Practices |url=https://books.google.com/books?id=A7UKjtA0QDwC |year=1999|publisher=Sussex Academic Press |isbn=978-1-898723-66-0 |pages=91–92 }}</ref>\n\n==Theravada==\n{{StagesFettersRebirths|notes=1}}\n{{Main article|Four stages of enlightenment}}\nThe Theravada tradition identifies four progressive stages.{{refn|group=note|These four stages are: Stream-enterer (Sotapanna), Once returner (Sakadagami), Non-returner (Anagami), Worthy one (Arhat)}}<ref>{{cite book |author1=Robert E. Buswell Jr. |author2=Donald S. Lopez Jr. |title=The Princeton Dictionary of Buddhism |url=https://books.google.com/books?id=DXN2AAAAQBAJ |year=2013 |publisher=Princeton University Press |isbn=978-1-4008-4805-8 |pages=65 }}</ref> The first three lead to favorable rebirths in more pleasant realms of existence, while the last culminates in nirvana as an Arahat who is a fully awakened person. The first three are reborn because they still have some of the fetters, while arhat has abandoned all ten fetters and, upon death will never be reborn in any realm or world, having wholly escaped ''saṃsāra''.<ref>{{cite book |author1=Robert E. Buswell Jr. |author2=Donald S. Lopez Jr. |title=The Princeton Dictionary of Buddhism |url=https://books.google.com/books?id=DXN2AAAAQBAJ |year=2013 |publisher=Princeton University Press |isbn=978-1-4008-4805-8 |pages=37–38, 62, 850, 854 }}</ref>\n\nAt the start, a monk's mind treats nirvana as an object (nirvanadhatu). This is followed by realizing the insight of three universal ''lakshana'' (marks): impermanence (''anicca''), suffering (''dukkha'') and nonself (''anatman''). Thereafter the monastic practice aims at eliminating the ten fetters that lead to rebirth.<ref>{{cite book |author1=Robert E. Buswell Jr. |author2=Donald S. Lopez Jr. |title=The Princeton Dictionary of Buddhism |url=https://books.google.com/books?id=DXN2AAAAQBAJ |year=2013 |publisher=Princeton University Press |isbn=978-1-4008-4805-8 |pages=37–38, 62, 65 }}</ref>\n\n===Unconditioned===\nIn the Theravada-tradition, ''nirvana'' is regarded as an uncompounded or unconditioned state of being which is \"transmundane\",{{sfn|Choong|1999|p=21}}{{refn|group=note|According to Peter Harvey, the Theravada-tradition tends to minimalize mystical tendencies, but there is also a tendency to stress the complete otherness of ''nirvana'' from ''samsara''. The [[Pāli Canon]] provides good grounds for this minimalistic approach, bit it also contains material suggestive of a Vijnavada-type interpretation of ''nirvāṇa'', namely as a [[Eight Consciousnesses#Transformations of consciousness|radical transformation of consciousness]].<ref>Peter Harvey, ''Consciousness mysticism in the discourses of the Buddha'' in Karel Werner, ''The Yogi and the Mystic; Studies in Indian and Comparative Mysticism.\" Routledge, 1995, page 82; [https://books.google.com/books?id=p7J-Gy7PSSEC&pg=PA82&dq=karel+werner+consciousness+mysticism&lr=&sig=ACfU3U0astQaAHoyFZofP5vJblCz_wT_DQ books.google.com]</ref>}} and which is beyond our normal dualistic conceptions.{{sfn|Walpola Rahula|2007|loc=Kindle Locations 1105-1113}}{{refn|group=quote|Walpola Rahula: \"Nirvāṇa is beyond all terms of duality and relativity. It is therefore beyond our conceptions of good and evil, right and wrong, existence and non-existence. Even the word 'happiness' (sukha) which is used to describe Nirvāṇa has an entirely different sense here. Sāriputta once said: 'O friend, Nirvāṇa is happiness! Nirvāṇa is happiness!' Then Udāyi asked: 'But, friend Sāriputta, what happiness can it be if there is no sensation?' Sāriputta's reply was highly philosophical and beyond ordinary comprehension: \"That there is no sensation itself is happiness'.\"{{sfn|Walpola Rahula|2007|loc=Kindle Locations 1105-1113}}}}\n{{quote|O bhikkhus, what is the Absolute (Asaṃkhata, Unconditioned)? It is, O bhikkhus, the extinction of desire (rāgakkhayo) the extinction of hatred (dosakkhayo), the extinction of illusion (mohakkhayo). This, O bhikkhus, is called the Absolute.<ref>Saṃyutta-nikāya I (PTS), p. 359</ref>}}\n\n===Stages===\nAccording to Thanissaro Bhikkhu, individuals up to the level of [[Anagami|non-returning]] may experience nirvāna as an object of consciousness.<ref name=\"ReferenceA\">Thanissaro Bhikkhu's commentary to the Brahma-nimantantika Sutta, [http://www.accesstoinsight.org/tipitaka/mn/mn.049.than.html#n-9 Access to Insight: Readings in Theravada Buddhism.]</ref>{{refn|group=note|See for example the Jhana Sutta, [http://www.accesstoinsight.org/tipitaka/an/an09/an09.036.than.html Access to Insight: Readings in Theravada Buddhism.]}} Certain contemplations with nibbana as an object of [[Samādhi (Buddhism)|samādhi]] lead, if developed, to the level of non-returning.<ref>Peter Harvey, ''Consciousness Mysticism in the Discourses of the Buddha.'' In Karel Werner, ed., ''The Yogi and the Mystic.'' Curzon Press 1989, page 91.</ref> At that point of contemplation, which is reached through a progression of [[Vipassana|insight]], if the meditator realizes that even that state is constructed and therefore impermanent, the [[Fetter (Buddhism)|fetters]] are destroyed, arahantship is attained, and nibbāna is realized.<ref name=\"Peter Harvey 1989, page 93\">Peter Harvey, ''Consciousness Mysticism in the Discourses of the Buddha.'' In Karel Werner, ed., ''The Yogi and the Mystic.'' Curzon Press 1989, page 93.</ref>\n\n===Visuddhimagga===\nAccording to the ''[[Visuddhimagga]]'', nirvana is achieved after a long process of committed application to the path of purification (Pali: ''Vissudhimagga''). The Buddha explained that the disciplined way of life he recommended to his students (''dhamma-vinaya'') is a [[gradual training]] extending often over a number of years. To be committed to this path already requires that a seed of wisdom is present in the individual. This wisdom becomes manifest in the experience of awakening (''[[bodhi]]''). Attaining ''nibbāna'', in either the current or some future birth, depends on effort, and is not pre-determined.{{sfn|Harvey|1995|p=87}}\n\nIn the ''Visuddhimagga'', chapter I.v.6, [[Buddhaghosa]] identifies various options within the [[Pali canon]] for pursuing a path to nirvana.{{refn|group=note|A number of the suttas referenced below as well as Buddhaghosa himself refer not explicitly to nirvana but to \"the path of purification\" (Pali: ''Visuddhimagga''). In Visuddhimagga, Ch. I, v. 5, Buddhaghosa notes: \"Herein, ''purification'' should be understood as nibbana, which being devoid of all stains, is utterly pure\" (Buddhaghosa & {{IAST|Ñāṇamoli}}, 1999, p. 6.)}}{{refn|group=note|These include:\n# By insight (''[[vipassana]]'') alone {{refn|group=lower-alpha|See [[Dhammapada|Dh.]] 277, and [http://www.accesstoinsight.org/tipitaka/kn/dhp/dhp.20.budd.html dhp-277 Access to Insight: Readings in Theravada Buddhism, Buddharakkhita (1996a)] In the Paramattha-mañjūsā (the Visuddhimagga commentary), vv. 9-10, it adds the following caveat regarding this option of \"insight alone\": \"The words 'insight alone' are meant to exclude, not virtue, etc., but serenity (i.e., [[jhana]]), [...] [as typically reflected] in the pair, serenity and insight [...] The word 'alone' actually excludes only that concentration with distinction [of jhanic absorption]; for concentration is classed as both access [or momentary] and absorption [...] Taking this stanza as the teaching for one whose vehicle is insight does not imply that there is no concentration; for no insight comes about with momentary concentration.  And again, insight should be understood as the three contemplations of [[anicca|impermanence]], [[dukkha|pain]] and [[anatta|not-self]] [see ''[[Three marks of existence|tilakkhana]]'']; not contemplation of impermanence alone\".<ref>Buddhaghosa and{{IAST|Ñāṇamoli}}, 1999, p. 750, ''n''. 3.{{full citation needed|date=April 2014}}</ref>}}\n# By [[jhana]] and understanding (see Dh. 372)<ref>See [http://www.accesstoinsight.org/tipitaka/kn/dhp/dhp.25.budd.html#dhp-372 Access to Insight: Readings in Theravada Buddhism , Buddharakkhita (1996b).]</ref>\n# by deeds, vision and righteousness (see [[Majjhima Nikaya|MN]] iii.262){{refn|group=lower-alpha|See [http://www.accesstoinsight.org/tipitaka/mn/mn.143.than.html Access to Insight: Readings in Theravada Buddhism, Thanissaro (2003).]  Verse 262 of this sutta is translated by Thanissaro as: \"Action, clear-knowing, & mental qualities, virtue, the highest [way of] life: through this are mortals purified, not through clan or wealth.}}\n# By virtue, consciousness and understanding (7SN i.13);{{refn|group=lower-alpha|The option expressed by SN i.13 is the basis for the entire rest of the Visuddhimagga's exposition. It is the very first paragraph of the Visuddhimagga and states: \"When a wise man, established well in virtue, develops consciousness and understanding, then as a bhikku ardent and sagacious, he succeeds in disentangling this tangle.<ref>Buddhaghosa & {{IAST|Ñāṇamoli}}, 1999, p. 1.</ref> In the Visuddhimagga, Ch. I, verse 2, Buddhaghosa comments that ''this tangle'' refers to \"the network of craving.\"  In verse 7, Buddhaghosa states that ''develops consciousness and understanding'' means \"develops both concentration and insight.\"<ref>Buddhaghosa and {{IAST|Ñāṇamoli}}, 1999, pp. 1,7.)</ref>}}\n# by virtue, understanding, concentration and effort;{{refn|group=lower-alpha|[[Samyutta Nikaya|SN]] i.53)Buddhaghosa & {{IAST|Ñāṇamoli}} (1999), p.&nbsp;7, translate SN i.53 as: \"He who is possessed of constant virtue, who has understanding, and is concentrated, who is strenuous and diligent as well, will cross the flood so difficult to cross.}}\n# By the four foundations of mindfulness.<ref>[[Satipatthana Sutta]], [[Digha Nikaya|DN]] ii.290</ref>{{refn|group=lower-alpha|See [http://www.accesstoinsight.org/tipitaka/dn/dn.22.0.than.html Thanissaro (2000)]. Verse 290 of this sutta is translated by Thanissaro as: \"The Blessed One said this: \"This is the direct path for the purification of beings, for the overcoming of sorrow & lamentation, for the disappearance of pain & distress, for the attainment of the right method, & for the realization of Unbinding—in other words, the four frames of reference.\"\"}}}} According to Gombrich, this proliferation of possible paths to liberation reflects later doctrinal developments, and a growing emphasis on insight as the main liberative means, instead of the practice of ''dhyana''.{{sfn|Gombrich|2006}}\n\n===The mind of the Arahant is ''nirvana''===\nA related idea, which finds support in the Pali Canon and the contemporary Theravada practice tradition despite its absence in the Theravada commentaries and [[Abhidhamma]], is that the mind of the arahant is itself nibbana.<ref>Peter Harvey, ''Consciousness Mysticism in the Discourses of the Buddha.'' In Karel Werner, ed., ''The Yogi and the Mystic.'' Curzon Press 1989, page 100.</ref>{{refn|group=note|There is a clear reference in the Anguttara Nikaya to a \"[[luminous mind]]\" present within all people, be they corrupt or pure, whether or not it itself is pure or impure.<ref>Peter Harvey, ''Consciousness Mysticism in the Discourses of the Buddha.'' In Karel Werner, ed., ''The Yogi and the Mystic.'' Curzon Press 1989, page 94. The reference is at A I, 8-10.</ref> The Canon does not support the identification of the \"luminous mind\" with nirvanic consciousness, though it plays a role in the realization of nirvāṇa.<ref>Peter Harvey, ''Consciousness Mysticism in the Discourses of the Buddha.'' In Karel Werner, ed., ''The Yogi and the Mystic.'' Curzon Press 1989, pages 94, 97.</ref><ref>Thanissaro Bhikkhu, [http://www.accesstoinsight.org/tipitaka/an/an01/an01.049.than.html Access to Insight: Readings in Theravada Buddhism.]</ref> Upon the destruction of the fetters, according to one scholar, \"the shining nibbanic consciousness flashes out\" of it, \"being without object or support, so transcending all limitations.\"<ref>Harvey, page 99.</ref>}}\n\n==Mahayana==\n\n===Buddhahood===\n[[File:La vie de Bouddha (montagne de marbre, Danang) (4414171866).jpg|thumb|right|300px|The Buddha's quest for nirvana, a relief in [[Vietnam]]]]\n{{Main article|Buddhahood}}\n{{See also|Bodhisattva|Avalokiteśvara|Guanyin|Ten Bulls}}\n\nThe Mahayana (Great Vehicle) tradition envisions an attainment beyond ''nirvana'', namely Buddhahood.<!---START OF NOTES--->{{refn|group=quote|Rupert Gethin: The Mahāyāna sūtras express two basic attitudes towards [the nirvana of the Lesser Vehicle]. The first [attitude] is that the path of the disciple [sravaka] and the path of the pratyeka-buddha do lead to a kind of awakening, a release from suffering, nirvāna, and as such are real goals. These goals are, however, inferior and should be renounced for the superior attainment of buddhahood. The second attitude, classically articulated by the Lotus Sūtra, sees the goal of the disciple and the pratyeka-buddha as not true goals at all.{{refn|group=lower-roman|Gethin footnote: Also Śrīmālādevī 78–94; and Lankāvatāra Sūtra 63; cf. Herbert V. Guenther (trans.), The Jewel Ornament of Liberation (London, 1970), 4–6.}} The fact that the Buddha taught them is an example of his 'skill in means' (upaya-kauśalya) as a teacher.{{refn|group=lower-roman|Gethin footnote: On the notion of 'skill in means' see Michael Pye, Skilful Means (London, 1978); Williams, Mahāyāna Buddhism, 143–50.}} These goals are thus merely clever devices (upāya) employed by the Buddha in order to get beings to at least begin the practice of the path; eventually their practice must lead on to the one and only vehicle (eka-yāna) that is the mahāyāna, the vehicle ending in perfect buddhahood.{{sfn|Gethin|1998|pp=228-229}}}}{{refn|group=note|The Tibetan teacher Pabongka Rinpoche presents the path in three levels (or scopes. The first stage indicates a level of understanding or ethical conduct for non-Buddhists, and the second two stages are ''nirvana'' and ''Buddhahood''. Pabongka Rinpoche: \"The subject matter of these teachings can be included in the various paths of the three scopes. The small scope covers the causes to achieve the high rebirth states of the gods and humans: the ethics of abandoning the ten nonvirtues, etc. The medium scope includes the practices that will cause one to gain the definite excellence of liberation— such practices as abandoning [the first two of the] four truths, engaging in [the last two of these truths], and the practice of the three high trainings. The great scope contains the practices that bring about the definite excellence of omniscience— such practices as the development of bodhichitta, the six perfections, etc. Hence, all this subject matter forms a harmonious practice that will take a person to enlightenment and should be understood as being completely without contradiction.\"{{sfn|Pabongka Rinpoche|2006|loc=Kindle loc. 1790-1796}}}}<!---END OF NOTES---> The Hinayana path only leads to one's own liberation, either as sravaka (listener, hearer, or disciple) or as pratyeka-buddha (solitary realizer).<!---START OF NOTE--->{{refn|group=note|name=rahula1|The Hinayana path is sometimes equated with the modern day Theravada tradition, a classification which the Theravada-tradition rejects. Walpola Rahula: \"We must not confuse Hinayana with Theravada because the terms are not synonymous. Theravada Buddhism went to Sri Lanka during the 3rd Century B.C. when there was no Mahayana at all. Hinayana sects developed in India and had an existence independent from the form of Buddhism existing in Sri Lanka. Today there is no Hinayana sect in existence anywhere in the world. Therefore, in 1950 the World Fellowship of Buddhists inaugurated in Colombo unanimously decided that the term Hinayana should be dropped when referring to Buddhism existing today in Sri Lanka, Thailand, Burma, Cambodia, Laos, etc. This is the brief history of Theravada, Mahayana and Hinayana.\"<ref group=web name=nalanda1>Walpola Rahula, [http://www.urbandharma.org/udharma3/theramaya.html ''Theravada - Mahayana Buddhism'']</ref>}}<!---END OF NOTE---> The Mahayana path aims at a further realization, namely Buddhahood or ''nonabiding (apratiṣṭhita) nirvana''. A Buddha does not dwell in ''nirvana'', but engages actively in enlightened activity to liberate beings for as long as samsara remains.{{sfn|Duckworth|2011|loc=Kindle loc. 430-436}}<!---START OF NOTE--->{{refn|group=quote|name=nonabiding1|From the Mahayana point of view, the ''nonabiding (apratiṣṭhita) nirvana'' is superior to the nirvana of the Lesser Vehicle:\n* Thubten Thardo (Gareth Sparham) states: \"The term \"non-abiding nirvāṇa\" indicates that a fully awakened buddha is utterly free from saṃsāra, yet due to compassion has not entered into a more restricted form of nirvāṇa that precludes continued activity within the world.\"{{sfn|Khunu Rinpoche|2012|loc=Kindle loc. 1480-1482}}\n* Erik Pema Kunsang states (based on teachings by Tulku Orgyen Rinpoche and Chokyi Nyima Rinpoche): \"The lesser nirvana refers to the liberation from cyclic existence attained by a hinayana practitioner. When referring to a buddha, ''nirvana'' is the great nondwelling state of enlightenment which falls neither into the extreme of samsaric existence nor into the passive state of cessation attained by an arhant.\"{{sfn|Tsele Natsok Rangdrol|1987|p=114}}\n* Thrangu Rinpoche states: \"The samadhi with the union of samatha and vipasyana fully developed will free one from the bondage of samsara so one attains a state of nonabiding nirvana, which is Buddhahood.{{sfn|Thrangu Rinpoche|1993|p=125}}\n* The Padmakara Translation Group states: \"It  is important to realize that the term [nirvana] is understood differently by the different vehicles: the nirvana of the Basic Vehicle, the peace of cessation that an Arhat attains, is very different from a Buddha's \"nondwelling\" nirvana, the state of perfect enlightenment that transcends both samsara and nirvana.\"{{sfn|Dudjom Rinpoche|2011|loc=Kindle loc. 8211-8215}}\n* Peter Harvey states: \"An advanced Bodhisattva who has experienced Nirvana does not rest content with this. He turns again to samsara in the service of others, which the ''Mahayana-samgraha'' calls his 'non-abiding' (apratiṣṭhita) Nirvana, not clinging either to samsara or to Nirvana as something supposedly separate from this (Nagao, 1991).\"{{sfn|Harvey|2012|p=137}}\n* Rupert Gethin states: \"For the Mahayana becoming a Buddha generally involves attaining what is characterized as the 'unestablished' or 'non-abiding' (apratiṣṭhita) nirvāṇa: on the one hand the knowledge of a buddha that sees emptiness, is not 'established' in saṃsāra (by seizing on birth as an individual being, for example), on the other hand the great compassion of a buddha prevents the complete turning away from saṃsāra. So ultimately he abides neither in saṃsāra nor in nirvāṇa.\"{{sfn|Gethin|1998|p=232}}\n* Duckworth: The Lesser Vehicle does not result in the practitioner becoming a complete buddha; rather, the aim is to achieve a personal nirvana that is the total extinction of existence. The Great Vehicle, however, does result in becoming a complete buddha. A buddha remains actively engaged in enlightened activity to liberate beings for as long as samsara remains. Thus, those who accomplish the Great Vehicle do not abide in samsara due to their wisdom that sees its empty, illusory nature. Further, unlike those who attain the nirvana of the Lesser Vehicle to escape samsara, they do not abide in an isolated nirvana due to their compassion. For these reasons, in the Great Vehicle, nirvana is said to be \"unlocated\" or \"nonabiding\" (''apratiṣṭhita''), staying in neither samsara nor nirvana.{{sfn|Duckworth|2011|loc=Kindle loc. 430-436}}<!---END OF NOTE--->}}\n\n===Five paths and ten bhumis===\n{{Main article|Bodhisattva|Bhūmi (Buddhism)}}\nThe Mahayana commentary the ''[[Abhisamayalamkara]]'' presents the path of the bodhisattva as a progressive formula of ''Five Paths'' (''pañcamārga''). A practitioner on the ''Five Paths'' advances through a progression of ten stages, referred to as the bodhisattva ''bhūmis'' (grounds or levels).\n\n===Omniscience===\nThe end stage practice of the Mahayana removes the imprints of [[Kleshas (Buddhism)|delusions]], the obstructions to omniscience, which prevent simultaneous and direct knowledge of all phenomena. Only Buddhas have overcome these obstructions, according to Mahayana Buddhism, and, therefore, only Buddhas have omniscience knowledge. From the Mahayana point of view, an arhat who has achieved the nirvana of the Lesser Vehicle will still have certain subtle obscurations that prevent the arhat from realizing complete omniscience. When these final obscurations are removed, the practitioner will attain nonabiding nirvana and achieve full omniscience.{{refn|group=quote|Contemporary translator Jeffrey Hopkins provides the following analogy:\"If you put garlic in a vessel, it deposits some of its odor in the vessel itself; Thus when you seek to clean the vessel, it is necessary to first remove the garlic.<br>Similarly, a [[Avidyā (Buddhism)#Uprooting avidya|consciousness conceiving inherent existence]], like garlic, deposits predispositions in the mind that produce the ''appearance'' of inherent existence; Thus,there is no way to cleanse the mind of those predispositions, which are like the flavor of garlic left in the vessel of the mind,until one removes all consciousnesses conceiving of inherent existence from the mind. First, the garlic must be removed; then, its odor can be removed.<br>For this reason, according to the [[prasangika|Consequence School]], until one has utterly removed all the [[Kleshas (Buddhism)|afflictive obstructions]], one cannot begin to remove the obstructions to omniscience. Since this is the case, a practitioner cannot begin overcoming the obstructions to omniscience on any of the seven first [[Bhumi (Buddhism)|bodhisattva grounds]], which are called \"impure\" because one still has afflictive obstructions to be abandoned.<br>Rather, one begins abandoning the obstructions to omniscience on the eighth bodhisattva ground, and continues to do so on the ninth and tenth, these three being called the 'three pure grounds\" because the afflictive obstructions have been abandoned.\"<ref>Jeffery Hopkins (author). \"The Dalai Lama at Harvard: Lectures on the Buddhist Path to Peace.\" Snow Lion Publications.</ref>}}\n\n===Visible manifestations===\nSome Mahayana traditions see the Buddha in almost docetic terms, viewing his visible manifestations as projections from within the state of nirvana. According to Etienne Lamotte, Buddhas are always and at all times in nirvana, and their corporeal displays of themselves and their Buddhic careers are ultimately illusory. Lamotte writes of the Buddhas:\n{{quote|They are born, reach enlightenment, set turning the Wheel of Dharma, and enter nirvana. However, all this is only illusion: the appearance of a Buddha is the absence of arising, duration and destruction; their nirvana is the fact that they are always and at all times in nirvana.'<ref>Etienne Lamotte, tr. Sara Boin-Webb,  ''Suramgamasamadhisutra'', Curzon, London, 1998, p.4</ref>}}\n\n===Buddha-nature, luminuous consciousness===\nThe Mahayana-tradition discussed nirvana with its concept of the ''Buddha-nature'', the innate presence of Buddha-hood.{{sfn|Wayman|1990}} With ''nirvāṇa'' the consciousness is released, and the mind becomes aware in a way that is totally unconstrained by anything in the conditioned world.<ref>Peter Harvey, ''Consciousness mysticism in the discourses of the Buddha.'' in Karel Werner, ''The Yogi and the Mystic; Studies in Indian and Comparative Mysticism.\" Routledge, 1995, page 82; [https://books.google.com/books?id=p7J-Gy7PSSEC&pg=PA82&dq=karel+werner+consciousness+mysticism&lr=&sig=ACfU3U0astQaAHoyFZofP5vJblCz_wT_DQ books.google.com].</ref>\n\nAccording to Wayman, the idea of an innately pure [[luminous mind]] (''prabhasvara citta''{{sfn|Gregory|1991|p=288-289}}), \"which is only adventitiously covered over by defilements ([[Kleshas (Buddhism)|agantukaklesa]])\"{{sfn|Gregory|1991|p=288-289}} lead to the development of the concept of [[Buddha-nature]], the idea that Buddha-hood is already innate, but not recognised.{{sfn|Wayman|1990|p=42}} The same idea is also mentioned in the Theravada tradition, such as in [[Anguttara Nikaya]].{{sfn|Harvey|1995-B|p=56}}{{refn|group=note|Luminous, monks, is the mind. And it is defiled by incoming defilements\".<ref>[http://www.accesstoinsight.org/tipitaka/an/an01/an01.049.than.html Pabhassara Soetra, Anguttara Nikaya 1.49-52]</ref>{{refn|group=note|Harvey mentions AN 1.10: \"Monks, this mind (''[[citta]]'') is brightly shining (''pabhassara''), but it is defiled by defilements which arrive\". AN 1.49-52 gives a similar statement}}}}\n\nIn one interpretation, the \"luminous consciousness\" is identical with nirvāṇa.<ref>See also Peter Harvey, ''The Selfless Mind.''</ref> Others disagree, finding it to be not nirvāṇa itself, but instead to be a kind of consciousness accessible only to [[arahants]].<ref>Ajahn Brahmali, [http://www.bswa.org/modules/icontent/index.php?page=107 bswa.org]. {{webarchive |url=https://web.archive.org/web/20090806044051/http://www.bswa.org/modules/icontent/index.php?page=107 |date=August 6, 2009 }}</ref><ref>[[Rupert Gethin]] objects to parts of Harvey's argument; [http://www.buddhistethics.org/4/gethin1.html buddhistethics.org]. {{webarchive |url=https://web.archive.org/web/20100616002503/http://www.buddhistethics.org/4/gethin1.html |date=June 16, 2010 }}</ref> A passage in the Majjhima Nikaya likens it to empty space.<ref>Peter Harvey, ''Consciousness Mysticism in the Discourses of the Buddha.'' In Karel Werner, ed., ''The Yogi and the Mystic.'' Curzon Press 1989, page 88. The quote is MN I, 127-128.</ref>\n\nFor liberated ones the luminous, unsupported consciousness associated with nibbana is directly known without mediation of the mental consciousness factor in dependent co-arising, and is the transcending of all objects of mental consciousness.<ref name=\"ReferenceA\"/><ref name=\"Peter Harvey 1989, page 93\"/>\n\n====Vijnana as \"non-manifestive consciousness\"====\nAjahns Pasanno and Amaro, contemporary [[Vipassana movement|vipassana-teachers]] write that what is referred to with the use of the word \"viññana\" (consciousness) is the quality of awareness, and that the use of the term \"viññana\" must be in a broader way than it usually is meant.<ref name=\"Ajahn\">Ajahn Pasanno and Ajahn Amaro, ''The Island: An Anthology of the Buddha's Teachings on nibbāna'', page 131. Available online at [http://www.abhayagiri.org/main/book/1788/ abhayagiri.org].</ref>{{refn|group=quote|Ajahn Pasanno and Ajahn Amaro: \"The Buddha avoided the nit-picking pedantry of many philosophers contemporary with him and opted for a more broad-brush, colloquial style, geared to particular listeners in a language which they could understand. Thus 'viññana' here can be assumed to mean 'knowing' but not the partial, fragmented, discriminative (vi-) knowing (-ñana) which the word usually implies. Instead it must mean a knowing of a primordial, transcendent nature, otherwise the passage which contains it would be self-contradictory.\" They then give further context for why this choice of words may have been made; the passages may represent an example of the Buddha using his \"skill in means\" to teach Brahmins in terms they were familiar with.<ref name=\"Ajahn\" />}}\n\nThis \"non-manifestive consciousness\" differs from the kinds of consciousness associated to the six sense media, which have a \"surface\" that they fall upon and arise in response to.<ref name=\"accesstoinsight.org\">Thanissaro Bhikkhu, [http://www.accesstoinsight.org/tipitaka/dn/dn.11.0.than.html#t-1 Access to Insight: Readings in Theravada Buddhism.]</ref> According to Peter Harvey, the early texts are ambivalent as to whether or not the term \"consciousness\" is accurate.<ref>Peter Harvey, ''Consciousness Mysticism in the Discourses of the Buddha.'' In Karel Werner, ed., ''The Yogi and the Mystic.'' Curzon Press 1989, pages 87, 90.</ref> In a liberated individual, this is directly experienced, in a way that is free from any dependence on conditions at all.<ref name=\"accesstoinsight.org\"/><ref>Thanissaro Bhukkhu's commentary on the Brahma-nimantanika Sutta, [http://www.accesstoinsight.org/tipitaka/mn/mn.049.than.html#n-9 Access to Insight: Readings in Theravada Buddhism.]</ref>\n\n=====Purified mind=====\n{{See also|Dharmakaya}}\n\nIn some [[Vajrayana|Mahayana/Tantric]] texts, nirvana is described as purified, non-dualistic 'superior mind'. For example, the ''Samputa Tantra'' states:\n{{quote|Undefiled by lust and emotional impurities, unclouded by any dualistic perceptions, this superior mind is indeed the supreme nirvana.'<ref>Takpo Tashi Namgyal, ''Mahamudra'' Shambhala, Boston and London, 1986, p.219</ref>}}\n\n===Tathagatagarbha-sutras===\nAn alternative ideas of nirvana is found in the ''[[Tathāgatagarbha sūtras]]''. The title itself means a ''garbha'' (womb, matrix, seed) containing ''Tathagata'' (Buddha). These [[Sutra]]s suggest, states Paul Williams, that 'all sentient beings contain a Tathagata' as their 'essence, core or essential inner nature'.<ref name=paulwilliamsp104>{{cite book|author=Paul Williams|title=Mahayana Buddhism: The Doctrinal Foundations|url=https://books.google.com/books?id=GMN-AgAAQBAJ|year=2008|publisher=Routledge|isbn=978-1-134-25056-1|page=104}}</ref> The ''Tathagatagarbha'' doctrine, at its earliest probably appeared about the later part of the 3rd century CE, and is verifiable in Chinese translations of 1st millennium CE.<ref name=paulwilliamsp104/> Most scholars consider the ''Tathagatagarbha '' doctrine of an 'essential nature' in every living being is equivalent to 'Self',{{refn|group=note|Wayman and Wayman have disagreed with this view, and they state that the ''Tathagatagarbha'' is neither self nor sentient being, nor soul, nor personality.<ref>{{cite book|author=Paul Williams|title=Mahayana Buddhism: The Doctrinal Foundations|url=https://books.google.com/books?id=GMN-AgAAQBAJ|year=2008|publisher=Routledge|isbn=978-1-134-25056-1|page=107}}</ref>}} and it contradicts the \"no self\" (or no soul, no atman, anatta) doctrines in a vast majority of Buddhist texts, leading scholars to posit that the ''Tathagatagarbha Sutras'' were written to promote Buddhism to non-Buddhists.<ref>{{cite book|author=Paul Williams|title=Mahayana Buddhism: The Doctrinal Foundations|url=https://books.google.com/books?id=GMN-AgAAQBAJ|year=2008|publisher=Routledge|isbn=978-1-134-25056-1|pages=104–105, 108}}</ref><ref>{{cite book|author=Merv Fowler|title=Buddhism: Beliefs and Practices|url=https://books.google.com/books?id=A7UKjtA0QDwC|year=1999|publisher=Sussex Academic Press|isbn=978-1-898723-66-0|pages=101–102}}, '''Quote:''' \"Some texts of the ''tathagatagarbha'' literature, such as the ''Mahaparinirvana Sutra'' actually refer to an ''atman'', though other texts are careful to avoid the term. This would be in direct opposition to the general teachings of Buddhism on ''anatta''. Indeed, the distinctions between the general Indian concept of ''atman'' and the popular Buddhist concept of Buddha-nature are often blurred to the point that writers consider them to be synonymous.\"</ref>\n\n====Mahaparinirvana Sutra====\nAccording to some scholars, the language used in the Tathāgatagarbha genre of sutras can be seen as an attempt to state orthodox Buddhist teachings of [[dependent origination]] using positive language instead. Kosho Yamamoto, translator of the full-length ''Nirvana Sutra'', translates the explanation of nirvana in Mahayana Mahaparinirvana Sutra as follows: \n{{quote|\"O good man! We speak of \"Nirvana\". But this is not \"Great\" \"Nirvana\". Why is it \"Nirvana\", but not \"Great Nirvana\"? This is so when one cuts away defilement without seeing the Buddha-Nature. That is why we say Nirvana, but not Great Nirvana. When one does not see the Buddha-Nature, what there {{not a typo|is| is}} the non-Eternal and the non-Self. All that there {{not a typo|is| is}} but Bliss and Purity. Because of this, we cannot have Mahaparinirvana, although defilement has been done away with. When one sees well the Buddha-Nature and cuts away defilement, we then have Mahaparinirvana. Seeing the Buddha-Nature, we have the Eternal, Bliss, the Self, and the Pure. Because of this, we can have Mahaparinirvana, as we cut away defilement.\"<br>\n\"O good man! \"Nir\" means \"not\"; \"va\" means \"to extinguish\". Nirvana means \"non- extinction\". Also, \"va\" means \"to cover\". Nirvana also means \"not covered\". \"Not covered\" is Nirvana. \"Va\" means \"to go and come\". \"Not to go and come\" is Nirvana. \"Va\" means \"to take\". \"Not to take\" is Nirvana.\" \"Va\" means \"not fixed\". When there is no unfixedness, there is Nirvana. \"Va\" means \"new and old\". What is not new and old is Nirvana.<br>\n\"O good man! The disciples of Uluka [i.e. the founder of the [[Vaishesika]] school of philosophy] and Kapila [founder of the [[Samkhya]] school of philosophy] say: \"Va means characterisitic\". \"Characteristiclessness\" is Nirvana.\"<br>\n\"O good man! Va means \"is\". What is not \"is\" is Nirvana. Va means harmony. What has nothing to be harmonised is Nirvana. Va means suffering. What has no suffering is Nirvana.<br>\n\"O good man! What has cut away defilement is no Nirvana. What calls forth no defilement is Nirvana. O good man! The All-Buddha-Tathagata calls forth no defilement. This is Nirvana.\n|Mahayana Mahaparinirvana Sutra, Chapter 31|Translated by Kōshō Yamamoto<ref>Kosho Yamamoto (1973), The Mahayana Mahaparinirvana Sutra, Taisho Tripitaka Vol. 12, No. 374, page 346</ref><ref>{{cite book|author=Kōshō Yamamoto|title=The Mahayana Mahaparinirvana-sutra: a complete translation from the classical Chinese language in 3 volumes|url=https://books.google.com/books?id=KwQHAAAAYAAJ|year=1974|publisher=Karinbunko|pages=504–505}}</ref>{{Refn|group=note|The names of the founders of Hindu philosophy, along with Rishaba of Jainism, as well as Shiva and Vishnu, are found in the Chinese versions of the Mahaparinirvana Sutra.<ref>{{cite book|author1=Lewis Hodous|author2=William E. Soothill|title=A Dictionary of Chinese Buddhist Terms: With Sanskrit and English Equivalents and a Sanskrit-Pali Index|url=https://books.google.com/books?id=ecaRAgAAQBAJ |date=18 December 2003|publisher=Routledge|isbn=978-1-135-79123-0|page=58}}</ref>}}}}\n\nIn the Mahaparinirvana Sutra, the Buddha speak of four attributes which make up nirvana. Writing on this Mahayana understanding of nirvana, [[William Edward Soothill]] and [[Lewis Hodous]] state:\n{{quote|'The Nirvana Sutra claims for nirvana the ancient ideas of permanence, bliss, personality, purity in the transcendental realm. Mahayana declares that Hinayana, by denying personality in the transcendental realm, denies the existence of the Buddha. In Mahayana, final nirvana is both mundane and transcendental, and is also used as a term for the [[Absolute (philosophy)|Absolute]].<ref>[[William Edward Soothill]], [[Lewis Hodous]], ''A Dictionary of Chinese Buddhist Terms'', Motilal Banarsidass, Delhi, 1997, p. 328. [https://web.archive.org/web/20140303182232/http://buddhistinformatics.ddbc.edu.tw/glossaries/files/soothill-hodous.ddbc.pdf Digital version]</ref>}}\n\n==History and influences==\n\n===Non-Buddhist influences===\nThe early Buddhist texts and [[Nagarjuna]] exegesis of canonical texts, states Lindtner, suggest that there were competing views throughout the history of Buddhism, on what ''nirvana'' is, and how one attains it.{{sfn|Lindtner|1997|pp=109-133}} All these views were partly similar and likely influenced by various theories of soteriological liberation that are found in the oldest Upanishads of Hinduism and in Shramana movements such as Jainism.{{sfn|Lindtner|1997|pp=116, 129-133}} The difference, adds Lindtner, is that Buddhism abandoned the concept of [[Brahman]], and coined the term ''nirvana'' instead, a concept whose scope and meaning developed over time.{{sfn|Lindtner|1997|p=132}}\n\nAccording to Lindtner, the original and early Buddhist concepts of nirvana was similar to those found in competing Sramana traditions such as Jainism and Vedic. It was not a psychological idea or purely related to a being's inner world, but a concept described in terms of the world surrounding the being, cosmology and consciousness.{{Sfn|Lindtner|1997|pp=112-113, 118-119}} All Indian religions, over time, states Lindtner evolved these ideas, internalizing the state but in different ways because early and later Vedanta continued with the metaphysical idea of Brahman and soul, but Buddhism did not.{{Sfn|Lindtner|1997|pp=131-132, 110-112, 122-123}} The canonical Buddhism views on Nirvana was a reaction against early (precanonical) Buddhism, along with the assumptions of Jainism and the Upanishadic thought on the idea of personal liberation.{{Sfn|Lindtner|1997|p=129}}\n\n===Precanonical Buddhism===\nStanislaw Schayer, a Polish scholar, argued in the 1930s that the Nikayas preserve elements of an archaic form of Buddhism which is close to Brahmanical beliefs,{{sfn|Lindtner|1997}}{{sfn|Lindtner|1999}}{{sfn|Akizuki|1990|p=25-27}}{{sfn|Ray|1999}} and survived in the Mahayana tradition.{{sfn|Reat|1998|p=xi}}{{sfn|Conze|1967|p=10}} Contrary to popular opinion, the Theravada and Mahayana traditions may be \"divergent, but equally reliable records of a pre-canonical Buddhism which is now lost forever.\"{{sfn|Reat|1998|p=xi}} The Mahayana tradition may have preserved a very old, \"pre-Canonical\" and oral Buddhist tradition, which was largely, but not completely, left out of the Theravada-canon.{{sfn|Conze|1967|p=10}}\n\n;Nirvana as consciousness\nRegamy has identified four points which are central to Schayer's reconstruction of precanonical Buddhism:{{sfn|Ray|1999|p=374-377}} \n# The Buddha was considered as an extraordinary being, in whom ultimate reality was embodied, and who was an incarnation of the mythical figure of the tathagata;\n# The Buddha's disciples were attracted to his spiritual charisma and supernatural authority;\n# Nirvana was conceived as the attainment of immortality, and the gaining of a deathless sphere from which there would be no falling back. This nirvana, as a transmundane reality or state, is incarnated in the person of the Buddha;\n# Nirvana can be reached because it already dwells as the inmost \"consciousness\" of the human being. It is a consciousness which is not subject to birth and death.\n\nConze mentions ideas like the \"person\" (pudgala), the assumption of an eternal \"consciousness\" in the saddhatusutra, the identification of the Absolute, as descriptors of Nirvana to mean an \"invisible infinite consciousness, which shines everywhere\" in Dighanikaya XI 85, and \"traces of a belief in consciousness as the nonimpermanent centre of the personality which constitutes an absolute element in this contingent world.\"{{sfn|Conze|1967|p=10}}\n\n;Nirvana as a location\nSchayer's methodology has been used by M. Falk.{{sfn|Ray|1999|p=375}}{{refn|group=note|M. Falk (1943, ''Nama-rupa and Dharma-rupa''}} Falk details the precanonical Buddhist conceptions of the cosmos, nirvana, the Buddha, the path, and the saint. According to Falk, in the precanonical tradition, there is a threefold division of reality:{{sfn|Ray|1999|p=375}}\n# The rupadhatu, the samsaric sphere of name and form (namarupa), in which ordinary beings live, die, and are reborn. \n# The arupadhatu, the sphere of \"sheer nama,\" produced by samadhi, an ethereal realm frequented by yogins who are not completely liberated;\n# \"Above\" or \"outside\" these two realms is the realm of nirvana, the \"amrta sphere,\" characterized by prajna. This nirvana is an \"abode\" or \"place\" which is gained by the enlightened holy man.{{refn|group=note|See Digha Nikaya 15, ''Mahanidana Sutta'', which describes a  nine-fold chain of causation. Mind-and-body (''nama-rupa'') and consciousness (''vijnana'') do condition here each other (verse 2 & 3). In verse 21 and 22, it is stated that consciousness comes into the mother's womb, and finds a resting place in mind-and-body. {{sfn|Walshe|1995|p=223, 226}}}}\n\nAccording to Falk, this scheme is reflected in the precanonical conception of the path to liberation.{{sfn|Ray|p=375}} The nirvanic element, as an \"essence\" or pure consciousness, is immanent within samsara. The three bodies are concentric realities, which are stripped away or abandoned, leaving only the nirodhakaya of the liberated person.{{sfn|Ray|p=375}} Wynne notes that this pure consciousness was the central element in precanonical Buddhism:\n{{quote|Schayer referred to passages in which \"consciousness\" (''vinnana'') seems to be the ultimate reality or substratum (e.g. A I.10) 14 as well as the ''Saddhatu Sutra'', which is not found in any canonical source but is cited in other Buddhist texts — it states that the personality (pudgala) consists of the six elements (dhatu) of earth, water, fire, wind, space and consciousness; Schayer noted that it related to other ancient Indian ideas. Keith's argument is also based on the ''Saddhatu Sutra'' as well as \"passages where we have explanations of Nirvana which echo the ideas of the Upanishads regarding the ultimate reality.\" He also refers to the  doctrine of \"a consciousness, originally pure, defiled by adventitious impurities.\"{{sfn|Wynne|2007|p=99}}}}\n\nAccording to Lindtner, in precanonical Buddhism Nirvana is a physical place and the outer most realm of cosmos.{{sfn|Lindtner|1997|pp=114-117}} This is a place, states Lindtner, referred to as ''nirvanadhatu'', without border-signs (''animitta''), it cannot be visualized (''anidarsana''), it is past the other six ''dhatus'' (beginning with earth and ending with ''vijñana'') but is closest to ''akasa'' and ''vijñana''.  Once there in this is place of nirvana, one does not slip back, it is ''acyutapada''. As opposed to this world, adds Lindtner, nirvana in early Buddhism is a pleasant place to be in, \"it is sukha, things work well\".{{sfn|Lindtner|1997|pp=116-117}}{{refn|group=note|Cited in Wynne (2007) p.99.{{sfn|Wynne|2007|p=99}}}}\n\nElements of this precanonical Buddhism may have survived the canonisation, and its subsequent filtering out of ideas, and re-appeared in Mahayana Buddhism.{{sfn|Lindtner|1997}}{{sfn|Akizuki|1990|p=25-27}} According to Lindtner, the existence of multiple, and contradicting ideas, is also reflected in the works of 2nd-century Nagarjuna, who tried to harmonize these different and conflicting ideas in Buddhist literature that preceded him. According to Lindtner, this lead him to take a \"paradoxical\" stance, on nirvana, where he rejects any positive description and rejects any absolute, while paradoxically accepting all sides within the Buddhist traditions.{{sfn|Lindtner|1997|pp=122-129}}\n\n==See also==\n{{Div col|colwidth=30em}}\n* [[Bodhi]]\n* [[Enlightenment (religious)]]\n* ''[[Nibbana-The Mind Stilled]]''\n* [[Nirvana]]\n* [[Parinirvana]]\n* [[Satori]]\n* [[Shunyata]]\n{{div col end}}\n\n==Notes==\n{{reflist|group=note|2}}\n\n''Further notes on \"different paths\"''\n{{reflist|group=lower-alpha}}\n\n==Quotes==\n{{reflist|group=quote|2}}\n\n''Further notes on quotes''\n{{reflist|group=lower-roman}}\n\n==References==\n{{Reflist|2}}\n\n==Sources==\n\n===Printed sources===\n{{refbegin|30em}}\n* {{Citation| last1 =Ajahn Pasano |last2=Ajahn Amaro | year =2008 | title = The Island: An Anthology of the Buddha's Teachings on Nibbāna | publisher = Abhayagiri Monastic Foundation | url=http://www.abhayagiri.org/books/the-island }}\n* {{Citation| last =Ajahn Sucitto | year =2010 | title =Turning the Wheel of Truth: Commentary on the Buddha's First Teaching | publisher =Shambhala }}\n* {{Citation | last =Akizuki | first =Ryōmin | year =1990 | title =New Mahāyāna: Buddhism for a Post-modern World | publisher =Jain Publishing Company}}\n* {{Citation| last = Anam Thubten | year =2009 | title =No Self No Problem  | publisher =Snow Lion |edition= Kindle }}\n* {{Citation | last =Baroni | first =Helen Josephine | year =2002 | title =The Illustrated Encyclopedia of Zen Buddhism | publisher =The Rosen Publishing Group}}\n* {{Citation| last = Bhikkhu Bodhi (translator) | year =2000 | title =The Connected Discourses of the Buddha: A New Translation of the Samyutta Nikaya | publisher =Wisdom Publications | place =Boston | isbn=0-86171-331-1}}\n* {{Citation| last = Bhikkhu Bodhi | year =2007 | title =Nibbana  | publisher =Hong Kong Insight Meditation Society |url = http://hkims.org/wp-content/uploads/2015/05/Nibbana-by-Bhikkhu-Bodhi.pdf}}\n* {{Citation| last = Bhikkhu Bodhi | year =2011 | title =The Noble Eightfold Path: Way to the End of Suffering  | publisher =Independent Publishers Group |edition= Kindle }}\n* {{Citation| last = Bhikkhu Bodhi | year =2012 | title =A Comprehensive Manual of Abhidhamma: The Abhidhammattha Sangaha | publisher =Independent Publishers Group |edition= Kindle }}\n* {{Citation | last=Bhikkhu Ñāṇamoli |contribution=Introduction|title=Visuddhimagga: The Path of Purification|publisher=Buddhist Publication Society |isbn=1-928706-01-0|year=1999 |editor-last=Buddhaghosa|editor2-last=Bhikkhu Ñāṇamoli, trans.|author-link=Nanamoli Bhikkhu}}\n* {{Citation | last =Buswell | first =Robert E. | year =2004 | title =Encyclopedia of Buddhism | publisher =MacMillan| isbn= 978-0028657202}}\n* {{Citation | last1 =Buswell | first1 =Robert E. | last2 =Lopez | first2 =Donald S. | year =2013 | title = The Princeton Dictionary of Buddhism | publisher = Princeton University | isbn=978-1-4008-4805-8 }}\n* {{Citation | last =Clarke | first =Peter | year =2004 | title =Encyclopedia of New Religious Movements | publisher =Routledge}}\n* {{Citation | last =Choong | first =Mun-Keat | year =1999 | title =The Notion of Emptiness in Early Buddhism | publisher =Motilal Banarsidass Publishers}}\n* {{Citation |first=Steven |last= Collins |title=Nirvana: Concept, Imagery, Narrative |url=https://books.google.com/books?id=d5pshUYiUVwC |year=2010|publisher=Cambridge University Press |isbn=978-0-521-88198-2 }}\n* {{Citation | last =Conze | first =Edward | year =1967 | title =Thirty years of Buddhis Studies. Selected essays by Edward Conze | publisher =Bruno Cassirer | url =http://lirs.ru/lib/conze/Thirty_Years_of_Buddhist_studies,Conze,1967,incomplete,300dpi.pdf}}\n* {{Citation | last =Cousins | first =L.S. | year =1998 | chapter =Nirvana | editor-last =Craig | editor-first =Edward | title =Routledge Encyclopedia of Philosophy. Volume 7: Nihilism to Quantum Mechanics | publisher =Taylor & Francis}}\n* {{cite book | last1 =Duiker | first1 =William J. | last2 =Spielvogel | first2 =Jackson J. | year =2008 | title =World History: To 1800 |url =https://books.google.com/books?ei=LoFpT7XiMYLNrQeh6Z2MCA&id=bj8HX6sWhYAC&dq=NIRVANA+A+HINDU+CONCEPT&q=NIRVANA++HINDU#v=snippet&q=NIRVANA%20%20HINDU&f=false}}\n* {{Citation| last =Duckworth | first = Douglas | year =2011 | title =Jamgon Mipam: His Life and Teachings |edition= Kindle | publisher =Shambhala}}\n* {{Citation| last =Dudjom Rinpoche | year =2011 | title =A Torch Lighting the Way to Freedom: Complete Instructions on the Preliminary Practices |others=Translated by the Padmakara Translation Group | publisher =Shambhala |edition= Kindle }}\n* {{cite book | last1 =Duiker | first1 =William J. | last2 =Spielvogel | first2 =Jackson J. | year =2008 | title =World History: To 1800 |url =https://books.google.com/books?ei=LoFpT7XiMYLNrQeh6Z2MCA&id=bj8HX6sWhYAC&dq=NIRVANA+A+HINDU+CONCEPT&q=NIRVANA++HINDU#v=snippet&q=NIRVANA%20%20HINDU&f=false}}\n* {{Citation | last1 =Fischer-Schreiber | first1 =Ingrid | last2 =Ehrhard | first2 =Franz-Karl | last3 =Diener | first3 =Michael S. | year =2008 | title =Lexicon Boeddhisme. Wijsbegeerte, religie, psychologie, mystiek, cultuur en literatuur | publisher =Asoka}}\n* {{Citation| last =Gethin | first = Rupert | year =1998 | title =Foundations of Buddhism | publisher =Oxford University Press}}\n* {{Citation| last =Goldstein | first = Joseph | year =2011 | title =One Dharma: The Emerging Western Buddhism | publisher =HarperCollins |edition= Kindle }}\n* {{Citation| last =Goleman | first = Daniel | year =2008 | title =Destructive Emotions: A Scientific Dialogue with the Dalai Lama | publisher=Bantam |edition= Kindle }}\n* {{Citation | last =Gombrich | first =Richard F. | year =2006 | title =How Buddhism Began. The conditioned genesis of the early teachings. Second edition | publisher =Routledge}}\n* {{Citation | last =Gombrich | first =Richard | year =2009 | title =What The Buddha Thought | publisher =Equinox}}\n* {{Citation | last= Gregory | first =Peter N. | year =1991 | title =Sudden Enlightenment Followed by Gradual Cultivation: Tsung-mi's Analysis of Mind. In: Peter N. Gregory (editor)(1991), Sudden and Gradual. Approaches to Enlightenment in Chinese Thought. | place =Delhi | publisher =Motilal Banarsidass Publishers Private Limited}}\n* {{Citation | last =Harvey | first =Peter |contribution=Consciousness Mysticism in the Discourses of the Buddha |title=The Yogi and the Mystic |publisher=Curzon Press | year=1989 |editor-last=Werner|editor-first=Karel}}\n* {{Citation| last =Harvey | first =Peter | year =1990 |title =Introduction to Buddhism | publisher =Cambridge University Press}}\n* {{Citation | last =Harvey | first =Peter | year =1995 | title =An introduction to Buddhism. Teachings, history and practices | publisher =Cambridge University Press}}\n* {{Citation| last =Harvey | first = Peter | year =1995 |title =The Selfless Mind: Personality, Consciousness and Nirvāṇa in Early Buddhism | publisher =Routledge|isbn= 0-7007-0338-1}}\n* {{cite book | last =Hindson | first =Ed | year=2008 | title=The Popular Encyclopedia of Apologetics | url=https://books.google.com/books?id=yipXIHcteRsC&pg=PA264&dq=NIRVANA+A+HINDU+CONCEPT&hl=en&sa=X&ei=LoFpT7XiMYLNrQeh6Z2MCA&ved=0CDYQ6AEwAQ#v=onepage&q=NIRVANA%20A%20HINDU%20CONCEPT&f=false}}\n* {{Citation | last =Hwang | first =Soonil | year =2006 | title =Metaphor and Literalism in Buddhism: The Doctrinal History of Nirvana | publisher =Routledge}}\n* {{Citation| last =Keown | first =Damien | year=2000| title= Buddhism: A Very Short Introduction | publisher=Oxford University Press|edition= Kindle }}\n* {{cite book|ref=harv|first=Damien |last= Keown |title=A Dictionary of Buddhism |url=https://books.google.com/books?id=985a1M7L1NcC  |year=2004|publisher=Oxford University Press |isbn=978-0-19-157917-2}}\n* {{Citation| last =Khunu Rinpoche | year=2012| title= Vast as the Heavens, Deep as the Sea: Verses in Praise of Bodhicitta  | others=Translated by Thubten Thardo (Gareth Sparham)| publisher=Wisdom |edition= Kindle }}\n* {{Citation | last =Kornberg Greenberg | first =Yudit | year =2008 | title =Encyclopedia of Love in World Religions, Volume 2 | publisher =ABC-CLIO}}\n* {{Citation| last =Lama Surya Das | year =1997 | title =Awakening the Buddha Within | publisher =Broadway Books|edition= Kindle }}\n* {{Citation | last =Lindtner | first =Christian | year =1997 | title =The Problem of Precanonical Buddhism | journal =Buddhist Studies Review |volume=14 |page=2 | url =https://archive.org/details/BackCopiesOfBuddhistStudiesReview}}\n* {{Citation | last =Lindtner | first =Christian | year =1999 | title =From Brahmanism to Buddhism | journal =Asian Philosophy |volume=9 |issue=1| doi= 10.1080/09552369908575487 }}\n* {{Citation| last =Lopez | first =Donald S.| year =2001 | title =The Story of Buddhism | publisher =HarperCollins }}\n* {{Citation| last =Moffitt | first =Philip| year =2008 | title =Dancing with Life: Buddhist Insights for Finding Meaning and Joy in the Face of Suffering | publisher =Rodale|edition= Kindle }}\n* {{Citation| last =Pabongka Rinpoche | year =2006 | title =Liberation in the Palm of Your Hand: A Concise Discourse on the Path to Enlightenment | publisher =Wisdom | edition= Kindle }}\n* {{cite book | last =Pruthi | first =R.K. | year =2004 | title =Sikhism And Indian Civilization | url =https://books.google.com/books?ei=zYJpT_PfJcbtrQfm0tSOCA&id=KxndvJs3wUkC&dq=NIRVANA+SIKHISM&q=NIRVANA#v=snippet&q=NIRVANA&f=false}}\n* {{Citation | last =Ray | first =Reginald | year =1999 | title =Buddhist Saints in India: A Study in Buddhist Values and Orientations | publisher =Oxford University Press}}\n* {{Citation | last =Reat | first =N. Ross | year =1998 | title =The Salistamba Sutra | publisher =Motilal Banarsidass}}\n* {{Citation| last= Ringu Tulku | year =2005 | title =Daring Steps Toward Fearlessness: The Three Vehicles of Tibetan Buddhism| publisher = Snow Lion}}\n* {{Citation | last =Sharf | first =Robert H. | title =Buddhist Modernism and the Rhetoric of Meditative Experience | journal =NUMEN |volume=42 |year=1995 |pages=| url =http://buddhiststudies.berkeley.edu/people/faculty/sharf/documents/Sharf1995,%20Buddhist%20Modernism.pdf}}\n* {{Citation | last =Sharf | first =Robert H. | year =2000 | title =The Rhetoric of Experience and the Study of Religion. |journal=Journal of Consciousness Studies |volume=7 |issue=11-12 |pages=267–87 | url =http://buddhiststudies.berkeley.edu/people/faculty/sharf/documents/Sharf1998,%20Religious%20Experience.pdf}}\n* {{Citation| last1 =Smith| first1=Huston|last2=Novak|first2=Philip| year=2009| title= Buddhism: A Concise Introduction | publisher=HarperOne|edition= Kindle }}\n* {{Citation | last =Snelling | first=John | year= 1987 |title =The Buddhist handbook. A Complete Guide to Buddhist Teaching and Practice | place =London | publisher =Century Paperbacks}}\n* {{Citation | last =Swanson | first =Paul L. | year =1997 | title = Zen is not Buddhism, Recent Japanese Critiques of Buddha-Nature | journal =Numen | volume=40| issue=2| publisher =Brill Academic |doi= 10.1163/156852793X00112}}\n* {{Citation| last= Thich Nhat Hanh | year =1991 | title =Old Path White Clouds| publisher = Parallax Press}}\n* {{Citation| last= Thich Nhat Hanh | year =1999 | title =The Heart of the Buddha's Teaching | publisher = Three River Press}}\n* {{Citation| last= Thrangu Rinpoche | year =1993 | title =The Practice of Tranquillity & Insight: A Guide to Tibetan Buddhist Mediation | publisher = Snow Lion}}\n* {{cite book | last =Trainor | first =Kevin | year =2004 | title =Buddhism: The Illustrated Guide | url =https://books.google.com/books?id=_PrloTKuAjwC&pg=PA68&dq=nirvana+buddhism&hl=en&sa=X&ei=yoNpT_X6Eo7NrQfkxL2KCA&ved=0CDQQ6AEwAA#v=onepage&q=nirvana%20buddhism&f=false}}\n* {{Citation| last= Traleg Kyabgon| year =2001 | title =The Essence of Buddhism | publisher = Shambhala}}\n* {{Citation| last= Tsele Natsok Rangdrol| year =1987 | title =The Mirror of Mindfulness | others= Translated by Erik Pema Kunsang | publisher = Rangjung Yeshe}}\n* {{Citation |first=Tilmann|last= Vetter |title=The Ideas and Meditative Practices of Early Buddhism |url=https://books.google.com/books?id=RwwVAAAAIAAJ |date=1988 |publisher=Brill Academic |isbn=90-04-08959-4 }}\n* {{Citation| last= Walpola Rahula | year =2007| title =What the Buddha Taught| publisher = Grove Press|edition= Kindle }}\n* {{Citation | last =Walsh | first = Maurice | year = 1995 | title =The Long Discourses of the Buddha. A Translation of the Digha Nikaya | publisher =Wisdom Publications}}\n* {{Citation | last =Wayman | first= Alex and Hideko | year =1990 | title =The Lion's roar of Queen Srimala | place =Delhi | publisher =Motilal Banarsidass Publishers}}\n* {{Citation| last= Williams | first=Paul | year =2002 | title =Buddhist Thought | publisher = Taylor & Francis|edition= Kindle }}\n* {{Citation | last =Wynne | first =Alexander | year =2007 | title =The Origin of Buddhist Meditation | publisher = Routledge}}\n* {{Citation| last=Yamamoto Kosho  | year =1975| title =Mahayanism: A Critical Exposition of the Mahāyāna Mahāparinirvāna Sutra| publisher = Ube City: Karinbunko}}\n{{refend}}\n\n===Web-sources===\n{{reflist|group=web}}\n\n==Further reading==\n* [[Ajahn Brahm]], \"Mindfulness, Bliss, and Beyond: A Meditator's Handbook\" (Wisdom Publications 2006) Part II.\n* [[Katukurunde Nanananda Thera|Katukurunde Nanananda]], \"Nibbana - The Mind Stilled (Vol. I-VII)\" (Dharma Grantha Mudrana Bharaya, 2012).\n* Kawamura, Bodhisattva Doctrine in Buddhism, Wilfrid Laurier University Press, 1981, pp.&nbsp;11.\n* {{cite journal | last = Lindtner | first = Christian | title = Problems of Pre-Canonical Buddhism | journal = Buddhist Studies Review | year = 1997 | volume = 14 | issue = 2 | url = https://archive.org/details/BackCopiesOfBuddhistStudiesReview }}\n* Yogi Kanna, \"Nirvana: Absolute Freedom\" (Kamath Publishing; 2011) 198 pages.\n* Steven Collins. ''Nirvana: Concept, Imagery, Narrative''  (Cambridge University Press; 2010) 204 pages.\n\n==External links==\n{{wikiquote}}\n{{Wiktionary}}\n\n{{Buddhism topics}}\n{{Indian philosophy}}\n\n[[Category:Buddhist philosophical concepts]]\n[[Category:Buddhist terminology]]",
            "slug": "nirvana-buddhism-",
            "date_updated": 1531838222000,
            "imported": "https://en.wikipedia.org/wiki/Nirvana_(Buddhism)"
        }
    ]
}