{
    "article": [
        {
            "title": "Samadhi",
            "text": "{{about|meditation|other uses|Samādhi (disambiguation)}}\n{{Hinduism small}}\n{{Buddhism|terse=1}}\n{{Jainism}}\n'''Samadhi''' ([[Sanskrit]]: {{lang|sa|समाधि}}, {{IPA-hns|səˈmaːd̪ʱi|hi}}), also called ''[[samāpatti]]'', in [[Hinduism]], [[Buddhism]], [[Jainism]], [[Sikhism]] and [[yogic]] schools refers to a state of meditative consciousness. It is a [[meditation|meditative]] absorption or trance, attained by the practice of ''[[dhyāna (disambiguation)|dhyāna]]''.{{sfn|Sarbacker|2012|p=13}} In ''samādhi'' the mind becomes still. It is a state of being totally aware of the present moment; a one-pointedness of mind.<ref group=web name =\"dictionary.com\" />\n\nIn Buddhism, it is the last of the eight elements of the [[Noble Eightfold Path]].<ref group=web name=\"access\" /> In the [[Rāja yoga|Ashtanga Yoga]] tradition, it is the eighth and final limb identified in the ''[[Yoga Sutras of Patanjali|Yoga Sutras]]'' of [[Patanjali]].<ref>{{cite journal |title=The eight limbs, The core of Yoga|url=http://www.expressionsofspirit.com/yoga/eight-limbs.htm|journal=http://www.expressionsofspirit.com}}</ref><ref>{{cite journal |title=8 Limbs of Yoga: Samādhi|url=http://www.families.com/blog/8-limbs-of-yoga-samādhi|journal=http://www.families.com}}</ref>\n\n==Definitions==\n* Sarbacker: ''samādhi''  is [[meditation|meditative]] absorption, attained by the practice of ''dhyāna''.{{sfn|Sarbacker|2012|p=13}}\n* Diener, Erhard & Fischer-Schreiber: ''samādhi'' is a non-dualistic state of [[consciousness]] in which the consciousness of the experiencing subject becomes one with the experienced object.{{sfn|Diener|Erhard|Fischer-Schreiber Ingrid|1991}} \n* Shankman: an abiding in which mind becomes very still but does not merge with the object of attention, and is thus able to observe and gain insight into the changing flow of experience.{{sfn|Shankman|2008}}\n\n==Etymology==\n===Sanskrit===\nVarious interpretations for the term's [[etymology]] are possible:\n* ''sam'', \"together\"; ''a'', \"toward\"; stem of ''dadhati'', \"puts, places\": \"a putting or joining together;\"<ref group=web name =\"dictionary.com\">[http://dictionary.reference.com/search?q=samadhi Dictionary.com, ''Samādhi'']</ref>\n* ''sam'', \"together\" or \"integrated\"; ''ā'', \"towards\"; ''dhā'', \"to get, to hold\": \"to acquire integration or wholeness, or truth\" (''[[samapatti|samāpatti]]'');\n* ''sam'', \"uniformly\" or \"fully\"; ''adhi'', \"to get established: : a state wherein one establishes himself to the fullest extent in the Supreme consciousness;\n* ''samā'', \"even\"; ''[[Dhi (Hindu thought)|dhi]]'', \"intellect\": a state of total [[List of types of equilibrium|equilibrium]] of a detached [[intellect]].\n* ''sam'', \"perfect,\" \"complete.\" ''dhi'', \"consciousness\": a state of being where \"all distinctions between the person who is the subjective meditator, the act of meditation and the object of meditation merge into oneness.\"\n* ''sama'', \"equanimous\" ''dhi'',\"buddhi or the intellect\"<ref>{{Cite book|title=Yoga Meditation|last=Sturgess|first=Stephen|publisher=Watkins Publishing Limited|year=2014|isbn=978-1-78028-644-0|location=Oxford, UK|pages=27|via=}}</ref>\n\n===Chinese===\nCommon [[Chinese language|Chinese]] terms for samadhi include the transliterations ''sanmei'' (三昧) and ''sanmodi'' (三摩地 or 三摩提), as well as the translation of the term literally as ''ding'' (定 \"fixity\"). [[Kumarajiva]]'s translations typically use ''sanmei'' (三昧), while the translations of [[Xuanzang]] tend to use ''ding'' (定 \"fixity\"). The [[Chinese Buddhist canon]] includes these as well as other translations and transliterations of the term.\n\n==Origins==\nAccording to [[Thomas William Rhys Davids|Rhys Davids]]{{refn|group=note|n.d.: unpaginated}} the first attested usage of the term ''samadhi'' in [[Sanskrit literature]] was in the ''[[Maitri Upanishad]].''<ref group=web>T. W. Rhys Davis (n.d.). 'Introduction to the Subha Sutta'. Source: [http://www.metta.lk/tipitaka/2Sutta-Pitaka/1Digha-Nikaya/Digha1/10-subha-e.html Metta.lk] (accessed: Thursday December 24, 2009)</ref>\n\n''Samadhi'' is comes from the Sanskrit word ''sama,'' meaning \"together,\" and ''dhi,'' meaning \"mind.\" The origins of the practice of ''dhyana'', which culminates into ''samadhi'', are a matter of dispute.{{sfn|bronkhorst|1993}}{{sfn|Wynne|2007}} ''Dhyana'' was  originally practiced in Hinduism, but was later adapted by Buddhist practitioners. These practices were paired to mindfulness and insight, and given a new interpretation.{{sfn|Wynne|2007}} Kalupahana argues that the Buddha \"reverted to the meditational practices\" he had learned from Alara Kalama and Uddaka Ramaputta.{{sfn|Kalupahana|1994|p=24}}\n\n== Buddhism ==\nThe term 'Samadhi' derives from the root sam-a-dha, which means 'to collect' or 'bring together', and thus it is often translated as 'concentration' or 'unification of mind'. In the early Buddhist texts, samadhi is also associated with the term [[samatha]] (calm abiding). In the suttas, samadhi is defined as one-pointedness of mind (''Cittass'ekaggatā'').<ref>Henepola Gunaratana, The Jhanas in Theravada Buddhist Meditation © 1995</ref>\n\n[[Buddhagosa]] defines samadhi as \"the centering of consciousness and consciousness concomitants evenly and rightly on a single object...the state in virtue of which consciousness and its concomitants remain evenly and rightly on a single object, undistracted and unscattered\" (Vism.84-85; PP.85).\n\nThe Theravada Pali texts mention four kinds of samadhi: \n*Momentary concentration (''khanikasamadhi''): A mental stabilization which arises during [[vipassana]].\n*Preliminary concentration (''parikammasamadhi''): Arises out of the meditator's initial attempts to focus on a meditation object.\n*Access concentration (''upacarasamadhi''): Arises when the [[five hindrances]] are dispelled, when [[Dhyāna in Buddhism|jhana]] is present, and with the appearance the 'counterpart sign' (''patibhaganimitta''). \n*Absorption concentration (''appanasamadhi''): The total immersion of the mind on its meditation of object and stabilization of all four jhanas.\n\n===Dhyana===\n{{main article|Dhyāna in Buddhism}}\n''Samadhi'' the last of the eight elements of the [[Noble Eightfold Path]].<ref group=web name=\"access\">[http://www.accesstoinsight.org/ptf/dhamma/sacca/sacca4/samma-samadhi/ accesstoinsight, '' Right Concentration, samma samadhi'']</ref>  The Noble Eightfold Path is a condensation of more elaborate descriptions of this path, which starts with a householder who hears the dhamma and leaves home (either literally or figuratively), and after preparatory practices starts with the practice of ''dhyana''.{{sfn|Bucknell|1984}}{{refn|group=note|See [[Pre-sectarian Buddhism#The eightfold path]], and Majjhima Nikaya 27:11-26, ''Cula-hatthipadopama Sutta'', \"The Shorter Elephant Footprint Simile\".<ref group=web>[http://www.accesstoinsight.org/tipitaka/mn/mn.027.than.html accesstoinsight, ''Cula-hatthipadopama Sutta: The Shorter Elephant Footprint Simile'']</ref>}} ''Samādhi'' refers here to the [[Dhyana in Buddhism|jhanas]], levels of gradual deepening of meditation. The [[Pali Canon|Pāli canon]] describes eight progressive states of ''jhāna'': four meditations of form (''rūpa jhāna''), and four formless meditations (''arūpa jhāna''). A ninth form is ''[[Nirodha]]-[[Samāpatti]]''.\n\nAccording to Bronkhorst, the four ''rūpa jhāna'' may be an original contribution of the Buddha to the religious landscape of India.{{sfn|Bronkhorst|1993}} They formed an alternative to the painful ascetic practices of the Jains.{{sfn|Bronkhorst|1993}} The ''arūpa jhāna'' were incorporated from non-Buddhist ascetic traditions.{{sfn|Bronkhorst|1993}} According to Crangle, the development of meditative practices in ancient India was a complex interplay between Vedic and non-Vedic traditions.{{sfn|Crangle|1994|p=267-274}}\n\n===Description===\n{{JhanaFactors}}\nMajjhima Nikaya 26:34-42, ''Ariyapariyesana Sutta'', \"The Noble Search\", gives the following description of the four ''rupa jhanas'' (\"form jhanas\"), the four ''arupha jhanas'' (\"formless jhanas\"), and ''nirodha-samapatti'', the cessation of perception and feeling:<ref group=web name=\"MN26\">[http://www.accesstoinsight.org/tipitaka/mn/mn.026.than.html access to insight, Majjhima Nikaya 26, ''Ariyapariyesana Sutta'', \"The Noble Search\"]</ref>{{refn|group=note|See also [http://www.accesstoinsight.org/tipitaka/an/an05/an05.028.than.html Samadhanga Sutta: The Factors of Concentration]}}\n\n;First jhana\n\"Suppose that a wild deer is living in a wilderness glen. Carefree it walks, carefree it stands, carefree it sits, carefree it lies down. Why is that? Because it has gone beyond the hunter's range.{{refn|group=note|See Majjhima Nikaya 25, ''Nivāpa Sutta'', in which the Buddha compares the search of the recluses and brahmins with deers (the recluses and brahmins) who try to escape the bait (sensual pleasure) of hunters (''Mara''). The deers who escape are those who keep accees to the senses, but in a mindful way; and who don't hold views like \"the world is eternal, \"the world is not eternal\", et cetera. This is possible by the practice of jhana, which puts the recuses and brahmins out of reach of ''Mara''.<ref group=web name=\"MN25\">[http://www.metta.lk/tipitaka/2Sutta-Pitaka/2Majjhima-Nikaya/Majjhima1/025-nivapa-sutta-e1.html metta.lk, Majjhima Nikaya 25, Nivāpa Sutta'', \"The Simile of the Deer Feeder\"]</ref>}} In the same way, a monk—quite withdrawn from sensual pleasures, withdrawn from unskillful qualities—enters & remains in the first jhana: [[Pīti|rapture]] & [[Sukha|pleasure]] born from withdrawal, accompanied by [[Vitarka|directed thought]] & [[Vicara|evaluation]]. This monk is said to have blinded [[Mara (demon)|Mara]]. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.\n\n;Second jhana\n\"Then again the monk, with the stilling of directed thoughts & evaluations, enters & remains in the second jhana: [[Pīti|rapture]] & [[Sukha|pleasure]] born of composure, unification of awareness free from directed thought & evaluation—internal assurance. This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.\n\n;Third jhana\n\"Then again the monk, with the fading of rapture, he remains equanimous, mindful, & alert, and senses pleasure with the body. He enters & remains in the third jhana, of which the Noble Ones declare, 'Equanimous & mindful, he has a pleasant abiding.' This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.\n\n;Fourth jhana\n\"Then again the monk, with the abandoning of pleasure & stress—as with the earlier disappearance of elation & distress—enters & remains in the fourth jhana: purity of equanimity & mindfulness, neither-pleasure-nor-pain. This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.\n\n;The infinitude of space\n\"Then again the monk, with the complete transcending of perceptions of [physical] form, with the disappearance of perceptions of resistance, and not heeding perceptions of diversity, [perceiving,] 'Infinite space,' enters & remains in the dimension of the infinitude of space. This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.\n\n;The infinitude of consciousness\n\"Then again the monk, with the complete transcending of the dimension of the infinitude of space, [perceiving,] 'Infinite consciousness,' enters & remains in the dimension of the infinitude of consciousness. This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.\n\n;The dimension of nothingness\n\"Then again the monk, with the complete transcending of the dimension of the infinitude of consciousness, [perceiving,] 'There is nothing,' enters & remains in the dimension of nothingness. This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.\n\n;The dimension of neither perception nor non-perception\n\"Then again the monk, with the complete transcending of the dimension of nothingness, enters & remains in the dimension of neither perception nor non-perception. This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.\n\n;The cessation of perception & feeling\n\"Then again the monk, with the complete transcending of the dimension of neither perception nor non-perception, enters & remains in the cessation of perception & feeling. And, having seen [that] with discernment, his mental fermentations are completely ended. This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One. Having crossed over, he is unattached in the world. Carefree he walks, carefree he stands, carefree he sits, carefree he lies down. Why is that? Because he has gone beyond the Evil One's range.\"\n\n===Mental factors===\nThe ''rupa-jhānas'' are described according to the nature of the mental factors which are present in these states:\n# [[Vitakka|Movement of the mind onto the object]] (''vitakka''; Sanskrit: ''vitarka'')\n# [[Vicara|Retention of the mind on the object]] (''vicāra'')\n# [[Pīti|Joy, rapture]] (''pīti''; Sanskrit: ''prīti'')\n# [[Sukha|Happiness]] (''sukha'')\n# [[Upeksa|Equanimity]] (''upekkhā''; Sanskrit: ''{{IAST|upekṣā}}'')\n# [[Ekaggata|One-pointedness]] (''ekaggatā''; Sanskrit: ''ekāgratā''){{refn|group=note|In the ''[[Suttapitaka]]'', right concentration is often referred to as having five factors, with one-pointedness (''ekaggatā'') not being explicitly identified as a factor of ''jhana'' attainment (see, for instance, SN 28.1-4, AN 4.41, AN 5.28).}}\n\n===''Dhyana'' and insight===\n\n====Two traditions====\nA core problem in the study of early Buddhism is the relation between ''dhyana'' and insight.{{sfn|Vetter|1988}}{{sfn|Bronkhorst|1993}}{{sfn|Gombrich|1997}} The Buddhist tradition has incorporated two traditions regarding the use of jhana.{{sfn|Bronkhorst|1993}} There is a tradition that stresses attaining [[Vipassana|insight]] ([[bodhi]], [[Wisdom in Buddhism|prajna]], [[kensho]]) as the means to awakening and liberation. But it has also incorporated the [[Yoga|yogic tradition]], as reflected in the use of jhana, which is rejected in other sutras as not resulting in the final result of liberation.{{sfn|Vetter|1988}}{{sfn|bronkhorst|1993}}{{sfn|Gombrich|1997}} The problem was famously voiced in 1936 by Louis de La Vallee Poussin, in his text ''Musila et Narada: Le Chemin de Nirvana''.{{sfn|Bronkhorst|1993|p=133-134}}{{refn|group=note|See [http://www.gampoabbey.org/documents/kosha-sources/La-Vallee-Poussin-Musila-and-Narada-The-Path-of-Nirvana-1937.pdf Louis de La Vallée Poussin, ''Musial and Narad'']. Translated from the French by Gelongma Migme Chödrön and Gelong Lodrö Sangpo.}}\n\nSchmithausen discerns three possible roads to liberation as described in the suttas,{{sfn|Schmithausen|1981}} to which Vetter adds the sole practice of ''dhyana'' itself, which he sees as the original \"liberating practice\":{{sfn|Vetter|1988|p=xxi-xxii}}\n# The four Rupa Jhanas themselves constituted the core liberating practice of early buddhism, c.q. the Buddha;{{sfn|Vetter|1988|xxi-xxxvii}}\n# Mastering the four Rupa Jhanas, where-after \"liberating insight\" is attained;\n# Mastering the four Rupa Jhanas and the four Arupa Jhanas, where-after \"liberating insight\" is attained;\n# Liberating insight itself suffices.\n\nThis problem has been elaborated by several well-known scholars, including Tilman Vetter,{{sfn|Vetter|1988}} Johannes Bronkhorst,{{sfn|Bronkhorst|1993}} and Richard Gombrich.{{sfn|Gombrich|1997}} Schmithausen{{refn|group=note|In his often-cited article ''On some Aspects of Descriptions or Theories of 'Liberating Insight' and 'Enlightenment' in Early Buddhism''}} notes that the mention of the four noble truths as constituting \"liberating insight\", which is attained after mastering the Rupa Jhanas, is a later addition to texts such as Majjhima Nikaya 36.{{sfn|Schmithausen|1981}}{{sfn|Bronkhorst|1993}}{{sfn|Vetter|1988}} Both Schmithausen and Bronkhorst note that the attainment of insight, which is a cognitive activity, cannot be possible in state wherein all cognitive activity has ceased.{{sfn|Bronkhorst|1993}} According to Vetter and Bronkhorst, ''dhyana'' itself constituted the original \"liberating practice\".{{sfn|Vetter|1988|p=xxi-xxii}}{{sfn|Bronkhorst|1993}}{{sfn|Cousins|1996|p=58}} According to Alexander Wynne, the ultimate aim of ''dhyana'' was the attainment of insight,{{sfn|Wynne|2007|p=105}} and the application of the meditative state to the practice of mindfulness.{{sfn|Wynne|2007|p=105}} According to Frauwallner, mindfulness was a means to prevent the arising of craving, which resulted simply from contact between the senses and their objects. According to Frauwallner, this may have been the Buddha's original idea.{{sfn|Williams|2000|p=45}} According to Wynne, this stress on mindfulness may have led to the intellectualism which favoured insight over the practice of ''dhyana''.{{sfn|Wynne|2007|p=106}}\n\n====Two kinds of ''dhyana''====\nAccording to Richard Gombrich, the sequence of the four ''rupa-jhanas'' describes two different cognitive states:\n{{quote|I know this is controversial, but it seems to me that the third and fourth jhanas are thus quite unlike the second.{{sfn|Wynne|2007|p=140, note 58}}{{refn|group=note|Original publication: {{Citation | last =Gombrich | first =Richard | year =2007 | title =Religious Experience in Early Buddhism | publisher =OCHS Library | url =http://www.ochs.org.uk/lectures/religious-experience-early-buddhism}}}}}}\n\nAlexander Wynne further explains that the ''dhyana''-scheme is poorly understood.{{sfn|Wynne|2007|p=106}} According to Wynne, words expressing the inculcation of awareness, such as ''sati'', ''sampajāno'', and ''upekkhā'', are mistranslated or understood as particular factors of meditative states,{{sfn|Wynne|2007|p=106}} whereas they refer to a particular way of perceiving the sense objects:{{sfn|Wynne|2007|p=106}}\n{{quote|Thus the expression ''sato sampajāno'' in the third ''jhāna'' must denote a state of awareness different from the meditative absorption of the second ''jhāna'' (''cetaso ekodibhāva''). It suggests that the subject is doing something different from remaining in a meditative state, i.e. that he has come out of his absorption and is now once again aware of objects. The same is true of the word ''upek(k)hā'': it does not denote an abstract 'equanimity', [but] it means to be aware of something and indifferent to it [...] The third and fourth ''jhāna-s'', as it seems to me, describe the process of directing states of meditative absorption towards the mindful awareness of objects.}}{{sfn|Wynne|2007|p=106-107}}{{refn|group=note|name=\"theravadin\"|theravadin.wordpress.com: \"In this order, therefore, what we should understand as vipassanā is not at all a synonym for sati but rather something which grows out of the combination of all these factors especially of course the last two, samma sati and samma samādhi applied to the ruthless observation of what comes into being (yathābhūta). One could say, vipassanā is a name for the practice of sati+samādhi as applied to anicca/dukkha/anatta (i.e. generating wisdom) directed at the six-sense-process, including any mental activity.\" According to Gombrich, \"the later tradition has falsified the jhana by classifying them as the quintessence of the concentrated, calming kind of meditation, ignoring the other - and indeed higher - element.{{sfn|Wynne|2007|p=140, note 58}}}}\n\n===In Buddhist tradition===\n\n====Theravada====\nAccording to Buddhaghosa, in his influential standard-work [[Visuddhimagga]], ''samadhi'' is the \"proximate cause\" to the obtainment of [[Wisdom in Buddhism|wisdom]].{{sfn|Buddhaghosa|Nanamoli|1999|p=437}} The Visuddhimagga describes [[kammatthana|40 different objects]] for meditation, which are mentioned throughout the Pali canon, but explicitly enumerated in the [[Visuddhimagga]], such as [[anapana|mindfulness of breathing]] (''anapanasati'') and [[metta|loving kindness]] (''metta'').{{citation needed|date=November 2014}}\n\n==== Mahayana ====\n[[File:Gandhara, bodhisattva assiso, II sec..JPG|thumb|150px|[[Bodhisattva]] seated in [[jhana|meditation]]. [[Afghanistan]], 2nd century CE]]\n\n=====Indian Mahayana=====\nThe earliest extant Indian Mahayana texts emphasize ascetic practices and forest dwelling, and absorption in states of meditative oneness. These practices seem to have occupied a central place in early Mahayana, also because they \"may have given access to fresh revelations and inspiration.\"{{sfn|Williams|2008|p=30}}\n\nIn the Indian Mahayana traditions the term is also to refer to forms of \"samadhi\" other than ''dhyana''. Section 21 of the ''Mahavyutpatti'' records even 118 samadhi.{{sfn|Skilton|2002|p=56}} The [[Samadhiraja Sutra]] for example has as its main theme a samādhi called 'the samadhi that is manifested as the sameness of the essential nature of all dharmas' (''sarva-dharma-svabhavā-samatā-vipañcita-samādhi'').{{sfn|Gomez|Silk|1989|p=15-16}}{{refn|group=note|Gomez & Silk: \"This samadhi is at the same time the cognitive experience of emptiness, the attainment of the attributes of buddhahood, and the performance of a variety of practices or daily activities of a bodhisattva—including service and adoration at the feet of all buddhas. The word samadhi is also used to mean the sūtra itself. Consequently, we can speak of an equation, sūtra <nowiki>=</nowiki> samādhi <nowiki>=</nowiki> śūnyatā, underlying the text. In this sense the title ''Samadhiraja'' expresses accurately the content of the sūtra.\"{{sfn|Gomez|Silk|1989|p=15-16}}}}\n\n=====Zen=====\n[[File:Grandmaster.png|thumb|right|150px|A traditional Chinese Chán Buddhist master in [[Taiwan]], sitting in meditation]]\n{{Main article|Zen|Chinese Chán|Japanese Zen|Zen in the United States}}\n\nIndian ''dhyana'' was translated as ''chán'' in Chinese, and ''zen'' in Japanese. Ideologically the [[Zen|Zen-tradition]] emphasizes prajna and [[Subitism|sudden insight]], but in the actual practice prajna and samādhi, or sudden insight and gradual cultivation, are paired to each other.{{sfn|McRae|2003}}{{sfn|Hui-Neng|Cleary|1998}} Especially some lineages in the [[Rinzai school|Rinzai school of Zen]] stress sudden insight, while the [[Sōtō]] school of Zen lays more emphasis on [[shikantaza]], training awareness of the stream of thoughts, allowing them to arise and pass away without interference.\n\n==Hinduism==\n\n===Patanjali's Yoga sutras===\n''Samadhi'' is the main subject of the eighth limb of the [[Yoga Sutras]] called ''Samadhi-pada''. They resemble the Buddhist ''jhanas''.{{sfn|Pradhan|2015|p=151-152}}{{refn|group=note|See also [http://www.ahandfulofleaves.org/documents/Articles/A%20Comparison%20of%20Hindu%20and%20Buddhist%20Techniques%20of%20Attaining%20Samadhi_Crangle_1984.pdf Eddie Crangle (1984), ''Hindu and Buddhist techniques of Attaining Samadhi'']}} According to David Gordon White, the language of the ''Yoga Sutras'' is often closer to \"Buddhist Hybrid Sanskrit, the Sanskrit of the early Mahayana Buddhist scriptures, than to the classical Sanskrit of other Hindu scriptures.\"{{sfn|White|2014|p=10}} According to Karel Werner,\n{{quote|Patanjali's system is unthinkable without Buddhism. As far as its terminology goes there is much in the Yoga Sutras that reminds us of Buddhist formulations from the [[Pāli Canon]] and even more so from the [[Sarvastivada]] [[Abhidharma]] and from [[Sautrāntika]].\"{{sfn|Werner|1994|p=27}}}}\n\n[[Robert Thurman]] writes that Patañjali was influenced by the success of the [[Buddhism|Buddhist]] monastic system to formulate his own matrix for the version of thought he considered orthodox.{{sfn|Thurman|1984|p=34}} However, it is also to be noted that the Yoga Sutra, especially the fourth segment of Kaivalya Pada, contains several polemical verses critical of Buddhism, particularly the Vijñānavāda school of Vasubandhu.{{sfn|Farquhar|1920|p=132}}\n\n====Samadhi====\nSamadhi is oneness with the object of meditation. There is no distinction between act of meditation and the object of meditation. Samadhi is of two kinds,{{sfn|Jones|Ryan|2006|p=377}}<ref group=web name=\"Sivananda\" /> with and without support of an object of meditation:<ref group=web name=\"50+\" />\n* ''Samprajnata Samadhi'', also called ''[[savikalpa samadhi]]'' and ''Sabija Samadhi'',<ref group=web name=\"Dive Life\">[http://www.sivanandaonline.org/public_html/?cmd=displaysection&section_id=932 Swami Sivananda, ''Samprajnata Samādhi'']</ref>{{refn|group=note|The seeds or samskaras are not destroyed.<ref group=web name=\"Dive Life\" />}} meditation with support of an object.<ref group=web name=\"50+\" />{{refn|group=note|According to Jianxin Li ''Samprajnata Samadhi'' may be compared to the ''rupa jhanas'' of Buddhism.{{sfn|Jianxin Li|year unknown}} This interpretation may conflict with Gombrich and Wynne, according to whom the first and second ''jhana'' represent concentration, whereas the third and fourth ''jhana'' combine concentration with mindfulness.{{sfn|Wynne|2007|p=106; 140, note 58}} According to Eddie Crangle, the first ''jhana'' resembles Patnajali's ''Samprajnata Samadhi'', which both  share the application of ''vitarka'' and ''vicara''.{{sfn|Crangle|1984|p=191}}}}<br/>''Samprajata samadhi'' is associated with deliberation, reflection, bliss, and I-am-ness.{{sfn|Maehle|2007|p=177}}{{refn|group=note|Yoga Sutra 1.17: \"Objective ''samādhi'' (samprajnata) is associated with deliberation, reflection, bliss, and I-am-ness (''asmita'').{{sfn|Maehle|2007|p=156}}}} The first two, deliberation and reflection, form the basis of the various types of ''samapatti'':{{sfn|Maehle|2007|p=177}}{{sfn|Whicher|1998|p=254}}\n** [[Vitarka|Savitarka]], \"deliberative\":{{sfn|Maehle|2007|p=177}}{{refn|group=note|Yoga Sutra 1.42: \"Deliberative (''savitarka'') ''samapatti'' is that ''samādhi'' in which words, objects, and knowledge are commingled through conceptualization.\"{{sfn|Maehle|2007|p=177}}}} The citta is concentrated upon a gross object of meditation,<ref group=web name=\"50+\" /> an object with a manifest appearance that is perceptible to our senses,{{sfn|Maehle|2007|p=179}} such as a flame of a lamp, the tip of the nose, or the image of a deity.{{citation needed|date=November 2014}} Conceptualization (''vikalpa'') still takes place, in the form of perception, the word and the knowledge of the object of meditation.{{sfn|Maehle|2007|p=177}} When the deliberation is ended this is called ''nirvitaka samadhi''.{{sfn|Maehle|2007|p=178}}{{refn|group=note|Yoga Sutra 1.43: \"When memory is purified, the mind appears to be emptied of its own nature and only the object shines forth. This is superdeliberative (''nirvitaka'') ''samapatti''.\"{{sfn|Maehle|2007|p=178}}}}\n** [[Vicara|Savichara]], \"reflective\":{{sfn|Maehle|2007|p=179}} the citta is concentrated upon a subtle object of meditation,<ref group=web name=\"50+\" />{{sfn|Maehle|2007|p=179}} which is not perceptible to the senses, but arrived at through inference,{{sfn|Maehle|2007|p=179}} such as the senses, the process of cognition, the mind, the I-am-ness,{{refn|group=note|Following Yoga Sutra 1.17, meditation on the sense of \"I-am-ness\" is also grouped, in other descriptions, as \"sasmita samapatti\"}} the chakras, the inner-breath (''prana''), the ''nadis'', the intellect (''buddhi'').{{sfn|Maehle|2007|p=179}} The stilling of reflection is called ''nirvichara samapatti''.{{sfn|Maehle|2007|p=179}}{{refn|group=note|Yoga Sutra 1.44: \"In this way, reflective (''savichara'') and super-reflective (''nirvichara'') ''samapatti'', which are based on subtle objects, are also explained.\"{{sfn|Maehle|2007|p=179}}}}\n*** [[Sananda Samadhi]], ''[[Ānanda (Hindu philosophy)|ananda]]'',{{refn|group=note|See also [[Pīti]]}} \"bliss\": this state emphasizes the still subtler state of bliss in meditation;<ref group=web name=\"50+\" />\n*** [[Ahamkara|Sasmita]]: the citta is concentrated upon the sense or feeling of \"I-am-ness\".<ref group=web name=\"50+\" />\n*''Asamprajnata Samadhi'', also called ''[[Nirvikalpa Samadhi]]''<ref group=web name=\"Sivananda\">[http://www.dlshq.org/discourse/feb2005.htm Sri Swami Sivananda, ''Raja Yoga Samādhi'']</ref> and ''Nirbija Samadhi'':<ref group=web name=\"Sivananda\" />{{refn|group=note|Without seeds or [[Saṃskāra|Samskaras]]<ref group=web name=\"Sivananda\" /> According to Swami Sivananda, \"All the seeds or impressions are burnt by the fire of knowledge [...] all the Samskaras and Vasanas which bring on rebirths are totally fried up. All Vrittis or mental modifications that arise form the mind-lake come under restraint. The five afflictions, viz., Avidya (ignorance), Asmita (egoism), Raga-dvesha (love and hatred) and Abhinivesha (clinging to life) are destroyed and the bonds of Karma are annihilated [...] It gives Moksha (deliverance form the wheel of births and deaths). With the advent of the knowledge of the Self, ignorance vanishes. With the disappearance of the root-cause, viz., ignorance, egoism, etc., also disappear.\"<ref group=web name=\"Sivananda\" />}} meditation without an object,<ref group=web name=\"50+\">[http://www.swamij.com/meditationtypes.htm#categories Swami Jnaneshvara Bharati, ''Integrating 50+ Varieties of Yoga Meditation'']</ref> which leads to knowledge of ''[[purusha]]'' or consciousness, the subtlest element.{{sfn|Maehle|2007|p=179}}{{refn|group=note|According to Jianxin Li, ''Asamprajnata Samādhi'' may be compared to the ''arupa jhanas'' of Buddhism, and to ''Nirodha-Samapatti''.{{sfn|Jianxin Li|year unknown}} Crangle also notes that ''sabija-asamprajnata samādhi'' resembles the four formless ''jhanas''.{{sfn|Crangle|1984|p=191}} According to Crangle, the fourth ''arupa jhana'' is the stage of transition to Patanjali's \"consciousness without seed\".{{sfn|Crangle|1984|p=194}}}}\n\n====''Ananda'' and ''asmita''====\nAccording to Ian Whicher, the status of ''sananda'' and ''sasmita'' in Patanjali's system is a matter of dispute.{{sfn|Whicher|1998|p=253}} According to Maehle, the first two constituents, deliberation and reflection, form the basis of the various types of ''samapatti''.{{sfn|Maehle|2007|p=177}} According to Feuerstein, \n{{quote|\"Joy\" and \"I-am-ness\" [...] must be regarded as accompanying phenomena of every coginitive [ecstacy]. The explanations of the classical commentators on this point appear to be foreign to Patanjali's hierarchy of [ecstatic] states, and it seems unlikely that ''ananda'' and ''asmita'' should constitute independent levels of ''samadhi''.{{sfn|Whicher|1998|p=253}}}}\n\nIan Whicher disagrees with Feuerstein, seeing ''ananda'' and ''asmita'' as later stages of ''nirvicara-samapatti''.{{sfn|Whicher|1998|p=253}} Whicher refers to [[Vācaspati Miśra]] (900-980 CE), the founder of the [[Bhāmatī]] [[Advaita Vedanta]] who proposes eight types of ''samapatti'':{{sfn|Whicher|1998|p=253-254}}\n* ''Savitarka-samāpatti'' and ''Nirvitarka-samāpatti'', both with gross objects as objects of support;\n* ''Savicāra-samāpatti'' and ''Nirvicāra-samāpatti'', both with subtle objects as objects of support;\n* ''Sānanda-samāpatti'' and ''Nirānanda-samāpatti'', both with the sense organs as objects of support\n* ''Sāsmitā-samāpatti'' and ''Nirasmitā-samāpatti'', both with the sense of \"I-am-ness\" as support.\n\n[[Vijnana Bikshu]] (ca. 1550-1600) proposes a six-stage model, explicitly rejecting Vacaspati Misra's model. Vijnana Bikshu regards joy (''ananda'') as a state that arises when the mind passes beyond the ''vicara'' stage.{{sfn|Whicher|1998|p=254}} Whicher agrees that ''ananda'' is not a separate stage of ''samadhi''.{{sfn|Whicher|1998|p=254}} According to Whicher, Patanjali's own view seems to be that ''nirvicara-samadhi'' is the highest form of cognitive ecstasy.{{sfn|Whicher|1998|p=254}}\n\n====Samyama====\nAccording to Taimni, dharana, dhyana and samadhi form a graded series:{{sfn|Taimni|1961}}\n# Dharana. In dharana, the mind learns to focus on a single object of thought.  The object of focus is called a pratyaya.  In dharana, the yogi learns to prevent other thoughts from intruding on focusing awareness on the pratyaya.\n# Dhyana. Over time and with practice, the yogin learns to sustain awareness of only the pratyaya, thereby dharana transforms into dhyana.  In dhyana, the yogin comes to realize the triplicity of perceiver (the yogin), perceived (the pratyaya) and the act of perceiving. The new element added to the practice of dhyana, that distinguish it from dharana is the yogi learns to minimize the perceiver element of this triplicity.  In this fashion, dhyana is the gradual minimization of the perceiver, or the fusion of the observer with the observed (the pratyaya).\n# Samadhi. When the yogin can: (1) sustain focus on the pratyaya for an extended period of time, and (2) minimize his or her self-consciousness during the practice, then dhyana transforms into samadhi. In this fashion then, the yogin becomes fused with the pratyaya.  Patanjali compares this to placing a transparent jewel on a colored surface: the jewel takes on the color of the surface. Similarly, in samadhi, the consciousness of the yogin fuses with the object of thought, the pratyaya. The pratyaya is like the colored surface, and the yogin's consciousness is like the transparent jewel.\n\n===Sahaja samadhi===\n[[Ramana Maharshi]] distinguished between ''kevala nirvikalpa samadhi'' and ''[[Sahaja|sahaja nirvikalpa samadhi]]'':{{sfn|Forman|1999|p=6}}<ref group=web name=\"Godman\" /><ref group=web name=\"sahaja\" />\n{{quote|''Sahaja samadhi'' is a state in which a silent level within the subject is maintained along with (simultaneously with) the full use of the human faculties.{{sfn|Forman|1999|p=6}}}}\n\n''Kevala nirvikalpa samadhi'' is temporary, <ref group=web name=\"Godman\">[http://davidgodman.org/rteach/iandii2.shtml David Godman, '''I' and 'I-I' - A Reader's Query'']</ref><ref group=web name=\"sahaja\">[http://www.albigen.com/uarelove/sahaja.htm ''What is Liberation According to the Teachings of Sri Ramana Maharshi? '']</ref>  whereas ''sahaja nirvikalpa samadhi'' is a continuous state throughout daily activity.{{sfn|Forman|1999|p=6}} This state seems inherently more complex than ''sāmadhi'', since it involves several aspects of life, namely external activity, internal quietude, and the relation between them.{{sfn|Forman|1999|p=6}} It also seems to be a more advanced state, since it comes after the mastering of ''samadhi''.{{sfn|Forman|1999|p=6}}{{refn|group=note|Compare the [[Ten Bulls]] from [[Zen]]}}{{refn|group=note|See also [[Mouni Sadhu]] (2005), ''Meditation: An Outline for Practical Study'', p.92-93}}\n\n''Sahaja''  is one of the four keywords of the [[Nath]] [[sampradaya]] along with [[Svecchachara]],  [[Samaveda|Sama]], and [[Samarasa]]. ''Sahaja'' meditation and worship was prevalent in Tantric traditions common to [[Hinduism]] and [[Buddhism]] in Bengal as early as the 8th–9th centuries.\n\n== Sikhism ==\n[[File:Samadhi of Ranjit Singh 123.jpg|thumb|The [[Samadhi of Ranjit Singh]] is located next to the iconic ''[[Badshahi Masjid]]'' in [[Lahore]], [[Pakistan]].]]\nIn [[Sikhism]] the word is used to refer to an action that one uses to remember and fix one's mind and soul on [[Waheguru]].{{citation needed|date=November 2014}} The [[Sri Guru Granth Sahib]] informs:{{citation needed|date=November 2014}}\n* \"Remember in meditation the Almighty Lord, every moment and every instant; meditate on God in the celestial peace of Samādhi.\" (p.&nbsp;508){{clarify|date=August 2013}}\n* \"I am attached to God in celestial Samādhi.\" (p.&nbsp;865){{clarify|date=August 2013}} \n* \"The most worthy Samādhi is to keep the consciousness stable and focused on Him.\" (p.&nbsp;932){{clarify|date=August 2013}}\n\nThe term ''Samadhi'' refers to a state of mind rather than a physical position of the body. The Scriptures explain: \n* \"I am absorbed in celestial Samādhi, lovingly attached to the Lord forever. I live by singing the Glorious Praises of the Lord\" (p.&nbsp;1232){{clarify|date=August 2013}} \n* \"Night and day, they ravish and enjoy the Lord within their hearts; they are intuitively absorbed in Samadhi. ||2||\" (p.&nbsp;1259){{clarify|date=August 2013}}.\n\nThe [[Sikh Gurus]] inform their followers: \n* \"Some remain absorbed in Samādhi, their minds fixed lovingly on the One Lord; they reflect only on the Word of the [[Shabda|Shabad]].\" (p.&nbsp;503){{clarify|date=August 2013}}\n\n== See also ==\n{{Portal|Yoga|India}}\n{{div col|colwidth=10em}}\n'''General'''\n* [[Meditation]]\n* [[Ego death]]\n'''Hinduism'''\n* [[Dhyana in Hinduism]]\n* [[Rāja yoga]]\n* [[Bhakti Yoga]]\n* [[Jnana Yoga]]\n* [[Mantra]]\n* [[Turiya]]\n'''Buddhism'''\n* [[Dhyāna in Buddhism]]\n* [[Mahamudra]]\n* [[Dzogchen]]\n'''Islam'''\n* [[Baqaa]]\n* [[Fanaa (Sufism)|Fanaa]]\n'''Western traditions'''\n* [[Stoicism]]\n{{div col end}}\n\n==Notes==\n{{reflist|group=note|40em}}\n\n== References ==\n{{Reflist|40em}}\n\n==Sources==\n\n===Printed sources===\n{{refbegin|40em}}\n* {{Citation | last =Bronkhorst | first =Johannes | authorlink = Johannes Bronkhorst | year =1993 | title =The Two Traditions Of Meditation In Ancient India | publisher =Motilal Banarsidass Publ.}}\n* {{Citation | last =Bucknell | first =Rod | year =1984 | title =The Buddhist to Liberation: An Analysis of the Listing of Stages | journal =The Journal of the International Association of Buddhist Studies, Volume 7, 1984, Number 2 | url =https://journals.ub.uni-heidelberg.de/index.php/jiabs/article/viewFile/8631/2538}}\n* {{Citation | last1 =Buddhaghosa | last2 =Bhikkhu Nanamoli | year =1999 | title =The Path of Purification: Visuddhimagga | publisher =Buddhist Publication Society | isbn =1-928706-00-2}}\n* {{Citation | last =Crangle | first =Eddie | year =1984 | chapter =A Comparison of Hindu and Buddhist Techniques of Attaining Samādhi | editor-last1 =Hutch | editor-first1 =R.A. | editor-last2 =Fenner | editor-first2 =P.G. | title =Under The Shade of the Coolibah Tree: Australian Studies in Consciousness | publisher =University Press of America | url =http://www.ahandfulofleaves.org/documents/Articles/A%20Comparison%20of%20Hindu%20and%20Buddhist%20Techniques%20of%20Attaining%20Samadhi_Crangle_1984.pdf}}\n* {{Citation | last =Crangle | first =Edward Fitzpatrick | year =1994 | title =The Origin and Development of Early Indian Contemplative Practices | publisher =Harrassowitz Verlag}}\n* {{Citation | last =Cousins | first =L. S. | year =1996 | chapter =The origins of insight meditation | editor-last =Skorupski | editor-first =T. | title =The Buddhist Forum IV, seminar papers 1994–1996 (pp. 35–58) | place =London, UK | publisher = School of Oriental and African Studies | url =http://www.shin-ibs.edu/documents/bForum/v4/03Cousins.pdf}}\n* {{Citation | last1 =Diener | first1 =Michael S. | last2 =Erhard | first2 =Franz-Karl | last3 =Fischer-Schreiber | first3 =Ingrid | year =1991 | title =The Shambhala Dictionary of Buddhism and Zen | publisher =Shambhala | isbn =0-87773-520-4}}\n* {{Citation | last =Farquhar | first =John Nicol | year =1920 | title =An outline of the religious literature of India | publisher =Oxford University Press}}  \n* {{Citation | last =Forman | first =Robert K.C. | year =1999 | title =Mysticism, Mind, Consciousness | publisher =SUNY Press}} \n* {{Citation | last =Gombrich | first =Richard F. | year =1997 | title =How Buddhism Began | publisher =Munshiram Manoharlal}}\n* {{Citation | last1 =Gomez | first1 =Luis O. | last2 =Silk | first2 =Jonathan A. | year =1989 | title =Studies in the Literature of the Great Vehicle: Three Mahayana Buddhist Texts | publisher = Ann Arbor}}\n* {{Citation | last =Hui-Neng | others =A.F.Price and Wong Mou-Lam | date =n.d. | title =On the High Seat of \"The Treasure of the Law\" The Sutra of the 6th Patriarch | url =http://www.katinkahesselink.net/tibet/hui_neng.html }}{{dead link|date=December 2017 |bot=InternetArchiveBot |fix-attempted=yes }}\n* {{Citation | last =Hui-Neng | others =T.Cleary | date=n.d. | title =The Sutra of Hui-Neng | url =http://terebess.hu/zen/HuinengCleary.pdf}}\n* {{Citation | last =Jianxin Li | date =n.d. | title =A Comparative Study between Yoga and Indian Buddhism | publisher =asianscholarship.org | url =http://www.asianscholarship.org/asf/AnnualFellows/July8_9/Li%20Jianxin,%20A%20Comparative%20Study%20between%20Yoga%20and%20Indian%20Buddhism.doc | deadurl =yes | archiveurl =https://web.archive.org/web/20160304135225/http://www.asianscholarship.org/asf/AnnualFellows/July8_9/Li%20Jianxin,%20A%20Comparative%20Study%20between%20Yoga%20and%20Indian%20Buddhism.doc | archivedate =2016-03-04 | df = }}\n* {{Citation | last1 =Jones | first1 =Constance | last2 =Ryan | first2 =James D. | year =2006 | title =Encyclopedia of Hinduism | publisher =Infobase Publishing}}\n* {{Citation | last =Kalupahana | first =David J. | year =1994 | title =A history of Buddhist philosophy | place =Delhi | publisher =Motilal Banarsidass Publishers Private Limited}}\n* {{Citation | last =Maehle | first =Gregor | year =2007 | title =Ashtanga Yoga: Practice and Philosophy | publisher =New World Library}}\n* {{Citation | last =McRae | first =John | author-link = | year =2003 | title =Seeing Through Zen. Encounter, Transformation, and Genealogy in Chinese Chan Buddhism | place = | publisher =The University Press Group Ltd | ISBN =9780520237988}}\n* {{Citation | last =Pradhan | first =Basant | year =2015 | title =Yoga and Mindfulness Based Cognitive Therapy | publisher =Springer}}\n* {{Citation | last =Sarbacker | first =Stuart Ray | year =2012 | title =Samadhi: The Numinous and Cessative in Indo-Tibetan Yoga | publisher =SUNY Press | url =http://www.sunypress.edu/p-4162-samadhi.aspx}}\n* {{Citation | last =Schmithausen | first =Lambert | year =1981 | title =On some Aspects of Descriptions or Theories of 'Liberating Insight' and 'Enlightenment' in Early Buddhism\". In: Studien zum Jainismus und Buddhismus (Gedenkschrift für Ludwig Alsdorf), hrsg. von Klaus Bruhn und Albrecht Wezler, Wiesbaden 1981, 199-250}}\n* {{Citation | last =Shankman | first =Richard  | year =2008 | title =The Experience of Samadhi - an in depth Exploration of Buddhist Meditation | publisher =Shambala publications}}\n* {{Citation | last =Skilton | first =Andrew | title =State or Statement?: Samādhi in Some Early Mahāyāna Sūtras | journal =The Eastern Buddhist |volume=34 |issue=2 |year=2002 | url =http://web.otani.ac.jp/EBS/index_new2.html}}\n* {{Citation | last =Sutcliffe | first =Steven  | year =2004 | title =Religion: Empirical Studies | publisher =Ashgate Publishing, Ltd.}}\n* {{Citation | last =Taimni | first =I.K. | year =1961 | title =The Science of Yoga: The Yoga-Sutras of Patanjali in Sanskrit | publisher =Nesma Books India | isbn =978-81-7059-211-2 | url =http://www.yogastudies.org/wp-content/uploads/Science_of_Yoga-Taimni.pdf}}\n* {{Citation | last =Thurman | first =Robert | year =1984 | title =The Central Philosophy of Tibet | publisher =Princeton University Press}}\n* {{Citation | last =Vetter | first =Tilmann | year =1988 | title =The Ideas and Meditative Practices of Early Buddhism | publisher =BRILL}}\n* {{Citation | last =Werner | first =Karel | year =1994 | title =The Yogi and the Mystic | publisher =Routledge}}\n* {{Citation | last =Whicher | first =Ian | year =1998 | title =The Integrity of the Yoga Darsana: A Reconsideration of Classical Yoga | publisher =SUNY Press}}\n* {{Citation | last =White | first =David Gordon | year =2014 | title =The Yoga Sutra of Patanjali: A Biography | publisher =Princeton University Press}}\n* {{Citation | last =Wijebandara | first =Chandima | year =1993 | title =Early Buddhism, Its Religious and Intellectual Milieu | publisher =Postgraduate Institute of Pali and Buddhist Studies, University of Kelaniya}}\n* {{Citation | last =Williams | first =Paul | year =2000 | title =Buddhist Thought. A complete introduction to the Indian tradition | publisher =Routledge}}\n* {{Citation | last =Williams | first =Paul  | year =2008 | title =Mahāyāna Buddhism: The Doctrinal Foundations | publisher =Routledge}}\n* {{Citation |last=Woods|first=James Haughton, trans.|title=The Yoga System of Patanjali with commentary Yogabhashya attributed to Veda Vyasa and Tattva Vaicharadi by Vacaspati Misra|year=1914|publisher=Cambridge: Harvard University Press|url=https://archive.org/details/yogasystempataj00vcgoog}}{{Page needed|date=March 2015}}\n* {{Citation | last =Wynne | first =Alexander | year =2007 | title =The Origin of Buddhist Meditation | publisher = Routledge | url =http://www.e-reading.link/bookreader.php/134839/Wynne_-_The_Origin_of_Buddhist_Meditation.pdf}}\n{{refend}}\n\n===Web sources===\n{{reflist|group=web}}\n\n==Further reading==\n'''General'''\n* {{Citation | last =Crangle | first =Edward Fitzpatrick | year =1994 | title =The Origin and Development of early Indian Contemplative Practices | publisher =Harrasowitz Verlag}}\n'''Buddhism'''\n* {{Citation | last =Vetter | first =Tilmann | year =1988 | title =The Ideas and Meditative Practices of Early Buddhism | publisher =BRILL}}\n* {{Citation | last =Bronkhorst | first =Johannes | year =1993 | title =The Two Traditions Of Meditation In Ancient India | publisher =Motilal Banarsidass Publ.}}\n* {{Citation | last =Shankman | first =Richard | year =2008 | title =The Experience of Samadhi. An In-depth Exploration of Buddhist Meditation | publisher =Shambhala}}\n'''Hinduism'''\n* {{Citation | last =White | first =David Gordon | year =2014 | title =The Yoga Sutra of Patanjali: A Biography | publisher =Princeton University Press}}\n* {{Citation | last =Maehle | first =Gregor | year =2007 | title =Ashtanga Yoga: Practice and Philosophy | publisher =New World Library}}\n\n== External links ==\n<!--==========================({{NoMoreLinks}})============================\n    | PLEASE BE CAUTIOUS IN ADDING MORE LINKS TO THIS ARTICLE. WIKIPEDIA  |\n    | IS NOT A COLLECTION OF LINKS NOR SHOULD IT BE USED FOR ADVERTISING. |\n    |                                                                     |\n    |           Excessive or inappropriate links WILL BE DELETED.         |\n    | See [[Wikipedia:External links]] & [[Wikipedia:Spam]] for details.  |\n    |                                                                     |\n    | If there are already plentiful links, please propose additions or   |\n    | replacements on this article's discussion page, or submit your link |\n    | to the relevant category at the Open Directory Project (dmoz.org)   |\n    | and link back to that category using the {{dmoz}} template.         |\n    =========================({{NoMoreLinks}})=============================-->\n{{wiktionary}}\n; Advaita Hinduism\n* [http://buddhism.lib.ntu.edu.tw/FULLTEXT/JR-PHIL/comans.htm The question of the importance of Samadhi in modern and classical Advaita Vedanta], Michael Comans (1993)\n\n; Theravada Buddhism\n* [https://www.wisdomlib.org/hinduism/book/a-history-of-indian-philosophy-volume-1/d/doc209748.html {{IAST|Sīla}} and {{IAST|Samādhi}}], Surendranath Dasgupta, 1940\n*[http://www.dhammatalks.net/Books/Ajahn_Chah_Samma_Samadhi.htm Samma Samadhi - by Ajahn Chah]\n*[http://www.dhammatalks.net/Books3/Ajahn_Anan_Akincano_Samadhi_for_Liberation.pdf Samadhi for Liberation - by Ajahn Anand Akincano]\n*[http://www.dhammatalks.net/Books2/Maha_Boowa_Wisdom_Develops_Samadhi.pdf Wisdom Develops Samadhi - by Maha Boowa]\n*[http://www.dhammatalks.net/Books/Ajahn_Lee_Keeping_the_Breath_in_Mind.htm Lessons in Samadhi by Ajahn Lee Dhammadharo]\n\n; Tibetan Buddhism\n*[http://www.dhammatalks.net/Books3/Lama_Gelek_Rinpoche_Developing_Samadhi.htm Developing Samadhi - by Lama Gelek Rinpoche]\n\n{{Yoga}}\n{{Hindudharma}}\n{{Buddhism topics}}\n{{Indian philosophy}}\n{{Meditation}}\n{{Authority control}}\n\n[[Category:Buddhist terminology]]\n[[Category:Buddhist meditation]]\n[[Category:Hindu philosophical concepts]]\n[[Category:Yoga]]\n[[Category:Religious terminology]]\n[[Category:Jain philosophy]]",
            "slug": "samadhi",
            "date_updated": 1531839481500,
            "imported": "https://en.wikipedia.org/wiki/Samadhi"
        }
    ]
}