{
    "article": [
        {
            "title": "Tathāgata",
            "text": "{{Blacklisted-links|1=\n*http://www.nature.ac.cn/sky/nature-sky-times-pdf.pdf\n*:''Triggered by <code>\\bnature\\.ac\\.cn\\b</code> on the local blacklist''\n*http://www.nature.ac.cn/star/nature-star-times-pdf.pdf\n*:''Triggered by <code>\\bnature\\.ac\\.cn\\b</code> on the local blacklist''|bot=Cyberbot II|invisible=true}}\n{{Buddhist term\n|title=Tathāgata\n|en=One who has thus gone\n|sa=Tathāgata\n|vi=Như Lai\n|zh=[[wikt:如来|如来]]\n|zh-Latn=rú laí/ Cantonese=yu loi\n|mn= ᠲᠡᠭᠦᠨᠴᠢᠯᠡᠨ ᠢᠷᠡᠭᠰᠡᠨ \nТүүнчлэн ирсэн\n|my=\n|my-Latn=\n|ja= [[wikt:如来|如来]]\n|ja-Latn=nyorai\n|ko=여래\n|ko-Latn=yeorae\n|th=ตถาคต\n|bo=དེ་བཞིན་གཤེགས་པ་\n|bo-Latn=\n|vn=Như Lai\n|km=តថាគត<br> (tathakut)\n}}\n[[File:Tathagata Tsal 02.jpg|thumb|Tathagata, [[Gautama Buddha|Lord Buddha]] amidst clouds and hills in [[Sikkim]], India, 2016|466x466px]]\n'''Tathāgata''' ({{IPA-sa|t̪əˈt̪ʰɑːɡət̪ə|lang}}) is a [[Pali]] and [[Sanskrit]] word; [[Gautama Buddha|Gotama Buddha]] uses it when referring to himself in the [[Pāli Canon]]. The term is often thought to mean either \"one who has thus gone\" (''tathā-gata'') or \"one who has thus come\" (''tathā-āgata''). This is interpreted as signifying that the Tathāgata is beyond all coming and going – beyond all [[impermanence|transitory phenomena]]. There are, however, other interpretations and the precise original meaning of the word is not certain.<ref name=\"Chalmers\">Chalmers, Robert. [http://ccbs.ntu.edu.tw/FULLTEXT/JR-ENG/bert.htm The Journal of the Royal Asiatic Society, 1898. pp.103-115]</ref>\n\nThe Buddha is quoted on numerous occasions in the Pali Canon as referring to himself as ''the Tathāgata'' instead of using the pronouns ''me'', ''I'' or  ''myself''. This may be meant to emphasize by implication that the teaching is uttered by one who has transcended the human condition, one beyond the otherwise endless cycle of [[Rebirth (Buddhism)|rebirth]] and [[death]], i.e. beyond [[dukkha]].\n\nThe term Tathāgata has a number of possible meanings.<ref name=\"tat\">Tathāgata तथागत. [http://spokensanskrit.de/index.php?tinput=tathAgata&direction=SE&script=HK&link=yes&beginning= tathAgata]. (accessed: January 19, 2016)</ref>\n\n==Etymology and interpretation==\nThe word's original significance is not known and there has been speculation about it since at least the time of [[Buddhaghosa]], who gives eight interpretations of the word, each with different etymological support, in his commentary on the [[Digha Nikaya]], the ''SUMAṄGALAVILĀSINĪ'':<ref name=\"Chalmers\" />\n# He who has arrived in such fashion, i.e. who has worked his way upwards to perfection for the world's good in the same fashion as all previous Buddhas.\n# He who walked in such fashion, i.e. (a) he who at birth took the seven equal steps in the same fashion as all previous Buddhas or (b) he who in the same way as all previous Buddhas went his way to Buddhahood through the four Jhanas and the Paths.\n# He who by the path of knowledge has come at the real essentials of things.\n# He who has won Truth.             \n# He who has discerned Truth.  \n# He who declares Truth. \n# He whose words and deeds accord.\n# The great physician whose medicine is all-potent.\n{{quote|Monks, in the world with its devas, Mara and Brahma, in this generation with its ascetics and brahmins, devas and humans, whatever is seen, heard, sensed and cognized, attained, searched into, pondered over by the mind—all that is fully understood by the Tathagata. That is why he is called the Tathagata.([[Anguttara Nikaya]] 4:23)<ref>[[Anguttara Nikaya]] 4:23, trans. [[Nyanaponika Thera]] and [[Bhikkhu Bodhi]]{{full citation needed|date=August 2017}}</ref>}}\nModern scholarly opinion generally opines that Sanskrit grammar offers at least two possibilities for breaking up the compound word: either ''tathā'' and ''āgata'' (via a [[sandhi]] rule<br>ā + ā → ā), or ''tathā'' and ''gata.''<ref name=\"Bhikkhu\">Bhikkhu Bodhi, ''In the Buddha's Words.'' Wisdom Publications, 2005</ref>{{rp|381–382}} ''Tathā'' means \"thus\" in Sanskrit and Pali, and Buddhist thought takes this to refer to what is called \"reality as-it-is\" (''yathābhūta''). This reality is also referred to as \"thusness\" or \"suchness\" ([[tathatā]]), indicating simply that it (reality) is what it is.\n\nTathāgata is defined as someone who \"knows and sees reality as-it-is\" (''yathā bhūta ñāna dassana''). ''Gata'' \"gone\" is the past passive participle of the verbal root ''gam'' \"go, travel\". ''Āgata'' \"come\" is the past passive participle of the verb meaning \"come, arrive\". In this interpretation, Tathāgata means literally either “the one who has gone to suchness” or \"the one who has arrived at suchness\".\n\nAnother interpretation, proposed by the scholar Richard Gombrich, is based on the fact that, when used as a suffix in compounds, ''-gata'' will often lose its literal meaning and signifies instead \"being\". Tathāgata would thus mean  \"one like that\", with no motion in either direction.<ref>Jayarava, (27 February 2009). [http://jayarava.blogspot.com/2009/02/philological-odds-and-ends.html \"Philological odds and ends I\"], jayarava.blogspot.com, . Retrieved 2012-10-03</ref>\n\nAccording to [[Fyodor Shcherbatskoy]], the term has a non-Buddhist origin, and is best understood when compared to its usage in non-Buddhist works such as the ''[[Mahabharata]]''.<ref>Florin Giripescu Sutton (1991),''Existence and Enlightenment in the Laṅkāvatāra-sūtra: A Study in the Ontology and Epistemology of the Yogācāra School of Mahāyāna Buddhism'', p.104</ref> Shcherbatskoy gives the following example from the ''Mahabharata'' (''Shantiparva'', 181.22): \"Just as the footprints of birds (flying) in the sky and fish (swimming) in water cannot be seen, Thus (''tātha'') is going (''gati'') of those who have realized the Truth.\"\n\n==The nature of a ''Tathāgata''==\n[[Image:Buddha.jpg|thumb|left|260px| Beyond all coming and going: the Tathāgata]]\n{{Buddhism|terse=1}}\nA number of passages affirm that a Tathāgata is \"immeasurable\", \"inscrutable\", \"hard to fathom\", and \"not apprehended\".<ref name=\"Harvey1995\">Peter Harvey, ''The Selfless Mind.'' Curzon Press 1995</ref>{{rp|227}} A tathāgata has abandoned that clinging to the ''[[skandhas]]'' (personality factors) that render ''[[citta]]'' (the mind) a bounded, measurable entity, and is instead \"freed from being reckoned by\" all or any of them, even in life. The aggregates of form, feeling, perception, mental formations, and cognizance that comprise personal identity have been seen to be ''[[dukkha]]'' (a burden), and an enlightened individual is one with \"burden dropped\".<ref name=\"Harvey1995\" />{{rp|229}}The Buddha explains \"that for which a monk has a latent tendency, by that is he reckoned, what he does not have a latent tendency for, by that is he not reckoned.<ref name=\"Harvey1995\" />{{rp|227, SN 3.3.5}} These tendencies are ways in which the mind becomes involved in and clings to [[sankhara|conditioned phenomena]]. Without them, an enlightened person cannot be \"reckoned\" or \"named\"; he or she is beyond the range of other beings, and cannot be \"found\" by them, even by gods, or [[Mara (demon)|Mara]].<ref name=\"Harvey1995\" />{{rp|230}} In one passage, [[Sariputta]] states that the mind of the Buddha cannot be \"encompassed\" even by him.<ref name=\"Bhikkhu\" />{{rp|416–417}}\n\nThe Buddha and Sariputta, in similar passages, when confronted with speculation as to the status of an arahant after death, bring their interlocutors to admit that they cannot even apprehend an arahant that is alive.<ref name=\"Harvey1995\" />{{rp|235}} As Sariputta puts it, his questioner Yamaka \"can't pin down the Tathagata as a truth or reality even in the present life.\"<ref>Yamaka Sutta, [http://www.accesstoinsight.org/tipitaka/sn/sn22/sn22.085.than.html].</ref> These passages imply that condition of the arahant, both before and after [[parinirvana]], lies beyond the domain where the descriptive powers of ordinary language are at home; that is, the world of the skandhas and the greed, hatred, and delusion that are \"blown out\" with nirvana.<ref name=\"Anderson\">Tyson Anderson, [http://ccbs.ntu.edu.tw/FULLTEXT/JR-PHIL/anderson.htm Kalupahana on Nirvana]. ''Philosophy East and West'', April 1990, 40(2)</ref>{{rp|226}}\n\nIn the [[Aggi-Vacchagotta Sutta]], an ascetic named Vaccha questions the Buddha on a variety of metaphysical issues. When Vaccha asks about the status of a tathagata after death, the Buddha asks him in which direction a fire goes when it has gone out. Vaccha replies that the question \"does not fit the case ... For the fire that depended on fuel ... when that fuel has all gone, and it can get no other, being thus without nutriment, it is said to be extinct.\" The Buddha then explains: \"In exactly the same way ..., all form by which one could predicate the existence of the saint, all that form has been abandoned, uprooted, pulled out of the ground like a palmyra-tree, and become non-existent and not liable to spring up again in the future. The saint ... who has been released from what is styled form is deep, immeasurable, unfathomable, like the mighty ocean.\"<ref name=\"Anderson\" />{{rp|225}} The same is then said of the other aggregates. A variety of similar passages make it clear that the metaphor \"gone out, he cannot be defined\" (''atthangato so na pamanam eti'') refers equally to liberation in life.<ref name=\"Wynne\">Alexander Wynne, ''The Origin of Buddhist Meditation.'' Routledge 2007</ref>{{rp|91, 95}} In the Aggi-Vacchagotta Sutta itself, it is clear that the Buddha is the subject of the metaphor, and the Buddha has already \"uprooted\" or \"annihilated\" the five aggregates.<ref name=\"Wynne\" />{{rp|95}} In Sn 1074, it is stated that the sage cannot be \"reckoned\" because he is freed from the category \"name\" or, more generally, concepts. The absence of this precludes the possibility of reckoning or articulating a state of affairs; \"name\" here refers to the concepts or apperceptions that make propositions possible.<ref name=\"Wynne\" />{{rp|94}}\n\n[[Nagarjuna]] expressed this understanding in the nirvana chapter of his [[Mulamadhyamakakarika]]: \"It is not assumed that the Blessed One exists after death. Neither is it assumed that he does not exist, or both, or neither. It is not assumed that even a living Blessed One exists. Neither is it assumed that he does not exist, or both, or neither.\"<ref name=\"Anderson\" />{{rp|230}}\n\nSpeaking within the context of Mahayana Buddhism (specifically the Perfection of Wisdom sutras), [[Edward Conze]] writes that the term 'tathagata' denotes inherent true selfhood within the human being:\n{{quote|Just as ''tathata'' designates true reality in general, so the word which developed into \"Tathagata\" designated the true self, the true reality within man.<ref>Edward Conze, ''The Perfection of Wisdom in 8,000 Lines'', Sri Satguru Publications, Delhi, 1994, p. xix</ref>}}\n\n==See also==\n* [[Nyorai]]\n* [[Nirvana]]\n* [[Enlightenment (religious)]]\n* [[Buddhism and Hinduism]]\n* [[Tathagatagarbha]]\n* [[Tathagatagarbha Sutra]]\n\n==References==\n<references/>\n\n==External links==\n*[http://www.purifymind.com/Vimalakirti10.htm 12. Vision of the Universe Abhirati and the Tathagata Aksobhya] from [[Vimalakirti]] Nirdesa Sutra\n\n \n{{Buddhism topics}}\n\n{{DEFAULTSORT:Tathagata}}\n[[Category:Buddhist philosophical concepts]]\n[[Category:Buddhist terminology]]\n[[Category:Buddha-nature]]",
            "slug": "tath-gata",
            "date_updated": 1531839988200,
            "imported": "https://en.wikipedia.org/wiki/Tathāgata"
        }
    ]
}