{
    "article": [
        {
            "title": "Vipassanā",
            "text": "{{Redirect|Insight meditation|the non-profit organization|Insight Meditation Society}}\n{{ Infobox Buddhist term\n| title = Vipassanā\n| en = insight, clear-seeing\n| pi = Vipassanā\n| sa = विपश्यन<br>(vipaśyanā)\n| bn = \n| my  = ဝိပဿနာ\n| my-Latn = \n| zh = 觀\n| zh-Latn = guān\n| ja = \n| ja-Latn = \n| km = វិបស្សនា<br>(vipassana)\n| km-Latn = \n| ko = \n| ko-Latn = \n| lo =\n| mnw = \n| mnw-Latn = \n| shn = \n| shn-Latn = \n| si = විපස්සනා\n| si-Latn = \n| ta = \n| th = \n| bo = ལྷག་མཐོང་\n| bo-Latn = lhaktong <br>Wyl: lhag mthong\n| vi = \n| id = \n}}\n{{Buddhism}}\n{{Mindfulness|expanded=Buddhism}}\n'''Vipassanā''' ([[Pāli]]) or '''vipaśyanā''' ({{lang-sa|विपश्यन}}) in the [[Buddhism|Buddhist]] tradition means [[Prajñā (Buddhism)|insight into the true nature of reality]].{{sfn|Gunaratana|2011|p=21}} In the Theravada tradition this specifically refers to insight into the [[three marks of existence]]: impermanence, suffering or unsatisfactoriness, and the realisation of non-self.\n\n'''Vipassanā meditation''' in conjunction with [[Samatha]] meditation is a necessary part of all Buddhist traditions. Therefore, it is important to distinguish Vipassanā on the one hand, and the [[Vipassana movement]] on the other, which was represented in the Theravada tradition by [[Ledi Sayadaw]] and [[Mogok Sayadaw]] and popularised by [[Mahasi Sayadaw]], V. R. Dhiravamsa and {{sfn|King|1992|p=132–137}}{{sfn|Nyanaponika|1998|p=107–109}}{{sfn|Koster|2009|p=9–10}} [[S. N. Goenka]].\n\n==Etymology==\n{{See also|Enlightenment in Buddhism|Sotāpanna|Jnana|Wisdom in Buddhism{{!}}Prajna|Bodhi|Vidhya|Kensho}}\n''Vipassanā'' is a [[Pāli|Pali]] word from the Sanskrit prefix \"vi-\" and verbal root paś. It is often translated as ''\"insight\"'' or ''\"clear-seeing\"'', though the \"in-\" prefix may be misleading; \"vi\" in [[Indo-Aryan languages]] is equivalent to the Latin \"dis.\" The \"vi\" in vipassanā may then mean to see into, see through or to see 'in a special way.'{{sfn|Gunaratana|2011|p=21}} Alternatively, the \"vi\" can function as an intensive, and thus vipassanā may mean \"seeing deeply.\"{{Citation needed|date=January 2012}}\n\nA synonym for \"Vipassanā\" is ''paccakkha'' (Pāli; Sanskrit: ''{{IAST|pratyakṣa}}''), \"before the eyes,\" which refers to direct experiential perception. Thus, the type of seeing denoted by \"vipassanā\" is that of direct perception, as opposed to knowledge derived from reasoning or argument.{{Citation needed|date=January 2012}}\n\nIn Tibetan, ''vipaśyanā'' is ''lhagthong'' (wylie: ''lhag mthong''). The term \"''lhag''\" means \"higher\", \"superior\", \"greater\"; the term \"''thong''\" is \"view\" or \"to see\". So together, ''lhagthong'' may be rendered into English as \"superior seeing\", \"great vision\" or \"supreme wisdom.\" This may be interpreted as a \"superior manner of seeing\", and also as \"seeing that which is the essential nature.\" Its nature is a lucidity&mdash;a clarity of mind.<ref name=\"ray74\">Ray (2004) p.74</ref>\n\n[[Henepola Gunaratana]] defined Vipassanā as:\n{{quote|Looking into something with clarity and precision, seeing each component as distinct and separate, and piercing all the way through so as to perceive the most fundamental reality of that thing\"{{sfn|Gunaratana|2011|p=21}}}}\n\n==Insight==\n\n===Origins===\nAccording to [[Richard Gombrich]] a development took place in early Buddhism resulting in a change in doctrine, which considered [[Prajñā (Buddhism)|''prajna'']] to be an alternative means to \"enlightenment\".{{sfn|Gombrich|1997|p=131}} The suttas contain traces of ancient debates between Mahayana and Theravada schools in the interpretation of the teachings and the development of insight. In the sutta pitaka the term \"vipassanā\" is hardly mentioned, while they frequently mention [[Dhyāna in Buddhism|jhana]] as the meditative practice to be undertaken.{{sfn|Thanissaro Bhikkhu|n.d.}}{{citation not found}}{{refn|group=note|Thanissaro Bhikkhu: \"If you look directly at the Pali discourses &mdash; the earliest extant sources for our knowledge of the Buddha's teachings &mdash; you'll find that although they do use the word samatha to mean tranquillity, and vipassanā to mean clear-seeing, they otherwise confirm none of the received wisdom about these terms. Only rarely do they make use of the word vipassanā &mdash; a sharp contrast to their frequent use of the word [[Dhyāna in Buddhism|jhana]]. When they depict the Buddha telling his disciples to go meditate, they never quote him as saying \"go do vipassanā,\" but always \"go do jhana.\" And they never equate the word vipassanā with any mindfulness techniques.\"{{sfn|Thanissaro Bhikkhu|n.d.}}{{citation not found}}}}\n\nAccording to Vetter and Bronkhorst, ''[[Dhyāna in Buddhism|dhyāna]]'' itself constituted the original \"liberating practice\".{{sfn|Vetter|1988|p=xxi-xxii}}{{sfn|Bronkhorst|1993}}{{sfn|Cousins|1996|p=58}}{{citation not found}} Vetter further argues that the eightfold path constitutes a body of practices which prepare one, and lead up to, the practice of ''dhyana''.{{sfn|Vetter|1988|p=xxx}} Norman notes that \"the Buddha's way to release [...] was by means of meditative practices.\"{{sfn|Norman|1997|p=29}} Out of these debates developed the idea that bare insight suffices to reach [[Enlightenment in Buddhism|liberation]], by discerning the [[Three marks of existence|Three marks (qualities) of (human) existence (tilakkhana)]], namely [[dukkha]] (suffering), [[anatta]] (non-self) and [[anicca]] (impermanence).{{sfn|Gombrich|1997|p=96-144}}\n\n===Sudden insight===\nThe [[Sthaviravāda]], one of the [[early Buddhist schools]] from which the Theravada-tradition originates, emphasized sudden insight:\n{{quote|In the Sthaviravada [...] progress in understanding comes all at once, 'insight' (''abhisamaya'') does not come 'gradually' (successively - ''anapurva'').{{sfn|Warder|2000|p=284}}}}\n\nThe [[Mahasanghika]], another one of the early Buddhist schools, had the doctrine of ''ekaksana-citt'', \"according to which a Buddha knows everything in a single thought-instant\".{{sfn|Gomez|1991|p=69}}{{citation not found}} This process however, meant to apply only to the Buddha and Peccaka buddhas. Lay people may have to experience various levels of insights to become fully enlightened.\n\nThe [[Mahayana]] tradition emphasizes [[Wisdom in Buddhism|prajna]], insight into [[sunyata]], [[dharmata]], the [[two truths doctrine]], clarity and emptiness, or bliss and emptiness:<ref>{{cite web|author=Defined by Reginald A. Ray |url=http://archive.thebuddhadharma.com/issues/2004/summer/dharma_dictionary.htm |title=\"Vipashyana,\" by Reginald A. Ray. '&#39;Buddhadharma: The Practitioner's Quarterly'&#39;, Summer 2004 |publisher=Archive.thebuddhadharma.com |date= |accessdate=2013-05-30}}</ref>\n{{quote|[T]he very title of a large corpus of early Mahayana literature, the ''[[Prajnaparamita]]'', shows that to some extent the historian may extrapolate the trend to extol insight, ''prajna'', at the expense of dispassion, ''viraga'', the control of the emotions.{{sfn|Gombrich|1997|p=133}}}}\n\nAlthough Theravada and Mahayana are commonly understood as different streams of Buddhism, their practice however, may reflect emphasis on insight as a common denominator:\n{{quote|In practice and understanding Zen is actually very close to the Theravada Forest Tradition even though its language and teachings are heavily influenced by Taoism and Confucianism.<ref>{{cite web|url=http://bhikkhucintita.wordpress.com/category/buddhism/page/3/ |title=Through the Looking Glass, '&#39;Essential Buddhism'&#39; |publisher=Bhikkhucintita.wordpress.com |date= |accessdate=2013-05-30}}</ref>{{refn|group=note|Khantipalo recommends the use of the koan-like question [[Hua Tou|\"Who?\"]] to penetrate \"this not-self-nature of the five aggregates\": \"In Zen Buddhism this technique has been formulated in several [[koan]]s, such as 'Who drags this corpse around?'\"{{sfn|Khantipalo|1984|p=71}}}}}}\n\nThe emphasis on insight is discernible in the emphasis in [[Chinese Chán#Sudden and gradual enlightenment|Chán]] on [[subitism|sudden insight]],{{sfn|Warder|2000|p=284}} though in the Chán-tradition this insight is to be followed by gradual cultivation.{{refn|group=note|This \"gradual training\" is expressed in teachings as [[Five Ranks|the Five ranks of enlightenment]], [[Ten Bulls|Ten Ox-Herding Pictures]] which detail the steps on the Path, [[Linji Yixuan#Expressing the inexpressible|The Three mysterious Gates]] of Linji, and the [[Hakuin#Four ways of knowing|Four Ways of Knowing]] of [[Hakuin]].}}\n\n===Relation with samatha===\n{{See also|Samatha|Samadhi (Buddhism)|Dhyāna in Buddhism|Mahamudra|Raja yoga}}\n\nIn all Buddhist schools two types of meditation practices are followed: [[samatha]] (Pāli: Samatha, Sanskrit: ''śamatha''; English: \"calm abiding\") and vipassanā (Pali: vipassanā, Sanskrit: vipaśyanā, English: \"clear seeing\").<ref>{{cite web|title=What is Theravada Buddhism?|url=http://www.accesstoinsight.org/theravada.html|work=Access to Insight|publisher=Access to Insight|accessdate=17 August 2013}}</ref> Samatha is a primary meditation aimed at calming the mind, and is also well-known and widely used in non-buddhist traditions. It is, however, vipassanā, the systematic investigation of self and phenomena that is unique to the Buddhist tradition.\n\nTo gain true insight Samatha and Vipassanā needs to be conjoined. There are two different traditions concerning the sequence of the two. \nThe Samatha first approach is the most common, and involves cultivating a stable samatha before practicing vipassanā. Different traditions describe different levels of Samatha as being sufficient. In some access to first dhyana is said to be enough. In others full attainment of dhyana is enough. Yet in others only full attainment of the four form and formless absorption dhyana states are said to be sufficient. The approach of first cultivating Samatha is recommended by most of the great scholar-practitioners of ancient India.\n\nIn the Mahayana this approach is reflected in the sutra approach of for example Shantideva and Kamalashila. Through Shamatha disturbing emotions are abandoned and thus facilitates clear seeing Vipashyana. In the Mahayana sutra approach Vipashyana is cultivated through reasoning, logic and analysis in conjunction with Shamatha. \nIn contrast, in the Vipashyana directly approach represented by for example the siddha tradition of the direct approach of Mahamudra and Dzogchen, the view of Vipashyana is ascertained directly through looking into one's own mind. After this initial recognition of Vipashyana the steadiness of Shamatha is developed within that recognition. It is however also common in the direct approach to first develop enough Shamatha to serve as a basis for Vipashyana. In that case the view of Vipashyana is ascertained through meditation. In sum, the traditions differ in the sequence but all comes down to the union of Samatha and Vipassanā. It is therefore faulty to claim that only Samatha or only Vipassanā is sufficient.<ref>Thrangu Rinpoche, Essentials of Mahamudra</ref>\n\nIn the Theravada tradition, samatha is regarded as a preparation for vipassanā, pacifying the mind and strengthening concentration in order for insight to arise, which leads to [[Enlightenment in Buddhism|liberation]]. In contrast, the modern Vipassana Movement gives more emphasis to Vipassanā already from the start, highlighting the risks of going out of course when strong samatha is developed.{{sfn|Bond|1992|p=167}} For this the Vipassana Movement has been criticised, especially in Sri Lanka.{{sfn|Bond|1992|p=162-171}}<ref>[http://blogs.mcgill.ca/tcpsych/tag/geoffrey-samuel/ Robert H. Sharf, Division of Social and Transcultural Psychiatry, Department of Psychiatry, Faculty of Medicine, McGill University]</ref>\n\nThough both terms appear in the [[Sutta Pitaka]]{{refn|group=note|See, for example:<br>\n<br>\n'''AN 4.170 (Pali)''':<br>\n“Yo hi koci, āvuso, bhikkhu vā bhikkhunī vā mama santike arahattappattiṁ byākaroti, sabbo so catūhi maggehi, etesaṁ vā aññatarena.<br>\nKatamehi catūhi? Idha, āvuso, bhikkhu samathapubbaṅgamaṁ vipassanaṁ bhāveti[...]<br>\nPuna caparaṁ, āvuso, bhikkhu vipassanāpubbaṅgamaṁ samathaṁ bhāveti[...]<br>\nPuna caparaṁ, āvuso, bhikkhu samathavipassanaṁ yuganaddhaṁ bhāveti[...]<br>\nPuna caparaṁ, āvuso, bhikkhuno dhammuddhaccaviggahitaṁ mānasaṁ hoti[...]<br>\nEnglish translation:<br>\nFriends, whoever — monk or nun — declares the attainment of arahantship in my presence, they all do it by means of one or another of four paths. Which four?<br>\nThere is the case where a monk has developed insight preceded by tranquility. [...]<br>\nThen there is the case where a monk has developed tranquillity preceded by insight. [...]<br>\nThen there is the case where a monk has developed tranquillity in tandem with insight. [...]<br>\n\"Then there is the case where a monk's mind has its restlessness concerning the Dhamma [Comm: the corruptions of insight] well under control.<ref>{{cite web|url=http://www.accesstoinsight.org/tipitaka/an/an04/an04.170.than.html |title=AN 4.170 Yuganaddha Sutta: '&#39;In Tandem'&#39;. Translated from the Pali by Thanissaro Bhikkhu |publisher=Accesstoinsight.org |date=2010-07-03 |accessdate=2013-05-30}}</ref><br>\n<br>\n'''AN 2.30 Vijja-bhagiya Sutta, ''A Share in Clear Knowing''''':<br>\n\"These two qualities have a share in clear knowing. Which two? Tranquility (samatha) & insight (vipassana).<br>\n\"When tranquility is developed, what purpose does it serve? The mind is developed. And when the mind is developed, what purpose does it serve? Passion is abandoned.<br> \"When insight is developed, what purpose does it serve? Discernment is developed. And when discernment is developed, what purpose does it serve? Ignorance is abandoned.<br>\n\"Defiled by passion, the mind is not released. Defiled by ignorance, discernment does not develop. Thus from the fading of passion is there awareness-release. From the fading of ignorance is there discernment-release.\"<ref>{{cite web|url=http://www.accesstoinsight.org/tipitaka/an/an02/an02.030.than.html |title=AN 2.30 Vijja-bhagiya Sutta, '&#39;A Share in Clear Knowing'&#39;. Translated from the Pali by Thanissaro Bhikkhu |publisher=Accesstoinsight.org |date=2010-08-08 |accessdate=2013-05-30}}</ref><br>\n<br>\n'''SN 43.2 (Pali)''': \"Katamo ca, bhikkhave, asaṅkhatagāmimaggo? Samatho ca vipassanā\".<ref>{{cite web|url=http://www.agama.buddhason.org/SN/SN1171.htm |title=SN 43.2 |publisher=Agama.buddhason.org |date= |accessdate=2013-05-30}}</ref> English translation: \"And what, bhikkhus, is the path leading to the unconditioned? Serenity and insight.\"<ref>Bikkhu Bodhi, ''The Connected Discourses of the Buddha'', p. 1373</ref>}}, Gombrich and Brooks argue that the distinction as two ''separate'' paths originates in the earliest ''interpretations'' of the Sutta Pitaka,{{sfn|Gombrich|1997|p=96-144}} not in the suttas themselves.{{sfn|Brooks|2006}}{{refn|group=note|Brooks: \"While many commentaries and translations of the Buddha's Discourses claim the Buddha taught two practice paths, one called \"shamata\" and the other called \"vipassanā,\" there is in fact no place in the suttas where one can definitively claim that.\"{{sfn|Brooks|2006}}}} According to Gombrich, the distinction between vipassanā and samatha did not originate in the suttas, but in the ''interpretation'' of the suttas.{{sfn|Gombrich|1997|p=96-144}}{{refn|group=note|Henepola Gunaratana: \"The classical source for the distinction between the two vehicles of serenity and insight is the Visuddhimagga.\"<ref name=supramundane>{{cite web|url=http://www.accesstoinsight.org/lib/authors/gunaratana/wheel351.html#ch5 |title=Henepola Gunaratana, '&#39;The Jhanas in Theravada Buddhist Meditation'&#39; |publisher=Accesstoinsight.org |date=2011-06-16 |accessdate=2013-05-30}}</ref>}} Various traditions disagree which techniques belong to which pole.{{sfn|Schumann|1974}}\n\n==Vipassanā meditation==\n{{See also|Buddhist Paths to liberation}}\n\nVipassanā can be cultivated by the practice that includes contemplation and introspection through primarily awareness and observation of bodily sensations. The practices may differ in the modern Buddhist traditions and non-sectarian groups according to the founder but the main objective is to develop insight.  [http://www.shambhalasun.com/index.php?option=content&task=view&id=1465]\n\n===Theravāda===\n\n====Insight in the Four Noble Truths====\nAccording to the Theravada-tradition, Buddhist practices lead to insight in the [[Four Noble Truths]], which can only be reached by practising the [[Noble Eightfold Path]]. According to Theravāda tradition, enlightenment or [[Nibbana]] can only be attained by discerning all Vipassanā insight levels when the Eightfold Noble Path is followed ardently. This is a developmental process where various Vipassanā insights are discerned; the final enlightenment may come suddenly, as proposed by other schools.\n\n====Vipassanā movement====\n{{See also|Vipassana movement|Buddhist modernism}}\n\nThe term ''vipassana'' is often conflated with the [[Vipassana movement]], a movement which started in the 1950s in Burma but has gained wide renown mainly through American Buddhist teachers such as [[Joseph Goldstein (writer)|Joseph Goldstein]], [[Tara Brach]], [[Gil Fronsdal]], [[Sharon Salzberg]], and [[Jack Kornfield]]. The movement has had a wide appeal due to being open and inclusive to different Buddhist and non-buddhist wisdom, poetry as well as science. It has together with the modern American Zen tradition served as one of the main inspirations for the 'mindfulness movement' as developed by [[Jon Kabat-Zinn]] and others.\n\nThe Vipassanā Movement, also known as the Insight Meditation Movement, is rooted in [[Theravada|Theravāda]] Buddhism, especially from the [[Thai Forest Tradition]] and the [[U Nārada|\"New Burmese Method\"]], as well as the modern influences{{sfn|McMahan|2008}} on the traditions of [[Sri Lanka]], [[Burma]], [[Laos]] and [[Thailand]] originating from various Theravāda teachers like Ledi Sayadaw, Mogok Sayadaw (who was less known to the West due to lack of International Mogok Centres), [[Mahasi Sayadaw]], [[Ajahn Chah]], and [[Dipa Ma]], as well as derivatives from those traditions such as the movement led by [[S. N. Goenka]].\n\nIn the Vipassanā Movement, the emphasis is on the [[Satipatthana Sutta]] and the use of [[Sati (Buddhism)|mindfulness]] to gain insight into the impermanence of the self.\n\n====Vipassana-meditation in the modern Vipassana movement====\n{{See also|Four stages of enlightenment}}\nVipassanā-meditation uses [[Anapanasati|mindfulness of breathing]], combined with the contemplation of [[Anicca|impermanence]], to gain [[Sampajañña|insight]] into the true nature of this reality. All phenomena are investigated, and concluded to be [[Dukkha|painful and unsubstantial]], [[Anatta|without an immortal entity or self-view]], and in its [[Anicca|ever-changing and impermanent nature]].{{sfn|Nyanaponika|1998}}{{sfn|Gombrich|1997|p=133}}\n\n[[Anapanasati|Mindfulness of breathing]] is described throughout the Sutta Pitaka. The [[Satipatthana Sutta]] describes it as going into the forest and sitting beneath a tree and then to simply watch the breath. If the breath is long, to notice that the breath is long, if the breath is short, to notice that the breath is short.<ref>Majjhima Nikaya, Sutta No. 118, Section No. 2, translated from the Pali</ref><ref>[[Satipatthana Sutta]]</ref>\n\nBy observing the breath one becomes aware of the perpetual changes involved in breathing, and the arising and passing away of mindfulness. One can also be aware of and gain insight into impermanence through the observation of bodily sensations and their nature of arising and passing away.<ref>{{cite web|url=http://www.dhamma.org/en/art.shtml |title=The Art of Living: Vipassana Meditation |publisher=Dhamma.org |date= |accessdate=2013-05-30}}</ref> Eventually Vipassanā-meditation leads to insight into the impermanence of all phenomena, the absence of a permanent self, and the cause of suffering, thereby leading to liberation from suffering.{{sfn|Gombrich|1997|p=133}}\n\n====Stages of Jhana in the Vipassana movement====\n\n\nVipassanā jhanas are stages that describe the development of samatha in ''vipassanā'' meditation practice as described in modern Burmese Vipassana meditation.<ref>Ingram, Daniel (2008), ''Mastering the core teachings of the Buddha'', Karnac Books, p.246</ref> \n[[Mahasi Sayadaw]]'s student [[Sayadaw U Pandita]] described the four ''vipassanā jhanas'' as follows:<ref>Sayadaw U Pandita, ''In this very life''</ref>\n# The meditator first explores the body/mind connection as one, nonduality; discovering three characteristics. The first jhana consists in seeing these points and in the presence of ''[[vitakka]]'' and ''[[vicara]]''. Phenomena reveal themselves as appearing and ceasing.\n# In the second ''jhana'', the practice seems effortless. ''Vitaka'' and ''vicara'' both disappear.\n# In the third ''jhana'', ''[[Pīti|piti]]'', the joy, disappears too: there is only happiness (''[[sukha]]'') and concentration.\n# The fourth ''jhana'' arises, characterised by purity of mindfulness due to equanimity. The practice leads to direct knowledge. The comfort disappears because the dissolution of all phenomena is clearly visible. The practice will show every phenomenon as unstable, transient, disenchanting. The desire of freedom will take place.\n\n===Northern tradition and Mahāyāna===\nLike the southern Theravada tradition, the north Indian Buddhist traditions like the [[Sarvastivada]] and the [[Sautrantika]] practiced ''vipaśyanā'' meditation as outlined in texts like the [[Abhidharmakosha]] of [[Vasubandhu]] and the [[Yogacarabhumi]]. The Abhidharmakosha states that ''vipaśyanā'' is practiced once one has reached [[samadhi]] (absorption) by cultivating the [[four foundations of mindfulness]] (''smrtyupasthanas'').<ref name=\"Vallee Poussin page 925\">De La Vallee Poussin (trans.); Pruden, Leo M. (trans.) ''Abhidharmakosabhasyam of Vasubandhu'' Vol. III page 925</ref> This is achieved according to [[Vasubandhu]]:\n\n:\"By considering the unique characteristics (''svalaksana'') and the general characteristics (''samanyalaksana'') of the body, sensation, the mind, and the dharmas.\"\n:\"'The unique characteristics' means its self nature (''svabhava'').\"\n:\"The general characteristics\" signifies the fact that \"All conditioned things are impermanent; all impure dharmas are suffering; and that all the dharmas are empty (''sunya'') and not-self (''anatmaka'').\"<ref name=\"Vallee Poussin page 925\"/>\n\nThese works are some of the main texts used to study ''vipaśyanā'' in the [[Mahāyāna]] tradition. [[Mahāyāna]] ''vipaśyanā'' differs from the Theravada tradition in its strong emphasis on the meditation on emptiness ([[shunyata]]) of all phenomena. The Mahayana ''Akṣayamati-nirdeśa'' refers to vipaśyanā as seeing phenomena as they really are, that is, empty, without self, nonarisen, and without grasping. The [[Prajnaparamita]] sutra in 8,000 lines states that the practice of insight is the non-appropriation of any dharmas, including the [[five aggregates]]:\n\n:So too, a Bodhisattva coursing in perfect wisdom and developing as such, neither does nor even can stand in form, feeling, perception, impulse and consciousness...This concentrated insight of a Bodhisattva is called 'the non-appropriation of all dharmas'.<ref>Babcock (Copper), Richard (trans.) '''The Prajna Paramita Sutra on the Buddha-Mother's Producing the Three Dharma Treasures, Spoken by the Buddha''' (Also known as:) The Perfection of Wisdom in 8000 Lines, '''The Smaller Prajna Paramita Sutra (Tripitaka: 0227)'''(Taisho Tripitaka: 0228) , '''Translated into Chinese during Song Dynasty by Tripitaka Master Danapala, chapter 1. http://www.fodian.net/world/0228_01.html</ref>\n\nLikewise the Prajnaparamita in 25,000 lines states that a Bodhisattva should know the nature of the five aggregates as well as all dharmas thus:\n\n<blockquote>That form, etc. [feeling, perception, impulse and consciousness], which is like a dream, like an echo, a mock show, a mirage, a reflection of the moon in water, an apparition, that is neither bound nor freed. Even so form, etc., which is past, future, or present, is neither bound nor freed. And why? Because of the nonbeing-ness of form, etc. Even so form, etc., whether it be wholesome or unwholesome, defiled or undefiled, tainted or untainted, with or without outflows, worldly or supramundane, defiled or purified, is neither bound nor freed, on account of its non-beingness, its isolatedness, its quiet calm, its emptiness, signless-ness, wishless-ness, because it has not been brought together or produced. And that is true of all dharmas.<ref>Conze, Edward. The Large Sutra on Perfect Wisdom: With the Divisions of the Abhisamayalankara (Center for South and Southeast Asia Studies, UC Berkeley) page 141</ref></blockquote>\n\nAsanga's [[Abhidharma-samuccaya]] states that the practice of ''śamatha''-''vipaśyanā'' is a part of a Bodhisattva's path at the beginning, in the first \"path of preparation\" (''Sambharamarga'').<ref>Rahula; Boin-Webb. Abhidharmasamuccaya The Compendium of the Higher Teaching by Asanga, 1971 page xxiii</ref>\n\nThe later Indian Mahayana scholastic tradition, as exemplified by [[Shantideva]]'s [[Bodhicaryavatara]], saw ''śamatha'' as a necessary prerequisite to ''vipaśyanā'' and thus one needed to first begin with calm abiding meditation and then proceed to insight. In the Panjika commentary of Prajnakaramati on the [[Bodhicaryavatara]], ''vipaśyanā'' is defined simply as \"wisdom (''[[prajña]]'') that has the nature of thorough knowledge of reality as it is.\"<ref>Wallace, B. Alan; Wallace, Vesa A. A guide to the bodhisattva way of life (Bodhicaryavatara) by Santideva, Snow Lion Publications Ithaca, New York US, page 90, http://www.drepunggomangusa.org/wp-content/uploads/2014/11/shantideva-bodhicaryavatara-wallace.pdf</ref>\n\n====East Asian Mahāyāna====\nIn [[Chinese Buddhism]], the works of Tiantai master [[Zhiyi]] (such as the [[Mohe Zhiguan]], \"Great [[śamatha]]-vipaśyanā\") are some of the most influential texts which discuss ''vipaśyanā'' meditation from a [[Mahāyāna]] perspective. In this text [[Zhiyi]] teaches the contemplation of the [[skandhas]], [[ayatanas]], [[Skandha#Eighteen Dh.C4.81tus|dhātus]], the [[Kleshas (Buddhism)|Kleshas]], false views and several other elements.<ref>Fa Qing,[https://web.archive.org/web/20150524090134/http://elibrary.ibc.ac.th/files/public/2013seminabook.pdf The Śamatha and Vipaśyanā in Tian Tai], Poh Ming Tse Symposium 2013: One Master Three Meditative Traditions. Singapore, August 30, 2013; pp.30-47</ref> Likewise the influential text called the [[Awakening of Faith]] scripture has a section on calm and insight meditation.<ref>Harvey, Peter. An Introduction to Buddhism: Teachings, History and Practices, page 257.</ref> It states:\n\n<blockquote>He who practices 'clear observation' should observe that all conditioned phenomena in the world are unstationary and are subject to instantaneous transformation and destruction; that all activities of the mind arise and are extinguished from moment or moment; and that, therefore, all of these induce suffering. He should observe that all that had been conceived in the past was as hazy as a dream, that all that is being conceived in the future will be like clouds that rise up suddenly. He should also observe that the physical existences of all living beings in the world are impure and that among these various filthy things there is not a single one that can be sought after with joy.<ref>Hakedas, Yoshito, S. The Awakening of Faith in Mahayana, Attributed to Asvaghosha, 1967, page 33, http://www.acharia.org/downloads/the_awakening_of_faith_in_mahayana_english.pdf</ref></blockquote>\n\nThe Chan ([[Zen]]) Buddhist tradition advocates the simultaneous practice of ''śamatha'' and ''vipaśyanā'', and this is called the practice of [[Shikantaza#Silent illumination|Silent Illumination]].<ref name=\"Guo Gu\">Guo Gu, Silent Illumination [https://www.bcbsdharma.org/author/guogu/ Guo Gu], Insight Journal 2014.</ref> The classic Chan text known as the [[Platform Sutra]] states:\n\n<blockquote>Calming is the essence of wisdom. And wisdom is the natural function of calming [i.e., prajñā and samādhi]. At the time of prajñā, samādhi exists in that. At the time of samādhi, prajñā exists in that. How is it that samādhi and prajñā are equivalent? It is like the light of the lamp. When the lamp exists, there is light. When there is no lamp, there is darkness. The lamp is the essence of light. The light is the natural function of the lamp. Although their names are different, in essence, they are fundamentally identical. The teaching of samādhi and prajñā is just like this.<ref name=\"Guo Gu\"/></blockquote>\n\n====Tibetan Buddhism====\n{{Main|Vajrayana|Tibetan Buddhism}}\nIn [[Tibetan Buddhism]], the classical practice of ''śamatha'' and ''vipaśyanā'' is strongly influenced by the Mahāyāna text called the [[Bhavanakrama]] of Indian master [[Kamalaśīla]]. Kamalaśīla defines ''vipaśyanā'' as \"the discernment of reality\" (''bhūta-pratyavekṣā'') and \"accurately realizing the true nature of dharmas\".<ref>Adam, Martin T. Two Concepts of Meditation and Three Kinds of Wisdom in Kamalaśīla’s Bhāvanākramas: A Problem of Translation. University of Victoria, page 78-79</ref>\n\nIndian Mahāyāna Buddhism employed both [[deductive reasoning|deductive investigation]] (applying ideas ''to'' experience) and [[inductive reasoning|inductive investigation]] (drawing conclusions ''from'' direct experience) in the practice of vipaśyanā.{{refn|group=note|Corresponding respectively to the \"contemplative forms\" and \"experiential forms\" in the Theravāda school described above}}{{refn|group=note|Leah Zahler: \"The practice tradition suggested by the Treasury <nowiki>[</nowiki>''[[Abhidharma-kośa]]''<nowiki>]</nowiki> .. . &mdash; and also by Asaṅga's Grounds of Hearers &mdash; is one in which mindfulness of breathing becomes a basis for inductive reasoning on such topics as the five aggregates; as a result of such inductive reasoning, the meditator progresses through the Hearer paths of preparation, seeing, and meditation. It seems at least possible that both Vasubandhu and Asaṅga presented their respective versions of such a method, analogous to but different from modern Theravāda insight meditation, and that Gelukpa scholars were unable to reconstruct it in the absence of a practice tradition because of the great difference between this type of inductive meditative reasoning based on observation and the types of meditative reasoning using consequences (''thal 'gyur, prasaanga'') or syllogisms (''sbyor ba, prayoga'') with which Gelukpas were familiar. Thus, although Gelukpa scholars give detailed interpretations of the systems of breath meditation set forth in Vasubandu's and Asaṅga's texts, they may not fully account for the higher stages of breath meditation set forth in those texts [...] it appears that neither the Gelukpa textbook writers nor modern scholars such as Lati Rinpoche and Gendun Lodro were in a position to conclude that the first moment of the fifth stage of Vasubandhu's system of breath meditation coincides with the attainment of special insight and that, therefore, the first four stages must be a method for cultivating special insight [although this is clearly the case].<ref>Zahler 108, 113</ref>}} According to Leah Zahler, only the tradition of deductive analysis in vipaśyanā was transmitted to Tibet in the sūtrayāna context.{{refn|group=note|This tradition is outlined by Kamalaśīla in his three ''[[Bhāvanākrama]]'' texts (particularly the second one), following in turn an approach described in the ''[[Lankavatara Sutra|Laṅkāvatāra Sūtra]]''.<ref name=\"Kamalasila 2008, p 3\">\"Some Notes on Kamalasila's Understanding of Insight Considered as the Discernment of Reality (bhūta-pratyavekṣā)\", by Martin Adam, ''Buddhist Studies Review'', Vol. 25, No.2, 2008, p 3</ref> One scholar describes his approach thus: \"the overall picture painted by Kamalaśīla is that of a kind of serial alternation between observation and analysis that takes place entirely within the sphere of meditative concentration\" in which the analysis portion consists of [[Madhyamaka]] reasonings.<ref name=\"Kamalasila 2008, p 3\"/>}}\n\nIn Tibet direct examination of moment-to-moment experience as a means of generating insight became exclusively associated with vajrayāna.<ref name=\"TR\" />{{refn|group=note|According to contemporary Tibetan scholar Thrangu Rinpoche the Vajrayana cultivates direct experience. Thrangu Rinpoche: \"The approach in the sutras [...] is to develop a conceptual understanding of emptiness and gradually refine that understanding through meditation, which eventually produces a direct experience of emptiness [...] we are proceeding from a conceptual understanding produced by analysis and logical inference into a direct experience [...] this takes a great deal of time [...] we are essentially taking inferential reasoning as our method or as the path. There is an alternative [...] which the Buddha taught in the tantras [...] the primary difference between the sutra approach and the approach of Vajrayana (secret mantra or tantra) is that in the sutra approach, we take inferential reasoning as our path and in the Vajrayana approach, we take direct experience as our path. In the Vajrayana we are cultivating simple, direct experience or \"looking.\" We do this primarily by simply looking directly at our own mind.\"<ref name=\"TR\">''Pointing out the Dharmakaya'' by Thrangu Rinpoche. Snow Lion: 2003. {{ISBN|1-55939-203-7}}, pg 56</ref>}}{{refn|group=note|Khenchen Thrangu Rinpoche also explains: \"In general there are two kinds of meditation: the meditation of the ''paṇḍita'' who is a scholar and the nonanalytical meditation or direct meditation of the ''kusulu'', or simple yogi. . . the analytical meditation of the paṇḍita occurs when somebody examines and analyzes something thoroughly until a very clear understanding of it is developed. . . The direct, nonanalytical meditation is called ''kusulu'' meditation in Sanskrit. This was translated as ''trömeh'' in Tibetan, which means \"without complication\" or being very simple without the analysis and learning of a great scholar. Instead, the mind is relaxed and without applying analysis so it just rests in its nature. In the sūtra tradition, there are some nonanalytic meditations, but mostly this tradition uses analytic meditation.\"<ref>''The Practice of Tranquillity & Insight: A Guide to Tibetan Buddhist Meditation'' by Khenchen Thrangu Rinpoche. Shambhala Publications: 1994. {{ISBN|0-87773-943-9}} pg 91-93</ref>}}\n\n====Mahāmudrā and Dzogchen====\n[[Mahamudra|Mahāmudrā]] and [[Dzogchen]] use vipaśyanā extensively. This includes some methods of the other traditions, but also their own specific approaches. They place a greater emphasis on meditation on symbolic images. Additionally in the Vajrayāna ([[Tantra|tantric]]) path, the true nature of mind is [[pointing-out instruction|pointed out by the guru]], and this serves as a direct form of insight.{{refn|group=note|[[Thrangu Rinpoche]] describes the approach using a guru: \"In the Sūtra path one proceeds by examining and analyzing phenomena, using reasoning. One recognizes that all phenomena lack any true existence and that all appearances are merely interdependently related and are without any inherent nature. They are empty yet apparent, apparent yet empty. The path of Mahāmudrā is different in that one proceeds using the instructions concerning the nature of mind that are given by one's guru. This is called taking direct perception or direct experiences as the path. The fruition of śamatha is purity of mind, a mind undisturbed by false conception or emotional afflictions. The fruition of vipaśyanā is knowledge (''prajnā'') and pure wisdom (''jñāna''). Jñāna is called the wisdom of nature of phenomena and it comes about through the realization of the true nature of phenomena.<ref>Thrangu Rinpoche, Looking Directly at Mind : [[The Moonlight of Mahāmudrā]]</ref>}}\n\n==See also==\n{{Portal|Buddhism}}\n{{div col|colwidth=15em}}\n===Buddhism===\n* [[Atthakavagga and Parayanavagga]]\n* [[Global Vipassana Pagoda]]\n* [[Jñāna]]\n* [[Meditation]]\n* [[Neural mechanisms of mindfulness meditation]]\n* [[Upasana]]\n* [[Vipassana Meditation Centre]]\n* [[Vipassī Buddha]]\n* [[Zazen]]\n===Christianity===\n* [[Apophatic theology]]\n* [[Monastic silence]]\n{{div col end}}\n\n==Notes==\n{{reflist|group=note|30em}}\n\n==References==\n{{Reflist|30em}}\n\n==Sources==\n{{refbegin}}\n* {{Citation | last =Bond | first =George D. | year =1992 | title =The Buddhist Revival in Sri Lanka: Religious Tradition, Reinterpretation and Response | publisher =Motilal Banarsidass Publishers}}\n* {{Citation | last =Bronkhorst | first =Johannes | authorlink = Johannes Bronkhorst | year =1993 | title =The Two Traditions Of Meditation In Ancient India | publisher =Motilal Banarsidass Publ.}}\n* {{Citation | last =Brooks | first =Jeffrey S. | year =2006 | title =A Critique of the Abhidhamma and Visuddhimagga | url =http://www.greatwesternvehicle.org/criticism/abhidhamma.htm}}\n* {{Citation | editor-last1 =Buswell | editor-first1 =Robert E. JR | editor-last2 =Gimello | editor-first2 =Robert M. | year =1994 | title =Paths to Liberation. The Marga and its Transformations in Buddhist Thought | place =Delhi | publisher =Motilal Banarsidass Publishers}}\n* {{Citation | last =Cousins | first =L. S. | year =1996 | chapter =The origins of insight meditation | editor-last =Skorupski | editor-first =T. | title =The Buddhist Forum IV, seminar papers 1994–1996 (pp. 35–58) | place =London, UK | publisher = School of Oriental and African Studies | url =http://www.shin-ibs.edu/documents/bForum/v4/03Cousins.pdf}}\n* {{Citation | last =Fronsdal | first =Gil | year =1998 | title =Insight Meditation in the United States: Life, Liberty, and the Pursuit of Happiness. In: Charles S. Prebish and Kenneth K. Tanaka, ''The Faces of Buddhism in America'', Chapter 9 | url =http://www.insightmeditationcenter.org/books-articles/articles/insight-meditation-in-the-united-states-life-liberty-and-the-pursuit-of-happiness/}}\n* {{Citation | last =Glickman | first =Marshall | year =1998 | title =Beyond the Breath: Extraordinary Mindfulness Through Whole-Body Vipassana Meditation | publisher =Tuttle Publishing | isbn =1-58290-043-4}}\n* {{Citation | last =Gomez | first =Luis O. | year =1991 | title = Purifying Gold: The Metaphor of Effort and Intuition in Buddhist Thought and Practice. In: Peter N. Gregory (editor)(1991), ''Sudden and Gradual. Approaches to Enlightenment in Chinese Thought'' | place =Delhi | publisher =Motilal Banarsidass Publishers Private Limited}}\n* {{Citation | last =Gombrich | first =Richard F. | year =1997 | title =How Buddhism Began. The Conditioned Genesis of the Early Teachings | place =New Delhi | publisher =Munshiram Manoharlal Publishers Pvt. Ltd.}}\n* {{Citation|last=Gunaratana|first=Henepola|authorlink=Henepola Gunaratana|title=Mindfulness in plain English|publisher=[[Wisdom Publications]]|year=2011|page=21|url=http://www.vipassana.com/meditation/mindfulness_in_plain_english_5.php|ISBN=978-0861719068}}\n* {{Citation | last =Khantipalo | first =Bikkhu | authorlink =Khantipalo | year =1984 | title =Calm and Insight. A buddhist Manual for Meditators | place =London and Dublin | publisher =Curzon Press Ltd.}}\n* {{Citation | last =King | first =Winston L. | year =1992 | title =Theravada Meditation. The Buddhist Transformation of Yoga | place =Delhi | publisher =Motilal Banarsidass}}\n* {{Citation | last =Koster | first =Frits | year =2009 | title =Basisprincipes Vipassana-meditatie. Mindfulness als weg naar bevrijdend inzicht | publisher =Asoka}}\n* {{Citation | last =Mathes | first =Klaus-Dieter | year = 2003 | title =Blending the Sūtras with the Tantras: The influence of Maitrīpa and his circle on the formation of Sūtra Mahāmudrā in the Kagyu Schools. In: Tibetan Buddhist Literature and Praxis: Studies in its Formative Period, 900–1400. Tibetan Studies: Proceedings of the Tenth Seminar of the International Association for Tibetan Studies | place =Oxford}}\n* {{Citation | last =McMahan | first =David L. | author-link = | year =2008 | title =The Making of Buddhist Modernism | place = | publisher =Oxford University Press | ISBN =9780195183276}}\n* {{Citation | last =Norman | first =K.R. | year =1997 | title =A Philological Approach to Buddhism. The Bukkyo Dendo Kybkai Lectures 1994 | publisher =School ofOriental and African Studies (University of London) | url =http://ahandfulofleaves.files.wordpress.com/2011/11/a-philological-approach-to-buddhism_norman_tbf_1997.pdf}}\n* {{Citation | last =Nyanaponika | year =1998 | title =Het hart van boeddhistische meditatie (The heart of Buddhist Meditation) | publisher =Asoka}}\n* {{Citation | editor-last =Ray | editor-first =Reginald A. | year =2004 | title =In the Presence of Masters: Wisdom from 30 Contemporary Tibetan Buddhist Teachers | isbn =1-57062-849-1}}\n* {{Citation | last =Schmithausen | first =Lambert | year =1986 | title =Critical Response. In: Ronald W. Neufeldt (ed.), \"Karma and rebirth: Post-classical developments\" | publisher =SUNY}}\n* {{Citation | last =Schumann | first =Hans Wolfgang | year =1974 | title =Buddhism: an outline of its teachings and schools | publisher =Theosophical Pub. House}}\n* {{Citation | last = Thanissaro Bhikkhu | year =1997 | title =One Tool Among Many. The Place of Vipassana in Buddhist Practice | url =http://www.accesstoinsight.org/lib/authors/thanissaro/onetool.html}}\n* {{Citation | last =Vetter | first =Tilmann | year =1988 | title =The Ideas and Meditative Practices of Early Buddhism | publisher =BRILL}}\n* {{citation | last =Warder | first =A.K. | year =2000 | title=Indian Buddhism | place=Delhi | publisher =Motilal Banarsidass Publishers}}\n{{refend}}\n\n==External links==\n\n===History===\n* [http://www.insightmeditationcenter.org/books-articles/articles/theravada-spirituality-in-the-west/ Theravāda Spirituality in the West]\n* [http://meaningness.wordpress.com/2011/07/07/theravada-reinvents-meditation/ David Chapman, ''Theravada reinvents meditation'']\n\n===Background===\n* [http://buddhanet.net/insight.htm Insight Meditation Online] ''From'' Buddhanet.net\n* [https://www.scribd.com/doc/59360476/A-Honed-and-Heavy-Axe-chandako-2004 A Honed and Heavy Axe]\n* [https://www.scribd.com/doc/57316510/Satipatthana-Vipassana-Criticisms-and-Replies-Mahasi-Sayadaw Mahasi Sayadaw, ''Satipatthana Vipassana: Criticisms and Replies'']\n* [http://www.greatwesternvehicle.org/fruit.htm Jeffrey S, Brooks, ''The Fruits (Phala) of the Contemplative Life'']\n* [http://www.pariyatti.org/ Publications in the Theravāda tradition/ Pariyatti.org]\n* [http://www.vipassanabookstore.org/ Publications and resources on Vipassana meditation (as taught by S.N. Goenka)] (vipassanabookstore.org)\n\n===Practice===\n* [http://www.yellowrobe.com/practice/meditation.html Meditation] ''From'' Yellowrobe.com\n* [http://www.dhamma.org/en/art.shtml Vipassana Meditation] as taught by [[S.N. Goenka]] and his assistant teachers in the tradition of [[Ba Khin|Sayagyi U Ba Khin]] at free centers worldwide\n* [http://www.saddhamma.org/ Saddhamma Foundation] Information about practicing Vipassana meditation.\n* [https://web.archive.org/web/20160220185437/http://www.enabling.org/ia/vipassana/Archive/K/Khema/guidelinesForVipassana.html Practical Guidelines for Vipassanâ] by [[Ayya Khema]]\n* [https://store.pariyatti.org/A-Meditators-Handbook-br-spanVipassanaspan_p_4839.html/ A Meditator's Handbook] by Bill Crecelius \n* [https://www.dhiravamsa.com/english/books/ Turning to the Source] by V.R. Dhiravamsa \n* [https://www.dhiravamsa.com/english/books/ The Middle Path of Live] by V.R. Dhiravamsa \n* [https://www.dhiravamsa.com/english/books/ Healing through Pure Mindfulness] by V.R. Dhiravamsa\n\n{{Buddhism topics}}\n{{Meditation}}\n\n{{Authority control}}\n\n{{DEFAULTSORT:Vipassana}}\n[[Category:Buddhist meditation]]\n[[Category:Buddhist philosophical concepts]]\n[[Category:Buddhist practices]]\n[[Category:Buddhist terminology]]\n[[Category:Reality]]\n[[Category:Spiritual faculties]]\n[[Category:Mindfulness (Buddhism)]]\n[[Category:Nondualism]]",
            "slug": "vipassan-",
            "date_updated": 1531837949500,
            "imported": "https://en.wikipedia.org/wiki/Vipassanā"
        }
    ]
}