{
	"title": "jsilence",
	"description": "invisible inaudible \nin the background pattern",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 15,
	"demo": false,
	"modified": 1486723053,
	"post": [
		{
			"post_id": 10,
			"title": "Beaker - An experimental P2P browser",
			"date_published": 1482220923.209,
			"body": "From the website: \"[Beaker](https://beakerbrowser.com/) is a Peer-to-Peer Web Browser, made for users to run applications independently of hosts. Using P2P Hypermedia, Beaker separates frontend apps from backend services, so that users are completely in control of their software and data.\"\n\nI have not tried it yet, but the concepts of Beaker look quite similar to those of ZeroNet. Usability (as can be seen in the video) is a little higher than that of ZeroNet. I have not yet tested it, but it looks quite promising. It features the [Dat Protocol](https://beakerbrowser.com/docs/dat/intro.html) which is built in and the IPFS protocol which has to have the IPFS demon running externally.\n\nI'd really like to know the differences and similarities between this approach and ZeroNet. Feel free to discuss in the comments!"
		},
		{
			"post_id": 9,
			"title": "Bloomberg: World Energy Hits a Turning Point: Solar That's Cheaper Than Wind",
			"date_published": 1481923428.1,
			"body": "Prices of photovoltaic have been dropping for a while and have now hit a key point where solar becomes cheaper than wind and coal.\n[Bloomberg reports](https://www.bloomberg.com/news/articles/2016-12-15/world-energy-hits-a-turning-point-solar-that-s-cheaper-than-wind)."
		},
		{
			"post_id": 8,
			"title": "Quarz: Bill Gates and investors worth $170 billion are launching a fund to fight climate change through energy innovation",
			"date_published": 1481532464.2,
			"body": "Bill Gates and other investors are [setting up a huge fund](http://qz.com/859860/bill-gates-is-leading-a-new-1-billion-fund-focused-on-combatting-climate-change-through-innovation/?linkId=32225791) that invests in the commercialization of green energy technology. So it is not only about research, but on the contrary it is about the wide spread implementation of the solutions that have already been found. This is awesome! \n\nThe article title is a bit misleading though. The $170 billion figure is the net worth of the investors, not the fund. The fund volume is still a whopping $1 billion."
		},
		{
			"post_id": 7,
			"title": "Scientists Accidentally Discover Efficient Process to Turn CO2 Into Ethanol",
			"date_published": 1479796298.9,
			"body": "Scientist find an energy effective way to [turn CO2 into Ethanol](http://www.popularmechanics.com/science/green-tech/a23417/convert-co2-into-ethanol/). If this is feasible it can be deployed in large scale to ease on global warming."
		},
		{
			"post_id": 6,
			"title": "Revolutionary steel treatment paves the way for radically lighter, stronger, cheaper cars",
			"date_published": 1471410129.5,
			"body": "A [new treatment](http://newatlas.com/flash-bainite-automotive-testing/40774/?li_source=LI&li_medium=default-widget) in steel processing creates harder, yet ductile new steel alloy, that allows for lighter construction of cars.\nCheaper too."
		},
		{
			"post_id": 5,
			"title": "non-toxic, thin-film solar cells",
			"date_published": 1462164448,
			"body": "Organic non silicone thin film solar cells have been in development for a loooong time and there have been numerous announcements over the past decades. It looks like the research ist finally getting somewhere.\n[UNSW announced](http://newsroom.unsw.edu.au/news/science-tech/unsw-takes-lead-race-non-toxic-thin-film-solar-cells) a new type of cell with over 7% efficiency that can be produced on a lot of different carrier materials, including classical silicone cells."
		},
		{
			"post_id": 4,
			"title": "Scientists Grow Full-Sized, Beating Human Hearts From Stem Cells",
			"date_published": 1458547984.971,
			"body": "[Scientists Grow Full-Sized, Beating Human Hearts From Stem Cells](http://www.popsci.com/scientists-grow-transplantable-hearts-with-stem-cells)\n\nSo humanty is one step closer to grow organs that will not be rejected by the transplantee."
		},
		{
			"post_id": 3,
			"title": "Good News!",
			"date_published": 1457802234.123,
			"body": "We are flooded with bad new and this makes the future look bleak. But I am certain there are solutions to the upcoming challenges. I'll try to post good news in this blog. Feel free to add pointers to good stuff happening in the comments."
		}
	]
}