{"cert_user_id": "jancborchardt@github", "next_topic_id": 3, "topic": [{"topic_id": 1604065840, "title": "Android app: Notification \"ZeroNet is running\" should lead to app instead of app info screen", "body": "Currently the notification leads you to the screen where you can force stop or uninstall the app.\r\n\r\nThis seems like a quick hack and it would be nicer to open the app itself instead. In there being a button to stop the service.\r\n\r\nOtherwise you basically recommend people to uninstall the app. ;) With showing the app instead you are encouraging users to interact more with the other services. :)", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1491405239, "modified": 1491462766, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/881", "source_type": "github"}, {"topic_id": 1604065842, "title": "Transform HelloZeroNet from user into an organization", "body": "Currently it's a bit strange that HelloZeroNet is a user with all the repositories in that account.\r\n\r\nTo get more contributors on board and showcase the project better, it would be good to transform the user into an organization.", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1491405443, "modified": 1492938640, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/882", "source_type": "github"}], "next_comment_id": 3, "comment": {"1604065842_mirrored_jancborchardt_github": [{"comment_id": 1, "body": "> HelloZeroNet is Tamas, Tamas is HelloZeroNet. There is only one person. :(\r\n\r\nI know, and that of course doesn't scale. ;)\r\n\r\n> He is the programmer, UI designer, support, writer and spokesperson. Everyone else you see here is one from that big list of contributors who have pull requests merged into the main branch.\r\n\r\nAnd that's exactly why converting it to an organization would be a simple move to push the community more and make it feel more like a real & serious community project. :)", "added": 1492910495, "modified": 1492910495, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/882#issuecomment-296418698", "source_type": "github"}, {"comment_id": 2, "body": "@madovsky not sure why you expect this improvement suggestion - which is based on my experience from open source communities large and small - to be motivated by personal gain.\r\n\r\nI have no stake in this project and simply see that it could be more inclusive and better off with trying to foster more of a community of regulars than staying a one-person-project. Which it already apparently is, but that's not very visible so it makes it seem a bit exclusive and less welcoming to newcomers who might be interested in contributing too.", "added": 1492938640, "modified": 1492938640, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/882#issuecomment-296438972", "source_type": "github"}]}}