{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1605036890,
			"title": "An Open Letter to All Elected Officials in the United States Government",
			"body": "Dear friends,\n\nThe following is an open letter I've written to our elected officials in the United States. If you are a citizen and feel as I do, feel free to forward and/or read this to your own elected officials as well as anyone else you think would be interested. By my reckoning, the more voices we have coming together on this, the faster they'll realize that the United States Constitution and the Rule of Law it establishes aren't going anywhere.\n\nAN OPEN LETTER TO ALL ELECTED OFFICIALS IN THE UNITED STATES GOVERNMENT\n\n\n\"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed...\"\n\nTo those squatting unjustly in the elected offices of the United States of America (both local and federal) who refuse to duly represent your constituents and fulfill your oaths of office: I hold you in contempt of the United States Constitution and your oaths to uphold and defend it. Given that you have betrayed those oaths and the trust of the American people, defrauded the taxpayers of their just and honest earnings, and made tax slaves of those you fraudulently claim to represent, I hereby withdraw my Consent to be governed by the lot of you.\n\nWhen you can come together and reinstate the rule of law as established by the United States Constitution, I shall reinstate my Consent to be governed. Until then, do not expect my consent or complicity with any of your schemes.\n\n\n~ One Pissed off American Citizen",
			"added": 1605036889
		}
	],
	"topic_vote": {
		"1598402904_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": 1
	},
	"next_comment_id": 4,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Is this thing on?",
				"added": 1605036173
			}
		],
		"1604685676_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 2,
				"body": "Wake me up when the arrests begin. I won't be holding my breath.",
				"added": 1605036555
			}
		],
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": [
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_2681_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Taking away rights is stupid.\n\nYes it is. And by that logic, it was stupid to take away peoples' rights to conduct their business and to peaceably assemble all in the name of \"public safetly\".",
				"added": 1605037607
			}
		]
	},
	"comment_vote": {
		"30_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"40_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"1_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"2_13Vz54JPp7uho5FaMyyi9hv7yi8zJHVhkv": 1,
		"1196_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"3_1N51mAhuByPNmLdzzyaYXN1G4XUkQyCc4F": 1
	}
}