{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1563904309,
			"title": "Good Fucking God...",
			"body": "As Ross the creator of the Silk Road drug market got fucked up deep by some dirty shitbag piggy  arseholes with all the money and power along with the feds digging deep to fuck with the owner of kickasstorrents as he continues to fight US extradition '23/8/19', quite sad this is the system, but if it is written in the law, then what else can certain piggies do?. Its like ISIS, some CHOOSE to go the apey rapey path, just like the feds have done to people like Ross who are just normal guys liking open source movements. \n\nSo the question is how to integrate content that is worthy into some sort of freenet-tor-portal (educated, that is fun, along with the chatrooms).. \n\nannnnnd just google Ross Ulbricht silk road to see what happened to him... annd@freeross.org",
			"added": 1563904308
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1563540336_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 1,
				"body": "it will continue to fuck up peoples education. 95% of the internet is truly a complete pile of dog shit...\nfacebook likes,\nyoutube vbloggers giving their 'reactions'..\n\n\nstone age men that read books are better than todays people..\n\n\ngoooood fucking bye",
				"added": 1563877051
			},
			{
				"comment_id": 2,
				"body": "> [filips](#comment_96_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): JavaScript is good. Problems are browsers (mostly Chrome and other 90% of browsers which use Chrome) which then add useless features that make malware attacks and fingerprinting easier. Firefox has more privacy protections but I would still like more of them. If JavaScript would be correctly implemented, it could be one of the best programming languages. [...]\n\njust use adblock to disable 3rd party bullshit.",
				"added": 1563877172
			}
		],
		"1563381859_1MU8er27jszWmguLydfKYxuaWQNXbQ9cyt": [
			{
				"comment_id": 3,
				"body": "Why can't ZN use JustShit server-side and output cached php on the client side? Or some sort of css cached....",
				"added": 1563877285
			}
		],
		"1563092690_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 4,
				"body": "The thing is, why not have the option for people to die peacefully with a injection?. \n\nWhat would happen if all ANYONE with hate and educated like myself were to be put down?. Would the earth come to a cumming end?",
				"added": 1563878961
			}
		],
		"1560440259_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 5,
				"body": "vpn is useless.... even if jack fucking smith used 8 proxies, EACH IP hops to another IP which is logged, right?. so what does it matter in the end?",
				"added": 1563880231
			},
			{
				"comment_id": 6,
				"body": "You could use TOR with seedboxes.",
				"added": 1563880287
			}
		],
		"1563904309_164cJJtm3Q2Xd7NZbFxJYngmW8MSqUMMxi": [
			{
				"comment_id": 7,
				"body": "Would be helpful instead of doing nothing, show some support to Ross, catch him on the website!",
				"added": 1563904404
			}
		]
	},
	"comment_vote": {
		"470_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}