{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1579762565,
			"title": "why bother",
			"body": "The world is going to complete shit, where the (((rich))) dominate literally aspect of our lives and further encroach on our freedoms, while the rest of us either don't give a shit or fall for their misdirection bs about political correctness, racism, trump man bad tweet, climate change, etc. The only real source of power in this world is the economy which we all seem to somehow have collectively forgotten as the (((elite))) controlled media spews their divisive garbage about the unimportant stuff. We are turning into a vast, homogeneous, consumer-state where literally everything is commodified into a product that (((they))) can sell us (eg. beauty, love, happiness etc.), and there are no genuine human values that make life worth living, like real connection (which is probably a lie anyway), rewarding work to provide for your loved ones, and a strong sense of community/family.\n\nOn top of that you have an entire generation of people (mostly men) growing up completely fucked mentally because of the widespread prevalence of social media where people are CONSTANTLY bombarded with affirmations that they aren't smart, good-looking, happy, etc. enough. This combined with the complete power shift in mate selection towards women has completely fucked the average young male who can't hope to compete with the few men good looking enough to catch women's eyes on Tinder or whatever. These effects have combined to create a mental health crisis where so many men (women too though) have become depressed and are giving up on life before having even started it. We are just now beginning to see its devastating effects in Japan with hikikomori, NEETs in America, incels etc.\n\n And it seems barely anyone gives a flying fuck because they are all too wrapped up in calling each other racists or libtards, arguing about immigration or some other equally retarded unimportant garbage. These people are all hypocrites, as they run around waving their flags of freedom, (((anti-racism))), (((anti-homophobia))), while they continue to buy products made off the backs of child slaves in sweatshops in 3rd world countries, and don't raise a single peep, because it would be too hard to admit that they are that delusional. The slavery issue by the way is worse than it has ever been pretty much, with the average slave being about $90 USD nowadays, and an estimated 20-40 million in the world, its literally not even worth it to feed them, because to buy a new one is just so much cheaper, and barely anyone talks about it.\n\nMeanwhile our fundamental freedoms of privacy and free speech are being crushed by all these (((major companies))) who spy on everything we do, harvesting our data to enslave us to their social media and hack our brains to sell us more more more. And you talk to people about this issue and people are like \"hurr durr i have nothing to hide lol\" and they just continue on with their meaningless existences, while their psychology is exploited to make them dopamine slaves to porn, social media, and consumerism. Plus with the media being completely controlled by the (((rich))) they've created a climate where you literally can't say anything without fear of being \"cancelled\" or fired from your job because you expressed your opinion about something you believe in.\n\nAnd I know this is nothing new, the (((rich))) have always been exploiting society, but the problem with today's society is how the Internet has vastly expanded their reach, both across the globe and straight inside our heads, tracking every little thing we do. We are heading at an alarming pace towards a world even worse than Huxley's, as the surveillance-state China, who is running literal concentration camps in Xinjiang, takes over from the decadent West which has grown languid with its centuries of vast wealth and domination.\n\nAnd there's literally nothing we can do. People say \"ANARCHY BLOW EVERYTHING UP TAKE DOWN THE RICH VIOLENT UPRISING\" but the problem is that that isn't even a solution, since eventually, if society recovers from that, the rich will just take over and exploit us again, its the way societies grow. There is just no way out, we are all doomed. \n\n\n\n\nAnd tbh I personally have basically completely given up on life. I don't really care what happens to me anymore. I haven't gone to class in weeks and I feel absolutely nothing about it. I basically just sit inside all day sleeping or watching retarded garbage on Youtube so I can distract myself from the endless emptiness that is my life and the greater world. I don't know how people can just walk around every day and not worry, just be happy or at least care about things. Like don't people realize that you literally don't matter at all and nothing you do matters?\n\nPeople are always telling you suicide is not an option. Well fuck them you have no idea what you are talking about because you don't want to kill yourself. To me, if you are at a point where you derive absolutely no joy from anything in your life, you feel absolutely nothing, you want absolutely nothing, you feel sluggish and tired every day, are lonely,  you've tried anti-depressants, you've tried therapy, you've tried exercise, and none of its worked and you feel like there is no hope, then seriously what is the point of continuing on such an empty and painful existence. Suicide would actually improve your quality of life because your current one is so devoid of anything you might as well make it official. But of course I'm too much of a coward to do it (for now).\n\nFuck, where did it all go wrong.",
			"added": 1579762564
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "hello there",
				"added": 1578548373
			}
		]
	},
	"comment_vote": {
		"1_12KGrRreWj4RPzLbETWa5M8QbcRDXoA2o1": 1
	}
}