{
	"title": "Musickiller's Blog",
	"description": "Max followers: 114 (YAY!))",
	"links": "Announcements:\n- [Hobbit on the sale!](http://127.0.0.1:43110/blog.musickiller.bit/?Post:51:There+was+a+hole...)\n\n--------\n\nMK:\n[Menu](http://127.0.0.1:43110/blog.musickiller.bit/?Post:240:New+Blog+Contents)\n[My Sites](http://127.0.0.1:43110/musickiller.bit)\n\n----------\n\nFriends:\n[Erkan's ZeroBlog](http://127.0.0.1:43110/zeroblog.bit)\n[Kappa Sigma](http://127.0.0.1:43110/kappasigma.bit)\n\n---\n\nErkan's tools:\n[ZeroProxies](http://127.0.0.1:43110/ZeroProxies.bit)\n\n--------\n\n--------\n\n- [ZeroNet Source code](https://github.com/HelloZeroNet)\n\n-----\n\nFOR FREEDOM!\n<a target='_BLANK' href='https://ipfs.pics/QmU7VWfd3DN1Hh8fjALhQyJLgtkwxkYP2zz9MDT4rkyVJ1'><img width=\"170\" alt=\"A pirate flag. Turn on your clearnet or IPFS plugin.\" src='https://ipfs.pics/ipfs/QmU7VWfd3DN1Hh8fjALhQyJLgtkwxkYP2zz9MDT4rkyVJ1'/></a>\n#\n#\n#\n#\n#\n#\n#\n#\n\n-----",
	"next_post_id": 251,
	"demo": false,
	"modified": 1637216355,
	"post": [
		{
			"post_id": 250,
			"title": "Assassination attempt on Princess Pinguicula by the cat",
			"date_published": 1637215893.034,
			"body": "This morning the cat has tore the plant from the pot by it's long flower stem, then dragged it out of a container, and down to the floor.\n\nSince the beast is chewing so loud on dried stuff (the flower was dried already, gladly, or I'd kill the monster on the spot) that I could hear it from the only good dream I had in many months.\n\nI thought it was some plastic, but instead, found small soft green body of a plant on the ground.\n\nI've put it back now, but I can barely hope it will do anything. There were a few living roots left, so there is a TINY chance the plant will live yet."
		},
		{
			"post_id": 249,
			"title": "Snails are getting smarter? O_O",
			"date_published": 1637050439.133,
			"body": "Smart animals are our blessing and a curse: Snails fist discovered that if they run around like crazy, I get worried, open the lid and bring tastier food.\n\nNow they have also learned that even when I don't look at them, they can attract food by chewing at breathing holes of the box, making loud scratching sounds.\n\nI'm scared of what would a fish come up with o_O Bang the aquarium with it's head? Jump out of it? That would be fun.\n\n...or ants! Need to buy ants!"
		},
		{
			"post_id": 248,
			"title": "H2O2",
			"date_published": 1636625592.013,
			"body": "DON'T use hydrogen peroxide for mucous membranes, AKA mouthwash, without reading the instruction.\n\nAnd no, being engineer and knowing how to use it for rocket fuel still doesn't mean you can do that.\n\nEither it will kill you, or your wife will. I was saved (barely), but you may not be so lucky.\n\n## Jocking aside...\n...you can mouthwash with 2.5 mg/ml solution, or dilute 30mg/ml peroxide solution with water at a ratio of 1 to 11.\n\nEDIT: I've replaced \"%\" with mg/ml."
		},
		{
			"post_id": 245,
			"title": "ZN Idea: More filter possibilities: content warnings",
			"date_published": 1636122099.138,
			"body": "I've got an idea how to give people a way NOT to block each other if someone post some content they may not want to read. Content descriptions or content warnings - even if simple tags are parsed, they can be used to mute only particular topics.\n\nThe idea came to my head because there are some cool interesting people, that post some politics, and I just really-really don't want to read about it. I'd hate to block people because of it, even for some time."
		},
		{
			"post_id": 244,
			"title": "I've beaten my covid!",
			"date_published": 1635773847.703,
			"body": "Well, kind of. I had a distortion of taste because of my covid last January, and for about 10 months I could not eat most food. Bland macaroni diet has worn me out, and lack of tasty stuff has driven me into a state when I just didn't care much about things one way or another.\n\nBUT! A few days ago I've found out that I can use peanuts (which are distorted in a milder way) to blunt the distortion to complete(?) nothingness!\n\nFor a while now I knew that if I keep eating stuff that I have problems with (and don't puke somehow), the taste will come to normal for a short duration. That's how I've once eaten kebab and another time even pizza was almost normal!\n\nBut I've recently found out that some food works better as a fixer and all that was left for me was to stumble upon a cheap and good one. Peanuts! (and possibly lots and lots of stress, but let's hope the former is enough...)\n\n1-2 days ago I've eaten peanuts for breakfast because it was almost 16:00 and I was quite hungry, as you might imagine. And then it struck me that even though I had trouble with the first couple of nuts, all the rest were tasty and nice! So without any delay I've opened a chocolate bar and started chewing. And it was SO GREAT! I haven't tasted a good real chocolate for almost a year! 10 months! And this one was a giant chocolate bar of quite decent quality, nuts and orange (present, but not too much of it).\n\nToday was the day I've finally beaten one of 2 worst nemeses - coffee. For this whole time I could be used to determine if the coffee was real or just some crap-shit mix. Real coffee literally caused me to either faint or puke depending on how much I wanted either one of these. But with the help of super peanuts I've just drunk a cup of coffee and cream and even kind of enjoyed it! It's a complete victory! And I have to say that peanuts go quite good with almost anything, especially coffee. So it's a win-win))\n\nNext item on the list will be eggs. Even thinking of them made my head hurt, but  I have to try it. If I can eat eggs, or at least chicken, it will make my wife happy almost more than it will make me happy myself xD"
		},
		{
			"post_id": 243,
			"title": "image test",
			"date_published": 1635698517.245,
			"body": "To see the image you need to have [ZeroUp@anotherneko](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/?Popular) (389kB)\n\n<img alt=\"test image from 1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f\" src=\"http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1525789814-wallpaper-2576830.jpg\" />"
		},
		{
			"post_id": 242,
			"title": "Casey's recent achievements",
			"date_published": 1635602850.997,
			"body": "The most recent thing I've seen is how she interacts with phones and tablets: she started to use toes on her paws, opening them wide, instead of closing as if to grab the thing that is displayed in the game.\n\nSince it's less natural, I think she saw that in our interaction with the touch screens, we press on them instead of grabbing. (Touch is a more accurate term for the interaction, since the screen reacts to finger's capacity, but I'd expect a cat to think of it as a pressure application.\n\nYes, before this day, she used to grab the screen, trying to catch the image.\n\nTo be continued when I'm not on the phone..)"
		},
		{
			"post_id": 241,
			"title": "Post 241",
			"date_published": 1634888748.238,
			"body": "Did you know this blog is not as small as it seems? It has 241 posts (counting this one, and possibly including deleted posts...), and still counting!\n\nSome of them are small but they are still a part of the story!"
		},
		{
			"post_id": 240,
			"title": "New Blog Contents",
			"date_published": 1634888306.966,
			"body": "_(since I can't edit an old post for some reason)_\n\n## Plants\n- [Story](http://127.0.0.1:43110/blog.musickiller.bit/?Post:235:My+new+predator+plants+(first+days))\n### Photos\n- [First 10 days of Princess Pinguicula in her new home](http://127.0.0.1:43110/blog.musickiller.bit/?Post:239:First+10+days+of+Princess+Pinguicula+in+her+new+home)\n\n## Tech\n- [Arch on LVM](http://127.0.0.1:43110/blog.musickiller.bit/?Post:233:Arch+on+LVM)\n- [Qubes OS](http://127.0.0.1:43110/blog.musickiller.bit/?Post:229:Qubes+OS)\n\n## [Old Stuff](http://127.0.0.1:43110/blog.musickiller.bit/?Post:56:New+blog+post)"
		},
		{
			"post_id": 239,
			"title": "First 10 days of Princess Pinguicula in her new home",
			"date_published": 1634747149.106,
			"body": "Photos are uploaded to IPFS, if you want to help this blog - you can install it and browser add-on.\n\n\nDay 0. Penguicula in anti-café Bugs&Spiders. (I'm 80% certain it's her, not some other plant xD)\n![](https://ipfs.io/ipfs/QmNTKZib6KcBEaX6BPyDjfFBz4ewj6vFtRs5P7mSk337JQ?filename=0%20pinguicula%20before%20we%20taken%20her%20home.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 3. Pinguicula still in her cover.\n![](https://ipfs.io/ipfs/QmUCsZokBLncaEf5uBm1vv5BspwY1xNUB7yZUBFEjswvpS?filename=3%20pinguicula%20still%20in%20her%20cover.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 4. A video of a flashing bad fito-lamp in 16x slow mo.\n<center><video width=\"800\" controls>\n<source src=\"https://ipfs.io/ipfs/QmZa1bVrDo49xfMrnrxYJ3BfFTPd3RWSRqhq5RWXTBPHi9?filename=4%20flashing%20bad%20fitolamp%20in%2016x%20slow%20mo.mp4\" type=\"video/mp4\"></source>\n</video></center>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 6. Pinguicula near Monster in their new spot.\n![](https://ipfs.io/ipfs/QmeEFX3qTNJSeaExJaozsow3aEiRbD9wr2qRhkVDy88q3Q?filename=6%20pinguicula%20near%20monster%20in%20their%20new%20spot.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 6.2. Pinguicula under two lamps\n![](https://ipfs.io/ipfs/QmbZVUNTHnxKfAbFhyZrtSum1gdvt9ztdSqafpqiJJnsqE?filename=6.2%20pinguicula%20under%20two%20lamps.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 7. (with a flash)\n![](https://ipfs.io/ipfs/QmVBXq82LTXF6XoDFEybqtYUe7VQbF3VWXEhsnVgMB2hJs?filename=7%20pinguiclua%20with%20a%20flash.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 7.2 (without a flash)\n![](https://ipfs.io/ipfs/QmXaou446wWaUarLGnjVgZeASoPuNd58MbxRMK5zKjoNQ8?filename=7.2%20pinguicula%20without%20a%20flash.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 7.3 Peeping on Nepenthes\n![](https://ipfs.io/ipfs/QmZNpuxJfUJEiJofkjFhcDBFfY1gjhb366fgbwcQbZXrkq?filename=7.3%20peeping%20on%20nepenthes.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 9 Pinguicula with a bad leaf\n![](https://ipfs.io/ipfs/QmNVdXTv4wivZoJVL21EhVPzpPkjLXyX3jL9SUvkGy98CY?filename=9%20pinguicula%20with%20a%20bad%20leaf.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 10. Current setup with a foil cover to reflect heat and light back\n![](https://ipfs.io/ipfs/QmYttmEkPvL743az4UimPWA6BdJc69TZmqDQic3FcPp6Gi?filename=10%20current%20setup%20with%20a%20cover.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 10.2 Cover removed, luminescent lamp visible (it gives more heat and is 4000K)\n![](https://ipfs.io/ipfs/QmWEptUTDk5VscC9Mw7AsES6EYJEk51jmTXc9QB7h45nap?filename=10.2%20cover%20removed%2C%20luminescent%20lamp%20visible.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10.3 A flower of Pinguicula!\n![](https://ipfs.io/ipfs/QmckViMmapjogDJtSqU2Fj1SY81n2LRg1aHzDue6Hytzvn?filename=10.3%20a%20flower%20of%20pinguicula.jpg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10.4 A photo with a flash\n![](https://ipfs.io/ipfs/QmVa3xoMzaUZtUEqxTymWJ6vPufiRXCeRRRDwB9k1Yyxp6?filename=10.4%20pinguicula%20with%20a%20flash.jpg)\n\n\n\n\n\n\n\n\n\n10.5 With a lamp on\n![](https://ipfs.io/ipfs/QmRrG1d69S3CHddMfWrXeMm7tM6t9YBUbCHHgyTdsGkd4Y?filename=10.5%20pinguicula%20with%20a%20lamp%20on.jpg)\n\n\n\n\n\n\n\n\n10.6 Video: Pinguicula and dinner\n<center><video width=\"800\" controls>\n<source src=\"https://ipfs.io/ipfs/QmPKnkdMNuYsDQHS2BDJ1H7cE2aaYaB4R8M4mi3nbQ7cbW?filename=10.6%20pinguicula%20and%20dinner%20h.264.mp4\" type=\"video/mp4\"></source>\n</video></center>\n"
		},
		{
			"post_id": 238,
			"title": "Yes, I will upload photos of my plants",
			"date_published": 1634744703.451,
			"body": "..obviously =D\n\nHere is the full shared folder. It will take me some time to paste them here... https://ipfs.io/ipfs/QmbcGzJbPmK9mtctgi19uZjF51PgrdZYm4aBW123m1SrD7"
		},
		{
			"post_id": 237,
			"title": "My poor old blog lost all it's pics",
			"date_published": 1634744361.31,
			"body": "My poor old blog lost all it's images and photos since they were all on IPFS and no one needed them =(((\n\nGood news - possibly because all those heavy photos were on IPFS, and not in the blog itself, 30 wonderful people have shared it back to me when I came back here! ^_^ Thank you for keeping my blog safe all these years!!!\n\nAnother good news: because the flag on the left is one of the most popular images on ipfs.pics, it's safe! Yarrrr!"
		},
		{
			"post_id": 236,
			"title": "Updated the blog html, css and js",
			"date_published": 1634743615.342,
			"body": "Now it's all bluish and a pain to write because of the bright window around dark line I'm writing. I think it's wrong =\\\nEDIT: it seems that I had to reload it with ctrl + r to see it fully updated.\n\nAnd also now it's a blueog. Should make it green or something.."
		},
		{
			"post_id": 235,
			"title": "My new predator plants (first days)",
			"date_published": 1634740592.733,
			"body": "My prime reason to be searching for a blog platform is that I now have a couple of predator plants! (not sure it's a correct name in English, but anyway..) So obviously my first more or less informative post here will be about them 😁\n\nThey are Mexican Pinguicula and Nepenthes. Yeah, we really wanted Venus Flytrap, but we were told she's a bitch when it comes to holding it at home. Drosera was one of our choices, but first two seemed like the best plants for a beginner.\n\nThe first thing we were told to do was to name them, then to find them a good spot, put them there and not to touch for a few days. And to never ever move them from this spot.\n\nThe first task was hard, because I don't like to come up with names, but with help of my wife, we now have Princess Pinguicula and Count Johny Nepenthes. You may guess that Alex helped me with the latter one twice as much xD\n\nNext task - find a place. Preferably an eastern window, (NOT southern), and most certainly not kitchen. BUUUT.... we only have southern windows. And a spot only in the kitchen. So it's not a perfect spot, but something to start with... It's always possible to add shading and keep the window partially open when Alex is cooking, right?\n\nThen I've started reading the manual in detail. And OH NO, they are totally different. One grows in the sunny Mexican tropics, and the other one in the cold mountains of somewhere...\n\nOf the two of them, Princess should be the least capricious, so the temperature and humidity were selected somewhere in between, closer Nepenthes. But very soon Pinguicula went into cold shock and we had to MOVE them apart.\n\nWith all 3 first rules kinda broken, I spent several days dancing around them, buying stuff like lamps, moss and distilled water to make their life bearable."
		},
		{
			"post_id": 234,
			"title": "Private key recovered from master seed!",
			"date_published": 1634716590.615,
			"body": "Those must be the sweetest words I've ever read on ZeroNet =D"
		},
		{
			"post_id": 233,
			"title": "Arch on LVM",
			"date_published": 1471778770.794,
			"body": "ClearNet links:\n[Arch Linux](https://www.archlinux.org/)\n<a href=\"https://en.wikipedia.org/wiki/Logical_Volume_Manager_(Linux)\">LVM</a>\n\nI'm gonna try to install Arch Linux, and will write about my progress here. As usually I will look into comments section from time to time.\n\n#Planning\n1. make a live USB stick\n2. Make partitions\n\n```\nPlanned partitions:\nsda 2 TB GPT\n  |----\t100M    fat32        /boot  As far as I understand, I should do it this way.\n  |----\t1T      lvm2 pv             Main partition\n  |  |-\t20G                 /       root\n  |  |-\t10G                 /var\t??\n  |  |-\t5G                  /tmp    ??\n  |  |-\t900G                /home   Home sweet home.\n  |  `-\t5G                  swap    4G memory + 1G coz I have 2 TB HDD.\n  `----\t~1T     NTFS        D:\\     For windows games.\n\nsdb 1,5TB MBR\n  |-    500G    NTFS        C:\\     Windows\n  `-    empty                       For the time when I need it most.\n  \nsdc 2TB MBR - 2 NTFS and 200-500G unalocated. My old drive. Mostly works as a metronome now. But my files are still there.\n\n```\n3) mount partitions\n4) install OS\n5) profit?\n\n#Acting\n##Phase 1.\n###USB stick.\nOn notebook:\n`cd /home/mk/Downloads/qbt`\n`lsblk`\n`sudo -s`\n`umount /dev/sdb*`\n`dd bs=4M if=archlinux-2016.08.01-dual.iso of=/dev/sdb status=progress && sync`\n\n##Phase 2.\n### Partitioning.\nOn PC:\n```\nlsblk or fdisk -l\ngdisk\n#next is from memory, so might be incorrect\n(gdisk) /dev/sda\n(gdisk) o     # create new gpt label\n(gdisk) y     # yes, do create, please.\n(gdisk) n     # create new partition...\n(gdisk) 1     # ...number 1\n(gdisk) +1M # that starts at 1MB\n(gdisk) +512M # and ends 512 MB later\n(gdisk) ef02     # type is BIOS boot partition (dunno if it's right) (actually, I'm not sure if this one is needed at all xD )\n(gdisk) n\n(gdisk) 2\n(gdisk) +1M\n(gdisk) +1T\n(gdisk) 8e00     # the type is Linux LVM this time\n```\nI've also checked alignment with `parted /dev/sda align-check optimal 1` and `... 2`, but I'm not sure that any disk tool is aligning partitions wrong.\n###LVM creation:\n```\npvcreate /dev/sda2\nvgcreate sys /dev/sda2\nlvcreate -n root -L20G sys\nlvcreate -n usr -L10G sys\nlvcreate -n var -L10G sys\nlvcreate -n tmp -L5G sys\nlvcreate -n swap -L5G sys\nlvcreate -n home -L400G sys\nlvcreate -n steam -L550G sys\n# visualize with:\npvdisplay # or pvs\nvgdisplay # or vgs\nlvdisplay # or lvs\n# or just\nlsblk\n```\n-----\nThe current state is this:\n<a target='_BLANK' href='https://ipfs.pics/QmRbSZsDQ1PYJEKNTYpWJxZRFShGiT7wsjMpMeSg3dZQTf'><img src='https://ipfs.pics/ipfs/QmRbSZsDQ1PYJEKNTYpWJxZRFShGiT7wsjMpMeSg3dZQTf'/></a>\n\nI've saw white stripes on the screen and have decided that something is wrong with the video card, but then followed those stripes out of the screen, and when they reached the keyboard, I've decided to go to bed.\n\nPlus somehow Mozart in my player turned into music of 1090-x... Have I been setting Arch for **that** long? I mean... I've only started! Have I started? I haven't even mounted anything! =(\n\nSleep."
		},
		{
			"post_id": 231,
			"title": "Dropping Qubes",
			"date_published": 1471717810.771,
			"body": "OK, I see that not many are interested in that idea, so I'll just install Parabola and see why do people love Arch so much..."
		},
		{
			"post_id": 230,
			"title": "Big Bada Boom",
			"date_published": 1471696765.216,
			"body": "I think I'm gonna brick my sm-t531 the hard way......\n\nBecause I wanna do [THIS](https://www.reddit.com/r/archlinux/comments/1yzzcd/arch_on_a_touchscreenonly_mobile_phone_is_it/cfpct2m?st=is3603cj&sh=daebc8d6)!"
		},
		{
			"post_id": 229,
			"title": "Qubes OS",
			"date_published": 1471458497.818,
			"body": "~~_In progress. I'll add stuff here as I explore this OS_~~\n_I want to try something different. If you want more info on this topic, comment._\n\nhttps://www.qubes-os.org/\n\n# The first day\n\n<a href=\"https://ipfs.pics/QmQNBHEmWspBeQi9385FQcLSdqJkXbrK8gGa3wHQE1N7mw\"><img src=\"https://ipfs.pics/ipfs/QmQNBHEmWspBeQi9385FQcLSdqJkXbrK8gGa3wHQE1N7mw\" /></a>\n_It took me quite a while to update all the VMs it had. But now when I finally have done it, I can install apps I need. By the way, I write this from Qubes =D_\n\nIt's hot. But it gives me headaches all the time. It's the first OS that I had to read about before using even the GUI part of it. May be old people feel this way about things easy and obvious for me?\n\n# Feels secure\n### \"What do you think of it?\"\nPeople are asking me \"What do you think about Qubes?\" The best answer I could think of is this: it does what it was made for. It seem to be the most secure OS I've ever used (or may be even seen).\n\nIt requires much more care than Ubuntu-like OSes that I've used before. It takes brains just to update it (you have to understand what is what, how it works and why it does not work). And it takes quite a lot of memory to run all VMs that I want to run. And most surely I won't be able to play games here, but I'll surely try =))))\n\nGreat news, by the way: it really works. It's not a concept, it's a product.\n\n# Quite beautiful\n\nI'm not a designer, but I require stuff on my screen to be beautiful. At least, because that's what I'm staring at a lot. Qubes looks good. I'm **very** glad of that!"
		},
		{
			"post_id": 228,
			"title": "\"WHY?!!\"",
			"date_published": 1471273863.972,
			"body": "SO... It is decided then. I'll install Qubes OS. For those who are still asking \"WHAT THE FUCK FOR??!\", I have an answer.\n\nFor years I lived with a thought that in our world, it's impossible to make any iformation really secure. I used to say \"there is no lock that can't be picked\". Always it's just a matter of time and effort.\n\nSome days ago I thought I've lost my phone. With all passwords stored in my browser, and most of my logins saved in cookies. To evade long list, I can just say that almost ALL my accounts would be compromised. So I've spent a day changing my passwords, encrypting portable devices I've had left.\n\nAnd when I finaly found my phone and encrypted all I could without much of an effort, still I felt some new thought and ideas sitting inside my head. Like \"Why those governments are spying on us so easily, while we can make their life so much harder by a little bit of work on our side?\" But most importantly, the question \"Is it possible to at least have a chance of being secure in this world?\"\n\nSo, the answer I got was \"depends on how secure you wanna be, what exactly you want to do with your system and what do you expect to happen.\"\n\nMy problem is mostly with nosy people. And I wanna make my security holes so tiny, that they would have to sniff **THAT HARD** in order to get anything.\n\nAgain, I belive that it's impossible to be absolutely safe. I just want governments to do some Proof of Work, not Proof of Stake... for a change =D"
		},
		{
			"post_id": 227,
			"title": "A Dream.",
			"date_published": 1471235879.467,
			"body": "I've seen a dream, that I would like to remember, and not shy enough to not share. So the blog will do.\n\nI've woken up somewhere in a wooden house, probaby in the country. My friend is there. Also 2 other people - friends of my friend. One I've seen before, another - not.\n\nI'm awaken by my friend. She told me something, told me who has arrived while was asleep? I welcomed her with a smile, since we don't usually touch each other. A friend of her that I know I welcomed in my dream with \"Yea, I saw you there...\", and thinking \"..wish I have not.\" And she went into the background, almost disappearing in it. Person I liked, then was nothing but an imprint on the background of my story. Would she return? To what end?\n\nThere is another one to great. I see her, in a second (as usually) I size her up. Not my type.. Who is?.. In 5 seconds (as usually) I know just how much of her is needed in my life. But this time I'm tired. Too tired to play any strategy. So I just tell her that in the morning the only thing I miss is a hug. No hints, no secrecy. Plain-text, no encoding, for all around to read.\n\nCompatibility test is passed - she hugs me and kisses me in the cheek. I hug her, but kiss her in the neck and the nose. She is startled, but don't blush. The reaction I needed most.\n\n_I had to make a pause, and details of the dream are fading  away. I turn the music on. Louder. Making sort of a locator out of it. Music distrupts my attention from the road and people, but being too loud it does not attract me. So I burrow deeper into my mind, in a search for a lost dream._\n\nThe following week, I get from my job earlier in an attempt to meet her more often. That angers my boss (mom). She makes it harder and harder for me to go early. Now I have a real reason to call her a \"bossy bitch\".\n\nOne day I am unable to finish my work in time  and go to meet the girl anyway. Mother is angry, but I make it a point that there is no way she can stop me. Not only I'm stubborn, I also don't like to deal with other stubborn people. When a conflict is inavoidable, I'd rather let her detonate, than keep trying to please her. In the end, I'd rather be with a wife, than with a mother.\n\nThe last glance, the last touch, the last talk. I enjoy every second. I won't be remembering the words when I wake up, but I will remember the warmth and comfort I felt. I won't remember what she looked like, but I will remember what I felt when I was looking at her. So well that I will be able to reconstruct her face. That is the reason I touch her lips, that is the reason I smell her hair, that is the reason I hold her hand.\n\nMother will find a way to stop me. She will wake me up. \"Get up! We are in a hurry!\" She won't know why I will welcome her with anger. She won't care. Good. There will be a rainy day.\n\nGood morning, ZeroNet. Musickiller is on the line."
		},
		{
			"post_id": 226,
			"title": "Lost and Found",
			"date_published": 1470530655.636,
			"body": "Today I thought I've lost my phone. Realisation that someone might get access to my email (means \"all my accounts without double authorisation\"), and my browser (all open accounts and some saved passwords) made me feel uneasy.\n\nToday was a day when I thought \"hey! Any half-lame hacker can read my key files only because they are stored on 4 unencrypted devices, on 3 different platforms!\" So I've encrypted my tablet and made plans of encrypting my notebook and (may be) computer. PC's HD is ticking like a bomb already, so quite soon no one will be  able to read that data =D\n\nSo imagine how have I felt when exactly today I could not find my phone. Ofcourse I've revoked all authrisation that I could and changed some passwords, and then found the phone... But the feeling I still remember.\n\nSo as soon as I found it, I've locked it with a password. Can't encrypt it, but password will be enough, since there are no key-files there.\n\nSo today... ugh... Yesterday I've stepped into the world where the source I can trust most is my own head. I've also discovered that I remember almost all passwords that I make. Cool. All I had to do was to make it a high priority information and my head has stored it safe.\n\nBut some things are unclear to me. And if you are still reading it, I would appreciate some comments. How does encryption help, if as soon as I decrypt the drive, anyone from outside can read the data just as easy as he would have if the data was unencrypted? Or drive encryption actually helps even when one person has decoded it? And if it is so on linux, is it the same way on android or linux? You can just send places where I can read about it myself, if you don't want to write about it yourself...\n\nGood night, people of ZeroNet. Don't loose your phones. And your heads too."
		},
		{
			"post_id": 225,
			"title": "Mass Storage Project",
			"date_published": 1470521014.636,
			"body": "Again I fund inspiration while talking to KS... This time I have just thought that keybase is too dependant on trust, since it's server-based...\n\nRead. Tell me where I'm wrong. Or why have no one done it yet?!\n\n---\n\n---\n\n#Introdiction\nI think that the best storage project would be a distributed web of people that gain credits for storing files of other people and use them for storing their own files.\n\n_I have to check all of this a couple of times, and I'll refine my thoughts in some time. Please don't judge too harsh now. But still I do need critics._\n\n#Old Stuff\n_I'll rewrite it later. Sorry to leave it this way((_\n\n~~You give 4 GB of space to store someone's data for 30 days and get 120 credits. If you cancel the deal, you loose all 120 credits. You have to be active for at least 3-6 hours every day or you'll loose credits.~~\n\n_this parts looked most stupid, so I've wrote about money and credits in the end of this post. But I have to save this stuff too, since if I delete it, I might forget some parts of this concept_\n\n~~You can give 120 credits to store 1 GB of data for 30 days on 4 computers on the network, or 512 MB on 8 computers (depending on how much redundancy do you need).~~\n\nAnd ofcourse it would have all those PGP and sharing from keybase, blah-blah-blah...\n\nThere should be a blockchain for the currency (and may be PC names? Yea. don't trust IP!)...\n\nis that so hard to do? Why do people still use servers to store data???\n\n~~And see how cool it is: you just give 40 GB for a day, download the data, check it, get your 40 credits store 200 MB of documents for 20 days on 10 computers and the next day you can delete that 40 GB of trash and live freely, knowing that your info is secure!~~\n\nHowever, it's gonna be a very slow system. You'll need to wait while people will upload their data into your PC, then wait for HOURS while your stored data is offline (even 10 PCs won't be online 24/7, what if you stored your data on 3 PCs?).\n\nAnd also who said that you'll have all your 40 GB filled at once? Most probably that means that the credit system should be reworked, or smth... But anyway, the idea is good, I know it!\n\n#NEW Stuff!\n#Money and Credits\n\n_I have been thinking more about this topic and have fixed price is not a good idea. Look how I think it might actually work:_\n\n## Data Lenders\nLet's imagine that the system is running already for some time (5-10 months) and there are already enough people in it. When somebody new comes to the system, he gets an account (in the blockchain), and he buys some credits from people that want money for their work. On some board (NXT-like or non-blockchain-at-all) he sets maximum price and how many computers he wants his data to be stored on all the time. As soon as he finds enough Offers, his data is uploaded and stored. I'm not yet shure when exactly credits should be transfered, but let's go further.\n\n##Data Holders\nThis time let's imagine someone that has space on his drives, and wants to earn some money from it (why keep your TB drives empty, when they can bring at least some money?) The guy goes into the network, sets up an account and sets how much space he can offer, for how long, how often he will be online (maximum) every day (evey week?), and how much miminal price for his services is. When a client finds him (automagicly), data is transfered into his drives. Every day he has to be online for a quota his client has set up. I suppose, that this should be checked by Forgers(?). An analogy with NXT, but here this guys will also check who's online, make searchable tables for Clients and some other dirty work. I suppose that if a Forger will have to send a thousand pings and a new block would be made every 10 minutes, and Data Holders would only need to answer to 1 ping every hour, the system will work well.\n\n_I have only wanted to write about monetary system here, but I'm being carried away somewhere, where I've not been thinking about yet. Gotta go to bed, it's 3:30 here already =(_\n\nSorry, no time to write. look at MaidSafe."
		},
		{
			"post_id": 224,
			"title": "Wanna have another reason to leave Russia?",
			"date_published": 1470487698.764,
			"body": "<a target='_BLANK' href='https://ipfs.pics/QmRJ6uswBF8nqZHijGvG8hwwSMoZHvLNJMNkTYGtt9H3bB'><img src='https://ipfs.pics/ipfs/QmRJ6uswBF8nqZHijGvG8hwwSMoZHvLNJMNkTYGtt9H3bB'/></a>"
		},
		{
			"post_id": 223,
			"title": "I think I've broken something >.<",
			"date_published": 1470487583.893,
			"body": "<a target='_BLANK' href='https://ipfs.pics/QmbvRBdE1u9XTDFYvzubT8XDX7tXhCc6Sti2KuMogGPfWT'><img src='https://ipfs.pics/ipfs/QmbvRBdE1u9XTDFYvzubT8XDX7tXhCc6Sti2KuMogGPfWT'/></a>"
		},
		{
			"post_id": 222,
			"title": "Brain Freeze",
			"date_published": 1470432883.565,
			"body": "Listening to some old songs that I've heared last time years ago. I feel unity with the world."
		},
		{
			"post_id": 221,
			"title": "Bathroom Prayer",
			"date_published": 1470431147.717,
			"body": "Water, Mother of All, heal my wounds: of flesh and soul. Wash away my sorrow and anger. Make my thoughts clean and fresh. Make me calm and still, let only your waves shape my moods.\nFill me with Life and Love once again. Bring me energy of wast oceans you came from. Like your river, lead me into the brighter day.\nAnd then leave me in peace, so that we could flow together once again. And also always stay with me, keeping me saturated with better dreams."
		},
		{
			"post_id": 220,
			"title": "A Song to Morpheus",
			"date_published": 1470429486.229,
			"body": "My cat was running around the house, probably trying to get away from his own shadow. I've been sitting near the window, breathing in last rays of the setting sun, thinking. Something deep came into my head and under heavy emotional blow, I've started singing quiletly. Cat has stopped near me on his next circle, laid down at once, washed his fur and is sleeping now. Nice...\n\nHowever, he washed himself for too long - he'll have to sleep with Kitchen Record's music. My voice is down for maintenance...\n\nP.S. Sorry, no spellcheck this time too. Not in a mood to fuck my brain over a couple of typos..."
		},
		{
			"post_id": 219,
			"title": "Blog adjustments",
			"date_published": 1470309976,
			"body": "I'm thinking of posting some pictures in the blog without ipfs.pics (just wanna try what's gonna happen), so I need to know how to make some folder \"unnecessary\".\n\nAnyone done that?"
		},
		{
			"post_id": 218,
			"title": "RSSex",
			"date_published": 1470221786.605,
			"body": "Do you use RSS? How? Where?"
		},
		{
			"post_id": 217,
			"title": "FFFFFfffffire foxxxxxx",
			"date_published": 1470221322.906,
			"body": "I hate Firefox Mobile keyboard lag. Press \"backspace\" for a couple of seconds and the cursor deletes stuff for at least 3 times longer. It sucks so much.. And I don't wanna use opera with ZeroNet for security reasons."
		},
		{
			"post_id": 216,
			"title": "Gray Net Project",
			"date_published": 1470216634.639,
			"body": "As an alternative to OCB, I have something else in mind.\n\nI can save web pages and upload them to ZN, as page.com.bit.\n\nStupid and tiresome idea, but I'm so tired of waiting for the same page to download everyday at my work, and just saving it, is selfish. Sharing saved data - is the good I can do.\n\nPlus Namecoin is still very cheap and by using it, I will both rise it's value and give money to miners, wich is good.\n\nEdit: wish I had time for it =D"
		},
		{
			"post_id": 215,
			"title": "Offline Clearnet Browser Concept",
			"date_published": 1470215765.792,
			"body": "From my reply to KS today.\n\nHey! I've got an idea of a very useful app for mobile devices: A browser that downloads and updates web pages only on a fast and reliable connection. Cool for reading. You can just browse things that you have already downloaded, ando things that you did not, will be loaded as soon as you connect to your home wi-fi! (or any other network you specify, or just as soon as some connection will be established, dependidng on what do you need.)\n\nBesides, the app would updaete existing pages with specified freaquency, so even reading newspages will be possible.\n\nIf that's not enough, I see an adaptation of p2p technology here: devices would be able to share sites without internet connection. ofcourse, if a user trusts the source, since I don't see any way to check if the site is legit."
		},
		{
			"post_id": 214,
			"title": "Hammerdwarf",
			"date_published": 1470134575.884,
			"body": "I wish you'd know, just how many IT problems are solved by just hammering the button over and over again.\n\nIt should work, but it doesn't? Hammer Time!\n\nThis time it was \"sign\" button in the side pannel."
		},
		{
			"post_id": 213,
			"title": "Sorry",
			"date_published": 1470128245.57,
			"body": "To those, who wrote me:\n\n1. I'm sorry, for not reading my ZeroMail earlier.\n2. I can't answer there. See id/musickiller on namecoin for my contact info.\n3. Don't be in a hurry to call me a positive person. Mostly I just hide my emotions. I'm pretty much of an \"Emo\". A very crazy sort of one, that laughs instead of crying. (Joking, but it's not far from the truth.)\n4. I can keep secrets like dead, just make sure you enclose it in <secret>...</secret>, or Secret { ... }, so that I knew whatv exactly I should not talk about. (Another puny attempt at joking, but again, there is more truth here, than there is in most of my posts.)\n5. Currently I'm reading Bitmessage from time to time, you can fetch my address from Namecoin (musickiller), or write on my ZeroMail and pray that I read that. (I do read it now, that I've GNURoot on my tablet again)."
		},
		{
			"post_id": 212,
			"title": "ZeroBug",
			"date_published": 1470054798.351,
			"body": "1. ZeroMail's \"send\" button does not work on mobile devices anymore. Tested on Opera and IceCat (GNU Firefox).\n2. Markdown and HTML tags don't work on blog post headers.\n\nPlease share this bugs if you have time. I don't."
		},
		{
			"post_id": 211,
			"title": "Total Overdose",
			"date_published": 1469867480.12,
			"body": "Having both bitmessage and ZN running in the background is bad. Unlike Termux, GNURoot handles cryptography quite bad. Youtube does not want to play well. Battery is degrading too fast.\n\nBut I'm still interested in running other apps here... May be not Namecoin... It's stupid. May be get some X up and running and try some non console apps? Games??)))) Could be fun.\n\nBut I'm not sure it's worth it. Time is money. And I don't earn that much..."
		},
		{
			"post_id": 210,
			"title": "X_X",
			"date_published": 1469821960.339,
			"body": "<img src=\"https://ipfs.pics/QmX7kaVEhDk99FTr1tZAt4HBSNcScM7CGseu9UxbMgFRhB\">\n\nI saw that ladder (without little people) all the time, in many pics, but I've never thought that it's not only infinitely high, it's also deep, since not only you can always go up, you can also go down!"
		},
		{
			"post_id": 209,
			"title": "Suck it.",
			"date_published": 1469821169.887,
			"body": "They didn't list Android as a supported platform.\n\nI didn't read the list.\n\n<a target='_BLANK' href='https://ipfs.pics/QmQ3EnRM8sGahKERKtFKwbF5TxohU3mbCUe36D5ohMvGm7'><img src='https://ipfs.pics/ipfs/QmQ3EnRM8sGahKERKtFKwbF5TxohU3mbCUe36D5ohMvGm7'/></a>\n\nNow a good idea is to write some web gui got Bitmessage API."
		},
		{
			"post_id": 208,
			"title": "Revived again!",
			"date_published": 1469790165.58,
			"body": "I've installed GNURoot Debian, since Termux was already over 1GB and growing (that's without ZN). And I have my Blog on my tablet again! Can post here more often! ^_^"
		},
		{
			"post_id": 207,
			"title": "BM + NC",
			"date_published": 1469050269.505,
			"body": "How do I use Bitmessage with Namecoin? I mean, how do I make my adresses readable?\n\n\n---\n\nI saw that DNS thing... But it's not what I'm searching.\nhttps://bitmessage.org/forum/index.php?topic=3281.0\n\nI thought it's possible to make a Namecoin name and while someone is running NMControl with Namecoin and Bitmessage, it's possible to use Names instead of addresses...\n\nIS it possible?"
		},
		{
			"post_id": 206,
			"title": "404",
			"date_published": 1469045535.081,
			"body": "no. not into blog. sorry. this part of me won't be here. private."
		},
		{
			"post_id": 205,
			"title": "Spine ache",
			"date_published": 1468543308.876,
			"body": "Does your spine ache? What do you do to stop it? Less sitting before the monitor is not an option by the way ;)"
		},
		{
			"post_id": 204,
			"title": "I know the future",
			"date_published": 1468543133.785,
			"body": "Less than a month after I wrote about using html for text formatting and you told me to use Markdown or LaTeX, a teacher from university told us to learn LaTeX.\n\nI knew that. I've felt it!"
		},
		{
			"post_id": 203,
			"title": "Bitmessage as a microblog",
			"date_published": 1468420666.368,
			"body": "I've discovered this feature in BitMessage.\n\nAnd I've got a question: Why do we need a microblog here, if it's quite easy to use BitMessage as a microblog?\n\nDoes anyone do that? I think it's a great idea!))"
		},
		{
			"post_id": 202,
			"title": "Mobile ZeroNet",
			"date_published": 1468414392.441,
			"body": "Since I had to delete ZN from my tablet, at least once in a week, I think \"let's write/read something in ZN. Where is my tablet? Ah, darn it, I've no ZN here!\"\n\nSo I've discovered that for me ZN was **much** more comfortable when it was on my tablet than when it is on my PCs."
		},
		{
			"post_id": 200,
			"title": "Shadow of the Hegemon",
			"date_published": 1467890163.095,
			"body": "\"Let me tell you something, Julian Delphiki. You didn't have a mother and father, so you need to be told. You know what I dread most? That Peter will pursue these ambitions of his so relentlessly that he'll never have a life.\"\n\n\"Conquering the world isn't a life?\" asked Bean.\n\n\"Alexander the Great,\" said Mrs. Wiggin. \"He haunts my nightmares for Peter. All his conquests, his victories, his grand achievements-they were the acts of an adolescent boy. By the time he got around to marrying, to having a child, it was too late. He died in the midst of it. And he probably wouldn't have done a very good job of it either. He was already too powerful before he even tried to find love. That's what I fear for Peter.\"\n\n\"Love? That's what this all comes down to?\"\n\n\"No, not just love. I'm talking about the cycle of life. I'm talking about finding some alien creature and deciding to marry her and stay with her forever, no matter whether you even like each other or not a few years down the road. And why will you do this? So you can make babies together, and try to keep them alive and teach them what they need to know so that someday they'll have babies, and keep the whole thing going. And you'll never draw a secure breath until you have grandchildren, a double handful of them, because then you know that your line won't die out, your influence will continue. Selfish, isn't it? Only it's not selfish, it's what life is for. It's the only thing that brings happiness, ever, to anyone. All the other things-victories, achievements, honors, causes-they bring only momentary flashes of pleasure. But binding yourself to another person and to the children you make together, that's life. And you can't do it if your life is centered on your ambitions. You'll never be happy. It will never be enough, even if you rule the world.\"\n\n\"Are you telling me? Or telling Peter?\" asked Bean.\n\n\"I'm telling you what I truly want for Peter,\" said Mrs. Wiggin. \"But if you're a tenth as smart as you think you are, you'll get that for yourself. Or you'll never have real joy in this life.\"\n\n\"Excuse me if I'm missing something here,\" said Bean, \"but as far as I can tell, marrying and having children has brought you nothing but grief You've lost Ender, you've lost Valentine, and you spent your life pissed off at Peter or fretting about him.\"\n\n\"Yes,\" she said. \"Now you're getting it.\"\n\n\"Where's the joy? That's what I'm not getting.\"\n\n\"The grief is the joy,\" said Mrs. Wiggin. \"I have someone to grieve for. Whom do you have?\"\n\nSuch was the intensity of their conversation that Bean had no barrier in place to block what she said. It stirred something inside him. All the memories of people that he'd loved--despite the fact that he refused to love anyone. Poke. Nikolai. Sister Carlotta. Ender. His parents, when he finally met them. \"I have someone to grieve for,\" said Bean.\n\n\"You think you do,\" said Mrs. Wiggin. \"Everyone thinks they do, until they take a child into their heart. Only then do you know what it is to be a hostage to love. To have someone else's life matter more than your own.\"\n\n\"Maybe I know more than you think,\" said Bean.\n\n\"Maybe you know nothing at all,\" said Mrs. Wiggin.\n\nThey faced each other across the table, a loud silence between them. Bean wasn't even sure they'd been quarreling. Despite the heat of their exchange, he couldn't help but feel that he'd just been given a strong dose of the faith that she and her husband shared with each other.\n\nOr maybe it really was objective truth, and he simply couldn't grasp it because he wasn't married.\n\nhttp://www.rulit.me/books/shadow-of-the-hegemon-read-69121-34.html"
		},
		{
			"post_id": 199,
			"title": "o_O",
			"date_published": 1467841453.171,
			"body": "No they really don't shake! how??"
		},
		{
			"post_id": 198,
			"title": "Down the deepest chasm lies my sorrow.",
			"date_published": 1467839784.639,
			"body": "I've hidden my emotions so deep that my hands stopped shaking. They were doing that for at least 5 years. I should be glad, but if I let myself be glad, I'll fall into some depressive mood before I even smile. Funny, huh?\n\nLet's just see what tomorrow brings us, shall we? I bet that even a book that I'm about to continue listening to, will break my defenses. I've become too emotional through past few months. Even by my own standards.\n\nHowever, I want to write about it before I forget it.\n\nIt has happened very fast. I remember seeing a word combination that promised bad news. My brain has only started to assemble the sentence, when my stomach had already decided to make me throw up. By the time I have read \"I'm sorry if I made you feel bad\" I was thinking only about running to a toilet before my nervous system makes me roll on the floor in a convulsion, throwing up my dinner.\n\nBut instead, in an eye blink, everything stopped. I was not even worried. I've opened a discussion, read the message that should have \"make me feel bad\", replied, talked more, and more, then closed it. With no feelings. Gone to a bath tub. Meditated for an hour. Nothing.\n\nOnly when I was writing to my sister, I had felt a rage of emotion deep under the calmness. But it was too easy to suppress. Like a bug that you stomp simply because it's less trouble dead than alive.\n\nI think yesterday I will have to face it all. But thank God, today I can sleep."
		},
		{
			"post_id": 197,
			"title": "Hmm....",
			"date_published": 1467314741.336,
			"body": "Bad news: even though I thought that I would write something here yesterday or today, I did not.\n\nGood news: I did not write anything stupid! Yet..."
		},
		{
			"post_id": 196,
			"title": "One Love",
			"date_published": 1467062063.359,
			"body": "Antibiotics started to work today. My body is surrendering to the unforgiving medicine. The Salvation. The Exterminatus. Both in a single injection.\n\nAs you can guess from the post name, the content was different at the beginning. But it was too personal. The Keep will save it untill the sound of those words will no longer make me tremble."
		},
		{
			"post_id": 195,
			"title": "No one around",
			"date_published": 1467062005.302,
			"body": "What's happened? Where's everyone? When I don't feel like anyone's reading, I start to share stuff with those I want to be reading. So instead of techie crap, there is phylosophy. Not like it's making my blog better or worse... Just wanna talk with someone. And when there is no one smarter than me, it's a crazy talking I enjoy - a company of myself.\n\nHowever I'm under another antibiotics, so don't expect me to write even \"fine\" now. Expect crazy, half smart and half stupid talk. Like it - good. Don't like it - don't read it. NOW I don't wanna know if you don't like what I'm writing. Now I just write stuff for trashing stuff from my overloaded head.\n\nThanks for attention anyway."
		},
		{
			"post_id": 194,
			"title": "Log",
			"date_published": 1467061776.185,
			"body": "It was a good idea to put here the date when I got ill. Now I see exactly how long I've been \"out of action\" =) 18 days and counting. 2 weeks and 4 days... Felt like 3 weeks. And like 100 weeks. And like a moment. Sadly I can't feel time. Gladly too."
		},
		{
			"post_id": 193,
			"title": "Ill",
			"date_published": 1465548388.325,
			"body": "Yesterday I had an hour of walking under the rain, with no umbrella and no hat. My jacket was wet inside out, when the rain stopped. \n\nAt first, I thought I'm gonna be more or less fine, even when this morning I had no voice at all. But now I'm sure that something bad is coming. I've just felt a desire to make a compliment to a random person. It may sound stupid to you, but to me it's one of the worst signs. My body wants to dump the genetic material in case of serious illness.\n\nAnd I need to be 100% fine in a week!\n\nShit. I WILL be fine in a week!! All I need is a couple of words from any person I wanna meet and my body will fix itself. Bad news? I don't think any of my sisters want to meet me in a week, so that limits me to only one person.\n\nLife is FUN.\n\nI'm gonna try writing less until I feel better, so that no crazy shit appear in my blog... 38 degree Celsius makes my brain melt."
		},
		{
			"post_id": 192,
			"title": "Next book ^_^",
			"date_published": 1465406604.271,
			"body": "-\"...Ound... Round!.. Ground!!! I wonder if it wanna be friends with me!\"\nThe Hitchhiker's Guide to the Galaxy"
		},
		{
			"post_id": 191,
			"title": "#nowplaying",
			"date_published": 1465381643.247,
			"body": "\"It's strange when my home -\nIs not you, but just a room.\"\n\nA cut from: \"Мелани\" by Ассаи.\nTranslation: me."
		},
		{
			"post_id": 190,
			"title": "Freedom is emptiness",
			"date_published": 1465295975.828,
			"body": "Another person is as empathic, as a stone. Or does she want to seem that way?\n\n<font color=\"gray\" size=\"3\">Redacted 08.06.16 10:54</font>\n<br />\n<font color=\"white\">Sometimes I forget that people don't see. Don't feel. Don't love.\n\nAm I sad because I feel mistreated, or because I can't show?</font>"
		},
		{
			"post_id": 188,
			"title": "\"Cancel changes\" button",
			"date_published": 1465281374.797,
			"body": "Don't you feel no need in a \"cancel changes\" button near \"sign and publish\" one?\n\nThe reason it is not there seem to be that you save all the changes when you press \"save\" button, and nobody thought that it is not a real change before it is signed.\n\nWhat if I don't want to publish several changes I've made? What if I've pressed \"save\" only to leave editing mode? Currently, I have to go to a side panel and press \"update\" button, to receive an older version of my files from my peers. But it's not very comfortable. A small \"Delete changes\" button (that would do exactly the same thing) near \"Sing and publish\" button would be much better.\n\nWhat do you think?)))\n\nP.S. I've decided that it's more important to post stuff from my head, than check it for mistakes and typos. So I've made several unchecked posts. Not sorry about that, because when it comes to writing down stuff from my head, it's better to be in a hurry writing it, before a thought expires and goes away..."
		},
		{
			"post_id": 186,
			"title": "To my Twister Band",
			"date_published": 1465281249.781,
			"body": "How are you guys? Where are you if not on ZeroNet? Don't see no new posts, no comments =("
		},
		{
			"post_id": 185,
			"title": "Speaker for the Dead",
			"date_published": 1465281103.696,
			"body": "I recomend reading/listening to this book at least once, but only after the Ender's Game.\n\nThis one is great too."
		},
		{
			"post_id": 184,
			"title": "Not so global",
			"date_published": 1464943029.991,
			"body": "I've got an idea, how to control my PC with a tablet, without connecting from the tablet.\n\nObviously, if PC can only handle outgoing connections, it **has** to establish them. But there is another option. PC can not go online by receiving a signal, but if the signal was received as local, but came from an already established global connection, it would be just the same!\n\nThe problem is that I don't remember the name of that app that made it possible - to make a global connection look as local..."
		},
		{
			"post_id": 183,
			"title": "Domb",
			"date_published": 1464942794.76,
			"body": "Playing dumb is much like using a nuclear weapon. It has great results, but terrible consequences.\n\nQuote me on that if you like ;P"
		},
		{
			"post_id": 182,
			"title": "Ender's Game",
			"date_published": 1464903512.617,
			"body": "Listening to an audiobook called \"Ender's Game\".\n\nTry this one if you have not done it already. Can give you a Sync link or copy the folder and share it with Librevault if you want to use opensource =D"
		},
		{
			"post_id": 181,
			"title": "Where iz my PC???",
			"date_published": 1464847100.896,
			"body": "Still can't figure out, how to access my PC from the internet. Currently, I'm almost certain that my provider caused that. Bitches.\n\nToday tried it with ssh. Result is the same as usually - timed out.\n\nHave to try forwarding port 22, but I already know what will I get.\n\nIf you are reading this, please answer, can internet provider block incoming connections? Why on earth would they do that?\n\nMy network setup: notebook > Wi-Fi router > provider > internet\n\nHowever, let's not make it a mistery of the year. It's also \"cheap notebook > cheap router > cheap provider > no incoming connections\", so ANY part of the chain can be the traitor, for obvious reasons =)\n\nToday I've made some progress. It appears that my notebook did not use IPv6. Changed. But too late. All other settings are done with an idea in mind, that IPv6 I only have locally."
		},
		{
			"post_id": 180,
			"title": "Ghosts are not around us.",
			"date_published": 1464821050.907,
			"body": "...they are inside our heads.\n\nCaught myself speaking to an imagined copy of a girl from Latvia I once knew. She has appeared before me, silently looking at me, as if I have done something wrong.\n\nI said that I was sorry, but she did not have to play the game. Shooters have rude nature, don't expect people to do nice things there. It's hard to do something nice when you hold a gun and being shot at. Plus I wanted my team to be the best.\n\nI think if I have not thought it was too much (to speak to ghosts), I would also have said that I'm sorry for how we ended our friendship... But hey... she's just a memory. If she can't be in peace within my head, I can erase her... can't I?\n\nTo remember everyone. What a burden!.."
		},
		{
			"post_id": 178,
			"title": "Sync",
			"date_published": 1464562886.816,
			"body": "Nice usage of btsync =D\n\nhttp://127.0.0.1:43110/1Pwzdn1XKFwfhW9nzMywvhjsCxx8KsFh7a/"
		},
		{
			"post_id": 177,
			"title": "no_name",
			"date_published": 1464562280.804,
			"body": "не испортил, а преукрасил повседневность яркостью извращенского мировоззрения. можешь меня цитировать."
		},
		{
			"post_id": 174,
			"title": "A Day to Forget. A Day to Remember.",
			"date_published": 1464026133.391,
			"body": "Me: Wake up to see a nightmare Skeleton, with his hand on my throat. To feel suffocation. Death.\nLife: \"Good morning, bitch.\"\n\nMe: Go to the university only to see EVERYONE to pass an exam. Everyone but my group.\nLife: \"Have a nice day, ass-hole!\"\n\nMe: Still happy all day, because the evening WILL be good. I... **I** will make it so!!!\n\nMe: waste the evening.\nLife: \"Sucker.\"\n\nMe: Going back to a home I hate so much. Shaking. Trying not to get angry. Trying hard. Very hard.\nLife: \"5, 4, 3, ...\"\n\nHold on, MK. It's gonna be good some day.\n\nAh just GREAT! A tooth has started to ache. Fuck... Out of water. Nothing to clean a tooth with. Fuck. Why today?(\n\nLife: \"... 2, 1, ...\"\n\nMe: \"Will at least smile with me on this shitty day? No one?\"\nLife: \"... Now.\"\n\n______\n\nShould have gone to bed earlier. My bad. I need to find a new way to block tears. The option that worked for so long is not there anymore.\nHowever...\n\nMe: gone to bed with a smile on my face and hopes for a better tomorrow.\n\nP.S. Still not using spellchecker. Sorry."
		},
		{
			"post_id": 173,
			"title": "No plans for the evening",
			"date_published": 1463851590.149,
			"body": "Wearing the last pair of contacts today and no plans for the evening. Wasted.\n\nTo be able to see and to have no desire to look. The day sucks. At least food was nice. \n\nMy body and brain are tired of worthless existence. The progress has stopped. A week more and the regress will start. I don't want to.\n\nI've been shown a glance at the world. And now it all fades like an old memory (if my memories ever faded).\n\nI feel a growing urge to act. I need to find an inspiration.\n\nI have a feeling. As if something is missing. Has anyone seen my heart?"
		},
		{
			"post_id": 172,
			"title": "Offline",
			"date_published": 1463658806.62,
			"body": "<font color=\"gray\">19.05.16 14:55</font>\nA downside of browsing ZeroNet offline is that people usually send links to clearnet whenever they are comfortable. But ZeroNet won't grow if you just post Clearnet links here!\n\nAnd yes, it sucks to remember that you are offline when you click on a link to something interesting..."
		},
		{
			"post_id": 170,
			"title": "Fuck.",
			"date_published": 1463480784.794,
			"body": "Well... I knew it would be a bad day.\n\nTell me, elders, do all good things end?"
		},
		{
			"post_id": 169,
			"title": "Fuck up again.",
			"date_published": 1463459426.335,
			"body": "I told myself not to send a message to a girl at 7 am. Told many times. I've decided to write it down in the messenger and send later, but when I've finished it, I've pressed the button \"send\".\n\nWant to fuck up? Ask me how!\n\nAnd that's when I wanted to say sorry for another fuckup. I'm a mess..."
		},
		{
			"post_id": 167,
			"title": "Философия",
			"date_published": 1463400485.1,
			"body": "I have decided to publish my core ideas about Happines and Love. I have nurtured them in my brain for a while now, and I think it's time to discuss this topics with the world =)\n\nI think I will not be able to write it nice all at once, so there will be 2 posts with \"under construction\" mark. You can comment while I write, so that I correct myself and have a better result. Don't worry, I'm solid on those 2 topics, and even if like your comment, it will take me years to process it and agree if it was not in my head already.\n\nIt's not how I think it should be, it's how I feel about it. My head inside out.\n\nedit. 17.05.16 7:34\nIt will take me some time, and time I don't have now. May be later.\nSome other topics like pain and fear I will add after that. I want to describe what's sitting in my head. Mostly to myself: writing it down will help."
		},
		{
			"post_id": 166,
			"title": "Ver iz dat Fak?",
			"date_published": 1463398937.131,
			"body": "I once came to university at saturday in time and said \"who is late now?! Where is that motherfucker?!\"\n\nNo, he was not behind me, he was 5 meters in front of me, I just have a bad eyesight...\n\nIt was fun) I should start a blog with fun moments from my university. MAI is a circus..."
		},
		{
			"post_id": 165,
			"title": "Politology",
			"date_published": 1463391355.431,
			"body": "I'm 1.5 hours early today. Sucks. I have wanted to go on a lab. work, but I came too early and sitting on a politology instead. Should have watched porn instead. Forgot my phone so don't have internet =(\n\nMay be I should watch porn on the politology? Should be fun...\n\nedit: 13:23\nI've tried, I've really tried to listen to this shit. But when he started that \"song\" about \"Bad America\", I've decided to watch something about love instead. Fuck the war. Literally. By the way, I'm sitting right in front of the guy. Yes. Gonna be fun."
		},
		{
			"post_id": 164,
			"title": "I'm eating a full meal at 2:44",
			"date_published": 1463183029.81,
			"body": "And don't gain weight.\n\nEnvy me."
		},
		{
			"post_id": 163,
			"title": "HTML as an alternative to .doc and .rtf",
			"date_published": 1463135668.76,
			"body": "I was thinking... What if I write something in a .txt file and want to underline or cross some text? Or make it bold or italic? But I don't want to use office shit, and I want the file to be able to view the file on ANY PC with no need to install stuff or to wait minutes till my old notebook loads some Office 15 or smth like that.\n\nI can use HTML tags! Just like that. A plain text, but I write `<b>bold text</b>` and get <b>bold text</b>. Easy! Then I just rename it to .html instead of .txt and view it in any browser I want. Want to edit? Just press \"edit\" in context menu or open it in any editor I want!\n\nBut it's not enough. My brain wanted to go further. So let's think of it: I can do in html most stuff I can do in Word or Writer! Images, fonts, several columns/rows of text on tbe page - anything!\n\n#Why is it cool?\n- edit in any text editor - no need to wait until your Word loads to view a footnote\n- complexity depends on your demands - you can just have a simple text file with some underlined/italic text, or you can make a nice page with fonts, paragraphs, proper tags (`<html><body>`)\n- language is simple and useful. Long live HTML!\n- multimedia. Can you add music and video in any office pack so that it could be opened on ANY device worldwide? In HTML 5 you can! With a simple tag.\n\n\n#Questions:\nWhat to do with formulas? Most office packs now provide a writer with formula support. I don't know any substitution here. Any help?\n\nWhat other stuff you usually need in Word that you can't do in HTML?\n\n# Comments summary\n@ks: it's hard to read raw files!\n@mk: no."
		},
		{
			"post_id": 161,
			"title": "=^_^=",
			"date_published": 1463005663.284,
			"body": "Sometimes I stare at photos/profile pics of ppl for a long time while talking to them in my head. Helps when there is not enough chat with someone.\n\nSometimes I just look. With no thoughts. It's when I miss someone. \n\nGood night, stranger."
		},
		{
			"post_id": 160,
			"title": "Summary of last weeks and future plans",
			"date_published": 1462947771.96,
			"body": "Caution, my lovely grammar-nazi, I don't use spell-checker now and my grammar suck just as much as my cautiousness ( < here lies the first word I've checked) about typos.\n\nSince my PC is still off and the only thing my notebook does is downloading/sharing some porn and kids' cartoons, I don't have any computer-like topic to write about. I wanted to write \"sorry\" here, but guys, seriously? For once in this year I have something to do besides sitting before a computer screen! I'm not sorry about it for damn sure! Sometimes I think, that programming is something I do when my friends say \"There is too much of you in my life\". **But**(!) I'll try to summ up here everything I can.\n\n#PC World\n##ZeroNet\n\n- I am still here\n- (On touch-screens) Now it's impossible to switch to ZeroHello with a Zero button in the corner, but possible to drag it and open a menu. OK.\n- tablet rules, because I have ZeroNet whenever I want it. Awesome. Double-avesome when I want to say \"Hey! Do you know what ZeroNet is? Look at that!\" And I don't have to show screenshots or describe how good it works, just show. I can even give the guy to check it on his own. I like that.\n- Yes, with ZN my tablet lives not as long as usually.\n\n##Time&Plans\n- Don't have it\n- Won't have it any time soon\n\n##Stuff\n- notebook serves me as a server. It has Sync, and ZeroNet, and qBitTorrent 24/7. Neat. And it's almost silent.\n\n#Real World\n##Cat\nIt's good to start with a cat, is it not?\n- It's still fat...\n- ...but became a little bit more angry. Now it's a little bit of skin on my palm that is missing and I think there will be a scar. Fluffy red fury...\n- But it still respects me like I'm his elder brother, sometimes it's trying to fight me, sometimes he sleeps on my arms (I'm still the only one whos arms he likes to sleep on. Even just to lay on. it's awesome ^_^)\n- When there was a salut on 9'th of May, he was scared and I hepled him by holding him. It's the first time an animal is **less** afraid of something when I hold it. All my dogs and cats usually tried to scratch their way away from my hands.\n\n##Last Weekend\nIt was the most awesome time in my recent life. Friends, family, I love you all, you are great. Thank you. I want to write more, but I was asked not to do that in order to evade unnecessary ( < here is a second word I've checked) questons.\n\n##My brain...\n...is ok. I'm ready for new stuff again. And I can't wait to get some. =^_^=\n\n##My Sisters\n2 - We still don't talk. Nothing changed here. We just have nothing to talk about.\n3 - We don't talk because she thinks I'm stupid. And for once in our history, I agree with that. I will try to change it when I have some time.\n5 - We don't meet and this time I think I know why. Great.\n\nAll - still are among the most important people in my life. I don't think it will change it next 4 years.\n\n##My Emotions\nDon't ask. I was building a wall that protected me from horrors of this world and horrors of this world from me. Weekend's hide-and-seek with my Bro made this wall break. I feel everything. May be I like it. I'm not sure. I've missed this feeling - oh yes. But it is going to ruin me if not handled with care. Gonna play around more. Block it again if can't handle it.\n\nAs usually the only thing I'm sure - I'm not scared, if there is something coming, I'll jump right in the middle of it and do my best.\n\n##My Fears\n???????\n\nA week ago I thought I've conquered the last of them. Now when my emotions are free, I have to check those cages in the back.\n\n##My plans\n- Work. All free time. I need money. Never ever said that before, by the way.\n- Learn? I still have something to do at the university. I'm not sure if that is called \"learn\" or \"study\", or there is any other word but \"waste my time\", but I need to finish it. My duty. I feel that I will need that in the future. Means I will try to do my best here too. Or at least not to drop out of it.\n- Spend time with friends and family. \"How, if I spen all free time for work?\" you ask? Easy. I use \"free\" time for work. Not \"Friends and Family\" time =) I plan to spend more time on them actually. Since I will have money to do that.\n\n#Something to end this post\nThere is much I wanted to write, but I don't have time and I think it's for the best. Writing too much is a bad habbit I was trying to kill."
		},
		{
			"post_id": 157,
			"title": "A Line",
			"date_published": 1462870547.874,
			"body": "OK.\nI grow up.\nYou win."
		},
		{
			"post_id": 155,
			"title": "I'm Back!",
			"date_published": 1462816925.782,
			"body": "This odd feeling.. I don't have **time** to degrade! Steam, say bye-bye to my money, if you have not done it already! Bay12Games, I'll pay sooner or later, belive me. Let my beard be clean-shaved if I lie!\n\nMy brain is blown. So... **SO** much information! So many thoughts to recompile. I start to understand so many people... So **MANY**... <font color=\"white\" face=\"Arial\" size=\"4\"> Sleep helped to stop tears for some time. But I feel them coming back. Some hours before that happens, I have. Gonna try to do something useful. Then sleep again. My brain needs some more time to work... To pack all those thoughts and emothions to memory, before anything bad happens.\n\nI thank all people I have ever met before for making me strong. Tomorrow I will be OK. My brain can deal with it. Yes. It's just a good workout after some lazy times. Nothing I can't handle. But I will be running today. Like a hell-hound. Like a fucking hell hound.\n\nWhat has happened you ask? Don't. But I think that I can answer why my sister does not meet with me now. Damn, it looks simple now! The question of years seems simple. I have to try to solve it.\n\nTo the one who might think that has fucked my brain - no, it's ok. I'm always like that when deal with a big amount of new stuff. Some time and I will be ok. Better than ok. Better than I was.\n</font>\n\nGood bye now. Let all the luck there is, turn back to your foes. Ever.\n\nP.S. Sorry for typos and mistakes, I have tried to clean them, but no time to run spell-checker now."
		},
		{
			"post_id": 154,
			"title": "Cookie cleaner",
			"date_published": 1462276764.288,
			"body": "Do you know a simple free software cookie cleaner for firefox with white and black lists? There is no point in any privacy software if all cookies allow to identify me everywhere..."
		},
		{
			"post_id": 153,
			"title": "Fine Tuning of I2P",
			"date_published": 1462276497.265,
			"body": "I've decided to use 2+-1 hop tunnels, and 3+1 tunnels total for data and 2+-1 hops, 2+1 tunnels for \"Зондирующие туннели\" setting.\n\nLow privacy, but high speed is what I was aiming anyway.\n\nPlus randomisation must help here too."
		},
		{
			"post_id": 152,
			"title": "I do my part!",
			"date_published": 1462216799.369,
			"body": "Hey! I've got 500 KB of transit data in i2p today!\n\n03.05.16 13:52 MSK\nDuring night i2p transit became 2 MB. AWESOME!\n\nHowever my \"part of transit\" is still 0,00.\n\nBut my network is \"OK\", not \"Bocked by a firewall\"! ^_^\n\nWhat I did was checked \"Mobile computer\" setting on.\n\nIn Russian it is \"Режим мобильного компьютера: автоматически менять идентификатор маршрутизатора и UDP-порт после смены IP (экспериментальный режим)\".\n\nAnd I'm too lazy to change language and see how is it in English. And I don't have time for... Ouch... Time... FUCK!.. Gotta run. NOW!\n\n*Network is back to \"Blocked\""
		},
		{
			"post_id": 151,
			"title": "I2P : Errors in console",
			"date_published": 1462190857.709,
			"body": "CRIT  [Addressbook ] .naming.BlockfileNamingService: Failed to initialize database\nCRIT  [.postman.i2p] .i2ptunnel.I2PTunnelClientBase: Unable to build tunnels for the client, giving up\n\nAnd many more other errors... Yea, I guess that bugs may be a problem here too."
		},
		{
			"post_id": 150,
			"title": "BANG!",
			"date_published": 1462140537.87,
			"body": "I've just finished watching the last movie that I have not watched fully but wanted to. I feel a little bit more complete and in peace with my past.\n\nIt's a big moment for me, even though it sounds stupid. I have not even known names of some of those movies and it is a miracle I've found them!\n\nIt has started with \"Spirits Within\" being recorded on last minutes of a video tape with my cartoons, and every time I've watched them, I also wanted to watch the movie of which I saw only first 5 minutes. Thanks to television I was able to find the name of the movie and watch about 2 years ago. (it may be the only time I say \"thanks\" to television, so it's also a small big moment here)))\n\nThere was also that other cartoon, which name I've forgotten, I've seen only 15 minutes of it (had to go to music school then. One of reasons I hated it was that unwatched cartoon.) and wanted very much to see all of it. Found it this year. When I saw the name on torrent list (probably was searching for porn though, but it's not a big probability, since the movie is about space and future) I felt an **urge** to watch it even though there was a lot of different tasty names around. I've felt that I have to. And I did.\n\nThere were some others and today it was Men in Black 3. I've watched last 30 minutes of it on the TV and wanted to see all of it. Today my Godfather shown me first 10 minutes, I've remembered about it and watched it (finished several minutes ago).\n\nSo now there is a big part of my history that is finished. Complete. Done. I can move on. A small but important relief."
		},
		{
			"post_id": 149,
			"title": "IPFS works with a different network setup. Fast. FAST!",
			"date_published": 1462131956.108,
			"body": "I've used my phone to connect to wifi instead of PC(Win)>LAN>Notebook(Linux)>Wi-Fi>Router>Internet (so now it's PC(Win)>USB>Phone(Droid)>Wi-Fi>...\n\nWorks slower, but IPFS has decided to work this way. I guess that android's internet distribution system is better with windows, or the problem is between my lame hands and linux...\n\n// in 5 minutes\n\nNope. It does not. It did, but it is not now. Bugs?"
		},
		{
			"post_id": 148,
			"title": "Youtube worked over I2P, but slow.",
			"date_published": 1462115675.97,
			"body": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/n5w2Mh6CyXo\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 147,
			"title": "I2P 2",
			"date_published": 1462114676.12,
			"body": "TADA!\n\nI've got my FIRST transit tonnel in I2P! Nothing changed, but it's some progress...\n\n01.05.16 22:42\nFunny. That tunnel disappeared in a couple of minutes and had 480 KB traffic.\n\nI'm going to try it with cellular connection. It's 70 MB/day, but it's a different provider, so may be ports will be open."
		},
		{
			"post_id": 146,
			"title": "I2P",
			"date_published": 1462028140.795,
			"body": "As Erkan pointed out recently, it's a good idea to use I2P instead of Tor. I have 2 questions:\n\n1) Is it possible to use I2P with ZeroNet?\n2) For me I2P is very slow =( Is it OK? Yea, my ports are all closed, so long bootstrap time is expected \"feature\", but is I2P fast for you? And since I2P is slow here, will it be possible to use it with ZNet at all? Timeouts and stuff.. U know...\n\nBy the way, since I've setup my browser's proxy to use I2P I am quite safe from any spy sites (and zites that have content from clearnet), am I right?\n\n30.04.16 21:18 MSK\nSpeed is 5-10 kB/s by the way >.<\n\nwait.. that's for upload and download separately, so together we get awesome 20 kB/s maximum =("
		},
		{
			"post_id": 145,
			"title": "Post's Name Goes Here",
			"date_published": 1461956136.722,
			"body": "Erkan always has interesting stuff to read =D\n\nhttp://127.0.0.1:43110/zeroblog.bit/?Post:71:in+progress:+comparing:+1.+ZeroNet+%3C-%3E+ipfs,+twister+--+2.+tor+%3C-%3E+i2p"
		},
		{
			"post_id": 144,
			"title": "Slow network is not a problem for Zero Net",
			"date_published": 1461955358.722,
			"body": "One of coolest things in Zero Net is that I can use it with a slow connection or without it at all. I can read news, blogs, stuff, watch pictures if they are already downloaded. And since I still have 64 kb/s (8kB/s), I can even update some blogs!\n\nAnd with new diff feature, there are a lot of sites I can watch on my slow connection!\n\nPlease introduce some sort of Tweeter here......\n\n(sorry for typos, online checker is not working now)"
		},
		{
			"post_id": 142,
			"title": "IPFS Trouble",
			"date_published": 1461874553.092,
			"body": "I begin to understand those who said IPFS suck. Connected my PC to internet, started IPFS and it's not working. I remember that it has sort of a long startup time, (time before all those 50-70 connections begin to do anything), but it's been 10 minutes and still no result.\n\nI have a new idea: start a site on ZN with pictures only. And all of them would be \"additional data\" (or how is it called here?). And I will refere them here. What do you think about this idea??\n\n29.04.16 01.38 MSK\nIt's still not working... 54 connetions, but it's still not working."
		},
		{
			"post_id": 141,
			"title": "Current Mood",
			"date_published": 1461793318.948,
			"body": "<a target='_BLANK' href='https://ipfs.pics/QmeMfum1uPLuFHDF8dL2h8nr4K6LJpSpeWUp1gLHcMgC3v'><img src='https://ipfs.pics/ipfs/QmeMfum1uPLuFHDF8dL2h8nr4K6LJpSpeWUp1gLHcMgC3v'/></a>\n\nHow do I call it...\n\"I need an answer!\"\nYea, that should do it... Until I find something better.\n\nIf you have something to say besides \"nice\", \"good\", \"bad\", \"sucks\", \"whoa!\", please comment. I would really like to know where exactly my drawings suck. You don't have to say where they are good - I don't care. I search for skill improvement, not cheering.\n\n28.04.16 14:46\nGood morning, I've got some advice from my sister, so no need in it here. It's not like I'm writing a book about it =D"
		},
		{
			"post_id": 140,
			"title": "Zaebalsya",
			"date_published": 1461743610.164,
			"body": "Wherever I go there is someone talking or eating something. Neither my ears, nor my nose can rest a bit. Why on Earth did I have to go anywhere today??!!!!!"
		},
		{
			"post_id": 139,
			"title": "VK in terminal!",
			"date_published": 1461695449.141,
			"body": "Russian Facebook clone, VK, is now can be accessed from terminal! ^_^\n\nhttps://github.com/HaCk3Dq/vk\n\nAWESOME!\n\nCurrent features are:\n- Messaging (no images as the only drawback)\n- Music\n- \"Not online\" mode (for those who don't want their friends and relatives to see them chat =D)\n- fresh bugs ;)\n\n29.04.16 21:33\nAWESOME! I thought I've lost this link!!!\n\nLook: We forgot to pay our provider for the internet and we have to rely on mobile networks. But in my plan I have 70 MB per day and I've used all of it. What should I do to stay connected to friends? Use console version of VK! xD"
		},
		{
			"post_id": 138,
			"title": "ZeroNet on Android translation",
			"date_published": 1461679484.348,
			"body": "http://127.0.0.1:43110/14kJaSxG8JustunzDJMhAJeDS4iKod9oiU/?Post:2:New+blog+post\n\nAs soon as you tell me what language that is, I will make a link on ZNoA Guide page."
		},
		{
			"post_id": 137,
			"title": "Hm...",
			"date_published": 1461612176.507,
			"body": "Yes. The only way for me to study programming languages is to attempt to write mini games. I never succeed, but it seems to be one of few motivators that make me learn.\n\nNot only it's good as a motivation. Also, I discover stuff on my own and then read it in the book. Or sometimes I feel that I can't finish some block of code without some particular knowledge, then I go and read it. It works even for basic stuff, no need to go far.\n\nModules. I was too lazy to read stuff about it. I've just learned how to `import` them and made a train of small files one call another one (I just like to work in separate windows at the same time. Somehow it's easier to understand stuff when it's not only split into blocks of code by comments, but also by windows and sometimes - PC screens).\n\nBut then I've encountered a problem: I could not pass a variable from one module to other. Using my laziness I've invented several ways to evade reading the book, all of which had led me to a conclusion: \"I need to read the manual!\"\n\nIt was like standing before a wall with horns of my stubbornness pressing against it (with no result of course) and at last being tired from the process with nothing left but to look on the wall and see the writing saying \"READ THE DAMN MANUAL!\"\n\nOr \"Speak 'Friend' and come in\"... Whichever is easier to imagine for you =)\n\n\nP.S. My friend and I are arguing, is it right to say \"before the wall\", or should I use \"in front of\" instead??"
		},
		{
			"post_id": 136,
			"title": "Dreams Come True",
			"date_published": 1461603546.294,
			"body": "AHAHA!!! Python is awesome!!!!!!!\n\nI've wrote a program that can reload itself after I've made changes into it's source code!!!!\n\nNow I don't need to press \"Quit\" and then start the app again! If I made some change in a code, I can simply press \"Restart\" and the app will recompile itself and start itself again xD AWESOME!\n\n<a target='_BLANK' href='https://ipfs.pics/QmNr5frdiFbPeuZTiTGspgfr7UUJZDs3XufiBT7CFTCa5a'><img src='https://ipfs.pics/ipfs/QmNr5frdiFbPeuZTiTGspgfr7UUJZDs3XufiBT7CFTCa5a'/></a>\n\nMy dream since I've started programming was to write an app that could be edited from within that app, and with Python it's easy-peasy x)))\n\nActually it was 5-10 years ago and now I understand that it's better to use external text editor for editing. So ability to `reload(a_module)` is an awesome feature provided by Python =^_^=\n\n# A thing to change...\n\n... is to add the ability to call \"restart\" from any module. I've tried `this` and `self`, but none of them recognise current module =(\n\nIf any of you know how to reference a current module, please tell me =)"
		},
		{
			"post_id": 135,
			"title": "Woops...",
			"date_published": 1461535905.754,
			"body": "I've just read that I've used that bridge wrong. There is no need for a hole at all. It's even better when resting on a flat ground. (You can smash enemies and items with a bridge).\n\nThe reason I've made this mistake is that the way bridge works seem to be different from a version to a version of DF... Or it's my understanding of it's mechanics changes =\\ But I'll rebuild it soon. Also I'll use bridges as floodgates."
		},
		{
			"post_id": 134,
			"title": "Things I Miss",
			"date_published": 1461531834.219,
			"body": "<a target='_BLANK' href='https://ipfs.pics/QmPhTL7y2mVs1fVtjWXPHJKc5CmbVLW4sD24LaZPG7Av47'><img src='https://ipfs.pics/ipfs/QmPhTL7y2mVs1fVtjWXPHJKc5CmbVLW4sD24LaZPG7Av47'/></a>"
		},
		{
			"post_id": 133,
			"title": "LOTR",
			"date_published": 1461528333.32,
			"body": "<a target='_BLANK' href='https://ipfs.pics/QmQ8SzsbXWnGNZZwHNFNGV68B2bbentxGnLyXNbZiT1Qgy'><img src='https://ipfs.pics/ipfs/QmQ8SzsbXWnGNZZwHNFNGV68B2bbentxGnLyXNbZiT1Qgy'/></a>\n\n<a target='_BLANK' href='https://ipfs.pics/QmcYfJTxf18eVCHT2LPL8CxrfSMHMfxKy4V8KZByGBDrC6'><img src='https://ipfs.pics/ipfs/QmcYfJTxf18eVCHT2LPL8CxrfSMHMfxKy4V8KZByGBDrC6'/></a>"
		},
		{
			"post_id": 132,
			"title": "Images of DF",
			"date_published": 1461524729.358,
			"body": "DF: 0.42.06 (Feb 10, 2016)\nUsing PyLNP (Lazy Newb Pack for Linux)\nGrafics: Wanderlust 16px\nPrint Mode: TWBT with Multilevel (play without it, coz of FPS)\n\nImages are stored on IPFS network.\n\n##Enterance.\n\n<a target='_BLANK' href='https://ipfs.pics/QmeHKW1dBGqRMYCyvQ8S8XxoVze1ARfcQ2QVKE5xsuAPVS'><img src='https://ipfs.pics/ipfs/QmeHKW1dBGqRMYCyvQ8S8XxoVze1ARfcQ2QVKE5xsuAPVS'/></a>\n\nInteresting stuff (from left top to right bottom):\n1. External Butchery. There was a problem with too many dead creatured carried to a butchery (3 hunters = lots of dead animals) and so miasma started to spread. I've decided that there is no problem with placing a butchery outside. Will male a minecart track there so that production would run faster.\n2. A road of dead trees. Auto tree-cut option of DF Hack glitched and has not unmarked trees. So not I have LOTS of logs. Really. I won't need more any time soon. Great idea by the way. I've heared that Elves make some quota of trees being cut per season. So now I can agree to any quota, coz I don't need to fall any more trees xD\n3. A bridge with a two-level-deep hole under it. Two level - because last time I've rissen a bridge when trolls were on it, almost nothing happened. One blue blood spatter (very nice and beautiful color! I've lured those trolls into the fortress to color walls in blue for some time =^_^=) I don't suppose that 2 levels is enough to kill anyone, but I won't waste more space under my fortress for something that might not work at all. I've heared that 15 levels is enought to make a stew out of a goblin, but hey... If I wanna do that, I'll make a FUN tower...\n4. Furniture storage and workshops. Yes, still in a single room with only a small stone storage...\n5. Under it is an enterance itself with dorminatory on 1 side and axes, picks and a hammer on the other. Currently only 1 axe, since a hammer was stolen and other tools are in use.\n6. Under it is a kitchen with a storage and some tables and chairs. Those are no burgers, those are barrels...\n7. The Great Hall. It's only great because there are statues and an artifact floodgrate (see \"X\" near the pointer). The main (and only) meeting area.\n\n## High Above.\n\n<a target='_BLANK' href='https://ipfs.pics/QmYvRUCy23wiQNf8H8HHRT3qritM14yeGjXgpSr5a492VV'><img src='https://ipfs.pics/ipfs/QmYvRUCy23wiQNf8H8HHRT3qritM14yeGjXgpSr5a492VV'/></a>\n\nTWBT allows to see both tree tops and fort's enerance. Something new for me, so I've made a screen.\n\n## Level 1.\n\n<a target='_BLANK' href='https://ipfs.pics/Qmayezwhw3A45WX7noEvZUx2uaMUK2cEJGES7hxoLQpaBM'><img src='https://ipfs.pics/ipfs/Qmayezwhw3A45WX7noEvZUx2uaMUK2cEJGES7hxoLQpaBM'/></a>\n\nThis and the next level are to become main production levels. Someday... month.. year? I'm pretty slow((\n1. A hole under the bridge.\n2. Some fancy-looking hall.\n\n## Level 2.\n\n<a target='_BLANK' href='https://ipfs.pics/QmV5CwrxmJZUsS4Cq9SUUQ5cY5gprh8NjNjgHcWCM8NyjU'><img src='https://ipfs.pics/ipfs/QmV5CwrxmJZUsS4Cq9SUUQ5cY5gprh8NjNjgHcWCM8NyjU'/></a>\n\nNothing on this level yet but the ground level of the hole under the bridge. Some blood will be there soon hopefully... And some industries will spawn from those side halls.\n\n## Level 3: Trade and Burial\n###Trade:\n\n<a target='_BLANK' href='https://ipfs.pics/Qmd4vXZwLQL3koszf5zXhtBbKGgwzHdcVuYaM7qcY3whSF'><img src='https://ipfs.pics/ipfs/Qmd4vXZwLQL3koszf5zXhtBbKGgwzHdcVuYaM7qcY3whSF'/></a>\n\nJust wanted to post this image to show that a trade depot is a level below production level. I want to make a statue garden on the left. A beautiful road leadin to burial chambers. I hope statues will arrive before corpses.\n\n###Burial:\n\n<a target='_BLANK' href='https://ipfs.pics/QmfJx6uQT6gaYt22ioDbMJqRpDeRujcP5Po9C5K3pqaixT'><img src='https://ipfs.pics/ipfs/QmfJx6uQT6gaYt22ioDbMJqRpDeRujcP5Po9C5K3pqaixT'/></a>\n\nOne of the most important parts in any Dwarf Fortress. A place to bury all those corpses xD Only best doors and coffins will go there. Walls will be smoothed and some of them engraved. I have to respect those who had gave their lifes in order that I could have some FUN. Currently 1 Dwarf is dead, and his coffin is already being carried here.\n\n## Frozen River and Farms.\n### River:\n\n<a target='_BLANK' href='https://ipfs.pics/QmW76psrXjFt6VrKdhDS1Wuo3ZajFSimMjdD6tGKoDozn7'><img src='https://ipfs.pics/ipfs/QmW76psrXjFt6VrKdhDS1Wuo3ZajFSimMjdD6tGKoDozn7'/></a>\n\nA place, where I will get fresh water for now.\n\n### Farms:\n\n<a target='_BLANK' href='https://ipfs.pics/QmSET2286GdbLzNwJBrhnuF7J1gipdPmCHyH4vgeWUZTT4'><img src='https://ipfs.pics/ipfs/QmSET2286GdbLzNwJBrhnuF7J1gipdPmCHyH4vgeWUZTT4'/></a>\n\nA farm-to-be. Just waiting for the river to wake up. Not connected to a frotress for now, because I remember well what happens with all those traps and fortifications when trolls come. But I will make some sort of an underground bridge some day."
		},
		{
			"post_id": 131,
			"title": "A funny thing (not)",
			"date_published": 1461521729.577,
			"body": "The only way I can have some memory free from anything is to use a terminal instead of grafical desktop. As soon as I load Gnome (MATE) desktop, a half of memory is used and a half is full of cache. When I pressed ctrl+alt+f2 on login screen, I had 10% totally free."
		},
		{
			"post_id": 130,
			"title": "Dwarf Fortress story",
			"date_published": 1461518622.273,
			"body": "I have decided that it will be more fun to write down what happens in my fort this time. Since it's the first time I do that, the log is going to be  boring. But I will still post it here. Comment on how do you think I can make it better.\n\nSo what is it: it is a story based on my progress in Dwarf Fortress. I will write from the perspective of one of Dwarfs I will be playing from the beginning. And some other Dwarf if the one on behalf of whom I speak will die. I will use \"thoughts\" of a dwarf to spot out things that he likes/dislikes/wants and announcements, fort statistics and my own observations to make things at least a bit more interesting (since almost all dwarf thinks of is work, drinks, weather and how comfortable the bed was (sounds familiar?)))) Also I will add a (very) little stuff from myself to make stuff sound more logical and nice.\n\nHere it is:\n\nIt was 15 of Granite in the year 250, when our new fortress, Tabarustuth, was started. It began as an idea to expand the territory of our nation, \"The Rack of Kindling\". Not a distant outpost, we were building very close to another Dwarven town (which name I have forgotten now). But because it's local forces were limited and required to fend off constant attacks of goblins, we had to rely on our own skills. May Ral Mineumber be with us and the peace throughout the world!\n\nAh yes, I am Urdim Zegdomas... or \"Tattooedguild\" on the Common-talk. I am chief medical dwarf (work as a carpenter). I am sixty-five years old. Just the right age for adventures!\n\n17.01.250 Tropics. Jungle. Not the best climate, our continent can provide, but far from being called the worst. However constant rains are trouble. I hope that miners will give us the comfort of the limestone rock soon.\n\n20.01.250 Litast Tunilul (\"Doorlords\"), our hunter, was using copper bolts, which is against rules, but he is a lover of our Expedition Leader, so I he definitely can do that...\n\n04.02.250 Mason's and carpenter's workshops are setup (some work at last!) and the main hall is carved out. More like a hole for now, but no time for lucsuries - we have to set up basic production chains as soon as possible. And when ale, wine and beer rivers run, we can do all the smoothing and engraving we want...\n\n01.03.250 A butchery and a dorminatory are complete. And work is going. And there is beer. Oh yes.. Beer is good. But I am constantly annoyed by rain and flies. Maybe it's good that my workshop is indoors!\n\n01.07.250 Autumn has come. So much has been done, but even more is to be done. Damn, we still don't produce alcohol! Imagine what can happen if we run out! And the winter is closing in!\n\nAlso we had some kea problem. Damn creatures have stolen both our axes, quivers, backpacks... Almost everything that we brought from our homelands! Not that I'm feeling sad.. Everything is pretty awesome... We have started to produce crafts yesterday. Shells. Too much refuse from all those turtles we ate.\n\nAlso our miners have dig up some space for farms! Great news. More mushrooms - more alcohol! All that's left is to bring some mud with water!..\n\n.07.250 Traders came. Asking for shields, cut gems and figurines. Shields... I hope, no wars are coming.. We bought some good beer from them. Not enough for the whole winter, I'm afraid.\n\n2.10.250 We have a problem. We have a big problem. I told them to finish farm preparation faster! I've told them! No one listened! Now it's winter and we have a VERY limited supply of drinks! And also we have that animal problem too... No water for them at all. Bad. We already have a yak and a horse dead..\n\nIf you live on a different continent, you might think that \"tropics\" means that we won't have any snow here, but anyone from our lands know how diverse is weather here. It's hot in summer and chilly in winter...\n\n26.10.250 A Moonstone. It's going to be a busy month. First - problems with water, now - Mistem Uzlirvabok has begun an artifact... Let's see what will happen next...\n\n03.11.250 Ilidlemis, \"Ruledvine\", a schist floodgate with an image of a forgotten beast. Marvelous construction. And useful! But I hear, our EL wants to install it in a statue garden. Not bad.\n\n26.12.250 Vutok Seloredem, our second Hunter (one of first immigrants) has been found dead. Hunter is a dangerous profession... We found his mangled corpse today. It seems that he run out of ammo. Our craftsdwarf was doing his best, but it was too much of work for a single person... People are going to be devastated. Miners have started to carve out first burial level... So it begins.\n\nA SUMMARY OF THE FIRST YEAR\n1 dead, 0 missing, 2 animals dead. Halls are carved several levels under the ground. But we spent so much time carving them, that we did not even started building befroms and specialised production rooms, so all dwarfs sleep in the first enterance hall, and in a room nearby all the production is going.\n\nAbout products we make - all very basic production chains are set up. (Not much of chains, we only work with stone, bone, shell and wood which now.) So we are waiting for Elven and Human caravans to show up. Human specially, since we have lots of wood after that planning problem. And when I say lots, I mean that we have enough for several years of wood-only production. I hope Elves won't mind that...\n\n01.01.251 Snow is melting, the word is that <s>hippys'</s> Elven caravan is coming soon. Gems are sent to the depot."
		},
		{
			"post_id": 129,
			"title": "IPFS browser addon",
			"date_published": 1461347018.272,
			"body": "For those who were asking, I've updated a [guide](http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:24:Streaming+with+IPFS:+HowTo,+Pt.2) with a link to a browser addon fot IPFS."
		},
		{
			"post_id": 128,
			"title": "Another New Blog Post",
			"date_published": 1461314180.257,
			"body": "Sorry guys, I was not around here for a day or two. But I have answered you now in your comments.\n\nTo anyone, who had a question about IPFS, install a plugin.\n\nBy the way, it's a full moon today (I've even checked Google to be sure, coz I think that last time I was wrong). Be ready for a blog post about \"how bored I am\" or \"how much I wanna be with someone\". And I will try not to post anything like that. No promises though.\n\nP.S. I wrote this post with no typos! ^_^"
		},
		{
			"post_id": 127,
			"title": "Sleep well...",
			"date_published": 1461206857.485,
			"body": "There is something special in going to bed **after** I've greated new morning's sun.\n\nAlso I hate birds right now. They seem to enjoy singing especially when I try to fall asleep.\n\nGood night"
		},
		{
			"post_id": 126,
			"title": "More updates!",
			"date_published": 1461136415.295,
			"body": "Search feature!\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:81:Changelog,+April+18,+2016"
		},
		{
			"post_id": 125,
			"title": "Some nice pics (found on ipfs.pics)",
			"date_published": 1461134639.709,
			"body": "<center>\n\nIf you like what you see, install IPFS!\n\nA line I use to add pictures:\n`<a target='_BLANK' href=\"\"><img height=\"150\" src=\"\" /></a>`\nDo you like the size? I thouht between 100 and 250...\n\nAlso it took me an hour (since the idea came to me) to make about 10 pictures appear here, so comment if you like it.\n\n20.04.16\n<a target='_BLANK' href=\"https://ipfs.pics/QmPMu6xfpjNBstDAy4gEfK2C39EQzpyn459mXYrhZM5aJt\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmPMu6xfpjNBstDAy4gEfK2C39EQzpyn459mXYrhZM5aJt\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmbQJMUbuMjiNT4kEPrdaT22Q8kqhc3wsWQarq9TmbZruV\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmbQJMUbuMjiNT4kEPrdaT22Q8kqhc3wsWQarq9TmbZruV\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmXSjPGLsTFs3hBFzVBjPZ6oGom5woiQiwWes1XiTVoKgF\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmXSjPGLsTFs3hBFzVBjPZ6oGom5woiQiwWes1XiTVoKgF\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmVoFLy8J3cpStrqTGb3tmg3pjQA5JpVG39USrf8VTHdM3\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmVoFLy8J3cpStrqTGb3tmg3pjQA5JpVG39USrf8VTHdM3\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmWdREAQb8C9rSwT2B4LPYVZFUU4cGdseGYQ1i7mfkHf2N\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmWdREAQb8C9rSwT2B4LPYVZFUU4cGdseGYQ1i7mfkHf2N\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmdXMKHSituRrgHSxgxZJrVzzKqgn8h2sEa6xzQVBKBRrw\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmdXMKHSituRrgHSxgxZJrVzzKqgn8h2sEa6xzQVBKBRrw\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmbhG7Vdvmoc5Cgk5EZxycANQgPX4GGTntZ56giBmBFT2M\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmbhG7Vdvmoc5Cgk5EZxycANQgPX4GGTntZ56giBmBFT2M\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmY3YHUg85m2Yk5HWrirn1TQ7aCCHun4pAUYF9EK5bpZL1\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmY3YHUg85m2Yk5HWrirn1TQ7aCCHun4pAUYF9EK5bpZL1\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmTWELt5TX5LiFBRBqomsXhVHYFYi948oHJjn4eacM3N7N\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmTWELt5TX5LiFBRBqomsXhVHYFYi948oHJjn4eacM3N7N\"/></a> <a target='_BLANK' href=\"https://ipfs.pics/QmPer9sbSi8g875JkNPQhL3MJBjf2LsihVJo61pvpHc1JZ\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmPer9sbSi8g875JkNPQhL3MJBjf2LsihVJo61pvpHc1JZ\"/></a> <a target='_BLANK' href='https://ipfs.pics/QmU7VWfd3DN1Hh8fjALhQyJLgtkwxkYP2zz9MDT4rkyVJ1'><img height=\"150\" src='https://ipfs.pics/ipfs/QmU7VWfd3DN1Hh8fjALhQyJLgtkwxkYP2zz9MDT4rkyVJ1' /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmXNHdH3885JoHuA23xsgkzHTXTGXsSEgsBBDJYVpz1ybA\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmXNHdH3885JoHuA23xsgkzHTXTGXsSEgsBBDJYVpz1ybA\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmdhTuX4V4uAUKotFTFpeHDEkSDvWVGfsvqT5EwtmtnPUW\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmdhTuX4V4uAUKotFTFpeHDEkSDvWVGfsvqT5EwtmtnPUW\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmQZNKnXBTMbdJSfmnPFmtfKEN5sur5iD9yQUkyh44GD11\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmQZNKnXBTMbdJSfmnPFmtfKEN5sur5iD9yQUkyh44GD11\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmUwHMFY9GSiKgjqyZpgAv2LhBrh7GV8rtLuagbry9wmMU\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmUwHMFY9GSiKgjqyZpgAv2LhBrh7GV8rtLuagbry9wmMU\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/Qmep61aZqJhhmSkhQHUSUme5RFbi8ZfccxXC1TyjKHcEig\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/Qmep61aZqJhhmSkhQHUSUme5RFbi8ZfccxXC1TyjKHcEig\" /></a> <a target='_BLANK' href=\"https://ipfs.pics/QmPQN7bUeCsYpLzkcNRWicE6C2o4XAG96x2AANNRz9J3aL\"><img height=\"150\" src=\"https://ipfs.pics/ipfs/QmPQN7bUeCsYpLzkcNRWicE6C2o4XAG96x2AANNRz9J3aL\" /></a> [<img height=\"150\" src=\"https://ipfs.pics/ipfs/QmVFnUPr8M49AHqprnK5ca5LdE2tJFmStJ1id9BBxHdAof\" />](https://ipfs.pics/ipfs/QmVFnUPr8M49AHqprnK5ca5LdE2tJFmStJ1id9BBxHdAof)\n\n</center>"
		},
		{
			"post_id": 124,
			"title": "ipfs.pics work = MOAR PICTUREZ!!!",
			"date_published": 1461134364.219,
			"body": "I know what that is and how it works. May be really I am a half of an engineer?)\n<a target='_BLANK' href='https://ipfs.pics/QmbyVWSxT5kUKckZ3G1wPjPqhKGB2eghzeC16t4D9mu3rW'><img src='https://ipfs.pics/ipfs/QmbyVWSxT5kUKckZ3G1wPjPqhKGB2eghzeC16t4D9mu3rW'/></a>"
		},
		{
			"post_id": 123,
			"title": "Flags",
			"date_published": 1461133914.268,
			"body": "I might also choose this as a flag...\n\n<a target='_BLANK' href='https://ipfs.pics/QmYgdABcBLRYm2TC3ACabxzF5cjTvHFEcEc3wHRJqzgQAK'><img width=\"300\" src='https://ipfs.pics/ipfs/QmYgdABcBLRYm2TC3ACabxzF5cjTvHFEcEc3wHRJqzgQAK'/></a>\n\n(yes, strange &sharp; thing at the left of the screen is a flag pole)"
		},
		{
			"post_id": 122,
			"title": "He-he-he",
			"date_published": 1461132971.791,
			"body": "<a target='_BLANK' href='https://ipfs.pics/QmSKRZyS2GSQQQqv6eqyggueBPSmoPyhiUoZ4BC8KP1LRr'><img src='https://ipfs.pics/ipfs/QmSKRZyS2GSQQQqv6eqyggueBPSmoPyhiUoZ4BC8KP1LRr'/></a>\n\nIt says here:\n\"Europe can not understand that to try to scare with sanctions people that scratch their backs with knifes, pick their teeth with forks, swim in ice-holes at -25 degree Celsius, at -40 go to work on foot because buses are frozen, work on their farms at +30, bath at bathhouses at +120 and scream \"More HEAT!\", is at least stupid and unproductively. Remember that!\"\n\nFunny, don't you think?)\n\n<font color=\"CCCCCC\">All images are provided by ipfs.pics. If you like what you see, you have to install IPFS, or soon <b>ALL</b> images will be lost!</font>"
		},
		{
			"post_id": 121,
			"title": "O_O",
			"date_published": 1460971711.301,
			"body": "Have you ever watched at the clock and saw that seconds run too fast?!\n\nThe next thought was that 60 seconds per minute is not enough, but that's crazy talk...\n\n][][][][][][][][][][][][][][\n\nWhile I was writing this, 2 more minutes passed and I think it won't stop =( So I'd better go do something useful..."
		},
		{
			"post_id": 120,
			"title": "Dwarf Fortress",
			"date_published": 1460896700.432,
			"body": "I think I will start playing DF again.\n\n<a target='_BLANK' href='https://ipfs.pics/QmVH5NApLkZNu78dMbq1g3JdGgMVHTEvkzc8LVjVoZw4vE'><img src='https://ipfs.pics/ipfs/QmVH5NApLkZNu78dMbq1g3JdGgMVHTEvkzc8LVjVoZw4vE'/></a>\n\nTotally."
		},
		{
			"post_id": 118,
			"title": "The Hobbit",
			"date_published": 1460706368.118,
			"body": "I've decided to watch it again... Don't know why.\n\n```magnet:?xt=urn:btih:49d106a114b16f1135f3d61a0c55b355b03cd11a&dn=The%20Hobbit%201%2c%202%2c%203%20-%20Complete%20Extended%20Trilogy%20Fantasy%202012-2015%20Eng%20Subs%20720p%20%5bH246-mp4%5d&tr=udp%3a%2f%2ftracker.openbittorrent.com%3a80&tr=udp%3a%2f%2fexodus.desync.com%3a6969&tr=udp%3a%2f%2ftracker.coppersurfer.tk%3a6969&tr=udp%3a%2f%2fopen.demonii.com%3a1337```\n\n<a target='_BLANK' href='https://ipfs.pics/QmU7VWfd3DN1Hh8fjALhQyJLgtkwxkYP2zz9MDT4rkyVJ1'><img src='https://ipfs.pics/ipfs/QmU7VWfd3DN1Hh8fjALhQyJLgtkwxkYP2zz9MDT4rkyVJ1'/></a>"
		},
		{
			"post_id": 117,
			"title": "AWESOME *.*",
			"date_published": 1460670287.026,
			"body": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/DtYmBfCuL5g?list=PLMRuR5742WN9WhMOcuX52fVh7_CXlGxlo\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 116,
			"title": "Meow. Studying Python.",
			"date_published": 1460669475.025,
			"body": "##My First App:\nfib.py\n```\n# This app creates the Fibonacci series.\n#\n# Usage: fib <nunber>, where <number> defines how many numbers to create'\n#\nimport sys\na, b = 0, 1\nif len(sys.argv) == 2:\n    i = int(sys.argv[1])\n    #i = 5\n    if i <= 0:\n        print 'Please choose a number from 1 to 50'\n    elif i > 0:\n        if i <= 50:\n            while i != 0:\n                print b\n                a, b = b, a+b\n                i = i - 1\n\n        elif i > 50:\n            print ('Please choose a number from 1 to 50')\n    else:\n        print 'ERROR: Wrong input!'\nelse:\n    print 'ERROR: Wrong input! Please choose a number!'\n```\n\nYea, I know, there should be an initial check if an argument is a number, but it would take me extra time to do that and I have to go to bed ASAP."
		},
		{
			"post_id": 115,
			"title": "Nice video",
			"date_published": 1460664134.465,
			"body": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/oOlDewpCfZQ\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 114,
			"title": "Mars Simulation Project (mars-sim)",
			"date_published": 1460645590.833,
			"body": "Some time ago I was searching for interesting space themed simulators. Several things proved to be interesting. One game (Take On Mars) and one simulation app (mars-sim). I won't write about the game here, if you are interested, check out steam and you can find the latest build on btdigg.org or thepiratebay.org.\n\n## Link\nhttps://sourceforge.net/projects/mars-sim/\n(however guys were talking about moving to GitHub)\n\n## About\n// I'm not going to write detailed \"about the project\" here, because you can read it at sourceforge. I'm only going to point out things that make this project different from others I saw.\n\nThe task that people behind mars-sim given to themselves was to develop an app (not a game) for simulating \"what would happen to first colonists on Mars\". Not only guys want to simulate everyday duties of every colonists, but also they try to simulate what happens in their brains! And most interesting part of the task they have is to make this simulator so good, that even NASA would use it.\n\n## Help\n\nIf you know Java and have some free time you want to spend on something that would possibly help mankind, join those guys! Maybe in some years they will make something really great!)\n\n## My Notes\nIf you want to check out the latest version (.8), you will have to use Oracle Java, not OpenJDK."
		},
		{
			"post_id": 113,
			"title": "DAMN IT!",
			"date_published": 1460642796.879,
			"body": "I HATE THIS LOBSTER!!!\n\n<a target='_BLANK' href='https://ipfs.pics/QmW3FgNGeD46kHEryFUw1ftEUqRw254WkKxYeKaouz7DJA'><img src='https://ipfs.pics/ipfs/QmW3FgNGeD46kHEryFUw1ftEUqRw254WkKxYeKaouz7DJA'/></a>"
		},
		{
			"post_id": 112,
			"title": "2 NEW IDEAS!",
			"date_published": 1460630266.117,
			"body": "Yesterday's night was \"productive\".. As soon as my head touched the pillow an idea was born and I felt an urge to write it down. I hate it when it happens (coz sometimes I can spend hours writing things down!), but usually my best ideas are born this way(((\n\nI will write it in the blog later, currently I will just post a screenshot of it.\n<font color=\"#CCCCCC\" size=\"4\">\nprovided with ipfs.pics. Want to see this picture later - use ipfs NOW!!!!!!!\n</font>\n<a target='_BLANK' href='https://ipfs.pics/QmQUT63AvpM77zKwCeVVwLgXWbohRsPeRYaTvSXJz9W4ow'><img src='https://ipfs.pics/ipfs/QmQUT63AvpM77zKwCeVVwLgXWbohRsPeRYaTvSXJz9W4ow'/></a>"
		},
		{
			"post_id": 111,
			"title": "Blog Contents",
			"date_published": 1460601092.766,
			"body": "You can find all interesting stuff [here](http://127.0.0.1:43110/blog.musickiller.bit/?Post:56:New+blog+post)!"
		},
		{
			"post_id": 110,
			"title": "Ping... Ping... Ping...",
			"date_published": 1460581988.703,
			"body": "Pinging people who I had lost contact with some time ago in case they want to resume our frienship. Quite slow. One person per several days.\n\nBy the way, my leg is almost time. I could barely walk at monday, I went to university on tuesday (BTW there was another funny story about chasing that strangely looking girl again =^_^= But after that my leg REALLY ached...), and today I could almost run.\n\nNext saturday I can make another run. Hope this time without injuries.\n\n// who am I lying to? I will try to run every day and make another running session as soon as I can bear the pain ^_^"
		},
		{
			"post_id": 109,
			"title": "I DO read blogs of others!",
			"date_published": 1460473471.316,
			"body": "Don't think of me as of some self-obsessed scum...\n\nI also read Erkan and KS and I follow a bunch of other guys, though I never saw their posts on ZHello.\n\nEDIT:\nHowever I mainly do that when I feel lonely and none of my friends wanna some dumb-chat... I hope that's not what you are doing here xD"
		},
		{
			"post_id": 108,
			"title": "Signal lost...",
			"date_published": 1460406414.311,
			"body": "Things are getting worse.\n\nMore and more people leave me. I used all my strength to hold on to my sister yesterday, so when today 2 of my friends wrote they \"don't want to put up with me\", I just wrote first few things that came into my head. Not all of them, but it was pretty much non the less.\n\nGood news is that yesterday I've also conquered my greatest fear - fear of loosing people. So if they want to leave, even though I will be sorry, I'm not afraid of it. Everyone is free. Free to come, free to go.\n\nDamn.. I **am** an optimist after all >.< What other idiot could find good news here??! An optimist!"
		},
		{
			"post_id": 107,
			"title": "New Record",
			"date_published": 1460363335.872,
			"body": "Yesterday I have endured 2.5 hours of running with a single 5 minute stop (nose problems again...)\n\nMy last record was 2 hours. This time I had too much to think about, so extra 30 minutes I spent meditating.\n\nVery productive by the way. I've discovered that I can run just as good without any stimulators like music or perverted pictures. I've understood why do I run: it appears that I'm not trying to run away from anything, and instead, my runs are manifestation of my idea of searching, and of the pursuit of my dreams. And I have solved a dilemma I had with my sister (4-th cousin, if I'm writing it right).\n\nThe reason I've decided to go running was that I've found old messages from my sister. And there was a question whether I should break my promises to myself, fall on the floor, cry, and fuck my sisters brains for a couple of hours, or to find another way to deal with my emotions and thoughts.\n\nFor 2 hours of running my brain was denying to think about anything. But after that I felt an urge to take my headphones off. When I've done it, of thousands thoughts in my head, I saw only those I was interested in. They hit me like an electrical shock when I spoke them and all the pain and tiredness of my body faded as I did so. And when I had an answer about that message problem, I've decided to make another circle without music and go home. On that circle I've answered some questions about myself that were bothering me.\n\nSo instead of spending the extra energy I had in me, I've found even more.\n\nGood thing was that I have decided to run home after that last circle. When I switched to walk from run, I've felt, that I could barely stand. I've felt as if all my body was empty. But my mind was sharp and I did not collapse even when everything got blurry and dark.\n\nSurprisingly, no pain in my muscles today. Seems that 1-4 hours in the bathroom really does help.\n\nP.S. Yes, Erkan, you were right, I do tonns of mistakes. https://www.languagetool.org/ does help."
		},
		{
			"post_id": 105,
			"title": "Nasal Bleeding",
			"date_published": 1460284436.73,
			"body": "##Good because:\n- I can't die from too much pressure in my head. My nose will just dump blood until the pressure is normal\n\n##Bad because:\n- VERY uncomfortable:\nEvery summer and winter I have regular nasal bleedings, because the air is too dry or too hot.\n- Dirty:\nIf it starts suddenly, everything is covered in blood. And one should never sneeze if his nose is filled in blood. <font color=\"#AA0000\">**NEVER**</font>\n- Just imagine it happen in public\n- In theory, every time my blood pressure rise, I can get a bleeding (see japan comics and cartoons, when a boy sees a nice girl and get a nasal bleeding). Good news, it's sort of a lie. If the weather is fine (air pressure, air wetness, temperature), a perverted thought won't make my nose bleed. More on that topic: why would it? The blood is diverted to the lower part of the body!\n\n*If you are a medic and have something to comment here, comment. I'm not a medic, so stuff you read here is based only on my observations. 22 years of them, but I still can make mistakes sometimes =)"
		},
		{
			"post_id": 104,
			"title": "Updatable torrents",
			"date_published": 1460279152.788,
			"body": "ZeroNet is live for quite some time now and still no one built a torrent client based on this technology? Where are smart guys and what they are doing???\n\nIt's possible to build a file sharing app by simply allowing ZN to wait longer for file transfer to be over, but if someone would be able to berge it with bittorrent stuff, it would be much better. Actually, what I was thinking was merging torrent with ZN, with dominance of torrent. There is no need in all those web services and stuff for simple file sharing app.\n\nYes, persistent torrents are more secure, but I'm a bit tired of constantly downloading new versions of games and apps. With ZN-like technology, it would be possible to update clients' files. And client would be able to pin versions he likes (because new versions are more buggy sometimes and may lack of some functions).\n\nI suppose a smart move would be just to add it as a plugin to ZN and solve 2 problems: implement updatable torrents and ZN's large file transfer. But there should be a separate interface to control large files. Storing everything like ZN is doing now is not an option!"
		},
		{
			"post_id": 103,
			"title": "@musickiller.bit",
			"date_published": 1460278053.037,
			"body": "I don't like zeroid and zeroverse for being centralized services. I think that there should appear a local add-on to manage NMC IDs. Or NXT IDs if you want more diversity."
		},
		{
			"post_id": 102,
			"title": "An idea for the guy at ipfs.pics",
			"date_published": 1460276709.983,
			"body": "Paid user accounts.\n\nYea, I'm just tired of waiting. I have waited for days and I still can't upload a single picture!\n\nOr accounts can be free, but uploading would be optional paid. Like, if you don't want to wait, you pay and your picture is uploaded!\n\nIf he makes accounts with NMC or NXT, he can also use a crypto currency payment methods!!"
		},
		{
			"post_id": 101,
			"title": "Today",
			"date_published": 1460214770.76,
			"body": "Will upload some photos here when IPFS.pics will be free.\n\nEDIT:\nIt's 14.04.16 and up until now I could not add new photos to ipfs.pics. Outrageous!"
		},
		{
			"post_id": 100,
			"title": "IPFS.PICS Client",
			"date_published": 1460213522.951,
			"body": "I've got an idea of photo synchronization/sharing/storing app. It would use ipfs.pics to upload photos and any gateway to get them.\n\nWhy not IPFS directly? Because it does not always work =( For example, for some unknown reason, my IFPS on notebook does not work without my PC IPFS on.\n\nBut it would be even better if there was an option to use IPFS itself.\n\nBy the way, I think it should not be hard. Just a small client that is run after IPFS is run, what it does is adding and pinning photos, saving data somewhere.. Giving a shareable link to the photo via gateway.\n\nIPFS.PICS uploader sounds a bit harder: there should be a way to check if their servers are not over their capacity."
		},
		{
			"post_id": 99,
			"title": "May be someone wants to talk?",
			"date_published": 1460184983.102,
			"body": "I'm in a bad mood and don't have much time, but my friends are busy, and I want to talk. Someone has the same problem?\n\nProblem partialy solved: I post comments on posts I find. Not much of a talk, but it's not a stupid chatter either and it's not bothersome to other people. There is even a chance that I'll say something smart and help someone =)"
		},
		{
			"post_id": 98,
			"title": "Saturday Morning",
			"date_published": 1460182959.16,
			"body": "-- Sorry, I'm late. May I come in.\n-- No, you are late, more than 25 minutes is too late, it's a rule and you know it. You can't come in.\n-- 19. It's 19 minutes.\n-- Does not matrer.\n-- I spent an hour to get here and I'm 19 minutes late because of traffic. Dean office is closed, what do you suppose should I do?!\n-- Go home.\n\n(This talk is already going for 8 minutes. It sucks... 10. Sucks.)\n\nresults: 20 minutes they were talking and now (at last) the guy has shut up and stands in the door frame.\n\nah, wait, he's talking again... shit.."
		},
		{
			"post_id": 96,
			"title": "Run. Die. Repeat.",
			"date_published": 1460143587.385,
			"body": "Something I hate about my body - as soon as I stop, I can feel more energy pumping to my legs. Sucks so much. I hoped to become tired, but instead, my legs ache, my spine ache, my head ache, my everything ache, but after some time in bed, I'm ready to run again -_-\n\nAn hour of running, 15-30 minutes of walking and more than 30 minutes of preparations are **wasted**. As soon as I stopped and took my clothes off, the look of my red and wet body was enough to make my legs shake with energy again! I wish I had orgasms like that. (recals last 2 days) No, I take that one back...\n\nUhhh... I love spring. Really. So many smells. So warm. No more ice. No more cold. But every spring there is a feeling of several Energizers up in my ass. Successively connected, to get more voltage. Why can't I skip this one at least sometimes?\n\nBad news all around. Tomorrow's plans seem to be canceled. I have tonns of energy and no where to apply it. That's how revolutions are started. I already have a pirate flag on my desktop ^_^"
		},
		{
			"post_id": 95,
			"title": "RRRRRRRRUUUUUUUUUUUUUNNNN!!!!",
			"date_published": 1460132227.456,
			"body": "I don't wanna to go running. My body is half dead when I return usually. But another energy spike and my body will be half dead anyway.\n\nI think I should download some of that pictures I found to my phone. Good motivation to run another circle.\n\nAhhh.... Thinking about it already pumps blood into my legs. Yup. I need to run. I need it.\n\n-----\nFull moons in spring. I hate you. SO MUCH..."
		},
		{
			"post_id": 94,
			"title": "UPDATE!!!",
			"date_published": 1460131333.011,
			"body": "C'mon guys! We need 80%!! =^_^=\n\nhttp://127.0.0.1:43110/zeroblog.bit/?Post:62:ZN+dev+version:+reduces+bandwidth+usage"
		},
		{
			"post_id": 93,
			"title": "Full Moon",
			"date_published": 1460069710.343,
			"body": "My girlfriend is going to love full moons... I hate them now though.\n\nAnd there was time when I thought moon does not affect our life...\n\nIf plans won't be cancelled completely, I wish that this damn energy will last a couple of days more. Otherwice I need it to go, coz my immune system (harmed already) won't survive for long. After this day I can already feel my overal body status falling even lower that it was before...\n\nFull moon and good night to you all!"
		},
		{
			"post_id": 91,
			"title": "Free Torrent Client",
			"date_published": 1460051490.394,
			"body": "I'm in search of a new torrent client.\n\n**qBittorrent** can't handle torrents with large amount of files.\n\n**Deluge** is nice but it's functionality is... I don't know what word would be right here, small or weak or smth... It sucks.\n\n**FrostWire** I am trying now, but it's not free. It's open-source. Coz officialy people can't use it to violate laws.  Good news I'm a pirate. I can.\n**Result:** It suck. All I want to say before I forget about it's existance. Would it have console interface, it would be more user friendly. Such an ugly GUI... Make me unsee it... Make me unuse it...\n\n**Transmission...** No, I'm not kidding. It deals awesome with lots-of-files torrents! Instantly does stuff that makes qBittorrent die. Problems: it can't run in the background and it's interface could be better. But it's fine.\n\n\nAnd my decision is to use qBT as usually, but use Transmission where qBT can't work."
		},
		{
			"post_id": 90,
			"title": "Worried",
			"date_published": 1460040385.812,
			"body": "You know what get me worried: every time I start watching porn, Ubuntu says that some system app crashed and it needs my permission to send a report with additional info...\n\nNo, I'm not worried about someone spying at me, it's stupid (everyone is spying on everyone), my concern is that Canonical was like some anti-spyware \"fortress\" for me all those days. What happens if they start sending user info too? Some sad thoughts...\n\nNeed to change to some GNU provided free software OS. Not for some privacy shit, I won't be a politician, so u can **spy my ass**! For freedom."
		},
		{
			"post_id": 89,
			"title": "BTW, FTB",
			"date_published": 1460034356.479,
			"body": "By the way, my tablet works faster than my PC or notebook sometimes. So FUCK THE BENCHMARK.\n\nIt's only confusing people. Making them think that ZN can't be run on Android."
		},
		{
			"post_id": 88,
			"title": "AUTOPUBLISH!",
			"date_published": 1460030783.173,
			"body": "An idea for blog.\n\nWhy is there no \"save & publish\" button? That would be SO nice!\n\nP.S. U can even call it \"Save, Sign & Publish\", to make it more... ZeroNet-ish!\n\nHowever, I would prefer \"Send\" button, near \"Save\" button. That would send the post into the network, so \"send\" is an OK word here, I belive."
		},
		{
			"post_id": 87,
			"title": "Post Client",
			"date_published": 1460030418.641,
			"body": "Is it possible to make a client for both ZeroMail and Mail.ZeroVerse?\nCoz it's so annoyeing to check them both...\n\nI'm sure there have to be an EASY way to make an app that scans folders of both ZM and M.ZV, decrypts and TADA we have a unified mailbox app! (U can even call in U.M.A., if you want =D)\n\nI'm just not sure about decryption part. But it should be possible to base this app on a browser engine and just make it compose a web page with mail from 2 sources. Code of ZM and M.ZV is similar, so it won't be very hard. (However not as easy as the first option...)"
		},
		{
			"post_id": 86,
			"title": "Days without incident: 0",
			"date_published": 1459927640.843,
			"body": "Нервный срыв - это как насмарк. Заметил что нос чешется - закрыл лицо руками. Нет - все в соплях."
		},
		{
			"post_id": 85,
			"title": "New blog post",
			"date_published": 1459885439.629,
			"body": "Blog post body"
		},
		{
			"post_id": 84,
			"title": "The blog is not dead.",
			"date_published": 1459866669.734,
			"body": "I don't have much time for posting nowdays and if I had more, it would be \"I was playing PC games all day\", \"I'm in a bad mood\", \" I was sleeping at my friends', huray, they are back from Tula!\", \"Me and my friend were playing with my her [pussy][1], while her husband was at work\", \" back at my mother's house... Sucks\".. Oh, wait, I wrote that one!\n\n[1]: A cat. Trying to write some pun and checking how referencing work."
		},
		{
			"post_id": 82,
			"title": "Jam",
			"date_published": 1459793371.346,
			"body": "Have I updated my limit or deleted comments? No.\nHave I made a circle that took me extra 3-5 hours to get home? Sure!\n\nI hate to call this place home. Does not feel like home to me."
		},
		{
			"post_id": 80,
			"title": "Morning",
			"date_published": 1459671712.608,
			"body": "Wake up.\n\nPretend dead so that mother did not take me to the church (family cold war).\n\nRecall something enjoying. Summer evening with my sister? Playing with my friends? OK. Good emothiens received, ready to live another day.\n\nAnswer my friends where I can do it fast.\n\nSee last shit on vk.com (Russian clone of FB, with pirated music and porn).\n\nGet up.\n\nFall with pain in my head and black fog in my eyes and emptyness in my body.\n\nRemember that I can't do it fast.\n\nGet up sower.\n\nHeat up muscules and get bones where they should be.\n\nGood morning, world. I hate you."
		},
		{
			"post_id": 78,
			"title": "Mailbox Optimisation",
			"date_published": 1459671164.863,
			"body": "How do I work with my mail:\n\n\"Hey, there are 25 unread messages! Let's delete all the shit I won't read for sure! Hey, it's 11 unread messages now! How great!\" (closes the mail)\n\nP.S. Sorry, still no time to update the limit. May be deleting some old comments would be faster?..\n\nIf anyone is close to his comment limit too, report now, so that that would not be a problem later!"
		},
		{
			"post_id": 76,
			"title": "Native Humor",
			"date_published": 1459511906.334,
			"body": "##Ideas\nI have an idea to make a post in this blog for jokes that were not originated in English-speaking countries so most possibly are unic to those regions. Write them in the comments. Jokes don't have to be new for you, but they may be new for someone who does not speak your language. More of so, they don't have to be very funny, it's stupid to ask someone with a different culture and a background to provide a joke that is funny for you.\n\nThis idea came to me after that Д.У.Н.Я. (Dunya) thing. If @ks or @erkan are not too busy, they may send the link. The joke is old and not funny in Russia, however it's based on Russian language, so surely it was not translated.\n\nAlso I'm thinking towards native phrases, but may be it's worth another post. This idea came to me today when I was thinking about [\"Russian National Symbol\" joke](http://127.0.0.1:43110/blog.musickiller.bit/?Post:70:Open+Computers+OS#Comments) and someone in the street said \"I'm not made with a finger!\" (Не пальцем делан!) So I decided to make a page somewhere collecting all Russian phrases about a dick that I could find, so that people would not look like =\\ when I call it Russian National Symbol. Then the idea grow a bit into just collecting not very famous national phrases.\n\nIf you like any of those ideas, feel free to post it here.\n\n##Not_Funny_Stuff\nAh, yea. So that Klaus sould not say \"kids are reading\", I proclaim this post and comments 18+ (and 21+ for countries where the law says so). That does not mean we should not be polite and cultured here, but let's also be open-minded.\n\nAlso since my blog is not very popular, if you like the idea, share the link in your blog. All the ideas in this blog are free and have no copyright for no one, and if there were any rools like copyright here, it would be \"to be redistributed as Free and with no copyright in any iteration, 'copy of a copy' or modification\". (Should write it in some section under the page like Erkan did). If you think copyrights are right.... Bite me."
		},
		{
			"post_id": 75,
			"title": "Kitten",
			"date_published": 1459508038.2,
			"body": "When he sleeps, he makes sounds just like human baby. From time to time he does \"ugh...\" or \"mmmmwah...\"\n\n<a target='_BLANK' href='https://ipfs.pics/QmfJPEJ9o2YXh5Z5qSfeTgSBHZEM4hewCfe97qAJLw9B8t'><img src='https://ipfs.pics/ipfs/QmfJPEJ9o2YXh5Z5qSfeTgSBHZEM4hewCfe97qAJLw9B8t'/></a>\n\nAlso he hugs everyone from family who comes home, likes kissing and plays tag and hide-and-seek with me. He had lots of fun when I was scaring him (and oh, I can scare him well) and recently he learned to scare himself. And he does it incredebly well. He looks stright in your eyes without blinking, waits when you relax and then jumps with some not normal \"MRREEEEAAAW!\" I'm still not sure how he sees when to jump, may be my eye's pupil sells me out. May be it's wrinkles.  But he jumps RIGHT when I stop expecting it and not yet understood that I'm relaxed so he will jump.\n\nNow say he isn't awesome if you dare =)))"
		},
		{
			"post_id": 74,
			"title": "Drugged.",
			"date_published": 1459497034.803,
			"body": "Last edit: 01.04.16 12:24\n\nNever never drink coffee in the morning without practice. U know this awesome gentle but hot rush when you are drugged by some coffeine? No that's not what has happened to me. My whole body aches and shakes. I want to run, but have no will or power to move. Have real trouble typing, partly because my fingers shake like 10 small vibrators (will try the trick when I have a wife), and my eyes try to catch every movement (keyboard updates, blinking update sign, cursor movement and those horrible constantly changing their position fingers!).\n\nI can't stand - my vision turnes dark and can't lay - my heart beats a battle march. My holes in my tees also ache wich means sugar kicked 'em hard and that's very bad news.\n\nAnd I see 3 stages here:\n1. I have enjoyed the coffee.\n2. Everything described in this post.\n3. My back started to move like I'm a catched snake. Partly controllable, I can stop it, but I have to concentrate on it. And when my attention jumts to every movement I see and every sound I hear, it's hard to concentrate on something in particular.\n\nTo @ks and @erkan: please don't say you feel sorry for me or anything, I didn't write it here coz I'm whining or asking for support, it's an interesting biological reaction and I just wanted to note it for later reference. =)\n\nMy be if I ever show this blog to my sister, she'll find it interesting too. (ok, if she finds it on her own. I doubt I'll do that myself, it would be like \"please look as deep as you can into my perverted mind full of tonns of stupid and impossible ideas, I'm not sure for what, but just look\")\n\nEDIT: to @ks and @erkan: sorry, I meant \"anything like 'sorry'\". U can say anything else ofcourse xD I do respect your oppinion. It was hard to think and type then. correcting the mistake now =)"
		},
		{
			"post_id": 73,
			"title": "Versions' big big big problem",
			"date_published": 1459494604.004,
			"body": "&sharp;ZeroNet; &sharp;bugs;\n\nI have a problem. And you too by the way. When using several devices with ZeroNet, it's easy to loose changes due to some lag in synching.\n\nExplaining: I 've wrote a post on my PC and it was online. And then in the morning I turned my tablet on, wrote a new post and now I see that my old post is not here.\n\nWhy? I had unpublished changes stored here (on the tablet) and so tablet would not update the blog before I published them here. So if I save some post and leave it here for later edit (or just forget to publish, or just be offline), and then make changes on PC, they all will be wasted after publishing on the tablet. Sucks.\n\nAm I doing something wrong or do we have a bug here? Help me out here.."
		},
		{
			"post_id": 72,
			"title": "Coffee in the Morning ;)",
			"date_published": 1459494126.914,
			"body": "I know, drinking coffee as soon as you wake up is a bad habbit, but mother bought those white thingys and I could not resist. Meow.\n\n<a target='_BLANK' href='https://ipfs.pics/QmZNtx8pGbyxCtGbZtVK6AETwooxV2dMFc69BJYhmPvvqA'><img src='https://ipfs.pics/ipfs/QmZNtx8pGbyxCtGbZtVK6AETwooxV2dMFc69BJYhmPvvqA'/></a>"
		},
		{
			"post_id": 71,
			"title": "Bum Day",
			"date_published": 1458978515.423,
			"body": "BT headphones' battery was dead, so I had to take wired ones. Could not find my, so I had to take what I could find.\n\nDamn, I have not heared such a shitty sound... since I used piezzo buzzer on my young engineer's tool kit game x( And I hoped it would never happen again.\n\nEver heared what radio sounds when you are entering a subway? Shhhpshhhchhhhhtshhhhhhpshhhit.\n\n// still writing\n// 01.04.16: not really. I forgot about it as soon as I came home."
		},
		{
			"post_id": 70,
			"title": "Open Computers OS",
			"date_published": 1458724531.901,
			"body": "https://www.youtube.com/watch?v=nYvSoLz4JNQ\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/nYvSoLz4JNQ\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 69,
			"title": "Exchange",
			"date_published": 1458509289.429,
			"body": "LTC exchange in now available on SUPERNET's distributed exchange!\n\n(Quite a few, but I do what I can =D)"
		},
		{
			"post_id": 68,
			"title": "Protecting the opressed",
			"date_published": 1458462770.194,
			"body": "##To those who said that IPFS is slow:\nBrowse through this blog. All the pages. Do you see pictures? Did you see them instantly? Cool. All of them are on IPFS. Suck it.\n\nWant them to stay here? Use IPFS.\n\nWhy else? Check the size of this blog. Check how much content do I have here. Check the size of the blog again and think of words like \"netbook\", \"tablet\", \"smartphone\". All of the content is awailable there while the blog itself is less than 1 MB. So by using differerent networks, I've enabled all the pictures and videos work easy and fast on any device without a lot of hard labor on my side and on yours.\n\nOther ways to do that (with ZN) is to create a separate site with all the content, and have links to that content through ZN gateways. Bad news: not all ZN gateways store sites, so if that would work, it would work very slow. And it would still be dependant on how many ppl share that big box of content. That would suck, ok. IPFS is much better for sharing files **now** coz each file is downloaded as needed. It's harder to organize it in ZN **now**. Have ideas how to do that? Welcome to comments!\n\n##The name of the post\n\nWhy does this post called \"Protecting the opressed\", is coz saying \"IPFS\" on ZN is like saying \"gay\" in Russia. Ppl start to sighing and looking somewhere alse if they are polite. **If** they are polite..\n\nMy aim is to form a discussion, it's not bad if you are not interested, it's bad if you think that everyone has the same oppinion as you or that someone in particular is more \"right\" that others. It's all like colored markers: each has it's own taste!)))\n\n#READ COMMENTS,\nthere is some interesting stuff there!"
		},
		{
			"post_id": 67,
			"title": "Android sucks more and more (Stagefright 2.0)",
			"date_published": 1458461902.253,
			"body": "Interesting and important. Read:\nhttp://bitcoinist.net/new-stagefright-bug-android-puts-end-bitcoin-privacy/"
		},
		{
			"post_id": 64,
			"title": "Twister Gang",
			"date_published": 1458305439.316,
			"body": "http://127.0.0.1:43110/zeroblog.bit/?Post:35:Do+I+miss+the+pre-ZeroNet+time+\n\nI like the name actually =) But mostly because of the \"gang\" part. Not like I'm a big fan of twister the microblog, and never played twister the kamasutra-game. And can't say I miss any of those 2 =D"
		},
		{
			"post_id": 63,
			"title": "Share My <s>Guides</s> Android Guide at least!",
			"date_published": 1458278071.1,
			"body": "Hello guys! I've discovered that no one commented on my IPFS guide. May be it's an obvious one, but no one had a better idea? or no one thought it was interesting? Made me a little sad. Good news, the android guide is being used.\n\nSo if you don't mind, could you share info on my existance and that I offer help here? =)\n\n##After comments on IPFS:\nOk, share my Android guide then xD"
		},
		{
			"post_id": 62,
			"title": "You don't see this. It's your strange imagination. U R strange.",
			"date_published": 1458239566.237,
			"body": "Boring days - it is when there is more porn in the feed than kittens and still you look at it with no interest.\n\nBut I actually **like** to live waiting for something I really want. When I wait - I know that there is a good reason for my heart to pump blood, that there is going to happen something really great (no, it does not mean that I ignore stuff that happens here and now, it's about motivation, not perception). And there is a great reason to pump blood now actually. Dang, I'm so glad I'll see my sister again. After the 2 (or 4?) years-long pause in our talking, I can barely let her go after the meeting... I think deep inside I'm also afraid to loose her like I lost Lena. So yea, it's gonna be a big problem for my brain if anything pervents the meeting.\n\n\n/* But I hate it when there is any \"if\". Like \"if you do that, this will happen.\" Usually I say \"fuck it, I'll just wait till the same thing will be for free.\" */\n\nI don't know why have I wrote this. Just wanted to talk to myself I guess xD\nHave you really thought I'll be writing only interesting stuff? Hahahahaha.. NO."
		},
		{
			"post_id": 61,
			"title": "A Song",
			"date_published": 1458111698.319,
			"body": "Have you ever sung a song to your cat?\n\nI did, and he really liked it =^_^=\n\n<a target='_BLANK' href='https://ipfs.pics/QmSgzpFLVum1Rjkx4MaUf6Hcs8uXRKHXa623pJYXWp3MBy'><img src='https://ipfs.pics/ipfs/QmSgzpFLVum1Rjkx4MaUf6Hcs8uXRKHXa623pJYXWp3MBy'/></a>\n<a target='_BLANK' href='https://ipfs.pics/QmQKm7NP2kPHhJVNTNvwFzespFJJe2NDSxASqgpYUPqg4H'><img src='https://ipfs.pics/ipfs/QmQKm7NP2kPHhJVNTNvwFzespFJJe2NDSxASqgpYUPqg4H'/></a>\n\n<font color=\"CCCCCC\">All images are provided by ipfs.pics</font>"
		},
		{
			"post_id": 60,
			"title": "UPDATES!))))",
			"date_published": 1458111318.465,
			"body": "http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:77:Changelog,+March+15,+2016\n\n...and there is no \"update all\" button(((\nBut he fixed the mail and made it clonable! Cool!"
		},
		{
			"post_id": 59,
			"title": "YEEEAAAAHOOOOOOOO!!!",
			"date_published": 1458068625.554,
			"body": "AAAAAAAAAhhh! At last my sister's fine and my friends are home and everything seem to be just great! I'm so glad!\n\n// yea, and the next evening all plans will be cancelled and cold weather and I won't see neither my sister, nor my friends, and it will be the crappiest evening for a long time....\n\nBUT I'M AN OPTIMIST! =^_^="
		},
		{
			"post_id": 58,
			"title": "Auth Idea 2",
			"date_published": 1458065061.04,
			"body": "[Previous post](http://127.0.0.1:43110/blog.musickiller.bit/?Post:44:Authorization+idea)\n\n##Idea upgrade:\nSo... We have NMC and ZeroNet, right? ZeroNet has plugins, NMC has names. Why do we need NXT if we have NMC already? Can someone create a plugin that will work with NMC's API, checking for the name and giving an answer to the site. This way ZeroID will become a local plugin and there won't be any reppeating names!\n\nGood news is that this thing should be checked only once in a while, so a \"key\" for the site can be used on devices that don't have NMC client installed!\n\nActually I have 2 reasons to propose this:\n- Unlike NXT, NMC is used already\n- As far as I undertand, when names expire they get deleted from the blockchain => less weight of the chain itself. (I can be wrong here. And if I'm wrong, there is a reason to use NXT =D)"
		},
		{
			"post_id": 57,
			"title": "NTX: My Oppinion",
			"date_published": 1458020986.311,
			"body": "## What I liked:\n\n- Interface: It's beautiful, and quite easy to get around. There is a lot of new stuff for a Bitcoin user, but there are tutorials about everything, and you can always ask someone if something is not described.\n- It's not a clone of BTC: means it has almost no problems of Bitcoin. Besides the size and download speen of the blockchain. So it's adequate to make a backup of it on some external drive, so that next time yoh don't have to wait several days to start using the system.\n- It's not only about money. Ok, it is, but I mean that you can do stuff that no common BTC clone has. Lot's of stuff, so I won't count it all here.\n- It's fast: faster than LTC, wich is much faster than BTC. Wich is very nice when you have several accounts or want to send a mesage through the network.\n\n## What I disliked:\n\n- It's not a clone of BTC: wich means it may contain bugs and vulnurabilities beyond BTC's. Comunity is on guard, but still it is something to take into consideration.\n- It's fast. And I'm afraid that it means that the blockchain is growing fast to."
		},
		{
			"post_id": 56,
			"title": "Blog Contents",
			"date_published": 1457990112.756,
			"body": "Last update: 14.04.15\n\n#Guides:\n- [IPFS and ZN Pt.1](http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:11:Streaming with IPFS: HowTo Pt.1)\n- [IPFS and ZN Pt.2](http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:24:Streaming+with+IPFS:+HowTo,+Pt.2)\n- [Zeronet on Android](http://127.0.0.1:43110/blog.musickiller.bit/?Post:38:ZN+on+Android)\n\n# Ideas:\n- [Decentralized Authrization](http://127.0.0.1:43110/blog.musickiller.bit/?Post:44:Authorization+idea)\n- [DA 2](http://127.0.0.1:43110/blog.musickiller.bit/?Post:58:Auth+Idea+2)\n- [DA 3 (new)](http://127.0.0.1:43110/blog.musickiller.bit/?Post:103:@musickiller.bit)\n- [IPFS.pics - accounts](http://127.0.0.1:43110/blog.musickiller.bit/?Post:102:An+idea+for+the+guy+at+ipfs.pics)\n- [ipfs.pics - client](http://127.0.0.1:43110/blog.musickiller.bit/?Post:100:IPFS.PICS+Client)\n- [Native Humor](http://127.0.0.1:43110/blog.musickiller.bit/?Post:76:Native+Humor)\n- [Updatable Torrents](http://127.0.0.1:43110/blog.musickiller.bit/?Post:104:Updatable+torrents)\n- [Z_Blog: Autopublish](http://127.0.0.1:43110/blog.musickiller.bit/?Post:88:AUTOPUBLISH!)\n- [Z_Post Client](http://127.0.0.1:43110/blog.musickiller.bit/?Post:87:Post+Client)\n\n# Stuff:\n- [Free Torrent Client](http://127.0.0.1:43110/blog.musickiller.bit/?Post:91:Free+Torrent+Client)\n- [FTB](http://127.0.0.1:43110/blog.musickiller.bit/?Post:89:BTW,+FTB)\n- [IPFS: Protecting the opressed](http://127.0.0.1:43110/blog.musickiller.bit/?Post:68:New+blog+post)\n- [NXT](http://127.0.0.1:43110/blog.musickiller.bit/?Post:54:New+blog+post)\n- [NXT: Distributed Exchange!](http://127.0.0.1:43110/blog.musickiller.bit/?Post:69:Exchange)\n\n#Bugs and Problems:\n##Unsolved Problems:\n- [Small Touch Screens (read comments)](http://127.0.0.1:43110/blog.musickiller.bit/?Post:85:New+blog+post)\n- [VBBP](http://127.0.0.1:43110/blog.musickiller.bit/?Post:73:Versions%27+big+big+big+problem)\n##Solved Problems:\n- [blog limit 2](http://127.0.0.1:43110/blog.musickiller.bit/?Post:48:DO+YOU+WANNA+LIVE+FOREVER+!!!) - updated! 14.03\n- [blog limit](http://127.0.0.1:43110/blog.musickiller.bit/?Post:41:Blog+limit)\n\n#Films:\n- Legend of Guardians\n- Starship Troopers\n- TPB: AFK\n\n#Music:\n##MP3:\n- Elevator Music\n\n##Music Clips:\n- 23: So Mach Ich Es"
		},
		{
			"post_id": 54,
			"title": "NXT: Roadmap",
			"date_published": 1457969361.398,
			"body": "[NXT: How to get?](http://127.0.0.1:43110/blog.musickiller.bit/?Post:53:New+blog+post)\n[NXT: My First Experience](http://127.0.0.1:43110/blog.musickiller.bit/?Post:47:NXT.)\n[NXT: My Oppinion](http://127.0.0.1:43110/blog.musickiller.bit/?Post:57:New+blog+post)\n[NXT on Android](http://127.0.0.1:43110/blog.musickiller.bit/?Post:49:NXT+on+Android)"
		},
		{
			"post_id": 53,
			"title": "NXT: How to get?",
			"date_published": 1457969283.445,
			"body": "I've tried Shape Shift recently - yes, it's quite fast.\n\nBut then I looked closely at their rates... Man, they are buying at 0.6 and selling at 0.8! I think it's too much.\n\nSo I decided to exchange NXT somewhere else. Any advices? I was thinking of [bter.com](https://bter.com/). Know anything about it?\n\nThe reason why I'm sarching:\n<a target='_BLANK' href='https://ipfs.pics/QmYZfGhJ19hUuwdV61jx4Cjo1uMtvB3iHKkkYba8QGCfqn'><img src='https://ipfs.pics/ipfs/QmYZfGhJ19hUuwdV61jx4Cjo1uMtvB3iHKkkYba8QGCfqn'/></a>\n\n## Interesting answer:\n- http://multigateway.org/"
		},
		{
			"post_id": 52,
			"title": "THANK YOU, for making ZeroNet (better)",
			"date_published": 1457960109.637,
			"body": "[THANK YOU, for making ZeroNet (better)](http://127.0.0.1:43110/zeroblog.bit/?Post:25:THANK+YOU,+for+making+ZeroNet+(better))\n(written by Erkan, but I think everyone around here will agree with him)"
		},
		{
			"post_id": 51,
			"title": "There was a hole...",
			"date_published": 1457950829.871,
			"body": "###Humble Bundle has the Hobbit in the [Book Bundle](https://www.humblebundle.com/books/lord-of-the-rings-audiobooks)!\n\nYou can pay anything starting with $0.01 (even using BTC, though I would not recomend that) and get youself a permanent access to the download (server and torrent, whatever you like)!\n\nIf you pay $15 or more, you'll also get all parts of the Lord of the Ring!\n\nBy purchasing stuff at Humble Bundle you can also support charity!\n\nTry it with $0.01 and pay more if you like it!\n\n###NXT\nIf you have NXT, you can also buy it in the Marketplace for a symbolic price of 120 NXT! Search for \"Humble Audiobook Bundle: Hobbit\" or just by my alias, Musickiller! =D\n\n<a target='_BLANK' href='https://ipfs.pics/QmcQXzVmjMoYttEM3x5MHPHBQ4YpbNATXHF74pcGXa1Dbi'><img src='https://ipfs.pics/ipfs/QmcQXzVmjMoYttEM3x5MHPHBQ4YpbNATXHF74pcGXa1Dbi' alt=\"screenshot on ipfs.pics\"/></a>"
		},
		{
			"post_id": 50,
			"title": "A bug with comments limit",
			"date_published": 1457917819.834,
			"body": "So after all it did not work. =( I think it may be caused by some bug. Ok, here is the full story:\n\nI've reached the 10k limit several times, and several times I tried doferent ways to extend it. Every time I changed content.json inside site's users folder.\n\nFirst time I tried to sign it with zeronet siteSign. Failed. Visual counter updated, limit was not extended.\n\nSecond time I tried to sign it with the buttom in the side pannel. Failed. Then nofish told me that I've just done it wrong: should have designated what content.json have I wanted to sign.\n\nThird time (why do I call that a bug) I did it all right, signed with a side pannel, designated a right way before signing. PC's ZeroNet updated it right. I could post comments up to 11 kb (did not want to write more trash), but now I write this post from tablet, because I've discovered that I can't write any comments from it. A limit here is still on 10k. I dunno what to do. Will report it on Talk yesterday.\n\nStill going to bed now.\n\nGood night everyone!"
		},
		{
			"post_id": 49,
			"title": "NXT on Android",
			"date_published": 1457917018.861,
			"body": "#HOW??!\n\nWanna hear a funny story? It's possible. GNURoot Debian allows. But openjdk-8-jre is 276 MB of additional space + nxt folder is 479 MB and growing (my notebook is only at 15% of the blockchain). So fuck it. I'm goind to bed. Later than I expected, but eventually I'm going there.\n\nPlus blockchain stuff harms ssd and flas devices, so it's RIP sdcard, or internal storage if I'm stupid enough.\n* good to know that I'm not ^_^\n\n#No, really, there are apps..\n\nYes there are apps in the market, but I'll never login with my passphrase in any of them because the best I saw was 100 downloads with 5 likes."
		},
		{
			"post_id": 48,
			"title": "DO YOU WANNA LIVE FOREVER???!!!",
			"date_published": 1457908215.092,
			"body": "It's 9,5k on my chatter-counter and it's time to try to add more. Actually I've done it already and all that's left is to sign a .json. So let's do that!\n\n*probably will just kill my blog again...\n\n** AHA! I've remembered to backup it BEFORE I've killed it! That's some progress!\n\n# Results (or HowTo)\nTo extend limits one have to go to %siteFolder%/data/users, open content.json, add perissions (in the end).\nAnd then sign it in the side panel, but don't just press \"sign\", change it to <code>data/users/content.json</code>!\n\n<a alt=\"ipfs.pics\" target='_BLANK' href='https://ipfs.pics/QmNzsgMbc3uMNU4jQshkWge3xsji33y5sCt4NqniomvTfM'><img src='https://ipfs.pics/ipfs/QmNzsgMbc3uMNU4jQshkWge3xsji33y5sCt4NqniomvTfM'/></a>\n\nAlternatively, you can sign it with <code>siteSign --inner_path data/users/content.json</code> option.\n\nTA DA!!!!!!! I've made it man! I've made it!"
		},
		{
			"post_id": 47,
			"title": "NXT.",
			"date_published": 1457888851.817,
			"body": "Yup, time to discover new (for me) horisons! NXT - you are next! (pun intended)\n# It all started with a bug...\n..As usually. It seems to me that it is my creed to hunt for insects inside and outside of the code. This time my login screen would not change after I entered my passphrase or selected my account. But after some time, I've managed to bypass this insect-urety.\n\n# First questions\n- How do I use account (alias?) system and how do I use it for my site?\n\n*I'll read it all by myself sooner or later, but in case you want to discuss it, you are welcome!!!))\n\n# NXT Assets\n<a target='_BLANK' href='https://ipfs.pics/QmPeFbrn4t7VSbuHC9RXRjkmpaZLh2heAvzKzj7YtRJhdN'><img src='https://ipfs.pics/ipfs/QmPeFbrn4t7VSbuHC9RXRjkmpaZLh2heAvzKzj7YtRJhdN'/></a>\n\n<a target='_BLANK' href='https://ipfs.pics/QmVuDQzZmrwy2bqjs57tSedGUmeaj83jn5t77Wtx98pUH8'><img src='https://ipfs.pics/ipfs/QmVuDQzZmrwy2bqjs57tSedGUmeaj83jn5t77Wtx98pUH8'/></a>\n\n> [ks](#comment_27_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Here's a link to different assets ⌘ https://www.mynxt.info/assets/\n> [ks](#comment_28_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): And currencies ⌘ https://www.mynxt.info/currencies\n\n# Enctypted Messages\nA very cool thing. You can send messages inside NXT network!\n(SMS for geeks?))))\nMore info on it later when I discover it...\n\n<b>To be continued...</b>\n\n<b><font size=\"4\" color=\"#777777\">All images are provided by ipfs.pics</font></b>"
		},
		{
			"post_id": 46,
			"title": "Mommy, I wanna go back to school >.<",
			"date_published": 1457885620.171,
			"body": "##Be an egineer they said. It's gonna be fun they said...\n\n<a target='_BLANK' href='https://ipfs.pics/QmYKp4L5LYSRYXoXVeyuczyDa3TmJEZA44eErAF1MvAufS'><img src='https://ipfs.pics/ipfs/QmYKp4L5LYSRYXoXVeyuczyDa3TmJEZA44eErAF1MvAufS'/ alt=\"ipfs.pics (please wait!)\"></a>"
		},
		{
			"post_id": 45,
			"title": "Идея коин-авторизации",
			"date_published": 1457871626.626,
			"body": "[In English](http://127.0.0.1:43110/blog.musickiller.bit/?Post:44:New+blog+post)\n\n<font color=\"#AAAA00\">Устарело! Лучше читай английскую версию!</font>\n\nКак я вижу реализацию идеи универсальной (не привязанной к конкретному сайту) децентрализованной авторизации:\n\n#Как оно работает\n##Регистрация:\nКлиент создаёт акаунт в *coin системе. Я не уверен, что оно должно быть бесплатным, т.к. хранение информации в децентрализованной системе - не так дёшево, как на обычных серверах. В этом смысле, NameCoin - хороший пример того, как можно устроить систему хранения\n\n##Авторизация\n(копировал с Ru-ZeroTalk практически без изменений. лучше читай английскую версию)\n- Для авторизации на сайте А нужно сделать транзакцию в 0.0 коинов на его адресс, передав определённый код, который сайт выдал клиенту. Таким образом, сайт запомнит, что с этим компьютером связано именно это имя. Естевственно, есть определённая комиссия, которую клиент платит для того чтоб кто-то просчитал эту транзакцию на своём компе. Но комиссия достаточно низкая чтоб при желании можно было авторизовываться хоть каждый день или несколько раз в день (общий компьютер).\n- Для авторизации на сайте Б нужно ежемесячно платить деньги (порносайт?) каждый месяц. Тогда клиент делает транзакцию в Н коинов на сайт и сайт авторизует его компьютер.\n\n#Чем это лучше обычной авторизации\n- Не надо раскрывать свой ключ\n- нет единого сервера.\n\n#Мои вопросы\n- нет ли УЖЕ такой системы?\n- Нельзя ли так делать в неймкоине или каком-нибудь NXT?\n\nОтвет: http://127.0.0.1:43110/kappasigma.bit/?Post:6:Authentication+with+NXT+tokens"
		},
		{
			"post_id": 44,
			"title": "Authorization idea",
			"date_published": 1457867438.717,
			"body": "[По русски](http://127.0.0.1:43110/blog.musickiller.bit/?Post:45:%D0%98%D0%B4%D0%B5%D1%8F+%D0%BA%D0%BE%D0%B8%D0%BD-%D0%B0%D0%B2%D1%82%D0%BE%D1%80%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8)\n[Next Post](http://127.0.0.1:43110/blog.musickiller.bit/?Post:58:New+blog+post)\n\n##Table of contents:\n###My (not very good?) ideas\n- Registration\n- Authorization\n- Why to make it decentralized?\n- What I could not grasp\n\n###People's suggestions (look there!)\n- NXT\n\n##Let us begin?\nI was thinking, how to unificate current and future authenfication systems with the use of Namecoin and came to some conclusions.\n\nI'm not sure if namecoin will do, if it would, please tell me so!\nThat's how I see a decentralized authenfication system:\n\n#How would it work\n##Registration:\nA client creates an account inside a *coin system. But I'm not sure if it should be free. Namecoin is great because to maintain a name you have to pay a small summ. I think that should be true here, because this name has to be stored, and disc storage in decentralized system is not as cheap as it is on a common server.\n##Authorization\n- A common site: client makes 0 coin transaction on an address, provided by site, and in the tranzaction, some secret key (or simply computer address?) is stored that a site gives to a client. Secret key is needed because several computers may require an authorization at the same time and the key would show which computer is a real one.\nWhen succeded, site authorizes client and remembers his computer (with a cookie?). There is a transaction fee, because someone has to process this authorization. But it is low enough that a client can use the service once or even several times (extra security = extra money) a day if needed.\n\n- A site with a monthly fee: client makes N coin transaction (defined by the site)... and everything else is just the same!\n# Why is that better\n- Unlike common authorization services, it's impossible to guess client's password.\n- It's a fully distributed authorization service.\n\n#My questions:\n- Can any existing coin system be used?\n- That means, can any system send 0.0 coin transaction?\n- And can this system send extra info (secret key) if needed.\n\n#Good answers:\n- <a target='_BLANK' href='https://ipfs.pics/QmZGFibFpQWmHGQTeij3oDJxKVDmWVKyXYG5R2359JqgeR'><img src='https://ipfs.pics/ipfs/QmZGFibFpQWmHGQTeij3oDJxKVDmWVKyXYG5R2359JqgeR' alt=\"Some IPFS.pics problems. You should have instelled IPFS when I told you!\"/></a>\nBut then again, is Proof-of-Stake [reliable](https://en.wikipedia.org/wiki/Proof-of-stake#Criticism)?\n- http://127.0.0.1:43110/kappasigma.bit/?Post:6:Authentication+with+NXT+tokens"
		},
		{
			"post_id": 43,
			"title": "Cold?",
			"date_published": 1457827593.381,
			"body": "A great way to heat up the room:\n<code> oclvanitygen 111111111111 </code>\nAdd more(less) \"1\" as more (less) heat is needed.\nor just run <code> oclvanitygen -k 1 </code> and wait till your PC becomes Personal Oven ^_^"
		},
		{
			"post_id": 42,
			"title": "MY MAIL!",
			"date_published": 1457822768.437,
			"body": "Is it me or ZeroMail is only showing last 20 messages???? O_O"
		},
		{
			"post_id": 41,
			"title": "Blog limit",
			"date_published": 1457819342.337,
			"body": "I've hit 10k limit on my blog again.\nNo one helped last time, so I ask again. How to make those \"permissions\" work???\nI can't. I'm deleting my comments =(\nAFK till I'm done.\n\n- done.\n- was told to use --inner_data_path when I sign content.json. Will do next time.\n\n<a target='_BLANK' href='https://ipfs.pics/QmRBFp3KbuSszNAbSAPhQPa9FRmTM3U2rjC2mBywjWbtZu'><img src='https://ipfs.pics/ipfs/QmRBFp3KbuSszNAbSAPhQPa9FRmTM3U2rjC2mBywjWbtZu'/></a>\n\n(so that I would not forget how to sign next time)\n\nAnd now...\n#How to do it right:\n<a target='_BLANK' href='https://ipfs.pics/QmP7p731tq71FNiASw4igshmvpb1QYBbsz4WdEWu4bDRZH'><img src='https://ipfs.pics/ipfs/QmP7p731tq71FNiASw4igshmvpb1QYBbsz4WdEWu4bDRZH'/></a>"
		},
		{
			"post_id": 40,
			"title": "Benchmarks",
			"date_published": 1457817527.478,
			"body": "# HTC Desire 310 DualSim\n<a target='_BLANK' href='https://ipfs.pics/QmUvcXMWYPins23MH7ky9GqDszrtjS7w98KgNhHVF9LYCr'><img width=\"300\" src='https://ipfs.pics/ipfs/QmUvcXMWYPins23MH7ky9GqDszrtjS7w98KgNhHVF9LYCr'/></a><a target='_BLANK' href='https://ipfs.pics/QmaYuUuVJqHQ4HLxd2sRYjMUcEzVfQw25ixaK8erYPwexR'><img width=\"300\" src='https://ipfs.pics/ipfs/QmaYuUuVJqHQ4HLxd2sRYjMUcEzVfQw25ixaK8erYPwexR'/></a>\n\n# SM-T531\n<a target='_BLANK' href='https://ipfs.pics/QmNMhagy7KtqWhKZjNoyCQVFxrvxTx44L7D8spvgjuF2Qv'><img src='https://ipfs.pics/ipfs/QmNMhagy7KtqWhKZjNoyCQVFxrvxTx44L7D8spvgjuF2Qv'/></a>\n\nAs you can see, results are quite sad. And I have to agree with them: when sites start to update all at once, I have to find some other 1-2 minute task to do.\n\nBut when all sites are up to date, browsing is as pleasurable as it is on PC. =))\n*not on a phone though. Phone is too small for this sites. It was just an experiment and I still use it coz it cost less energy (smaller screen etc.)"
		},
		{
			"post_id": 39,
			"title": "ToDo",
			"date_published": 1457814922.138,
			"body": "- Update blog\n- Delete old ToDos"
		},
		{
			"post_id": 38,
			"title": "ZeroNet on Android (easy way)",
			"date_published": 1457808671.999,
			"body": "<font size=\"3\"><font color=\"#77AA00\">Status: Kind of ready</font></font>\nHELP ME TO FINISH THIS!\n\nBefore we start,\n- I call it an easy way, because the hard way is to find a Python 2.7 for android (or compile it???) and do it \"the right way\". And this way is wrong because [GNURoot](https://play.google.com/store/apps/details?id=com.gnuroot.debian) is about 500 MB.\n- It's only \"easy\" if you worked with terminal before. If you did not, <b>don't even DARE writing comments here!!!</b>\n- Русским и братьям Словянам (to RUSSIANS): я тоже русский и тоже когда-то не понимал английский. Учите. Пригодится. Тут мало что переводить надо, переводчик справится. Если пару слов не понятно, спросите в коментах или по почте. Нытьё типа \"я идиот, ничего не понимаю\", или \"автор идиот, потому что я ничего не понимаю\" - не принимается. Ждите пока я или кто-то ещё переведёт вам.\n\n\n#1. Install [GNURoot Debian](https://play.google.com/store/apps/details?id=com.gnuroot.debian)\n(does not require root, creator thinks it's obvious from the name o_O)\n- After installation, launch, tap \"install\" and \"patch\"\n(not sure if patch is required, but it takes no time at all if not)\n- After that tap \"Launch\"\n\n#2. Follow steps from [ZeroNet setup page](http://zeronet.readthedocs.org/en/latest/using_zeronet/installing/), or this, <s>trashed</s> refined by me\n\n1. <code>apt-get update</code>\n2. also a good idea to do <code>apt-get upgrade</code>\n3. <code>apt-get install msgpack-python python-gevent</code>\n4. here is a VERY good idea to go to /home folder by <code> cd ~ </code>\n\n5. Next, you can either\n\n\t5.1. <code>wget https://github.com/HelloZeroNet/ZeroNet/archive/master.tar.gz\ntar xvpfz master.tar.gz</code>\n\n\t5.2. Or instad of this, you can download this file in a browser and unpack it into <code>/GNU*/home/</code>\n\n6. <code>cd ZeroNet-master</code>\n7. Just to doublecheck I tun <code>python update.py</code>\n8. And start with<code>python zeronet.py</code>\n\n#3. How to start in the future:\n- If terminal is trarted, tap on it in the drop-down menu\n- If not, open GNURoot Debian and tap Launch\n\nIn the terminal run\n<code> cd ~/Z*\npython zeronet.py</code>\n\n\nHELP ME TO FINISH THIS!\n\n#4. Tips and Tricks\n- usually you can replace stuff like \"zeronet.py\" with \"z*\", but because there is \"zeronet.pyc\", I don't do that. Correct me if I'm stupid ^_^\n- you can run previous commands with \"volume button\"+\"w\" even after reboot. Awesome. Linux rulez!\n- Debian need not your childish sudo! Just do it as a real SuperUser!\n- I could not create symbolic links on Android, so I did it like I wrote it here. (tar says \"can't create symbolic links\")\n- on startup (and after adding several new sites) wait for several minutes while all your sites get updated. Don't use zeronet, or it will be very laggy and sites will get \"timeout\" error.\n\n#5. Other use<s>less</s>full info\n\n- no it does not eat ALL the battery. On the phone (yes, I did that on the phone too!) it's not notisable, on the tablet... a bit. May be it's not coz of ZN. I had troubles like that before.\n- no it does not take all CPU or memory. Very kind to those ones actually\n- no it does not eat all your traffic. My 70 MB/day are MUCH more than enough for ZN + other browsing + apps. If you don't belive me, sync at home and work, and use it without network when on the move (don't, it's stupid) =) However, I only tested that with few sites on the phone, I still sync tablet at home. But I plan to test it with \"full power\" some day. Tested? comment here or write me on the mail so that I add more info!\n- yes, it's pretty cool, but don't share it with your stupid friends that ask \"what for did you do this?\" (I forgot what I wanted to write here, but this will do))))\n- you CAN'T drag \"0\" button. Or I can't.. May be you'll find a way?? To post stuff you have to edit site's properties to \"own\": \"true\" in a text editor.\n- benchmarks showing how sucky python is on a droid (trust me it's not that bad xD) http://127.0.0.1:43110/blog.musickiller.bit/?Post:40:New+blog+post\n\n- we need to make this guide better, help me! Also translate it to other languages. And to Russian too, they won't let me be in peace if someone won't do that..."
		},
		{
			"post_id": 37,
			"title": "Still not ready with my android tutorial",
			"date_published": 1457806062.905,
			"body": "But you can check out this nice video!\nA version with subs is here: http://127.0.0.1:43110/1NXZEk3SupketTvbRxaXCERa1E9Es9hi4a/\n\n<center><video width=\"800\" controls>\n<source src=\"http://127.0.0.1:8080/ipfs/Qmcr3RdeZaoLW4636qCD7icdPPwiCS8VjFXNkeYBXX1R4B\" type=\"video/mp4\"></source>\n<source src=\"http://ipfs.io/ipfs/Qmcr3RdeZaoLW4636qCD7icdPPwiCS8VjFXNkeYBXX1R4B\" type=\"video/mp4\"></source></video></center>"
		},
		{
			"post_id": 36,
			"title": "Starship Troopers (with no subs again. it's browser's problem)",
			"date_published": 1457794395.061,
			"body": "Writing a guide for you, lazy-ones!)))\nWhile you can enjoy one of my most favourite movies ever! =D\n\nДля русских и особо умных, повторяю: гайд пока не готов, ещё пишу. Вот фильмец пока на IPFS залил, можете посмотреть, английский поучить.\n\n# Starship Troopers 1997 720p BrRip x264 YIFY\n\n<center><video width=\"800\" controls>\n<source src=\"http://127.0.0.1:8080/ipfs/QmXx7PNhG8PhgeQMzipXRUdXXmLT3WUkam87WsQJ7kGPXN/\" type=\"video/mp4\"></source>\n<source src=\"http://ipfs.io/ipfs/QmXx7PNhG8PhgeQMzipXRUdXXmLT3WUkam87WsQJ7kGPXN/\" type=\"video/mp4\"></source>\n<source src=\"http://ipfs.pics/ipfs/QmXx7PNhG8PhgeQMzipXRUdXXmLT3WUkam87WsQJ7kGPXN/\" type=\"video/mp4\"></source>\n<track src=\"http://127.0.0.1:8080/ipfs/QmazgQ21hVV1xr6Y4kAg6cimSApm6oMXaAyc5xUre5zihN\" kind=\"subtitles\" srclang=\"en\" label=\"English_Local_IPFS\"></track>\n<track src=\"http://ipfs.io/ipfs/QmazgQ21hVV1xr6Y4kAg6cimSApm6oMXaAyc5xUre5zihN\" kind=\"subtitles\" srclang=\"en\" label=\"ipfs.io\" default></track>\n</video></center>\n-------------\n# Notes:\n\n- ! Video seem to be only working on Firefox well. (but without subs) Other browsers seem not to support .mkv container =(\nOn one hand, they are browsers, not media players, on the other hand, who cares? HTML5 has video tag, why not to implement some support or at least some plugins from video players?????\n\n- the same as to [the previous one](http://127.0.0.1:43110/blog.musickiller.bit/?Post:27:I%27ll+be+watching+a+movie.+Care+to+join+)\n- reppeating that, use IPFS (on 8080)!\n- Please comment on subs, I tried to add them again.\n- source: https://thepiratebay.cr/torrent/11879066/Starship_Troopers_%281997%29_1080p_BrRip_x264_-_YIFY\n\nдля русских и особо умных, повторяю: фильмец пашет только на огнелисе. Хорошо пашет с ИПФС (но тоже только в краснолисом браузере). Сабы не работают, потому что их (в том же огнелисе) не допилили."
		},
		{
			"post_id": 35,
			"title": "Killed and resurrected again.",
			"date_published": 1457793137.54,
			"body": "It becomes a tradition to kill and to restore my blog from time to time.\n\nThis time I was trying to add \"domain\" into .json file. I did not turn ZeroNet off before publishing, something gone wrong, and I could not comment again. Any fixes I tried did not help. Before I never backed up my site, so officially it died again.\n\nThen I remembered that several minutes (an hour?) ago I've turned wi-fi off on my tablet, wich meant that a copy there was still working!AHA! Using Sync I shared a copy to my notebook (new backup place) and my PC (fast way to share). Now it's back to life, but I'm gonna try adding \"domain\" again, so stay tuned, may be quite fun! =D\n\nIf anyone posted any comments in that hour, they should be lost. please reppeat!"
		},
		{
			"post_id": 34,
			"title": "blog.musickiller.bit IS ALIVE!!!",
			"date_published": 1457787333.812,
			"body": "Thanks to great nofish, all *.musickiller.bit sites are up and running!\n## Ready:\n- musickiller.bit - just a list, gonna change. may be.\n- blog.musickiller.bit - this blog\n- pingpong.musickiller.bit - a game on JS\n## Gonna be some day:\n- pics.musickiller.bit - pictures from ipfs.pics\n- guide.musickiller.bit - I have a couple of guides, let's make a site so that ppl did not have to waste extra MB every time I update blog status or any other tiny thing!"
		},
		{
			"post_id": 32,
			"title": "I love it =D",
			"date_published": 1457778245.983,
			"body": "<img src=\"https://ipfs.pics/ipfs/QmPQN7bUeCsYpLzkcNRWicE6C2o4XAG96x2AANNRz9J3aL\" alt=\"WTF?!! it should work!\">\n\nI think I'll make a site with pics from IPFS.pics =D"
		},
		{
			"post_id": 31,
			"title": "A post from the phone",
			"date_published": 1457762571.805,
			"body": "It was not easy, but I did it!!! Next time I use a magnifying glass xd\n\nI've proved that it's possible, now <b>PLEASE</b> make it comfortable!\n\nSome pics:\nOS readying:\n<a target='_BLANK' href='https://ipfs.pics/QmRe2VEZH2M13sXz8sWnz5xNsrATmbLbHxiuSrVTaj9Qf7'><img width=\"300\" src='https://ipfs.pics/ipfs/QmRe2VEZH2M13sXz8sWnz5xNsrATmbLbHxiuSrVTaj9Qf7'/></a>\n\nZHello and this blog:\n<a target='_BLANK' href='https://ipfs.pics/QmXDC9AfudhUYbHmPVYNUCq7mQWANZCbi6x8fnCFDJTEvN'><img width=\"300\" src='https://ipfs.pics/ipfs/QmXDC9AfudhUYbHmPVYNUCq7mQWANZCbi6x8fnCFDJTEvN'/></a><a target='_BLANK' href='https://ipfs.pics/QmXsK9q7jbmUDwKvcCGSCpcpNAdG3pktEB3hU6cwwsjSKb'><img width=\"300\" src='https://ipfs.pics/ipfs/QmXsK9q7jbmUDwKvcCGSCpcpNAdG3pktEB3hU6cwwsjSKb'/></a>\n\nTerminals:\n<a target='_BLANK' href='https://ipfs.pics/QmPFjeM6En1QrKjy8UG5pH8Ac8FL8ZKp2opVcVpmtvxkTu'><img width=\"300\" src='https://ipfs.pics/ipfs/QmPFjeM6En1QrKjy8UG5pH8Ac8FL8ZKp2opVcVpmtvxkTu'/></a><a target='_BLANK' href='https://ipfs.pics/QmWtMmbJZPiju8Cb4wHQ6XXJpTzqSDjVmVYjbBUNbymB1L'><img width=\"300\" src='https://ipfs.pics/ipfs/QmWtMmbJZPiju8Cb4wHQ6XXJpTzqSDjVmVYjbBUNbymB1L'/></a>\n\nReal small button that I can barely push from fifth attempt:\n<a target='_BLANK' href='https://ipfs.pics/QmQd2LTzfTxHFNxGnrpZyKtfAdE1NV9h8YUWbmo11XepDZ'><img width=\"300\" src='https://ipfs.pics/ipfs/QmQd2LTzfTxHFNxGnrpZyKtfAdE1NV9h8YUWbmo11XepDZ'/></a>\n\nA hero of the story: Android 4.2.2 @ HTC Desire 310 DualSim ($60 phone! xD)\n<a target='_BLANK' href='https://ipfs.pics/QmYr1ByYNL3rd7LBZMkyWgor6tPKEZTL1cJkLoWXfhkdcm'><img src='https://ipfs.pics/ipfs/QmYr1ByYNL3rd7LBZMkyWgor6tPKEZTL1cJkLoWXfhkdcm'/></a>\n\nAnd here we are: my half-breathing old-crap Android based HTC of $60 can run ZeroNet without a lag, what can your shiny-ass iPhone do? 8)"
		},
		{
			"post_id": 29,
			"title": "Mornings",
			"date_published": 1457674753.498,
			"body": "Do you know what I <b>hate</b> in the morning?\n\nWell.. Just imagine: You open your eyes and you are 7 minutes early and all you think is \"oh, sure 7 minutes is enough for a good healthy sleep!\" So you close your eyes and just as you do that, you are awoken by an alarm. You think \"Now it feels much better! Now it is my second alarm and it's the perfect time to get up!\" You look at the clock and \"Oh fuck! It's my third alarm! I'm 30 minutes late! Then you blink, just to get that sleepyness out of your head, to water your eyes, and bam! It's your fourth alarm clock, and it's 1,5 hour too late!\n\nSo today I have sit up in the bed, tired of being angry about something that happens almost every single day, took my phone to see what classes have I missed and what else won't harm to miss (the usual thing), saw that today is a bad day to miss anything (the unusual thing)... saw that I'm actually 2,5 hours late... Why does it have to be this way?\n\nOh, I do remember time when I would get up just before my first alarm, and be glad that I am awake and eager to live through the day. When I was glad to see everyone and know that I do have a purpose... Every time I fall (or better say \"throw myself\", because I really do that intentionally) in love, everything is so much easier! I don't even get up - I awake sitting in my bed, staring at the watch, counting every second. And even if I do lay down again, it's not because I'm sleepy or tired, it's because I'm so overwhelmed by emotions that I can't stand or even sit straight!\n\nI miss that feeling. It was too long since the last time. Just as I predicted, I did not fall those last two times. It's good, it was not worth it, but it's also bad. Every time it's over, it is as if someone unplugs a power cable. I know I have a lot of power on my batteries and it won't harm to stay on my own for some time, to re-evaluate what happened, rethink everythink, recalculate, to make it better next time. But eventually, and always too soon, I run out of energy and everyday I wake up with more and more sad emotions and thoughts in my head. Or even worse, sometimes it's not sadness, but emptiness. A clean vacuum that (*looks at the time*)... well... sucks.\n\nSorry, I don't have enough time. I'm 3.5 hours late and counting. Counting too fast. May be I'll finish it later. I still hope I won't. Hope it get's better sooner.\n\nDamn, I hope my sister won't read it coz she needs a support now, not this... Good news ZeroNet is not exactly the same thing as internet and you can't just stumble on this page.. May be that's why I'm here?"
		},
		{
			"post_id": 28,
			"title": "Movie: Results",
			"date_published": 1457639788.359,
			"body": "The actual reason I've posted it was that I wanted to test a movie on html5 with subs.. but subs I could not add (even though I've wasted an hour trying) and additional languages (audio) are not supported by HTML5 at all. Sucks.\n\nWhat do you think? what type of videos would you prefer on ZeroNet? IPFS? As additional files inside ZN? Just magnets so that you could watch them somehow else?\n\n\nP.S. 2010... As if it was yesterday or even this day's morning.. =((("
		},
		{
			"post_id": 27,
			"title": "I'll be watching a movie. Care to join?",
			"date_published": 1457631299.591,
			"body": "YARRRR! Long live The Pirate Bay!\n\n# Legend of the Guardians (2010) 720p BrRip x264 - 650MB - YIFY\n##Notes:\n- It's a big file and I <b>URGE</b> you to use your own IPFS to stream it.\n- But this video has gateways in it's sources so you can watch it anyway.\n- If your IPFS port is not 8080, rightclick on the video, click on \"copy link\", paste in your browser. Change as needed.\n- FULLSCREEN: rightclick -> Full Screen\n- On a tablet, just scale it to your linkng\n- Guys on windows may use a new feature on TPB: you can plug smth in your browser and watch a movie just like that. So I'll leave a link for you\n- You can download <b>subtitles</b> and additional stuff on fs://ipfs/QmaBpVAmf6w3NyB9gR92Z3UjZiBxCQQNZ7CtkuanAuy3ak/\n- on Linux you can do <code>ipfs mount</code> and *stream* it with *subtitles* as if it was in a folder on your PC! Just like a Torrent Time but on Linux!!! And without a web browser running!\n- I've added subs to web version, but they don't seem to be working =(\n- Enjoy while those gov rats are ashore!\n## Movie:\n<center><video width=\"800\" controls>\n<source src=\"http://127.0.0.1:8080/ipfs/QmbNeJn4mmRiwZXkENmUB5HjzLgDYz5MtZ4pbJaqSLCZQ8/\" type=\"video/mp4\" />\n<source src=\"http://ipfs.io/ipfs/QmbNeJn4mmRiwZXkENmUB5HjzLgDYz5MtZ4pbJaqSLCZQ8/\" type=\"video/mp4\" />\n<source src=\"http://ipfs.pics/ipfs/QmbNeJn4mmRiwZXkENmUB5HjzLgDYz5MtZ4pbJaqSLCZQ8/\" type=\"video/mp4\" />\n<track kind=\"subtitles\" label=\"Subs from ipfs.io\" src=\"http://ipfs.io/ipfs/QmVv8W33MGuw4Gd2G4PmdXWd39Hvd7vb8rtA4wWsosRDd2/\" srclang=\"en\" />\n<track kind=\"subtitles\" label=\"Subs from IPFS\" src=\"http://127.0.0.1:8080/ipfs/QmVv8W33MGuw4Gd2G4PmdXWd39Hvd7vb8rtA4wWsosRDd2/\" srclang=\"en\" default />\n<track kind=\"subtitles\" label=\"Subs from ipfs.pics\" src=\"http://ipfs.pics/ipfs/QmVv8W33MGuw4Gd2G4PmdXWd39Hvd7vb8rtA4wWsosRDd2/\" srclang=\"en\" />\n</video></center>\n#Links\n- [On The Pirate Bay](http://thepiratebay.cr/torrent/7286955/Legend_of_the_Guardians_%282010%29_720p_BrRip_x264_-_650MB_-_YIFY)\n- [magnet](magnet:?xt=urn:btih:1f84348aae70053530dcd52a4b2ad88eaa8282e9&dn=Legend+of+the+Guardians+%282010%29+720p+BrRip+x264+-+650MB+-+YIFY&tr=udp%3A//tracker.openbittorrent.com%3A80&tr=udp%3A//open.demonii.com%3A1337&tr=udp%3A//tracker.coppersurfer.tk%3A6969&tr=udp%3A//exodus.desync.com%3A6969)"
		},
		{
			"post_id": 26,
			"title": "Adobe Flash for Android",
			"date_published": 1457614040.469,
			"body": "Inerested? Have money? Here, take. And remember, you never saw me.\n(WhiteNet)\nRu: https://xakep.ru/2016/03/10/fake-flash-player-4-android/\nEn: http://www.welivesecurity.com/2016/03/09/android-trojan-targets-online-banking-users/"
		},
		{
			"post_id": 25,
			"title": "First Post from a Tablet",
			"date_published": 1457611306.993,
			"body": "Now I can lay on my back in my bed and you all'll juss envy me.\nNo proxies ~ security. No chairs ~ healty spine. Me = smartass.\n\nAlso that means less connection problems, since my notebook's net is unbareable!"
		},
		{
			"post_id": 24,
			"title": "Streaming with IPFS: HowTo, Pt.2",
			"date_published": 1457559735.045,
			"body": "State: <font size=\"5\"><font color=\"#777700\">Ready?</font>\nShare your opinion! Tell what to add!\n<font color=\"#AAAA00\">May be moved to a separate page!</font>\n</font>\n[Part1: Installation](http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:11:Streaming%20with%20IPFS:%20HowTo%20Pt.1)\n# Part 2: Embedding and Streaming\n\nHello back! I've decided to split this thing into 2 posts (at least before I move it somewhere) because due to gigantic fonts in this blog, it's easier for me to edit this post this way.\n\n## 4. Write a post with video tag\n\nhttp://www.w3schools.com/htmL/html5_video.asp\nhttp://www.w3schools.com/tags/tag_video.asp\n\nsource 1: http://127.0.0.1:8080/ipfs/[hash]\nsource 2: http://ipfs.io/ipfs/[hash]\nsource 2: http://ipfs.pics/ipfs/[hash]\n\n\n(I'm posting it like that so that ppl can start, I will add more info and tricky parts a <s>bit</s> later)\n\nPlease tell me if you find any errors! Thanks!\n\n# Browser Addon\nUse it to redirect all links leading to gateways to your local IPFS instance.\n(VERY USEFUL!) (works for pictures in this blog)\nhttps://github.com/lidel/ipfs-firefox-addon\n\n# ToDo:\n- problems with sharing download links to videos (and files) through ipfs.io\n- <s>finish \"windows\" part.</s> DONE!\n- change \"mac\" part to something different. May be.\n- read questions ppl ask and write answers both in comments and in blog posts. (it's the cool part. I'm needed. And smart! ^_^ awesome!)))\n- tricks about using IPSF, like <s>browser addon</s> and smth else that I forgot now"
		},
		{
			"post_id": 23,
			"title": "Newbie Analitics",
			"date_published": 1457558600.02,
			"body": "I know, I know, they did not learn us to work with money, they <s>learned</s> tried to learn us to build planes... But still I wanna have a say here:\n\n<a href=\"http://ipfs.pics/QmYKsWXufNUfRowHqDctM2yRsFqWsh9LgHGFzaWm8DFeQL\">\n<img src=\"http://127.0.0.1:8080/ipfs/QmYKsWXufNUfRowHqDctM2yRsFqWsh9LgHGFzaWm8DFeQL\" alt=\"Set up your IPFS to :8080 or click me!\"></a>\n\nEven if you don't plan to use it, it won't hurt to buy 1 NMC ($0.6 now) and live for many ears using it, before it becomes popular =D\n\nAs usually, I will be glad to discuss it in comments =D"
		},
		{
			"post_id": 22,
			"title": "Русский",
			"date_published": 1457554369.171,
			"body": "Q: Буду ли я вести блог по русски?\nA: Naaaw, I don' think so!))\n\nI'm too lazy to translate every piece of junk that comes into my head. And it would take more than twice as much time to write posts in 2 languages. Plus my Russian grammar is not so much better than English grammar (if it is better), and I don't want any extra <s>shame</s> fame on my shoulders..."
		},
		{
			"post_id": 21,
			"title": "Reasons to use IPFS",
			"date_published": 1457553331.798,
			"body": "<s>// will be moved as well</s> not worth it\n## 1. Save Space\nAs you all know, sites on ZeroNet are shared between all users who access them. I'm not sure how not essential files work, so let's assume that all of the files are shared between all the users. That would mean that if you visit a blog to read some news, you would also need to DL all the data the site contains. Multipage sites are not popular on ZN, so you will have to DL all the content as soon as you enter the first page.\nBut in case of IPFS, you can specify what files to pin and what files will be automaticly deleted.\n\n## 2. Save YOUR Space\nIn case of IPFS, you may decide to store NO data at all and use gateways provided for free. Ofcourse it harms decentralization and costs some power to those who host gateways, but this way you can watch films on your phone if you want to.\n\n## 3. The same thing actually\nYes, to tell you the truth if creators of ZeroNet solve the problem with big files, there will be no need for IPFS here. But until then, you don't really have a choice ;D\n\n## 4. DAG\nThe algorithm used in IPFS pervents the creation of copies of a same file. If a user is trying to upload a file that already exists on IPFS, it will be merged. (How awesome is that?!!)\n\n# What I think\nI think that guys should unite. ZN has great dynamic file sharing technology, IPFS is good at large static file transfer. Work together guys! Let's build that decentralized net you were talking about together! =D"
		},
		{
			"post_id": 16,
			"title": "The blog is UNdead (again)",
			"date_published": 1457528034.058,
			"body": "I've fixed the blog and I think it's time to tell you my understandment of what has happened here.\n\nI belive it to be a bug: when user data limit is reached (see that little numbers near your comments? they have a tooltip!),  he is temporary banned, until he eraces enough messages to be back under limit. Problem with my case was that the last comment I wrote was huge. And I suppose that caused a bug: site rejected my auth_key and I could not even delete my old comments.\n\nSo if you ever get close to that 10 kb limit, tell me, I'll add some more space for you. The reason I got there so fast is... My emotional intability? Anyway, I post too much separate small comments. And because each comment is a json line with all the data like what post it's from and it's number etc., so it really does matter when I post 5 comments with 5 words in each... So I have to find a balance between limiting my freedom of \"SpEeCh\" and my readers' disk space saving.\n\n# How to fix?\n\nThat's easy. As usually I was thinking in the right direction, but lack of skill was too great.\n\n1. Open this file:\n<code> ZeroNet/data/[site]/data/users/content.json</code>\n2. Find this:\n<code>\"permissions\": {\n   \"banexample@zeroid.bit\": false,\n   \"nofish@zeroid.bit\": { \"max_size\": 20000 }</code>\n3. add a user you need, and the limit you wish to grant (don't forget that all the data is stored on every machine!!)\n4. in case you already have the same error I had, either open user's folder / data,json and delete some messages, or just delete user's folder.\n5. Sing  and Share!\n6. Tell others how to do that!! You may give this post's link, I guess =)\n\n# Wanna ask u smth\n\nSo now I lost all my comments... GOTTA WRITE MORE!\nBut!.. in order to find a less temporary solution, I am going to ask you to ask your questions on my zeromail. At least long questions. And surely offtopic questions go to the mail. Commenting posts is ok, it's cool, this way I know you read me, but let's not overdo again ;D\n\n## Tip:\n\nIn your comments youse citation (not only here, everywhere!), a short line or 2 words help in rebuilding a dialog when one user decides to erace his comments."
		},
		{
			"post_id": 13,
			"title": "About IPFS (Demonstration)",
			"date_published": 1457480986.178,
			"body": "<center>\nSince I was asked about it once, let's host it here! =D\n(source: ipfs.io)\n<video width=\"640\" controls>\n<source src=\"http://127.0.0.1:8080/ipfs/QmVvXMcq4xC3EZp8JMP4KGCWkynAEDguqZ8LtMVBtxJ67p\" type=\"video/mp4\">\n<source src=\"http://ipfs.io/ipfs/QmVvXMcq4xC3EZp8JMP4KGCWkynAEDguqZ8LtMVBtxJ67p\" type=\"video/mp4\">\n<source src=\"http://ipfs.pics/ipfs/QmVvXMcq4xC3EZp8JMP4KGCWkynAEDguqZ8LtMVBtxJ67p\" type=\"video/mp4\">\nYour browser does not support the video tag.\n</video>\nClick with a right mouse button if you want to go fullscreen!\n</center>"
		},
		{
			"post_id": 11,
			"title": "Streaming with IPFS: HowTo Pt.1",
			"date_published": 1457456328.698,
			"body": "State: <font size=\"5\"><font color=\"#00AA00\">Ready?</font>\nShare your opinion! Tell what to add!\n<font color=\"#AAAA00\">May be moved to a separate page!</font>\n</font>\n#SWIPFS HowTo Part1: Installation\n##  Get IPFS\n1. Open https://ipfs.io/\n2. Click \"Install IPFS\"\n3. Choose your OS and download a package\n\n# Install\n## On Linux:\n1. use install.sh\n2. When completed, run in console:\n\t<code>ipfs init\n\tipfs daemon</code>\n3. U can start in on system start with no terminal open. (Cool! Use Linux!)\n\n## On Windows:\n1. Create a folder for IPFS and move ipfs.exe there\n2. Add IPFS.exe to your PATH\nI. Press Win+Pause\nII. Advanced system parameters\n<font size=\"3\">(Дополнительные параметры системы)</font>\nIII. [smth] variables\n<font size=\"3\">(Параметры среды)</font>\n<font size=\"3\" color=\"AA0000\">Help me to translate this please!</font>\nIV. Find PATH, push, select \"Edit\"\nV. Add your new folder which contains IPFS\n3. Run CMD.EXE (Ctrl+R, CMD, Enter)\n4. Run\n\t<code>ipfs init\n\tipfs daemon</code>\n### Note:\nOn Windows you can't hide console. Keep it runnin'!\n(if you can, tell me how and I'll update this post)\n\n##On Mac:\n1. Buy me a Mac.\n2. I'll send you detailed setup instructions\nOR\n1. Buy me a real good Mac or MacBook.\n2. I'll setup your Mac by TeamViewer\n\n# Add the file\n##Console\nTo add new files run in console:\n\t<code>ipfs add [file]</code>\nadds a file to IPFS. But it will be removed by a garbage collector in some time. To avoid that, pin the file!\nPin a file:\n\t<code>ipfs pin add [hash]</code>\ntells GC not to delete the file\nYou don't need to save the hash, because every time you write ipfs add, the hash is the same! Hail to Merkel-Dag!\n##GUI\nGrafic User Interface is available. Search ipfs.io to find out where. Also it's written when you run <code>ipfs daemon</code>.\n\n\n## READ the rest <s>fot $5</s> in the [part 2](http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:24:Streaming+with+IPFS:+HowTo,+Pt.2)!"
		},
		{
			"post_id": 9,
			"title": "Streaming with IFPS",
			"date_published": 1457439496.311,
			"body": "All over the ZeroNet ppl are asking how can they stream files, audio and video... Every time I advice them to try IPFS... Every time they ignore me and continue asking. Dumb ppl. I'll just leave it here:\n\n<center>\n\t<font size=\"3\">\n\t\t<video width=\"640\" height=\"360\" controls>\n  \t\t\t<source src=\"http://127.0.0.1:8080/ipfs/QmcXQ2rRrfg78jNLXumStcXE9MFe5PhebFQHcrVjnheyE5\" type=\"video/mp4\">\n\t\t\t<source src=\"http://ipfs.io/ipfs/QmcXQ2rRrfg78jNLXumStcXE9MFe5PhebFQHcrVjnheyE5\" type=\"video/mp4\">\n<source src=\"http://ipfs.pics/ipfs/QmcXQ2rRrfg78jNLXumStcXE9MFe5PhebFQHcrVjnheyE5\" type=\"video/mp4\">\nERROR: IPFS not loaded or not ready.</video>\n\nIf you don't have IPFS, either <a href=\"http://ipfs.io/\" target=\"_blank\">GET ONE</a> or click <a href=\"http://ipfs.io/ipfs/QmcXQ2rRrfg78jNLXumStcXE9MFe5PhebFQHcrVjnheyE5\" target=\"_self\">HERE</a> to use a gateway!\n(Gateway has some problem that I'm <s>fixing now</s> <ins>seem to be unable to fix</ins>)\n\t</font>\n</center>\n\n### Links:\n\n- <a href=\"http://ipfs.io/\" target=\"_blank\">Download IPFS to stream the video</a>\n- <a href=\"https://github.com/lidel/ipfs-firefox-addon\">Download IPFS browser addon!</a> (You don't need it here, but it's cool everywhere else!)"
		},
		{
			"post_id": 8,
			"title": "Idea for IFPS users",
			"date_published": 1457388778.154,
			"body": "I have an idea how to make my IPFS readers see painted smiles instead of =) =D xP etc...\nI'll just add IMG tag with a link to ipfs image and ALT property with a text smile.\nWhy not to give smiles to everyone?\n1. Coz I don't want to!\n2. Becaise that would increase the load on ipfs.io or ipfs.pics and I don't want that. Guys provide us with great services for free. We have to respect that."
		},
		{
			"post_id": 7,
			"title": "IPFS VS. ZeroNet",
			"date_published": 1457387943.013,
			"body": "I'm still thinking what to use to post images here. If I copy images to img folder and sing it (requires ZeroNet restart), ppl would need to store all those pictures. That suck. Even if we are talking about 50 kb per screenshot and 2 MB per photo, that add up into quite a lot if this blog is going to last. And that's IF ZeroNet supports files over 1 MB (wich it does AFAIR).\n\nOn the other hand, I could use IPFS. Bad news here is that browser redirect plugin is not working with ZeroNet and I need either to step on my own throat and use ipfs.io or ipfs.pics without relying on ipfs browser plugin (the whole idea of ipfs is destroyed) or to do what I've done in previous post: copy an \"embed\" link from ipfs.pics, modify img src to lead to localhost and add img alt to tell ppl that their ipfs is in trouble, but they can still see the image by clicking on it.\n\nYes. I'm gonna chose the second one. If you have a better idea or just wanna say something, I'll be glad to read your comments!\n\n\nP.S. so many posts/time because I'm glad that my blog is alive after all the troubles xD"
		},
		{
			"post_id": 6,
			"title": "New troubles",
			"date_published": 1457384890.902,
			"body": "# ...\n- NEVER EVER add scripts to the page controlled by scripts with page's interface.\n\n# What hapened:\n1. I wated to add a picture from IFFS network into this blog by embedding it.\n2. For some reason, redirecting plugin does not work here. I don't know why, it just does not. So I decided to make a spoiler that would hide a picture, accessed with ipfs.io and display a picture hosted on 127.0.0.1. That way, a picture would be visible if a viewer had IPFS running and ready to be viewed (in the spoiler) if a user had no IPFS.\n3. I could not find a simple solution like some html tag or markdown tag or smth else, so I've added a script inside a text field.\n4. Damn script worked! Well... Not exactly. It would work if it was a working script. But instead it killed all the scripts on the page that were loaded after text field.\n5. I've tried fixing it by deleting the sctipt from data.json. I forgot that this file (if does not pass checking) is downloaded from other peers. So 3-4 times I've eraced that script again and again until I realised what I should do.\n6. I opened ZeroBlog and looked up how to sign a site from the console. Shut down ZeroNet, edited the script and signed the site.\n7. That's where the fun started! My blog was alright by the time thought I did not know that because due to some bug(?) in ZeroNet I had an old version of the page (cached?) inside Zero. (Yes, I cleaned up browser's cache several times.)\n8. I realised that only after I opened the site in my tablet. *THANKS YOU GUYS FOR SEEDING MY SITE BACK TO ME!!!*\n9. after some dumb \"change that, delete that\", I've deleted the whole site and downloaded it from the network (thanks again!)\n10. I need some time to relax now... It's my first blog and I almost killed it... Just when guys started to say \"ok, I got the link, gonna open it\" and \"I've added your blog to the index\" and stuff like that. Damn stress...\n\nDo I really learn everything the hard way? OK, it's a wrong question after 22 years of doing that... Do I like that? (That's better!)"
		},
		{
			"post_id": 4,
			"title": "Today's achievements",
			"date_published": 1457376316.363,
			"body": "I'm not sure that it's right to keep such things in separate posts, but hey, I'm a noob here. Always used twitter and twister. Sorry.\n\n// POSTING ABORTED DUE TO SOME NEW S**T\n\nsorry, my nerves are weak -_-"
		},
		{
			"post_id": 3,
			"title": "Today's troubles",
			"date_published": 1457375304.422,
			"body": "# Visual Studio 15: I WANNA MOOOOREEE SPAAACEEEEE\n\nI'm more and more tired of Visual Studio's constantly rising desire for my drives. All that damn thing does is installing updates, upgrades, extensions and language packs. And all I need is an effective way to code JS and HTML. Well, yes, GitHub support is awesome, but it's not essential for now.\n\n\n<a href=\"https://ipfs.pics/QmPzHZm2S1BH4T1wGyRtTATJBAev9Xn7szdz79nUDA47XC\" target=\"_blank\"><img src=\"http://127.0.0.1:8080/ipfs/QmPzHZm2S1BH4T1wGyRtTATJBAev9Xn7szdz79nUDA47XC\" alt=\"Click of non-IPFS image\">\n</a>\nAnd right after that...\n<a href=\"http://ipfs.pics/QmRFMD2bZ1FqD2nPBqs4U1ENaiQQCHZRA56LP5K6FfXkFb\" target=\"_blank\"><img src=\"http://127.0.0.1:8080/ipfs/QmRFMD2bZ1FqD2nPBqs4U1ENaiQQCHZRA56LP5K6FfXkFb\" alt=\"If you see this, there is a problem with your IPFS. Click to see non-IPFS version\"></a>\n\n\n# I know what I want to do!!! Let's do that!! (What was I thinking a minute ago?)\n\nConstant generation of ideas inside my head is cool, but my memory amount is... how to put it... ok, it suck that's how. So I draw pictures, diagrams and write my core ideas down. Does it help? Not really. Still I can't keep track of all the micro ideas that jump all around my head.\n\nAnd the most painfull thing about it - even when I do manage to do stuff right, I don't have enough energy to stick to a single project for a long tome. That way I restarted my initial \"Find a House\" thing (idea: put 3 objects on a playfield - player (triangle), scenery object (box), and a game object (house made of a box and a triangle)) about 2-3 times, every time making the code more and more complex, and in the end abandoning the thing and starting a new (really new - new idea) project from scratch.\n\n\n\nP.S. I never posted posts to a real blog before, so I expect my first posts to be short."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "ZeroNet: Your zeronet blog has been successfully created!\n\nMK: YAY! ANOTHER PLACE TO TURN INTO CHAOS AND CRAZYNESS XDDD\n\n# ToDo:\n- get a fancy name on namecoin\n- <s>post some posts. My twister is becoming too trashy for a microblog anyway..</s> Done.\n\n# NeverDoAgain:\n- refresh page before publishing updates.\n- NO REALLY NEVER UPDATE THE DAMN PAGE OR CLICK TOSE DAMN LINKZ! ARRGH!!!"
		}
	]
}