{
	"next_comment_id": 42,
	"comment": [
		{
			"comment_id": 1,
			"body": "Do you plan on using this blog?) I want to add it to sites on my blog, but what's the point if there is nothing here?)))",
			"post_id": 1,
			"date_added": 1457704110
		},
		{
			"comment_id": 2,
			"body": "ha ok)) I just use it instead of twitter/twister now too, so yes, I write quite often))",
			"post_id": 1,
			"date_added": 1457710871
		},
		{
			"comment_id": 3,
			"body": "I want to try to run it on one of Android's Pythons, but don't know how to install things like gevent and msgpack without root. May be a bundle will do?\n\nIt's ok to run it on Pytnon on Debian on Android, but it weights alot, more than 500 MB, so I barely can afford it on my phone ( deleted almost everything, left a browser and a couple of reeeally needed apps). So... I'll try some day.",
			"post_id": 2,
			"date_added": 1457759010
		},
		{
			"comment_id": 4,
			"body": "> [ks](#comment_2_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): @musickiller if you manage to install it on your phone, make sure you replace all instances of .DEBUG with .INFO in src/main.py — otherwise the logfile will become too big.\n\nSure? It's fine for me. And I only had a handful of MB left on my phone. But I'll check it once again, and may be change the settings. However on the phone it's easier to clean up the file than to edit anything xD\n\n> Personally, I think ZeroNet will be too hard on the battery if installed on a phone or a tablet, so I put my faith in setting up a proxy so that I can access it on my mobile when I'm out.\n\nProxy is a good idea, but all my ports are closed and no way to open em. And I don't trust public proxies.\nAnd it's ok both on the phone and tablet. Drains a bit, but only worth noticing at night, when I charge my tablet (or don't have ZN on). Plus you can set it to use more memory than CPU if you are so worried. But it's fine for me.\n\nAnd it drains almost nothong when you turn off data connection, which is this way on my phone when I'm home.\n\n",
			"post_id": 2,
			"date_added": 1457774187
		},
		{
			"comment_id": 5,
			"body": "Very interesting, thank you!\nBut it seems that it can't be implemented in ZeroNet, because it requires a server to manipulate with. Or can it be?..\n\nIf it is possible, it could unite zeroID and any new authorization system to make 1 name per 1 person. No matter how different server setup is, NXT API will always be the same.\n\nThat may be called \"redistributed network\"... Or... I dunno... Not just servers, but Bridges between 2 distributed networks! =D",
			"post_id": 6,
			"date_added": 1457905073
		},
		{
			"comment_id": 6,
			"body": "> Haha, redistributed network. That's a good one! :)\n\nWas on my mind for some time now, wanted to use it somewhere =)\n\n> You can visit http://localhost:7876/test if you want to see all NXT's API calls.\n\nThat is a lot! \n\n> Well, ZeroName can query the NameCoin blockchain, so surely it would be possible to query an NXT instance also.\n\nI was thinking more about new ZeroID, not ZeroName. ZeroName is working already. But yes, since NXT incorporate all those aspects, a union between ZeroID and ZeroName is quite possible!",
			"post_id": 6,
			"date_added": 1457906631
		},
		{
			"comment_id": 7,
			"body": "working fine. however the picture is old =D",
			"post_id": 9,
			"date_added": 1458235653
		},
		{
			"comment_id": 8,
			"body": "u see? you did not know that zero button opens the pannel till this week, me - that pictures can be added with !, instead of \"img\" tag.\n\nhowever to make it clickable you should use \"a\" tag still. I just paste it from ipfs.pics.",
			"post_id": 9,
			"date_added": 1458236052
		},
		{
			"comment_id": 9,
			"body": "> [ks](#comment_9_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Yes, but it still makes me smile. :)\n> \n> Is there no way to make it clickable without using an <a/>-tag?\n\nnone that I know about, Press \"?\" near \"save\" and \"delete post\" buttons to see all options. However, I think a> is good enough. ",
			"post_id": 9,
			"date_added": 1458242637
		},
		{
			"comment_id": 10,
			"body": "Ugh... Don't remind me about it xD It was a bad dream x)",
			"post_id": 10,
			"date_added": 1458244358
		},
		{
			"comment_id": 11,
			"body": "you could change the fee in options menu (I suppose you know this, but I don't think there is anything else to be done here)\n\nWas your PC online for the whole time? Are you sure it did not enter sleep mode? Namecoin works bad after sleep. Should be restarted. Try to restart the app and wait some hours more.\n\nI'm not sure it's possible to get NO confirmations in 11 hours without a software error.. Someone would get your transaction and I'm sure someone would sign it. It's namecoin. All transactions there are close to equal and new site creaton is a bigger transaction than site update. Even with a standart fee it should have worked.",
			"post_id": 11,
			"date_added": 1458297605
		},
		{
			"comment_id": 12,
			"body": "I'm sure I'll be back there from time to time, but not often though.",
			"post_id": 13,
			"date_added": 1458314461
		},
		{
			"comment_id": 13,
			"body": "Funny, In Russain there is a joke about this Дуня.\nIf to translate it to English, that would be something like..\n\none man says:\n-\"We are called NSPHME!\" [Д.У.Н.Я.] \"It means No Stupid People Here!\" [Дураков У_нас Нет]\nand sooner or later someone says\n-\"How about ME?\" [А как же Я?]\nand that's where everyone laughs.",
			"post_id": 12,
			"date_added": 1458315017
		},
		{
			"comment_id": 14,
			"body": "my guess that it came from some students that were learning some language with this word and someone asked \"what's Dunya?\"",
			"post_id": 12,
			"date_added": 1458317210
		},
		{
			"comment_id": 15,
			"body": "it's awesome))",
			"post_id": 14,
			"date_added": 1458319053
		},
		{
			"comment_id": 16,
			"body": "> Something's waiting in the bushes of love\n\nxD Good morning. Yup, now the morning is good for sure))",
			"post_id": 20,
			"date_added": 1458719474
		},
		{
			"comment_id": 17,
			"body": "One question to solve the problem. How are twists stored in twister?\n\nOr one could just store each twist in a separate file so that each update would only dl 1 VERY small file.\n\nOr it's better (for disk space saving, since all files will still be several KB on disk) to fill each .txt until it's smth like 100 KB and then make next file. Each file would be named \"1.txt\", \"2.txt\" ... And the app would just dl the last one =D",
			"post_id": 20,
			"date_added": 1458720005
		},
		{
			"comment_id": 18,
			"body": "> [ks](#comment_28_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): @musickiller (off-topic, but…) if you liked “Bushes of Love”, surely you will enjoy the bad lip reading of Bruno Mars 🡕, which is much better than the original 🡕, IMHO.\n\nNope... Those videos are dumb even without BLR. I liked \"Bushes of Love\" because the took one of the most serious and important scenes in the film and turned it into a senceless funny music clip. Awesome work. And when I watched that clip. I was not sure if that was BLR or the original... </off-topic>",
			"post_id": 20,
			"date_added": 1458722897
		},
		{
			"comment_id": 19,
			"body": "> [erkan](#comment_17_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): This is a nice idea!\n\nObviously, but who will implement such a thing?",
			"post_id": 26,
			"date_added": 1459953118
		},
		{
			"comment_id": 20,
			"body": "ugh... I hate ZHello for having such a bad way to show new stuff. As soon as I follow Talk, I miss so many cool posts from you guys =(\n\nP.S. It's Musickiller or musickiller. It's not my name, so it can start with a small letter. And I don't like how a big K looks in the middle of it. You can write whatever you like, but I will point it out from time to time.",
			"post_id": 28,
			"date_added": 1460473719
		},
		{
			"comment_id": 21,
			"body": "on the topic:\nAHA! Surprise is close to disapproval! That's why I HATE surprises!!! xD",
			"post_id": 28,
			"date_added": 1460473971
		},
		{
			"comment_id": 22,
			"body": "> [ks](#comment_34_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Noted and corrected (here and in future posts, I'm not sure I have the energy to find and correct other cases where I used camel case).\n\nI said I don't really care)))) It's fine.",
			"post_id": 28,
			"date_added": 1460475448
		},
		{
			"comment_id": 23,
			"body": "> [ks](#comment_35_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): If you didn't care you wouldn't have mentioned it, so at least you care a little bit. 😉\n\nOr may be I just wanted to chat about something because I'm bored. D'you think that's possible?))",
			"post_id": 28,
			"date_added": 1460476029
		},
		{
			"comment_id": 24,
			"body": "> [ks](#comment_36_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): That's a perfectly valid possibility.\n> Zeronet really needs a social network / microblogging engine.\n\nyup... Wanna go back to Twister?)))))",
			"post_id": 28,
			"date_added": 1460485951
		},
		{
			"comment_id": 25,
			"body": "> I would like to see such a map, wouldn't you?\n\nTired of seing it. It's not only emotions however. There are times when I'm thinking of that theory of global sphere of thoughts... (I have forgot how has it been it called.) Areas with people thinking of the same thing.. that may be even more interesting than emotions that are usually caused by temperature, moon, sun, ecology and other stuff...\n\nI think I've recently experienced smth like that. But it always was a bad thing. When eveyone is glad to see me I can't be with eveyone at the same time and always miss something. When everyone hates me.. Well that one is obvious. When everyone forgets of me... That's the worst one, but I can turn it into \"hates\" quite easily!\n\nHowever it's not global and almost 100% sure caused by me... May be you'll find a better example? How about revolutions and wars?",
			"post_id": 28,
			"date_added": 1460486884
		},
		{
			"comment_id": 26,
			"body": "> [ks](#comment_37_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Not really. I make do with twtxt 🡕 until Zeronet offers a social network.\n\nI thought you had an idea how to make this stuff work in ZeroNet?",
			"post_id": 28,
			"date_added": 1460487018
		},
		{
			"comment_id": 27,
			"body": "> [ks](#comment_39_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Me too (although I never really doubted).  😊\n\n+1",
			"post_id": 29,
			"date_added": 1460581844
		},
		{
			"comment_id": 28,
			"body": "I don't get it... What's wrong?",
			"post_id": 31,
			"date_added": 1461137005
		},
		{
			"comment_id": 29,
			"body": "7 months... So what? It's not even a year. If you like the project, you should have asked him to make you one of developers just in case such thing would happen. If you did not, it's not totally his fault.\n\nAnd again, if you like the project, you should had been happy that he have returned.\n\nIf you don't like the project that much, why all the fuss around it? Just tell the man that you are not interested anymore and leave. =)\n\nI don't really understand your logic here...",
			"post_id": 32,
			"date_added": 1461520794
		},
		{
			"comment_id": 30,
			"body": "> [ks](#comment_45_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): @musickiller\n\nStill I think you are overreacting...\n\nBy the way you could copy the source code to GitHub and make it public if you thought he won't return. And by the time he would return, he would have a lot of improvements to his project. And probably he would have changed from his private git to public github and everyone would be happy!..\n\n...Yea, that's an optimist's oppinion. ",
			"post_id": 32,
			"date_added": 1461579876
		},
		{
			"comment_id": 31,
			"body": "mistery! ^_^\n\ninteresting what nofish would say about that =)",
			"post_id": 36,
			"date_added": 1464606038
		},
		{
			"comment_id": 32,
			"body": "Can you please describe it a more complex way, than \"awesome\". I don't have a reliable connection at work and always forget to look here when I'm not at work xD\n\nYou can write an article in ZeroWiki, if you want =D\n\n---\n\nOK, I've managed to load 1 page, read it.\n\nWhat I'm enterested in now is: \"How do I use it, what for\", and \"Why would I use KBFS instead of Sync or Librevault?\"",
			"post_id": 37,
			"date_added": 1470135987
		},
		{
			"comment_id": 33,
			"body": "ok, thanks. I'll read more.\n\n---\n\nI still don't get, what does this thing do with twitter, reddit, etc. I will read more on my own, but it would also cool if you described it too.",
			"post_id": 37,
			"date_added": 1470202687
		},
		{
			"comment_id": 34,
			"body": "> [ks](#comment_56_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): It's a filesystem.\n\nDamn, I'm cursed. People tend to describe me only things that I already understand...\n\nOK, let's try it this way. If during the day I will be able to download the page, I will quote lines that I don't understand.\n\nHey! I've got an idea of a very useful app for mobile devices: A browser that downloads and updates web pages only on a fast and reliable connection. Cool for reading. You can just browse things that you have already downloaded, ando things that you did not, will be loaded as soon as you connect to your home wi-fi! (or any other network you specify, or just as soon as some connection will be established, dependidng on what do you need.)\n\nBesides, the app would updaete existing pages with specified freaquency, so even reading newspages will be possible.\n\nIf that's not enough, I see an adaptation of p2p technology here: devices would be able to share sites without internet connection. ofcourse, if a user trusts the source, since I don't see any way to check if the site is legit.\n\nShould I post it in my blog?) U know.. I'll post it anyway xD",
			"post_id": 37,
			"date_added": 1470215690
		},
		{
			"comment_id": 35,
			"body": "> [ks](#comment_57_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Perhaps you ask the wrong questions. I doubt that people deliberately answer your questions in a way that gives you an answer you weren't looking for.\n\nNo, they don't... And usually I don't ask, it usually happens when I make a statement and someone disagrees. They seem to guess my motives wrong. It has started at least 2 weeks ago, or that's when I began to see it.\n\n\n> Something akin to Pocket 🡕?\n\nMay be. I can't load the page now (you see, comments and posts here are loading, since they don't need wide bandwidth), but I saw it as an addon to opera or FireFox (don't remember). If functions I'ved described are possible, then it's an awesome thing, since an addon to an existing browser means more security flaws in the application.\n\n> Good idea!\n\n",
			"post_id": 37,
			"date_added": 1470221107
		},
		{
			"comment_id": 36,
			"body": "> [ks](#comment_58_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): So what you're saying is: When multiple persons seem to get your statements wrong, it's not because of the way you're expressing yourself, it's because they “seem to guess [your] motives wrong”? Right… 😉\n\nyup! =D",
			"post_id": 37,
			"date_added": 1470310460
		},
		{
			"comment_id": 37,
			"body": "well.. you can give me an invite. I think, that I'll have time to test it. By the way, where have you got them?\n\nAs I can see, the comment where I've asked the question is not here... -_- I'll try to do that again later.\n\nP.S. Have you seen that new project from creators of NXT?",
			"post_id": 37,
			"date_added": 1470417358
		},
		{
			"comment_id": 38,
			"body": "> [ks](#comment_59_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Ardor? Yes, it sounds exciting.\n\nCan you explain it? When I read the mail they sent me, I thought that it's just another version of NXT, but it would be stupid... May be you can write a post about it? Short, but informative... If you feel like doing it =D\n\n> I'll send you an invite in BM when I'm done with this comment. I got them from Chris Coyne, one of the people behind Keybase.\n\nOK, great!) Don't be in a hurry. I'm a total Slowpoke in my current mood. And please make TTL a week long, so that in case my PC will shut down for no obvious reason and I won't be in a mood to fix it, I still won't miss your messages. That would be sad... I actually have TTL set as 7 days myself. Who cares how long will PoW take?..\n",
			"post_id": 37,
			"date_added": 1470430686
		},
		{
			"comment_id": 39,
			"body": "> [ks](#comment_60_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Ardor is NXT 2.0. It has some new features, like side chains. I really can't explain it and I don't have any plans writing a post about it — I'm in no position to do that.\n> Did you read https://nxtforum.org/core-development-announcements/%28ann%29-ardor-or-nxt-2-0-a-scalable-child-chain-platform ?\n\nThanks, I'll read it. So all I have to do is to find my existing NXT wallets, buy more NXT and wait for Ardor?))",
			"post_id": 37,
			"date_added": 1470433432
		},
		{
			"comment_id": 40,
			"body": "Back to Keybase. How do I know thay they are good guys? How do I know that words like \"we don't spy on your passphrase\" are true? And also how do I know that they even encrypt my data at all? o_O\n\nThat's why I hate server-based apps... Can't trust no one this days..",
			"post_id": 37,
			"date_added": 1470488209
		},
		{
			"comment_id": 41,
			"body": "I think that the best storage project would be a distributed web of people that gain credits for storing files of other people and use them for storing their own files.\n\nLike that:\n\nYou give 4 GB of space to store someone's data for 30 days and get 120 credits. If you cancel the deal, you loose all 120 credits. You have to be active for at least 3-6 hours every day or you'll loose credits.\n\nYou can give 120 credits to store 1 GB of data for 30 days on 4 computers on the network, or 512 MB on 8 computers (depending on how much redundancy do you need).\n\nAnd ofcourse it would have all those PGP and sharing from keybase, blah-blah-blah...\n\nThere should be a blockchain for the currency (and may be PC names? Yea. don't trust IP!)...\n\n\nis that so hard to do? Why do people still use servers to store data???\n\n\nAnd see how cool it is: you just give 40 GB for a day, download the data, check it, get your 40 credits store 200 MB of documents for 20 days on 10 computers and the next day you can delete that 40 GB of trash and live freely, knowing that your info is secure!\n\nHowever, it's gonna be a very slow system. You'll need to wait while people will upload their data into your PC, then wait for HOURS while your stored data is offline (even 10 PCs won't be online 24/7, what if you stored your data on 3 PCs?).\n\nAnd also who said that you'll have all your 40 GB filled at once? Most probably that means that the credit system should be reworked, or smth... But anyway, the idea is good, I know it!",
			"post_id": 37,
			"date_added": 1470520962
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"6": 1,
		"9": 1,
		"26": 1,
		"29": 1,
		"36": 1,
		"37": 1
	}
}