{
	"title": "反伊斯兰教",
	"description": "专注于反伊斯兰的一切",
	"links": "[绿绿的那些事](http://127.0.0.1:43110/18yytjyymFJ4pMHSHNy8qtcgizj2nuFACw)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1504371434,
	"post": [
		{
			"post_id": 12,
			"title": "索罗斯、女权、LGBT、白左和NGO",
			"date_published": 1504371355.658,
			"body": "简单来说，索罗斯出钱，支持了很多NGO。\n\n这些NGO在各个国家搞事，只要能搞烂一个国家的事情，他们都会去做。"
		},
		{
			"post_id": 11,
			"title": "美团清真事件为什么引发众怒？",
			"date_published": 1500796088.785,
			"body": "怼宗教不怼民族，你要自己上来躺枪我也没辙。\n\n**古兰经要求穆斯林只能吃佳美的、以宗教之名屠宰的动物，你们信了并严格执行；\n那么古兰经里要求杀非穆斯林、仇恨非穆斯林的怎么办？\n要知道古兰经黄牛章要求穆斯林必须全盘遵守古兰经啊。**\n\n看看当年比较实诚的穆斯林学者是怎么说的：\n元代就曾经发生过这样一件事——《可兰经》有云：\"凡崇拜数神者，杀之。\"（注：该节经文所引不详，《古兰经》中并无此节经文，大抵是“当禁月逝去的时候，你们在哪里发现为真主举伴者，就在那里杀死他们，俘虏他们，围攻他们（9：5）”等经文的不准确翻译）\n基督教徒曾在帝前引此语。帝闻之，召都城之回教博士至，而询其为首者，彼等圣经中是否有此语。诸人不能否认，对曰：有之。忽必烈曰：汝曹以《可兰经》授自上帝欤?其人对曰：吾曹未尝致疑也。\n**可汗又回：上帝既命汝曹杀异教之人，何以汝曹不从其命?对曰：时未至，吾曹尚未能为之。**帝怒曰：然则我能杀汝也。遂命立将其人处死。（引自《多桑蒙古史》三卷四章）\n\n13世纪比现在距离伊斯兰教诞生时间更近，经法解释应该错误更少。\n\n时未至，时未至啊，还不能动手。\n\n作者：旭烈兀1\n链接：[https://www.zhihu.com/question/62742233/answer/201658781](https://www.zhihu.com/question/62742233/answer/201658781)\n来源：知乎\n著作权归作者所有，转载请联系作者获得授权。\n\n我国是信奉无神论吧？各民族是平等的吧？宗教信仰是自由的吧？信仰不分三六九等吧？你不吃猪肉，可以不点，但是不能影响到别人吧？为何要把公共区域划分为MSL专用区？那是否直接表明分清真人士不得入内？这就不算是对非穆群众的歧视？为何送个外卖还要分清真不清真？那送清真菜的送货员是否清真呢？未来某一天：“哎你看那个人他不清真，我们烧死他”\n\n作者：我又不乱来\n链接：[https://www.zhihu.com/question/62666456/answer/201396575](https://www.zhihu.com/question/62666456/answer/201396575)\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n* * *\n\n分箱事不大，真不大。但管中窥豹，由小见大，已经有些人开始警觉了亦或者开始害怕了，伊斯兰确实厉害，汉族引以为豪的同化能力对人家没什么卵用收效微乎其微。我国信仰伊斯兰的人有两千万，他们的影响力和话语权太大了。例如有些地方的不能有非清真的餐馆，有些地方必须有清真的餐馆，我不吃的，你连味道也不能让我闻到。警察，政府对待穆斯林大都采取息事宁人妥协的态度，这更会让人们感到不安。\n说的严重点，今天美团的事没人管，明天一定会有更多穆斯林打着清真的旗号来争取市场。影响力是一点点扩大的，大到无法无天了，上至政府，军队，下至百姓都会绿化的。再严重点，男的戴帽，女的穿纱，国家改名穆斯坦。\n当然好处也是有的，大家都成了真主的仆人，实现了真正的平等。一些“不净”的工厂职业会取消，工厂大整改符合伊斯兰教义标准。那时的我们人人有信仰，有钱可以娶四个老婆，与未来大国土耳其称兄道弟，威胁论也少了，国家更加团结了。\n\n温水煮青蛙，不管不顾到最后死的会是谁呢？\n\n作者：长生祠\n链接：[https://www.zhihu.com/question/62666456/answer/201764241](https://www.zhihu.com/question/62666456/answer/201764241)\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。"
		},
		{
			"post_id": 10,
			"title": "美团清真事件为什么引发众怒？",
			"date_published": 1500795988.537,
			"body": "今天吃饭能给你分箱，明天出门坐地铁就能给你分车厢--就会有一些车厢成为穆斯林专用车厢，汉民不得入内！记得美国的白人专用车厢，黑人不得入内吗；记得解放前的洋人餐厅，华人与狗不得入内吗？作为国家主体民族，被公然被划为了四等公民，你告诉我为什么不抵制和反抗。你想让我们的地位成为和美国的黑人一样吗？以斗争求团结则团结存，以妥协求团结则团结 亡。我作为人类最基本的平等信念与民族尊严不容践踏！\n\n作者：后会无期\n链接：https://www.zhihu.com/question/62666456/answer/201053112\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。"
		},
		{
			"post_id": 9,
			"title": "美团清真事件为什么引发众怒？",
			"date_published": 1500795791.717,
			"body": "作者：满身花影\n链接：[https://www.zhihu.com/question/62666456/answer/201150706](https://www.zhihu.com/question/62666456/answer/201150706)\n来源：知乎\n著作权归作者所有，转载请联系作者获得授权。\n\n这种事，不引发众怒才叫不正常\n\nMSL及相关历史，不是一二本书可以说得清的，有兴趣可以去图书馆翻一翻，相关书籍多如牛毛\n\n其实有些地方，是接触不了多少MSL的，但现在的形势，搞得声名狼藉，绝对不是非MSL故意抹黑，故意歧视，这是用鲜血换来的警醒\n\n以下内容尽量通俗一点\n\nMSL长期的移民不融合不同化，以及生育继承的传教习惯，本来关门自嗨的话，也不算什么问题，但是，可怕之处在于教义中强烈的屠戮异教的精神，从来没有彻底顺应时代根除修正过\n\n清真饮食习惯本来扎根个人信仰这种私人范围中，但MSL奇特之处，在于二套体系共存，世俗法律，与教法，这在全世界，也是独一无二\n\n法国有过调查显示，移民MSL中，一部分人一边享受优厚舒适的当地物质条件，同时，只依照教法行事，出现过一些骇人听闻的惨案，比如手刃亲生女儿，仅仅因为她与非MSL谈恋爱，听流行音乐，穿时髦服装\n\n按教法，她得死，按世俗法律，这是她的自由，任何人无权干涉，但她爹眼里，没有世俗法律，只有教法，他是在听从MHMD的召唤，杀死了一个判教者，而不是女儿\n\n类似的MSL心理，在这个调查中是普遍存在的，并不是少数现象\n\n这也一直是强调世俗化来均衡各宗教信仰的一个重点，当几乎所有宗教，都将个人信仰退守到个人领地时，MSL并未退后，反而一直在前进，在蚕食\n\n\n\n---\n比如，在某国一地区极少量的MSL移民多年生育壮大之后，在远未达到多数占比时，他们就公然指责学校女老师，在教育MSL学生时，不戴头巾，穿暴露的服装，认为这不符合MSL的要求，强求学校命令女老师们，在MSL学生上课时，必须按MSL风俗着装\n\n这其中，世俗化，成为焦点\n\n也就是提问中的这句话：清真食品单独列单独放不是在尊重文化差异吗？在本质上一模一样\n\n世俗化本身相当于划出一条线，个人的宗教信仰，只可以自我约束你个人，而不能影响其它的人，你不能因为自己不吃猪肉，进而要求别人不可以在你眼前吃猪肉，不能因为你自己教义要求不喝酒，就去砸掉人家小卖部的酒水\n\n这种做法显示，MSL是在坚定地拒绝世俗化，坚定地以自己的信仰，凌驾于别人信仰之上，这是一种长期压迫侵略性的行为，在最大化地利用世俗人等的宽容\n\n世俗面前，宗教平等，没有哪个宗教，可以跑到世俗化的世界中，大搞自己的教法，公然无视世俗的法律秩序，目前，MSL在这方面的一步步得寸进尺，几乎猖狂到了极致\n\n独有的清真食品标志，大量的清真窗口，甚至清真澡堂，清真公交，这些并不是私人领域，而是公众场所，加上近年以来世界各地大量的MSL恐怖袭击现象，换在任何一个正常人，谁还会认为，这是一个温和的宗教呢？\n\n劣迹斑斑，不在内部自省改革，摈弃糟粕与时俱进，反而指责世俗人等，你们歧视MSL！\n\n清真食品单独列单独放，这并不是尊重所谓的文化差异，而是你个人的宗教信仰，侵入了世俗世界的范围之中，成为一种自以为是的特殊的霸道\n\n你MSL对于食品的要求，严格按教义来说，其实是根本不可以叫外卖的，因为全程无控无证，反而在一个外包装之上，扮起了纯良的虚伪面孔\n\n事实上，在统一的世俗前提下，MSL应当退后一步\n\n一切侵入世俗社会的MSL相关内容，都不应该出现。假如佛道基督面条各个教派，都在在世俗化中插上一杠子，世俗社会，最终会变成什么样子？\n\n我一个佛教徒，什么也不干了，天天扛着少林长枪大刀，逢屋就入，遇锅就砸，没有我少林认证标志，这锅，炒过荤腥，冒犯我佛！\n\n可以吗？\n\n美团分箱这种无脑到了极点的蠢事，其实也不能推到下面一个代理商的头上，王兴在饭否上的内容：\n\n在这种时候，居然还将责任，引导到所谓的竞争上，曾经比较佩服做饭否的王兴，但是美团最近几年搞出的各种蠢到满地找智商的破事，看来并不全是下面人的责任\n\n一个带头大哥，危机面前，第一反应，永远都是，啊，有人黑我们了，啊，有人陷害我们了，永远都是一脸无辜的受害形象\n\n十分恶心\n\n老将纵横互联网，反而一直掉智商。如今廉颇老矣，尚能饭否？\n\n王兴给的答案是，不能了。王兴从此庸碌，当亡\n\n－－－－－小补充，修改了，关于饮食及未来\n\n佛教徒个人信仰，在家会单锅单灶，不会强求家人饮食习惯，而MSL流传千年，有一个独特的挑食习惯，不吃猪肉\n\n这并不是先天的基因造成的生理问题，而是刻意而为\n\n封建时代出现过奴隶制，一个人为奴，生养的子女出世即自带奴隶身份，没有选择。MSL其实可以粗略地形容为一种世袭的教奴\n\n当一个人生于虔诚MSL之家时，他出生之时，就丧失了独立自主的饮食与信仰选择的权利，被制造成为新一代的教奴\n\n一个正常的家长，如果自己有挑食的毛病，绝对不会刻意要求自己的孩子，在饮食上，和自己一样，跟着挑食，反而会设法让孩子不要有挑食的毛病\n\n强调自己的清真饮食不便，却继续在下一代身上，坚定地传输教义的基本规定，强迫自己的孩子跟着清真饮食，这本身就是一种传播信仰的行为，而不是简单的饮食习惯\n\n事实上，这也剥夺了个人的自由选择权利\n\nMSL这个宗教的“伟大”之处，在于巧妙地将生活细节全面宗教化，巧妙地将教内通婚子宫专有化，巧妙地将生养过程强制教义化。只要有足够漫长的时间与耐性，刀枪达不成的目标，完全可以通过MSL的子宫，实现世界大统\n\n这是一场极其漫长的生育战争，唯一的威胁，可能是科技飞速发展下，人造子宫与生育观念的突变\n\n据生育率的现状，MSL一直保持着较为高产的状态，而其它种族，生育率多数在一路走低\n\n所以，温和与不温和的MSL们，你们的未来是光明的，将来的地球是纯绿色的，那个时候就不会有人胆敢拿一个小小的箱子，与你们作对了"
		},
		{
			"post_id": 8,
			"title": "你为什么卸载美团",
			"date_published": 1500795043.816,
			"body": "作者：匿名用户\n链接：https://www.zhihu.com/question/60017694/answer/201909914\n来源：知乎\n著作权归作者所有，转载请联系作者获得授权。\n\n谢谢朋友们的赞和踩\n答主共产党员，坚决维护各项民族大政方针，也致力于推动民族政策深化改革。\n对有些民族知识确实了解不够，答案不做修改，很多汉人对民族的认知就是如此。\n\n只是就热点话题表达态度，不代表民族正义仅代表个人，没指望着几个文字能带来什么目的，也不劳烦操心。\n欢迎各种声音的发出，欢迎评论。\n听到不同的声音有利于大家公正评判\n\n原文没有任何辱骂用语也不针对任何个人\n不过评论区随便你们回子骂\n要是觉得能骂哭我\n\n支部书记让给你做好了\n\n……………………………以下为原答案………………………\n\n国有难 回必乱\n\n一个回子吃猪肉 两个回子不吃猪肉\n\n我可以尊重你不吃猪肉\n但也请你尊重我吃猪肉\n\n我可以接受你只认清真标识\n但也请你接受我拒绝清真标识\n\n55个少数民族怎么就你这么暴动呢？\n\n别说我以偏概全\n你们“高度”的组织性就决定了一部分人的行为会影响到整个群体\n这是过度团结 不分对错就团结的后果\n\n后知后觉地意识到\n食堂凭什么给你清真餐厅\n洗澡凭什么有清真专区\n凭什么你有那么多宗教特权\n有本事自己去沙漠那边找老祖宗去\n有本事\n别在我中华大地为非作歹\n\n不是阴谋论\n是感觉到了一种不公平的待遇\n感觉到被强迫\n\n你拒绝吃大肉，拒绝不干净的东西\n那现在全世界咖啡乐团结起来\n拒绝赋予了绿教含义的东西\n拒绝清真 卸载美团\n\n说实话\n现在看到食堂清真餐厅，看到方便面印着清真\n总觉得过了你们回子的手\n给你们回子交着钱\n\n真脏\n\n<textarea hidden=\"\" title=\"overall type: UNKNOWN_TYPE\n    server type: NO_SERVER_DATA\n    heuristic type: UNKNOWN_TYPE\n    label: 谢谢朋友们的赞和踩答主共产党员，坚决维护各项民族大政方针，也致力于推动民族政策深化改革。对有些民族知识确实了解不够，答案不做修改，很多汉人对民族的认知就是如此。只是就热点话题表达态度，不代表民族正义仅\n    parseable name: \n    field signature: 4290505990\n    form signature: 5817533978025936658\" autofill-prediction=\"UNKNOWN_TYPE\" data-cke-editable=\"1\" contenteditable=\"false\">谢谢朋友们的赞和踩<br>答主共产党员，坚决维护各项民族大政方针，也致力于推动民族政策深化改革。<br>对有些民族知识确实了解不够，答案不做修改，很多汉人对民族的认知就是如此。<br><br>只是就热点话题表达态度，不代表民族正义仅代表个人，没指望着几个文字能带来什么目的，也不劳烦操心。<br>欢迎各种声音的发出，欢迎评论。<br>听到不同的声音有利于大家公正评判<br><br>原文没有任何辱骂用语也不针对任何个人<br>不过评论区随便你们回子骂<br>要是觉得能骂哭我<br><br>支部书记让给你做好了 <br><br>……………………………以下为原答案………………………<br><br>国有难 回必乱<br><br>一个回子吃猪肉 两个回子不吃猪肉<br><br>我可以尊重你不吃猪肉<br>但也请你尊重我吃猪肉<br><br>我可以接受你只认清真标识<br>但也请你接受我拒绝清真标识<br><br>55个少数民族怎么就你这么暴动呢？<br><br>别说我以偏概全<br>你们“高度”的组织性就决定了一部分人的行为会影响到整个群体<br>这是过度团结 不分对错就团结的后果<br><br>后知后觉地意识到<br>食堂凭什么给你清真餐厅<br>洗澡凭什么有清真专区<br>凭什么你有那么多宗教特权<br>有本事自己去沙漠那边找老祖宗去<br>有本事<br>别在我中华大地为非作歹<br><br>不是阴谋论<br>是感觉到了一种不公平的待遇<br>感觉到被强迫<br><br>你拒绝吃大肉，拒绝不干净的东西<br>那现在全世界咖啡乐团结起来<br>拒绝赋予了绿教含义的东西<br>拒绝清真 卸载美团<br><br>说实话 <br>现在看到食堂清真餐厅，看到方便面印着清真 <br>总觉得过了你们回子的手<br>给你们回子交着钱<br><br>真脏</textarea>\n\n谢谢朋友们的赞和踩 答主共产党员，坚决维护各项民族大政方针，也致力于推动民族政策深化改革。 对有些民族知识确实了解不够，答案不做修改，很多汉人对民族的认知就是如此。 只是就热点话题表达态度，不代表民族正义仅代表个人，没指望着几个文字能带来什… [显示全部](/question/60017694/answer/201909914)"
		},
		{
			"post_id": 7,
			"title": "恐怖分子没有曲解教义",
			"date_published": 1500794512.301,
			"body": "不是恐怖份子曲解了教义，而是中世纪一神论宗教本来就是“谁极端谁正统”。中世纪的政教合一国家里，从来没有人权、自由、平等、男女平权、博爱这些概念。在他们眼里，杀异教徒、抢掠、买卖妇女是天经地义的。\n\n看似被误解的教义其实是原汁原味的教义，看似温和又正统的教义其实是塔基亚原则，即“打不过就装成温和派”。\n\n作者：陈风暴烈酒\n链接：https://www.zhihu.com/question/20207045/answer/119263512\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。"
		},
		{
			"post_id": 6,
			"title": "政治正确与文明",
			"date_published": 1500793822.292,
			"body": "<blockquote>《政治正确与文明》<br><br>这次法国《查理周刊》的袭击者均具有法国国籍，说着标准的法语，其中还有一名18岁的年轻人。而在之前IS斩首美国记者的视频中，一位恐怖分子竟然说着标准的伦敦音，在当时这甚至比斩首视频本身更让人震惊。然后英国政府悲催发现，很多土生土长的20岁左右的英国人竟然都跑去加入了IS，他们中有穆斯林二代，也有白人，很多是大学生。甚至英国还有一些据说人很好的本身非伊斯兰信仰的邻家白人大叔竟也被情怀驱动去给IS当志愿者。这些事实都表明，恐怖袭击已经进入了新的阶段，不再是本拉登时代由基地组织从海外派出恐怖分子进入西方各国，而是依托在西方成长起来的新一代穆斯林极端分子在他们的祖国发动袭击。这种新形式产生的基础就是西方各国，尤其是<b>欧洲的逐渐伊斯兰化。</b>作为从小生活在“防止西方价值观渗透和颠覆”口号下的我，此时惊讶的发现，原来帝国主义在伊斯兰教面前真的是纸老虎，他们自己的国民竟然能如此轻易地被渗透和洗脑。进而另一个问题浮现上来：“西方自己秉持的传统价值观哪去了？为何这样的社会里还会教育出恐怖分子？”<br><br><p>    在我看来，这样的结果其实是西方国家自酿的苦果。<b>他们多年来在本国的教育中将“政治正确”放在包括自由在内的传统价值观之上，就必然导致传统价值观的衰败和模糊，而极端宗教的价值观趁虚而入。</b></p><br><p>    所谓政治正确，其隐含的意思就包括事实未必正确，但为了政治大局，你必须要认定它正确。其很多表现成为了社会里每个人的行为准则，也是社会进化文明的标志。在欧洲政治正确至少包括，不许歧视女性，不许歧视残疾人，不许歧视黑人、穆斯林等少数族群、要尊重不同民族的习惯和文化，为此，自由、文明、民主这些词在某些时候也都不可以说，不然会被认为是“欧洲中心论”的政治不正确。这些政治正确原则的提出是有其历史渊源的——正是由于欧洲历史上有男女不平等，有黑奴贸易，有和穆斯林的宗教战争产生的敌视情绪等等，使得不可能每个人都从心底里完全接受男女平等种族平等这些观念，所以，才需要提出政治正确的原则来强迫人们接受，并矫正自己的行为。</p><br><p>    不可否认，这种原则初衷是极好的，也确实代表了先进文化的前进方向。虽然政治正确不可避免的压抑了部分的言论自由，但它对和谐社会的建立帮助极大——不管每个人心里有多么的歧视和不爽，表面上还都是一脸热忱，风度翩翩。 </p><br><p>    至少在英国，政治正确几乎是以一种洗脑的形式嵌入到教育里的。每个人从小接受这些原则的灌输，导致英国人在谈到一些话题时几乎是有一种条件反射式的回避。比如每次穆斯林发动恐怖袭击后，英国的公知在报纸上讨论其原因，总是翻来覆去的反思自己，反思自己的政府，是不是还是哪里做的不够，对穆斯林不够好。比如穆斯林是不是收入太低了，是不是没有好工作，是不是没有接受好的教育，是不是还是被边缘化，没有真正的融入社会？如果这些都不是，那么是不是他们没有接受真正的伊斯兰教育？总之翻来覆去就这几个问题，因为这样说可以保证安全的拿到稿费。<b>至于伊斯兰教的教义到底如何，穆斯林为什么没能很好地融入社会，穆斯林为什么收入低这些问题，他们或一笔带过，或干脆避而不谈。而关于穆斯林和伊斯兰教的讨论和批评更是在公共言论中是缺席的。</b>因为政治正确。</p><br><p>    有些答案其实是很显然的。即便经济因素是极端穆斯林滋生蔓延的土壤，可是在英国这样一个还算是比较平等社会里，为什么黑人、印度人、中国人无论贫困还是富裕都不会去搞恐怖袭击呢？为什么阿拉伯国家的移民收入会普遍偏低，而印度人大多变成了医生和教师，中国人无论经商还是做学问也都做的不错，都能很轻易的变成中产阶级呢？为什么印度人、中国人的后裔大多能考上好的大学，甚至一些自己没啥文化辛苦打拼上来的中餐馆老板，都知道把孩子培养进了牛津剑桥，可是保守穆斯林在贫困的环境下却不试图用教育改变命运呢？所以，究竟是社会没有给穆斯林以融入的机会还是他们自己没有想去融入呢？</p><br><p>    这些问题，是没法公开深谈的，一谈就要政治不正确。比如，如果你要坚持每天五次祈祷，且必须定时定点，那无论是学习还是工作，你都不可避免受到很大影响。斋月时如果赶上了英国的夏天，每天白天十五六个小时都不许吃喝，自然会萎靡不振，晚上就那么几个小时，穆斯林还要抓紧时机多吃点东西，又必然会影响睡眠，这种情况下，你如何能和别人同步工作和学习呢？伊斯兰教在饮食上有诸多禁忌，自然也就不方便和其他族群聚餐聚会，也就无法增进感情。还有文化的巨大隔阂，中国人刚来英国不习惯去club，没有facebook账号，很多西方的音乐、电影在国内没看过听过，所以和本国人聊不到一块。可是和穆斯林聊天，几乎没有人知道可以聊什么，政治不可以聊，宗教不可以聊，历史不可以聊，吃吃喝喝不可以聊，诸如有过几个男朋友之类的八卦也不可以聊，黄段子就更不敢说了，甚至在网上发现一个好玩的图片如果不小心里面有暴露镜头，你都不知道该不该分享给他们看。更不必说穆斯林的女性如果穿着传统服饰，是无法便利的工作的，当然，他们的教义可能也不允许他们工作。所以，找出穆斯林无法融入西方社会这一原因容易，可是做出改变很难。尤其是仅仅依靠西方单方面的反思和改进就以为可以让穆斯林融入主流社会，接受主流价值观，是无法切入重心的。西方的公知喜欢从经济、就业和社会包容的角度去讨论这些问题，因为很安全，可以写一大堆，到不到点子上不重要，稿费可以源源不断的拿。批评帝国主义白人政府和傲慢的白人社会谁都敢，是一件毫无风险而政治正确的事，可是你批评穆斯林和伊斯兰教试试？</p><br><p>    在一个已经比较公平的社会里，过度强调政治正确会产生矫枉过正的效果，有些后果是非常恐怖的。比如著名的罗瑟勒姆性侵案，小镇上的白人少女在长达十几年里都沦为了当地穆斯林帮派的性奴，最早有人去报案，当地警察竟然劝报案人“算了”，因为胜诉的可能性很小，因为对方是少数族群，反而容易反诉地方政府种族歧视，当地警察不愿意给自己找麻烦。再后来，甚至干脆对报案人说，“卷宗丢了”。以至于小镇上的女孩认为“性侵是生活中的一部分”了。这件事情直到去年才爆出，举国哗然，表面上这是地方政府没有坚持司法公正，但事实上这种司法甚至舆论上的先天的偏见恰恰是多年政治正确教育之下的必然结果。这就是现今英国社会的现实，如果是白人强奸了穆斯林，警察、律师帮助穆斯林打赢官司，抓住凶手，会得到舆论的一片赞扬，警察和律师也会被认为是伸张正义保护弱势群体坚持自由公正价值观的楷模，可是如果帮助白人抓穆斯林就会先天性的惹上一身骚——你是不是在种族歧视啊？再比如，最近又爆出一件穆斯林强奸少女的案件，穆斯林被抓住后为自己辩解道：“在我的信仰里，性侵未成年少女不算做错事。”他也知道，有宗教信仰为借口，就有可能引发同情，减轻自己的罪责，因为政治正确。</p><br><p>    其实，政治正确至上只是维持了人与人之间表面上的客客气气，社会表面上的和谐稳定，并不解决根本问题。甚至，<b>正是由于穆斯林和伊斯兰教有了免于被批评的特权，更让他们成为了主流社会以往的对象，导致穆斯林更加的被孤立，客观上也为层出不穷的恐怖袭击以及恐怖分子的低龄化本土化埋下了伏笔。</b></p><br><p>    因为民众基于政治正确的原则，有些话不敢说，但不代表他们心里真的没态度。最简单的例子是去年英国地方议会选举之前，英国独立党的党魁法拉奇就公开的政治不正确了一把，他为了主张自己限制移民的观点，公开在电视上说：“如果我的邻居搬来一群罗马尼亚人，我会为自己的安全担心的。”接着有人就问他：“你邻居是罗马尼亚人还是德国人有什么不同么？”他说：“谁都知道这是很不同的。”这段对话引起了轩然大波，英国的政客、公知、民众几乎是众口一词的骂他，多肮脏的词都用上了，没有人认为他说的是事实，每个人纯洁如天使。但结果呢？一周后的投票，法拉奇领导的独立党大获全胜，得票率独占鳌头。而在此之前，独立党从来都是一个无足轻重的边缘小党，在五年前的大选里，甚至没有一个国会议员席位。所以，在公开场合痛斥法拉奇的民众，在心底里真的觉得法拉奇说错了么？这也是为什么在民主社会里，有时候大党时刻以民调为准施政，却总还是得不到民众的满意。因为民众就像政客的女朋友，有时候口是心非，需要你直接猜到他们的需求，那才是真爱。而导致这种口是心非的就是神圣不可侵犯的“政治正确”。</p><br><p>    其次，政治正确让很多英国本国人的价值观变得模糊，甚至倒退。我所在的大学有一位中国来的访问学者，他本想将自己正在读小学的儿子插班到英国的小学里学学英语。结果不巧房子位置找的不好，他带孩子去报到时发现全班的孩子正趴在地上祈祷——班上大部分是穆斯林儿童。少数的几个英国白人小孩竟也在跟着祈祷，嘴里也念念有词——可以想象，在这种环境下，做一个少数派的孩子压力是很大的，而孩子又是天然的容易被大多数人引导。而老师呢——也是英国白人，竟就木讷的看着这一切发生。访问学者吓坏了，直接带孩子退学了。在英国公立学校按说是不允许在上课时间从事宗教活动的，这是为了孩子的健康成长，保持人格独立和精神自由。但是在穆斯林聚集区的学校，这一切就这么发生了。显然学校的老师甚至领导没有意识到这种宗教活动对人自由的侵害，也许他们自己都没有自由至上的信念，反而是认为政治正确是第一位的——既然班上大部分是穆斯林孩子，有什么理由阻止人家的宗教信仰呢？甚至有些白人还会对那些极端穆斯林的虔诚信仰心生好感，所以才会跑去IS当国际志愿者。所以可以想象，这种教育下的穆斯林孩子，即便是英国籍，又能怎样呢？他接受的保守的宗教影响依然大于世俗化的公民教育。这样的孩子长大后，有那么一两个变成操着标准英语的恐怖分子，又有什么稀奇的呢？</p><br><p>    第三，政治正确导致英国社会对移民的价值观放任自流，恰恰阻碍了穆斯林融入文明社会。持英国传统价值观的英国人，即便他本人也非常不满伊斯兰教诸多压抑人性的做法，私下里也会吐槽诸如包办婚姻，割礼，通奸要石刑，女子不能工作，男人可以娶四个老婆，72个处女之类。但是他却不会和穆斯林同学谈论这种事情，更不会想去改变他们的想法，因为害怕被举报种族歧视，给自己找麻烦。这固然减少了很多争论，但也让穆斯林失去了接受多元思想和文明教育的机会。没有人对他说每个人都有平等的人权，人的自由高于一切这种话，他就不会去想他们宗教里对人身体和精神的种种摧残是不是对的，他也就不会觉得他的信仰侵犯了别人的自由是不对的事情。他最多想到，不同国家不同民族有不同的信仰和不同的生活方式，大家没有谁对谁错，互不干涉就好了。甚至他可能还会觉得他们选择那样的生活方式，是他们的自由，信奉自由主义的西方人更没有理由干涉。在这种环境下，表面的和谐是保证了，穆斯林的观念却依旧遵循着旧历。这也就是为什么西方社会对穆斯林的同化作用远低于其他族群。而与此同时，由于观念的巨大差异，英国本地人也很难愿意和保守的穆斯林交往，因此，越是保守的穆斯林反而越自己抱团，形成自己的社区，远离主流社会。相互作用之下，思想的越发保守甚至转向激进就在所难免。当然，英国过分的福利制度也为他们提供了便利，他们不需要和其他人交往，不需要融入社会，甚至不需要工作养家，只需要坚持自己的信仰即可，生活有困难，可以找政府。</p><br><p>    人们觉得尊重他人的信仰，是一种文明的表现，这个世界如果没有纷争该是多么美好。在这种心理下，越是所谓“弱势”伊斯兰教和穆斯林却越是得到了免于批评的权利，人们觉得这叫尊重和关爱。尽管这也使得文明失去了交流、传播的机会，但有人会觉得，文明没有高下之分，凭什么西方文明要做老师呢？也许在这些人心里，什么男女不平等，什么侵犯人身自由，只要打上了宗教的印记，那就有了神圣不可批判的光环。他们认为古人建立的宗教其智慧上一定是超越今人的，一定是可以指导未来几千年人类的发展的。批判的人一定是不懂宗教的高大上，玄乎其玄的东西在一些人看来总觉得是神秘而有魔力的。</p><br><p>       行文至此，可能很多人要问了，那该怎么办？首先，如果什么都不改变，像如今这样继续坚持政治正确是一定不行的。因为这只会导致恐怖袭击层出不穷。是的，不是每一个穆斯林都是恐怖分子，但他可能是一个看不惯白人女子穿比基尼的人，他可能是一个会要求热狗店不许再卖香肠的人，他可能是不允许自己的子女和异教徒谈恋爱的人。这样的人多了，他们依然可能会有一天通过民主程序，要求英国女子也要裹面纱。而且<b>虽然恐怖分子和穆斯林不可以画等号，但诚实的人都应承认，恐怖分子的出现在穆斯林中是一个概率问题，穆斯林会有一定的比例被极端思想影响，然后这些人就会有一定的比例变成恐怖分子，这两个比例的乘积就是恐怖分子的概率。这个概率不需要大就足以发动一场场恐怖袭击。继续如今这种政治正确并不会改变这个概率，只能干等着爆炸声一次次的想起。</b></p><br><p>      有人以穆斯林二代世俗化的比例为证据，认为只要时间够长，慢慢的欧洲的穆斯林就会世俗化的。其实，这是一个数字陷阱。假如说每一代穆斯林都有50%抛弃了保守思想，看上去很有成效是吧？那么一对穆斯林夫妇有4个孩子（这基本是最低数字），那也就意味着有两个依然是保守的穆斯林。他们的下一代又会有两个保守穆斯林，再加上每年源源不断移民过来的保守穆斯林，整体上欧洲的保守穆斯林比例只会逐渐增加，恐怖袭击的概率就会增加。这就是为什么单看穆斯林二代信教的比例在下降，但欧洲却依然在逐渐伊斯兰化。</p><br><p>    仅仅从经济角度提高穆斯林的生活待遇也是不行的。首先这会产生新的种族不平等，不足以胜任工作的穆斯林得到优待，这会让本就已经不思进取的社会更加堕落，何况还会造成巨大的财政负担，降低社会效率。其次，英国目前的社会福利不可谓不好，可是衣食无忧的生活并不能阻碍极端穆斯林的发展。甚至，这种想法只是对世俗化的穆斯林有用，对于保守穆斯林，只要有虔诚的信仰，很多人并不想要进取、奋斗、赚钱这种“世俗化”的事情。受教育程度低、收入低并不是社会排斥的结果，反而是保守穆斯林自己不愿融入社会。</p><br><p>    因此，应该考虑的做法是让保守穆斯林主动融入社会，接受欧洲的传统价值观，而非欧洲社会如何得迎合、放任他们和伊斯兰教了。至少，欧洲应该反思自己当下放任自流的价值观教育了。比如是否为要为了一个表面和谐的社会，而使人不敢表达自己的真实想法，哪怕是“偏见”？是否要继续容忍民众对自己传统价值观的模糊，不敢在价值观的问题上产生争论，捍卫自由和人权？是否还要继续将“政治正确”置于所有价值观之上？</p><br><p>    很多人都说伊斯兰化的问题无解的，但实际上是在政治正确的前提下无解。真要寻找解决方案，欧洲各国应该在本国国内强制穆斯林世俗化，就像凯末尔在土耳其做的那样，不接受世俗化的本国穆斯林要接受法律制裁，新移民应该被遣送回国。世俗化并不是要摧毁伊斯兰信仰，穆斯林依然可以去清真寺祷告，只是在非宗教场合不许穿宗教服饰，不许有宗教活动，只是让他们接受，人的自由和人权高于宗教信仰，他们应该先遵守法律，然后才是古兰经，对自己的身份认同，首先是一国的公民，然后才是穆斯林。当然这必然会引发激烈的冲突、抗议甚至暴力流血，真这么做了肯定很多人会受不了，呼天抢地的说，强制世俗化是在破坏宗教信仰，是在侵犯保守穆斯林的自由。其实恰恰相反，世俗化的宗教才是真正可以自有信仰的宗教。他们之前的那种没有不信仰的自由，小孩子生下来就一定是穆斯林，根本没有选择的权利，如何谈信仰自由呢？强制世俗化恰恰是在解放人性，就好像毛泽东死时，全国大部分人都哭的昏天抢地，但事实上，他们却是被解放了。你不能因为人们哭的很悲痛很发自内心，你就觉得最好让毛主席万寿无疆。</p><br><p>    当然，道理归道理，现实中我还是对此不抱希望的。<b>因为这个世界是属于小清新的。小清新们有煽情的冲动、廉价的眼泪、脆弱的心灵，姿势的正确比事实的正确更容易让他们赚取自以为是的道德优越感。他们会反对阿富汗、伊拉克战争，认为战争是会死人的，死人好残酷，好不文明的；他们会为北爱共和军的头领绝食而求情；他们会为关塔那摩虐囚而满腔正义的谴责美国；他们自然也会反对对保守穆斯林的强制世俗化。</b></p><br><p>    小清新们可以接受萨达姆对国内的屠杀和塔利班的暴政，因为他们听不到死人的哭声，他们甚至觉得，伊拉克人、阿富汗人、朝鲜人、中国人再怎么被压迫，那也是人家自己的事，被打死了，也是死在自己人手里。再说了难道美国人发动战争就绝对正义么？他们就没有杀过无辜的民众么？他们分不清，美国人无需是天使，只要比塔利班对阿富汗人更好一点，那美国人就有足够的正义推翻塔利班；只要侵略者对朝鲜人比金正恩好一点，那么推翻金家王朝就是正义的。</p><br><p>    小清新们可以接受保守的穆斯林一代一代永世不绝的承受割礼、强奸、包办婚姻、通奸就要死，可以接受他们男性视女性为私属物品，可以接受他们的女性被剥夺社交自由；却不可以接受保守穆斯林和他们的子孙后代带在被解放、在永远逃离这些枷锁的过程中所发出的阵痛的哀嚎。因为前者，他们认为是宗教，是传统，他们可以视而不见；而对后者，小清新们会咬起嘴唇、目光泛泪：“穆斯林好可怜哦。。。”</p><br><p>    今天的人们说起凯末尔首先想到的是他是一个伟人，现代土耳其的国父，却对他当年强制世俗化时对保守穆斯林的“血腥镇压”感觉没那深了。人们甚至不太记得，当年土耳其也是为此爆发过内战的，起义的库尔德人也说凯末尔不是真正的穆斯林。可是，当你现在走在伊斯坦布尔新城区的大街上，炫目的霓虹灯让你宛如置身巴黎，商场里穿着吊带装的土耳其姑娘显露着美好的身躯，都让你很难想象，这是一个到今天98%的国民都是穆斯林的国家。很多时候，自由的获得真的是要流血的，这很不美好，但却是残酷的现实。如果你以不流血为第一要务，那只能是纵容野蛮一代代传递下去，多少本该天真无辜的女孩，从生下来就注定她不能对自己的身体做主。是的，这样的事情发生了很多年了，继续这么发生下去，对你也不会产生任何的心理冲击，你会觉得，那是她们的命，他们活该吧。可是，一代代人受到这样的摧残，真的比流血更文明一些么？</p></blockquote>"
		},
		{
			"post_id": 5,
			"title": "伊斯兰因素会阻碍伊斯兰国家现代化吗？",
			"date_published": 1500793313.531,
			"body": "当然会。就不说伊斯兰国家了，就上中穆网吧，天天哀嚎着要学阿拉伯语要念经，请问现在阿拉伯语有数学论文科技论文吗？你要现代化，总要学英语吧，学阿拉伯语做翻译经商也不能现代化啊，念原版古兰经，国家就能富强了？人的精力是有限的，逼着你学意识形态，当然没空学科学技术，当然影响现代化了。再说生活方式，阿訇领导着大家小群居，每天都要花若干时间在宗教活动上，这得有俩前提，时间自由，地点自由，没错，阿拉伯人和回民最擅长的就是做商贩，但是对于现代化毫无益处，社会化大生产，现代化的公司，你时间必然不自由，你要封斋，要是一个文案编辑就算了，一个工厂生产线都是三班倒，机器停了再开不是你开电脑关电脑。你看，既不给你时间学科学技术，也不允许你用现代化的组织形式进行社会化分工大生产。他就是让你做小商贩，开清真饭店，千年前的职业，你才有时间精力和环境去符合他的要求。你说，怎么现代化？没错，这就是外在的，生产与生活方式上的不允许你现代化。而不是虔诚与不虔诚的问题，教义完美不完美的问题。中穆网上还有为要不要给清真寺牵网络争论是否玷污圣地的问题，把一切落后归咎于信仰的不虔诚，和大家的不努力。可见唯心主义害死人。\n\n作者：匿名用户\n链接：https://www.zhihu.com/question/22100518/answer/29927091\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。"
		},
		{
			"post_id": 4,
			"title": "伊斯兰因素会阻碍伊斯兰国家现代化吗？",
			"date_published": 1500793000.379,
			"body": "首先，你问得不对，伊斯兰国家，哪一个都不会现代化，只要有伊斯兰在，肯定不会现代化。现代化不仅仅是肉眼可见的现代化，而且还有思想，三观，法律等肉眼不可见的现代化，就算沙特富得流油，再有钱，再科技化，它也不是现代化国家，它只是一个披着现代化外衣的中世纪国家。因为伊斯兰教是一个中世纪的东西，而且这个宗教不具有可改革性，缺少现代化的必要条件，伊斯兰国家无法现代化。除非拆清真寺，屠光啊訇，对国民强制卡费勒化，强制养猪，吃猪肉，屠光这个国家里的伊斯兰男性，让非伊斯兰国家的男人给这个国家的穆斯林女性换种，首先从人口上把穆斯林变成无神论，在宪法内确定伊斯兰教非法“参考安哥拉”。然后，等伊斯兰因素完全从这个国家消失，然后再谈发展。\n\n作者：喵艾俞\n链接：https://www.zhihu.com/question/22100518/answer/112377247\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。"
		},
		{
			"post_id": 3,
			"title": "如何看待 2015 年 11 月 13 日在法国巴黎发生的恐怖袭击事件？",
			"date_published": 1500792913.995,
			"body": "作者：顾扯淡\n链接：https://www.zhihu.com/question/37472988/answer/72192489\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n朋友圈和时间线都在被法国的事件刷屏。\n\n心地善良的小清新和温和派穆斯林都在感动祈祷呼吁理性对待。\n\n前者就算了，后者一味的表示「与xx无关」「他们是极少数派」「欧洲人因为XX事件作死才导致了」「本质上是和平的宗教」「大部分穆斯林是平和善良的」「实际上书里面的教义是blablabla」的话语再多也压根不能改善别人的观感啊。\n\n作为一个独立的个体，既然做为「平和的穆斯林」这一群体身份能带来各种社会优待（牛羊肉补贴、额外独立食堂、高考加分、上班时间祈祷不会被扣工资等等等）那同时是不是也应该承担相应的社会责任？\n\n上面看到\n\n[@姜委员长](/people/915b10ea8d69dc80e08b4ef126b92720)\n\n一段话描述这个情况描述的很好，我直接黏贴复制过来\n不知道有没有得罪。。。。\n\n> 「以公共机构向穆斯林提供清真饮食为例，这样做，主要不是因为尊重穆斯林个体的信仰，而是因为穆斯林作为群体对公共机构的决策产生压力，迫使公共机构增加开支另设清真食堂。如果伊斯兰教只是一个人数稀少的微型教派，他们的特殊饮食要求并不会受到公共机构的关注。但一种身份不可能只带来好处而没有弊端。现在，穆斯林的群体形象因为恐怖袭击受到损害，作为个体的穆斯林也自然受到牵连。」\n\n实际上大部分穆斯林信徒近几年一味的逃避责任，一旦发生的暴力事件都会把责任推卸到「极少数人」身上，这里谁也没要求普通的、平和的穆斯林们去拿刀拿枪清理门户，但呼吁一下开除恐怖分子教籍、诅咒或者宣布针对平民的袭击者和组织者注定下火狱啥的没啥难度吧。\n\n社会大众需要你们的声音，改善穆斯林的刻板印象也需要你们的声音。\n可温和派穆斯林的代表在这种事情上面大部分都选择噤声。\n\n有一个现象不知道大家发没发觉。\n\n比如有说上海人、北京人排外，本地人瞧不起外来人口，仇视外地人觉得外地人提高了物价抢走了他们的福利什么的，最好政府下个命令把外来人口都赶走。。\n\n有没有这种人？\n\n有！\n\n但是还有会有很多上海人、北京人跳出来说，我也是本地人，我觉得这种看法是脑残，这帮本地的有房有车连外来的都竞争不过，读书都读傻了吧，没外来人口发展个屁啊，持这种论调我觉得就是煞笔，大家不用理他们，哈哈哈哈哈哈。\n\n这样的回答和情况也很常见吧，大家多接触就会得出上海人北京人有排外的，也有不排外的。有好人也有坏人。\n\n大部分人不会把排外这个看法加到所有的上海人北京人头上。\n\n反过来的话，穆斯林里面就很少有这种风气，比如昨天这里某某恐怖分子爆炸了，今天那里极端主义屠村了，明天又管人家杂货铺卖酒或者推广女性割礼了，后天还突突了人家一群画漫画的。\n\n绝少有平和的穆斯林站出来说「这帮人疯了，他们就是邪教，我们要和他们绝对不一样，他们曲解教义blablabla」\n\n现实情况就是一旦有人开地图炮攻击全体穆斯林，就会有穆斯林说你们怎么能这样，大部分穆斯林都是和平善良的，小部分人不代表我们全部，你们误解我们了。\n\n但是极端主义在某地造孽了，国内不激进的穆斯林们肯定不会大声说干得好，但大部分却也是选择沉默，不太会公开发布看法，很难看出他们的立场。\n\n这种事次数一多你让其他信仰的人怎么看？\n\n经常听到的论调是\n\n「穆斯林大部分都是好人，极端分子不代表全部穆斯林」这样的说法。\n同时持这种说法的人会拿现代社会的其他宗教或者类似事件来论证这个理论。\n\n穆斯林里有人开枪炸楼，天主教虔诚家庭长大的孩子也有连环杀人狂；\n穆斯林里有人监禁绑架，基督教英俊神父也有喜欢猥亵唱诗班小男孩；\n穆斯林不尊重男女平等，无神论者有神论者不论男女也有家暴爱好者；\n\n反过来说去公安部网站查被通缉的恐怖分子，每个都是穆斯林，但不能说穆斯林都是恐怖分子。\n同样的披露出来贪污腐败被两规的干部领导，每个也都是党员，我们不能说党员都是贪污腐败。\n\n一开始我也觉得他们的逻辑没错，时间久了就觉得哪里不对。\n\n因为天主教家庭长大的孩子说我变成连环杀人狂是因为我心理变态。基督教神父说我猥亵小男孩是因为童年经历，家暴爱好者说我抽老公鞭子是因为我享受这种玩法，让我欲罢不能。\n\n而穆斯林里的极端分子遇到什么不好的事情都会说这是我们的传统，是我们的教义。。。发现区别了没有？\n\n就是说党员领导会说我贪污腐败是为了我的欲望、为了我的情人、为了我的子女，有各种各样的可能。就是不可能说是因为我入了这个党，是党章教育我去贪污腐败。\n而极端分子、恐怖分子，都会说我这是遵循了教义，是信仰让我这么做的。\n\n现在是不是觉得极端分子不代表穆斯林文化的说法有哪里不对？\n\n别拿宗教信仰最大说事，宗教信仰比法律大的话佛教还禁欲呢，和尚尼姑会因为你找女朋友来揍你一顿不？\n\n*****分割线*****\n\n知乎上有一个穆斯林对我说的原话是\n\n知乎社区也算受教育水平相对高的地方吧，这里无脑黑一下绿教几百赞分分钟的事，姿势水平不高脸皮不厚的话分分钟有人喷你洗地，更遑论别的地方，可能直接上手了，所以不难理解平和的穆斯林为什么很少发声吧？\n\n我当时的评论是\n\n这个和知乎或者教育水平没有任何关系，无脑黑分分钟几百赞说明人家黑的符合大部分人的刻板印象，而消除大家的刻板印象这个事情你不应该推给知乎或者其他网络社区来做。\n\n事实上以吸引眼球和国家政策来说，穆斯林如果宣传抵制恐怖主义，消除仇恨的内容貌似比普通人享有更多的话语权。\n\n推行世俗化，消除民族隔阂，谴责恐怖主义和极端分子划清接线的事情穆斯林做会比汉人做好很多，大部分善良穆斯林青年应该也认识到这点，当然你说人家心里其实根本不屌你，压根不在乎你们这帮异教徒想啥那当我没说。。。"
		},
		{
			"post_id": 2,
			"title": "为何伊斯兰教其实是一个准军事组织？",
			"date_published": 1500792473.677,
			"body": "作者：梅冬冬\n链接：https://www.zhihu.com/question/35380437/answer/156694266\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n这世界上有很多东西似是而非。比如中国的儒教，看上去跟宗教没什么关系，本质却是宗教。又比如伊斯兰教，看上去是个宗教，本质却是一个军事组织。\n\n这个组织有以下几个基本点。\n1，一天点名五次。\n2，严格的饮食管制。\n3，服装管制。\n4，组织内通婚。\n5，普遍歧视组织外人类。\n\n1和2，3不用细说了，就是对人身一种控制。从最基础的衣食住行，使组织内和组织外的人类完全区分开来。使组织内人群形成认同感和依附感。\n\n重点说一下4和5。为什么禁止和异教徒的混居和通婚，证明了伊斯兰教是一个军事组织。\n\n举个栗子，当年日本人侵华的时候，大本营发过大量的指示，禁止日本军人和当地中国民众混居通婚，认为与中国民众的混居会“有损武德”。同样的，德国人入侵法国，拿下巴黎之后，有一段时间在巴黎游览的德国士兵被禁止和当地人有任何交流。这是典型的将敌人的民众非人化的行为，目的就是使士兵对占领区的民众不产生同情心，不负担杀戮的道德压力。在作战时期，这种非人化的行为是非常必要的。\n\n我们观察伊斯兰教，很明确的是一直在将组织外的人类非人化。包括死后下火狱，吃的是不洁之物，喝酒就是在犯罪等等等等。严格的将组织内和组织外分割开，使组织内对组织外的人，不管采取什么非人道行为，都没有道德负罪感。比如六十年代印尼对华人的屠杀，几十年来针对普通民众的恐怖袭击，所谓温和穆斯林普遍态度暧昧不清。就是这个原因。\n\n综上所述，对我们非穆斯林来说，伊斯兰教绝对不能以宗教视之，更是一个披着宗教外衣的封建政治军事组织。这个组织从穿衣吃饭，到金融经济，都不是宗教性的。这也是为什么在科学发达的今天，伊斯兰教依然能在世界如此活跃的根本原因。"
		},
		{
			"post_id": 1,
			"title": "同治回乱-大屠杀",
			"date_published": 1559264179,
			"body": "作者：就开始\n链接：[https://www.zhihu.com/question/62672705/answer/202265271](https://www.zhihu.com/question/62672705/answer/202265271)\n来源：知乎\n著作权归作者所有，转载请联系作者获得授权。\n\n同治元年（1862）的陕西，一些回民首领发动了“传帖杀人”，然后想要杀光陕西汉人 ，在黄河以西建立一个纯粹的穆斯林国家。起事前，他们秘请铁匠打制刀具，杀掉铁匠 以防泄秘，然后尽购街上的竹竿以充刀杆。惊奇的官府称为“买竹”事件。临潼县的一 个回民教师接到杀人传帖后的第二天，紧急报告县长。然后回家，知道回民不会饶他， 杀了自己的老母和妻子儿女，自杀[后人为之立祠]。临潼知县通报情况后，紧急关城才 保住了一些人。而渭河两岸的全县村庄，30万汉人全被杀光。当时西安城里的陕西巡抚 提出的政策是安抚回民，对城里回民未杀一人；紧闭城门以防城外回民进城杀人，也阻 城内回民出城杀人。再派陕西团练使张芾前去安抚。 想不到，回民起事的大首领任武，杀了张芾，再杀自己全家的老母、妻子和孩子，以示 自己已没有任何顾忌，血战到底。另一位首领白彦虎杀人最凶，立志掘掉黄帝陵。穆斯 林民兵30万人号称“陕回十八营”，几个月内在关中平原杀人五百万，80%的汉人。一 年时间关中26个县长被回民杀害。只有一些县城内和逃入骊山的人口幸免。 1863年甘肃回民受到动员开始起事，不过觉得难以下手痛杀汉人乡邻。于是，不抵清军 进攻的陕西回民，转入甘肃一路走一路杀，一次10万以上汉人的大屠杀有很多次，许 多县的汉人被杀光，共约600万，全省人口减少70%。一年之内，陕甘两省共有1100多万 汉人被杀。时称“同治回乱”。 华夏文明的发祥地陕西遭受如此浩劫。根据当时的经济军事情况来看，回民的动机既不 是反抗压迫的“自卫”，也不是“反清”。他们不为谋财，不为占地，没有计划侵入西 安或者北京，就是在当地进攻县城，围猎村庄，对汉民不分男女老幼，挨村挨户，全部 用刀砍死，用火烧死，单纯为杀人而杀人，种族灭绝。当时甘肃的靖远民谣： “同治 五年三月间，杀气弥漫天。十余万人一朝尽，问谁不心酸。桃含愁兮柳带烟，万里黄流 寒。阖邑子弟泪潸潸，染成红杜鹃。清歌一曲信史传，千秋寿名山。碧血洒地白骨撑天 ，哭声达乌兰。” 1864年，已从\"地方武警\"上升为\"人民解放军\"的湘军，左宗棠率部追剿捻匪进入陕甘。 左公对于回民剿抚兼用，下令“所有白彦虎部回逆，拒纳降，斩立绝。” 1862—1873年间，回民起事遍及陕西、甘肃、宁夏、青海、新疆，直至白彦虎退到新疆 投靠阿古博，最后逃往俄罗斯才告平息，史称“同治回乱”。这是世界近代史上最残暴 的种族灭绝大屠杀，比希特勒屠杀犹太人手段更残酷，规模相当于30多次南京大屠杀 。据《中国人口史》的统计，战前（1861）咸丰十一年的甘肃人口1946万，战后（1880 ）光绪六年仅存496万，人口损失比例为75%。 穆斯林针对“异教徒”屠杀，遍及时空，不足为奇。奇怪的是，1949之后的中国史书， 把屠杀汉人的白彦虎说成民族英雄，把拯救汉人的左宗棠说成刽子手；却把纯粹屠杀两 千万汉人同胞的浩劫称作“大起义”，义在何处？ \n\n\n\n---\n\n现在政府把这次战争称为\"回民起义\".但又不敢深讲,往往是一笔而过.对左也进行谴责. 对战争的起因,进程.结果在历史教科书中完全避而不谈.就是照顾到了双方的感情.因为 这次战争究其实质是民族仇杀.这次民族仇杀跟印度与巴基斯坦分离时的印度教徒穆斯 林之间的仇杀可以完全一样.回民对清政府的斗争并不十分坚决.有部分回民还投降了左 军.马化龙也是时降时叛.跟清政府玩猫与老鼠的游戏.但他屠杀起汉人可绝不含糊的.在 他初起时.攻占靖远县.该县23万汉人不分男女老幼被杀得只剩下五千人.张承志在<<心 灵史>>也曾提到过.当回民攻占陕西某县城后.杀光包括出生没几天的婴儿在内所有汉族 男子.轮奸所有汉族女子.称之为给汉人换换种.最后马化龙被擒后.凌迟处死.全家被灭 族.实在也谈不上什么冤枉.而且有一点必须要说明的是回民对汉人的屠杀主要是集中在 回民初起之时.占有很大优势.几乎控制了陕西大部与甘肃除兰州之外的全部.在这个区 域内对汉人进行大屠杀. 这次战争已经有一百多年了．现在无论是政府与汉人都在刻意淡化这些仇恨．去保 持这种民族团结的局面．因为现在中国绝大多数汉人不知道一百年前的西北有这样一次 血腥与残酷的民族仇杀．这是与政府刻意淡化是分不开的．但是一部分回网上的成员一 定要把有些事情搞得水落石出的话．我想真到那一天，＂回民起义＂．这四个字中的＂ 起义＂两字就要去掉了．真正了解一些西北回民战争的史实后．觉得这次战争称为＂起 义＂．实在对不起死于这次战争中的那些无辜百姓．总觉得这些死者的灵魂还不能安息． 当年的回民，对渭南两岸的汉人进行了疯狂的种族大屠杀。想一想，当年这里的人 口总数不过七八百万,被杀了五百多万，这是一种怎样的惺风血雨的景象。据路伟东研 究，临潼县1861年的人口是26万。临潼县志载, “1862--1869七年，临潼县死亡人口30 余万.。渭河南北烧杀之灾无一村一人而幸免.。”也就是说，不仅杀光了原来的人口， 也杀光了这七年新生的孩子。 据富平县志载，咸丰五年（1855），全县有46579户，254257人。 到光绪二年（1876）统计，有28543户，120302人。户数和人数都减少 了一半。如果考虑到1869年之后的新增人口，估计1862--1869七年间回民杀了60 ％的富平县人。 据三原县志记载，咸丰十一年（1861）三原县人口16万人，由于回民起义加 之光绪年间两次瘟疫和大旱，三原人口锐减至4万人。回民起义两年间（1862—1 863），“县旧隶五百余村俱残破，仅存东里、蔡王二堡” 高陵县，据路伟东资料，回民起义前的1861年，高陵县人口6.9万人。高陵 县志记载，“同治三年（1864），县内人口锐减至32192人。”两年时间减少 60％。 回民在甘肃杀了六百万人，大约占全省人人的60%. 回民起义从没有进攻北京打击清政府的意图，说回民起义是反清，没有事实依据。 而所有的事实都是,不断杀汉人村庄，攻击县城。一年时间关中26个县长被回民杀害 。所谓的回民起义实际上主要是为了杀汉人， 回民起义之初，主要是回汉民之间的矛盾，经常有械斗。当时70％的汉民抽大烟 ，身体不好，而回民常习武，心齐，凶狠，械头时多数是汉民吃亏。回民起义起初的原 因是，回民借清朝军队集中到南方对付太平天国和云南回民起义，关中地区防务空虚， 一些回民首领屠杀汉民报私仇。 当时的陕西巡抚面对防务空虚，提出的政策是安抚回民，派朝庭大臣陕西团练头目 张芾前去安抚，想不到回民起义的发起人任武杀了张芾。为了鼓动回民，任武再杀了自 己的老母、妻子和孩子全家，以表示自己已没有任何顾及，血战到底。 为了给回民起义找到正当的理由，一些历史研究者不断提说，当时有一个“秦不留 回”的传帖，因而回民才要起义。对此，现在有案可查的是，当时陕西巡抚的初衷是要 安抚回民，并不是“秦不留回”。一个事实是，清朝政府对当时住在城里的回民未杀一 人，现在的西安西大街回民坊还住着大量的回民。当时清朝政府把城门紧闭，以防城外 回民进城杀人，也阻城内回民出城杀人。 对于“秦不留回”的传贴，当时也许有，但清朝政府没有这样的政策，有可能是有 人有意挑拨回汉民族关系。更有可能是，这是一个编造的说法，以鼓动回民对汉人仇杀 。 满清政府在对待民族关系上，回民列在汉民之前，所谓“满、蒙、回、汉”，汉民 是最受歧视的民族。在清朝期间，中国的人口大量增加，这说明清朝的经济并不是民不 聊生，而且发展很快。另外，回民多做小买卖、不抽大烟，在当时的关中农村，回民比 汉民富裕。说回民起义是因受清政府压迫或是汉民压迫，是有意识找出来的理由。更不 能以此为大屠杀辩解。 回民起义是陕甘人民在中国近代史上的一次大劫难。回民对汉民的屠杀是挨村挨户 ，不分男女老幼的杀害。1000多万人死于这场劫难，相当于30多次南京大屠杀。 说这是起义，真不知道义在何处。疯狂的大屠杀，也把回民带向了苦难的深渊，承受着 近乎灭族的灾难。反思历史，更让人明智的选择民族团结，而不是以反封建之名歌颂大 屠杀。 在中国闹回民起义和太平天国的时候，日本人开始明治维新，从此中国落后了。日 本人以他们的历史上，皇室从来没有改变、没有人推翻而骄傲，而中国人却在歌颂改朝 换代，而从没有人去考虑，每一次改朝换代都会杀掉60％的国民人头，毁掉经济和文 化。对于研究回民起义历史的很多人来说，也是这样。他们拚命地为大屠杀找根据，而 一千万条人命则不是他们所关心的。就连动物也不会吃掉同类，也知道惺惺相惜。而这 些历史学家，他们对人的生命却漠不关心，甚至歌颂大屠杀，将之称为义举，真是连其 码的人性都没有。 清朝大臣左宗堂采取剿抚并用的政策平息回民起义。凡是放下武器不再杀人的，都 给予安置让其安居乐业，包括对待领导回民起义的大元帅，也放弃追究责任。对不放下 武器，还要杀人的人则进行振压。他救了汉人，也救了回民。当时的回民起义精神领袖 和幕后人物是宁夏的马化龙，他的目的是要把西北地区变成一个伊斯兰国家。如果不是 左宗堂，可能陕甘两省的汉人会被杀光，并把中国分裂。左宗堂从侵略中国分裂新疆的 土耳其匪徒阿古柏手中，夺回了新疆，他粉碎了俄国沙皇侵略中国的企图。对于这样一 个中国历史上的民族大英雄，今天没有人纪念，而且一些历史学家还在骂他，这真是中 国人的悲哀。 回民起义中只有一个人没有投降，白彦虎。他大字不识一个，22岁参加起义，有 勇无谋，只因杀人多而成为回民十八大营的元帅之一，其他元帅多数是能识字的阿訇。 面对左宗堂的进攻，其他回民起义领袖为保回民免受灾难，都投降了，但白彦虎自知罪 孽深重，担心左宗堂不会放过他，不顾跟随他的几万回民的性命，坚持抵抗。在他参加 起义时，他的母亲投井自杀。他的嫂子不想奔命，发了几句牢骚，他杀了他的嫂子，以 挟迫他人。白彦虎到新疆后，投靠了侵略新疆的匪徒阿古柏，帮阿古柏侵略中国，后又 投靠沙皇俄国侵略新疆。 面对全族快要灭绝的境地，他没有想着保全回民亦然要血战到底；他投靠外国势力 分裂中国。就是这么一个人，现在有人把他奉为民族英雄。理由是他反封建最坚决。这 样一种没有人性、没有国家民族大义的历史观，是这个时代的悲哀。当年，在反封建的 大旗下，我们毁掉了多少文物，毁掉了多少优良的文化传统。今天，这种反封建高于一 切的历史观，在很多高层次的搞学术研究的所谓历史学家心中亦然根深蒂固。学术扭曲 了这些人灵魂，面对血流成河的历史，他们在高声的赞美。他们已成为魔鬼，哪是什么 饱学之士。 更有象张承志这样的作家，还在鼓动圣战，赞美牺牲。知识分子应当追求真善美， 以体恤生命为良知，热爱和平。歌颂屠杀、赞美屠杀，是不为人类所齿的。"
		}
	]
}