{
	"message": [
		{
			"body": "oh boy hows this gonna go. If this is really gonna be the case, how are you guys gonna take precautions?",
			"date_added": 1458163436186
		},
		{
			"body": "isnt the privatekey something we own ourselves? Not something we publish?",
			"date_added": 1458169630541
		},
		{
			"body": "well good news is on the way. One of my old friends from high school is doing research on QKD, so fun times ahead",
			"date_added": 1458169678867
		},
		{
			"body": "hehe. QKD stands for quantum key distribution. Basically, it makes it super easy to figure out if someone apart from the end users are messing with keys",
			"date_added": 1458170930746
		},
		{
			"body": "@basxto it should probably be good practice to put zn on a VM then. I think maybe a blog post for best practices on zn should be made at some point",
			"date_added": 1458171078996
		},
		{
			"body": "AppArmor? First time i've heard of this. What does it do?",
			"date_added": 1458171473793
		},
		{
			"body": "Ah well that's convenient",
			"date_added": 1458171657109
		},
		{
			"body": "interesting. i will get this installed and configured in the next few days",
			"date_added": 1458171828398
		},
		{
			"body": "I am a bit worried though. For some reason im getting some weird inject.js error on the home page",
			"date_added": 1458201447858
		},
		{
			"body": "Also I normally tunnel by ssh to connect to the machine that seeds zn pages for me, but I'm getting a connection refused. Know what's going on there?",
			"date_added": 1458201512420
		},
		{
			"body": "landing page when typing localhost:43110",
			"date_added": 1458202204168
		},
		{
			"body": "i'm using both. I can still access zn through local, but not when I ssh tunnel to zn",
			"date_added": 1458202332259
		},
		{
			"body": "i haven't had this issue till recently",
			"date_added": 1458202417950
		},
		{
			"body": "@erkan alright writing a bug report. Also gimme a second",
			"date_added": 1458202838544
		},
		{
			"body": "@erkan did you accidentally publish? cause I can't find the link you sent charles about the whisper app",
			"date_added": 1458203043031
		},
		{
			"body": "@erkan oh woops that might have been a different chat. damn this gets confusing",
			"date_added": 1458203079556
		},
		{
			"body": "doesn't manual update take care of that?",
			"date_added": 1458203935412
		},
		{
			"body": "@erkan i take it back. you did link charles a wiki page at some point but that message is gone",
			"date_added": 1458204007110
		},
		{
			"body": "@erkan oh ffs! I can access ZN through IE with what I have ",
			"date_added": 1458204305283
		},
		{
			"body": "(ew IE)",
			"date_added": 1458204328202
		},
		{
			"body": "opera. I took a closer look at the logs and there was an error about extensions",
			"date_added": 1458204370621
		},
		{
			"body": "(It was a moment of weakness, I'll never use an MS product again)",
			"date_added": 1458204416706
		},
		{
			"body": "/me prostates himself",
			"date_added": 1458204429891
		},
		{
			"body": "Alright I think i was able to reproduce the cause. Whenever I enable Opera Turbo is when problems start to appear",
			"date_added": 1458204602608
		},
		{
			"body": "@basxto meant as an apology",
			"date_added": 1458204735801
		},
		{
			"body": "/me wiggles",
			"date_added": 1458204820826
		},
		{
			"body": "uhh",
			"date_added": 1458204851310
		},
		{
			"body": "cx alright thats enough fun times for me. Glad that whole browser issue is identified, now I can sleep easier.",
			"date_added": 1458204966886
		},
		{
			"body": "thanks @erkan. Was fun talkin to you guys",
			"date_added": 1458205024448
		}
	]
}