{
	"title": "A Chinese's Blog",
	"description": "[Talk 论坛](http://127.0.0.1:43110/talk.achinese.bit)\n\n[Blog 博客](http://127.0.0.1:43110/blog.achinese.bit)\n\n [Zero me社交网络](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q/achinese@zeroid.bit)",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 24,
	"demo": false,
	"modified": 1523648538,
	"post": [
		{
			"post_id": 23,
			"title": "“人民有下流的权利”",
			"date_published": 1523648305.654,
			"body": "<div>今天看到一个帖子关于拉里弗林和他的色情杂志：《皮条客》。\n</div>\n\n<div>拉里弗林在法庭上有这样一段抗辩：如果我们对某些人认为淫秽的东西竖起一堵墙，那么各种各样的墙就可能被竖起，到那时，我们就什么也看不到，什么也做不了了。因为，今天他们能抵制低俗，保不准明天就会抵制丑陋，抵制穷人，抵制矮子，抵制残障…\n</div>\n\n<div>2018年4月“内涵段子”，遭政府永久关闭。\n</div>"
		},
		{
			"post_id": 22,
			"title": "中国模式：共产党资本主义",
			"date_published": 1523264917.112,
			"body": "《中国人权双周刊》首发，转载请注明出处。（第 185 期 2016 年 6 月 10 日 — 6 月 23 日）\n作者：程晓农\n[http://www.hrichina.org/chs/zhong-guo-ren-quan-shuang-zhou-kan/cheng-xiao-nong-zhong-guo-mo-shi-gong-chan-dang-zi-ben-zhu-yi](http://www.hrichina.org/chs/zhong-guo-ren-quan-shuang-zhou-kan/cheng-xiao-nong-zhong-guo-mo-shi-gong-chan-dang-zi-ben-zhu-yi)\n\n从上世纪 90 年代末开始，中国的改革中就出现了明显的权贵资本主义特色。近 30 年来，海内外一直在谈权贵资本主义，但对它的评价始终围绕着腐败这个话题转悠，却没有进一步深入下去，因此也留下了一些值得思考的问题。首先，说中国有权贵资本主义，大概没有多少人反对，但是，能够据称判断，中国早已是资本主义经济制度吗；如果是，中国又是在哪一年告别社会主义、步入资本主义的，有明显的政策轨迹可寻吗？其次，权贵资本主义如果确实是中国模式的产物，那么它似乎就不单纯是部分权贵的不当个人行为，而是体制型产物，因此反腐败也就无法铲除权贵资本主义的制度基础了？对这两个问题，笔者的回答都是 Yes。之所以这样看，是基于以下的基本判断：中国早在 1997 年底就通过国企私有化，正式把经济制度改变成资本主义经济制度；但是，在政治制度层面，中国的资本主义经济制度并没有产生民主化的社会动力，相反，中国的资本主义经济制度与红色政权「结婚」了，因此产生了人类历史上独一无二的独特政治经济制度结构，既非社会主义，亦非民主资本主义，而是共产党资本主义（communist capitalism）；笔者首次提出的共产党资本主义这个概念（已有英文论文发表），指的是共产党领导下的资本主义经济体制，它用资本主义制度来巩固共产党的专制政权，这就是中国模式的真谛。\n\n## 一、中国模式：社会主义国家转型的最差道路\n\n共产党的传统目标本来是消灭资本主义，毛泽东时代的红色中国便彻底消灭了私有制，资本家的绝大部分财产都被剥夺；与此同时，中共的政治精英以及「红二代」们虽然拥有政治特权，却没有任何祖上留下来的企业或财产。但从邓小平时代开始，中共的红色政权与资本主义经济制度「结婚」了，这不仅仅是指共产党政权容忍资本主义的发展，而是共产党精英自身变成中国最富有、最有权势的资本家。社会主义国家早晚会重新变成资本主义国家，这不是什么新奇观点。1988 年在奥地利首都维也纳召开过一个关于社会主义国家改革的讨论会。在那次会上，一位来自共产党国家匈牙利的经济学家语惊四座：所谓社会主义，无非就是从资本主义到资本主义的过渡时期。按照他的意思来理解，也就是说，社会主义的寿命总是短暂的，不会太长久，这些国家之前从资本主义被改造成社会主义，然后又不得不从社会主义回到资本主义。一年以后，这位匈牙利人的看法就被苏联东欧共产党阵营的解体所证实。\n\n但是，社会主义国家的改革就只有权贵资本主义一条路吗，中国模式的这种结局是必经之途吗？笔者多年研究社会主义国家的转型后发现，从社会主义回到资本主义，不是只有一条路，而是至少有三条路，中国则选择了其中最糟的那条。\n\n共产党国家一旦告别了传统的斯大林社会主义模式，就走上了制度转型的道路。所谓转型，指的是在经济制度方面实行自由化，即经济转型，包括用私有化取代公有制和用市场化取代计划经济，而在政治方面则是实现民主化，即政治转型。从 1989 年到现在，世界上的共产党政权除了北朝鲜之外，其它国家或者完成了转型，或者正在转型途中。纵观这些国家的转型道路，可以发现，经济转型相对容易，而政治转型则比较艰难。在 20 世纪 80 年代，中国曾经一度成为共产党国家经济转型的先行者，现在却因为拒绝民主化而沦为转型国家当中的落后者，这种落后指的是制度层面的落后。\n\n在所有共产党国家，转型一旦开始，红色精英试图窃国自肥，乃是通例，但是，这种局面并非不可避免。迄今为止，原社会主义国家的经济和政治转型大致有三种模式。第一种是中欧模式（波兰、匈牙利、捷克、斯洛伐克）。这些国家的政治转型为异议知识分子所主导，红色精英染指经济转型过程的企图受到遏制；异议知识分子的基本主张不是与原红色精英们分享权力或和解、宽容，而是通过清除共产主义污垢，尽可能铲除共产党文化的残余。而在中欧国家许多民众的眼里，共产党政权不过是一个苏联扶植的傀儡政权，应当被唾弃。结果中欧国家的前红色精英无法在转型中为所欲为，他们面临巨大的社会压力，既不能操纵议会，也无法通过私有化发财；最后，原来的红色精英多半未能从转型当中获得好处，大约三分之一的原红色精英的社会经济地位下降，一半左右提前退休。有美国学者把中欧国家的这一转型称为「建设资本主义但不产生资本家」（making capitalism without capitalists），这个说法比较含蓄，所谓的不产生资本家，其实是指不产生红色资本家，因为在共产党国家里旧的资本家早已被消灭，假如在短短几个月或者一年里就冒出来许多暴富者，那他们多半是原来的红色权贵。简言之，中欧模式其实就是，重建资本主义，但没有红色权贵的份。这样的转型具有自稳定性，与红色历史彻底告别，很难再出现反复。\n\n第二种是俄国模式，其结果是，原来的共产党精英摇身一变成了民主派精英，然后他们分享转型当中的好处，从中发横财；同时，老百姓也在私有化过程当中获得了一部分产权。这是典型的「老权贵带入新社会模式」；与中欧模式相比，俄国的转型属于「同志们的资本主义」(comrade capitalism)，因为新权贵的大多数都是原来的党内同志。这样的资本主义也是权贵资本主义；但与中国不同的是，出身于旧权贵的新权贵们不再是共产党员。俄国模式下，民主制度虽然不至于被完全颠覆，但很容易就被旧权贵们所操纵，使得新制度带有深深的旧痕迹。\n\n第三种则是中国模式，其主要特点是：中共政权虽然把前 30 年毛泽东时代通过革命建立起来的社会主义经济制度，如全面公有制和计划经济抛弃了，但是，它用共产党资本主义巩固了毛泽东留下来的专制体制。红色权贵及其亲属成为最容易致富、又理所当然地通过政治权力来保护自己的特权集团。在权贵私有化过程中产生的种种黑暗行为，例如红色家族的疯狂敛财，导致整个国家高度腐败。这种腐败政治必然产生严重的社会分配不公，当财富与上升机会都被社会上层垄断时，庞大的社会底层必然产生对精英阶层的仇恨，仇官、仇富情绪在全社会蔓延。\n\n## 二、私有化在中国：掩耳盗铃 20 年\n\n在中国的官方宣传里通常把 1992 年的邓小平南巡视为改革的一个新起点。其实，如果从制度转型的角度去看，中国的社会主义经济制度正式走向寿终正寝的准确时间点是 1997 年，因为从这一年开始，中国开始推行国有企业的私有化。社会主义经济制度的支柱之一是企业的国有制，而一旦国有企业的大多数都私有了，社会主义经济制度就彻底解体了，而以企业私有为特征的经济制度其实就是资本主义。但有趣的是，中共对自己实行的私有化政策至今仍然是掩耳盗铃，明明已经做完了，却从不承认它 10 多年前就已完成了私有化。当局用来掩盖私有化的词语是国企「改制」，至于改成什么所有制，则故意避而不谈。其实，要改变国企的公有制，只有两种可能性，或者是全部私有化（一个企业完全变成私有），或者是部分私有化（一个企业的国有产权部分转化为私有，但国有股份仍占主要部分）。中国政府选择私有化方向并刻意模糊转型的实质，自然有其苦衷。\n\n时任总理朱镕基之所以如此决策，主要出自两点考虑。第一，国企成了政府的沉重经济负担，导致银行系统濒临崩溃。由于邓小平时代的经济改革无法解决国企的严重问题，企业长期依赖国有银行的无条件贷款，但经营状况日益恶化，许多国企停止偿还银行贷款，甚至连利息也不再支付。从 90 年代中期开始，整个银行系统的潜在金融危机日益暴露。90 年代初四大国有银行 20％以上的贷款属于坏帐；1994 年全国银行业出现了历史上第一次严重的全面亏损；到了 1996 年银行系统的坏帐加上逾期呆滞贷款已占贷款总额的 70％左右。为了使银行系统免于崩溃，1997 年下半年政府不得不全面推行国企改制（即私有化），把十多万家国有工业企业当中的大多数作为「包袱」甩掉。第二，当时中国急于加入 WTO，以便扩大出口，而 WTO 接纳中国有个前提，那就是以 15 年为期，中国必须建立市场经济，即取消计划经济和实行国企私有化，中国如果不能证明它实行了国企的私有化，就无法获准加入 WTO。\n\n由于政府和国内媒体掩盖真相，所以至今许多从未在国企工作过的人仍然不了解何谓「国企改制」。其实，所谓的「改制」，就是让中小企业私有化，同时让大型国企上市，实行部分私有化。当局让国有企业的厂长经理和地方政府官员充当「改制」和裁员下岗的操作者，同时也就把私有化可能产生的社会不满和愤怒，从政府身上转移到了国企的厂长经理身上，而政府则置身事外。当然，国企的厂长经理们也不会白白当这个「替罪羊」，他们得到了巨大的好处。私有化的关键是谁来购买国有企业。中国与俄罗斯一样，国企厂长经理们的家庭积蓄根本无法满足收购企业所需要的百万、千万、甚至上亿元的资金需要；而外资在国企私有化的过程中发挥的作用微乎其微。在这种情况下，中国的国企厂长经理们能成为各自企业的新老板，其实基本上靠的是非法手段。正因为这重重黑幕，所以中国政府一直不许国内研究者研究私有化过程，国内媒体也基本上不报道国企私有化的真相。具有讽刺意味的是，尽管私有化在中国国内是新闻和研究「禁区」，但对境外研究者却是完全开放的，境外研究人员可以通过一些国际组织如世界银行等，自由进入中国，对私有化过程和私有化之后的企业所有权状况做全国范围的抽样调查。过去十多年里，这些参与调查的研究者发表了多本英文著作，介绍中国私有化的成果；然而，这些书籍却一本也未能在中国翻译出版。当局之所以准许境外研究人员对国企私有化做调查，是为了向世界银行等国际组织提供中国私有化进展状况的资料，为中国加入 WTO 铺路。由于中国国企私有化的结果早已在国际社会公开，所以，当局对私有化的态度也仅仅是在国内掩耳盗铃而已。\n\n## 三、共产党干部是如何变成资本家的 ------ 中国式私有化的奥秘\n\n私有化过程本身就是建设资本主义经济制度的过程，但不同的私有化方法会建设出不同的资本主义。朱镕基于 1997 年底开始推行国企改革，当时这一政策被称为「抓大放小」，所谓「抓大」，就是指资产规模大且与国计民生有关的金融、能源、电力、电信、交通等企业准许重组上市，向国民和外资出售部分股份，但国家仍然控股（即政府继续「抓住」这些企业不放）；所谓「放小」，就是指资产规模较小或亏损严重的国企准许其私有化，以甩掉政府的包袱。中小企业私有化的关键在于：由谁用什么方式来「购买」国企。当时国企厂长经理们的平均月薪只有几百元人民币而已，红色权贵及其亲属也同样没有多少金融资产。中共采取的办法是，一方面，让近百万国企管理者用企业的名义担保，从银行借款，「购买」国有财产，并准许这些管理精英把企业重新注册在本人或家族成员名下，然后以企业所有者的身份，动用企业公款，归还他们私人购买企业的贷款；另一方面，由国企管理者逼迫员工出资购买企业的部分股份，职工为了保住饭碗，只能拿出家庭储蓄来购买本企业的股份，但普通职工拥有股份后，企业管理层并不许职工股东过问企业经营和资产转让，所以等于是逼迫职工出资帮企业管理层获取企业的所有权。同时，当局纵容红色权贵家庭的妻子儿女利用关系网，帮助大国有企业获准上市，以此无偿获得上市公司的股份，然后通过抬高股价大获其利。\n\n中国的私有化始自 1997 年下半年，到 2009 年基本完成。1996 年全国国有工业企业为 11 万家，到了 2008 年底只剩下 9,700 家，其中还包括已经实行部分私有化、但政府仍控股的大型国企。中国的私有化分为两个阶段。第一阶段是中小国企的私有化，从 1997 年下半年到 2001 年，历时 4 年左右。其结果是大部分企业被厂长、经理私有化了。笔者曾分析了 29 个省市 130 个国企的私有化案例，归纳了数种典型手法，发现了国企私有化的黑暗过程。他们的做法通常是，首先有意低估企业资产净值；然后，或直接动用企业公款，或以企业的名义去银行贷款，或向私人借款，买下自己管理的企业，注册在本人或亲属名下；最后，以新企业主的身份，用私有化之后的企业资金偿还自己购买企业所借的款项。也就是说，他们虽然购买了自己管理的企业，个人却往往只付很少的钱，甚至分文不付。第二阶段是大中型国企的部分私有化（partial privatization），大约从 2002 年开始，到 2009 年基本完成，其手段包括把国企改组后上市、管理层持股（MBO）、职工股份化、与外资合资、与私企合资等。由于这些企业资产规模庞大，管理层无法独自侵吞，所以通常是动用公款购买企业股份送给管理层干部，同时也用送股份的办法贿赂那些有权批准企业上市的政府部门官员及其家属，形成利益共谋。这些国企干部和政府官员不花任何成本，便成为大中型上市公司的持股总经理或常务董事之类，跻身于富人行列。\n\n中国的私有化完成之后，究竟哪些人成为企业的所有者？根据两个全国性抽样调查的数据，大约 50% 到 60% 的企业都由企业管理层私人拥有；大约四分之一的企业的买主来自企业外部，属于国内其他行业的投资者，但其中外资所占份额不足 2%；由管理层和职工共同私有化的仅占一成（俄国私有化之后企业职工持有的本企业股份大约占 40% 左右），但管理层不允许职工股东过问企业的资产管理和转移，所以，这类私有化的结果相当于职工出钱，但管理层拥有企业。这种「国企改制」几乎就是企业管理层伙同其上级（地方政府官员）和红二代们对国有资产的公开瓜分和掠夺，当局无论如何没法把这种掠夺解释成正当行为，公开的讨论更会导致公众的愤怒，所以政府不许国内媒体讨论私有化，中国的学者们也基本上不能从事关于私有化过程的研究。\n\n从 1998 年到 2003 年，当红色精英通过私有化大范围侵吞中小型国有企业的资产时，当局特地关闭了负责监管国有资产的国有资产管理局，在这私有化高潮的关键 6 年里制造了国有资产监管「空窗期」，为红色精英们侵吞国企资产提供了方便。尽管 2003 年以后又重新恢复了国有资产管理局，但该局对私有化过程中侵吞国资的行为极少追究。在私有化期间，从 1997 年到 2005 年，全国到处都发生大规模的劳资冲突，根源都是厂长、经理通过私有化侵吞公有资产，而政府基本上都站在厂长、经理一边，因为政府官员从中也可以得到好处。俄国在私有化过程中，社会福利制度仍然正常运转，少数失业工人可以领取社会福利而勉强生存；但中国推行私有化的时候，原来以企业为基本单位的福利体系垮了，许多企业给工人很少一点钱，把他们赶走，就死活不问。当时中国政府广泛宣传，国企工人下岗是为改革作出必要的牺牲，但政府却不愿意为下岗职工建立统一的失业救济，而是把这项支出甩给私有化之后的红色老板，如果企业的新老板不想付，政府也不管。其实，如果国企私有化了，企业付不起社会福利开支，政府对原本为国家职工的下岗人员有无可推卸的责任，但是中国政府当时采取了耍赖的态度。对比之下，俄国政府从未推行过强制下岗之类的政策，相反还用税收优惠鼓励企业保留职工岗位。比起中欧国家和俄国的私有化，中国的私有化是最不公正的，也最冷酷无情。显然，专制政体下的经济转型可以罔顾社会公正而不必担心选举压力，对权贵精英来讲，这样的模式自然是优越的；但普通民众的评价恐怕恰恰相反。西方有学者认为，共产党国家的威权体制有利于经济转型和经济发展，因为政府的强权可以克服来自民间的阻力，中国往往被他们视为一个最好的例子。但是，中国的私有化过程说明，威权政府在经济转型中往往会漠视社会公正，剥夺民众的权利和利益，而作出有利于统治精英的制度安排。\n\n## 四、共产党资本主义：马克思的苦恼\n\n自从马克思创立共产主义学说以来，中国模式是人类历史上首次出现的共产党领导下的资本主义经济体制。中共以消灭资本主义（化私为公）起家，但无法让社会主义经济体制获得长远的成功，最后只能改用资本主义经济体制来延续共产党政权的统治；而在化公为私的改革过程中，红色家族及共产党的各级官员及其家属摇身一变，成为企业家、大房产主、巨额金融资产所有者这样的资本家。他们积聚财富的过程充满了肮脏与犯罪，既需要红色政权保护其财产和生命安全，也需要通过政府垄断的行业继续聚敛更多的财富。因此，他们是中国现行体制的坚定支持者，而不是民主化的促进者。\n\n中共的红色权贵们在短短的 20 到 30 年内如何从一无所有变成巨富家族群，这是共产党资本家们发财的秘诀，也是理解共产党资本主义制度和判断中共利益集团未来政治走向选择的指南。简单来说，这个秘诀和指南就是，不法侵吞国产，垄断重要行业，操控政策获利，维持专制统治。不法侵吞国产，是指中共的经济管理精英们利用国企私有化过程，或者直接侵吞中小国有企业的资产，或者无偿获取上市大国有企业的股份；垄断重要行业是指，保留国有大企业在金融、能源、电力、交通、电信等行业的垄断地位，让红色精英或红二代占据这些大企业的要津，这类规模往往进入世界企业 500 强的超级大企业既提供大量税收以支撑红色政权，也让高管们通过获取股份、项目回扣和高薪、高奖金而迅速成为富翁；操纵政策获利是指，红色精英及其亲属通过参与或影响政策制定，抢先插手到政策给以优惠的行业或项目中，从而轻而易举地摄取巨大的利益；而维持专制统治则是指，红色权贵们极端敌视民主化，希望能够「永保红色江山千秋万代」，也就是希望让共产党的专制永久地保护自己的特权和巨额不法财富。\n\n当这个国家的大批企业和财富掌握在身为共产党员的红色资产阶级手中的时候，对红色资本家来说，唯一可以信赖的制度性保护，既不是市场经济体制，也不是法治，而是「无产阶级专政」，也就是他们对全社会其他成员的永久型专政。他们很清楚，传统社会主义那套经济制度丝毫不值得留恋，现在他们不但拥有比民主国家的企业家更容易获得的财富，也拥有无需竞争的优越政治地位，还可以阻止民主化可能造成的政治、经济清算，这就是中国模式的实质。很明显，在共产党政权之下，这种红色资本主义不会自发地转型成为民主制度下的资本主义。长期以来西方学者中有一种看法以为，经济自由化之后，原来的红色精英会自然地拥抱民主和自由。中国的转型结果证明，这种想法不但幼稚，而且是错误的。但是，红色权贵们也很清楚，「中国模式」时刻面临来自社会底层的威胁，因此，他们一面把个人的巨额资产向西方国家转移，一面把亲属移民到西方国家，以便留下后路。他们的「用脚投票」实际上宣布了「中国模式」的前途十分渺茫。\n\n1989 年初，邀请笔者访德的德国艾伯特基金会安排几位访问学者参观位于特里尔的马克思故居。当时留言簿上有人用中文写下一句话：「老马啊，你可把咱害惨了。」现在看来，这话只说对了一半，因为马克思也被中国模式害惨了。若让马克思现在来评价共产党资本主义，他可能既恼怒又欣慰：恼怒的是，共产党居然要靠「嫁」给自己的敌人资本主义才能存活下去，这对他的理论和主义是最大的讽刺；而欣慰的是，不管采用什么样的反马克思主义手段，总算还有个别机会主义的共产党政权依然活着，证明他也不是一无是处。但是，马克思仍然无法摆脱一个巨大的困惑：他的理论的基本框架奠基于「经济基础决定上层建筑」的假设之上，强调先进的生产力必然改变落后的上层建筑；但是，中国模式却逼着马克思不得不彻底推翻他的核心概念，从而也推翻整个马克思主义。在共产党资本主义制度之下，「无产阶级专政」这一上层建筑，其实是依靠资本主义的经济基础而维系下去的；那么，这个上层建筑究竟属于已经消失了的旧的社会主义经济基础的落后残余，因此将被历史淘汰，还是因其「先进」性，将必然孕育出又一次铲除共产党资本主义的新共产主义革命？或者，为了从中国模式里吸取教训，马克思必须把他的「经济基础决定上层建筑」一说，改成「上层建筑决定经济基础」？这不仅对马克思来说几乎是天问，而且对中共来说，也是一个无法回避的意识形态危机。现在马克思的肖像仍然立在天安门广场上，因为他能为红色资产阶级的特权身份和「无产阶级专政」的延续提供意识形态上的合法性解释。吊诡的是，中国模式本身是反马克思主义的；但中共生存下去的诀窍就在于，举着马克思主义的旗号和招牌，建设和巩固反马克思主义的资本主义经济制度。中国模式既挑战了马克思主义，也挑战了民主化理论。\n\n（本文转载 polar 在零网的转载）"
		},
		{
			"post_id": 21,
			"title": "民主是最坏的制度？",
			"date_published": 1523263268.297,
			"body": "有句老话“民主不是最好的制度，但它是最不坏的制度”，听起来有点拗口。看看丘吉尔的原话：\n\n‘Many forms of Government have been tried, and will be tried in this world of sin and woe. No one pretends that democracy is perfect or all-wise. Indeed it has been said that democracy is the worst form of Government except for all those other forms that have been tried from time to time.…’\n\nWinston S Churchill, 11 November 1947\n\n他认为民主是最坏的制度，除了那些已经在历史上实行过的其他制度。换句话说，以后也许有更好的制度，但目前历史上已实行过的制度中，民主是最好的。"
		},
		{
			"post_id": 20,
			"title": "学习二战时期的德国经济",
			"date_published": 1523184922.72,
			"body": "以前看到一篇关于二战时期的德国经济，希特勒的上台是民主选举出来，而且短时间内创造了德国经济奇迹。\n\n现在转发另一个知乎上的帖子，作者子翔。\n\n作者：子翊\n链接：https://www.zhihu.com/question/20264308/answer/27549242\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n部分资料来自[Economy of Nazi Germany](https://link.zhihu.com/?target=http%3A//en.wikipedia.org/wiki/Economy_of_Nazi_Germany%23Pre-war_economy%3A_1933.E2.80.931939)\n\n一战之后协约国施加的凡尔赛合约让德国支付了巨额的战争赔款，但类似于清末庚子合约，凡尔赛的赔款并没有全部支付，有一些化为了其他列强对德的债务和经济支援，比如说美国在1923年-1928年期间给了德国约价值200亿马克的贷款，协助战后的魏玛共和国工业复兴。这一时期，德国的经济运行尚可。\n\n但是由于1929年喜闻乐见的大萧条来了，美国自顾不暇，收回了贷款，英法两国也陷入了空前危机，德国自然无法独善其身。在这场危机中，德国工人大幅失业，国民经济遭受到沉重打击。\n\n1933年，纳粹党正式获得大权，亚尔马·沙赫特被希德勒点为德意志帝国银行的老板，次年又被点为纳粹德国的财政部长。这位仁兄为希特勒那是立下了汗马功劳，第三帝国的经济复苏，他确实功不可没。\n\n德国为了摆脱危机，不得不走上凯恩斯那条道路，也就是加强国家干预经济，通过公共工程消灭失业，加强工业的国有化，同时也保证私有化为经济带来活力。\n\n1.  由政府举债，兴建公共工程。比如说纵横德国的高速公路网（当然也是为了更好地调动军队），就是那个时期的产物。\n2.  大力扩军。德国的扩军受到凡尔赛合约限制，是违法的，政府也没有那么多资金而举债发展军工，不等于在脑门上写着“英法我要来打你么么哒”吗？为此，沙赫特为德国再次武装，提出了Mefo bills这一伟大构想，即帝国银行发行Mefo bill这个汇票，相当于一个受到政府信用保护的账外实体，用于支付军火公司的产品，但是纸面上呢，这个东西只发了1M的马克，就这样，德国偷偷地重新武装了起来，而帝国政府几乎没有付出特别大的代价。\n3.  配给制。德国扩军，但是所需资源不够，于是政府就采用配给制，限制供应比如油料啊，食物啊，blabla。通过推行配给制，获得产业之间的剪刀差（我兔50-80年代也是这么干的），从而将这些资金进一步扩军，简直不能更棒啊！完美的产业链就这么来了。其后果就是德国在30年代的农业水平相比一战并没有丝毫的进步，仅仅略高于1913年的水平。\n4.  没收充公。犹太人啊，叫你们经营商店，控制零售业和物价，统统没收。后来的种族迫害，大量犹太人的资产被纳粹没收，成为了纳粹政府的囊中之物。\n\n多管齐下，就这样创造了纳粹德国的“经济奇迹”，失业近乎绝迹，经济增速超过20%，各种百废俱兴，真是厉害得紧。\n\n但是，这种饮鸩止渴的刺激经济，带来了几个大问题。\n\n1.  如果军队不再需要产品，经济该何去何从？所以，这就成为了二战爆发的重要的经济因素，如果纳粹德国不发动战争，他们自己在未来就会崩溃，因为大量的债务和赤字。事实上，1936-38年，德国的平均工资水平下降了25%。所以，不断发动对外战争，创造军需订单，就成为了维持经济的必须手段。\n2.  在1936年左右，世界市场原材料价格持续上涨，而工业成品（德国出口的主要产品）的价格在下跌，德国政府越来越难以维持收支平衡，1933-36年，德国的出口下降了9%，进口同比上涨9%，带来了严重的贸易逆差。在这样的情况下，政府只能通过强行控制个人市场投资的方式来刮地皮。1934-38年，德国的非上市流通证券所占的市场份额从超过一半下降到大约10%左右。\n3.  即使在战争爆发，西欧都被纳粹占领的情况下，德国无法将工业产品往已经工业化的西欧倾销，资本流动无法构成循环，德国只能陷入资本的自我循环状态。\n\n所以可以知道，德国的扩张必然是“全球性”的，不以元首意志而转移的，所谓“换取德意志民族更大的生存空间”，倒不如说是向东打开市场。但由于希特勒政权各方面的原因，德国没能灭亡苏联，从而加速了其败亡。\n\n在战争爆发后，德国维持经济和资源收入主要来源于以下几点：\n\n1.  在占领国的掠夺式经济政策。在德国政府的“新领土”，德国买家以强制的极低价格购买当地原材料。所谓的“生存空间”理论又使德国强行掠夺占领国资源，法国的全国近半的车皮被用来输送货物给德国；1940年，挪威丧失了自身经济收入的20%，1943年时达到了夸张的40%。\n2.  在占领国强制征发廉价劳动力。当然，对于抵抗激烈的波兰人和犹太人，则送进集中营强制劳动。对于其他国家，主要是以廉价雇佣劳动力为主。直到1944年，强制占领国劳工已经占到德国全体劳动力的1/4，这个数字是极为惊人的。\n3.  与同盟、占领地区傀儡国的贸易。由于英国封锁，德国基本隔绝于世界市场，无法从美洲亚洲获得战争资源，于是纳粹只能在欧洲范围内寻求贸易伙伴，比如说瑞典的铁、罗马尼亚的石油、西班牙的钨。甚至在苏德交战之前，德国与苏联的贸易也非常繁荣，苏联利用原材料、粮食和石油从德国换取了大量的工业产品。\n\n与罗斯福新政类似的是，德国和美国在这个阶段都采取了政府公共投资的方式来刺激经济发展，但是与美国不同的是，纳粹大多通过军工产业来吸收政府投资和创造就业，走上了军国化道路。\n\n而我们来看美国。与德国几乎相同，美国在40年代初，也陷入了无穷无尽的政府高额赤字和高债务的怪圈，由于美国民众在二战初期的孤立主义和反战情绪，美国并没有参战，从而根本上解决经济问题。二战爆发后，美国通过租借法案向英国输出军火，是一个对于美国经济的缓解，不过由于租借法案的性质，这些生产并没有带来真切的收入。真正解决美国经济问题的还是1944年树立的布雷顿森林体系和战后西欧重建的马歇尔计划，使美国避免了战后危机，资本得到了循环。德国发动的这场战争，竟然拯救了美国经济，这不得不说是一个令人唏嘘的结果。"
		},
		{
			"post_id": 19,
			"title": "中国是市场经济么？",
			"date_published": 1523181614.28,
			"body": "今天与网友讨论关于中国是不是市场经济时，发现了这个网站。\n\n[https://www.heritage.org/index/ranking](https://www.heritage.org/index/ranking) 是市场自由度指数，共180个国家。中国排名110，是属于mostly unfree分类里面的。市场自由度虽然不是很高，但是距离计划经济还有很大距离。后面的70个国家包括希腊，印度。"
		},
		{
			"post_id": 18,
			"title": "万众创业",
			"date_published": 1523124930,
			"body": "看到韩寒的一段文字：\n\n身边很多朋友也在创业，成功失败都有。类似这种文章，估计又得鼓动一批人头脑一热想着如何暴富。创业不等于发财，创业大多是挫折与失败，尤其是你没有做好充分准备和科学论证的情况下，创业基本也就是九千九百九十九死一生。如果你只是不想朝九晚五当员工，这个社会也有很多道路可以走，未必都要当老板。若你义无反顾，内心坚定，而且性格就是如此，那你做好吃苦的准备就去干一番。但如果你看了那篇文章，心潮澎湃想要去抛弃其他同龄人，以这样的定力和心智，去开公司，估计也只能春夏秋冬，造福房东。"
		},
		{
			"post_id": 17,
			"title": "中美贸易战的小看法",
			"date_published": 1523117156.313,
			"body": "联系前一段时间中国修宪，现在习近平正在造神运动，无论如何也不能认怂。互相试探施压，檫枪走火的可能很大。\n\n流氓不可怕，有文化的流氓才可怕。"
		},
		{
			"post_id": 16,
			"title": "中国模式的另一种思考",
			"date_published": 1522875415.39,
			"body": "今天看了一篇胥志义的文章：“中国奇迹”是不是由中国模式带来的？\n\n_什么叫“中等收入陷阱”？那些落后国家，由于长期封闭，人民收入与发达国家相比，出现十倍甚至几十倍的差距，一旦开放，外国资本技术因其低劳力成本进入，同时具有竞争力的廉价产品进入世界，由此带来经济快速发展。但这是由低劳力成本而非生产效率的提高带来的。一旦人民收入有提高，达到一定水平，其生产边际成本接近发达国家，国外资本技术就会停止进入，同时产品竞争力下降，经济发展走向停滞。中等收入与发达国家高收入的差距，就是两国生产效率的差距。如果中等收入国家不能提高生产效率，就只能维持中等收入水平。而能不能提高生产效率，关键是人有没有得到充分解放。所谓进入“中等收入陷阱”的国家，都是人的解放不够彻底的国家。它们借助于产业转移，可以很轻易进入中等收入，却由于生产效率始终难以达到发达国家水平，将长期止步于中等收入。_\n\n> 这世界上也没有什么能“促进”经济发展的模式，至少到现在还没有发现。却一定存在阻碍生产力发展桎梏的体制，我们的任务就是要去消除这种桎梏。增进人的权利，人的自由，既是社会进步的根本体现。也是消除生产力发展桎梏的要求。一个个人权利自由获得充分发展的国家，既是一个现代文明国家，也是一个具有创新能力发展能力的国家。\n\n[全文链接](/talk.achinese.bit/?Topic:1522875124_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q/)"
		},
		{
			"post_id": 15,
			"title": "我对推翻共产党的看法",
			"date_published": 1522841502.281,
			"body": "> [fengyun666](#comment_6_1CSS5r7VbP5m8XURbHCDru8rKtG6CzHXf7): 他还没有醒悟。我就在国内，有饭吃是事实，但是也要看他是在哪个地方。现在有饭吃、生活好一点是因为改革开放。可是如果没有共产党，改革开放就是多余的，因为开放本来就应该是自然状态。共产党来了搞共产主义，搞得人民很惨。共产党现在做的只是不断变得更像美国。与其这样浪费时间，不如直接改成美国制度。\n\n貌似这个“他”说的是我。我没有为共产党歌功颂德，甚至有很多不满意的地方，不然也不会来零网。但是问题没有这么简单，不是拿美国那套制度就可以过来使用的。能翻墙就多看看近代史，尤其是满清末期到抗日战争期间的。制度美好，也要人来遵守和学习。\n\n我在英国生活已经十多年了，闲暇之余也经常比较国内和国外生活的不同。也从来没有断开和国内同学的联系。当然任何国家都有混得好和混得不好的。作为普通老百姓，总体高中同学比初中同学混得好。大学同学比高中同学混得好。甚至有创业板上市的公司老总。而他们都是普通人家的，没有官二代富二代。\n\n对于中国改革开放后的发展，任何一个西方经济学家都承认。甚至建立各种模型来解释中国的奇迹，但据我所知目前没有令人信服的简单原因来解释。当然在这个过程中，有很多很多问题。但不能否认的是从目前在世的百姓（大多数是40年后），今天的生活是远比他们童年青少年时期要好很多。推翻共产党，在国内完全没有群众基础，如果你们真正推崇民主，去看看中国的民意。天天说愚民政策，引导大家向钱看，不就是最典型的市场经济？\n\n有人总拿亚洲四小龙的例子说开放了，就会富裕。这是个假命题。开放的国家很多，经济真正发展起来的有几个？美国那么大的消费市场，随便甩一个单子给东南亚的盟友，小国很容易就富裕，为什么是亚洲四小龙，不是别的国家，是因为华人聪明能干？还是因为他们都反华，是美国盟友？如果中国开放，在那个年代，美国的外贸单能不能把全体中国人推向富裕？现在就已经因为顺差打贸易战了。\n\n所以我的理念是理性看问题，肯定进步，发现不足，日三省吾身。破坏总比建设容易，要结合中国情况，思考怎么能开发民智，怎么改良现有制度，而不是全盘否定共产党。目前来看这很难，制度改革目前似乎在开倒车。大家努力突破信息封锁，努力扭转局面吧。\n\n至于kai0为什么被我屏蔽，只是因为他发言太缺少对人的起码尊重，自以为高高在上的看墙内，不知道他的优越感从哪里来？"
		},
		{
			"post_id": 14,
			"title": "content和comment增加limits",
			"date_published": 1522674332.312,
			"body": "使用一段时间之后，发现不能发帖子和评论了，因为空间额度满了。\n\n需要修改相应目录 /zeor_install_folder/data/site_directory/data/users/content.json。找到类似下面的代码。\n\n  \"permissions\": {\n   \"banexample@zeroid.bit\": false,\n   \"nofish@zeroid.bit\": {\"max_size\": 20000},\n   \"achinese@zeroid.bit\": {\"max_size\": 1000000}\n\nfalse相当于封禁\n\nmax_size是发表的各种内容的最大限额。\n\n修改之后，在右侧隐藏菜单sign in一下就可以了。"
		},
		{
			"post_id": 13,
			"title": "习近平新时代中国特色社会主义经济思想",
			"date_published": 1522611511.967,
			"body": "新华社3月31日发表上万字长文，论述中共总书记习近平5年来主持召开16次中共中央财经领导小组会议的“成绩单”，提出形成“习近平新时代中国特色社会主义经济思想”的新名词。"
		},
		{
			"post_id": 10,
			"title": "天宫一号",
			"date_published": 1522575253.042,
			"body": "欧洲宇航局预测今天下午进入大气层，明天上午着陆。\n\n2年前天宫一号就失去联系，当外媒揭露的时候。党的航天局说还在可控的情况下返回地面。\n\n一转眼，见证奇迹的时刻到了。可控还是失控，看看会打谁的脸！"
		},
		{
			"post_id": 8,
			"title": "回答一个老外关于中国的几个问题",
			"date_published": 1522573954.561,
			"body": "你的翻译软件翻译的真不错。我简单回答一下你之前的问题：\n1\\. **全民普选**，像美国那样三权分立的政府。\n2\\. 之前以为共产党**自我改革**会更加民主。我们小时候都学过马克思政治经济学：经济基础决定上层建筑（指社会制度）。以为经济发展好了，社会制度会像民主社会靠拢。但现在独裁倾向明显，似乎这条路走不通。**推翻现有制度**不太现实，因为没有人知道用什么新制度替换，更有可能一团糟。\n3\\. **南海**。大多数中国人都认为南海是我们的。\n4\\. **美国外交政策**。太简单粗暴，和美国警察一样，顺便无理由开枪打人。\n5\\. **印度**. 印象不好，觉得还没有完全形成现代统一国家。与印度关系不看好，都是人口大国，存在天然潜在竞争。**俄罗斯**，几年前有人觉得应该好好合作，中国钱多，俄罗斯武器先进。这几年虽然中国武器发展快，对俄罗斯没有那么依赖。但还是觉得两国关系可以更密切，毕竟历史，制度有点渊源，而且敌人的敌人就是朋友。\n\n[原文评论](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1521388240_1M5xvV1TSGodUAGjtwjsLmFTUv1PSvPqWW/+5#comment_13_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q)"
		},
		{
			"post_id": 7,
			"title": "在中国司法独立有用么？",
			"date_published": 1522522655.862,
			"body": "看到curiousguy的一个回复，觉得很有道理。\n\n_不采用民主体制，不存在司法独立。_\n\n_现在是权权勾结，共党官员可以以党委的名义命令法院院长胡乱判案，由此造成司法不公大家有目共睹。_\n\n_就有人认为如果司法独立出来，不受党委的挟制，司法就会公正。这种想法同样可笑。法官就算获得皇帝一样的独立裁决权，他毕竟也是一个人，是人就可以被收买。以前是有人用权力压迫他胡乱判案，可以视为权力收买。假如权力收买的渠道消失，它同样可以被金钱或其它利益收买。例如碰到富商和穷人打官司的情况，富商显然有钱去收买法官，做出不公正的判决（不要提醒我存在监督机构，监督机构的负责人也是可以收买的）。_\n\n_因此，司法独立，和司法受党管辖，其实毫无差别。对于弱势的百姓而言，官官相护造成的不公和官商勾结造成的不公，对自己都是同样的不公。_\n\n_那么，就有人反对我了，既然人人都可以被收买，那么世界上不就不存在公正了吗？_\n\n_我的回答是，公正还是可能存在的，但**只有民主，才能实现公正**。_\n\n_美国的法官无权裁决嫌疑人是否有罪，有无罪的裁决是陪审团作出的，法官只能在陪审团裁决被告有罪的情况下，依据适用的法律条款给被告量刑。陪审团就是普通民众，美国公民通过简单的素质测验之后获得预备陪审员资格。美国的法院会随机传召当地的预备陪审员出庭陪审，原被告双方的律师都有权筛掉预备陪审员中他们认为会对对方有利的具体人员。这种制度下打官司，收买法官绝无意义，因为法官无权决定胜负，就算收买法官的目的是为了重罪轻刑或轻罪重刑，但那只会导致法官成为被告的另一场官司，而对最终的司法公正影响不大。收买陪审团成员是有意义的，但是缺乏可操作性，每一庭的陪审团成员都是临时决定的，无人可预知。想要做到收买陪审团成员，只能在平常的时候对所有的公民示好，才能收买到，但是那样不就是打造社会和谐吗，当然是好事。因此在美国，无论是民与官争还是民与商争，都不大会出现司法不公的结果。_\n\n_这就是民主公正。_"
		},
		{
			"post_id": 6,
			"title": "几个非常有用的帖子",
			"date_published": 1522520572.314,
			"body": "1.  [如何建立自己的blog，forum](/NewGFWTalk.bit/?Topic:18_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/)\n2.  [提交URL给peers](/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n)\n3.  我的论坛：[良知中国人](/talk.achinese.bit/)。聚焦环境，时事，政治话题"
		},
		{
			"post_id": 5,
			"title": "怀念水木清华BBS",
			"date_published": 1522505884.902,
			"body": "当年老水木被关站的时候，大家就盼望着有个去中心化分布式BBS。现在技术有了，可惜人心散了～"
		},
		{
			"post_id": 4,
			"title": "朱镕基的功过是非",
			"date_published": 1522503268.283,
			"body": "　　一向以写内参闻名的人民日报高级编辑凌志军，2011年出版了《1990～2002年中国实录》一书。在书中，一向以敢写高层政治人物内幕的凌志军，首次披露了朱镕基许多不为人知的政坛秘闻。事实上，尽管朱镕基已经远离公众视野多年，但关于这位前总理的话题，却一直是民间热议的焦点。本文选自《1990～2002年中国实录》，作者凌志军。\n\n　　1998年春天，新任总理朱镕基发誓“不管前边是万丈深渊还是地雷阵，我将义无反顾，勇往直前”时，世界与十年前李鹏就任总理的那个时候相比，已有很大变化，与五年后他声明自己无心恋战即将去职的时候，也相去甚远。\n\n　　他相信自己胜券在握\n\n　　在朱镕基成为总理之前的十几个月里，中国经济虽然已经渡过了最危险的暗礁，却还没有迎来朝霞满天，更说不上是风平浪静的港湾了。\n\n　　1997年春天，他在这边宣布“软着陆”已经实现，得意之情就像一个驾驶着毛病百出的飞机摇摇摆摆回到地面的机长。可是才过了三个月，就有消息说大事不好——泰国宣布泰铢不再与美元挂钩。接着泰铢大幅贬值，股市一落千丈，银行纷纷倒闭。“分明是一场金融危机嘛。”他这样说。\n\n　　东盟国家的自由贸易机制现在成了疾病传染媒介，马来西亚、新加坡、菲律宾和印度尼西亚，都被感染上了，连印度也不能幸免。然后又扩张到太平洋的整个西海岸，把韩国、日本、中国的香港和台湾，全都扫荡了一遍。到后来，连俄罗斯和南美也受了牵连。\n\n　　在地图上看看这条曲线就会知道，“风暴”在中国大陆的海岸线外面绕来绕去，总算没有登陆，中国也不像周围的国家那样焦头烂额，不过，麻烦也挺多：经济增长率下降，商品零售额下降，失业人数又增加了。\n\n　　这正是让朱镕基头疼的事情。商品过剩，东西卖不出去，工厂就没有办法继续生产，没有办法给工人发工资，也没有办法归还银行的贷款。这不正是在中国周围转来转去的“金融风暴”时刻窥伺的机会吗？\n\n　　他已下定决心阻止这场风暴登陆中国。\n\n　　由于朱镕基让中国成功地“软着陆”，国内舆论已经产生对他的依赖，他能理解这个局面。同样能够理解的是，如果他现在不能够阻止“金融风暴”的登陆，人们还是会认为他的新政失败了。\n\n　　到亚洲金融风暴发生9个月后，也即他就任总理的这个月里，他相信自己胜券在握。\n\n　　1998年3月5日，新一届全国人大代表踌躇满志地走进人民大会堂的时候，人人心知肚明，朱镕基就要取代李鹏成为总理了。\n\n　　正式的选举还要等两个星期以后，不过那并不重要，重要的是，在“金融风暴”的团团包围之中，人们都觉得只有这个人可以依赖，甚至连那些对他持有最尖锐的批评态度的人，也不再置喙。\n\n　　危机中需要强者，如同乱世出英雄。\n\n　　就像一叶深陷在狂涛巨浪中的小船，那些惊慌失措的船员都知道，只有强有力的人才能带领他们逃生。从这个意义上说，金融危机的逼近的确是帮了朱镕基的忙。这个人根本用不着收买人心，已是人心所向。\n\n　　“本以为他得罪很多人，得票不会高的”\n\n　　朱镕基出任国务院总理，是在3月17日。他得到了2890张选票（只有29个人反对他，另外有31个人弃权）和连续三次掌声。\n\n　　人民大会堂里的掌声雷动，乃是会议必有的情节，通常只有热烈气氛而不能引起人们内心的激动，因为那是台上和台下的一种默契。\n\n　　但是这一回显然不同。投票程序尚未开始，2000多位代表只听到江泽民主席提名朱镕基出任国务院总理，当即鼓起掌来。等到大会主持者胡锦涛宣布投票结果的时候，会场上再次爆出掌声。然后，上午10：40，高音喇叭里面响起一个声音：“朱镕基被批准为国务院总理”，掌声第三次响起。\n\n　　此后好几天，这三次掌声成了国内外报刊津津乐道的话题，记者们对掌声持续时间的描述也是长短不等——从“三十秒”到“数分钟”，总之可以恰如其分地说是“经久不息”，就像潮水似的，一浪高过一浪，未肯止息，以至胡锦涛几次想要继续下面的程序又被掌声打断。然而最重要的是，这掌声完全发自代表内心，而非事先的安排。\n\n　　朱镕基低着头，面色沉静平和，眼睛里没有了往日那种咄咄逼人的光芒。他也许是希望用这种方式使掌声尽快停下来。但是，代表们执拗地不肯停。\n\n　　每一个人都在等待着朱镕基的回应。在中国人眼里，党的领袖人物在这局面中的标准风范，应该是昂首挺胸，高瞻远瞩，挥动巨手，既有力又和缓。可是一个两鬓苍苍的官员这时候说：“他可千万别做出那种领袖样子，要不可就糟了。”正说着，就见他站起来，双手合十，微微地躬身前倾，向全场致谢。还好，这人还是一副凡人姿态，没有伟人风范。\n\n　　掌声依然不息。在会议大厅二楼的记者席上，媒体记者和工作人员纷纷起立鼓掌。\n\n　　“真是想不到。”一个名叫钟闻一的香港记者说，“我本来以为他得罪了很多人，得票不会高的。”一个自称连续十年采访人代会的记者说他“从来没有看到过这样热烈的场面”。另外一个更老资格的记者说：“我看到过，那是在周恩来时代。”\n\n　　假如记者们有机会评选十年以来人代会上最热烈的场面，那么无疑就是此刻，可惜他们没有这个机会。他们回到办公室，打开电脑写消息，却为找不到朱镕基的“镕”字而发愁。\n\n　　这是那个中午中国人最频繁地使用的一个字，可是所有计算机汉字处理程序当中都没有。《说文解字》说它的意思是“冶器法也”。《辞海》说它是铸器的模型。《现代汉语词典》把它作为“熔”的异体字，放在一个小小的括号里。就从这一天起，“镕”字人人皆知，这与这个字本身的释义无关，而和这个人有关。有些人还要在这中间寻找“冥冥之中的天意”，说他的名字就表明他是上天派来治国安邦的。\n\n　　“政府太庞大，把财政都吃掉了”\n\n　　大会闭幕这天，北京天气骤冷，白天气温在摄氏零度以下，地面上覆盖着薄冰。上午11：00，李鹏的车子开走了，朱镕基留下来，举行了他就任总理以来的第一次记者招待会。\n\n　　朱镕基走进人民大会堂东大厅，满面春风，后面跟着他的四个副总理。几百个记者用目光迎接这个人的到来，没有期待中的掌声。他们在等着他发表就职演说，就像江泽民和李鹏在几个小时前做过的那样。\n\n　　他没有发表就职演说，不过，一开始讲话就很精彩。他似乎懂得吸引公众的奥妙不在于说些没有错误又没有用处的大话，而在于真情、机敏、幽默，有个性，以及不失时机地造成某种戏剧化的效果。\n\n　　他说他很喜欢看“凤凰卫视”的节目，后来这家电视台的那位年轻漂亮的女主持人——吴小莉，果然有机会站起来提问，请他说说自己的“心路历程”，这让在场的记者都为之一振。\n\n　　就像他迄今为止生命中的许多篇章一样，这次演说也具有悲剧气氛。不过，人们总是被悲剧感动，喜欢为悲剧鼓掌，当他说出那句脍炙人口的名言——“不管前面是地雷阵还是万丈深渊，我将一往无前，义无反顾，鞠躬尽瘁，死而后已”的时候，记者席上掌声响起，连外国记者也在鼓掌叫好。\n\n　　他还说了一些一针见血、纯粹朱镕基味道的话。“为什么不能实行科教兴国？因为政府太庞大，把财政都吃掉了，吃饭财政。”他把手一挥：“本届政府决心精简机构，减掉一半人。”\n\n　　他说完了，向记者摆摆手，转身走了。记者用掌声送他出去。在这种场合，他们通常是不鼓掌的。他们把这看作一种工作会议，担心鼓掌会影响了自己的客观公正。可是新总理的魅力把这些苛刻的善于挑剔的人都吸引了。\n\n　　这倒不是他特别棒，而是由于共产党的官员中如此富有个性的人实在太少。电视上把这个人的音容笑貌直播出去，老百姓看了也不禁神往。他们编了一个新歌谣，到处说：“镕基！镕基！镕旧基，铸新基。”\n\n　　这一天，香港股市上涨323点。\n\n　　《人民日报》连续两天都是彩印，上面刊登江泽民、李鹏和朱镕基的照片。三个人微笑握手，一副亲密无间的样子。这是向世人昭告，至少未来五年，中国是一个“三驾马车”的局面。\n\n　　“叫我什么东西，我都不高兴！”\n\n　　一篇文章说，“它被任命为中国总理，应是中国之福”。\n\n　　一个名叫关愚谦的作家，想起七年前朱镕基访问德国时的一次演说，德意志帝国第一任总理俾斯麦的一位后人当场感叹：“像这样轻松、有生气又有实质性的谈话，我们已经久违了。”\n\n　　七年以后，另一个德国人，德国《商报》驻北京的记者赛德力兹，在此次记者招待会之后承认，“朱镕基闪烁着知识分子的智慧，有着一下就能抓住你的心的气质”，“谁见到他，都会受他感染”。\n\n　　美国副财政部长萨默斯见了他一面，就说他的“智商系数高达二百以上”。\n\n　　还有一篇文章干脆说，“这个人怎么不早些当中国总理？”\n\n　　毫无疑问，西方人喜欢随和、幽默、机智和具有开放态度的政治家。但是朱镕基最令西方人叹为观止的地方还不在这里，而是在于，当邓小平已经不在人世的时候，他的出现使得所有人都对中国的未来放下心来。有如《汉堡日报》所说：“一个卓越的总理将领导庞然大国前进。”\n\n　　改革后出现的大量失业、不安全感和群众的不满、亚洲经济危机等等，给中国带来不少困难，“朱是唯一可以把中国如此混乱的经济理顺的中国人。朱镕基本人的标志，就是‘现代化的中国’”。美国有个爱德华集团，是个很大的金融财团，它的金融专家预测：“朱镕基的成就，将使他成为伟人。”\n\n　　中国这边，还没有人把他叫“伟人”。不过，此公已有很多绰号：“铁腕总理”、“朱老板”、“铁血宰相”，这些还都算是客气的。《汉堡日报》的大字标题直接把他称做“DerBoss”，这在德文中的意思类似于北京话的“头儿”，叫西方人说出来，就有很亲切的意味。\n\n　　可也不是所有人都能无保留地赞扬朱镕基的成就、思想和品格。\n\n　　如前所述，过去几年他所持有的经济主张，已经多次被人指责为“私有化潜行”，后来则更进一步把他叫做“经济沙皇”，或者“中国的戈尔巴乔夫”。\n\n　　他是尝到过做“右派”的滋味的，所以心里明白，这样的用语意味着他在那些人的眼里已经成为政治上的敌人。有如1960年代把刘少奇叫做“中国的赫鲁晓夫”、1970年代把邓小平叫做“邓纳吉”。\n\n　　这使他不得不作出反应。\n\n　　“对于外界叫我‘中国的戈尔巴乔夫’也好，叫我‘经济沙皇’也好，叫我什么东西也好，我都不高兴！”他阴沉着脸对几百个中国和外国的记者说，这是那一天他唯一有些失态的时刻。\n\n　　最大的“地雷阵”是官员队伍\n\n　　1998年3月11日，朱镕基在全国人民代表大会上参加湖南代表团的讨论，看到拥有官员身份的代表依次发言，就知道都是事先的排定，于是询问有没有农民在场。\n\n　　的确有个农民代表，但被排在最后，会议主持者还告诉他如果没有时间就不要说了。可是现在朱镕基打断那些官员的话，把这位农民叫到前边。\n\n　　“这里都是干部，我听不到普通代表的意见，”朱镕基对那农民说，“你们那里的情况怎样？”\n\n　　那农民果然直截了当：“收费的太多，还有警察，收钱的事就干，不收钱的事就不管。”\n\n　　朱镕基听了大为恼火：“农民的负担太重，还要乱收费，你们于心何忍呀！”\n\n　　但是除了向属下官员呼吁恳求动之以情，他却没有任何行之有效的办法。直到五年以后本届任期将满之时，他仍然认为“农民负担太重”是他最为头疼的问题，而且痛感无能为力。这也表明仅仅依靠官员集团的道德戒律和良心发现，根本无法解决制度的弊端。\n\n　　这一年，朱镕基遇到的情形也挺怪。接任总理获得了异乎寻常的胜利，他有能力，有个性，胸怀大志，不肯随波逐流，在全国人大代表中间又获得压倒多数的支持，此后要做什么，应该比他当副总理的那些年更加得心应手。\n\n　　可是不然。朱镕基当时以为，只要他的政策符合民心，也就当然地能够获得干部的支持。以他多年所接受的党的教育来衡量，这种判断理所当然，他要求属下官员把“讲真话”作为守则，还对几百个记者表示他是不会惧怕前边的“地雷阵”的。\n\n　　可是朱镕基却没有想到，他面前的最大的“地雷阵”不是别的，正是官员队伍。\n\n　　朱镕基是中南海里最尖锐地斥责官员腐败无能的人。他们中正在弥漫“报喜不报忧”的风气，整天歌舞升平，不知危险正在降临头上。\n\n　　东南亚的金融危机给中国带来极大困难。“今年外贸出口增幅要下降十几个百分点，使国民收入下降两个百分点；乡镇企业下降，使国民收入下降一个百分点。”朱镕基这样警告他们。可是这些官员根本不愿理解其中含义。\n\n　　朱镕基的话并不比江泽民说得更加严厉，可是他说话的方式和口气却又截然不同，语气尖刻，毫不留情，没有余地，这让官员们难以接受。当他指责那些地方官员是“把杭州作汴州”的时候，就让人觉得他本来不属于他们圈子里的人。\n\n　　“你们可怜可怜我吧”\n\n　　但是这位总理低估了这个圈子对于人的销蚀和同化的力量。\n\n　　他说新疆那边的棉花全都积压，要不了几年就会成为废品，而山东却在走私棉花。于是他跑到山东的官员中去，说他希望山东能够“大踏步地后退”，去购买新疆的棉花，“我给你补贴打折，你们可怜可怜我吧”。看到山东人不理他，又连连感叹“管不了啊”。\n\n　　他又要求湖南的一群官员不要在农民身上增加苛捐杂税，甚至用哀求的口吻说：“你们给我一点面子好不好。”\n\n　　举出这样一些小事就可以明白，朱镕基对面前这个庞大官员队伍的某些风气既愤怒又无奈。\n\n　　这时候他已拿定主意，要拿国务院开刀。\n\n　　朱镕基把很多时间用在官员身上，希望他们不要阻碍他的新政。\n\n　　他把国务院的60多个部长一个一个找来，告诉他们，他打算把国务院的部门大大裁撤，还要减少300个部长和副部长、1900个司局长和副司局长，把国务院的3万工作人员减少17000人。\n\n　　部长们心中忐忑，问朱镕基什么时候做这件事，他说立刻就做。\n\n　　于是大家开始叫苦不迭，都说自己的部门如何如何重要，为国家所必需，不能撤销。只有胡启立——此人在1980年代是党的政治局常委中最年轻的一个——对朱镕基的计划做出积极反应，同意撤销自己领导的电子工业部，还说自己早就打算辞去部长职务了。\n\n　　这让朱镕基这位新总理感到失望。旁人处在这个时候，也许会悬崖勒马，不再提这件事。可是他不是这样的人，就像他自己说的，要“义无反顾，勇往直前”。\n\n　　整个国务院里人心惶惶，官员全都不知道将有一个怎样的明天，这和西方大公司宣布裁员以后雇员的心情没有什么两样。"
		},
		{
			"post_id": 3,
			"title": "感觉修宪改主席任期，有点像指鹿为马",
			"date_published": 1522503223.162,
			"body": "我就是要吃相很难看，看看到底有没有人反对。唉～"
		},
		{
			"post_id": 1,
			"title": "打赌-新版人民币",
			"date_published": 1433033779.604,
			"body": "听说人民币第四套要停止流通了，是不是要发行新版了，我敢打赌习近平的头像一定会出现在新版人民币上。"
		}
	],
	"tag": [
		{
			"value": "政治",
			"post_id": 3
		},
		{
			"value": "时事",
			"post_id": 3
		},
		{
			"value": "历史",
			"post_id": 4
		},
		{
			"value": "人物",
			"post_id": 4
		},
		{
			"value": "随想",
			"post_id": 5
		},
		{
			"value": "工具",
			"post_id": 6
		},
		{
			"value": "政治",
			"post_id": 7
		},
		{
			"value": "政治",
			"post_id": 8
		},
		{
			"value": "时事",
			"post_id": 10
		},
		{
			"value": "打脸",
			"post_id": 10
		},
		{
			"value": "时事",
			"post_id": 1
		},
		{
			"value": "打脸",
			"post_id": 1
		},
		{
			"value": "时事",
			"post_id": 13
		},
		{
			"value": "政治",
			"post_id": 13
		},
		{
			"value": "零网",
			"post_id": 14
		},
		{
			"value": "zeronet",
			"post_id": 14
		},
		{
			"value": "共产党",
			"post_id": 15
		},
		{
			"value": "改革",
			"post_id": 15
		},
		{
			"value": "经济",
			"post_id": 16
		},
		{
			"value": "经济",
			"post_id": 17
		},
		{
			"value": "经济",
			"post_id": 18
		},
		{
			"value": "创业",
			"post_id": 18
		},
		{
			"value": "经济",
			"post_id": 19
		},
		{
			"value": "历史",
			"post_id": 20
		},
		{
			"value": "经济",
			"post_id": 20
		},
		{
			"value": "政治",
			"post_id": 21
		},
		{
			"value": "政治",
			"post_id": 22
		},
		{
			"value": "经济",
			"post_id": 22
		},
		{
			"value": "历史",
			"post_id": 22
		},
		{
			"value": "自由",
			"post_id": 23
		},
		{
			"value": "政治",
			"post_id": 23
		}
	]
}