{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "OS 8 PASSOS PARA SE TORNAR UM ESTUDANTE DE ALTA PERFORMANCE",
			"body": "- Por Augusto Ollivieri\n\n\"O Guia Para Conquistar Melhores Notas e Mais Aprovações (Estudando Menos)\" é um manual completo para quem quer aprender muito melhor (em menos tempo), ser muito mais produtivo e alavancar seus resultados em vestibulares, concursos e no ENEM.\n\nDividido em 8 capítulos totalmente práticos, o guia lhe ensinará, passo a passo, métodos e técnicas que você precisa saber para acelerar seu aprendizado, elevar sua energia e disposição, desenvolver sua inteligência emocional, gerenciar melhor o seu tempo e conquistar mais aprovações!\n\n#eBook: https://web.archive.org/web/20190109202526/https://s3-sa-east-1.amazonaws.com/gobetternow/ebooks/Os+8+Passos+para+se+Tornar+um+Estudante+de+Alta+Performance+e-Book.pdf",
			"added": 1547069963
		},
		{
			"topic_id": 2,
			"title": "A determinação para achar o sentido da vida: Eduardo Marinho at TEDxAvCataratas",
			"body": "Eduardo Marinho, artista plástico com histórias fora do convencional, compartilhará suas perspectivas únicas e profundas da vida urbana. Ele consegue fazer as pessoas lembrar coisas que elas sabem, mas, geralmente, esquecem.\n\n- https://youtu.be/vC0aA9hgHwI",
			"added": 1547088166
		}
	],
	"topic_vote": {
		"1_1Q8vv3AZ9kzTnGRAE7WiREfHpCztxjJGsA": 1,
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"3_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"3_17ngq9wqgRWuFfkv6AhkH7rF5XwZdxCAb8": 1,
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1,
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"2_1Q8vv3AZ9kzTnGRAE7WiREfHpCztxjJGsA": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"1_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": 1
	},
	"next_comment_id": 31,
	"comment": {
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": [
			{
				"comment_id": 1,
				"body": "#Como estudar da maneira certa - Gustavo Haddad Braga\nGustavo Haddad, aprovado nos vestibulares mais concorridos do Brasil como o do Instituto Tecnológico de Aeronáutica (ITA), Instituto Militar de Engenharia (IME) e da Universidade de São Paulo (USP). Além disso, coleciona medalhas de olimpíadas estudantis nacionais e internacionais; conquistou o título mais importante da carreira de aluno exemplar: foi aceito na Universidade de Harvard, nos Estados Unidos. A vaga foi conquistada porque Haddad praticamente gabaritou nos dois exames chamados de Scholastic Assessment Test (SAT, Teste de Avaliação Escolar), uma espécie de 'Enem americano' que seleciona os estudantes para as universidades.  Na primeira prova, que traz questões de raciocínio lógico, consideradas mais difíceis, ele tirou 2.400, a pontuação máxima. Na segunda, onde caem questões específicas do núcleo comum do ensino médio ou de língua estrangeira, o estudante tirou 2.350 pontos. Ambas as avaliações exigem nível avançado de inglês. Haddad também foi aprovado no Instituto de Tecnologia de Massachusetts (MIT), Yale, Princeton, Stanford e Instituto de Tecnologia da Califórnia (Caltech) .\n\n \n\nGustavo formou-se em dois anos e em dois cursos ( Engenharia Elétrica e Ciência da Computação) no prestigiado MIT.\n\n- https://youtu.be/KKN_ZKPy_x0",
				"added": 1547070053
			},
			{
				"comment_id": 2,
				"body": "#OS 8 PASSOS PARA SE TORNAR UM ESTUDANTE DE ALTA PERFORMANCE\n\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_1Q8vv3AZ9kzTnGRAE7WiREfHpCztxjJGsA/OS+8+PASSOS+PARA+SE+TORNAR+UM+ESTUDANTE+DE+ALTA+PERFORMANCE",
				"added": 1547070114
			}
		],
		"1_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": [
			{
				"comment_id": 3,
				"body": "#Curso de Empreendedorismo Online Grátis\nEmpreendedor é aquele indivíduo que desenvolve a arte de empreender, de conquistar e mudar. Para ser um empreendedor a pessoa precisa aprender a exteriorizar aquilo que é e sempre foi. A palavra empreendedor, está relacionada ao seu próprio ser, ao seu ego.\n\nDiferente daquilo que muitas pessoas acham, empreendedores não são necessariamente aquelas pessoas que abrem um negócio próprio. Para ser um empreendedor de verdade, você precisa compreender as razões e motivações de um empreendedor, por isso todo empreendedor de sucesso deve antes compreender o seu próprio ser.\n\nCom este curso de empreendedorismo, o aluno irá aprender todos os conceitos fundamentais de uma forma prática. Os exemplos citados ao longo do curso são expostos para servir como referência no planejamento e desenvolvimento do seu próprio plano de negócio.\n\n- https://www.primecursos.com.br/empreendedorismo/",
				"added": 1547075942
			},
			{
				"comment_id": 4,
				"body": "#Como ele largou Medicina, fez Stanford e faturou Milhões | Gabriel Benarrós\nConheça a história do brilhante jovem Gabriel Benarrós, nascido em Manaus, que largou seu curso de Medicina na UFAM para ir fazer faculdade nos EUA, em Stanford, e que se tornou fundador da Ingresse, empresa de compra e venda de ingressos que já captou dezenas de milhões de reais em investimentos e movimentou mais de 170 milhões de reais em 2016. O Gabriel compartilhou ideias sobre sua história, escolha de carreira, suas aprovações nos EUA, sobre como conseguiu sua bolsa de estudos e muitas ideias e ensinamentos valiosos sobre problemas, oportunidades e Empreendedorismo.\n- https://youtu.be/tIFQXr6s8Tg",
				"added": 1547076402
			},
			{
				"comment_id": 6,
				"body": "#De Zero a Um – Peter Thiel\nPara Peter Thiel, cofundador do PayPal e investidor em diversas startups, o próximo Bill Gates não criará um sistema operacional. O próximo Larry Page ou Sergey Brin não desenvolverá um mecanismo de busca. E o próximo Mark Zuckerberg não criará uma rede social. Se você está copiando essas pessoas, não está aprendendo com elas. É mais fácil copiar um modelo que criar algo novo. O progresso vem do monopólio, não da competição. Se você faz o que nunca foi feito e consegue fazer melhor do que qualquer um, tem um monopólio - e qualquer negócio só é bem-sucedido na medida em que é um monopólio. Mas quanto mais você compete, mais se torna parecido com todo o resto. De zero a um não oferece fórmula para o sucesso. O paradoxo de ensinar empreendedorismo é que tal fórmula não pode existir. Como cada inovação é única, nenhuma autoridade consegue prescrever em termos concretos como ser inovador. Toda inovação vai de 0 a 1. Peter Thiel apresenta uma visão otimista do futuro do progresso e uma maneira original de pensar sobre inovação, ensinando você a fazer perguntas que o levem a encontrar valor em lugares inesperados.\n\n- https://mega.nz/#!5FdCGaAQ!Mwzo3z3-owuKmEkjDJOuR1z7I6P4wXPez2DPiQp2Flc",
				"added": 1547077366
			},
			{
				"comment_id": 7,
				"body": "#A Startup Enxuta – Eric Ries\nEric Ries criou uma abordagem revolucionaria de administração que esta transformando a maneira pela qual os novos produtos são criados, desenvolvidos e lançados. A Startup Enxuta ensina empreendedores, administradores e lideres empresariais a seremmais bem-sucedidos na condução de seus negócios sem, contudo, desperdiçar tempo e recursos. Na esteira da turbulência da economia mundial, a inovação é essencial para estimular o crescimento econômico, e o processo criado em \"A Startup Enxuta\" foi desenvolvida para que se possa evitar dinâmicas de atualidade. Eric descreve o plano para que cada um possa executar os princípios fundamentais da startup enxuta em qualquer projeto.\n- https://mega.nz/#!BZcBBK5C!_rnS6DeA26HFYGpsO095CD9GfGqgzN1w51PpINLZtXs",
				"added": 1547077848
			},
			{
				"comment_id": 11,
				"body": "#Introdução à Economia para concursos públicos!\n\nEconomia é a ciência que analisa a produção, distribuição e consumo de bens e serviços. Além disso, estuda também a atividade econômica, que é a aplicação da teoria na gestão prática. Geralmente, a Economia é dividida em duas áreas de estudo: a microeconomia e a macroeconomia.\n\n\n- https://www.primecursos.com.br/introducao-a-economia/",
				"added": 1547079399
			},
			{
				"comment_id": 13,
				"body": "#Como ele foi da Favela a Forbes? | com Edu Lyra\n\nO Edu Lyra é um ser humano incrível. Nasceu em situação de muita pobreza, viveu em um barraco com terra batida, chegando a visitar o pai na prisão e ter um primo morto por traficantes. Contrariando as estatísticas, fundou o Gerando Falcões que busca transformar as comunidades e favelas do Brasil e foi eleito pelo Fórum Econômico Mundial um dos 15 brasileiros que podem mudar o mundo. Além disso, foi \"Forbes 30 abaixo de 30\" mais influentes do Brasil, Jovem Empreendedor do ano pelo LIDE, Paulistano nota 10 pela VEJA, carregou a tocha olímpica, foi eleito Jovem brasileiro de 2015 e autor dos Livros Jovens Falcões e Da Favela para o Mundo.\n\nO Edu Lyra compartilhou inúmeros aprendizados sobre sua inspiradora história, resiliência, empreendedorismo, comunicação, liderança, protagonismo, propósito e gratidão.\n\n- Parte 1: https://youtu.be/g0kwX8l-J4I\n- Parte 2: https://youtu.be/2UN6sGo2Bp0",
				"added": 1547080657
			},
			{
				"comment_id": 22,
				"body": "#CPMG3 - Entrepreunership & Startups\n- https://www.youtube.com/playlist?list=PLDGCwzz2K44IDH_KTeAGyUrpP5EU67rPw",
				"added": 1547089718
			},
			{
				"comment_id": 23,
				"body": "#CPMG3 - Entrepreunership & Startups\n- https://www.youtube.com/playlist?list=PLDGCwzz2K44IDH_KTeAGyUrpP5EU67rPw",
				"added": 1547089845
			},
			{
				"comment_id": 28,
				"body": "#O que as grandes empresas procuram em startups de sucesso?\n\n\n#1. Resultados\nSe uma empresa dá bons frutos, pode ter certeza que isso enche os olhos dos investidores. Mesmo que pequenos, resultados positivos representam um bom indício de que o negócio tem potencial. Afinal, o investidor quer que a startup dê algum tipo de retorno, seja através da valorização ou de lucros revertidos em dividendos.\n\n#2. Equipe\nPor trás de grandes ideias, há mentes igualmente grandiosas. É por isso que as grandes empresas olham para as pessoas que estão por trás das startups. São elas as responsáveis por gerar inovação e colocar em prática o que foi concebido. De nada adianta ter a melhor ideia do mundo, mas não ser capaz de executá-la. Para isso, é preciso contar com uma boa equipe.\n\n#3. Mercado\nSe você decidir vender areia no deserto, pode ter certeza que vai ser um pouco mais difícil encontrar investidores. É por isso que é importante que a sua startup e a sua ideia venham atender a uma demanda existente e significativa do mercado. Pode até ser que essa necessidade não esteja tão visível assim para todos, mas ela ainda precisa existir.\n\nAfinal, quem imaginaria que estaríamos dormindo na casa de estranhos e pegando carona com gente que nunca vimos na vida? Pois é, ninguém acreditaria que Airbnb e Uber dariam tão certo, mas havia mercado para esses players.\n\n#4. Flexibilidade\nUma das palavras-chaves dentro do universo de startups é “pivotar”. Essa é a capacidade de uma empresa mudar o plano de negócios depois de perceber que uma estratégia não deu os resultados esperados. É normal uma startup precisar pivotar algumas vezes antes de encontrar o seu lugar ao sol. É por isso que é preciso ter flexibilidade para, se preciso, abandonar aquela ideia que você tinha certeza absoluta que ia dar certo.\n\n#5. Inovação\nEsse é o combustível das startups. Para se manterem vivas dentro do mercado, as empresas precisam estar constantemente inovando. Na verdade, esse é o motivo que fez grandes empresas simplesmente serem passadas para trás por pequenas e inovadoras startups. O negócio que para no tempo inevitavelmente será passado para trás.\n\n- Fonte: TecMundo",
				"added": 1547105754
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 8,
				"body": "1 E aconteceu naqueles dias que saiu um decreto da parte de César Augusto, para que todo o mundo se alistasse\n\n2 (Este primeiro alistamento foi feito sendo Quirino presidente da Síria).\n\n3 E todos iam alistar-se, cada um à sua própria cidade.\n\n4 E subiu também José da Galiléia, da cidade de Nazaré, à Judéia, à cidade de Davi, chamada Belém (porque era da casa e família de Davi),\n\n5 A fim de alistar-se com Maria, sua esposa, que estava grávida.\n\n6 E aconteceu que, estando eles ali, se cumpriram os dias em que ela havia de dar à luz.\n\n7 E deu à luz a seu filho primogênito, e envolveu-o em panos, e deitou-o numa manjedoura, porque não havia lugar para eles na estalagem.\n\n8 Ora, havia naquela mesma comarca pastores que estavam no campo, e guardavam, durante as vigílias da noite, o seu rebanho.\n\n9 E eis que o anjo do Senhor veio sobre eles, e a glória do Senhor os cercou de resplendor, e tiveram grande temor.\n\n10 E o anjo lhes disse: Não temais, porque eis aqui vos trago novas de grande alegria, que será para todo o povo:\n\n11 Pois, na cidade de Davi, vos nasceu hoje o Salvador, que é Cristo, o Senhor.\n\n12 E isto vos será por sinal: Achareis o menino envolto em panos, e deitado numa manjedoura.\n\n13 E, no mesmo instante, apareceu com o anjo uma multidão dos exércitos celestiais, louvando a Deus, e dizendo:\n\n14 Glória a Deus nas alturas, Paz na terra, boa vontade para com os homens.\n\n15 E aconteceu que, ausentando-se deles os anjos para o céu, disseram os pastores uns aos outros: Vamos, pois, até Belém, e vejamos isso que aconteceu, e que o Senhor nos fez saber.\n\n16 E foram apressadamente, e acharam Maria, e José, e o menino deitado na manjedoura.\n\n17 E, vendo-o, divulgaram a palavra que acerca do menino lhes fora dita;\n\n18 E todos os que a ouviram se maravilharam do que os pastores lhes diziam.\n\n19 Mas Maria guardava todas estas coisas, conferindo-as em seu coração.\n\n20 E voltaram os pastores, glorificando e louvando a Deus por tudo o que tinham ouvido e visto, como lhes havia sido dito.\n\n21 E, quando os oito dias foram cumpridos, para circuncidar o menino, foi-lhe dado o nome de Jesus, que pelo anjo lhe fora posto antes de ser concebido.\n\n22 E, cumprindo-se os dias da purificação dela, segundo a lei de Moisés, o levaram a Jerusalém, para o apresentarem ao Senhor\n\n23 (Segundo o que está escrito na lei do Senhor: Todo o macho primogênito será consagrado ao Senhor);\n\n24 E para darem a oferta segundo o disposto na lei do Senhor: Um par de rolas ou dois pombinhos.\n\n25 Havia em Jerusalém um homem cujo nome era Simeão; e este homem era justo e temente a Deus, esperando a consolação de Israel; e o Espírito Santo estava sobre ele.\n\n26 E fora-lhe revelado, pelo Espírito Santo, que ele não morreria antes de ter visto o Cristo do Senhor.\n\n27 E pelo Espírito foi ao templo e, quando os pais trouxeram o menino Jesus, para com ele procederem segundo o uso da lei,\n\n28 Ele, então, o tomou em seus braços, e louvou a Deus, e disse:\n\n29 Agora, Senhor, despedes em paz o teu servo, Segundo a tua palavra;\n\n30 Pois já os meus olhos viram a tua salvação,\n\n31 A qual tu preparaste perante a face de todos os povos;\n\n32 Luz para iluminar as nações, E para glória de teu povo Israel.\n\n33 E José, e sua mãe, se maravilharam das coisas que dele se diziam.\n\n34 E Simeão os abençoou, e disse a Maria, sua mãe: Eis que este é posto para queda e elevação de muitos em Israel, e para sinal que é contraditado\n\n35 (E uma espada traspassará também a tua própria alma); para que se manifestem os pensamentos de muitos corações.\n\n36 E estava ali a profetisa Ana, filha de Fanuel, da tribo de Aser. Esta era já avançada em idade, e tinha vivido com o marido sete anos, desde a sua virgindade;\n\n37 E era viúva, de quase oitenta e quatro anos, e não se afastava do templo, servindo a Deus em jejuns e orações, de noite e de dia.\n\n38 E sobrevindo na mesma hora, ela dava graças a Deus, e falava dele a todos os que esperavam a redenção em Jerusalém.\n\n39 E, quando acabaram de cumprir tudo segundo a lei do Senhor, voltaram à Galiléia, para a sua cidade de Nazaré.\n\n40 E o menino crescia, e se fortalecia em espírito, cheio de sabedoria; e a graça de Deus estava sobre ele.\n\n41 Ora, todos os anos iam seus pais a Jerusalém à festa da páscoa;\n\n42 E, tendo ele já doze anos, subiram a Jerusalém, segundo o costume do dia da festa.\n\n43 E, regressando eles, terminados aqueles dias, ficou o menino Jesus em Jerusalém, e não o soube José, nem sua mãe.\n\n44 Pensando, porém, eles que viria de companhia pelo caminho, andaram caminho de um dia, e procuravam-no entre os parentes e conhecidos;\n\n45 E, como o não encontrassem, voltaram a Jerusalém em busca dele.\n\n46 E aconteceu que, passados três dias, o acharam no templo, assentado no meio dos doutores, ouvindo-os, e interrogando-os.\n\n47 E todos os que o ouviam admiravam a sua inteligência e respostas.\n\n48 E quando o viram, maravilharam-se, e disse-lhe sua mãe: Filho, por que fizeste assim para conosco? Eis que teu pai e eu ansiosos te procurávamos.\n\n49 E ele lhes disse: Por que é que me procuráveis? Não sabeis que me convém tratar dos negócios de meu Pai?\n\n50 E eles não compreenderam as palavras que lhes dizia.\n\n51 E desceu com eles, e foi para Nazaré, e era-lhes sujeito. E sua mãe guardava no seu coração todas estas coisas.\n\n52 E crescia Jesus em sabedoria, e em estatura, e em graça para com Deus e os homens.\n\n- Lucas 2",
				"added": 1547078592
			},
			{
				"comment_id": 9,
				"body": "Senhor, quem habitará no teu santuário? Quem poderá morar no teu santo monte?\nAquele que é íntegro em sua conduta e pratica o que é justo, que de coração fala a verdade\ne não usa a língua para difamar, que nenhum mal faz ao seu semelhante e não lança calúnia contra o seu próximo,\nque rejeita quem merece desprezo, mas honra os que temem ao Senhor, que mantém a sua palavra, mesmo quando sai prejudicado,\nque não empresta o seu dinheiro visando lucro nem aceita suborno contra o inocente. Quem assim procede nunca será abalado!\n\n- Salmos 15:1-5",
				"added": 1547078783
			},
			{
				"comment_id": 10,
				"body": "Quando a festa estava na metade, Jesus subiu ao templo e começou a ensinar.\nOs judeus ficaram admirados e perguntaram: \"Como foi que este homem adquiriu tanta instrução, sem ter estudado? \"\nJesus respondeu: \"O meu ensino não é de mim mesmo. Vem daquele que me enviou.\nSe alguém decidir fazer a vontade de Deus, descobrirá se o meu ensino vem de Deus ou se falo por mim mesmo.\nAquele que fala por si mesmo busca a sua própria glória, mas aquele que busca a glória de quem o enviou, este é verdadeiro; não há nada de falso a seu respeito.\nMoisés não lhes deu a lei? No entanto, nenhum de vocês lhe obedece. Por que vocês procuram matar-me? \"\n\"Você está endemoninhado\", respondeu a multidão. \"Quem está procurando matá-lo? \"\nJesus lhes disse: \"Fiz um milagre, e vocês todos estão admirados.\nNo entanto, porque Moisés lhes deu a circuncisão ( embora, na verdade, ela não tenha vindo de Moisés, mas dos patriarcas ), vocês circuncidam no sábado.\nOra, se um menino pode ser circuncidado no sábado para que a lei de Moisés não seja quebrada, por que vocês ficam cheias de ira contra mim por ter curado completamente um homem no sábado?\nNão julguem apenas pela aparência, mas façam julgamentos justos\".\n\n- João 7:14-24",
				"added": 1547079079
			}
		],
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": [
			{
				"comment_id": 12,
				"body": "#Guerreiro com perna tremida é derrota garantida.",
				"added": 1547079741
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 14,
				"body": "#Você fica cego 4 horas por dia. O cérebro cria imagens para preencher tudo isso – inclusive do que ainda não aconteceu.\n\n- Se os seus olhos fossem uma câmera, ela teria 341,5 megapixels de resolução. Foi o que estimou um estudo da Universidade de Washington. Os cientistas contaram o número médio de células fotorreceptoras do olho humano e, a partir daí, chegaram à conclusão de que conseguimos distinguir 154 unidades mínimas (equivalentes a pixels) em cada “grau” de nosso campo de visão. Se considerarmos que a gente enxerga 120 graus tanto na horizontal quanto na vertical, multiplique 154 por 120 graus nas duas direções e chegará ao número de 341,5 megapixels.\n\n- Acontece que o olho humano só consegue registrar imagens com nitidez numa área bem pequena: a fóvea, que tem 1 milímetro de diâmetro e fica bem no meio da retina. Ela é um buraquinho cheio de cones, células que captam a luz e a transformam em impulsos elétricos que podem ser decodificados pelo cérebro. Você só está lendo este texto porque a luz refletida pelas páginas (ou gerada pela tela) está batendo nas fóveas dos seus olhos. Mas a fóvea tem resolução estimada de apenas 7 megapixels – uma mixaria, que não dá nem para tirar boas fotos no celular, quanto mais gerar a imagem envolvente e hiperdetalhada que nossos olhos produzem. Qual o segredo, então? Como a visão humana produz uma imagem panorâmica de 341,5 megapixels, se nossos olhos geram apenas 7 megapixels com nitidez? Simples: o cérebro nos engana.\n\n- Você não percebe, mas os seus olhos estão sempre em movimento. Assim, a fóvea consegue captar vários pedaços do cenário, que o cérebro costura numa imagem só. Mas esse processo (cada pulo do olho, captação da luz e decodificação do sinal no cérebro) toma tempo, cerca de 0,2 segundo. Durante essa movimentação, enquanto o olho se move para focar em um novo ponto de captação para a fóvea, o cérebro deixa de receber informação do ambiente por 0,1 segundo. Parece pouco. Só que os seus olhos fazem 150 mil desses pulos por dia. Somando todos, você fica cego quatro horas por dia.\n\n\n- Você não percebe isso porque o cérebro se tornou expert em preencher esse vazio com projeções que dão a sensação de imagem contínua, como um filme. Na prática, os seus neurônios recriam o que ocorre a cada 0,1 segundo de cegueira, baseado em aproximações que refletem a nossa experiência. A trajetória de uma bola, por exemplo, já está previamente mapeada pelo cérebro de um jogador de futebol. É por isso que ele consegue dominar um passe muito rápido, que acontece em frações de segundo – durante os quais seus olhos não produziram informações visuais.\n\n- Mas não basta inventar quatro horas de imagens. O cérebro também precisa antecipar o futuro em cada uma delas. Se ele produzisse apenas um instantâneo referente ao 0,1 segundo no qual ficou cego, ele estaria sempre pelo menos 0,1 segundo atrasado em relação ao que está acontecendo no mundo real. Para que a imagem seja fluida, o cérebro precisa criar uma projeção de 0,1 segundo do futuro. Assim, as imagens reais e as criadas viram um movimento perfeito. No exemplo da bola, o cérebro não cria a imagem da bola durante o 0,1 segundo de cegueira ocorrido durante o passe. Ele faz uma previsão de onde a bola estará frações de segundo depois. Chega a parecer mágico, mas é evolução pura: se os nossos ancestrais do mundo animal não tivessem desenvolvido essa capacidade de prever o futuro, teríamos sido todos comidos por predadores.",
				"added": 1547081360
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 15,
				"body": "#NA NATUREZA SELVAGEM\nInício da década de 90. Christopher McCandless (Emile Hirsch) é um jovem recém-formado, que decide viajar sem rumo pelos Estados Unidos em busca da liberdade. Durante sua jornada pela Dakota do Sul, Arizona e Califórnia ele conhece pessoas que mudam sua vida, assim como sua presença também modifica as delas. Até que, após dois anos na estrada, Christopher decide fazer a maior das viagens e partir rumo ao Alasca.\n\n- https://ok.ru/video/31043750526",
				"added": 1547083148
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 16,
				"body": "#Sousei No Aquarion\n\nEm um futuro distante, a humanidade mais uma vez enfrenta a ameaça da \"sombra Anjos\". Criaturas místicas que retornaram depois de 12,000 anos de ausência. Atacam cidades humanas e seqüestrar seus habitantes, a fim de drenar sua \"prana\" (energia vital). Para lutar contra eles, jovens com poderes especiais de espalhados pelo mundo foram reunidos e treinados para pilotar os \"máquinas de vetor\", três navios antigos que juntos formam grande arma da humanidade, \"Aquarion\". A história gira principalmente espalhados Apollo, um adolescente rumores como a reencarnação de Apolônio, um anjo caído que lutou contra sua própria espécie para proteger a humanidade. Poucos acreditam que poderia ser verdade, mas o fato é que dispite sua natureza selvagem e irresponsável, ele provou ser um bem de valor inestimável na luta contra a sombra Anjos.\n- https://www.superanimes.site/anime/sousei-no-aquarion",
				"added": 1547083745
			},
			{
				"comment_id": 24,
				"body": "#Eureka Seven: AO\nAo Fukai é um garoto de 13 anos que vive no Japão, na prefeitura de Okinawa, na ilha de Iwadojima, com o Dr. Toshio Fukai, desde que sua mãe desapareceu, 10 anos atrás. Quando uma misteriosa ornigazação ataca o Scub Coral local, Ao acaba envolvido na batalha e consegue ativar um misterioso robô chamado Nirvash, enquanto estava sendo transportado pelas Forças de Defesa, apesar de ninguém ter conseguido ativar o Nirvash antes.\n\n- https://www.superanimes.site/anime/eureka-seven-ao",
				"added": 1547098074
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 17,
				"body": "#Sirius (acelerador de partículas)\nConheça o Sirius, um acelerador de partículas que está sendo construído em Campinas, SP e que deve ser um dos melhores do mundo quando for inaugurado. A palestra mostrará alguns dos desafios em eletrônica, computação, mecânica e outras tecnologias desenvolvidas no Brasil para construir um equipamento de primeira grandeza, que permitirá avanços em áreas como ciência dos materiais, nanotecnologia, biotecnologia, física, ciências ambientais e muitas outras.Sirius será uma sofisticada infraestrutura de pesquisa, aberta e multidisciplinar. Seu acelerador de elétrons tem como função produzir luz síncrotron, um tipo especial de luz que permite a compreensão das propriedades dos materiais ao revelar sua estrutura molecular, atômica e eletrônica. Trata-se de uma ferramenta extremamente versátil, que poderá abrir novos horizontes científicos, tanto para fins acadêmicos quanto industriais.Essa é a razão pela qual a tecnologia da luz síncrotron se torna cada vez mais popular ao redor do mundo. É também o motivo pelo qual os países com economias fortes e baseadas em tecnologia já contam com um ou mais aceleradores do tipo síncrotron, ou os estão construindo.\n\n- https://youtu.be/-yyWZIRh2us",
				"added": 1547089291
			},
			{
				"comment_id": 25,
				"body": "#Explicação qualitativa do \"anel de Thomson\": como ocorre a \"levitação magnética\"?\n\"A \"levitação magnética\" de um anel condutor (\"anel de Thomson\" ou \"anel saltante\") é uma demonstração bem conhecida; mais fácil de realizar do que de explicar. No presente trabalho propomos uma explicação qualitativa com o objetivo de esclarecer alguns aspectos obscuros das explanações comumente encontradas na literatura.\"\n\n- https://sci-hub.tw/10.1590/S1806-11172003000100010",
				"added": 1547100429
			},
			{
				"comment_id": 26,
				"body": "#Antigravidade\nAntigravidade é uma maneira hipotética de se contrabalançar ou modificar os efeitos da gravidade, tipicamente no contexto de propulsão espacial. Tais sistemas ainda estão confinados à área de ficção científica, tendo em vista o conhecimento atual sobre a gravitação.\n\n-  https://sci-hub.tw/10.1016/0370-2693(79)90463-5\n- https://sci-hub.tw/10.1088/0305-4470/16/3/015\n- https://sci-hub.tw/10.1016/0550-3213(92)90626-M",
				"added": 1547100710
			},
			{
				"comment_id": 27,
				"body": "#Blindagem gravitacional\nO termo blindagem gravitacional refere-se a um processo hipotético de proteger um objeto da influência de um campo gravitacional.\n- https://sci-hub.tw/10.1016/0921-4534(92)90055-H",
				"added": 1547101147
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 29,
				"body": "#Elixir (linguagem de programação)\nO Elixir é uma linguagem dinâmica e funcional projetada para criar aplicativos escalonáveis e de fácil manutenção.\n\n- https://elixir-lang.org/",
				"added": 1547106725
			}
		],
		"1_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": [
			{
				"comment_id": 30,
				"body": "#Aula de Interpretação dos Sonhos - 2h - Psicanalista e Psicóloga Cássia Rodrigues\n- https://youtu.be/TNuRmO026PI",
				"added": 1547107257
			}
		]
	},
	"comment_vote": {}
}