{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1589664235_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 1,
				"body": "Yeah...and Klingon is a real language.",
				"added": 1583862426
			}
		],
		"1584209078_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 2,
				"body": "Eat, poop, stare at computer screen, drool, eat, sleep, repeat.",
				"added": 1584239104
			}
		],
		"1584324810_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 3,
				"body": "Global warming",
				"added": 1584385682
			}
		],
		"1584256859_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 4,
				"body": "Communist China they probably shot everyone who didn't recover, burnt their bodies, but unknown to the Chinese the Corona Virus is immune to fire, the resulting ash cloud mixed with rain, and ash from other parts of dead animals mutated the virus creating the deadly T-virus. Secretly communist controlled Umbrella Insurance Company or....Farmer's Insurance as its known in America, noticed the unique properties of this new creation and injected it into Fal Gaung prisoners for human trial. These prisoners were given cosmetic surgery to appear Western and fake IDs and evacuated with other Americans, but mostly Europeans, in the Great Exodus from Wuhan. Thus infecting Europe and America simultaneously, allowing for testing of the new virus, but more importantly it gave the Chinese military precious time to test new satellite killing  weaponry. As we debate over the virus the Chinese government triumphs over its success, but unknown to the ChiComs the satellites they are killing are actually owned by PornHub to handle the excess demand of millions of people now stuck in quarantine. Thus, the now sexually depraved populace is released from quarantine back into society, to which they set about expanding the population on a huge scale. But, these people unaware of the sexual predator laws of which are extremely strict, all end up like Weinstein and get 23 years in prison. And therefore, we will have a surplus of cheap prison labor. The End.",
				"added": 1584386755
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 5,
				"body": "Corporate finance. First PC was an IBM 80806, an H&P with 1x CD drive 14.4 kbs modem 386 Intel inside!, CompUServ, AOL, instant messaging, MUDs, internet porn when you had to be 18 to buy x-rated magazines at a bookstore, then IRC, egg drop bots, script kiddie hell, warcraft, Warez. Had a full HD of just warez. Anarchist cookbook, phone phreak boxes, learned about the hacker Captain Krunch, and Steve Jobs making his start with a Red Box, hooking a portable generator into a phone line blowing an area code,  checked out a few books on Unix environments, watched the transformation of the internet and the tech bubble explode in the 90s and 00s and decided that was a dead end. The world is built on trading currency. Then the recession 08' and new laws and regs. Mass firings, automation, and fuck me.",
				"added": 1584589169
			}
		],
		"1585150775_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 6,
				"body": "Heard of swatting? Now just call the police and tell them your neighbor coughed on you.",
				"added": 1585168811
			}
		],
		"1585126326_1HaT5L4XJXR57nzthKTuYUZ1jprSRgK9eU": [
			{
				"comment_id": 7,
				"body": "Japan? Try the bookstores in akihabara they usually have underage manga. That's as close as you're going to get mate. Unless you're friends with someone who knows a Yakuza. Thailand might be your best bet.",
				"added": 1585168961
			}
		],
		"1585314197_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 8,
				"body": "Women have an appetite for porn. Everyone chuckles at dick pics, but women also send nudes.",
				"added": 1585337660
			}
		],
		"1585226591_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 9,
				"body": "The mark of the beast referred to emperor Nero who reigned during the time of Christ.",
				"added": 1585337870
			}
		],
		"1589664235_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_2176_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Please leave ZeroNet. You do not represent us.\n\nSpeak for yourself.",
				"added": 1589833758
			}
		],
		"1591167020_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 11,
				"body": "First get someone to help you, preferably a close friend or family member. Buy a large caliber handgun. Have them hold the gun at the base of your skull. This execution style method is probably painless,  efficient, and effective (we don't want you surviving this and being handicapped for life now do we?) Make sure the safety is off. Next, signal them you are ready to die. Watch suicide tape of Budd Dwyer if you need a visual guide. Happy trails!",
				"added": 1591223174
			}
		]
	},
	"comment_vote": {}
}