{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1565207629_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 1,
				"body": "Let them do this. This doesn't isolate us from society itself, only from them. If there is a bunch of people that were excluded from the established mainstream, then there is bunch of people that could meet each other and create their own version of what they were banned from. \nDon't want to talk/be friends with me? I bet that there is someone else that have been reject by you and I'll be friends to them. Rather simple.",
				"added": 1565208485
			}
		],
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_886_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The US dollar is backed by oil AKA the petro dollar. Apparently it's bloodthirsty, demanding regime change wars and coups, in relation to its consumption, so then we have enough oil.\n\nHow come its backed by oil? If the oil price relative to the US Dollar changes, then it isn't, period.\nThe US Dollar is a fiduciary currency and isn't backed by anything, it merely has a price because the US imposes it as the only possible and official currency in the US and that creates a demand for it, which then is met by the FED's supply of money, creating a price. The price is then used to estimate intrinsic value of goods and services based on their demands and supply also.\n\nThe problem is that the US economy was hugely inflated by debt from the start of the 20th century, and this bubble is about to pop. Just look at the basic interest rate, it was reduced to a quasi-zero for more than 4 years, and now its slowly rising, ready to increase the amount of cash banks send to sit at the FED's banks, reducing the amount of total cash available for loans (which keep the bubble from popping) and thus increasing the loans interest rate (bank prime rate is the name, I think). What happens then? Well, the price of things that was inflated by the people's distorted perception of intrinsic value of goods, which itself was caused by the ease of credit, is about to shrink, which is going to cause the bubble to burst - they call this a business cycle, which is merely a pretty name for the Jews fucking with the US economy through the FED and their bank cartel to profit from planned volatility - but this time (or the next one at the most) is a big one, its going to be like the 1930's, maybe worse. \n\nThere is no more room for basic interest rates cut anymore, they can do it one more time maybe, but then the interest rate would have to become negative, which doesn't make too much sense. Why would banks keep their bulk of cash at the FED's banks if they have to pay for it? They'd rather lend it and make a profit instead. The only thing that prevents that is the Reserve Requirement Rate which is dictated by the FED, I think. From the moment banks realize that they should keep the bare minimum of their cash reserves in there, then that's what they are going to do. The effects of this are the total collapse of the effectiveness of monetary policy. Banks will begin to lend more and more to make up for the loss of the recession/depression, that will cause inflation to rise absurdly and economic performance to remain stable or to keep decreasing slightly, unemployment will rise and remain high. If you are older than 40, you might remember that this has already happened (though from a difference cause), it's called stagflation. And there will be no bailout this time, there will be nothing the US government or the FED could do to change this.\nThe solutions for such scenarios are debatable, I could discuss this for hours and hours, talk about quantitative easing and other things that could keep the big bubble from popping and delay carnage for a little longer, but what every sane economist and can see the big picture has to agree on, is that the bubble will pop. But also, the size of this bubble is also debatable.\n\nAs for you, my friend, escape from the US Dollar trap. Buy gold, silver, Bitcoin, Monero, Etherum, land that you can farm on, anything with intrinsic value, real value.\nThere also might be war, of course. The US government and other external military powers will seek any excuse they need to kill and plunder for the remaining scarce resources that there are. Internet might suffer great hits to its infrastructure and electricity might not even be available. So keep the majority of your wealth in precious metals and bury it deeply underground, I'd say 70% or so in metals (specially metals that haven't been known to be present in surrounding celestial bodies), buy land so you can also have something to eat, and keep the remaining in cryptocurrencies (specially Bitcoin and Monero). Don't buy shitcoins, they have shit in their name for a reason.\n\nSorry for any grammar misspellings or some wrong shit. My eyes hurt and I haven't slept for 28 hours.",
				"added": 1565209849
			}
		]
	},
	"comment_vote": {
		"1_1C4jj78y5jMo2kTtUFKaLMwdkEnpffC76E": 1,
		"2_1C4jj78y5jMo2kTtUFKaLMwdkEnpffC76E": 1
	}
}