{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1584452427_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 1,
				"body": "Но ведь Elm не нужен, лучше Haskell/Reflex или хотя бы PureScript, иначе честное слово на JS приятнее писать",
				"added": 1586436078
			},
			{
				"comment_id": 2,
				"body": "> [cra](#comment_78_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Тут вопрос не в том, что лучше или хуже. Человеку просто очень нравится Elm и он решил заняться вот таким делом. Это его решение и каким бы странным оно не казалось для нас это всё равно интересно. Почему бы и нет. Хорошо, что что-то происходит и что-то делается.\n\nЧеловек свободен заниматься, чем хочет. Другой человек свободен комментировать действия первого.",
				"added": 1586449376
			},
			{
				"comment_id": 3,
				"body": "> [gomzik](#comment_138_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Но вот как по мне - спорное заявление что JS >> Elm\n\nДело вот в чём: у Elm достаточно ограниченная, скучная архитектура, которая принуждает продевать стейт и ивенты через один топ-левельный узел, что грустно. В честном FRP такие узлы можно делать на любых уровнях и, соответственно, делать полностью самостоятельные виджеты со своими собственными ивентами и стейтом. Кроме того, явно манипулировать потоками событий интереснее, т. к. можно их всячески трансформировать, дебаунсить, сочетать по-разному, синхронизировать и упорядочивать, что сложно, если они не явные. В JS можно взять реактивную либу, типа ReactiveX в сочетании с React, и всё это получить, а в Elm только страдать. См. также Cycle.JS\n\n> [gomzik](#comment_139_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Раз уж вы тут мимокрокодил, может подкинете литературки по функциональщине, мне б лучше на русском, а то инглишь не достаточно хорош, что бы усваивать такое\n\nНа русском есть книжки \"Изучай Haskell во имя добра\" Миран Липовача (стоит подсматривать в оригинал, в переводе опечатки) и \"Программируй на Haskell\" Уилла Курта. Но вообще, конечно, без инглиша никак не обойтись, туториалы и документацию как-то не переводят.\n\n\nВообще, не смотрел ещё, как именно работает ZeroNet, может и не получится сюда водрузить это всё добро без слишком жёсткого допиливания",
				"added": 1586453887
			}
		]
	},
	"comment_vote": {
		"35_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY": 1
	}
}