{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Raspberry et Zeromail",
			"body": "Sur un Raspberry Pi 2, en voulant créer un ID pour Zeromail, j'avais une fenêtre \"problem loading\" avec le message d'erreur \"Remote XUL \" sur la page... J'avais ça sur Firefox, sur Midori et je n'ai trouvé qu'une solution au final... Installer chromium sur le Rpi2. Et là, sans extension, tout fonctionne !! D'où mon message ici ;)  J'aurais quand même bien aimé savoir à quoi était dûe cette anomalie. \nSur ce, bonne continuation!",
			"added": 1473754550
		},
		{
			"topic_id": 2,
			"title": "Zerosite raspberry!",
			"body": "http://127.0.0.1:43110/1E7cBjoPgdgcDjSDUGZLDUUMHFBLozQGos\n\nJe vais participer à l'emancipation de ce forum je pense ^^",
			"added": 1489613747
		},
		{
			"topic_id": 3,
			"title": "Chelsea Manning est sortie de prison",
			"body": "7 ans après son incarcération, elle est enfin libre\nhttp://www.foxnews.com/us/2017/05/17/chelsea-manning-freed-from-kansas-military-prison.html",
			"added": 1495038870
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"3_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 1,
				"body": "Si on parle de la même chose: http://127.0.0.1:43110/1DL6a4wyGtgmZFyUro6ARMqZPiUjUdMPV7\n",
				"added": 1473754079
			}
		],
		"1_1JonCWijFbp7FP2HKYDUic3CoWkBcVwmc8": [
			{
				"comment_id": 2,
				"body": "Le pseudo vient de la première connerie à laquelle j'ai pensé quand j'ai crée l'adresse ^^ ",
				"added": 1473769362
			}
		],
		"2_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 3,
				"body": "J'adore ce site parce que même si tu ne sais pas lire le russe, tu comprends très bien comment il faut faire ^^ \nPour Rutracker, tu trouves de tout mais il faut pouvoir décrypter le langage ...",
				"added": 1475084668
			},
			{
				"comment_id": 5,
				"body": "oui ce sont des torrents sur rutracker. Sinon c'est vrai, on peut récup de la musique de Youtube... ;)  Les commandes de Google type   index of:mp3   ca marche bien ^^",
				"added": 1475188962
			}
		],
		"19_1D4B7XbRYY5p9kx79NtKr3qiShR5Tcpnvo": [
			{
				"comment_id": 4,
				"body": "La photo met du temps à s'afficher sur un Raspberry Pi 2 lol",
				"added": 1475085028
			}
		],
		"4_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 6,
				"body": "Ce sont de supers idées, j'encourage les gens les connaisseurs à travailler dessus mais en ce qui me concerne, je ne suis malheureusement d'aucune utilité à ce niveau...",
				"added": 1475413984
			}
		],
		"7_1G4nMD7txaYAvdpDeroZ9f67K3gtHsGn8H": [
			{
				"comment_id": 7,
				"body": "Très bon point de vue! ;) ",
				"added": 1476959179
			}
		],
		"5_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 8,
				"body": "j'ai juste une question. As-tu trouvé un passionné de cette culture sur ZeroNet ? ;)  bonnne continuation!",
				"added": 1478898303
			}
		],
		"1_1HtSusD5x8ncWAmCrZnDnySA8t72kdK2FM": [
			{
				"comment_id": 9,
				"body": "Dans le dernier numéro de Pirates mag', ils en parlent. Après, nous sommes nombreux à ne pas aimer Facebook si nous nous retrouvons ici ;) \nL'intêret pour Facebook est bon, puisqu'il a un grand nombre d'utilisateurs, donc il sait qu'il peut gagner encore plus d'argent ;) Pour les citoyens, je pense que c'est totalement inutile...",
				"added": 1565720909
			}
		],
		"9_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 10,
				"body": "Et toi, tu te trompes de 10 euros dans ta déclaration d'impôt, et bah le gouvernement ne te loupe pas ;)\nJe vais me mettre dans les stups ;)",
				"added": 1565721039
			}
		],
		"4_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 11,
				"body": "Salut! J'ai aussi trouvé les liens magnets! Va sur oxtorrent.com (ou attend que je les poste) pour les liens des épisodes 12 et 13. Ceux que j'ai trouvé sont en HDTV! bonne soirée",
				"added": 1578430993
			}
		]
	},
	"comment_vote": {}
}