{
	"posts": [
		{
			"id": "3ce5fbc3-d927-4180-a2a5-c19d96d57a2b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "84d38af4-d77a-4adf-bee3-73f5205c5aad",
			"body": ">>0e69cc82-30d0-4e07-a034-99338bc87c58\nThat's fair, I shouldn't have worded Tolkien's traditional contributions so grandly. And I never wanted to imply that he's done a single thing worth more to the world than Wagner.\n\n>>9de85a62-62ba-49b6-a513-427a263c71ea\nHoly war for muh great x100 grandpappy druids in Ireland",
			"time": 1565066562191,
			"files": "[]"
		},
		{
			"id": "09070f5a-4353-40d6-adfb-4d350d7f9e01",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "84d38af4-d77a-4adf-bee3-73f5205c5aad",
			"body": ">>0a317dc6-052e-4337-a513-b3dfcd198246\nI don't believe in being censored and data-farmed for calling someone a kike nigger. Besides, there's nothing toothless about supporting theoretical ideology. All of this speaks nothing of method of implementation. If I was advocating Ghandi walks and handholding to kumbaya as a means of achieving any Traditionalism, I'd get it. But otherwise stop valuing edge and hatred for the sake of itself, it keeps you mentally ill.",
			"time": 1565071133405,
			"files": "[]"
		},
		{
			"id": "0627123f-5505-4040-8faf-60a3ab955e73",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "84d38af4-d77a-4adf-bee3-73f5205c5aad",
			"body": ">>1ddb8571-e5f2-4337-bf28-5fb61a6463a0\n>They wouldn't censor you.\nI agree, but nobody's supporting monarchist policies just bc it's not fascism.\n>Your views aren't dangerous to anyone\nRight, unlike Marxist progressives.\n>> dat projection\nWho's the one shit talking over \"muh ideology is DANGEROUS TO THE ESTABLISHMENT *tips Guy Fawkes mask*?\"\n>It's you cuckservatives that keep crashing your head against a wall thinking your mindless, colourblind outlook is definitely going to bring the solution this time, each time.\nI'm not sure who You Think I and other Traditionalists agree with in this world, especially Dharmic ones, but there's rarely a political entity or body on Earth that is properly uniform around it's regional values.\n>the toothless conservative version of\n>> I'm a centrist and that makes me an intellectual\nImagine thinking there's anything centrist about valuing spirituality and hierarchy over materialism and equality. Whew. I'm disappointed not to see genuine points in defense of Fascism over Traditionalism.\n>Sanitizing your politics doesn't make you intelligent, it just means you're squeamish.\nThe reason you're coming off like a total nigger is because you refuse to understand contextual analysis of Basic Information in text. I'm not sure how many times the point has to be hammered home directly or indirectly that there is literally no provable intrinsic value behind edge for the sake of itself. That's how children think. And simply ASSUMING that every single person on Earth who believes in these ideas is \"squeamish,\" is to literally deny bell curves of statistical probability, essentially math, and reality by reason itself. Your black & white thinking is further evidence of borderline personality disorder, or schizophrenia, more than it is concrete political ideology. I say this as someone in the same position not 3 years ago.",
			"time": 1565074073440,
			"files": "[{\"name\":\"excalibur.jpg\",\"thumb\":\"d2648204024fd4c43840cfe201d055936d57a36a-thumb.jpg\",\"size\":55493,\"type\":\"image/jpeg\",\"original\":\"559823b39f615344211cb97656d09d037c149e6e.jpg\",\"directory\":\"12jap4bMh6btrTDzYgGpyPe4A3Es3a53fA\"}]"
		},
		{
			"id": "f9c36df0-fc61-470f-9007-d3fb37950788",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "84d38af4-d77a-4adf-bee3-73f5205c5aad",
			"body": ">>417271f2-7db9-4d9d-97d7-5dfd52fb66c5\nYou're defending implementation by force, which I never said I was against, in order to attack conservative ideology, based on literally nothing. To imply that anything remotely traditional in a first world country has been tried since WW1 and the industrial revolution is genuinely retarded. Capitalism is garbage, communism is garbage, socialism mixes are garbage, and fascism in the long run would've been trash if it never transformed.\nYou keep refusing to be specific on what politics and stances that traditionalists have \"softened up\" on, or obfuscated their position on. \n>Locke - uh I mean Evola\n>Traditional Europe is the real liberalism!\nGo to fucking /leftypol/ you god damned pinko.",
			"time": 1565081326017,
			"files": "[{\"name\":\"d3e6f2c49ae0b775405363a3f7aa51167aabe631_hq.jpg\",\"thumb\":\"37a7240a830c19e318a2c27bba4d84907c747447-thumb.jpg\",\"size\":77045,\"type\":\"image/jpeg\",\"original\":\"a39b467666dc335dddbf5aa8cc3febe367e02072.jpg\",\"directory\":\"12jap4bMh6btrTDzYgGpyPe4A3Es3a53fA\"}]"
		},
		{
			"id": "fbc9283e-4eda-4653-b196-f5274832e6d5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "84d38af4-d77a-4adf-bee3-73f5205c5aad",
			"body": ">>ca411c78-c7c4-49f7-840a-0a8a707a0aaf\nIn real-world application, the main dedication will be essentially protecting colonies and tribes amongst ourselves. Essentially doomsday prepping on the collective level of who's in your family and important culture of life. Think about how old Europe used to be endured by houses and guilds amongst the citizenry. These said houses were the families that could eventually take power in the monarchy, and we need as many wells of power (strong communities holding onto tradition) for future society amongst the ruins as possible.\n\n>>be972716-299f-4944-8909-7b165f6273c7\n>And their only frame of reference for the human condition or human behaviour, were other Europeans.\nEuropeans didn't even act the same as one another back then. Enough of the revisionist notion that all white people are equal in every conceivable way for all of history. That right there discredits the rest of your post, because you're perpetuating to yourself this culmination of assumptions based on VERY stringent data in your head as unshaken fact, and that's simply a lie. You've a very surface-level meta understanding of politics, currently and throughout history, to drive perspective. And I call it surface level because what you don't realize is that this isn't a 95% that's wrong societally vs. 5% that's right deal. It's 99.9%, including all of our bullshit, vs .1% that probably doesn't even participate in politics. What I've always appreciated about /pol/ is the ability to see men of the past as human beings, but what fundamentally makes no sense is blurring lines to yourself on what being a decent human being is Because of it.\n>The only outlook that leads to solutions in the long term, is a 100% ethnic one.\nDaily reminder that National Socialism is a pseudo-centrist attempt at marrying Hierarchy with Materialism, when we all need to realize that the basis of reality (the \"right\") is Hierarchy and Spiritualism, where the left that we stand against is based in Equality AND Materialism. Stop worshipping the future.",
			"time": 1565130115980,
			"files": "[]"
		},
		{
			"id": "02d6a869-2828-4d28-b4e4-fcc0d1cf32aa",
			"directory": "users/1CNUTjRCE5NoxfxNCu8FqRUCCVgydZ3zcW",
			"uri": "monarchy",
			"thread": "8094a369-64b4-461b-9733-069853fa2120",
			"body": "Irish-American nig in favor of Dharmic/Pagan non-sovereign monarchy here",
			"time": 1565174832117,
			"files": "[]"
		},
		{
			"id": "e4d37480-91ad-4a8b-b081-3b7f596cd254",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "84d38af4-d77a-4adf-bee3-73f5205c5aad",
			"body": ">>d8b900c0-dc55-40db-94f5-f9b93ae7f99b\n>distinctly similar\nOkay, but while there are 5-10%~ outliers in other races that exist in these same similar fields as us, due to modern civilization, you still close your eyes while opening them to Cletus. I understand why, and don't endorse Based Black Guy-ism, but out of the spirituality I've found, not circumstantial science.\n>christcuck memes\nThis whole thread I've been referencing Paganism and Sanatana Dharma, so OK nigger.\n>things that exist solely in the realm of the mind\nThe underlying and ever present goal of your religion should be advancement through science, as there shouldn't be anything contradicting your metaphysical beliefs by this. There certainly isn't if you study Ancient Aryan religion and tradition well enough, even through parts of its offshoots in terms of applying these beliefs.\n>Your self-destructive brand of spiritualism is a snake oil. You were conned.\nYay assumptions!\n\n>>1d4751ee-b8f2-4bdb-839c-b9f71b664028\nLike anyone on Earth, you read and accept what aligns with Tradition. CS Lewis definitely has good applications of the Hero's Journey, and the importance of religious motif in storytelling. Christcucks can be good reads if you learn how to look between the lines.",
			"time": 1565175666493,
			"files": "[{\"name\":\"Bangalore_Shiva.jpg\",\"thumb\":\"344090e44511a104f68bb3ecd173f3785197dcba-thumb.jpg\",\"size\":2261002,\"type\":\"image/jpeg\",\"original\":\"9dae5335469961626610532fd23646ca365b3ecd.jpg\",\"directory\":\"12jap4bMh6btrTDzYgGpyPe4A3Es3a53fA\"}]"
		},
		{
			"id": "a8d26a73-30b4-45c8-a61c-80cee9ed8c1b",
			"directory": "users/1CNUTjRCE5NoxfxNCu8FqRUCCVgydZ3zcW",
			"uri": "monarchy",
			"subject": "Creative Ideas on Tradition",
			"body": "Just a few general Q&A prompts to start good conversation around 0th Position (started the /pol/ thread here) ideology.\n>What's the religious consensus around here, or at least your views?\n>What method of power distribution in a monarchy do you believe in? Governmentally and economically.\n>What philosophers/ideologues/etc. inspired you towards monarchism?",
			"time": 1565194263624,
			"files": "[{\"name\":\"king boru.jpg\",\"thumb\":\"4c9533286794c5ea8ad4da9bf1326264dbcdfa5e-thumb.jpg\",\"size\":323585,\"type\":\"image/jpeg\",\"original\":\"ce07f279e63315260bd23cd8b1c861c554973960.jpg\",\"directory\":\"12jap4bMh6btrTDzYgGpyPe4A3Es3a53fA\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}