{
	"next_comment_id": 38,
	"user_name": "Mg0",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1558313092": 1558360277,
		"1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1576440794": 1576449128,
		"1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2_1583275204": 1583360453,
		"1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1584669995": 1584709537,
		"1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2_1588664087": 1588740328,
		"1HjJqWY2ECyyUE1F2sJSuXMRmU39uMNt6s_1598120765": 1598148688,
		"1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1601916571": 1602118846,
		"1G7yH3iZyr6CQY5NG2YcXCKmkbfXz83h1w_1602456398": 1602953240,
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1614516411": 1614616521
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "XD, networking class, lol",
			"post_uri": "17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P_1555100761",
			"date_added": 1555105216
		},
		{
			"comment_id": 2,
			"body": "Whoa, nice corruption there, is that drive using FAT or NTFS as a filesystem?",
			"post_uri": "1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ_1558344522",
			"date_added": 1558360210
		},
		{
			"comment_id": 3,
			"body": "It may be FAT corruption or a change of filename encodings, I think the former is more likely. You'll probably face lots of FAT errors if trying to read that data. Mind to mount in read-only and if that doesn't work then try using photorec/testdisk to recover anything. Only after that you may try dosfsck (FAT equivalent of windows chkdsk in linux).",
			"post_uri": "1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ_1558344522",
			"date_added": 1558366820
		},
		{
			"comment_id": 4,
			"body": "@SomeName666: I don't think that's the case, windows does actually only auto mount the first partition, but it can use both afaik, you'd have to mount it (assign a letter in windows) to the second partition to use it. But there's still corruption :/",
			"post_uri": "1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ_1558344522",
			"date_added": 1558390060
		},
		{
			"comment_id": 5,
			"body": "Nice avatar, welcome to 0net",
			"post_uri": "18xXKerQ1FCXAV4mC2HWtQcfkxp1FWstzT_1",
			"date_added": 1560119581
		},
		{
			"comment_id": 6,
			"body": "Maybe an update to grub messed it up a bit, maybe it was because of a possible unclean shutdown or even an update to something that may trigger a grub.cfg reconstruction.",
			"post_uri": "1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ_1563284802",
			"date_added": 1563318266
		},
		{
			"comment_id": 7,
			"body": "@SSDifnskdjfnsdjk: Hold it!\n\nRex research is working well since a while ago, I checked [this proxy](https://zn.amorgan.xyz/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D) yesterday and it's actually synced with the zite (it's only downloaded about 2.5G out of 6.7G but I tried some links and it downloads on demand so it's working). The zite feels relatively light given its size, just make sure to use content.json files properly. Not too many files for each",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564519911
		},
		{
			"comment_id": 8,
			"body": "@SadLoli: Hmm, I'd say that a thousand files is a good upper limit for starters, but I haven't done much extensive testing yet, I think the approach is to have small (below 2MB maybe?) content.json files, maybe even 10MB content.json files wouldn't be prohibitive given good hardware and network but that's just me wondering.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564589501
		},
		{
			"comment_id": 9,
			"body": "Make sure to check the 'Download and help distribute all files', and press the update button until it starts.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564582941",
			"date_added": 1564595378
		},
		{
			"comment_id": 10,
			"body": "@SadLoli: Glad to hear I was of help.",
			"post_uri": "1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT_1564505863",
			"date_added": 1564694905
		},
		{
			"comment_id": 11,
			"body": "Sounds difficult and dangerous, but quite an improvement would that be. Take care doing that and keep us updated.",
			"post_uri": "1LmygkUjVBWQJPJgHgNuqi9vzx1UBY5huh_1576753111",
			"date_added": 1576757623
		},
		{
			"comment_id": 12,
			"body": "dengue = disease transmitted by mosquitoes\nmosquito = winged motherfucker that sucks blood\nplease tell me how dengue isn't essentially airborne? ",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1583977827",
			"date_added": 1583985177
		},
		{
			"comment_id": 13,
			"body": "I thought no one knew about that game as an alt for age of empires. Sadly, I don't play it and lack time for playing as of now. Hope you find someone else to play soon.",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1584468448",
			"date_added": 1584472055
		},
		{
			"comment_id": 14,
			"body": "+1 for Lua ",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1584669995",
			"date_added": 1584709537
		},
		{
			"comment_id": 15,
			"body": "I just downloaded, it's funny. Skeletons got no lungs, they can't play the trumpet, lol.",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1584716876",
			"date_added": 1584730435
		},
		{
			"comment_id": 16,
			"body": "They work, but not automatically. You must upload a file and then replace the file in zeronet dir with your gif file (and maybe change its sha512sum in the respective content.json). I think @loligod knows better on this.",
			"post_uri": "1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2_1586325231",
			"date_added": 1586360155
		},
		{
			"comment_id": 17,
			"body": "Start [here](http://127.0.0.1:43110/1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8/?Post:51:Using+CJDNS+with+ZeroNet), it's a nice post made by kaffie on how setting up cjdns with zeronet. If you need to set up cjdns first, then you should find a couple tutorials for your operating system on the clearnet.",
			"post_uri": "197MyFFUGPr22VrFMNt8kfNVuFh3Y41iZJ_1586841691",
			"date_added": 1586912225
		},
		{
			"comment_id": 18,
			"body": "Did I miss something, why is the current dev of the 1+gallery an idiot? @blurHY",
			"post_uri": "1PHArszbKFgyrXJybYqtNsdespm1UzaAud_1588668205",
			"date_added": 1588703373
		},
		{
			"comment_id": 19,
			"body": "Got any links to that discussion? I'd like to read on. Btw, if you are reading this @Ansho Rei, then know I'm talking to blurHY about you. That's in case you don't see his/her messages here.",
			"post_uri": "1PHArszbKFgyrXJybYqtNsdespm1UzaAud_1588668205",
			"date_added": 1588781445
		},
		{
			"comment_id": 20,
			"body": "@Ansho Rei: Got it, thanks for the context.",
			"post_uri": "1PHArszbKFgyrXJybYqtNsdespm1UzaAud_1588668205",
			"date_added": 1588783099
		},
		{
			"comment_id": 21,
			"body": "\"Landing page redirect has 3 second delay and show a button to cancel redirect.\"\nThank you",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588812292
		},
		{
			"comment_id": 22,
			"body": "Does anyone know the owner of sadMangaHub? luckily I had a backup somewhere but recently many galleries in that hub started using a single img.zip file for storing images, deleting what I (and many others) had already downloaded in the process. I don't really like the idea of using one .zip file for that, it involves downloading the whole gallery before watching the first page, not fair at all. Maybe I'll just have to clone those galleries for my own usage.\n\nI'd try zipping the files I already have and it would achieve the exact same size, with file layout but the sha512 will always be different out of metadata...",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588890633
		},
		{
			"comment_id": 23,
			"body": "@Ansho Rei: Partially, as I was also expecting keeping my already downloaded galleries, now I have to re-download all that stuff... newest rev (4486) makes it work, though I see that a gallery page doesn't report the amount of pages being hosted nor which ones those are. So maybe there's more work to do for 1+gallery.\n\nI'll see if I can grab the metadata containing chunk of that img.zip file and try to reconstruct it on my own (personal desire mostly). Thanks for the reply.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588898489
		},
		{
			"comment_id": 24,
			"body": "@Ansho Rei: My bandwidth isn't that good and I have a couple of those galleries already downloaded. I don't want to download them all again, also, what's the benefit of having all images in a single file? at best it would reduce the size of content.json files but, if you ever find in the need of changing a single file of a gallery, you'll have to issue a completely new img.zip file. Even so, if the modification time of a file changes then that's enough for changing its sha512 hash.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588943520
		},
		{
			"comment_id": 25,
			"body": "@Ansho Rei: s/mean/main/\nI see, it makes sense in that way. I'd just like if the zip files only contained the file names and their contents, nothing else. That way, I could easily decompress the img.zip files and use the images with a local viewer, and later if anything happens to the original img.zip I could just recreate it, but it storing file timestamps and its compression ratio varying from version to version.... it's impossible to recreate.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588958026
		},
		{
			"comment_id": 26,
			"body": "I don't know man, the issue is that zip stores all that metadata which makes it difficult to replicate. A good start involves `-Z store` so no compression is done over files but  still what to do about modification time, access permissions and alike for the files?",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588960373
		},
		{
			"comment_id": 27,
			"body": "@Ansho Rei: Found this at clearnet.\nhttps://tanzu.vmware.com/content/blog/barriers-to-deterministic-reproducible-zip-files",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588960894
		},
		{
			"comment_id": 28,
			"body": "@Ansho Rei: I'll see if I can come up with a script for dealing with all that.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588960971
		},
		{
			"comment_id": 29,
			"body": "@Ansho Rei: [reproducible zip script - git center](/1fxPUtgPDkH9YJW7kMciQPaE5XnaSu7S4) I think I got it, was able to reproduce the exact same zip with the same files no matter their access modes (permissions) or modified time. I've only tried it on linux and the current version of zip I have but it works. Most of the leverage comes from a program called *stripzip* that clears most metadata from it. At the end I can't remove the access modes but if I ever encounter that as an issue I'd be able to replicate them easily if I have the exact same files.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588981572
		},
		{
			"comment_id": 30,
			"body": "It gets crowded every now and then when massive migrations happen, like 8chan months ago.",
			"post_uri": "1DkZimuxaMKTJiKHgnncVRTPxafWf19mS4_1589633131",
			"date_added": 1589636990
		},
		{
			"comment_id": 31,
			"body": "@Zerofunc: You are welcome, but please use easier kanji the next time.",
			"post_uri": "1DkZimuxaMKTJiKHgnncVRTPxafWf19mS4_1589633131",
			"date_added": 1589660608
		},
		{
			"comment_id": 32,
			"body": "Forgot to mention it now shows the percent downloaded of img.zip file for zipped galleries.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1590186053",
			"date_added": 1590252370
		},
		{
			"comment_id": 33,
			"body": "@Sirlotaplot: If you end using them, then mind that each zip has lots of metadata that difficult re-creating them from the files they contain. I made [reproducible zips (git center)](/1fxPUtgPDkH9YJW7kMciQPaE5XnaSu7S4); an effort for facilitating the creation of zip files which store the least besides its files and its file list. It may help you and I'd appreciate feedback.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1590186053",
			"date_added": 1590285215
		},
		{
			"comment_id": 34,
			"body": "Given the nature of zeronet I'd say you are truly living on the edge here!",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1601916571",
			"date_added": 1602118867
		},
		{
			"comment_id": 35,
			"body": "@Ansho Rei: Sure!, really liked the idea of the project, looking forward to the git center repo but take your time.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1601916571",
			"date_added": 1602557093
		},
		{
			"comment_id": 36,
			"body": "lol",
			"post_uri": "18fyrmZdhfyca84KuzDfkwdgtpT1EEkTXK_1605222754",
			"date_added": 1605295115
		},
		{
			"comment_id": 37,
			"body": "Sadly, from the number and gear of the agents it seems Megalovania would be playing for them, not for the yellow vests...",
			"post_uri": "17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc_1606053622",
			"date_added": 1606256436
		}
	]
}