{
	"next_topic_id": 52,
	"topic": [
		{
			"topic_id": 1587199580,
			"title": "有哪些高质量的网站？",
			"body": "",
			"added": 1587199579,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1587199920,
			"title": "中文互联网的产出在渐渐枯萎吗?",
			"body": "就我个人关注的领域，营销号一遍遍重新创造出的东西中，大部分都来自于几个源头，甚至常常有近十年前就已译至中文的文章被重新编辑排版，再次流行一时。\n\n而随着那几个信息源头的主持着家业压力渐重，产出随之减少，却并没有能相匹及的新人加入，中文互联网有效的信息产出越来越少。\n\n而同样的状况没有出现在英语互联网中。\n\n[丢失的原贴](http://127.0.0.1:43110/14f1Ru4axcieJ51YdCxngtg2ZN2jzEh3jM/?Topic:1587099957_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX)\n\n可能因为同步没完成，我的帖子被清空了",
			"added": 1587200089,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1587207625,
			"title": "ZeroNet 可以支持版本管理功能吗？",
			"body": "可能因为同步没完成，帖子会被清空",
			"added": 1587207621,
			"parent_topic_uri": "1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1587444274,
			"title": "ZeroNet：一个内容永生的世界",
			"body": "http://127.0.0.1:43110/1BETWVpPWwR6qBWsXeasG4WQUMcsdSjphA/?Topic:1523620454_1EabdB8gfz6BxtKZwQvNriJUuiDc5YCfBj\n\n相关问题：[IPFS简介和基本原理](http://127.0.0.1:43110/1BETWVpPWwR6qBWsXeasG4WQUMcsdSjphA/?Topic:1587445219_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX/IPFS)\n\nZeroNet 解决了内容永生的问题\nIPFS 解决了大量数据永久存储的问题",
			"added": 1587445350,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1588683603,
			"title": "中国互联网史就是一部流氓史：你上的已经不是一个真正的互联网了",
			"body": "引言\n英雄枯骨，流氓上位\n \n英雄乱世，诸候相争，杀伐四起，三国鼎立。\n \n从历史的维度来看，互联网也算是千年未有之巨变了。\n \n现在的AI智能、区块链，也都是以internet作为基石，暂时还想象不出什么颠覆性的技术可以取代互联网。\n \n这个时代我们见识过不择手段的大佬，追赶时代的骗子，自得其乐的博主，不求名利的段子手……但看到更多的仍然是流氓，他们最终取得了胜利。\n \n英雄枯骨，流氓上位，可能这才是任何大变革时代的本质。\n \n我们有幸目睹并见证了这段峥嵘岁月，从印刷文明过渡到网络时代。\n \n也许100年后，人类仍然会感慨1993~2017那段开创新历史的“春秋战国”岁月。\n\n也许1000年后，取代人类的机器史官，用0和1感慨“互联网诸子”创造了伟大文明。\n \n但作为这个时代的见证者，从97年接触互联网到现在整整20年，仍然这里执笔写下：中国互联网史就是一部流氓史。\n\n中国互联网史就是一部流氓史：你上的已经不是一个真正的互联网了\n\n\n\n01\n绑架史：\n被插件困挠的20年\n\n作为网民的20年首先是被绑架的20年，随便到网上下载一个软件，无论你是20年的老江湖，还是新上道的小粉红，总会被绑上一堆插件，什么瑞星杀毒，百度影音，小兵天气，金山全家桶……上网没点技术你都不敢随便点开网页。\n\n这里要特别提一下百度……说起来百度作为中国3大互联网公司，楼都盖了好几栋，按理说不差钱不差利，但狗改不了吃屎，总爱走下三路的打法，旗下各个软件企图占领硬盘让人神烦，搞得我每个月都要帮邻居少妇清理一大堆不知道什么时候冒出来的百度软件，好几次险些升级成为“隔壁老王”。\n\n自周鸿祎1998年打开了插件捆绑这个潘多拉魔盒后，很多互联网公司将插件捆绑视为“大杀器”， 最有名的要算2003流行的hao123，推广走的就是这种模式，一个导航页面有什么价值？而hao123最终因为插件捆绑得力，2005年被上市的百度高价将其揽入怀中。而金山、瑞星、鲁大师这些公司，走的都是同一种路线，你总能在各个软件安装里看到他们“妩媚”的身影。\n\n只要是70后老网民，哪一个当年没有被这些病毒和插件折腾得“欲仙欲死”，小白用户关上电脑，然后“饿死病毒”，程序猿除了重装系统，也就只能给熊猫烧3支香了。\n\n这种情况直到2008年360杀毒出现后才有所好转，尽管现在很多人还在说周鸿祎是个老流氓，包括2010年3Q大战时很多人因为这一点站在“做艰难决定”的马化腾一边，一码归一码，就算周是流氓教父，但360作为一款得罪无数同行的免费软件，为广大网民作出无数贡献，应该发个五一劳动勋章。\n\n直至今日，插件捆绑在PC端仍然肆虐，唯一值得安慰的是移动互联网的到来后，手掌间的IOS系统让你貌似离这个梦魇远了很多，但请相信我，插件与你同在。\n中国互联网史就是一部流氓史：你上的已经不是一个真正的互联网了\n\n\n\n\n02\n抄袭史：\n创新是互联网企业的绊脚石\n\n1998年，新浪模仿雅虎。\n\n1998年，QQ模仿MSN。\n2000年，百度模仿谷歌。\n2003年，淘宝模仿易趣。\n2009年，微博模仿Twitter。\n2012年，滴滴模仿Uber。\n……\n \n2015年之前，基本上所有的互联网创新产品，都与中国互联网企业无关。\n \n在移动互联网时代被奉为新大神的美团网CEO王兴是“杰出代表”，他创立的人人网模仿脸书获得人生第一桶金，然后又搞了个饭否模仿twitter，如果不是因为一些特殊原因，2007年的饭否差点又取得成功，也算是模仿中的英雄楷模。\n \n中国互联网从诞生至今，几乎所有模式都直接复制国外模式，不仅善于模仿，而且还很会跟风，一夜之间冒出无数个b2b、p2p、sns网站，没有谁在意这种模式是否有侵权之嫌。\n \n有人说这种跟风能有效阻止外国互联网企业的入侵，这与腐败可以促进经济发展的论调没什么两样，中国互联网企业之所以能够成功，与模仿没有任何关系，只与海量的中国网民直接相关，只与文明之间的隔阂有关。\n \n2015年共享单车模式的出现，开创了中国互联网企业真正创建新产品的时代，不管结局如何，值得大家尊重。\n 然而，抄袭的基因已经深入骨髓，并不是某一个产品就可以改变的，不要说这些大的互联网企业，就算是一篇普通的公众号文章，都在想方设法抄袭，前段时代刷屏的《罗振宇的骗局》内容，就是从另一个公众号里进行洗稿。\n\n可以理解每个互联网创业者的无奈，在这样一个野兽出没的丛林时代，任何讲规则的人生最终都会视为一段笑话，但并不是说，我们就认为抄袭理所当然。\n \n中国互联网20年，就是抄袭的20年。某位传奇大佬曾经骂自己的产品经理：创什么新，连图标都给我抄袭过来。\n\n中国互联网史就是一部流氓史：你上的已经不是一个真正的互联网了\n\n\n\n\n\n03\n低俗史：\n从社会精英到网络喷子\n\n早期的互联网公司还是有精英意识的，最起码想获得网友尊重。\n\n1997年创立的网易，一直宣传自己“有态度”，想输出自己的价值观。而2013年开始推广的今日头条，开始全面迎合网友口味了，你关注的才是头条。\n\n1998年成立的腾讯网为了抢夺高端用户，特意组建评论部，推出评论“今日话题”，\n而2014年以后的自媒体内容平台恨不得你直接脱裤子晒照片。\n\n…………\n\n从1997年开始崭露头角的文学网站、论坛BBS等，那些叱咤江湖的网名无一不散发着永恒的香气，榕树下的小说，痞子蔡、安妮宝贝、宁财神、今何在至今威名远播，天涯社区更是卧虎藏龙，慕容雪村、当年明月、十年砍柴、五岳散人、孔二狗、十七进制、江南……这些人都是当年网文代表人物，而今的自媒体内容（除了公众号）则不忍直视。\n\n另外还有腾讯聊天室里的诗词歌赋，西祠胡同的家长里短，猫扑的逗逼风趣，红袖添香的精致唯美，晋江文学的新武侠，碧海银沙的连载和杂文，各有千秋，文采四溢。回头再看那个年代的江湖，真是桃李春风一杯酒，江湖夜雨十年灯。\n\n而现在的言论基本集中在百度贴吧，理性的声音日益稀少，铺天盖地全是情绪化的内容，基至连基本的文字都不会打了。2016年初的帝吧出征Facebook事件，直接沦落到发表情包——十余年间，曾经的网络精英岁月，已经沦落到成为一个喷子的时代，而且规模达两千万人之巨。\n\n这20年来，互联网没有让人类进化，反而让人性在矮化。\n中国互联网史就是一部流氓史：你上的已经不是一个真正的互联网了\n\n\n\n\n04\n盗版史：\n知识产权是个什么玩意儿\n \n2005年之前，你非常幸福，你可以在网上找到任何想看的内容。\n \n2010年之前，你仍然幸福，你可以在网上找到绝大部分内容。\n \n那真是一个盗版的黄金时代，有免费的音乐，免费的视频，还有免费的软件。任何一个产品只要说是收费，总会被人笑掉大牙。定义互联网只有两个词：免费、分享。从来就没有听说过看部电影还要付费的，哪像现在连德艺双馨的“苍老师”都找不到了。\n \n1999年~2011年，盗版网络文学横行无忌，就算2003年起点中文网探索VIP阅读模式，但仍有无数人可以在其它网站看到截屏内容。\n \n2010乐视网的出现是个转折，虽然它现在名声已臭，但对于网络版权的保护方面取到了极大的推动作用，贾跃亭用较低成本收购了很多版权内容，然后用维权的方式大量提升了IP价值，自那以后，各种音视频版权开始得到较大的保护和尊重。\n \n不过国内互联网的盗版早已经发展有些畸形了，非短时间内可以扭转，现在各大自媒体的视频抄袭，公众号的“1人原创，99人抄袭”，虽然换了一种形式，但对知识产权的尊重还非常遥远，包括头条这样的平台完全是站在盗版的基础上发展起来的。\n\n中国互联网史就是一部流氓史：你上的已经不是一个真正的互联网了\n\n\n\n\n05\n垄断史：\n从去中心化到中心化\n\n你上的已经不是一个真正的互联网了。\n\nwww的设计者Tim Berners-Lee认为互联网本来是去中心化的拓扑结构，每个人都可以建设自己的网站，但现在，互联网已经完全成为一种中心化结构。域名你要去新网或者万网（已经阿里系的了），服务器你可能只会选择腾讯云或者阿里云。这还不是最坏的结果，毕竟你还能建个属于自己的网站。比这个更恐怖的是苹果的出现，它用iOS系统和iphone牢牢的把每一家互联网公司给锁死，唯一能够与之抗衡的是Google / Facebook / Amazon……但这些公司你同样会觉得它们与苹果没什么两样。\n\n中国的互联网公司的中心化有过之而无不及，甚至可以说，中国互联网的发展史就是BAT三足鼎立的历史，1998年的腾讯、1999年的阿里、2000年的百度。似乎在20年前，宿命已经注定。虽然2008年移动互联网出现后稍有变数，但只要百度不再出昏招，新晋小巨头TMD（今日头条、美团、滴滴）还是很难超越的。\n\n现在新的创业公司都不想建立自己的网站了，服务在公众号里完成，商品在淘宝上开个店，新闻在头条里发布……何必要自己建立一个中心点呢，流量是哪里来？还不如寄生在一个大平台上面。\n\n今日互联网的中心化也不完全是市场竞争的结果，大公司用流量控制住所有新的可能，一旦有新物种出现，弄不死你就抄袭个同类产品压制你，如果还弄不死你那就收购你，反正总有一种流氓手段可以搞定你。\n\n互联网已经彻底中心化了，我们以为互联网会给每个人带来自由，现在才发现，互联网其实在剥夺我们的思考。20年来互联网的中心化就是垄断化，最后我们的命运将被控制在几个人手里。\n\n中国互联网史就是一部流氓史：你上的已经不是一个真正的互联网了\n\n\n\n\n结语\n人生无处不流氓\n \n互联网20年，既没有看到英雄造时势，也没有看到时势造英雄。\n \n触目所及的是：天地不仁，以万物皆为刍狗。\n \n再光芒万丈的互联网企业，也是满身的污垢和脏水。\n \n我们所看见的互联网时代，并无高深的谋略，亦非远大布局，而是各种流氓手段、点滴汗水、歪打正着才成就了这番伟业。\n \n虽然书店里已经摆满了成功者的书籍，他们的励志名言也广为传诵。\n \n但作为一个时代的见证者，还是会对下面的段子会心一笑：\n \n不知妻美刘强东，顺便挣钱丁三石；欠债不吹有罗敏，悔创阿里是马云……\n \n并非是对互联网大佬们的不敬，在这片土地上，每个人都有自己的无奈。只是觉得，青山深处埋忠骨，人生无处不流氓。如果不是有钱，互联网大佬又哪一个不是油腻的中年？",
			"added": 1588683579,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1598873499,
			"title": "去中心化的消息应用 Riot 改名为 Element",
			"body": "Riot 曾经是，现在也是一款基于开源 Matrix 协议的去中心化即时通讯应用。\n\n6 月底，Riot 即时通讯客户端宣布将改名。他们透露，他们的新名字是 Element。让我们来看看 Riot 为什么要改名，还有哪些要改。\n为什么从 Riot 改名为 Element？\n\n在说到最新的公告之前，我们先来看看他们当初为什么要改名。\n\n根据 6 月 23 日的一篇博客文章，该组织改名有三个原因。\n\n首先，他们表示“某大型游戏公司”曾多次阻止他们注册 Riot 和 Riot.im 产品名称的商标。如果要我猜的话，他们可能指的就是这家“游戏公司”）。\n\n其次，他们选择 Riot 这个名字的初衷是为了“唤起一些破坏性和活力的东西”。他们担心人们反而认为这个应用是“专注于暴力”。我想，当前的情形下，这个名字并不算好。\n\n第三，他们希望澄清 Riot 涉及的众多品牌名称所造成的混乱。例如，Riot 是由一家名为 New Vector 的公司创建的，而 Riot 是托管在 Modular 上，Modular 也是 New Vector 的产品。他们希望简化他们的命名系统，以避免混淆潜在客户。当人们寻找消息解决方案时，他们希望他们只需要寻找一个名字：Element。\n元素即一切\n\n从 7 月 15 日开始，该应用的名称和公司的名称已经改为 Element（元素）。他们的 Matrix 托管服务现在将被称为 Element Matrix Services。他们的公告很好地总结了这一点。\n\n  “对于那些第一次发现我们的人来说，Element 是 Matrix 通信网络中的旗舰级安全协作应用。Element 让你拥有自己的端到端加密聊天服务器，同时还能与更广泛的 Matrix 网络中的其他人连接。”\n\n他们之所以选择 Element 这个名字，是因为它“反映了我们在设计 RiotX 时对简单和清晰的强调；这个名字突出了我们一心一意将 Element 打造成可以想象的最优雅和最实用的主流通讯应用的使命”。他们还说，他们想要一个“能唤起数据所有权和自我主权的概念”的名字。他们还认为这是一个很酷的名字。\n除了改个名之外\n\n最近的公告也表明，此举不仅仅是简单的改名。Element 还发布了“新一代安卓版 Matrix 客户端”。该客户端的前身是 RiotX，现在改名为 Element。（还有呢？）它对以前的客户端进行了彻底的重写，现在支持 VoIP 通话和小部件。Element 还将在 iOS 上推出，支持 iOS 13，并提供“全新的推送通知支持”。\n\nElement Web 客户端也得到了一些关爱，更新了 UI 和新的更容易阅读的字体。他们还“重写了房间列表控件 —— 增加了房间预览（!!）、按字母顺序排列、可调整列表大小、改进的通知用户界面等”。他们还开始努力改进端到端加密。\n最后思考\n\nElement 公司的人迈出了一大步，做出了这样的重大改名。他们可能会在短期内失去一些客户。（这可能主要是由于出于某种原因没有意识到名称的改变，或者不喜欢改变）。然而从长远来看，品牌简化将帮助他们脱颖而出。\n\n我唯一要提到的负面说明是，这是他们在该应用历史上的第三次改名。在 2016 年发布时，它最初被命名为 Vector。当年晚些时候改名为 Riot。希望 Element 能一直用下去。",
			"added": 1598873510,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1600138196,
			"title": "ThunderWave-Chinese",
			"body": "http://127.0.0.1:43110/1HvUQHUqGRqPngRyhk66sUHvet8ewCrd3E/",
			"added": 1600138153,
			"parent_topic_uri": "1517730511_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1601014590,
			"title": "《一万年新手保护期》（ 作者：无籽甜瓜）",
			"body": "书评：主角不婚主义，应该是无女主。主角和他的房子穿越途中卡住了，在房子里可以联网和地球通话，房子外是异界。按常理，修仙系统会让主角一路打怪升级，但宅男主角并不想按照系统说得去探索世界，因为他觉得，外面实在太危险了，留在新手保护圈多好，有吃有喝有得玩。他待在屋子里，种蘑菇，吃蘑菇，喝蘑菇粉，造电磁炮，装神仙，宅在新手保护圈玩出了花。虽然主角宅在家搞科研，但是不管找上门来的，还是自己分身出去的，很好的解决了，不郁闷不扮猪，顺其自然的无敌。\n\n最有特色的是，男主真的宅，估计到完结，都不会出房子！真就窝在家里当幕后黑手！非常有意思的一本书，是我见过最怂的穿越者。什么苟仙啊，师兄，谨慎跟他比都是弟弟。写得很有意思，系统有意识但是被主角弄得特别惨，特别好笑。算无敌流吧。这个仙侠不是传统的凡人流、古典流、无敌流、猥琐流。应该算研究流，本异结合，仙科结合的做派。看起来很有趣，主角是个搞芯片的，在研究仙法科技化。行文流畅，内容引人入胜，描写不枯燥，支线脉络清晰不拖沓，创意很棒，蘑菇科技，天下第一！",
			"added": 1601014545,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1604063675,
			"title": "异界网络供应商（作者：异界小仙人）",
			"body": "掌门人刚用淘淘网购买了一套绝品飞剑。刚刚入门的小师弟则在逼乎提问 “怎样练气入体”。师姐则在朋友圈上发布了几张白拍照。隔壁宗门美艳动人的洛姬仙女，一曲舞跳完后对着屏幕叫喊 “老铁们，觉得本仙女跳得好的双击66666”。而这一切的操纵者，来自于地球的穿越众林修，正数钱数到手抽筋。 这是个用互联网改变异界的故事，也是个穿越众发家致富崛起的故事",
			"added": 1604063626,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1604063843,
			"title": "我到异界放卫星（作者：韦小宝 ）",
			"body": "带着3008年的资源卫星，穿越到异界。炼武什么的弱爆了，啥秘籍弄不到？打仗什么的兄弟真不会，可敌人在哪儿，看一眼就知道了。赚钱啥的就不说了，守着资源卫星。首富啥的，真心懒得作，钱够用就行",
			"added": 1604063793,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1606575513,
			"title": "在BT，Dat，SSB，IPFS上构建去中心化社交网络",
			"body": "本文将从社交网络的场景出发去分析和比较BT，Dat Protocol， Secure Scuttlebutt（SSB），IPFS四个有代表性的P2P网络协议，这些协议对Web 3.0的构造有着奠基性的意义。相比于Defi（去中心化金融）的热度，DeSNS（去中心化社交网络）的关注和实践甚少，但潜在价值相当。\n摘要（本文近8千字，太长不想读的读这里）\n\n BT与SSB没有NAT穿透的设计，不能实现全球连接，其中SSB选择公共服务节点的方式处理，相对中心化。BT专注于文件分享，IPFS专注于文件发布，两者都没有信息流同步的设计，不适合用于社交网络，但IPFS的底层协议libp2p支持这种拓展。SSB 与 Dat 两个协议更适合做社交网络，但两者的发展理念骤然不同。SSB让新用户必须与朋友连接到同一个公共节点才能连接，认为多中心的结构符合社交网络图谱，并反对DHT与区块链的同步方式。Dat追随DHT的应用，致力于让每台计算机参与P2P网络，并且支持信息流的部分验证，网络相对去中心化和机动。SSB强制使用户聚合到不同的中心节点将是错误的设计。P2P网络的拓扑结构应该用引导的手段去干预，而不是设计的手段去生成。使用Gossip（八卦）协议的网络也能实现隐私的细粒度控制，节点Gossip的不是数据本身而是数据的元数据。在P2P协议里面，由于种子的存在数据将不可能丢失或完全删除。Dat，SSB，IPFS上数据都是本地发布，用户拥有充足的数据主权。公共服务节点虽然可能聚集很多用户数据，但这些数据是公开的，服务节点对用户的客户端也没有控制力，减少了99%的作恶动机。在P2P网络里构建网络信任的方式只能通过接入一些信任源实现，网络中可以引入证书的概念来标记数据与用户。P2P网络避免的是来自平台的过度审查，但不是要逃离法律的监管。通过应用端过滤消息和节点拒绝路由违法消息能维护健康的网络环境。Web3社交网络中，我们依然可以在保持通讯和发布的去中心化的同时去容纳中心化的内容聚合和索引。用户将能自由选择他们信任的应用来实现搜索、内容榜单和推荐。去中心化社交网络的核心优势是：永久的内容、永续的社区、无广告和跨越不同应用的超级身份的实现。\n\nSNS三个基本条件\n\n一、让用户在网络中拥有身份\n\n需要用户拥有一个固定能代表自己的ID，与证明数据是属于这个ID所产生的证明途径。前者4个协议都可以做到，后者BT做不到，因为BT没有引入公钥/私钥，故用户不能对数据进行签名以代表这个数据的来源。\n\n二、能从网络中找到任意一个用户并建立连接\n\n在网络中找到一个用户需要知道她的TCP/IP信息。但很多人并没有固定的IP，导致外界无法联系这个人。这个问题被称为NAT穿透问题，或者hole punching问题。针对这个问题，BT没有做相应的改善措施。Dat目前使用了中心化的Tracker来解决，但以后会用上hole punching的协议Hyperswarm来解决这个问题。ssb直接放弃了攻破这个问题，它选择让用户直接连接到一些拥有服务器主机的公共节点（有固定IP），会形成一定的中心化。IPFS采用了TURN，STUN，ICE多种针对性方案来解决hole punching问题。\n\n三、满足发布/订阅的信息同步场景\n\n在社交网络中人们往往需要知道所关注的人的最新消息，这其实就是一个信息流同步的过程。BT没有这个设计，因为文件分享是一次性行为双方不需要长期对话。IPFS也没有信息流同步的设计，访问IPFS的一个链接的时候它只会指向文件的最新状态，虽然IPFS也会记录文件的修改历史，但是协议不会把这些历史状态都同步过来，这也跟IPFS专注于做去中心化的互联网有关，这是不适合用于做发布/订阅的，但IPFS的底层协议libp2p则有一定这样的设计。Dat和ssb都专注于信息流同步，协议都会主动把用户所关注的信息流（feed）的所有新消息按一个append-only的log同步过来。ssb是immutable的，每条新消息都是一个新文件，比如你发了一篇文章，则你发布了一个文件，如果你修改了文章，则你又发布了一个文件，你的个人主页会出现两篇文章，当然你可以手动删掉一篇。Dat很灵活的解决了这个问题。Dat的mutable的，首先Dat用文件夹表示一个ID（Dat里面一个用户可以有多个文件夹对应多个feed，ssb一个用户就是一个ID就是一个feed），然后Dat文件夹里面文件以txt名字表示，文件的新版本会自动覆盖旧版本，跟我们电脑里面的文件夹是一致的。同时每当你对文件夹里的文件做增删改时，每一个动作都会变成一条消息发表到你的feed里面，这就成了一个metadata log。这样做的好处有两个，一是你的文件夹时刻处于最新状态，二是别人可以从你的metadata log里面有选择的同步消息，而不像ssb那样一概而论都算新消息同步过来。\n（BT，SSB，Dat，IPFS的比较）\n\n\n从整体上看，BT与IPFS均不能满足构建社交网络的基础条件，但IPFS离这个实现距离不远，有拓展的空间。接下来我们将对SSB和Dat协议展开简短的分析。\nSecure Scuttlebutt\n\n有数据流的概念：一个ID一个feed，这个ID所有发布的新消息都归入feed里面。这个feed消息本地发布，用户拥有独立发布的能力。Feed消息是一个append-only log，消息只能增加不能删除和修改。节点同步信息时会互相询问对方有没有我感兴趣的feed的新消息，如果有则开始同步，如果没有对方将会将这个消息转发给自己认识的节点继续询问。一个节点如果想要得到一个具体的消息，或一个文件，需要知道消息或文件对应的ID，并开始向自己认识的节点询问。至于旧消息，订阅节点可以本地储存，也可以不储存。当你丢失一条消息时也可以从网络中重现找到备份重新下载，沿着你曾经得到这条消息的路由路径，你最终能找到消息的来源，这个源头不需要是作者本人，可以是作者的其中一位读者，也能给你提供这个文件。每个消息都由作者签名后再公布，当你收到一条消息时只需要验证消息的签名，就可以确认这条消息的作者身份和消息的完整性，无论这条消息来自于哪个节点。\n\nSSB没有DHT和NAT穿透设计，所以SSB为IP贫困户引入了公共节点（Pub）的设计。Pub应该是拥有固定IP的，允许任何人与其建立TCP连接的ssb公共节点，其与普通节点表现唯一的不同是，当你Follow这个节点时它会自动Follow back，其余都一样（Pub也有可能随时下线，所有人都可以运营Pub）。SSB故意避开了DHT和区块链的设计，因为SSB认为DHT和区块链都是P2P的Singletons（单例模式），相当于P2P版本的中心化系统。除此之外，global区块链要求每个节点储存整个账本，非常浪费资源，而DHT容易受到Sybil攻击。因此在SSB上，你必须与朋友在同一个Pub上才能建立连接，并且你的信息发现范围无法超越Pub的社交图谱，即使你知道一个目标信息的ID，若Pub的社交图谱里面没有节点储存了这个信息你也没办法获取到这个信息。总而言之，ssb设计了一套为博客而生的信息同步协议，但应用场景受限于Pub，而Pub的出现和衍变非常随缘，令网络变得非常“佛”。\nDat Protocol\n\nDat也有数据流的概念，所有数据也是本地发布，并且有版本的概念：dat中的数据以文件和文件夹的方式储存在本地，每个文件夹都有自己的数据流，也称为feed，订阅文件夹的公钥等于订阅文件夹的feed更新。Dat允许一个用户创建多个文件夹，订阅者可以订阅其中某个文件夹。feed的里面的消息按chunk来分段，以chunk的序列来表示。两个节点建立会话连接后，开始互相发布各自想要的chunk和拥有的chunk，然后互相同步，并记住对方需要什么，一旦自己有了这个chunk就告诉对方。区别于ssb，Dat的设计里面还包括文件夹的metadata feed（元数据记录），记录着文件夹里文件的状态，包括增/删/改。同一个文件可以从metadata feed里面找到历史版本。每次metadata feed有新的消息作者都会对feed里面所有消息的根哈希进行签名，这样下载者可以阅读metadata feed并从哈希树里面找到所需的部分文件来下载，不需下载全部信息。节点不单止可以询问其所感兴趣的文件夹有什么新的feed message，还可以告诉对方自己需要从哪里开始，到哪里结束的对应的chunks就行。利用chunks的根哈希可以验证所收到的chunk是否完整。比如A文件夹发布了一部电影，可以一段一段的上传，下载者一段一段的下载的时候可以通过根哈希知道自己下载了多少，还剩下多少，而在ssb里面，下载一段之后无法判断是否还有下一段，需要把新消息全部下载下来解析之后才知道哪里是头哪里是尾。类似的场景还可以套用于长期离线后重新上线时只接收最近的某一段时间的消息，或请求某一段历史聊天记录。Dat目前使用Multicast DNS局域网发现和tracker式的网络发现。Multicast DNS的使用场景非常狭窄，你能用它和同一个Wifi的朋友连接上以及发现附近的人。Tracker式的网络发现很global，但也非常中心化，长远来说不可行。长期来说Dat打算更换这两种方式，接入Hyperswarm的Kademlia式DHT寻址，能单单通过分享文件夹的公钥就能从网络中找到文件夹的下载信息（与BT类似），并且能实现hole punching。\n\nSSB vs Dat\n\nDat和ssb除了在网络寻址的发展方向（与其导致的拓扑结构）不一样之外，信息的同步机制都是类似的，ssb中同步通过三种gossip，一种询问有没有这个feed的新消息，一种询问有没有这个ID的消息，一种询问有没有某个blob（指大文件）；Dat中同步通过两种gossip，一种询问谁有这个feed，找到对应的节点后询问有没有这些chunks（指任何文件，包括文字消息）。对于博客和论坛等社交场景来说，ssb更细致一点，将一条消息里的大文件作为附件处理，在请求时可以分开加载。但Dat额外支持一个feed中内容的部分下载（Partial download），这个设计对初始化消息流和长时间离线后进行消息同步时在加载过程做一些体验优化是非常有用的。\n\n在社交网络上，SSB比Dat先迈进一步，但仍然只是勾勒了社交网络的雏形，与Facebook，Twitter相比还差很多，很多方面欠缺考虑和优化。下文将继续比较SSB和Dat两个协议在社交网络一些重要维度中的优劣，并且提出一些优化的思考。\n合理的去中心化社交网络\n\n一、通讯效率\n\n由于让所有人与所有人建立连接的通讯效率十分低下，根本没办法与现在的网络（Web2）相比，所以在P2P中一般会使用Gossip式（八卦）的通讯协议，即通过一传十，十传百的方式收到新消息，而在传输数据的时候，往往不会直接Gossip数据本身，而是数据的metadata，比如它的ID，它存在哪里，而已经存了这个数据的节点就可以直接把自己的备份发给所需的人，通过这样的扩散传播可以大大提高通讯效率，这点从bittorrent的运行已经得到过验证。实际上，加上有效的激励机制，繁荣健壮的节点网络能达到的网络传输速度能比Web2高5-10倍（参考PT网络的速度）。SSB和Dat都忠于Gossip理念，ssb甚至按gossip命名，以gossip行为思考网络的拓扑结构。但两个协议都没有刻意对节点网络进行积极的引导和激励。ssb认为社交网络本身就是多中心的，小节点围绕着大节点是与社交网络图谱本身相吻合的拓扑结构，所以ssb引入了Pub公共节点。一个用户可以连接多个Pub，但两个孤立的用户相遇必须连接到同一个Pub，离开Pub后他们才用gossip去联系。但实际上Pub作为服务节点会一直订阅着这两个用户，所以一般情况下这两个用户会永远经过这个Pub去同步信息。\n\n但Pub不一定是两个用户地理位置之间的最佳Relay，当两个用户想要在ssb上成为朋友时，双方只想赶紧找到一个可用的节点相互关注起来，这个节点是谁host的，干什么的，上面有什么人，什么内容这些因素根本来不及考虑，勉强的聚合使用户被动放弃了很多选择的可能，特别在ssb的官方应用patchwork中，加入Pub时初始化Pub中的公共数据会出现很恐怖的加载等待，而这些信息与我相关的少之又少。我认为这是ssb一个错误的设计。SSB看到了社交网络图谱的结构，想通过P2P网络还原一个真实自然的社交网络，这是一个很好的理念，但它忽略“真实自然”本身是自己繁衍出来的，强制让两个用户用同一个Relay节点恰恰本末倒置，违反了“真实自然”本身。Dat在这层则没有任何干预。Dat默认用户自己的计算机参与P2P网络，并任由用户自己发现和连接网络中的节点。\n\nP2P网络的拓扑结构应该用引导的手段去干预，而不是设计的手段去生成，因为一个单方面的决定不可能满足所有人的需求，把自主权交给用户本身才能让网络衍生出合理高效的拓扑结构。但在网络初期阶段，能够参与网络路由的节点很少，而且用户的计算机经常处于离线状态，节点的地理分布也不均匀，会出现通讯效率十分低下的尴尬情况，对节点网络的激励和引导将是一个必要环节。\n\n二、隐私\n\n在Gossip的网络中，虽然节点都在互相“八卦”，但隐私是可以得到保障的。首先，大家在gossip中传输的“八卦”不是消息本身，是消息的Metadata（元数据），这并不包含消息内容。然后再gossip的过程中数据传输是加密的，类似于http的handshake，ssb和Dat的节点在建立会话的时候也会经过handshake，中间由加密算法保证监听者不可以偷听所传输的数据，但监听者可以看到这些会话的建立。不过，任何一个节点都可以向内容的所有者请求数据。由于gossip协议本身的特性，节点会诚实告诉陌生人自己有没有这个内容的信息。但要想知道网络中随意两个节点正在交谈什么，必须自己亲自去参与gossip，并且知道它们所讨论的数据ID，去询问它们“你知不知道这个消息？”或者“你有没有这个消息的地址？”才可以达到目的。在社交网络里面，你对外发布的数据是公开的，谁都可以访问和请求，这里没有隐私问题。如果要做细粒度的隐私设置，可以对协议进行一些改良。比如你想把一条消息调为只给自己看，那么应该在本地增加一个加密数据和自动解密的功能；比如你想发一条消息只给部分人看，那么应该在访问者请求的时候加上授权的证书验证才开放数据。\n\n三、冗余与永续\n\n在P2P网络中，还有一个叫seed的操作，指节点主要为目标数据提供备份的“存种”行为。由于种子的存在，数据不可能丢失和完全删除，而且节点通过gossip可以自动的把丢失的数据从网络中“搜刮”回来，对于信息流形成了一种永续性的效果。ssb和Dat都不会主动引导用户去seed，但当它们用户发布/订阅场景的时候，数据就会在订阅者中形成一些冗余，这些都属于种子，当然订阅者可以主动删除这些数据。如果想要加强内容的冗余，可以加入一些引导和激励。\n\n四、数据主权\n\n在ssb和Dat中，用户自己的数据都保存在本地，可以说是拥有绝对的数据主权。但订阅者会收到你的数据，像ssb里面的超级relay，既是你的首要gossip对象也规定是你的订阅者，那么你所有的数据超级relay都有一份，当一个超级relay上面服务着很多用户时，情况似乎回到了Web2。但其实不然，情况和web2大有区别。首先relay只是节点，它并不是你的应用控制者，意味着它不能给你的timeline或者其他地方发送广告，也不能修改你的信息流顺序（feed 是个append-only log，并且经过作者签名），所以relay没有主动权，也丧失了99%作恶的动机。另外，用户可以随时换relay和屏蔽节点，也就是用户有选择权，relay作恶的动机就更减小了。\n\n五、网络信任\n\n在去中心化的网络里面，创建账户必须是独立的，即人人都可以创建账户，不需要经过审核，也就是说创建账户的成本几乎为0。再加上P2P网络的开放性设计，用户的数据很容易被全部复制，在Dat上的某些应用甚至加入了“一键Fork”的功能，复制一个账户的门槛比Web2大大降低。假设一个作恶者想模仿你去行骗，那么她在复制你的数据之后，再用大量的小号关注自己，形成很多粉丝的假象，就可以制造出容易让人误认的账户。这个问题在现有的社交网络中也普遍存在，“真相”是很难判断的。信任在现实生活中是非常中心化的，我们会有“信任背书”这个词语，是因为建立信任本来就需要中间人去保证的。在社交网络中，网络信任是不可缺失的一环，就算是去中心化的网络也应该在这点上加入中心化的控制，但这个角色肯定不是一个网络控制者，而是一些证书、凭证的设计。网络中可以引入一些证书的颁发者对内容进行监管，当他们对一个信息或者一个用户做标记时，应用和节点去识别这些标记并且作屏蔽、拒绝路由等处理。这些证书颁发者应该足够中立（达到全球程度的中立），并且有足够的信任担保（比如假如这些机构作恶，人们将可以把他们告上法庭）。\n\n六、审查与监管\n\n区块链项目在自我介绍的时候经常用一个词“抗审查”，这可能是有些项目的确是为抗审查而生的，有些可能是觉得抗审查是一个绝对的优势。但在社交网络里面，抗审查的意义是相对的。抵抗Web2中平台的审查是个绝对的优势，但抵抗法律的审查绝对是劣势。一个不能被法律监管的社交网络注定是失败的。\n\n在P2P的网络中，内容的发布和订阅都是用户自由的行为，但网络也是开放的，网络中的数据依然在监管的范围内，用户与节点为自己储存于传播的数据负责。与Web2不同的是，网络中没有实际控制者，这是因为网络不容忍权力滥用的空间，但网络并不是要排斥权力的实施，我们可以让网络变得更容易被监管。比如上述证书的设计，就可以用于标记一些违法账户或违法信息，并且要求应用端和节点拒绝违法信息，如果拒绝实施则同样属于违法行为。虽然开通账户并不需要任何身份证明，还网络不是完全匿名的，IP地址依然可以定位到用户。\n\n七、发现与搜索\n\n线上社交网络的其中一个迷人之处是它让人们可以突破空间的限制去认识朋友，在网上，人们会因为兴趣爱好、言论观点走到一起。Web2的产品已经把这些可能性发挥得淋漓尽致，给用户带来了很大的价值。不难发现，P2P网络缺失了这样一个“媒人”的角色，中间没有人去创造一些“偶遇”的机会，也没有人给用户指引去认识新的人，当一个新用户刚刚加入一个P2P网络时，她既没有朋友可以订阅，也没有内容可以浏览，进入了一个与世隔绝的状态。SSB选择坦然接受这个特性，他们认为人们在加入社交网络的时候本来就应该是有其他人带的，所以他们加入SSB的时候也应该已经有朋友，或者他们像走进一个酒吧一个连接到一个Pub，通过研究别人的资料来认识新的朋友。用过的朋友都知道这是很扯的。Web2的产品通过挖掘用户需求给用户带来优质的产品和服务，这部分价值是值得肯定的，只是他们在提供服务的同时侵犯用户的利益，才让他们变成坏人。然而在Web3社交网络中，我们依然可以在保持通讯和发布的去中心化的同时去容纳中心化的内容聚合和索引。我们把身份账户、订阅/发布、gossip路由看做网络的第一层的话，第二层就是对第一层网络数据的curation（策展）。不同于Web 2的是，这个网络中再也没有用户围墙，在同一个社交网络中，用户可以选择不同的搜索引擎，使用不同的推荐服务，查看不同的推荐榜单，参与不同的激励模型……\nDeSNS核心优势\n\nDeSNS vs Facebook, Twitter, Instagram, Reddit……\n\n一、永存的内容\n\nP2P的魅力不仅仅在于让文件无法永久删除，更在于让文件永久拥有了可以被访问的入口。在P2P网络中，你可以为一篇文章生成永久链接，不管文章保存在哪里也可以通过同一个链接访问。又或者你给出了一条负面评价，没有人可以删除或者隐藏这个内容，这就是content addressing的强大之处。不难想象，这是一个给予言论足够的重视的网络，你的一言一行将成为永久的记录，一方面这约束了大家在网上更加为自己的言论负责，一方面可以为个人的信息资产形成永久的存证。\n\n二、永续的社区\n\n当人们在P2P网络聚集在一起时，他们对同一个意识上的主题形成了节点上的聚合，是一个紧密gossip的群体。这个意识上的主题是形而上的概念，比如一个论坛应用，专注于同步一系列数据列表的最新状态，这时候这个社区将具有永续性：社区不能被关闭，成员之间的通讯不依赖中心化节点，历史消息可以自动被恢复。\n\n三、无广告\n\n由于P2P在协议层已经实现了点对点的信息同步，所以用户在接收信息的过程完全是独立的，自定义的。也就是说，没有人可以控制和修改你的feed信息流，除了你自己没有人可以决定你下一条信息看什么。这完全减除了现在我们在使用社交网络产品中平台方强制我们看广告的烦恼。\n\n四、超级身份\n\n开放和兼容是P2P网络与Web 2.0的Walled Garden最本质的差异，在P2P网络中没有用户围墙，核心的价值锁定在底层协议，上层应用不需要管理用户的身份和数据，用户可以用同一个身份使用不同的应用并且可以实现互操作，因为数据归用户所有，用户可以自由授权应用使用自己的任何数据。由于账户体系的一致，不同的P2P网络的身份可以相互绑定，其中也包括了区块链的身份，配合签名的使用可以实现链上链下数据的交互。结合内容的永久性，Web 3.0将有可能打造出用户的超级身份，甚至比线下身份更可靠。\n结语\n\nWeb 3.0 SNS将是一个完全的颠覆，影响的将是人们参与社交网络活动秩序，甚至是互联网的秩序。这里充满了机会和空间，同时也是一片稚嫩和理想的土地，有太多的基础设施需要被完善，太多的价值需要被诠释和演绎。所幸是区块链、IPFS这样的技术和项目已经慢慢走向主流，Web 3.0 网络的开放和兼容将会翻涌更大的革新浪潮，Web 2.0 公司在竞相抢夺用户时间的局面还能持续多久？",
			"added": 1606575506,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1587199580_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": 1,
		"1590990672_16X9h7ik2RKWnJ3ZMacutgSe7ZevyVraLN": 1
	},
	"next_comment_id": 46,
	"comment": {
		"1587179836_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 1,
				"body": "v2ex 使用积分制防止灌水\n发回复扣5铜，修改主题也会被扣铜\n&nbsp;  \nv2ex（零网版）：\nhttp://127.0.0.1:43110/1139zZM5AEsk3J48n75gojC9XpD318mxEB/",
				"added": 1587199464
			}
		],
		"1587199580_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 2,
				"body": "v2ex 使用积分制防止灌水\n发回复扣5铜，修改主题也会被扣铜\n&nbsp;  \nv2ex（零网版）：\nhttp://127.0.0.1:43110/1139zZM5AEsk3J48n75gojC9XpD318mxEB/",
				"added": 1587199587
			}
		],
		"1579168609_1FfatX3G2z43rV6nc1F3koYtn8tmD5EVb6": [
			{
				"comment_id": 3,
				"body": "> [einreiz@zeroid.bit](#comment_7_18Qgy9EmRqwRRoNYdHtB7VeTPKs8GiiyTH): 玩0网的人多吗 [...]\n\n不多\n[ThunderWave-Chinese](http://127.0.0.1:43110/1HvUQHUqGRqPngRyhk66sUHvet8ewCrd3E/)",
				"added": 1587200211
			}
		],
		"1587201079_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 4,
				"body": "我认为自学是一条正确的路，什么是自学？就是你学习你自己感兴趣的东西，有很多人不知道自己感兴趣的是什么？抽烟喝酒，打游戏，唱k？这些不是兴趣，而是爱好呀！\n\n兴趣是需要你通过努力而一步一步完善的，爱好就是随随便便的，你可以爱好唱歌，但你的兴趣可以是如何把歌唱得更好。\n\n那如果你能把兴趣转变成职业呢？你再努努力把职业变成事业呢？那么你就在过着你真正想过的生活。\n\n而这就应该是教育的重要一部分，你以后所学的待人接物能力，沟通能力，合作能力等等，这些是枝叶，你的兴趣和你真正想做什么，这个是你的主干。\n\n很遗憾，这些学校都没有教，但你可以在离开学校以后，慢慢去找到你的兴趣，去培养你的兴趣。不断学习智慧和修正言行，当年学校没有教给你的，你需要自己补上，让自己变好。\n\n很多重要的东西在学校里没有学到，这会是一种遗憾，我只是希望不要再让遗憾继续下去，我们能做的还有更多，谁说我们不能改变呢？",
				"added": 1587201095
			},
			{
				"comment_id": 23,
				"body": "挫折教育",
				"added": 1587709747
			}
		],
		"1587199920_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [],
		"1587348627_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [],
		"1587444274_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 8,
				"body": "ZeroNet 高质量的内容都在博客里，论坛没有固定的话题，也没有人",
				"added": 1587446099
			}
		],
		"1587557535_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 9,
				"body": "资源管理器+高效搜索软件——Listary\nEagle 是一款图像管理软件，帮你整合电脑上的图片，更高效率的寻找目标。\nnTrun：Win+R 快捷启动工具\nWGestures：鼠标手势工具\nAutoHotkey 是一款 windows 平台下的热键脚本语言程序\nQuicker : 一款个人开发的效率神器，和我们之前推荐过的一些快捷启动类软件类似。\n菲菲更名宝贝之得意非凡\nFences 就是为你打造的桌面效率神器\n远程输入法——用电脑帮手机打字",
				"added": 1587559831
			},
			{
				"comment_id": 12,
				"body": "电脑 = 交换信息「数据」 + 处理信息 + 管理数据 + 交互设计 + 外设\n数据所有权\n必要的东西和额外的东西",
				"added": 1587608032
			},
			{
				"comment_id": 13,
				"body": "娱乐至死的社会本质就是为了阻止人去思考，如果每个人都像哲学家一样清醒的活着，对统治阶级利益的永续发展、资本不断扩张的本性、基因延续传递的目的都不利，世界就像一个大公司，基因才是CEO，至于这个CEO以及它背后那个从不出现的大BOSS到底想干什么，我们都不知道。",
				"added": 1587605789
			},
			{
				"comment_id": 14,
				"body": "首先，电脑能够干什么，完全取决于你电脑里面应用软件都装了什么。\n\n在开始之前，我们简单聊聊题主说的“电脑\"这个概念。这个电脑我们通常意义上指的是符合个人计算机通用标准的硬件及专属平台软件的集合。硬件基本上都差不多相同。无非显示器和主机，顺便加点奇奇怪怪的外设，基本上都是大同小异。可软件方面的差异就非常大了。普通些的，就是系统+常用软件：QQ、微信、offices、酷狗、360浏览器、优酷视频客户端，外加一个LOL或者QQ游戏。但是，在一些计算机专业或者美术设计、多媒体编辑等专业的学生电脑里面，可能会多一些虚拟机、PS、CDR、视频编辑软件。电脑的拓展新，可以说完全是取决于它的软件应用安装。可以这样说，游戏电脑，全部下载和安装的是个大游戏平台和游戏软件。office、酷狗、qq都不安装，那么它只能用来打游戏，不能用来编辑文档，制作PPT。从这个角度来看，电脑能够干什么，完全取决于你电脑里面应用软件都装了什么。\n\n其次，电脑能够干什么，完全取决于你对这个客观世界不想干点什么。\n\n为什么这样说呢？因为电脑知识一对硬件和软件组合起来的东西，不具备任何属性。你想让它成为什么样子，它就成为什么样子。但绝对不会反过来成为它想让你变成什么样你就变成什么样。你不可能期望电脑成为《钢铁侠》里面的智能语音，你无聊了，会主动给你说笑话，它缺乏主动性。从这个角度来说，你问电脑都能干什么，其实不是指对电脑拓展性的怀疑而是自己对个世界缺乏探索激情的表现。如果你想把和朋友聊天，那么社交类软件完全可以满足你的需求。如果你想把自己的观点分享，就可以进入微博。想分享个人经验，百度经验，知乎。想恶搞，可以用会声会影等视频软件剪个好笑的视频短片，末尾添加一个恐怖的头像和声音，生成短视频发给朋友，等等等。电脑只是你完成你对这个世界探索的一个得力的工具和助手，但绝不是旅游的导游，课堂的教师。就这样打个比喻：你手里有一把螺丝刀，在你面前一个神秘的上了锁的箱子。那么现在我想问你，这个螺丝刀能够干什么？\n\n最后，走出去认识这个世界和人，你会发现，电脑能干什么这个问题是你这辈子问过最愚蠢和后悔的问题。",
				"added": 1587608309
			},
			{
				"comment_id": 20,
				"body": "狗屁不通文章生成器，suulnnka在github上的一个很有意思的项目，专业治疗形式主义写文章需要。你随便输入一个主题，几秒钟的时间就可以给你生成一篇一万字以上的文章！真的很有意思，仔细看看内容，竟然写的还挺有深度的，不妨试试！",
				"added": 1587647138
			},
			{
				"comment_id": 21,
				"body": "老死机开车暗号之加密解密工具\nhttp://caoniang.com/3676.html",
				"added": 1587647693
			}
		],
		"1587566699_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 10,
				"body": "有句名言这么说的,消灭不了他的思想,那就消灭他的身体\n　　\n　　对脑残来说,它们毫无思想可言\n　　因此只有消灭掉它们的身体 脑残才会消失\n　　\n　　要知道 全世界人口只会呈几何数的增长\n　　世界人口将会越来越多\n　　资源和粮食土地等将会越来越少\n　　虽然现在这些脑残粪屎数量上只占总人类0.0000...000%几都不到\n　　但是如果它们繁衍了后代,并把脑残基因遗传给后代\n　　长此以往,当脑残占锯一定数量时\n　　将会对人类的生存够成严重威胁!!!\n　　为了使全人类更能和谐的生活下去,我的建议是:\n　　用战争武力消灭脑残!!!\n　　顶一把枪在它们脑门上,问它们还有什么想做的或没做的\n　　如果回答还是 SJ 13只之类的,统统毙掉!免得浪费粮食!\n　　不要心软,对脑残的心软 才是对人类智慧文明的亵渎!\n　　如果能反省的 ,暂饶其狗命!\n　　那第2天早上它们才会发现这是它们人生中最快乐的一天.",
				"added": 1587566860
			},
			{
				"comment_id": 11,
				"body": "应该把脑残关在监狱里进行思想改造，防止对其他人造成影响",
				"added": 1587567226
			},
			{
				"comment_id": 18,
				"body": "> [gamer@kaffie.bit](#comment_31_18CqJW5h4Rj2uiBuTx1SxYXPFiLQWW4zLt): 不不不，關起來太浪費了，低智商人口從來 [...]\n\n主要是脑残在网上很烦人",
				"added": 1587644680
			},
			{
				"comment_id": 19,
				"body": "> [gamer@kaffie.bit](#comment_32_18CqJW5h4Rj2uiBuTx1SxYXPFiLQWW4zLt): 表現腦殘的真不一定都是腦殘，還有不少收 [...]\n\n不管怎么样，反正他们影响我的用户使用体验了，用户体验极差",
				"added": 1587645417
			}
		],
		"1587630488_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 15,
				"body": "表网版\n知乎\n天涯社区\n豆瓣网\n学信网\n163邮箱\n",
				"added": 1587636035
			},
			{
				"comment_id": 16,
				"body": "零网版\n新人的第一站，了解零网【[New GFW Talk](http://127.0.0.1:43110/NewGFWTalk.bit/?Main)】      ->\n新用户报道  【[ThunderWave-Chinese](http://127.0.0.1:43110/1HvUQHUqGRqPngRyhk66sUHvet8ewCrd3E/)】->\n讨论问题 【[新知乎](http://127.0.0.1:43110/14f1Ru4axcieJ51YdCxngtg2ZN2jzEh3jM/?Main)】",
				"added": 1587630841
			},
			{
				"comment_id": 22,
				"body": "思维展开：\n有事外出的时候怎么在外面找到厕所？",
				"added": 1587701557
			}
		],
		"1587983435_1Khzomj1zmnvgRq7RFFYgUdqUrefPhWjBa": [],
		"1588043977_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [],
		"1587350174_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 28,
				"body": "> [sunxiaochuan258@kaffie.bit](#comment_8_141aRafenxpVcuU4nsYsU2k2P5g2kd1Fb5): zeronet一样可以关站跑路,原知乎 [...]\n\n备份别人的网站数据比较困难，备份零网网站的数据简单一点",
				"added": 1588125332
			}
		],
		"1588125501_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 29,
				"body": "问题都在群内解决，不发表到网络上",
				"added": 1588126236
			}
		],
		"1588683603_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 35,
				"body": "现在的人爱说什么太长不看",
				"added": 1588731331
			},
			{
				"comment_id": 38,
				"body": "> [gamer@kaffie.bit](#comment_38_18CqJW5h4Rj2uiBuTx1SxYXPFiLQWW4zLt): 這就偷換概念了，信息交流的本質是共享， [...]\n\n信息可以独占，百度获得了利益",
				"added": 1589673098
			}
		],
		"1589112181_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 36,
				"body": "自媒体\n去中心化",
				"added": 1589112323
			}
		],
		"1587207625_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 37,
				"body": "一不小心就有清空的风险，这个可受不了",
				"added": 1589326713
			}
		],
		"1594865551_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 39,
				"body": "有事不说还等着别人主动伺候你吗？",
				"added": 1594865573
			}
		],
		"1599033135_1HzCm9E93ifpr2CejdEMhY6kEYYggwpiYD": [
			{
				"comment_id": 40,
				"body": "用不了",
				"added": 1599104116
			}
		],
		"1599413186_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 41,
				"body": "去中心化漂流瓶\n《星露谷物语》去中心版",
				"added": 1600136553
			}
		],
		"1599415632_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 42,
				"body": "哈希宝贝是EOS上的一款DAPP，是一款限制级在18岁以上的成人应用，目前已经停运。哈希宝贝采用了全新的设计，通过结合EOS和IPFS，将业务逻辑、计算与数据存储三者解耦，在去中心化的基础上实现低成本、高效率且灵活的系统。",
				"added": 1599416615
			}
		],
		"1599451964_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 43,
				"body": "http://www.ipfs.guide/\n[BT高清电影网](http://127.0.0.1:43110/1JuwWYEgApiBVNyGxhvNYyohsv4YMtxy7M/)",
				"added": 1599962371
			}
		],
		"1599963112_1QDMRYsPQf1CLzzHjbofzQGeKF9CYScBhX": [
			{
				"comment_id": 44,
				"body": "[ThunderWave-Chinese](http://127.0.0.1:43110/1HvUQHUqGRqPngRyhk66sUHvet8ewCrd3E/) \n[支持 kaffie ID][留言板](http://127.0.0.1:43110/168Rj5utkevnkKjpXaWgF6qPGLGCzgHUW4/)",
				"added": 1599963470
			},
			{
				"comment_id": 45,
				"body": "https://github.com/kustomzone/Fuzium",
				"added": 1599965763
			}
		]
	},
	"comment_vote": {}
}