{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Unesp Aberta",
			"body": "A Unesp Aberta é um ambiente de aprendizagem on-line e gratuito que oferece a oportunidade de formação e aperfeiçoamento em diversas áreas do conhecimento para pessoas com acesso a Internet no Brasil e no mundo.\n\nÉ uma iniciativa da Reitoria da Unesp (no âmbito das Pró-Reitorias de Graduação, Pós-Graduação e Extensão), juntamente com o Núcleo de Educação a Distância (NEaD/Unesp), que passa a disponibilizar gratuitamente os recursos pedagógicos digitais desenvolvidos para os cursos da Universidade. São cursos livres e sem assessoria pedagógica (tutoria).\n\n- https://unespaberta.ead.unesp.br/index.php",
			"added": 1547362016
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"1_1Cb4eWXn7AEBQ9wuebVf7DdKTexyoESrJa": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"2_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": 1,
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1
	},
	"next_comment_id": 23,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#MECÂNICA QUÂNTICA \n\nA Mecânica Quântica (Física Quântica) é a teoria Física que obtém sucesso no estudo dos sistemas físicos cujas dimensões são próximas ou abaixo da escala atômica, tais como moléculas, átomos, elétrons, prótons e de outras partículas subatômicas, muito embora também possa descrever fenômenos macroscópicos em diversos casos. A Mecânica Quântica é um ramo fundamental da Física com vasta aplicação.\n\nA teoria quântica fornece descrições precisas para muitos fenômenos previamente inexplicados tais como a radiação de corpo negro e as órbitas estáveis do elétron. Apesar de na maioria dos casos a Mecânica Quântica ser relevante para descrever sistemas microscópicos, os seus efeitos específicos não são somente perceptíveis em tal escala. Por exemplo, a explicação de fenômenos macroscópicos como a super fluidez e a supercondutividade só é possível se considerarmos que o comportamento microscópico da matéria é quântico.\n\nA quantidade característica da teoria, que determina quando ela é necessária para a descrição de um fenômeno, é a chamada constante de Planck, que tem dimensão de momento angular ou, equivalentemente, de ação.\n\nA Mecânica Quântica recebe esse nome por prever um fenômeno bastante conhecido dos físicos: a quantização. No caso dos estados ligados (por exemplo, um elétron orbitando em torno de um núcleo positivo) a Mecânica Quântica prevê que a energia (do elétron) deve ser quantizada. Este fenômeno é completamente alheio ao que prevê a teoria clássica.\n\n- https://www.professorglobal.com/fisica-quantica\n- http://www.fisica.net/mecanica-quantica",
				"added": 1547325706
			},
			{
				"comment_id": 2,
				"body": "#A DESCOBERTA DE PLANCK E OS PROBLEMAS FILOSÓFICOS DA FISICA ATÔMICA\n\n- https://web.archive.org/web/20150325093952/http://www.fisica.net/mecanica-quantica/A_Descoberta_de_Planck_e_os_Problemas_Filosoficos_da_Mecanica_Quantica.pdf",
				"added": 1547325726
			},
			{
				"comment_id": 4,
				"body": "#Teoria de Grupos - Helayel\n- https://www.youtube.com/playlist?list=PLjEqTgJ_GMqpANVc9mdpzKFNS0JJJERof",
				"added": 1547325821
			},
			{
				"comment_id": 8,
				"body": "#Ciência e tecnologia de Terahertz\n\nA faixa TeraHertz do espectro (abreviado como THz, ou seja, 1000 Gigahertz), estende-se desde microondas até o infravermelho médio, com comprimentos de onda entre aproximadamente 3 milímetros e 30 micrômetros. Em um dos lados do espectro eletromagnético temos as ondas de rádio, que são emitidas e recebidas por antenas e manipuladas com componentes eletrônicos. No outro lado temos a luz, bem conhecida, que é manipulada através de espelhos, lentes e fibras ópticas. A região THz, que está situada entre estas duas bandas espectrais bem conhecidas, é ainda pouco explorada, e requer avanços tecnológicos que combine conhecimentos de eletrônica e óptica. Até poucos anos atrás esta tecnologia esteve voltada quase que totalmente às aplicações militares, tornando as informações confidenciais, e o acesso aos componentes já fabricados restrito, e muitas vezes impossível de serem importados por determinados países como o Brasil. A capacidade de visualizar objetos em ambientes sem luz e através de diferentes materiais trouxe novos atrativos para o desenvolvimento na região do infravermelho, dividido entre próximo, médio e distante (região THz). De fato, radiação terahertz tem a capacidade de penetrar vários materias que são opacos para luz visível, como fumaça, papel, papelão, plásticos, madeira, cerâmica e tecidos. Desta forma, pode ser usada para obter imagens do interior de objetos, assim como se faz com os raios-X, porém sem nenhum efeito nocivo uma vez que, ao contrário destes, é radiação não ionizante de baixa energia.\n\nO imageamento THz apresenta duas vantagens principais sobre a tecnologia de microondas, já bem estabelecida: (a) resolução espacial, pelo menos dez vezes melhor e (b) características espectrais de determinados materiais exclusivamente nesta faixa espectral. Aplicações em segurança, para fins comerciais e militares, são provavelmente as aplicações mais divulgadas nesta área até hoje.",
				"added": 1547331826
			},
			{
				"comment_id": 13,
				"body": "#Pinças Ópticas: manipulando células vivas com pinças de luz laser\nPinças ópticas são instrumentos científicos que utilizam lasers extremamente focalizados para manipular pequenos objetos dielétricos. A força criada pela pinça depende da diferença do índice de refração do objeto e do meio que o envolve. Pinças ópticas tem sido particularmente aplicadas em experimentos de biologia celular nos últimos anos.\n- https://youtu.be/0MYBwyB-F6Y",
				"added": 1547344611
			},
			{
				"comment_id": 16,
				"body": "#Os espaços-tempos inflacionários não são completos\nMuitos espaços-tempos infláveis ​​tendem a violar a condição de energia fraca, uma suposição fundamental dos teoremas da singularidade. Aqui, oferecemos um argumento cinemático simples, que não exige nenhuma condição de energia, que um modelo cosmológico que esteja inflando - ou apenas expandindo suficientemente rápido - deve estar incompleto em direções nulas e temporais. Especificamente, obtemos um limite na integral do parâmetro Hubble sobre um geodésico nulo ou temporal. Assim, os modelos inflacionários exigem que a física, além da inflação, descreva o limite passado da região inflável do espaço-tempo.\n- https://sci-hub.tw/10.1103/PhysRevLett.90.151301",
				"added": 1547361855
			},
			{
				"comment_id": 19,
				"body": "Como a descrição quântica da realidade, que inclui elementos como a \"superposição de estados\" e o \"colapso da função de onda\", dá origem à realidade que percebemos?",
				"added": 1547362833
			},
			{
				"comment_id": 20,
				"body": "#Grupo de Física de Plasmas e Fusão Termonuclear Controlada (GFPFTC)\n\n- https://portal.ifi.unicamp.br/a-instituicao/departamentos/deq-departamento-de-eletronica-quantica/grupo-de-fisica-de-plasmas-e-fusao-termonuclear-controlada-gfpftc",
				"added": 1547370004
			}
		],
		"1_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": [
			{
				"comment_id": 3,
				"body": "#Aprenda a investir na bolsa de valores\n- https://www.youtube.com/playlist?list=PLizIulnKEOz-YNN8DYTEQYlDoBIagWW3b",
				"added": 1547325774
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 5,
				"body": "#DRAGÕES PARA SEMPRE\nO advogado Jackie (Jackie Chan) é contratado pra defender uma indústria química, acusada de poluir as águas da cidade. Quando a proprietária de um imóvel local processa a fábrica, Jackie pede auxílio a seus amigos Luke (Sammo Kam-Bo Hung) e Timothy (Yuen Biao). Entretanto, ao descobrir que a empresa produz drogas, Jackie toma o partido da dama.\n- https://youtu.be/RGuEeqjgloY",
				"added": 1547325873
			},
			{
				"comment_id": 6,
				"body": "#Kickboxer\nKurt Sloane (Jean-Claude Van Damme) é um jovem lutador de caratê que ajuda seu irmão mais velho, Eric Sloane (Dennis Alexio), nos treinos de kickboxing. Após se tornar campeão mundial dos pesos pesados, Eric vai para a Tailândia defender o título, enfrentando o invencível Tong Po (Michel Qissi). Durante a luta ele é gravemente ferido, ficando paralítico. Em busca de justiça, Kurt decide defender a honra da família no ringue, se submetendo a um pesado treinamento de muay thai com um famoso mestre local, chamado Xian Chow (Dennis Chan).\n\n- https://youtu.be/eFg15q8z1yA",
				"added": 1547326110
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 7,
				"body": "#Astro Boy (2003)\nAstro é um menino robótico que possuem super-poderes humanos e um sistema de inteligência artificial que é incomparável a qualquer robô. Seu criador, o Dr. Tenma, criou-o para substituir seu filho falecido, Tovio. Dr. Tenma logo destrói seu laboratório, após a criação do Astro, e desliga Astro. Logo após, o Dr. O'Shay, o chefe do Ministério da Ciência revive Astro, e tenta dar-lhe uma vida normal como um estudante do 6º ano que ajuda o organismo a polícia manter robôs renegados e humanos irracional de causar danos. . Astro enfrenta extremo racismo por ser um robô, e ele deve descobrir a verdade sobre o seu criador Dr. Tenma.\n\n- https://www.superanimes.site/cartoon/astro-boy-2003",
				"added": 1547326200
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 10,
				"body": "#Firewall seguro com o IPTables\niptables é o nome da ferramenta da interface do usuário que permite a criação de regras de firewall e NATs. Apesar de, tecnicamente, o iptables ser apenas uma ferramenta que controla o módulo netfilter, o nome \"iptables\" é frequentemente utilizado como referência ao conjunto completo de funcionalidades do netfilter. O iptables é parte de todas as distribuições modernas do Linux.\n\n- https://www.vivaolinux.com.br/artigo/Firewall-seguro-com-o-IPTables",
				"added": 1547340689
			},
			{
				"comment_id": 11,
				"body": "#Curso Completo - Como instalar e configurar o pfSense\nO pfSense é um software livre, licenciado sob BSD license, baseado no sistema operacional FreeBSD e adaptado para assumir o papel de um firewall e/ou roteador de redes. Ele possui recursos que muitas vezes, só encontrada em firewalls comerciais caros. já que podemos realizar com o pfSense a imensa maioria das atividades que esperamos de sistemas com este título.\n- https://www.youtube.com/playlist?list=PLQ7gVTPc8Kmij4-2RpiQMAQjkj3XkolGI",
				"added": 1547340752
			},
			{
				"comment_id": 12,
				"body": "#Construindo um script para monitoração de arquivos (Bash)\n- https://www.youtube.com/playlist?list=PLQ7gVTPc8KmgensThPhY3i7ROw9bkWd0B",
				"added": 1547340916
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 14,
				"body": "#UMA SOLUÇÃO DO PROBLEMA DAS N RAINHAS ATRAVÉS DE ALGORITMOS GENÉTICOS\n- https://web.archive.org/web/20190113021018/https://sistemas.riopomba.ifsudestemg.edu.br/dcc/materiais/1638062552_rainhas.PDF",
				"added": 1547345707
			},
			{
				"comment_id": 15,
				"body": "#Problema das N rainhas é NP Completo\n- https://www.i-programmer.info/news/112-theory/11086-n-queens-is-np-complete.html",
				"added": 1547346046
			},
			{
				"comment_id": 18,
				"body": "#Filosofia da Matemática\nSe a matemática é considerada uma ciência, então a filosofia da matemática pode ser considerada como um ramo da filosofia da ciência, ao lado de disciplinas como a filosofia da física e a filosofia da biologia. No entanto, devido ao seu assunto, a filosofia da matemática ocupa um lugar especial na filosofia da ciência. Enquanto as ciências naturais investigam entidades que estão localizadas no espaço no tempo, não é de todo óbvio que esse também seja o caso dos objetos que são estudados em matemática. Além disso, os métodos de investigação da matemática diferem acentuadamente dos métodos de investigação nas ciências naturais. Enquanto os últimos adquirem conhecimento geral usando métodos indutivos, o conhecimento matemático parece ser adquirido de uma maneira diferente: por dedução dos princípios básicos. O status do conhecimento matemático também parece diferir do status do conhecimento nas ciências naturais. As teorias das ciências naturais parecem menos certas e mais abertas à revisão do que as teorias matemáticas. Por estas razões, a matemática apresenta problemas de um tipo bastante distinto para a filosofia. Portanto, os filósofos deram atenção especial às questões ontológicas e epistemológicas relativas à matemática.\n\n- https://plato.stanford.edu/archives/spr2015/entries/philosophy-mathematics/",
				"added": 1547362726
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 17,
				"body": "#Filosofia da Matemática\nSe a matemática é considerada uma ciência, então a filosofia da matemática pode ser considerada como um ramo da filosofia da ciência, ao lado de disciplinas como a filosofia da física e a filosofia da biologia. No entanto, devido ao seu assunto, a filosofia da matemática ocupa um lugar especial na filosofia da ciência. Enquanto as ciências naturais investigam entidades que estão localizadas no espaço no tempo, não é de todo óbvio que esse também seja o caso dos objetos que são estudados em matemática. Além disso, os métodos de investigação da matemática diferem acentuadamente dos métodos de investigação nas ciências naturais. Enquanto os últimos adquirem conhecimento geral usando métodos indutivos, o conhecimento matemático parece ser adquirido de uma maneira diferente: por dedução dos princípios básicos. O status do conhecimento matemático também parece diferir do status do conhecimento nas ciências naturais. As teorias das ciências naturais parecem menos certas e mais abertas à revisão do que as teorias matemáticas. Por estas razões, a matemática apresenta problemas de um tipo bastante distinto para a filosofia. Portanto, os filósofos deram atenção especial às questões ontológicas e epistemológicas relativas à matemática.\n\n- https://plato.stanford.edu/archives/spr2015/entries/philosophy-mathematics/",
				"added": 1547362650
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 21,
				"body": "Guardai-vos de fazer a vossa esmola diante dos homens, para serdes vistos por eles; aliás, não tereis galardão junto de vosso Pai, que está nos céus.\nQuando, pois, deres esmola, não faças tocar trombeta diante de ti, como fazem os hipócritas nas sinagogas e nas ruas, para serem glorificados pelos homens. Em verdade vos digo que já receberam o seu galardão.\nMas, quando tu deres esmola, não saiba a tua mão esquerda o que faz a tua direita;\nPara que a tua esmola seja dada em secreto; e teu Pai, que vê em secreto, ele mesmo te recompensará publicamente.\nE, quando orares, não sejas como os hipócritas; pois se comprazem em orar em pé nas sinagogas, e às esquinas das ruas, para serem vistos pelos homens. Em verdade vos digo que já receberam o seu galardão.\nMas tu, quando orares, entra no teu aposento e, fechando a tua porta, ora a teu Pai que está em secreto; e teu Pai, que vê em secreto, te recompensará publicamente.\nE, orando, não useis de vãs repetições, como os gentios, que pensam que por muito falarem serão ouvidos.\nNão vos assemelheis, pois, a eles; porque vosso Pai sabe o que vos é necessário, antes de vós lho pedirdes.\nPortanto, vós orareis assim: Pai nosso, que estás nos céus, santificado seja o teu nome;\nVenha o teu reino, seja feita a tua vontade, assim na terra como no céu;\nO pão nosso de cada dia nos dá hoje;\nE perdoa-nos as nossas dívidas, assim como nós perdoamos aos nossos devedores;\nE não nos conduzas à tentação; mas livra-nos do mal; porque teu é o reino, e o poder, e a glória, para sempre. Amém.\nPorque, se perdoardes aos homens as suas ofensas, também vosso Pai celestial vos perdoará a vós;\nSe, porém, não perdoardes aos homens as suas ofensas, também vosso Pai vos não perdoará as vossas ofensas.\nE, quando jejuardes, não vos mostreis contristados como os hipócritas; porque desfiguram os seus rostos, para que aos homens pareça que jejuam. Em verdade vos digo que já receberam o seu galardão.\nTu, porém, quando jejuares, unge a tua cabeça, e lava o teu rosto,\nPara não pareceres aos homens que jejuas, mas a teu Pai, que está em secreto; e teu Pai, que vê em secreto, te recompensará publicamente.\nNão ajunteis tesouros na terra, onde a traça e a ferrugem tudo consomem, e onde os ladrões minam e roubam;\nMas ajuntai tesouros no céu, onde nem a traça nem a ferrugem consomem, e onde os ladrões não minam nem roubam.\nPorque onde estiver o vosso tesouro, aí estará também o vosso coração.\nA candeia do corpo são os olhos; de sorte que, se os teus olhos forem bons, todo o teu corpo terá luz;\nSe, porém, os teus olhos forem maus, o teu corpo será tenebroso. Se, portanto, a luz que em ti há são trevas, quão grandes serão tais trevas!\nNinguém pode servir a dois senhores; porque ou há de odiar um e amar o outro, ou se dedicará a um e desprezará o outro. Não podeis servir a Deus e a Mamom.\nPor isso vos digo: Não andeis cuidadosos quanto à vossa vida, pelo que haveis de comer ou pelo que haveis de beber; nem quanto ao vosso corpo, pelo que haveis de vestir. Não é a vida mais do que o mantimento, e o corpo mais do que o vestuário?\nOlhai para as aves do céu, que nem semeiam, nem segam, nem ajuntam em celeiros; e vosso Pai celestial as alimenta. Não tendes vós muito mais valor do que elas?\nE qual de vós poderá, com todos os seus cuidados, acrescentar um côvado à sua estatura?\nE, quanto ao vestuário, por que andais solícitos? Olhai para os lírios do campo, como eles crescem; não trabalham nem fiam;\nE eu vos digo que nem mesmo Salomão, em toda a sua glória, se vestiu como qualquer deles.\nPois, se Deus assim veste a erva do campo, que hoje existe, e amanhã é lançada no forno, não vos vestirá muito mais a vós, homens de pouca fé?\nNão andeis, pois, inquietos, dizendo: Que comeremos, ou que beberemos, ou com que nos vestiremos?\nPorque todas estas coisas os gentios procuram. Decerto vosso Pai celestial bem sabe que necessitais de todas estas coisas;\nMas, buscai primeiro o reino de Deus, e a sua justiça, e todas estas coisas vos serão acrescentadas.\nNão vos inquieteis, pois, pelo dia de amanhã, porque o dia de amanhã cuidará de si mesmo. Basta a cada dia o seu mal.\n\n- Mateus 6:1-34",
				"added": 1547372628
			},
			{
				"comment_id": 22,
				"body": "Dai ao SENHOR, ó filhos dos poderosos, dai ao SENHOR glória e força.\nDai ao Senhor a glória devida ao seu nome, adorai o Senhor na beleza da santidade.\nA voz do Senhor ouve-se sobre as suas águas; o Deus da glória troveja; o Senhor está sobre as muitas águas.\nA voz do Senhor é poderosa; a voz do Senhor é cheia de majestade.\nA voz do Senhor quebra os cedros; sim, o Senhor quebra os cedros do Líbano.\nEle os faz saltar como um bezerro; ao Líbano e Siriom, como filhotes de bois selvagens.\nA voz do Senhor separa as labaredas do fogo.\nA voz do Senhor faz tremer o deserto; o Senhor faz tremer o deserto de Cades.\nA voz do Senhor faz parir as cervas, e descobre as brenhas; e no seu templo cada um fala da sua glória.\nO Senhor se assentou sobre o dilúvio; o Senhor se assenta como Rei, perpetuamente.\nO Senhor dará força ao seu povo; o Senhor abençoará o seu povo com paz.\n\n- Salmos 29:1-11",
				"added": 1547373339
			}
		]
	},
	"comment_vote": {
		"17_1Cb4eWXn7AEBQ9wuebVf7DdKTexyoESrJa": 1,
		"9_1Q8vv3AZ9kzTnGRAE7WiREfHpCztxjJGsA": 1,
		"7_17KvnHUDitqK2fURKEM85tbL18yJVbM6Aq": 1
	}
}