{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 31,
	"comment": {
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 1,
				"body": "The Big Bang Theory S06E04 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1581828876_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1581829023
			},
			{
				"comment_id": 3,
				"body": "The Big Bang Theory S06E05 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1581847135_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1581847364
			},
			{
				"comment_id": 10,
				"body": "The Big Bang Theory S06E06 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582018011_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582018084
			},
			{
				"comment_id": 13,
				"body": "The Big Bang Theory S06E07 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582087369_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582087635
			},
			{
				"comment_id": 18,
				"body": "The Big Bang Theory S06E08 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582252505_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582252732
			},
			{
				"comment_id": 28,
				"body": "The Big Bang Theory S06E09 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582520740_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582520803
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "Gigolô Europeu Por Acidente 2005 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1581836242_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse:\nDeuce Bigelow (Rob Schneider) acreditava que sua carreira de gigolô estava definitivamente encerrada, mas é obrigado a voltar à ativa quando seu ex-cafetão, T.J. Hicks (Eddie Griffin), é acusado de estar envolvido no assassinato de vários gigolôs europeus. Querendo ajudar o amigo a se livrar desta situação, Deuce aceita retomar a carreira de gigolô para investigar a acusação. Ele parte então para a Europa, onde precisa competir com a poderosa Sociedade dos Gigolôs Europeus e ainda seduzir um grupo de clientes disfuncionais.",
				"added": 1581836434
			},
			{
				"comment_id": 14,
				"body": "Os Aventureiros do Bairro Proibido 1986 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582088162_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSINOPSE: O caminhoneiro Jack Burton (Kurt Russel) se envolve em uma briga milenar de Chinatown depois que a noiva de seu amigo é raptada por um mago de 2 mil anos de idade. Assim, ele acaba se envolvendo no submundo do bairro asiático, e encontrando figuras misteriosas e místicas. Ele terá que recuperar Gracie Law (Kim Catrall) sozinho, e para conseguir isso vai ter de enfrentar o terrível feiticeiro LoPan (James Hong).",
				"added": 1582088367
			},
			{
				"comment_id": 15,
				"body": "The Last Samurai (O Último Samurai) 2003 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582092652_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse: Em 1870 é enviado ao Japão o capitão Nathan Algren (Tom Cruise), um conceituado militar norte-americano. A missão de Algren é treinar as tropas do imperador Meiji (Shichinosuke Nakamura), para que elas possam eliminar os últimos samurais que ainda vivem na região. Porém, após ser capturado pelo inimigo, Algren aprende com Katsumoto (Ken Watanabe) o código de honra dos samurais e passa a ficar em dúvida sobre que lado apoiar.",
				"added": 1582093107
			},
			{
				"comment_id": 16,
				"body": "Os Caças Fantasmas 1 1984 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582169528_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse: Em Nova York Peter Venkman (Bill Murray), Ray Stantz (Dan Aykroyd) e Egon Spengler (Harold Ramis) são três cientistas do departamento de psicologia da Columbia University, que se dedicam ao estudo de casos paranormais. Quando a subvenção termina eles são despedidos e Venkman sugere que abram um negócio próprio, a exterminadora de fantasmas “Ghostbusters”. Inicialmente eles só têm despesas e nenhum cliente, mas eis que surge Dana Barrett (Sigourney Weaver), uma violoncelista que teve uma experiência assustadora em seu apartamento.",
				"added": 1582171983
			},
			{
				"comment_id": 17,
				"body": "14 - 007 - Nunca Mais Outra Vez 1983 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582186029_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse: James Bond é convocado para tentar reaver bombas nucleares roubadas pela organização terrorista Spectre. Mas terá que se livrar de uma sexy assassina profissional, contratada especialmente para eliminá-lo.",
				"added": 1582186847
			},
			{
				"comment_id": 19,
				"body": "Entrevista Com o Vampiro 1994 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582252808_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse: São Francisco, anos 1990. Um jornalista entrevista um jovem que afirma ser vampiro, narrando suas experiências dos últimos 200 anos. Em flash-back, conhecemos Louis de Pointe du Lac (Brad Pitt), um homem que perdeu a mulher, morta durante o parto, e a vontade de viver. Com a ajuda de uma criatura da noite, Lestat de Lioncourt (Tom Cruise), ele se torna um vampiro e precisa aprender uma nova forma de vida.",
				"added": 1582253154
			},
			{
				"comment_id": 23,
				"body": "O Chacal 1997 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582276210_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse: Bruce Willis, Richard Gere e Sidney Poitier estrelam este suspense internacional dirigido por Michael Caton-Jones. Um impiedoso assassino (Willis) foi contratado para eliminar alguém muito importante no governo dos EUA. Trocando constantemente de identidade e localização, ele é conhecido somente por Chacal. Tudo sobre este assassino profissional, incluindo sua sinistra programação, é segredo. Avisado da presença do Chacal, mas incerto de seus propósitos, o diretor do FBI (Poitier) enfrenta o maior desafio de sua carreira. Para localizar o frio matador, ele e uma eficiente oficial da inteligência russa (Diane Venora) pedem a ajuda de um terrorista irlandês preso (Gere). Esses improváveis aliados correm contra o relógio para parar o misterioso mercenário antes que ele complete sua missão. O Chacal é baseado no roteiro de 1973, filmado como O Dia do Chacal.",
				"added": 1582276341
			},
			{
				"comment_id": 24,
				"body": "Planet of the Apes (O Planeta dos Macacos) 2001 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582345769_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse: Após sofrer um acidente na espaçonave em que estava, Leo Davidson (Mark Wahlberg) chega em um planeta estranho e primitivo, onde os humanos migalham por sua subsistência, são caçados e escravizados por primatas tiranos, que formam o poder local. Sem concordar com a opressão imposta à raça humana, Leo logo se torna uma séria ameaça ao status quo local e dá início à uma revolução social no planeta.",
				"added": 1582345959
			},
			{
				"comment_id": 26,
				"body": "Gattaca - A Experiência Genética 1997 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582441939_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse:\nNum futuro no qual os seres humanos são criados geneticamente em laboratórios, as pessoas concebidas biologicamente são consideradas \"inválidas\". Vincent Freeman (Ethan Hawke), um \"inválido\", consegue um lugar de destaque em corporação, escondendo sua verdadeira origem. Mas um misterioso caso de assassinato pode expôr seu passado.",
				"added": 1582444574
			},
			{
				"comment_id": 27,
				"body": "The Godfather Part III (O Poderoso Chefão 3) 1990 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582460619_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse: Nova York, 1979. A Ordem de San Sebastian, um dos maiores títulos dados pela Igreja, é dada para Michael Corleone. Michael está velho, doente e divorciado, mas faz atos de redenção para tornar aceitável o nome da família Corleone. Na comemoração pelo título recebido, após 8 anos de afastamento, Michael recebe “Vinnie” Mancini, seu sobrinho. Nesta tentativa de diálogo a conversa toma um rumo hostil, pois participava também da reunião Joey Zasa, que agora mantém o domínio de uma área outrora mantida por Don Vito Corleone. Vinnie é chefiado por Zasa, mas fala que não quer continuar. Vinnie é quase morto pelos capangas de Zasa e uma guerra pelo poder tem início. Um arcebispo da Igreja solicita a Michael US$ 600 milhões, pois resolveria o déficit da Igreja, oferecendo em troca que Michael ganhe o controle majoritário da Immobiliare, empresa européia de propriedade da Igreja. Michael concorda, mas isto deixa vários membros do clero contrariados, que não o aceitam por sua vida duvidosa.",
				"added": 1582460783
			},
			{
				"comment_id": 30,
				"body": "The Return of the Pink Panther (O Retorno da Pantera Cor de Rosa) 1975 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582616376_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm\n\nSinopse:\nNesta terceira seqüência, o diamante pantera cor-de-rosa foi roubado mais uma vez e uma luva branca é deixada para trás, levando todos a acreditarem que o famoso ladrão de jóias 'O Fantasma' está de volta. O Inspetor Clouseau (Peter Sellers) é chamado para investigar o crime no sul da França.",
				"added": 1582616488
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 4,
				"body": "Liga da Justiça - Sem Limites - S02 E16 - O Projeto Apocalypse Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1581922091_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1581922155
			},
			{
				"comment_id": 5,
				"body": "Dragon Ball Z - Episodio 040 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1581967866_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1581967915
			},
			{
				"comment_id": 7,
				"body": "Liga da Justiça - Sem Limites - S02 E17 - A Força Tarefa X Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582011928_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582012411
			},
			{
				"comment_id": 8,
				"body": "Liga da Justiça - Sem Limites - S02 E18 - O Equilíbrio Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582013324_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582013367
			},
			{
				"comment_id": 9,
				"body": "Liga da Justiça - Sem Limites - S02 E19 - Casais Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582015033_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582015136
			},
			{
				"comment_id": 11,
				"body": "Liga da Justiça - Sem Limites - S02 E20 - Embate Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582059133_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582059303
			},
			{
				"comment_id": 12,
				"body": "Liga da Justiça - Sem Limites - S02 E21 - Luar de Caçada Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582083543_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582083613
			},
			{
				"comment_id": 20,
				"body": "Naruto Classico 43 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582263115_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582263190
			},
			{
				"comment_id": 21,
				"body": "Naruto Classico 44 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582269438_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582269507
			},
			{
				"comment_id": 22,
				"body": "Naruto Classico 45 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582273106_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582273220
			},
			{
				"comment_id": 25,
				"body": "Liga da Justiça - Sem Limites - S02 E22 - Disputa de Poder Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582388237_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582388305
			},
			{
				"comment_id": 29,
				"body": "Naruto Classico 46 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582611740_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582611949
			}
		]
	},
	"comment_vote": {}
}