{"cert_user_id": "risoul@github", "next_topic_id": 3, "topic": [{"topic_id": 1604064930, "title": "Better UI for deleting a node", "body": "When we want to stop a seed and delete the node, the confirmation button appears at the top right. Not fast when deleting lot of nodes.\n\nSolutions?\n- allow to press enter to confirm deletion\n- put delete confirmation button near the node\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1441860393, "modified": 1442344210, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/161", "source_type": "github"}, {"topic_id": 1604064956, "title": "IDEA: zerocomment", "body": "Jus an usage idea.\n\nToday lot of sites are closing comments, and moderation exclude lot of them. It will became more and more difficult to post a critical point of view.\nI think we need to allow everybody to comment everywhere on the web, without moderation, with or without anonymity to criticize (even a sponsered product) and express opinions, on a decentralized base.\n\nThe idea is something like Disqus, but based on zeronet.\nA browser plugin open a right column on the webpage we want to comment and create a zeronet article asociated with the visited url.\nThen everyone with the plugin can see this column with comments and comment too or vote for best comments.\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1444451523, "modified": 1492261461, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/180", "source_type": "github"}], "next_comment_id": 4, "comment": {"1604064939_mirrored_dobrosketchkun_github": [{"comment_id": 1, "body": "First step: no more centralised server\nSecond step: no need for physical network\nGreat!\nMay be a collaboration with Serval project? http://developer.servalproject.org/dokuwiki/doku.php\nor span? https://github.com/monk-dot/SPAN (https://play.google.com/store/apps/details?id=org.span&feature=search_result#?t=W251bGwsMSwyLDEsIm9yZy5zcGFuIl0.)\nor commotion? \n", "added": 1445179937, "modified": 1445179937, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/167#issuecomment-149035046", "source_type": "github"}], "1604064956_mirrored_risoul_github": [{"comment_id": 2, "body": "Yes, I did not use the good example with Disqus... the goal is not to centralize, but to get a zeronet comments associated with each website.\n\nManual website.com (an existing site with closed comments) example:\n- I create a zeronet site corresponding to website.com, based on zerotalk, named zerotalk-website.com\n- The url website.com/page1 as closed comments. I create a new discussion in zerotalk corresponding to this url.\n- Then people can comment for each url, using the zerotalk-website.com site.\n\nA browser plugin could automate the site and discussion creations on visiting the url (if not already done). Then it add a right column into the browser and fetch data from other users to show comments by loading the corresponding discussion. Finally the user could add a new comment.\nDecentralized P2P based commenting for everyone system is born. Just an idea, may be not a good one.\n", "added": 1444462210, "modified": 1444462210, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/180#issuecomment-147071928", "source_type": "github"}, {"comment_id": 3, "body": "Yes exactly! I did not know commentanything. The same based on zeronet = no moderation at all, no centralization, no third party service.\n", "added": 1444541857, "modified": 1444541857, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/180#issuecomment-147172408", "source_type": "github"}]}}