{
	"title": "Стрелок в Глубине",
	"description": "Похождения Леонида в deep",
	"links": "*   [Таверна \"Неуловимый Джо\"](http://127.0.0.1:43110/1DCApr9WK3oQjfgg5zs4nK2RqB4PGtwbqA)\n*   [Mail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=deepstrelok)\n*   [ZeroMe](http://127.0.0.1:43110/me.zeronetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh/deepstrelok@zeroid.bit)\n*   [ENG blog](http://127.0.0.1:43110/1PV9ZGoitJX3FMwTQrTiGd2MMhoHa9DChU)\n\n\n**Поддержать автора :**\n\n_BTC_ - `1J3d3tJYCHGApQGpBZPtQEXpkz6yXuqsUj`",
	"next_post_id": 10,
	"demo": false,
	"modified": 1528566246,
	"post": [
		{
			"post_id": 9,
			"title": "Честность",
			"date_published": 1528566167.302,
			"body": "> Ничего у меня нет, кроме той смешной ветхой морали, о которой сокрушалась Вика. А мораль - хитрая штука, она никогда не даёт ответов, наоборот, мешает их найти.\n> Легче быть праведником или подлецом, чем человеком.\n\nЗнаете я из тех людей, что увидев несправедливость стараются как-то помочь. Увидев шанс быстро обогатиться за чужой счет, не берет не копейки себе, сообщая о данной возможности. Считай вымирающий вид. А вот вопрос - зачем? Тут можно действительно задуматься. Если не брать во внимание всякие глупые религиозные соображения, то по сути нет никаких оснований делать подобное.\n\n* * *\n\nТак что удерживает меня, от того, чтобы применять некоторые свои знания и навыки во зло другим. Страх наказания? Отнюдь. Я вполне могу просчитать большинство исходов и скрыть свою деятельность от почти любых глаз. Может быть воспитание? Те самые заложенные в семье ценности, присущие нам почти от рождения. Возможно.\nЧто самое интересное, мне наоборот больше нравится помогать другим и не важно будут ли они о том, знать или нет.\nИ даже негативный опыт формируемый по мере, того как ты видишь, что те кто не стесняются любых путей и возможностей получают все блага - не меняет моей позиции.\n\nВ современном мире честность все чаще становится не нужной и отбрасывается большинством. Вы никогда не заглядывали в чужие интернет жизни. Я заглядывал. Сотни аккаунтов, форумов, устройств. И почти всегда. Ложь на лжи. Часто даже просто безцельной. Может быть мы разучились доверять и открываться. Может быть честность просто отмирает за ненужностью в суровых реалиях.\n\nДа я встречал и иное. Совершенно анонимные личности в сети и полное доверие в очень серьезных делах. И казалось бы вот простор для обмана и лжи. Ан нет.\nНо это очень мало. Слишком. Как хотелось бы жить в нескольком ином обществе. Где добро ценят и ставят выше, чем что-либо иное. Мечты."
		},
		{
			"post_id": 8,
			"title": "Анонимная крипта",
			"date_published": 1527692349.616,
			"body": "> ... знаешь, самая страшная нищета - это нищета, которая пытается встретить новый год.\n\nБытует мнение в кругах обывателей, что биткоин анонимная криптовалюта. Это далеко не так. Она лишь не привязана к вашей личности by default. Но привязкой будет служить при необходимости, что угодно. Обменник, в котором вы обменяли фиат или электронные деньги, ip-адрес при переводе транзакции или же опубликованные где-либо вами адреса, на которые вы получили деньги.\nКроме того блокчейн биткоина содержит все переводы с момента создания сети и лучше думать о анонимности переводов заранее, а не пытаться потом отмазаться от сомнительных средств, выведших неожиданно на ваш след.\n\nБлаго существует несколько криптовалют, призванных исправить подобные проблемы и сегодня мы немного поговорим о них.\n\n* * *\n\n#### Monero\n\nMonero - это проект анонимной криптовалюты. Плюс monero в том, что абсолютно все транзакции являются неотслеживаемыми. Имеет в основе протокол cryptonote, который сохраняет приватность и анонимность пользователей, путем обфускации переводов с помощью системы кольцевых записей. Вы всегда можете выбрать насколько безопасным будет ваш перевод, подобрав подходящее значение mix. По умолчанию 7.\n\nМайнинг до сих пор можно производить на cpu, в связи с тем, что используется набор aes-инструкций процессора и создать асики под данную криптовалюту труднее, чем под другие.\n\nБлагодаря monero, вы можете полностью анонимно переводить валюту. Только не используйте для хранения и получения биржи или внешние кошельки.\nИначе привязка ваших транзакций к вашему аккаунту может навредить вашей анонимности, в случае если сервис, предоставляющий услуги, захочет выдать информацию о вас.\n\nРекомендую поднять полную ноду monero либо на внешнем анонимном vps, либо в виртуальной машине, с траффиком через тор.\n\nИтак, скачайте консольный клиент с сайта [monero](https://getmonero.org/downloads/) или скомпилируйте его из исходников, если вам нечего делать.\n\nСамое неудобное - приходится сталкиваться с тем, что необходима подгрузка всего блокчейна monero, который в настоящее время весит под 100 гигов.\n\nНо можно скачать его прямо с официального [сайта](https://downloads.getmonero.org/blockchain.raw) и импортировать его. Даже этот процесс будет долог. Заварите пару ведер чаю.\n\n```\ntar -xvf Downloads/monero-gui-linux-x64-v0.12.0.0.tar.bz2\ncd monero-gui-v0.12.0.0/\nwget https://downloads.getmonero.org/blockchain.raw\n\nДолго\n./monero-blockchain-import --input-file ./blockchain.raw\n\nИли быстрее, если не проверять все данные\n./monero-blockchain-import --guard-against-pwnage 0 --input-file ./blockchain.raw\n\nЗатем досинхронизируем остатки блокчейна.\n./monerod --block-sync-size 10\n\nСоздаем кошелек.\n./monero-wallet-cli --generete-new-wallet koshelek.lol\n\nТакже можно восстановить кошелек с помощью seed-фразы\n./monero-wallet-cli --restore-deterministic-wallet\n\nЗапуск производим по имени файла\n./monero-wallet-cli --wallet-file koshelek.lol\n```\n\nДля переводов используем команду transfer. Можете пользоваться и gui-интерфейсом если хотите.\n\n#### Zcash\n\nZcash - это относительно новая криптовалюта, которая имеет принципиальные отличия от остальных.\nИспользуется новая технология доказательства с нулевым разглашениям, которая позволяет передавать средства между кошельками без разглашения суммы, получателя и отправителя.\nК сожалению обычные переводы производятся без подобной функции.\n\nЧтобы передавать монеты анонимно нужно использовать z-кошельки. Создание и отправка денег с помощью них требует оперативной памяти желательно не меньше 4 ГБ. Ведутся работы над уменьшением, чтобы была возможность использования на мобильных. Запомните t-кошельки, так же небезопасны, как и bitcoin. Все хранится в блокчейне. Однако возможна передача между t и z кошельками средств, при которых производится частичная анонимизация данных.\n\nСкачать полный клиент можно на этой странице - [https://z.cash/download.html](https://z.cash/download.html)\nТам же имеются инструкции для debian-подобных систем. Можно скачать и бинарный файл и сверить его подпись. Однако лучше поставьте с пакетного менеджера, так будет удобнее. Разумеется кому хочется полностью удостовериться, можно скачать исходный код, проверить его и скомпилировать.\n\n```\nСоздадим логин-пасс для rpc\necho \"rpcuser=username\" >> ~/.zcash/zcash.conf\necho \"rpcpassword=`head -c 32 /dev/urandom | base64`\" >> ~/.zcash/zcash.conf\nzcash-fetch-params\n\nСинхронизируем блокчейн с помощью демона\nzcashd\n\nВо время запущенного zcashd используйте zcash-cli для управления кошельком.\n\nСоздадим z-адрес\nzcash-cli z_getnewaddress\n```\n\nОднако пусть для zcash пока и отсутствует gui-клиент, есть возможность тиспользовать стороннее веб-решение, для удобства.\n\nМожно поставить плагин с открытым исходным кодом для [cockpit](https://github.com/hellcatz/zcash-cli-cockpit). Это web-gui для управления сервером. Для этого достаточно просто клонировать его в папку для плагинов. В Fedora cockpit обычно установлен по умолчанию. После зайдите в веб-браузере по адресу 127.0.0.1:9090 и залогиньтесь с помощью вашего логин-пароля. Если все сделано правильно внизу будет вкладка zcash. Работает разумеется лишь при запущенном демоне zcashd.\n\n#### Dash\n\nВ данной криптовалюте присутствует возможность использования Darksend, которая является разновидностью coin-join перемешивания монет. Эту технологию используют различные биткоин-миксеры. На самом деле, как по мне это наименее безопасная из подобных криптовалют. Не рекомендую к использованию.\n\n#### Дополнения\n\nДля анонимных криптовалют советую использовать полную ноду, запущенную через тор в виртуалке. Желательно в системах полной изоляции наподобие Qubes OS.\n\nИспользование купленных анонимно VPS возможно, но настоятельно не рекомендуется. Если планируете, не забывайте использовать на сервере LVM-шифрование всего диска.\n\nМобильные кошельки, вроде Monerujo с открытым исходным кодом и подключением к сторонним серверам сообщества используйте только для не опасных вам переводов. В идеале с android с выпиленными гугл-сервисами, фаерволлом запрещающим все (AFWALL) и разрешающим соединения только через впн и используя тор с включенной функции работы в качестве впн для системы.\n\nПокупать же анонимную криптовалюту рекомендую с помощью другой крипты на таких сервисах, как Shapeshift, Changelly. Там это достаточно удобно реализовано и без лишних проблем и привязок к личности, как на биржах.\n\nДля, так скажем отмыва определенных криптовалют вы можете использовать обмен на одну из анонимных выше и прогнать на другой подконтрольный вам кошелек с помощью встроенных средств анонимизации данной крипты. Обычно этого достаточно. Разумеется учтите ваш ip-адрес и прочие факторы при использовании сторонних обменников."
		},
		{
			"post_id": 7,
			"title": "Доверие",
			"date_published": 1525795771.469,
			"body": "> Лёня… Элениум… а у тебя есть в жизни цель? Хоть какая-то? Не своровать тысчонку-другую долларов, не повеселиться в ресторанчике с друзьями, а именно Цель?\n> Есть, честно говорю я.\n> Это секрет?\n> Молчу секунду.\n> Знаешь, я хотел бы приходить домой и не доставать из кармана ключи.\n> Вика, в своей эльфийской маске, отводит глаза.\n> Это совсем-совсем мелко и смешно, говорю я. Это даже не заточка несуществующих мечей… и не изучение психопатов в виртуальном пространстве. И уж никак не коммунизм и мировая революция. Но мне хочется просто позвонить в свою дверь и чтобы её открыли.\n\nКак хочется просто верить. Компаниям, правительству, знакомым и друзьям. Просто не думать и позволить им постепенно контролировать твою жизнь. Ведь это так просто. Верить!\n\nИ каждый раз доверие оборачивается ножом в спину. Сказанная лишняя фраза - предательством. То что должно стать опорой, так хрупко, что почти всегда не выдерживает взятого на себя веса. Как просто тем, кто не проверял доверие на прочность.\nТем, чьи секреты не являются хоть сколько-то опасными и кто никогда не узнает о, том что их тайны всегда становятся известны другим. Ведь ты наверное думаешь, что именно твое доверие не предадут. Возможно уже.\n\n* * *\n\nПочему так происходит? Порой доверием специально злоупотребляют. Порой же им делятся. Друг, доверяющий полностью уже своему другу, рассказывает нечто тому, кому казалось бы он тоже доверяет полностью. И тогда доверие можно поделить на ноль.\nИли недостаточно замотивированная сторона, получив опасную информацию, использует ее для своей личной выгоды.\nЗахотев поделиться чем-то опасным для тебя, всегда взвешивай плюсы и минусы. Возможно тебе станет легче, когда об этом узнает кто-то еще. Возможно тебе нужна помощь в трудном деле. Но уверен ли ты, что это стоит того.\n\nВидели ли вы, как мужья врут женам. Как друзья лгут своим друзьям.\nКак отец бьет дочь. И сын крадет деньги у своей матери.\nВидели ли, как трусость берет верх над смелостью и человек предает друга, чтобы спасти свою шкуру. Как берет верх инстинкт самосохранения и простая угроза, оказывается достаточным поводом для предательства.\n\nЖелаю вам никогда не испытать подобное. И не оказаться на другой стороне.\n\nА проверял ли ты себя. Да себя. Возложенное на тебя доверие, когда либо соприкасалось с большой ответственностью, с большими суммами денег или было угрозой для того, чьи секреты ты хранил. Ты можешь сказать, что никогда не сделаешь подобного?\nЕсли на кону будут сотни тысяч долларов. Если предав доверие, об этом никто не узнает. Если тебе будут угрожать. Если сохранять тайну уже не имеет никакого смысла.\n\nНе злоупотребишь ли ты тогда доверием. Но ты не знаешь. Я знаю.\nИспытав подобное, действительно понимаешь себя.\n\nМы привыкли доверять авторитетам. По крайней мере большинство из нас. Человеку в форме, известным людям, нашим кумирам, популярным сайтам и компаниям. Большинство людей не смущает, когда переписка в социальной сети касается личных секретов. Возможно они просто не знают. Но все имеют свои интересы. И интересы так называемых авторитетов, чаще всего никогда не пересекутся с вашими. Скорее можно доверять соседу-алкоголику, чем им. Ведь он хотя бы туп, как пробка.\n\nТы все еще доверяешь кому-либо? В этой мире доверие - это слишком хорошо, чтобы быть правдой. Помни - не доверяй никому и тебе не придется разочаровываться. Делись информацией в допустимых пределах.\nВерь лишь себе. Поверь это тяжело, но лишь поначалу.\nЗатем это станет привычкой. Ты сможешь менять маски легко и просто. Видеть людей насквозь.\nМожет быть тогда ты поймешь."
		},
		{
			"post_id": 6,
			"title": "Выбор мессенджера",
			"date_published": 1525624905.436,
			"body": "> А ты веришь в свободу?\n> А в свободу не надо верить. Когда она есть, ты сам это чувствуешь.\n\nВ связи со всеми этими запретами по поводу телеграмм и общими настроениями по контролю шифрованной переписки считаю стоит обсудить, то какие мессенджеры действительно являются безопасными, анонимными и выбрать лучший по определенным критериям.\n\nЕсли здесь не будет какого-либо мессенджера - это не значит, что я о нем забыл. Просто он даже не стоит упоминания.\n\n* * *\n\n#### 1) Раз уж заговорили о telegram, стоит пожалуй начать с него.\n\n-- Шифрование end-to-end не включено по умолчанию.\nБольшой косяк, так как большинство просто не будет добавлять себе сложности и писать в шифрованном чате. Ведь переписку на одном устройстве, прочесть уже на втором не удастся. И обыватель просто, считая телегу \"безопасным\" мессенджером будет обсуждать свои секреты в обычных переписках.\n\n-- Привязка к телефону.\nЧто тут скажешь. Для социальной составляющей очень удобно. Для анонимности полный провал. И даже зарегистрироваться без телефона невозможно, что в обычном, что в Desktop-версии. Если хочется пользоваться анонимно, приходится применять ухищрения вроде получения смс через специальные сервисы или аренды симкарт в сети.\n\n-- Централизация\nУправляется одной компанией и все проходит, только через их сервера.\n\n-- Push-уведомления\nИспользуя телеграмм на apple,android вы получаете push-уведомления из несекретных чатов через apple,google систему оповещений. Соответственно вдобавок к одной компании ваши сообщения может прочесть еще и другая.\n\n-- Частичный open source.\nНекоторые компоненты исходного кода Телеграмм остаются закрытыми.\n\nИз плюсов можно учесть лишь удобства каналов и простота создания ботов на основе телеграмм. Сделаем вывод. Для поболтать с коллегами по работе или знакомыми сгодится. Для безопасной и анонимной работы только с большими ухищрениями с вашей стороны.\n\n#### 2) Signal - мессенджер, рекомендованный лично Сноуденом.\n\n-- Проверенный сервис.\nИмеется аудит и не один от сторонних компаний. Открытый исходный код и проверенное шифрование.\n\n-- Шифрование end-to-end по умолчанию.\nЗдесь signal однозначно получает плюс. По умолчанию все расшифровывается только на конечном устройстве. Кроме того можно поставить таймер удаления определенной информации.\n\n-- Привязка к телефону.\nИ здесь не избежать привязки к телефону по умолчанию. А Desktop-версия просит подключения через телефон путем считывания qr-кода. Это значит, что вам нужен обязательно смартфон или виртуальная машина с android.\nПравда есть вариант использовать signal cli. Сторонний клиент, который использует либы от signal и позволяет зарегистрировать приложение и привязать к десктоп клиенту затем. Но смс все равно нужна.\n\n-- Частичная централизация.\nИмеется открытый исходный код сервера и при желании вы можете поднять свой собственный. К большому сожалению отсутствует федерация серверов и обычным юзерам signal в таком случае написать не удастся.\n\nSignal может пригодится, если вы шифрованно общаетесь о делах, которые не должны быть известны сторонним людям с теми кого вы знаете. Однако, если вы полный параноик или хотите полностью анонимный мессенджер - это не ваш вариант.\n\n#### 3) Tox - децентрализованный мессенджер.\n\n-- Полная децентрализация.\nВ отличии от прочих решений тут не нужны сервера. Клиенты напрямую сообщаются друг с другом. В связи с этим есть проблема. Ваш собеседник может узнать ваш ip. Рекомендуется использовать tox over tor.\n\n-- Анонимный идентификатор\nПри начальной инициализации создается анонимный идентификатор, который абсолютно не связан с вашей личностью.\n\n-- Шифрование end-to-end.\nВсе сообщения шифруются по умолчанию, однако криптография мессенджера еще не была должным образом проверена.\n\n-- Отсутствие оффлайн-общения\nНевозможно написать в оффлайн. Соединение происходит между конкретными юзерами и именно в этот момент можно получить сообщение. Есть некоторые клиенты, которые поддерживает псевдо-оффлайн с помощью отсроченной отправки после появления собеседника в сети, однако это совсем не то.\n\n-- Поддержка аудио,видео\nЕсть возможность в gui клиентах использования видео или аудио связи, также зашифрованной от и до. Однако ее стабильность пока внушает сомнения.\n\n-- Пересылка файлов\nЕсть возможность отправки файлов и даже шаринга экрана(лол) в некоторых клиентах.\n\nTox пригодится для анонимного быстрого общения в конкретный момент, но неудобен для постоянной переписки. Доступен весь исходный код.\n\n#### 4) Bitmessage - Bitcoin-мессенджер.\n\n-- Децентрализация\nИспользуется bitcoin-подобная сеть, с защитой от спама в виде Proof-of-Work и шифрованием по умолчанию. Никаких серверов, запустил и используй.\n\n-- Шифрование end-to-end.\nВсе сообщения шифруются по умолчанию с использованием публичных ключей юзеров. При этом сообщение циркулируют в сети заданное вами время и по прошествии не хранится.\n\n-- Скорость работы.\nПрисутствует некоторая отсрочка в получении сообщений. Для мгновенного общения немного не удобен. Больше смахивает на привычный email.\n\n-- Оффлайн-работа\nВы можете сделать бекап своего закрытого ключа. Не заходить в сеть какое-то время и получить сообщение после, когда снова появитесь в ней.\n\n-- Чаны\nНекоторое подобие групп для общения. Можно участвовать в переписке со всеми участниками чана.\n\nИмеет открытый исходный код. Подойдет для децентрализованной и безопасной замены email. К сожалению отсутствует возможность добавления файлов. Можно использовать base64, если так нужно. Хотя я бы туда еще до кучи gpg прикрутил.\n\n#### 5) Jabber - мессенджер с федеративной структурой\n\n-- Расширяемость\nСделан, как достаточно простой протокол и имеет большие возможности для дополнений и расширений.\n\n-- Федерация серверов\nЛюбой может поднять свой сервер jabber и взаимодействовать с любыми другими, если конечно нет явных запретов со стороны сервера-соседа и поддерживается те же настройки шифрования.\n\n-- Поддержка шифрования\nСуществует множество клиентов с поддержкой, таких проверенных протоколов шифрования, как - GPG, OTR, OMEMO.\n\n-- Доп. возможности\nОффлайн сообщения в том числе при использовании шифрования. Поддержка множества платформ. Большое кол-во плагинов для зоопарка клиентов\n\n-- Опенсорс\nВ основном опенсорс, как клиентов, так и серверов.\n\n-- Закрытая работа\nПри необходимости можно поднять свой сервер без связи с внешними. И общаться локально. В том числе в виде hidden-сервиса tor или i2p сетей. Тогда будет еще шифрование всего траффика до вашего сервера и закрытое общения лично для ваших собеседников.\n\nПодойдет для анонимного общения и постоянной работы. В том числе для организации групп локального общения, имеющих общие интересы и понимающих принципы безопасной работы.\n\nТакже существуют такие проекты, как briar, vuvuzela, threema, wire , но мне они пока не кажутся достойными заменами другим мессенджерам. По итогу в комментариях можем обсудить какие мессенджеры используете лично вы и для каких целей. Я же использую каждый из вышеперечисленных в определенных ситуациях и для определенных слоев населения, а также с определенным уровнем анонимности."
		},
		{
			"post_id": 5,
			"title": "К черту гугл!",
			"date_published": 1525193826,
			"body": "> Может, проклятие такое висит над людьми? Когда обещают порядок, жди хаоса , когда защищают жизнь , приходит смерть, когда защищают мораль люди превращаются в зверей. Стоит только сказать: я выше, я чище, я лучше и приходит расплата. Только те, кто не обещает чудес и не становится на пьедестал, приносят в мир добро.\n\nСегодня мы все привыкли использовать продукты глобальных корпораций. Гугл, Apple,Microsoft. Почти все когда-либо использовали их сервисы.\n\nИ если задуматься, то почти всегда, когда мы хотим узнать нечто новое, мы тянемся к поисковой строке. Гугл, Яндекс или пусть даже такие приватные компании, как Duckduckgo.\n\nОднако все это централизованные сервисы, которые по умолчанию знают о нас слишком много. Можно скрыть ip от них, сменить личность, спуфить данные ОС или использовать виртуальную машину, однако заниматься этим постоянно достаточно затратное занятие. Кроме того всегда привыкая, мы начинаем использовать какие-то постоянные паттерны, которые легко могут быть и отслеживаются, чтобы создать персонализированный профиль для рекламы, слежки и прочее.\n\nОднако решение существует.\n\n---\n\nИспользовать собственный поисковик с открытым исходным кодом и имя ему - Searx. В отличие от таких проектов, как Yacy - этот проект не создает свою базу данных и не парсит ресурсы. Это тоже вариант, однако несомненно скудный в плане кол-ва индексируемых ресурсов. Тягаться с гуглом в плане качества индекса достаточно трудно без необходимых ресурсов и масштабирования.\n\nSearx же работает, как посредник между вами и множеством поисковых систем. При этом каждый запрос он анонимизирует, удаляя куки, посылая чистый запрос без профайлинга и не используя скрипты.\n\nУстановка\nЕсть два варианта установки. Это развернуть docker контейнер, что достаточно просто и удобно. Или полноценный вариант. Подойдет в случае, если вы хотите модифицировать и расширять возможности движка. Или покопаться в настройках.\n\n1) Docker-вариант\n\n```\ngit clone github.com/asciimoo/searx.git\ncd searx\ndocker build -t searx .\ndocker run -d --name searx -p 8888:8888 searx\n```\n\nВсе можете запускать браузер на 127.0.0.1:8888\n\n2) Полноценный вариант\n\n```\nsudo apt-get install git build-essential libxslt-dev python-dev python-virtualenv python-babel zlib1g-dev libffi-dev libssl-dev\n\ngit clone github.com/asciimoo/searx.git\ncd searx\n./manage.sh update_packages или pip -r requirements.txt\npython searx/webapp.py\n```\n\nИногда некоторые пакеты могут не установиться через pip сразу. В таком случае попробуйте запустить и при наличии ошибки определенной либы загуглите полноценную установку ее в вашем дистрибутиве.\n\nТакже рекомендую отредактировать файл settings.yml и первым делом изменить там значение secret_key. И конечно нужно активировать нужные вам поисковики, заменив значение disabled на False. Затем поменяйте значение timeout на гораздо большее. Иначе у меня просто не успевало провести поиск и вылетала ошибка на большинстве поисковиков.\n\nКроме того можете пустить весь поиск через тор, используя proxychains или torsocks команды. Или модифицировав немного код, добавив pysocks на 127.0.0\\. 9050 модуль для всех соединений сокета.\n\nНо неудобство поиска через тор в том, что в таком случае некоторые поисковики отказываются работать без заполнения капчи. Поэтому я использую отдельную виртуальную машину для Searx, которая работает через анонимный впн. Если вы хотите каждый раз менять ip, то можно использовать proxychains со списком приватных прокси, которые не забанены у поисковиков и врубить random chain мод в конфиге.\n\n3) Модифицируем браузер.\nЗабыл сказать. Браузер нужен не простой, а ... модифицированный. Ведь если вы будете открывать каждый сайт в нем, то есть такие штуки, как трекинг на сайтах, куки, шрифты подгружаемые с глобальных компаний.\n\nОткрываем about:addons, если вы используете firefox/iceweasel и добавляем следующие плагины: noscript, adblock, decentralyes, https everywhere и Random agent spoofer.\n\nВ принципе этого достаточно noscript заблокирует скрипты, adblock уберет большинство вредной рекламы(в том числе от гугл), decentralyes поможет заменить подгружаемые cdn с гугл и прочих на локальные, https по умолчанию позволит вам использовать лишь шифрованные версии сайтов, а Random agent spoofer позволит менять автоматически раз в какое-то время user-agent, timezone,referer, fordwarding ip и прочее. Полазайте в их настройках для большей безопасности.\n\n#### Результат\n\nГотово. Компании больше не профайлят наш поисковый запрос, введенная поисковая строка не отправляется сразу на сервер скриптами и не создается фингерпринтинг в том числе скорости и способа набора. При необходимости можно создать несколько отдельных машин для Searx и искать определенную информацию через определенные анонимные соединения.\n\nВосхитительно, а теперь пойдемте гуглить в Searx, как купить немного урана в телеграмм."
		},
		{
			"post_id": 4,
			"title": "Некоторые советы по безопасному использованию Zeronet",
			"date_published": 1525118378.36,
			"body": "> Почему мне так хочется верить - вопреки всему?\n> Преступая законы, громя чужие компьютеры, воруя чужую \"интеллектуальную собственность\", не платя нищей родине налоги, не доверяя никому, кроме десятка друзей - и верить во что-то тёплое, чистое и вечное? В свободу, доброту и любовь?\n> Наверное, я просто из той породы, что иначе жить не умеет.\n\nСтоит начать с того, что безопасность и анонимность - это разные вещи, однако в данной статье будут рекомендации, как для первого, так и для второго.\n\nZeronet прекрасно справляется со своими задачами по p2p-распространению контента и построению децентрализованной сети. Но по умолчанию никак не защищает анонимность пользователей, пусть и теперь есть возможность использования tor при дополнительных настройках. Тут есть небольшая проблема. Если все работает и так, то обыватель не захочет напрягаться и настраивать тор. Как по мне нужно сделать эту функцию включенной по умолчанию, и добавить тор в поставку Zeronet.\n\nПоэтому стоит самим настроить несколько более анонимное использование сети.\n\n* * *\n\n### А зачем мне это?!\n\nТут могут быть возражения со стороны некоторых фанатиков следующей идеологии - \"Я ничем таким не занимаюсь и ничего запрещенного не храню\". Пожалуй это справедливо для стран в которых действует демократия и законы более-менее защищают свободы. В РФ и не только вы можете отхватить за что угодно. Случайно попадете под раздачу и найдут среди ваших файлов в ZN несколько картинок с лолями. Вообще позиция, которая ведет к уменьшению вашей личной безопасности - это дорога в ад. Сегодня вы доверяете властям и закону, завтра вы доживаете дни на зоне. Задумайтесь.\n\n### Рекомендации\n\nСначала кратко расскажу мой способ использования. Qubes OS работающая на Xen-гипервизоре и заточенная под безопасность. Шифрование LVM по умолчанию. Zeronet в отдельной виртуальной машине, сеть к которой она получает по следующей схеме. VPN gate (firewall only vpn) -> Tor gate (Whonix Gateway firewall only tor) -> Zeronet VM.\nZeronet и все его директории хранятся в контейнере Veracrypt и монтируются лишь в случае использования. Скорость работы и записи файлов не особо мешает работе. Все шустро пашет.\n\n1) Давайте по умолчанию будем использовать полнодисковое шифрование. Если вы не шарите в подобном и сейчас испуганно думаете, что же это за жесть такая. Еще и с дивана вставать придется. На самом деле в простых дистрибутивах Линукс, будь то например Ubuntu уже по умолчанию давно можно настроить такое шифрование путем пары кликов. LVM luks crypt, можно еще и папку юзера зашифровать. Конечно же разные пароли, длина и сложность которых должна превышать уровень вашей паранои. И храним их лишь в своей голове, не соседа. Не на бумажке лол.\n\nА где инструкции? Это банальная задача, надеюсь гуглить вы не разучились.\n\n2) Можно использовать tor-browser для Zeronet добавив в настройках сети исключение для локального адреса 127.0.0.1\\. Если же вы используете обычный браузер стоит однозначно добавить noscript плагин. Разрешить в нем только локальный адрес, а сторонние запретить. Может быть также и плагин, подменяющий referer. Потому, как открытые вами ссылки в Zeronet могут вести на сторонние сайты. А те будут получать полный урл ссылки, с которой вы пришли. Если не повезет там будет конфиденциальная информация.\n\nВедь, как мы помним в Zeronet используются get-запросы для доступа к сайтам. Вообще для Zeronet я бы рекомендовал модифицировать noscript или найти подобный плагин, который позволит для выбранных сайтов Zeronet лишь по полному урлу разрешать js. Потому, что не исключена возможность заражения вашей системы, через новый созданный сайт, специально для этой цели. Пока еще не проверял возможность этого, но может быть позже распишу.\n\n3) Если вы владелец сайта в Zeronet, то вам необходимо озаботиться о безопасном хранении ключа для управлении сайтом. Мой способ. В Qubes создана отдельная виртуальная машина, которая не имеет доступа к сети и в keepass хранит данную информацию. В кубах x-сервера у машин отдельные, поэтому буфер обмена переносим только специальной функцией при необходимости использования. В случае компрометации Zeronet машины ключи не пострадают.\n\nНо можете просто установить keepass, если у вас обычная система. От всего кроме кейлоггера поможет.\n\n4) Шифрование всех директорий Zeronet.\nПо умолчанию такого нет. Установите truecrypt/veracrypt. Создайте контейнер с внушительным паролем. Для параноиков можно добавить скрытый контейнер в основном. В таком случае один пароль будет открывать например видео с котиками, а в другой Zeronet с вашими очень опасными переписками, блогами и азиатским порно.\n\n5) Прикройте чем-нибудь ваш Zeronet траффик.\nБудь то впн или использование тор - это необходимо сделать. Опять же сейчас например в РФ уже приняты закон Яровой и прочее мракобесие. Весь траффик будет сохраняться на какое-то время. И пусть пока скрытосети законны, это легко может измениться. И тогда достаточно провайдеру достаточно просмотреть старые записи, чтобы найти всех тех, кого легко объявить экстремистами.\n\nИшь чего захотел Zeronet, ему подавай. Для тебя же сделали православный вк, маил сру и ван-дам(там-там) мессенджер.\n\n6) Придумайте себя заново.\nНезачем связывать анонимную сеть с вашей реальной личностью. Новый никнейм, контакты и прочее. Не говорите знакомым в реальной жизни о вашем увлечении. Не пересекайте эти жизни, не стоит это того. Помните удобство и безопасность находятся на разных полюсах.\n\n7) Почему нет подробных инструкций.\n\nГде картинки, пошаговые инструкции и вот это все. Объясняю.\nСамое уязвимое звено в компьютерной безопасности - это обычно человек. Поэтому если вы не понимаете часть статьи, то разберитесь. Если пока не можете, отложите и изучите позднее. Тупое исполнение пошаговых инструкций никак не приблизит вас к пониманию процессов. А если вы сможете сделать все самостоятельно, то это только начало. (Кроме того мне лень все расписывать, но тсс)\n\nУспешной и главное безопасной виртуальной жизни вам в Zeronet!"
		},
		{
			"post_id": 3,
			"title": "О данном блоге",
			"date_published": 1524955781.705,
			"body": "## Приветствую тебя путник! Оставайся здесь.\n\nВскоре будут написаны интересные статьи по безопасности и анонимности. По вопросам использования определенных инструментов в наше нелегкое время ужесточения цензуры в РФ. Обязательно поделюсь своим опытом и наблюдениями в процессе изучения различных аспектов p2p-сетей. Также возможны внезапные порывы кодинга по поводу и без.\n\n_Глубина-глубина я не твой_"
		},
		{
			"post_id": 1,
			"title": "Deep vvod",
			"date_published": 1524876793,
			"body": "Одиночество - изнанка свободы"
		}
	]
}