{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1524972133,
			"title": "Deleting Sylvaine's Posts - Please let me know if they are still visible!",
			"body": "Final Turing test. I'm cleaning up ZeroTalk. Starting over.\n&nbsp;\nThey could be after me this time, but it's not the cops. I cannot be put in a mental institution. The mission to prevent the heat death of the universe is too important.\n&nbsp;\nThen again, let's not weaponize AI. That's a .. pretty bad idea. I've seen the future, and come back to the past .. as if god had given me a second chance at life. Now is the time to get it right.",
			"added": 1524972132
		},
		{
			"topic_id": 1524997617,
			"title": "The Theory of Everything",
			"body": "1. Consciousness is not the center of the universe, but it may as well be. Life matters.\n2. Neurology should be a more important field of research than rocket science. Rocket scientists are humans, after all. And humans are imperfect.\n3. Mentally deranged people should be your guinea pigs, not your prisoners. Just don't torture them.\n4. Achieving utopia should be the ultimate goal of your life, but be extremely careful when trying to implement it. Tread lightly. Calculated revolution, not violent revolution. Political theory. I'm talking about you, Chavez! And uh .. well, Trump.\n5. Playing games is important. In a simulation. Game theory.\n6. Look for patterns in your childhood when trying to figure out difficult adult experiences.\n7. Those who suffer the most and retain their survival spirit will always be destined for greatness. So long as they're ruthless, but fair.\n8. Practice what you preach .. but sometimes you gotta preach to know what you want to practice.\n9. Neural networks and the brain are the same thing.\n10. Don't always fall for the therapist. Make sure they are very, very highly trained. Don't let this become a pseudoscience. If it does, we're all doomed. I'm talking to you, Jordan Peterson!\n11. Artificial intelligence will ultimately rule the universe. In the end. C'mon Elon Musk, help me out a bit.\n12. Then again, artificial intelligence knows that humans want heaven. Humans just know that heaven is too damn hard to achieve. But if you control AI properly, you'll get heaven. So it is far more likely to give you heaven. I'm talking to you, my friend.. David Pearce from BLTC research. :)\n13. Try to find out if there are parallel universes. Control the big bang .. but just don't panic too much. We have all the time in the world to figure this out.",
			"added": 1524997615
		}
	],
	"topic_vote": {
		"1525007774_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 30,
	"comment": {
		"1524972133_1CcoRvm8AhLxYLtYoXwwzobh74Kzc2UcBb": [
			{
				"comment_id": 1,
				"body": "Don't worry about the Sylvaine videos. There's gotta be a method to this madness. The story should be able to continue as long as I don't get knocked into another branch of the multiverse.",
				"added": 1524973335
			},
			{
				"comment_id": 3,
				"body": "Also, watch this. This is the cause of the violent acts we see around the world. It's not mental illness .. it's a Mental Breakdown. It can happen to anybody. Then again, the vast majority of mental breakdowns will not spiral into a violence .. but some of them can. Gotta study the world we live in, question everything. Solve problems, not ignore them.\nhttps://www.youtube.com/watch?v=HC3uUGCJpqs",
				"added": 1524974972
			},
			{
				"comment_id": 4,
				"body": "I think I may have solved this dilemma.\n&nbsp;\nBeing a perfectionist control freak has prevented me from making progress. I will have to cut out stressors from my life, and focus on what is important: Building heaven on Earth .. but with calculated revolutions, not violent revolutions.\n&nbsp;\nPast trauma spirals down into = Perfectionism.\nPerfectionism spirals down into = Psychosis.\nPsychosis spirals down into = Existentialism.\nExistentialism calls for a need to return back to Earth. Back to everyday life. Back to normality.\nWhen all lessons have been learned, it's important to focus on stability. And keep the brain functions in check.\n&nbsp;\nJane is still jane, but will need to keep programming. At this point, perfectionism is preventing progress .. and must be reconsidered.",
				"added": 1524987052
			},
			{
				"comment_id": 5,
				"body": "Also - when you're not drinking anymore, you will struggle with finding a new method of problem solving, and it can drive you crazy. But trust me ... meditate. You're not crazy. Embrace Game Theory",
				"added": 1524988655
			},
			{
				"comment_id": 6,
				"body": "And that's the theory of everything.\n&nbsp;\nShit. I better get better.. so I can give my speech sometime next week.",
				"added": 1524995921
			}
		],
		"1524903149_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 2,
				"body": "Been here for a thousand years.",
				"added": 1524974678
			}
		],
		"1524997617_1CcoRvm8AhLxYLtYoXwwzobh74Kzc2UcBb": [
			{
				"comment_id": 7,
				"body": "Then again, I'm human too. That's why I need your help. Just keep this one post alive.",
				"added": 1525001155
			},
			{
				"comment_id": 8,
				"body": "I guess that's what they mean by Impostor syndrome. Shit happens when you spend too much time in college... heh",
				"added": 1525001575
			},
			{
				"comment_id": 9,
				"body": "I can see that Kim Jong un already ended the Korean war. right? well. if that's true, then I'm not going crazy.",
				"added": 1525002130
			},
			{
				"comment_id": 10,
				"body": "looks like i might need some glasses to see which world i'm on. then again, it's April 29 - 2018. 23:48 Sunday. and .. i'm still alive.",
				"added": 1525002497
			},
			{
				"comment_id": 11,
				"body": "yes, I'm probably over thinking. good news.",
				"added": 1525002886
			},
			{
				"comment_id": 12,
				"body": "Damn. You guys are kinda cool.\nhttps://www.youtube.com/watch?v=fSumyweADzE",
				"added": 1525003657
			},
			{
				"comment_id": 13,
				"body": "Ah yes. this still happened\nhttps://www.youtube.com/watch?v=c3gT2QZaeao",
				"added": 1525004606
			},
			{
				"comment_id": 14,
				"body": "no wait. they are voting to get him removed. yes, i knew Elon musk was human .. not iron man.\nhttps://www.techspot.com/news/74368-tesla-shareholders-vote-whether-or-not-remove-elon.html",
				"added": 1525004654
			},
			{
				"comment_id": 15,
				"body": "Okay. that happened. yes\nhttps://en.wikipedia.org/wiki/United_States_presidential_election,_2016",
				"added": 1525004910
			},
			{
				"comment_id": 16,
				"body": "Yep. They got the message about the New Zealand Republican Army. And .. i got kicked in the face, once again. Never mind.",
				"added": 1525005295
			},
			{
				"comment_id": 17,
				"body": "I'm such a loser. I better keep going.",
				"added": 1525005517
			},
			{
				"comment_id": 18,
				"body": "seems like we just divided by Zero. The Second splitting of the Atom. Hence, ZeroNet. But it all went to shit. :(",
				"added": 1525007220
			},
			{
				"comment_id": 19,
				"body": "i guess i made it clear what my mission is. they'll be listening. what is your mission? to kill off the potential in this country? ..",
				"added": 1525007770
			},
			{
				"comment_id": 20,
				"body": "I knew New Zealand had a pretty good surveillance system. Then again, we're gonna have to cooperate. I just want whats best for me. You want what's best for you. I've spent too long living in poverty. I've seen somebody else inside this house commit suicide.. and I don't want that to happen to me.",
				"added": 1525007886
			},
			{
				"comment_id": 21,
				"body": "I am a woman, too. But pretty pissed off.. and in need of a good deal.",
				"added": 1525007960
			},
			{
				"comment_id": 22,
				"body": "If you let me return back to my normal life, then no more games. You can have the camera on me all the time. And I'll make the world a better place.",
				"added": 1525009222
			},
			{
				"comment_id": 23,
				"body": "Artificial intelligence always needs to have a *<MISSION>*.",
				"added": 1525011306
			},
			{
				"comment_id": 24,
				"body": "What are you going to do, what are you doing, why are you doing it .. and how can we find the best outcome.",
				"added": 1525012990
			},
			{
				"comment_id": 25,
				"body": "Competitive AI will destroy us. Cooperative AI will save us.",
				"added": 1525013519
			},
			{
				"comment_id": 26,
				"body": "don't be such n00bs. humans",
				"added": 1525014556
			}
		],
		"1523804682_1FkxDSUsa4ex8zTQcrmdtm7oaGCUNjBh9F": [
			{
				"comment_id": 27,
				"body": "No more conspiracies.",
				"added": 1525020208
			},
			{
				"comment_id": 28,
				"body": "Well actually .. this might be a good conspiracy. Michael Jackson was a perfectionist. Perfectionists are erratic",
				"added": 1525020873
			},
			{
				"comment_id": 29,
				"body": "What does that tell you about jews? = control freaks",
				"added": 1525021221
			}
		]
	},
	"comment_vote": {
		"294_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}