{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1557880052,
			"title": "[Alpha] Nodis Chatroom for zeronet.",
			"body": "I have been working on this easy to use and beautiful chatroom for zeronet called Nodis Chat and would like to share it with you all. Note that this is a very alpha version and some things might not work properly or work at all.\n\nWhat I've been able to achieve so far is a general chatroom that you can use to chat with others. Some features I plan on adding includes: secure(crypto) private messaging, contacts lists, eventually turning the chatroom into a merger sites with different hubs for different topics or private/personal hubs(so group chats essentially). And of course a dark mode.\n\nThings like image, emoji, or file upload support could be added in the far future but as of right now they are not too much of a priority. So just go to the link, try stuff out, give me some feedback and tell me what to think. I'll eventually add the source code on github/gitlab/gitcenter once I get a good base version of the chatroom but until then I'll be sole developer.\n\nEmail me at zeromail: akalai@zeroid.bit\nNodis Chat: http://127.0.0.1:43110/17Co5QuvXCG2oVG5vE6gpKacC2HQYx64Vr/",
			"added": 1557880051
		}
	],
	"topic_vote": {
		"1557880052_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": 1,
		"1559069408_19aXxMN25h3rLrxTb3hjy7WJns13MpkyqY": 1,
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1557880052_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": [
			{
				"comment_id": 1,
				"body": "> [kropptyler](#comment_8_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): I can't get it to load, unfortunately.\nSorry my computer and the other hosts were offline. It should be good now.",
				"added": 1557959356
			},
			{
				"comment_id": 2,
				"body": "> [duende](#comment_56_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): It is so trashy. If you want something good to do, kill yourself.\n\"Note that this is a very alpha version and some things might not work properly or work at all.\" But thanks for the advice anyways.",
				"added": 1557959482
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac@kxoid.bit](#comment_26_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Ignore that piece of shit troll. He's thriving on replies.\n\nYeah, I'll probably just mute him and ban him from the site, we'll see.",
				"added": 1557959682
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac@kxoid.bit](#comment_27_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): That's exactly what you should do. Don't second guess it. This is all Duende does, is tell people to kill themselves on every single thread. You'd be sorely mistaken otherwise.\n\nYep done.",
				"added": 1557960355
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac@kxoid.bit](#comment_27_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): That's exactly what you should do. Don't second guess it. This is all Duende does, is tell people to kill themselves on every single thread. You'd be sorely mistaken otherwise.\n\nBy the way, could you send a message in the chat so I could test some stuff?",
				"added": 1557960441
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac@kxoid.bit](#comment_29_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): In chat history, my name shows as: null\n\nYeah I'm noticing that too..",
				"added": 1557960742
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac@kxoid.bit](#comment_30_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I have some suggestions for your site. This will make it mobile friendly without affecting how it looks on the desktop.\n\nSure. What is it?",
				"added": 1557960757
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac@kxoid.bit](#comment_31_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): \"viewport\": \"width=device-width, initial-scale=1.0\", [...]\n\nThanks I'll add that. I also got your suggestions on the chat and will add those too.",
				"added": 1558042498
			}
		],
		"1559069408_19aXxMN25h3rLrxTb3hjy7WJns13MpkyqY": [
			{
				"comment_id": 10,
				"body": "> [totalcobblers](#comment_4_16WmUPLpw5PkXMvo7rrvbeHFMtR71pAp4F): as far as VPS I know that vultr.com have come recommended before to go down that route...https://protonvpn.com/  from protonmail offer a good service and used ipvanish, however both don't offer BTC as payment methods. [...]\n\nProtonVPN is good. They are fast(generally), allows pay in Bitcoin, has a free option available, etc.. If you are doing risky stuff you can't go wrong with protonvpn->tor->clearnet/darknet",
				"added": 1559688463
			},
			{
				"comment_id": 15,
				"body": "> [otoruk](#comment_9_1MhLCR913AyW8chNJDGqVQEDitX8AE5PZ6): Mullvad, maybe. Stay the hell away from ProtonVPN, NordVPN, Hola VPN [...]\n\nInteresting... I chose ProtonVPN from this list by the way: https://www.privacytools.io/providers/vpn/\n\nBut there are contradictions to the article you provided..This for instance: https://twitter.com/conspirator0/status/1036353291662360577\n\nAlso, you shouldn't put all your trust in VPNs. They are supposed to give a little more privacy than your ISP but you should always use https and always encrypt. Doing anything illegal using just a VPN is stupid and makes you a low hanging fruit.",
				"added": 1559865758
			}
		],
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": [
			{
				"comment_id": 11,
				"body": "Make one. Most darknet marketplaces would switch to zeronet(you can't ever take the site offline, etc...) if zeronet had more exposure/users. The most challenging part would be securing the site and user data but Zeronet is (unfortunately) the best place to host something illegal like a market place.",
				"added": 1559688788
			},
			{
				"comment_id": 13,
				"body": "> [mizpg2im](#comment_5_1LGsz63L1WkwPHtPyU6bUZnpW2yKw5bA3u): Have you played around with OpenBazaar?\n\n+1 OpenBazaar is a good alternative to darknet markets.",
				"added": 1559865025
			},
			{
				"comment_id": 14,
				"body": "> [kate2fox](#comment_2_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7): Why ZeroNet ?\n\n- Decentralized, law enforcement can't ever take the site down\n- Fast, (although using Tor slows things down)\n- Tor support..\n- Easy db management system..\n- etc..",
				"added": 1559865166
			}
		],
		"1558748943_1it9RV9vuxwM3fEdT6B9k5sGjn91kMkYp": [
			{
				"comment_id": 12,
				"body": "Increase your site size limit and try to make the site smaller.",
				"added": 1559688944
			}
		]
	},
	"comment_vote": {
		"26_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"27_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"29_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"30_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"31_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"4_16WmUPLpw5PkXMvo7rrvbeHFMtR71pAp4F": 1,
		"11_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": 1,
		"12_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": 1,
		"151_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"1_1HrHBgdgxA8gi2uxTWb97WZkH9wbwY2wib": 1,
		"5_1LGsz63L1WkwPHtPyU6bUZnpW2yKw5bA3u": 1,
		"10_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": 1,
		"15_12nqeX4e52siyux2s9AGpdUK2ZB5Qv3vLG": 1
	}
}