{
	"next_topic_id": 24,
	"topic": [
		{
			"topic_id": 1519191699,
			"title": "Ubuntu tor-browser with error 'Permission denied: /var/run/tor/control.authcookie'",
			"body": "Of course I did # usermod -a -G debian-tor [my account name]\n\nHelp.",
			"added": 1519191698
		},
		{
			"topic_id": 1519403325,
			"title": "command line site-sorting?",
			"body": "Is there any way to sort directories of sites on the bash command line? \n\nAnd can I filter individual files to delete on command line?\n\nThank you.",
			"added": 1519403323
		},
		{
			"topic_id": 1519463831,
			"title": "How to apply local peer discovery feature to my zeronet?",
			"body": "Hi, http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:126:New+version:+0.6.2 shows how successfully he accomplished the local peer discovery feature. \n\nI also want to apply this feature. Please tell me how. \n\nPS: I have many computers connected to my local network 192.168.0.x, and tried installing zeronet to 2 PCs but they seem not to recognize each other by default.",
			"added": 1519463827
		},
		{
			"topic_id": 1519470731,
			"title": "Had to disable tor to make 192.168.0.x:43110 to work with internet.",
			"body": "http://192.168.0.3:43110 from the browser of 192.168.0.220 worked OK following this instruction: https://zeronet.readthedocs.io/en/latest/faq/#is-it-possible-to-install-zeronet-to-a-remote-machine\n\nBut I realized soon that Zeronet doesn't update and find peers at all.\n\nAfter disabling tor with the menu on the upper right corner of the ZeroHello page and restart the service, it works fine.\n\nHow can I remote-zeronet under tor protection?",
			"added": 1519470726
		},
		{
			"topic_id": 1519567347,
			"title": "What is the sturcture of ZeroTalk BBS?",
			"body": "Today I realized that there're several different types of posts exist in ZeroTalk BBS.\n\nRegarding the icon image in front of the title of each post varies such as a compass, a speech balloon, or multiple layered speech balloons. And some have a dot in front of the icon, others don't.\n\nSome posts seem to have multiple posts inside itself once opened.\n\nIs there any tutorial page for this system?",
			"added": 1519567341
		},
		{
			"topic_id": 1519568652,
			"title": "ZeroTalk manual any where??",
			"body": "I want to know the hidden(?) features of ZeroTalk such as..\n\nhttp://192.168.0.38:43110/Talk.ZeroNetwork.bit/?Topic:1519567347_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd/What+is+the+sturcture+of+ZeroTalk+BBS\n\n(Yeah, I don't know how to make simple link ;(\n\ngraying texts in the middle of the phrase such as..\n\n> [nofish](#comment_255_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Based on that for me it's looks like something is blocking UDP port 1544 on 192.168.0.12 machine.\n> Here is a script that I using to test broadcast on my machines:\n> https://gist.githubusercontent.com/HelloZeroNet/f19732467b731cf792466687f84c2aad/raw/8f5be4d0a3a594ef391bad6b48b41101cbdf22ef/test_broadcast_all.py\n> if you can please test it as:\n> \n> Start python test_broadcast_all.py on all machines\n> Enter eg.: echo:hello from desktop\n> You should see Echo request from ('192.168.x.xx', 61317): echo:hello from desktop on all local machines where the script is running\n> And get Message from ('192.168.x.xx', 11112): Your message was echo:hello from desktop response with the remote machines ip address\n> Enter q to quit\n\n(Ooops, it doesn't display the grayed command line texts on the above once I quoted it in my pose)\n\nWhere is the manual?",
			"added": 1519568645
		},
		{
			"topic_id": 1519616423,
			"title": "How to be notified when someone commented on my post?",
			"body": "comments which quoted my comments appear in the ZeroHello screen, \nbut comments added to my posts seem not to appear. \n\nPlz advise.",
			"added": 1519616415
		},
		{
			"topic_id": 1519632694,
			"title": "How to save user ID?",
			"body": "For 6 days, I've created several IDs, but will not abandon for a while. \n\nWhich files do I have to keep and where to move to keep the created IDs to transfer to the new installed ZeroNet?\n\nAt the moment, I'm keeping entire /data contents for each ID.",
			"added": 1519632685
		},
		{
			"topic_id": 1519797620,
			"title": "How to change the default site to anything but HelloZero?",
			"body": "How to change the default site to something not HelloZero?",
			"added": 1519797606
		},
		{
			"topic_id": 1519801465,
			"title": "How to make a new ID offline?",
			"body": "How to make a new ID offline? Or, under local network?",
			"added": 1519801450
		},
		{
			"topic_id": 1519804000,
			"title": "[SHOW IMAGE] loading takes too long time in ZeroMe",
			"body": "Why? No one clicked [show image] in that site that no one has the image file except the owner?\n\nSo do I have to wait till the owner gets online?",
			"added": 1519803984
		},
		{
			"topic_id": 1519916432,
			"title": "Can people send email to zerouser@zeroid.bit without ZeroMail?",
			"body": "Or vice versa?",
			"added": 1519916415
		},
		{
			"topic_id": 1519994634,
			"title": "User Nick vs Public key in ZeroID: 1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz",
			"body": "`users.json` and `users_archive.json` have nick & public-key combination list. \n\nQuestion#1: Why `users_archive.jsn` does't have corresponding public-key but something like `\"@9,17UkpN\"`?\n\nQuestion#2: Large letters in some user nicks are all ignored (de-capitalized). How to get the real user nick of the corresponding public-key?",
			"added": 1519994616
		},
		{
			"topic_id": 1519995841,
			"title": "For your privacy switch to Tor browser and start a new profile by renaming the data directory.",
			"body": "When I chose [Enable always tor mode] the following msg appeared: \n\n`Tor always mode enabled, please restart your ZeroNet to make it work.\nFor your privacy switch to Tor browser and start a new profile by renaming the data directory.`\n\nWhy?\n\nThe second line of the msg seems inserted today, seem not?",
			"added": 1519995822
		},
		{
			"topic_id": 1519996880,
			"title": "A suggestion for ZeroTalk site",
			"body": "You don't have plan to fix the new post to turn the `Following` on by default? \n\nCurrently, turned off by default, so that the author has no way to get feedbacks for that post without searching the post manually.",
			"added": 1519996860
		},
		{
			"topic_id": 1520000055,
			"title": "How to decode  \"date_added\": value in case of zerowiki & thunderwave data.json?",
			"body": "Except the above 2 sites, `data.json` has \"date_added\": value which can be easily converted to the conventional date format by `$ date -d \"@[value]\"; `.\n\nBut the above 2 sites have extra 3 digits. \nOf course I can decode it into meaningful date format by cutting off those 3 digits, but why did you make the date format differently in those sites?",
			"added": 1520000034
		},
		{
			"topic_id": 1520002071,
			"title": "After cloning a site and signing it, contents.json doesn't update \"admin\".",
			"body": "I tried to clone and sign the site, and now every peer can visit, but looking at `content.json` it still has `\"admin\": \"nofish\"` , not `\"admin\": \"test20180221\"`. Why?",
			"added": 1520002049
		},
		{
			"topic_id": 1520002319,
			"title": "How to sign in with my ZeroID in the proxy zeronets?",
			"body": "How to sign in with my ZeroID in the proxy zeronets?",
			"added": 1520002296
		}
	],
	"topic_vote": {
		"1519191699_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519403325_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519463831_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519470731_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519476041_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": 1,
		"1519567347_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519616423_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519632694_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519690191_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519801465_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519797620_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519916432_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519804000_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519994634_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519793349_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519995841_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1520000055_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1520002319_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1519996880_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"1520299122_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1
	},
	"next_comment_id": 99,
	"comment": {
		"1519191699_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 1,
				"body": "Solved. Re-logged in. :)",
				"added": 1519205812
			}
		],
		"1519444758_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 2,
				"body": "I hope you make world more beautiful place.",
				"added": 1519449477
			}
		],
		"1519429117_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 3,
				"body": "Government has to give away a certain amount of money for a living of the people, since jobs will be very scarce in the near future.",
				"added": 1519450804
			}
		],
		"1519463831_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 4,
				"body": "> [version](#comment_29_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4): Just update to the latest reversion, it will work like you want.\n\nThanks a lot~! I'll try it.",
				"added": 1519470672
			},
			{
				"comment_id": 6,
				"body": "> [version](#comment_29_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4): Just update to the latest reversion, it will work like you want.\n\nI have 2 PCs. #1 is on 192.168.0.11 and #2 is on 192.168.0.12.\n\nI installed Version: 0.6.2 r3337, Python 2.7.11 ZeroNet on #1 remotely so that I could run http://192.168.0.11:43110 from #2. Yes, it works OK. \n\nThen, I turned of the AP's internet connection, and installed the the same version ZeroNet on #2 which is my local PC. \n\nAs I have updated many sites including ZeroTalk, I tried to open ZeroTalk on #2 only to fail. \n\n[NO PEER FOUND]\n\nWhat's the problem?",
				"added": 1519472098
			}
		],
		"1519466824_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X": [
			{
				"comment_id": 5,
				"body": "inviting is like taking the responsibility for invitee's future behavior.\n\nI don't know how the policy changed nowadays, but when I was to sign up I just submitted an assay why I need it and a week later they accepted.",
				"added": 1519470927
			}
		],
		"1519470731_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 7,
				"body": "> [ssdifnskdjfnsdjk](#comment_119_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): In the topic title you want to disable tor and then you are asking how to use zeronet under tor protection? [...]\n\nIn the topic title I wrote \"Had to\" disable tor, not \"want to\" disable. I had to since if I didn't I couldn't make 192.168.0.x:43110 worked, not 127.0.0.1:43110. \n\nWhen I disabled tor, http://192.168.0.x:43110 worked.\nWhen I enabled tor, http://192.168.0.x:43110 didn't work.",
				"added": 1519472930
			},
			{
				"comment_id": 8,
				"body": "> [nofish](#comment_1127_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): If you enable Tor always mode, then your client will only accept connections from the Tor network. So local peer discovery and local connections will not work.\n\nThank you for your advice. \n\nIs there a way to set an exclusion rule for the connections from 192.168.x.x in tor configuration?",
				"added": 1519488418
			},
			{
				"comment_id": 9,
				"body": "> [nofish](#comment_1127_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): If you enable Tor always mode, then your client will only accept connections from the Tor network. So local peer discovery and local connections will not work.\n\nRe: local peer discovery, in my case I have TOR:AVAILABLE & STATUS: OK (10 onions running) indicated on the top of the screen. Why it doesn't find any peer in my local network?",
				"added": 1519488534
			}
		],
		"1519559317_1KG6UMLtakzi7eDDkqCb27nYxa1VGMDcsP": [
			{
				"comment_id": 10,
				"body": "Man.. we have EMP switch :p",
				"added": 1519568209
			}
		],
		"1519561412_1PqYB6Rm8CCNtcbZSjLbKTEM2Cey2qkxXc": [
			{
				"comment_id": 11,
				"body": "wget?",
				"added": 1519568337
			}
		],
		"1516279757_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 12,
				"body": "This is just an extended strategic action. \n\n'Unite a country behind an imagined external enemy to distract from domestic problems. As Russia’s economy reels under the impact of Western sanctions imposed after Putin’s 2014 annexation of Crimea, creating a myth of perpetual war has become a mainstay of the regime’s survival.' -- Newsweek Dec 22 2017\n\nPutin is enjoying to call the needle a stick. (exaggerating)",
				"added": 1519615834
			},
			{
				"comment_id": 13,
				"body": "> [balancer73](#comment_39_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1519616295_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Russia+s+own+Internet\n\nMore over, balancer73, Westerns, China and Russia all have flaws in their systems, but the main and critical flaws in Russia-china communist countries are the lack of freedom of expression and religion. \n\nAdditionally, they like too much killing people against their regime, and no one can mention it again not like the cases in Westerns where they also sometimes kill people against their profit, but people can talk about it freely.",
				"added": 1519617074
			}
		],
		"1519567347_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 14,
				"body": "> [helium](#comment_278_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): I do not know, but another ZeroTalk related thread that has some links resides athttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1519568652_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd/ZeroTalk+manual+any+where\n\nthanks a lot!",
				"added": 1519617262
			},
			{
				"comment_id": 15,
				"body": "> [krixano](#comment_317_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Compass - has a link in the body (typically at the end). The link is shown just below the one line of text shown.Speech balloon - Regular topic.Multi-layered speech balloon - A group of topics.Dot - people have recently commented or upvoted.\n\nthank u for ur reply. How to make a group of topics?",
				"added": 1519617292
			},
			{
				"comment_id": 19,
				"body": "> [krixano](#comment_322_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I'm not sure that you can. I think they are managed by @Nofish: himself by coding it in. I'm not sure about this.\n\nSo, @nofish is the creator of ZeroNet? And he is the one who attended TED? Tamas Kocsis is him?",
				"added": 1519618105
			},
			{
				"comment_id": 20,
				"body": "> [krixano](#comment_323_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Yes. He also created ZeroMe, ZeroTalk, ZeroUp, ZeroBoard (don't use this, it's very outdated), and ZeroBlog (and perhaps some other zites).\n\nWonderful. I actually had planned making this kind of service since several years ago like many others also had.\n\nBut he did it. ZeroNet is one of the biggest land mark in the internet history, I bet. \n\nThanks for your kind reply :)",
				"added": 1519618784
			},
			{
				"comment_id": 21,
				"body": "> [krixano](#comment_324_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): There's also a lot of competing zites to these official ones:ZeroMail - no competerZeroUp - IFS (all files), KopyKate Big (videos), ZeroMusic, ZeroLSTN (music)ZeroBlog - ZeroMedium (this is mine)ZeroChat - ThunderWaveZeroSites - Important Zites (this is also mine), Search Engines (Kaffiene, EulerFinder, RVRE, Zirch)ZeroTalk - ZeroVoat\n\nBut they're all using @nofish -made script set and based on it, aren't they?\n\nIs there any independent script set like ZeroBundle other than ZeroBundle? \n(What do u call ZeroBundle, anyway? :(",
				"added": 1519619340
			},
			{
				"comment_id": 22,
				"body": "> [krixano](#comment_325_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I'm not sure what you are meaning. All of those competing zites use their own code created entirely by their respective developer.\n\nI'm not a coder so that I don't understand the ZeroNet coding system, \nbut IMHO there must be some kinds of base code which must be kept under careful management to keep the rule of networking and sharing and find peers etc. And I think that job must be done by @nofish. \n\nIf I'm wrong, plz correct.",
				"added": 1519619593
			},
			{
				"comment_id": 23,
				"body": "> [krixano](#comment_326_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): That's the client. Zites talk to the client via an API called ZeroFrame. If I wanted to tell the client to  get/query something from a database, I would write something like: zeroframe.cmd(\"dbquery\", [query_string]); and it will give that back. [...]\n\nCan I regard it that Zites over zeroframe are like kinds of variety of torrent clients based on a single core mechanism created or introduced by a man or a group in the beginning? And each client has its own features programmed by different programmers like you? \n\nQuestion: For example, if u download ZeroBundle from github and open 127.0.0.1:43110, ZeroHello pops up. What if someone changes it to pop up ZeroMedium instead? Or what if someone changes the port number to 44444 instead? Can these works also be regarded as a part of the programming like ZeroMedium?",
				"added": 1519621080
			},
			{
				"comment_id": 24,
				"body": "> [krixano](#comment_326_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): That's the client. Zites talk to the client via an API called ZeroFrame. If I wanted to tell the client to  get/query something from a database, I would write something like: zeroframe.cmd(\"dbquery\", [sql_query_string]); and it will give that back. [...]\n\nQuestion#2: Would it be possible to make a code, as u do for ZeroMedium, to leak the data out of /ZeroBundle/ZeroNet/ range in the server? Since in my case I run the ZeroNet by $ ./ZeroNet.sh under my general account id, it has a possibility to grip the data in the other directories in the server.",
				"added": 1519621324
			},
			{
				"comment_id": 25,
				"body": "(You know what, I began reading the book 'Python 3 the Hard Way' since played with ZeroNet :(",
				"added": 1519621441
			},
			{
				"comment_id": 26,
				"body": "> [krixano](#comment_328_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Few more things. ZeroNet also has ways for programmers to determine how their databases should look and how data is stored and seeded, etc. JSON files are used, and each user has their own folder under the zite's folder structure where their data is stored in a data.json file. This is so these files can be seeded without conflicts. Then, the ZeroNet client aggregates this into a sqlite database that is not seeded. When zite's ask ZeroNet for data from the database by giving it an SQL query, the client passes the query on to sqlite and gives back the result.\n\nSo , if I need to fix a certain feature in ZeroMedium, I have to ask you not other guys else, right?\n\nAnd, all the files under /data/1asdfjsfsd[ZeroMedium]/ are all created by you except the contents stored in the database which are made by people by posting or commenting in ZeroMedium?",
				"added": 1519622156
			},
			{
				"comment_id": 27,
				"body": "> [krixano](#comment_329_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Yes (kinda depends. If it's a problem with just ZeroMedium, then yes) and Yes. Except for one 150 line file that provides access to the ZeroFrame API via JavaScript - written by Nofish And of course any libraries used by the zite that weren't written by the zite owner. [...]\n\nIt looks like @nofish built a kind of Apache server and you built a kind of web sites on it. \n\nI think with this scenario, others than @nofish also could build a kind of APIs needed by site builders, could they? \nOf course the security matters and so fourth should be confirmed by responsible persons like @nofish, right?",
				"added": 1519623108
			},
			{
				"comment_id": 28,
				"body": "> [krixano](#comment_329_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Here's a link to the ZeroFrame API reference: /17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe/site_development/zeroframe_api_reference/\n\nThank u for ur kind explaination! \n\nI'm looking at /data/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/js/all.js , \nbut it seems like he encrypted the script, right? \nDid u encrypt ur zite javascript, too?\n\nAnyway, does it mean that zite programming is nothing to do with python but javascript and APIs provided by @nofish??",
				"added": 1519623377
			},
			{
				"comment_id": 29,
				"body": "> [krixano](#comment_332_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): It's not encrypted. The top part is just from a library (jquery and a few others). Many of the scripts were just made smaller by removing spaces and new lines. He uses coffescript with automatically bundles everything too.\n\nOh, u're right. I browsed only the top part and closed :p\n\nI learned so much today from u!",
				"added": 1519623850
			},
			{
				"comment_id": 31,
				"body": "> [krixano](#comment_333_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I have a few tutorials on my ZeroNet Dev Center zite which you can use to learn some of the aspects of zite development and how ZeroNet works. I have also created ZeroExchange which is a stackexchange/stackoverflow alternative for ZeroNet (but not as many features of course). I've also created Important Zites which I have just released with many useful features for exploring different zites. It's like ZeroSites, but with search, bookmarks, tags, better categories, better design (imo), and other useful features. Sadly there isn't very many zites on there yet, but give it a while because I just released the zite like a week (or less) ago. [...]\n\nThank you~~!!",
				"added": 1519627528
			}
		],
		"1519568652_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 16,
				"body": "sdf> [nofish](#comment_1131_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Most of ZeroNet sites using markdown as formatting: https://github.com/adam-p/markdown-here/wiki/Markdown-Here-Cheatsheet\n\nthank u! i'll check it :)",
				"added": 1519617500
			},
			{
				"comment_id": 17,
				"body": "> [ssdifnskdjfnsdjk](#comment_122_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): When you move the mouse cursor over your post body here, there is a grey pencil on the left, you click it and then on the bottom should be an \"?\" icon which shows how to format Zerotalk posts.\n\nWow, there it is! But can't understand why they hid it there? Can't find the same [?] button in the first posting, but in the editing the posted post, can I?",
				"added": 1519617604
			},
			{
				"comment_id": 18,
				"body": "> [helium](#comment_277_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): I do not know about the ZeroTalk manual, but its upstream source seems to reside athttps://github.com/HelloZeroNet/ZeroTalk [...]\n\nAlways thank u for ur kind help :)",
				"added": 1519617634
			}
		],
		"1519616423_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 30,
				"body": "> [krixano](#comment_321_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): If you are talking about ZeroTalk, Press the \"Follow in Newsfeed\" button in top right of topic.\n\nThanks again!! :)\n\nBut it's a little bit off the fairness considering the comments notification which is done without any user checking :)",
				"added": 1519627260
			},
			{
				"comment_id": 33,
				"body": "> [krixano](#comment_334_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): but for some reason when you post a topic, the following doesn't get turned on by default unless you comment of the topic\n\nIt must be easy to fix this feature, right? :)",
				"added": 1519627874
			},
			{
				"comment_id": 34,
				"body": "> [krixano](#comment_334_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): \n\nWhat would happen if I change the ZeroTalk zite code in my server directory??",
				"added": 1519627995
			},
			{
				"comment_id": 35,
				"body": "> [krixano](#comment_336_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): It would work, but you wouldn't be able to publish that to anyone else because site's are protected by a signature which uses the zite owners private key. Also, whenever the zite get's updated, it will revert back. [...]\n\nzites updating doesn't affect the change I made in my local folder?",
				"added": 1519628177
			},
			{
				"comment_id": 36,
				"body": "> [krixano](#comment_337_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): If you are meaning your changes to the zite's code, then yes. If you are meaning the information in your user folder (where your own posts are stored), those are signed with a signature using your user id's private key and published/seeded to everyone else.\n\nSo, my changing zite's code gets reverted whenever I update the zite?\n\nWhere is the user folder in which my posts are collected?",
				"added": 1519628530
			},
			{
				"comment_id": 37,
				"body": "> [krixano](#comment_338_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): My Users and Databases tutorial on ZeroNet Dev Center explains how users and databases work, including how user files are verified, how they are stored, how they are used for the databases, how Id Providers (Certificate Authorities) work, etc.\n\nDid you write those tutorials?",
				"added": 1519628617
			},
			{
				"comment_id": 38,
				"body": "> [krixano](#comment_339_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I wrote 4 out of 5 of them. @glightstar also helped with the first tutorial. @lola wrote the tutorial that shows how to make ZeroNet plugins in python. [...]\n\nThey're like a delightful rain shower after a long period of drought! ^-^)_b",
				"added": 1519628994
			},
			{
				"comment_id": 39,
				"body": "> [krixano](#comment_341_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I plan on making many more tutorials, but I've been busy with many other things.\n\nKeep going! History will record every steps you guys make.",
				"added": 1519629198
			}
		],
		"1519627333_1HUb4fXgKGxj4h1nLAKYzgSBHeQpDD5bFS": [],
		"17767_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 40,
				"body": "Wrong URL. Try: http://dailytexanonline.com/2018/02/25/mother-of-the-creator-of-‘dark-web’-site-the-silk-road-visits-ut",
				"added": 1519629841
			}
		],
		"1519632694_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 41,
				"body": "> [krixano](#comment_342_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): It's the users.json file under ZeroNet's data folder. It has all of your private keys, including the one for your id's.\n\nThanks, krixano. I'll try to leave <<users.json>> but other files in /data folder and see what would happen. (will backup, of course ;)",
				"added": 1519648483
			},
			{
				"comment_id": 42,
				"body": "> [flappyearz](#comment_185_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): Technically it's absolutely enough to save the key (secret) string. When you enter it you are identified. You can try it easily.\n\nWhere is it??",
				"added": 1519655257
			},
			{
				"comment_id": 43,
				"body": "> [flappyearz](#comment_186_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): When you go to the starting page (ZeroHello) you should see a USER:<some characters> in the upper right corner. Click on it, and select Show your masterseed. That'll be it. It is the same which was displayed when a new hash was created for you and ZeroNet told you to remember that string. :-)\n\nI don't see it, either. Where is USER:<some characters>??",
				"added": 1519688882
			},
			{
				"comment_id": 52,
				"body": "> [flappyearz](#comment_188_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): gitcenter is right, my bad. Then save your users.json and it contains the same data.\n\nthat's it :)",
				"added": 1519831391
			}
		],
		"1519690191_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 44,
				"body": "> [nekololi](#comment_184_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): the only person who can remove posts or content is the person who holds the private key for signing a site. on zerotalk, it would be nofish. on zerome, it is not nofish (the person who runs Me.ZeroNetwork.bit), but rather the individual who runs the hub that the person published the content to (ZeroMe pulls the things we post from these hub sites, but does not itself host the data we post). so on ZeroMe, the person who wields the power to ban, remove, modify, or otherwise censor content is the operators of the various ZeroMe hub sites we all made accounts on.\n\nOh, site owner has a power to turn off any post he wants? \nThat's it. Thank u for ur kind reply.",
				"added": 1519699269
			},
			{
				"comment_id": 45,
				"body": "> [wr23ttgrgergnbvg](#comment_1_1F1ucX4cPFMbafzcBipikdP6bWRFg7Da3D): You can click and drag the button in the top right\n\nThat is, the three vertical dots which appear when u move the mouse cursor on one of the sites listed on the left column in HelloZero page, and if u click, not drag, the dots a small vertical sub menu appears.",
				"added": 1519699735
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [],
		"1519797620_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 48,
				"body": "> [kaffie](#comment_595_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Launch with: python zeronet.py --homepage [yoursiteaddress]\n\nthanks a lot~! :)",
				"added": 1519801375
			},
			{
				"comment_id": 49,
				"body": "> [version](#comment_32_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4): Add  [...]\n\nthat's ingenious too! thanks!",
				"added": 1519804042
			}
		],
		"1519801465_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 50,
				"body": "> [kaffie](#comment_596_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): KaffieID lets you do this. It's all offline. For a ZeroID you need to be online as it requires the backend server.\n\nWhat is kaffieID good for??\n\n>``Add this line to cert_signers to accept these ids:`` \n\nWhere is cert_signers ?",
				"added": 1519805633
			},
			{
				"comment_id": 57,
				"body": "> [binchan2](#comment_97_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): In /path/to/a/site/data/users/content.json, you also need to add some related Javascript code: cmd(\"certSelect\", {accepted_domains: [\"zeroid.bit\", \"kaffie.id\",...]})\n\nThough I didn't do that, I can somewhat list ID@kaffie.bit in this comment box. It's grayed, however. (Un-grayed in *.Kaffie.bit sites) ???",
				"added": 1519887083
			}
		],
		"1519804000_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 51,
				"body": "> [kaffie](#comment_597_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Correct. You'll download the image from those who have it. If no one has the image but the owner, then you need to make sure they are online in order to download it.\n\nthanks for ur confirmation :)",
				"added": 1519805962
			},
			{
				"comment_id": 53,
				"body": "> [nekololi](#comment_188_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i have a weird tendency to click all of the blurry boxes i see because it annoys me that i don't know what it is. so i will do my best to help you download zerome images.\n\nThanks! U're the greatest image contributor~! :)",
				"added": 1519862339
			},
			{
				"comment_id": 54,
				"body": "> [killy](#comment_2_1FyytdbUoAgZ7mG64Ch9erPasMo2RdoGcr): There is also \"Help distribute this user's images\" checkbox on people's profile pages, to pass the blurry boxes when person known to post the good stuff.\n\nOh, what exactly is its purpose???? (distribute this user's images)",
				"added": 1519863820
			},
			{
				"comment_id": 56,
				"body": "> [nekololi](#comment_189_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): this automatically starts downloading all existing images posted by the user, and will cause all future images posted by the user to automatically attempt to download. this is done with the purpose of enabling you to seed those images to others who try to download them.\n\nThat's amazing~! :) Thank u for ur kind explanation.\n\nWhy don't u guys put [?] mark next to the that feature? :(",
				"added": 1519874184
			}
		],
		"1519869360_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 55,
				"body": "> [krixano](#comment_342_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): It's the users.json file under ZeroNet's data folder. It has all of your private keys, including the one for your id's. http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1519632694_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd\n\nchk this.\t\n",
				"added": 1519872115
			}
		],
		"1519472222_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 58,
				"body": "> [halex](#comment_45_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq): I have a question related to this: if a have a big video file (say 400 MB) inserted as video in the HTML of the zite, peers would stream the video file if clicked? or they have to download the whole file to start watching it?\n\nAs I know, browser-embedded video player starts playing as long as the downloaded amount fulfills the minimum required buffer size, for example, 100kB. If it reaches the end of the pre-downloaded buffer data before fulfilling the minimum required buffer size, it would be paused while waiting for filling the buffer to start again. \n\nBut some sorts of formats or codecs of videos will not provide this feature.",
				"added": 1519957696
			},
			{
				"comment_id": 59,
				"body": "> [nofish](#comment_1126_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): So usually sequantally or if you seek into a movie, then that part.\n\nSo ZeroNet has nothing to do with seeding or splitting big files, right?\n\nWhat if a peer decided to download a 100MB video but stops and killed the zeronet process so that that peer happened to have only 50MB (50%) of the original video in the folder? Can he respond the request from another peer wanting that video, though he might get only 50% of the video as a result?",
				"added": 1519957992
			},
			{
				"comment_id": 60,
				"body": "The best scenario might be providing magnet url of the big file rather than uploading to(?) zeronet, might not it?",
				"added": 1519958275
			},
			{
				"comment_id": 61,
				"body": "> [krixano](#comment_344_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): [...] That's how the streaming works. [...]\n\nVideo-streaming method is different from partial seeding we mean.\n\nIn case, u began watching a video.mp4 in zeronet and jumped to the 2/3 part and close the page, now you have nothing in the folder. If u don't finish downloading the full length of the video and close the page, whatever part u jump to, zeronet doesn't create a copy of the video in the folder, but an empty file with the original filename of the video.",
				"added": 1519960649
			},
			{
				"comment_id": 62,
				"body": "> [krixano](#comment_345_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): [...] Also, you said that it had downloaded 50MB: [...]\n\nIt's downloaded in the cache of the browser, not in the zeronet-site folder unless fully downloaded.\n\n> [krixano](#comment_346_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): In that case, then you'd have 50% of the video that you'd send to other peers.\n\nThat looks dangerous. If it's possible, people can manipulate the video file contents so that the requester will watch the wrong video when they clicks. I don't think it would work in that way.",
				"added": 1519961093
			},
			{
				"comment_id": 63,
				"body": "> [krixano](#comment_348_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): The hashes of the full video and the piecemap are stored in the content.json file, so you can check whether the video has been manipulated or not if fully downloaded, but I'm not sure about checking when not fully downloaded (could that be stored in the piecemap.msgpack file?, not sure).\n\nThank u for the information. I'll chk `piecemap.msgpack` and be back soon :)",
				"added": 1519961449
			},
			{
				"comment_id": 64,
				"body": ">> It's downloaded in the cache of the browser, not in the zeronet-site folder\n\n> [krixano](#comment_349_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Are you sure this is true? I thought is always downloaded in the folder - I don't actually know though.\n\nNot true. Sorry. It's downloaded into zeronet data folder directly as long as u keep downloading the video at least for 15 seconds. If quit before 15 seconds elapse, 0 size. Otherwise the file size will always show the full size till finish. \n\nBut before finish downloading if u quit, the remaining part of the file must have been filled with 0x00 bytes.\n\nMoreover, if u try to watch that video again, `mime type not found` error appears and u can not watch that video again unless u delete the downloaded file in zeronet data folder manually.",
				"added": 1519962662
			},
			{
				"comment_id": 65,
				"body": ">> Moreover, if u try to watch that video again, mime type not found error appears and u can not watch that video again unless u delete the downloaded file in zeronet data folder manually.\n\n> [krixano](#comment_350_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I've never experienced that issue with big files before I don't think.\n\nI'm experiencing this with tor-browser newest version 7.5 64-bit and official firefox 58.0.2 64-bit. \nEven `ctrl-F5` doesn't work.",
				"added": 1519962911
			},
			{
				"comment_id": 66,
				"body": "> [krixano](#comment_351_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I just tried it. I watched a video for few seconds, quit the zeronet client before video fully downloaded. Then restarted the client and refreshed the page on kopy kate and I'm still able to watch the video.\n\nTry to watch more than 15 seconds please.",
				"added": 1519963114
			}
		],
		"1519994634_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 67,
				"body": "Maybe it's somewhere among `.db` files?",
				"added": 1519996034
			},
			{
				"comment_id": 76,
				"body": "> [nofish](#comment_1133_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): The users_archive.json is introduced the stripped the data to reduce the site's size. @9,17UkpN means the full data is in the optional file data/certs_9.json and the auth_address starts with 17UkpN. (If you want to search user by public address)\n\nAlways thank u for ur kind reply, nofish! Anyway, I can't find any `certs_*.json` in my local folder. How can? Plz help.",
				"added": 1520069635
			}
		],
		"1519995841_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 68,
				"body": "> [caryoscelus](#comment_49_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Because there are non-ip-based identity leaks. There's enough info about that on the clearnets and perhaps even somewhere here.\n\nI want to know exactly which data in /data directory could leak identity of the user?",
				"added": 1519996533
			}
		],
		"1519996880_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 69,
				"body": "> [ssdifnskdjfnsdjk](#comment_133_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): It depends if there is a programmer who can do it, \n\nnofish is the owner of ZeroTalk site. No other people can change it as I know. Anybody can, however, fix it after cloning ZeroTalk, but no users will move to that site.",
				"added": 1520000182
			},
			{
				"comment_id": 70,
				"body": "> [ssdifnskdjfnsdjk](#comment_133_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): check this https://github.com/HelloZeroNet/ZeroTalk/issues/56\n\nI realized there's an official place to submit the suggestions. Thanks! :)",
				"added": 1520000335
			}
		],
		"1520002071_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 71,
				"body": "> [ssdifnskdjfnsdjk](#comment_135_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @test20180221 i do not know, did you tried to open your zite ( 0 ) menu and modify zite name and description there and then hit Sign button? After done, i would try to edit \"admin\" variable in your content.json file of your new zite and then save changes and do Sign & publish and i would see no reason why the \"admin\" variable should be reverted back to nofish ?\n\nAfter manual changing the \"admin\" variable, the site stopped finding peers anymore :(\n\nI think I have to purge the site and clone it again.",
				"added": 1520030393
			},
			{
				"comment_id": 72,
				"body": "> [test20180221](#comment_71_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): After manual changing the \"admin\" variable, the site stopped finding peers anymore :( [...]\n\nI copied `content.json` from the other peer, and now it works OK again.",
				"added": 1520033809
			},
			{
				"comment_id": 75,
				"body": "> [nofish](#comment_1135_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Change the \"admin\" to something else. [...]\n\nOk, i'll try again. Last time when I did exactly what u instruct, No peer no update state kept for more than 10 minutes. I don't know why. Even though there was another zeronet PC under the same network.",
				"added": 1520069414
			}
		],
		"1520002319_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 73,
				"body": "> [james007](#comment_171_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): AFAIK: You can't, and it would be a security risk to do so. The keys for your ZeroID are stored locally, if you were able to upload the ID to a proxy, the proxy could steal your private key and impersonate you.\n\nthank you so much~! :)",
				"added": 1520059834
			}
		],
		"1520000055_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 74,
				"body": "> [nofish](#comment_1134_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): You simply have to remove the last 3 digit. Javascript returns unix timestamp in milliseconds.\n\nAh ha~ thank u so much~! :)",
				"added": 1520068944
			}
		],
		"17854_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 77,
				"body": "URL link escaping problem. Proper version: http://news.morningstar.com/articlenet/article.aspx?id=853725",
				"added": 1520080277
			}
		],
		"1534227250_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": []
	},
	"comment_vote": {
		"171_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"1134_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	}
}