{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1593525780,
			"title": "Let’s unite this world",
			"body": "(Clearnet: https://theblogbymb.wordpress.com/2020/06/14/letsunitenoracism-1/)\n\n> Let me please start saying this: I’m not American and although I have black genes, I’m not a person of color either. I’m a European who is very concerned with everyone around the world, and I’ve always been against racism, but too afraid to speak up, and never witnessed it in real life myself. But there is change coming, and in the past few weeks I have seen enough trough the internet. It’s time to speak up.\n>\n> What I knew before I saw how it is in America is that the privilege of the biggest group (or just the group with the biggest mouth) is real. People in minorities won’t get trusted as fast as anyone else, they are not believed, are the first one to blame, and they are treated like they’re way more dangerous than anybody else. They aren’t. That’s something I learned from where I live.\n>\n> Anyone telling me that I’m left, fun fact: I am not. I have no side (maybe central) and am alright with both left and right. Only one thing that is not defined by a system is where I stand for, it’s kindness and love. Yes that sounds hella childish, but I’m not kidding. We all need to love each other. Imagine.\n>\n> I know there are some people of the bigger group that think it’s to do with the people in the minorities, that if they would be the minorities they’d never have been suppressed. Well that’s not true. Let me explain this.\n>\n> Research shows that if you put people in a room and they have to socialize, they automatically and unconsciously pick a group of people that are like them. If you’d say America is that room you’d have some groups, but let’s look into two of them. You guessed it: Black and white. Groups that are not alike other groups do the cruel thing that the human mind does: Kill or get killed. So one of these groups has to kill the other or get killed, not litterally, but this has happened long before America.\n>\n> The kill or get killed instincts activated the moment white European people saw black people, they saw a group that was different and they unconsciously felt like that was scary. So they decided to kill. They oppressed them and turned them into slaves. And that’s still the case. In all these years the minorities were suppressed because the majorities couldn’t put their instincts away. Or didn’t want to.\n>\n> We are way too evolved to let these instincts still rule us. So yes when I said instincts you should have been really insulted, because I called you primal for being opressive to minorities. These minorities shouldn’t even be a word anymore. We should be all one huge group. We are connected now, do not limit our communication or communities to the group we belong in, we shouldn’t be this childish anymore.\n>\n> What is happening recently is that people try to retaliate from this suppression. This is something that is spreading awareness. But is often combined with violence, and that’s a backfiring move. This violence activates the instincts in the people who still have them, the peacefull protesting is undermined by that, because the instinct-driven people activated their instincts and won’t stop until they think they’ve killed the threat, sometimes litterally.\n>\n> In my opinion and mind, I think we shouldn’t protest. Yes I said that. We need to be aware, spread awareness and make people realize that we are one, but in our daily lives. These protests are not going to last long, #BlackLivesMatter is out of trending now, but we need to keep it in the usual every day, just like racism is in every day of the minorities.\n>\n> Please. [#CARE4THEWORLD](https://theblogbymb.wordpress.com/category/care4theworld/) and its people, share this post and share awareness.",
			"added": 1593525779
		}
	],
	"topic_vote": {
		"1593525780_12vUEi3fE9s7VKn8XtAaRfdEKtgfhuDTmJ": 1,
		"1596020021_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1595746827_192xAupujZXB6jpoWqpwobPnEdQovAKiXc": [
			{
				"comment_id": 1,
				"body": "Wasn't Hitler's family secretly jewish? I mean everybody is talking about jews on ZN now and now I see hitler and all... I mean\n\nBtw I'm still waiting for Trump to nuke the US to 'clean' it bc I think he would really do that so yea",
				"added": 1596118578
			}
		],
		"1598036610_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 2,
				"body": "Use ublock origin to select and remove element? idk if it won't remove other stuff, tho.",
				"added": 1598105755
			}
		]
	},
	"comment_vote": {
		"1_1F4duoki9FzLS8ck49rNWYv5tYtCru96XS": 1
	}
}