{
	"title": "自由西藏运动",
	"description": "介绍海外的自由西藏运动",
	"links": "[股市带路党](http://127.0.0.1:43110/12i7CYxN2UxAEMiFarqeBCSegk8sLpmb2R/)\n\n[kai0油管频道](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?Channel=1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv)\n\n[kai0的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kai0@zeroid.bit)\n\n[kaishen的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kaishen@zeroid.bit)\n\n[吴越独立](http://127.0.0.1:43110/1JfzWXHBzELkVF12km6ZdnKSZFUAs8mZBw/)\n\n[零网使用方法](http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/)\n\n[颠覆国家政权群](http://127.0.0.1:43110/16EwXiGi4Dn9EZFSeEuKc2HNZYRD3RcVDs/)\n\n[吴越独立大论坛](http://127.0.0.1:43110/1F1AHWYc7Mt3GBV9ZgphyyG2Go7uodmBtL/)\n\n[自由曙光](http://127.0.0.1:43110/18GBsUZexWB8BcnGUtxFz4qbFiEeXVgB5B/)\n\n[非洲人的生活](http://127.0.0.1:43110/15zvMb12PZ5XMc6yJBWUEmn2dQvV3TyuQU/)\n\n[上海街头](http://127.0.0.1:43110/18iNFjfBKNM2rM4Mov6ShR1Ygu9EihsHWt/)\n\n[今日新疆西藏](http://127.0.0.1:43110/16LDCk5oggAfrnvSN9a7LkStWkqmozEtay/)\n\n[东突厥斯坦运动](http://127.0.0.1:43110/1BHs4zibfUpXbJV7RRVDvMRCiqBgPkeM5y/)\n\n[中国发展模式](http://127.0.0.1:43110/1HNYEHtg6BPAW1jmWfBGPrRMxsPjd6nVA2/)\n\n[中国故事](http://127.0.0.1:43110/1PhcqYWiQHAiasQkcpsHp6btASom2tMGQK/)\n\n[共产党的故事](http://127.0.0.1:43110/17DwzkEgpqtCWK9i1CGdioXojBpN1uaJ2N/)\n\n[天安门大屠杀](http://127.0.0.1:43110/1NT2LeRWQs3zCFCRwuPWbKwcamXVEu1hbU/)\n\n[郭文贵揭露的腐败](http://127.0.0.1:43110/1JWBMmJtHs7uDK1pm6wEJjrZFn3uk1FG6V/)\n\n[中共惊人的腐败](http://127.0.0.1:43110/1PPF2jZ2uBiQyFD75VPpXdCapRHrvezFtz/)\n\n[地狱 中国](http://127.0.0.1:43110/1P9MwRTBWUdbyRgrytY7jg191trnZTomu9/)\n\n[加拿大风情](http://127.0.0.1:43110/1JCehSb5nREM7EivyQDXXkTsGpbKikDiaw/)\n\n[台湾建国运动](http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/)\n\n[中国各地的抗争](http://127.0.0.1:43110/1KXgv2wg6UdzoCqusaS5cCuXzkPsy7f1wm/)\n\n[美中贸易大战](http://127.0.0.1:43110/1LXgC6GXAc535zw8gLQbZpXnfoXNGkQDjh/)\n\n[爆料台](http://127.0.0.1:43110/18eb8HAMQnS8SLJRxMekSGjskNXEtNZZzw/)\n\n[墙内消息](http://127.0.0.1:43110/17PC9PwGFg1rzXnnr6uZe9uQKj7QyED5P6/)\n\n[谈革命](http://127.0.0.1:43110/13LzMTjYM5xGMfnXq6hqAARra5UpmCYt12/)\n\n[自由人聊天室](http://127.0.0.1:43110/1LaXzrgAtsXwdQQdkzFwbLPozoWgTVUQnv/)\n\n[Zer0 Up Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/)\n\n[ZeroUp@anotherneko](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/)\n\n[1024记录](http://127.0.0.1:43110/1CuGFe64XH3XLCiEPkSkwRprrfqZzdAjpp/)\n\n[公义行动](http://127.0.0.1:43110/19bL8w6dqoU6vc4d7gnVmDAbDmpBvdVoxz/)\n\n[幻想未知](http://127.0.0.1:43110/19vi7xKAZsuMrfpp4z4zAMmhY8QNvXN3Sm/)\n\n[大家一起P2P](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/)\n\n[朝花夕拾](http://127.0.0.1:43110/lastone.bit/)\n\n[历史中的404](http://127.0.0.1:43110/1PGxGwpMtEJ22FPDiyXAiQFBrhiFXEtGF5/)\n\n[卡拉卡拉的博客](http://127.0.0.1:43110/12YPedbiK2S74s5Fjgcvjv21JYAjL1zaCC/)",
	"next_post_id": 182,
	"demo": false,
	"modified": 1609216196,
	"post": [
		{
			"post_id": 181,
			"title": "美国認可西藏流亡政府",
			"date_published": 1609216154.877,
			"body": "川普總統簽署法令，支持流亡藏人，認可CTA（西藏流亡政府）。"
		},
		{
			"post_id": 180,
			"title": "西藏军人应该从这里渗透",
			"date_published": 1602405070.413,
			"body": "拉萨离印度边境最近不到300公里\n![5.jpg (0x0)](data/img/post_180_5.jpg)\n\n日喀则离印度边境只有100多公里，日喀则周围有很多县城。\n\n![2.jpg (0x0)](data/img/post_180_2.jpg)\n\n岗巴县离日喀则只有110公里，周围有很多乡。\n\n![3.jpg (0x0)](data/img/post_180_3.jpg)\n\n岗巴县离印度边境只有22公里。\n\n![4.jpg (0x0)](data/img/post_180_4.jpg)"
		},
		{
			"post_id": 179,
			"title": "西藏墨脱县大部分的土地被印度控制了",
			"date_published": 1601465536.888,
			"body": "![4.jpg (0x0)](data/img/post_179_4.jpg)"
		},
		{
			"post_id": 178,
			"title": "《喜马拉雅山上，村民支援部队与解放军对峙》",
			"date_published": 1600776684.976,
			"body": "《卫报》《喜马拉雅山上，村民支援部队与解放军对峙》\n\n文章说，在拉达克海拔近5,000米的楚舒勒（Chushul）印度人村庄楚沙尔，包括大人和男孩在内100多村民将笨重、塞得过满的粗布包裹、大米袋子和重油罐装进竹藤背篓里，踏过荒凉、因争端不安宁的土地，跋涉前往班公湖南岸黑顶山（Black Top）高地。印军上千营帐在那里驻扎，黑顶山已是印中对峙新前线。\n\n但他们脚步不停、一天往返数次于荒山峻岭间并非发善心，未来冬天数月，山上温度会降到零下40摄氏度以下——村民们害怕如果不助印陆军一臂之力，山脊线上的边境将失守，村子可能很快易主，村民们说很担心未来五个月冰雪铺山，还可能有致命的雪崩。"
		},
		{
			"post_id": 177,
			"title": "在印度的西藏军",
			"date_published": 1600669734.249,
			"body": "![1.jpg (0x0)](data/img/post_177_1.jpg)"
		},
		{
			"post_id": 176,
			"title": "中印战争肯定无法避免 而且胜负是显而易见的",
			"date_published": 1600168450.127,
			"body": "日土县距离边境55公里，距离印度主张的边境似乎很近。我认为战争爆发之后，印度会占领日土县的。\n\n噶尔县下方有一个阿里昆莎机场，战争爆发之后，印度会去占领这个机场的，所以，印度也会占领噶尔县的。\n\n曲松乡距离边境只有21公里。不管战争是否爆发，在印度的西藏军都会去那里的。只要印度在边境储备足够的战争物资，建立足够的据点之后，西藏军就会进入这个曲松乡。\n\n中国方面需要的防守兵力实在太多，既要防守印度军队的进攻，又要防守当地民众的起义。\n\n印度方面却轻松的多，只要正面进攻中国军队，攻占的地区都可以交给当地民众防守，仅需提供武器弹药。\n\n这战争肯定无法避免的，而且胜负是显而易见的。"
		},
		{
			"post_id": 175,
			"title": "与边境的距离",
			"date_published": 1600142358.725,
			"body": "噶尔县周围乡镇\n\n![1.jpg (0x0)](data/img/post_175_1.jpg)\n\n噶尔县似乎是阿里地区政府的所在地。噶尔县最西边的乡是曲松乡，噶尔县下方有一个机场，阿里昆莎机场。\n\n![2.jpg (0x0)](data/img/post_175_2.jpg)\n\n与边境的距离。\n\n![3.jpg (0x0)](data/img/post_175_3.jpg)\n\n日土县距离边境55公里，噶尔县距离边境70公里，曲松乡距离边境21公里。"
		},
		{
			"post_id": 174,
			"title": "日土县，噶尔县周围",
			"date_published": 1600082092.802,
			"body": "日土县周围\n\n![1.jpg (0x0)](data/img/post_174_1.jpg)\n\n噶尔县周围\n\n![2.jpg (0x0)](data/img/post_174_2.jpg)\n\n有很多标出的地名，不知道是否都有牧民。"
		},
		{
			"post_id": 173,
			"title": "中印冲突地区",
			"date_published": 1600080120.664,
			"body": "![1.jpg (0x0)](data/img/post_173_1.jpg)\n\n用百度地图看\n\n![2.jpg (0x0)](data/img/post_173_2.jpg)\n\n冲突地区离日土县很近\n\n![3.jpg (0x0)](data/img/post_173_3.jpg)"
		},
		{
			"post_id": 172,
			"title": "图伯特复国的英雄",
			"date_published": 1599463445.424,
			"body": "![1.jpg (0x0)](data/img/post_172_1.jpg)\n\n不久前在边境冲突中牺牲服役于印度特种部队的藏人连长遗体，已举办火化仪式。雪狮旗猎猎，诵经声袅袅，愿图伯特的英雄往生净土!"
		},
		{
			"post_id": 171,
			"title": "雪山狮子旗插到了中国境内！",
			"date_published": 1599198061.897,
			"body": "![1.jpg (0x0)](data/img/post_171_1.jpg)\n\n雪山狮子旗插到了中国境内！\n\n印度军队中的西藏军人在这次中印冲突中，把雪山狮子旗插到了中国境内！\n\n印度应该组织独立的西藏师，直接由西藏师完成西藏复国，这即有利于印度，也有利于西藏，有利于国际安全与和平，更有利于中国人民摆脱中共的专制制度。"
		},
		{
			"post_id": 170,
			"title": "流亡藏人的2021年大选已于本月5日开始",
			"date_published": 1597311720.9,
			"body": "流亡藏人的大选（2021年）已于本月 5日开始，2021年流亡藏人即将投票选出藏人 行政中央司政和45名国会议员。\n\n![1.jpeg (0x0)](data/img/post_170_1.jpeg)"
		},
		{
			"post_id": 168,
			"title": "美国议员提西藏独立议案",
			"date_published": 1591017828.573,
			"body": "【西藏之声2020年6月1日报道】流亡社区的非政府组织自由西藏学生运动与西藏青年会于今日在达兰萨拉联合召开新闻发布会，除了感谢美国共和党众议员斯科特·佩里近期在国会提出支持西藏独立的新法案外，他们并呼吁议员将西藏三区纳入议案，因为整个西藏绝非仅有“西藏自治区”而已。\n\n美国共和党众议员斯科特·佩里（Scott Perry）于5月中旬，在众院提出一项支持西藏独立的新法案（HR 6948）。该议案旨在要求国会授权川普总统承认“西藏自治区”为独立国家。\n\n---\n\n今日（6月1日）流亡社区的非政府组织自由西藏学生运动（SFT）与西藏青年会（TYC）在达兰萨拉，就美国共和党众议员斯科特·佩里在国会提出援藏议案一事联合召开新闻发布会。\n\n他们提出声明指出，对境内外藏人在七十年来为争取西藏自由和独立的抗争运动而言，此次议员斯科特·佩里在美国会提出的援藏议案是藏人获得的历史性成就。同时，美国民众支持西藏独立的立场将有可能会成为历史性的变动与成就。\n\n此外，声明亦回顾了卫藏、康巴，以及安多三区在西藏历史上的地位，并指出中共在侵占西藏时将部分地区划分为“西藏自治区”，同时中共镇压藏人并侵犯人权等行径，导致上百藏人抗议中共而自焚。为此，他们感谢斯科特·佩里此次在国会提出援藏法案，并呼吁他修改法案内容，将卫藏、康巴，以及安多三区也纳入议案，因为整个西藏绝非仅有“西藏自治区”而已。\n\n自由西藏学生运动主席多吉次旦（Dorjee Tseten）在声明中指出，当前世界各地的人们正处于紧急状态，因此他呼吁全球对基本人权与自由状况加大关注。同时，他亦呼吁国际社会关注中共迫害西藏人权的行径，并坚决反对中共强制实行的“一国一制”。"
		},
		{
			"post_id": 167,
			"title": "全印支持西藏团体于加尔各达纪念六十年前首场援藏运动",
			"date_published": 1577625297.857,
			"body": "【西藏之声2019年12月26日报道】印度各大援藏团体的代表聚集加尔各达，纪念六十年前印度民众在知名政治家贾雅普拉卡什·纳拉扬带领下，于加尔各达展开的第一场大规模声援西藏、抗议中共的活动。印度西孟加拉邦邦长贾迪普·丹卡尔等印度政界人士，西藏运动核心小组会议召集人仁青堪卓•克里梅等援藏团体代表，以及藏人行政中央司政洛桑森格、西藏人民议会议长等藏人代表共同出席了纪念活动。"
		},
		{
			"post_id": 166,
			"title": "西藏流亡议会代表访问澳洲",
			"date_published": 1573559961.402,
			"body": "【大纪元2019年11月11日讯】（大纪元记者杨裔飞澳洲布里斯本报导）西藏流亡议会议员访澳，会见澳洲政要，以第一手资料向澳洲讲述中共进藏后对藏人的宗教及文化迫害，争取澳洲政府对西藏的支持。\n\n据昆士兰西藏协会消息，西藏流亡议会资深议员根秋曲珍女士一行四人从印度达兰萨拉（Dharamsala）飞赴澳洲，与达赖喇嘛办公室驻堪京办事处一位代表一起，自11月7日至17日对澳洲布里斯本、墨尔本、堪培拉、纽卡素和悉尼等地进行为期十天的访问。\n\n---\n\n对澳洲进行访问的西藏流亡议会四位代表是：资深议员根秋曲珍女士、佛学博士阿珠才丹议员、寺院住持堪布．降白丹增议员和阿旺塔巴议员。藏人行政中央驻澳洲代表处华人事务联络官格桑坚参全程陪同。昆州布里斯本是西藏流亡议会代表们访澳的第一站。\n\n11月8日（周五），西藏流亡政府五位代表会见了澳大利亚参议院拉里莎．沃特斯（Larissa Waters）参议员、马尔科姆参议员（Senator Malcolm）及昆州布市乌龙戈巴区政府乔纳森．斯瑞（Jonathan Sri）市议员。在会谈中，藏人代表明确表示，他们的诉求不是西藏独立，而是希望在西方民主国家的帮助下，“建立起与中国政府的直接对话”，以解决长期存在的西藏人权和宗教信仰自由的问题。其主要诉求如下：\n\n1、敦促中国政府停止其越来越多的对西藏人民权利的限制，包括政治迫害、侵害宗教自由和社会歧视；\n\n2、保护西藏脆弱的环境，这对于亚洲和世界均极其重要；\n\n3、保护西藏的语言、文化和民族身份。由于城市化运动的借口而不断迁入的中国人口导致它们的弱化；\n\n4、鼓励中国政府新的领导人考虑我们“中间道路”通过协议解决西藏问题的可行方案。\n\n11月9日，西藏代表离开布里斯本，飞往墨尔本，继续其澳洲访问的行程。\n\n责任编辑：瑞木悦"
		},
		{
			"post_id": 165,
			"title": "美国国会两党议员共同提出《2019年西藏政策与支持法案》",
			"date_published": 1569504652.198,
			"body": "【大纪元2019年09月26日讯】（大纪元记者陈俊村编译报导）美国共和党参议员鲁比奥（Marco Rubio）在周二（9月24日）表示，为制止中共对藏胞人权和自由的压迫，参议院和众议院两党议员共同发起一项有关西藏政策的法案。\n\n鲁比奥当天发表新闻稿指出，他与共和党参议员格雷厄姆（Lindsey Graham）和科顿（Tom Cotton），以及民主党参议员卡丹（Ben Cardin）等人共同发起《2019年西藏政策与支持法案》（Tibet Policy and Support Act of 2019）。\n\n---\n\n这项新提案旨在更新与强化《2002年西藏政策法案》（Tibetan Policy Act of 2002），以因应西藏人民所面对的人权和宗教自由等方面的挑战。而民主党众议员麦克高文（Jim Mcgovern）则在众议院提出该法案。\n\n鲁比奥在新闻稿中说：“在中共针对西藏人施加新的挑战之际，这项迫切需要的法案更新了美国对西藏的政策。我们必须持续高度聚焦于中共政府对西藏人民的压迫，并寻求新的工具在中国内外保护他们的宗教、语言和文化。”\n\n卡丹说，这项法案获得两党的强烈支持。“当中共政府试图干预藏族群体的宗教自由和自治，包括达赖喇嘛的继承与转世程序时，美国不会坐视不管。”\n\n格雷厄姆说：“中共对西藏人民所做的事是一项耻辱。他们受到的压迫一年比一年严重。我们将持续与西藏人民站在一起来对抗中共。”\n\n而科顿则表示，中共利用各种工具操控西藏人民，正如他们在香港和新疆等地所做的。“我们的法案将藉由制裁干预西藏宗教和文化传统的中共官员，支持西藏人民的自由。”\n\n依据这项法案，美国政府得以指明干预达赖喇嘛的继承与转世程序的中共官员，并对他们施以金融、经济和签证相关的制裁措施，包括《全球马格尼茨基人权问责法》（The Global Magnitsky Human Rights Accountability Act）所列示的制裁措施。\n\n责任编辑：叶紫微"
		},
		{
			"post_id": 163,
			"title": "香港局势动荡，西藏与中国、台湾作家联署声援港人争自由",
			"date_published": 1567171925.307,
			"body": "【西藏之声2019年8月30日报道】香港“反送中”运动无畏中共与港府的镇压，持续进行。在过去短短三十个小时内，连续有抗议活动成员遇袭、被捕，而抗议民众也在酝酿另一场大规模的集会游行。在此之际，一批西藏、中国和台湾的作家联署发表声明，支持香港反抗运动，同时强调，港人的勇气必将唤起中国人内心深处的民主梦。\n\n---\n\n香港局势因为政府授权警方暴力镇压“反送中”运动而持续动荡，根据港媒报道，在短短一天时间内，民阵召集人在内的数名“反送中”参与者在不同地点遇袭，而香港众志秘书长黄之锋等青年领袖也先后被警方拘捕。\n\n香港众志发表声明，批评警方于中共人大就香港特首选举通过“ 8．31方案”五周年之际，透过大规模搜捕示威者，企图营造寒蝉效应与白色恐怖。\n\n与此同时，国际社会对港人自由抗争所给予的关注、支持也未停歇。\n\n今天（8月30日），流亡藏人作家安乐业与嘉央诺布，中国流亡作家袁红冰，以及台湾作家李敏勇等近五十名来自中国、西藏与台湾的作家、诗人、媒体人联署发表声明，支持港人的自由抗争。\n\n联署声明指强烈反对中共政府运用国家恐怖主义暴力，以及栽赃嫁祸或秘密绑架的手段，对和平示威的香港人进行镇压。\n\n藏、中、台作家在声明中呼吁自由世界支持香港人民，同时呼吁中国人站起来支持香港。“香港人的坚持和勇气必将成为唤起中国人的内心深处沉睡百年民主梦的晨钟！”\n\n今天下午两点，西藏青年会在印度首都新德里发起声援活动，组织藏人与支持者从康诺特广场（Connaught Place）出发，手持写有“香港加油”、“西藏支持香港民主”等标语的黑伞，一路高呼口号游行至坚德曼德示威区（Jantar Mantar），以表达对香港民众自由抗争的支持。\n\n今天傍晚六点钟，位於新德里的“桑耶林”流亡藏人社区的僧俗民众，也将举办一场烛光集会活动，支持香港。此外，明天（8月31日）上午，西藏妇女会也计划在达兰萨拉发起集会游行，声援香港自由抗争。"
		},
		{
			"post_id": 162,
			"title": "“强迫失踪受害者日”前夕，藏人在中国驻英使馆前集会抗议",
			"date_published": 1567171220.929,
			"body": "【西藏之声2019年8月29日报道】“国际强迫失踪受害者”纪念日即将临近之际，流亡藏人和援藏人士在中国驻英国使馆前举办抗议活动，要求中共政府释放西藏境内所有遭非法拘押、被强迫失踪的藏人。\n\n![3.jpg (0x0)](data/img/post_162_3.jpg)\n\n图片：英国藏人协会提供\n\n* * *\n\n明天(8月30日)是“国际强迫失踪受害者”纪念日，流亡藏人和援藏人士于昨天（8月28日）在中国驻英国大使馆前举办抗议活动，要求中共政府释放西藏境内所有遭非法拘押、被强迫失踪的藏人。\n\n本台驻瑞士记者发来消息，28日当天，抗议者们聚集在中国驻英国大使馆前，手持西藏国旗和十一世班禅喇嘛的画像，以及写有“班禅喇嘛在哪儿？”和“停止强迫失踪！”等标语的横幅，并高喊“西藏要自由！”等口号，举办了抗议活动。活动由英国藏人协会和自由西藏学生运动英国分部（Students For a Free Tibet UK）联手举办。\n\n英国藏人协会会长达瓦次仁接受本台记者的采访时表示，为捍卫西藏人权而抗争的境内藏人在中共统治下，一直面临着被强迫失踪的危险。其中如第十一世班禅喇嘛根敦确吉尼玛，他自幼就遭中共当局的劫持，迄今无人知晓他的下落。\n\n因此达瓦次仁指出他们在“国际强迫失踪受害者”纪念日临近之际，站出来要求中共当局释放以十一世班禅喇嘛为首的所有“被强迫失踪”的藏人政治犯。\n\n根据西藏人权与民主促进中心（TCHRD）去年发布的统计数据，西藏境内已获知有超过两千名藏人被非法拘押，其中四百多人属被强迫失踪，外界至今无法得知他们被关押在何处。\n\n**“国际强迫失踪受害者”纪念日的设立**\n\n根据联合国大会通过的《保护所有人免遭强迫失踪国际公约》，强迫失踪是指由独裁政体的国家代理人，或得到国家授权、支持或默许的个人或组织如秘密警察或情治单位，实施逮捕、羁押、绑架，或以任何其他形式强行剥夺自由的行为，并拒绝承认剥夺自由之实情，隐瞒失踪者的命运或下落，致使失踪者不能得到法律的保护。\n\n联合国大会于2010年12月21日通过《保护所有人免遭强迫失踪国际公约》，并宣布“8月30日”为国际强迫失踪受害者日。"
		},
		{
			"post_id": 161,
			"title": "印度中央邦前首席部长访问达兰萨拉，承诺继续支持西藏",
			"date_published": 1566554734.29,
			"body": "【西藏之声2019年8月21日报道】印度中央邦前首席部长人民党议员希夫拉吉•辛格•乔汉于昨天参访达兰萨拉藏人行政中央，会见司政洛桑森格与西藏人民议会议长白玛炯乃等官员。希夫拉吉表示他们将会继续支持西藏议题，帮助藏人得到自由。\n\n---\n\n印度中央邦（Madhya Pradesh）前首席部长、人民党（BJP）议员希夫拉吉•辛格•乔汉(Shivraj Singh Chouhan)、喜玛偕尔邦前工业与交通运输部部长、地方议会议员基贤•卡普尔（Kishan Kapoor）于昨天（8月20日）参访位于达兰萨拉的藏人行政中央，会见司政洛桑森格与西藏人民议会议长白玛炯乃等官员。\n\n希夫拉吉和基贤•卡普尔等印度官员组成的参访团，于昨天上午在内阁大楼会见司政洛桑森格。司政向他们介绍藏人行政中央的工作运转情况、境内藏人的苦难，并就香港的抗议事件进行了讨论。\n\n司政还向他们介绍了印度与西藏间的政治、民族，以及历史上的密切联系，并呼吁对方继续支援西藏抗争。\n\n希夫拉吉表示，他们将会继续关注西藏议题，帮助藏人得到自由。他还指出：“我们把流亡藏人视为家人，而非‘难民’或‘客人’。”\n\n结束会见后，司政洛桑森格向希夫拉吉，以及基贤•卡普尔等印度官员赠送唐卡与书籍等纪念品。\n\n希夫拉吉向媒体表示，达兰萨拉是一个受达赖喇嘛尊者加持的圣地，这里充满着和平、慈悲，以及利他之心的气氛。他还指出印度与西藏间在历史上有着密切联系，保持了上千年的友谊，因此印度将继续支持西藏。\n\n而后，希夫拉吉与基贤•卡普尔等人参访西藏人民议会，会见议会议长白玛炯乃为主的流亡藏人民意代表。"
		},
		{
			"post_id": 160,
			"title": "西藏妇女会第十三次理事会结束，制定营救班禅喇嘛计划",
			"date_published": 1565958442.36,
			"body": "【西藏之声2019年8月14日报道】流亡藏人团体“西藏妇女会”第十三次理事大会，近日在印南卡纳塔克邦孟戈特“堆格林”流亡藏人社区召开，并于10日圆满结束。在为期六天的会程中，她们讨论并制定了十项议案。\n\n---\n\n西藏妇女会第十三次理事会议于本月5日至10日间，在印南卡纳塔克邦孟戈特“堆格林”流亡藏人社区召开，有来自二十五个分会的七十三名代表参加会议。此外，藏人行政中央印南藏人社区总主管曲培图丹、印南孟戈特“堆格林”藏人社区主管拉巴次仁、印度地方官员，以及该地区各大寺院的高僧等亦受邀出席会议。\n\n西藏妇女会在为期六天的会程中，对十项议案进行深入讨论，并作出表决。此外，西藏妇女会总部和各分部还在会上发表了年度工作以及预算报告。\n\n西藏妇女会副会长格桑玉珍接受本台记者的电话采访时，介绍了这次会议的决议内容。\n\n格桑玉珍介绍说，达赖喇嘛尊者年事已高，但是尊者的行程不见减少，她们为了达赖喇嘛尊者永久住世，决定将进行放生等佛事活动外，还将呼吁尊者办公室减轻达赖喇嘛尊者的繁忙行程安排，避免尊者操劳过度。\n\n西藏妇女会将在明年5月17日，即十一世班禅喇嘛根敦确吉尼玛失踪整整二十五周年的纪念日当天起，举行大型抗议活动，要求中共政府立即释放班禅喇嘛。\n\n此外，西藏妇女会决定向联合国有关部门提交一份呼吁信，要求联合国为拯救西藏生态环境而采取行动。\n\n与此同时，格桑玉珍还指出，为了寻找推动藏中重启对话的途径，她们还决定将大力推广达赖喇嘛尊者倡导的“中间道路”，以便让更多人了解这项政策的真正含义。\n\n西藏妇女会于1959年3月12日在拉萨成立，当时上万名西藏妇女在布达拉宫广场前集会抗暴，遭到中共镇压。1984年，流亡藏人于达兰萨拉重新成立西藏妇女会，如今该团体在世界各地拥有五十八个分会，一万七千多名成员。"
		},
		{
			"post_id": 159,
			"title": "西藏与台湾、维吾尔人在纽约台北集会声援香港自由抗争",
			"date_published": 1565700995.285,
			"body": "【西藏之声2019年8月12日报导】香港各界发起的“反送中”活动在持续进行，港警对抗议民众的镇压也越来越残酷。与此同时，台湾、西藏与维吾尔团体也于近日分别在纽约、台北两地，同香港民众一道集会，透过人体排字及呼喊口号等方式声援港人的自由抗争，谴责中共授意下港府对民众的无情打压。\n\n---\n\n近日，台湾人权促进会与藏台连线等十几家人权团体发起“香港人权关注在台湾”活动，并于本月11日当天，组织三百余人在台北中央艺文公园集会，用人体排出“FREE HONGKONG”字样，支持港人的自由抗争。\n\n据“香港人权关注在台湾”活动的官方脸书页面资讯显示，参与活动的非官方团体包括“香港边城青年”、“西藏台湾人权连线”、“台湾人权促进会”，以及“台湾基督长老教会”等。\n\n台湾人权促进会秘书长邱伊翎在活动上致词谴责港警暴力镇压游行民众，并指这已违反香港“基本法”，也违反香港签署批准的国际人权公约。她强调：“而这几天，台湾手摇饮料店纷纷宣告支持‘一国二制’或自称来自‘中国台湾’，也展现出在这一波港人抗议的风波中，台湾无法置身事外，应该认清现实，勿再对于中国提出的任何提议，存有幻想。”\n\n与此同时，美国的藏人、台湾人以及维吾尔人，也同港人一道集会，声援香港正在进行的自由抗争。\n\n据《南华早报》报道，本月10日，百余名台、藏、维与港人聚集在中共领事馆前，穿黑衣并持黄色雨伞，以此声援正在香港为自由而抗争的民众。\n\n“守护台湾自由”组织成员胡慧中在活动上发言，赞扬香港抗争中那些不同年龄背景参与者们的顽强抵抗 。\n\n自由西藏学生运动主席多杰次丹在集会上致词指出，藏人与各方当下都应站出来一同支持香港争取自由与民主。过去六十年来境内藏人一直在为自由而抗争，且从未失去希望，“今天我们必须告诉国际社会，是时候该支持香港了、是时候该做对的事情了、是时候该确保你站在历史正确的一方了！”\n\n台湾行政院长苏贞昌在上月元朗事件后，曾发声指出：“看到今日的香港，看见橡胶子弹打在市民身上，黑帮公然殴打游行群众，连路过的民众都遭殃，实在让人忧心，遗憾。香港的情况就是台湾的借鉴，台湾人不会再听信‘一国两制’、‘多少年不变’的谎言。”"
		},
		{
			"post_id": 158,
			"title": "绝不向中共妥协：德国议会不更改访华代表团名单",
			"date_published": 1565445410.119,
			"body": "【西藏之声2019年8月9日报导】中共当局拒绝德国联邦议会代表团访问中国一事暴光后，中共外交部在例行记者会上表示，中方不欢迎“一贯为反华势力充当政治说客、损害中方利益的人”。此外，德国数位化议程委员会亦决定不会妥协于北京的要求，也不打算更改代表团名单。\n\n![9.jpg (0x0)](data/img/post_158_9.jpg)\n\n德国数位化议程委员会、人权委员会两团预计分别将在八月和九月访问中国，他们都遭中共当局拒绝。其中，中共指出如果德国绿党议员玛格丽特•包瑟（Margarete Bause）在数位化议程委员会代表团的名单中，就拒绝让该代表团到访。\n\n---\n\n包瑟是人权委员会的发言人，她长期关注中国的人权问题，并且她曾数度批评中共设立的新疆“再教育营”。因此，包瑟认为中共的抵制与她为维吾尔穆斯林发声有关。\n\n而中共当局拒绝德国代表团的访问一事暴光后，中共外交部在例行记者会上表示，中方不欢迎“一贯为反华势力充当政治说客、损害中方利益的人”。\n\n据《法国国际广播电台》（RFI）中文网昨天（8月8日）报道的消息，德国数位化议程委员会决定不会妥协于北京的要求，他们将继续保留包瑟在访华代表团名单上。而包瑟对议员们的决定表示赞赏，并指出“中国在越来越多的地方使用‘分裂加统治’策略并施加压力。作为联邦议员，我们不允许让别人将我们分开。”"
		},
		{
			"post_id": 157,
			"title": "美国国会代表团拜会达赖喇嘛尊者，表达支持西藏民主抗争",
			"date_published": 1564914871.915,
			"body": "【西藏之声2019年8月3日报导】由六名美国国会议员以及二十多名国会工作人员组成的代表团，昨日抵达印北山城达兰萨拉，今天拜会达赖喇嘛尊者并共享午餐。在结束与尊者的会面后，众议员戴维•普莱斯向记者表示，尊者启发、鼓舞着无数世人，并建立了民主的流亡政府，美国国会代表团此行主要是对藏人给予支持和协助。\n\n![1.jpg (0x0)](data/img/post_157_1.jpg)\n\n昨天（8月2日）下午，美国国会议员戴维•普莱斯(David Price)、议员范恩•布肯南（Vern Buchanan）等来自两党的六名议员，以及国会工作人员共三十余人抵达印北山城达兰萨拉。\n\n---\n\n今天中午，美国国会代表团拜会西藏领袖达赖喇嘛尊者，并共享午餐。\n\n结束与尊者的会面后，美国众议员戴维•普莱斯向记者表示，他们这支代表团由美国国会两党议员组成，他们试图与各国的国会成员接触并推动民主发展。今天能够见到达赖喇嘛尊者，是此次行程中最激动人心的时刻。他解释说：“因为尊者启发、影响着无数世人，并在达兰萨拉建立了民主的流亡政府。我们希望对此给予支持、协助。而且我们也希望向达赖喇嘛尊者与藏人致意，同时感谢他对我们及世界所给予的启发。”\n\n众议员范恩•布肯南告诉记者，此行的主要目的是要建立并不断提升双方之间的友谊。而达赖喇嘛尊者在会晤中展现出的远见卓识，也令美国议员们印象深刻。他们愿与藏人一同努力，不断前进。\n\n昨天这支美国国会代表团抵达达兰萨拉时，受到藏人官方代表与民众的欢迎。在机场接受媒体采访时，共和党籍众议员尼尔•敦恩（Neal Dunn）表示，美国民众喜爱西藏，因此他们来这里探讨如何向流亡藏人提供帮助。\n\n国会代表团于昨天同藏人行政中央司政洛桑森格见面，今天上午再度同司政与其他内阁成员举行会晤。\n\n在结束与藏人行政中央内阁的会面后，众议员戴维•普莱斯告诉媒体，这次来达兰萨拉的主要目的是要向藏人表达声援，并且支持藏人争取自由、保护传统文化。\n\n今天下午，美国国会代表团同西藏人民议会议长白玛迥乃，以及其他常委举行会晤，之后向藏人行政中央的公务员以及民间团体成员发表了演说。\n\n![2.jpg (0x0)](data/img/post_157_2.jpg)"
		},
		{
			"post_id": 156,
			"title": "律师探视扎西文色再受阻，被告知敏感案件需特殊对待",
			"date_published": 1564913505.726,
			"body": "【西藏之声2019年8月2日报道】因倡导保护西藏语言权利而被判“煽动分裂国家罪”的藏人扎西文色，入狱已超过三年半。中共当局持续阻止他与自己的律师见面，近日两名长期关注此案的中国良心律师再度前往监狱探视，同样未果。他们向有关部门投诉时被告知，扎西文色案属于敏感案件，而且他在狱中“不服判、不服管”，因此要“特殊对待。”"
		},
		{
			"post_id": 155,
			"title": "美国防部应对措施生效，又有大学关闭孔子学院",
			"date_published": 1564656497.492,
			"body": "【西藏之声2019年7月31日报道】近年来，中共透过在各国学术机构设立孔子学院，干预学术与表达自由的行为，受到舆论与相关国家政府的关注。 美国政府采取行动，规定任何大学若想获得国防部的华语学习项目资助，就必须关闭中共孔子学院。这一决策正在生效，已有多所大学做出正确选择，而近日旧金山州立大学也为继续获得国防部资助，而决定关闭校内的孔子学院。"
		},
		{
			"post_id": 154,
			"title": "澳洲西藏团体呼吁昆士兰大学关闭孔子学院，抵制中共审查",
			"date_published": 1564656458.442,
			"body": "【西藏之声2019年7月30日报导】澳洲西藏委员会今天发表声明，呼吁昆士兰大学关闭以“语言教学计划”为伪装的中共宣传机构——孔子学院。西藏委员会并提及近日昆士兰大学港生与亲中共中国学生间的冲突，对声援“反送中”运动的示威者表达支持。"
		},
		{
			"post_id": 153,
			"title": "评论：英国新首相应与达赖喇嘛会面，以证明自由价值",
			"date_published": 1564154685.689,
			"body": "【西藏之声2019年7月26日报导】近日，英国记者投书媒体评论指出，达赖喇嘛与各国政府领袖之间的会晤，对生活在中共极权主义统治之下的西藏人民极为重要，因为这时时刻刻地提醒着中国，西藏的问题至今仍然没有获得解决。因此，他表示，如果新任首相鲍里斯•强森（Boris Johnson）希望英国免受中国摆布，那他应该表现的像个自由的领袖与达赖喇嘛会面。"
		},
		{
			"post_id": 152,
			"title": "达赖喇嘛致函英国新首相：仰慕欧盟模式，但尊重公投决定",
			"date_published": 1564154638.933,
			"body": "【西藏之声2019年7月25日报道】达赖喇嘛尊者致函祝贺前伦敦市长鮑里斯•強森当选英国新任首相。尊者回溯英国与西藏之间的悠久历史关系，并感谢了英国民众的友谊。对这位以主张英国退欧而知名的政客，尊者直言自己一直都非常仰慕欧洲各国从昔日夙敌转为盟友的精神，但也强调无论怎样自己都会尊重2016年英国公投退欧的决定。<span data-cke-bookmark=\"1\" style=\"display: none;\"> </span>"
		},
		{
			"post_id": 151,
			"title": "台湾民进党代表访问达兰萨拉，盼与西藏共同努力争取自由",
			"date_published": 1564154508.914,
			"body": "【西藏之声2019年7月25日报导】近日，台湾民进党组成代表团抵达印北达兰萨拉拜访达赖喇嘛尊者。民进党秘书长罗文嘉表示在面对来自于中国极权的威胁，他希望除了保护台湾的民主外，也能够协助其他地区、国家一起为争取自由民主尽力。同时，罗文嘉透露在与尊者会面的过程中，尊者谈到转世问题时，表示转世会在佛教国家，因此也有可能在台湾转世。此外，党部发言人李问对于邀请尊者访问台湾的可能性表示：“关于达赖喇嘛尊者的访台事宜，我们尊重藏人，以及尊者本人的意愿。”\n\n---\n\n台湾民进党秘书长罗文嘉、公共关系处主任谢雨利，以及党部发言人李问组成的代表团于7月17日至19日期间访问达兰萨拉，他们分别与达赖喇嘛尊者、藏人行政中央司政洛桑森格、西藏人民议会议长白玛炯乃会面，以及参观藏人社区的民间组织。\n\n**西藏、台湾共同为争取民主自由**\n\n民进党秘书长罗文嘉接受本台采访表示，此次访问达兰萨拉是代表民进党主席卓荣泰向达赖喇嘛尊者表达生日的祝福。同时，他表示尊者是非常有智慧的领袖，并非常敬佩尊者对于民主的认知，以及对现实的判断。\n\n他指出尊者特别提到台湾民主力量的重要性，并表示自由是台湾最大的资产。罗文嘉介绍现在台湾享受民主的成果，是当初前人辛苦争取而来的。因此，在面对来自于中国极权的威胁，他希望除了保护台湾的民主外，也能够协助其他地区、国家一起为争取自由民主尽力。\n\n而民进党部发言人李问则表示代表团成员都是第一次访问达兰萨拉，并指出藏人不论周遭环境条件多么困难，都坚持执行民主制度的精神，对台湾人来说非常具有启发性。同时，他希望鼓励并提倡，有着共同挑战与威胁的人民，如藏人、香港人、维吾尔人等，就民主经验与抗争方式开展更多的交流。\n\n在回答关于是否邀请达赖喇嘛尊者访问台湾的提问时，他表示此行主要目的是向尊者的生日送上良好祝福，他指出：“关于达赖喇嘛尊者的访台事宜，我们尊重藏人，以及尊者本人的意愿。”\n\n**尊者可能在台湾转世**\n\n此外，罗文嘉透露在与尊者会面的过程中，尊者表示自己还可以活到一百岁，所以不急着谈论转世问题，并且尊者强调，转世要由所有的佛教徒决定，不是由共产党决定。同时，罗文嘉也询问尊者有没有在台湾转世的可能，尊者则表示当然有可能，只要是佛教的国家都有可能。\n\n最后，罗文嘉对争取西藏自由的所有朋友表示：“我们有共同的价值，也有共同的威胁，但因为我们有共同的信念，所以我们可以共同努力。”"
		},
		{
			"post_id": 150,
			"title": "南非议员穿藏装挺西藏：人权须在与中国的经贸关系之上",
			"date_published": 1564154419.749,
			"body": "【西藏之声2019年7月26日报导】南非因卡塔自由党议员赫林格瓦近日身着藏式衬衫于国会发言，他强调南非作为自由之地，必须向那些遭受压迫的藏人伸出援手，并反省拒绝达赖喇嘛尊者入境签证的决定。他指出，南非在同中国建立经贸关系时，绝不应该在自己的人权价值观上妥协。\n\n---\n\n本月11日，南非因卡塔自由党议员赫林格瓦（Hon M D Hlengwa）于国会的质询会议上发言力挺西藏与人权。\n\n赫林格瓦首先讲述了他身上那件藏式衬衫的来历。他指自己近日有幸于比勒陀利亚市参加达赖喇嘛尊者的生日庆典，活动由藏人行政中央驻南非办事处主办。他在庆典上获赠这件藏式衬衫。\n\n赫林格瓦对国际关系部长在接受质询时提及国际霸凌现象表示欢迎，同时也支持部长对西撒哈拉、以巴冲突等问题的见解，但他指出：“然而我们应该牢记，南非作为自由之土地，应该向那些遭受侵犯与压迫的群体伸出援手。”\n\n他表示，与藏人的接触提醒着南非——政府曾经做出拒绝达赖喇嘛尊者访问的决定，也提醒着南非，永远都不应该无视人权问题。他说：“我们也应该谈一谈更加严重的问题，中国霸权的‘一中政策’正在带给西藏与台湾人民浩劫，他们也渴望自由与民主。”\n\n赫林格瓦认为，如果印度数十年来能够为达赖喇嘛尊者提供帮助，那么南非也应该做到在与中国建立经贸关系时，绝不要在自己的人权价值观上妥协。\n\n南非政府由亲中共政党执政后，数次拒绝或故意拖延达赖喇嘛尊者的入境签证，尊者的挚友、南非前大主教德斯蒙德•图图就曾痛斥南非政府向中共屈膝、抛弃自由价值，恶劣行为更甚于种族隔离时代的政府。\n\n今年初南非反对党“民主联盟”议员凯文.迈尔哈姆也曾于国会发言，谴责中共对西藏的占领，并强调西藏的独立地位。迈尔哈姆批评南非先后多次拒绝向达赖喇嘛尊者核发入境签证，并指主要原因就是南非政府害怕达赖喇嘛的访问会引起中国的不满。\n\n去年二月，被中共称为“中国人民老朋友”的南非总统祖马因贪腐丑闻而被迫辞职。随后，南非国民议会选举出非洲人国民大会主席西里尔•拉马福萨（Cyril Ramaphosa）为新总统。\n\n达赖喇嘛尊者当时致函祝贺拉马福萨当选总统，并表示：“南非人民拥有诚实与和谐的特质，并且努力发扬和平、民主与平等理念。 最重要的是带给你们的人民乐观和希望，并且同时激励其他国家的人民。”"
		},
		{
			"post_id": 149,
			"title": "美国会将提新法案加强援助西藏，应对中共治藏暴政",
			"date_published": 1563887127.213,
			"body": "【西藏之声2019年7月22日报道】纽约与新泽西州藏人协会同国会议员吉姆•麦考文等一同与昨日在纽约举办市民大会。麦考文议员在会上宣布，他将与同僚分别在众院与参院提出新法案，加强《西藏政策法》。新法案内容包括制裁那些干预达赖喇嘛转世制度的中共官员，以及继续施压中国促其允许美国在拉萨建立领事馆等等。\n\n![8.jpg (0x0)](data/img/post_149_8.jpg)\n\n图片来源：The Tibetan Community of NY&NJ\n\n---\n\n昨天（7月21日），美国纽约与新泽西州藏人协会在藏人集会大厅举办市民大会，美国国会议员吉姆•麦考文（Jim McGovern）、议员托马斯•苏奥齐（Thomas Suozzi）、藏人行政中央驻北美办事处代表、国际声援西藏运动主席等与当地藏人一同出席。纽约与新泽西藏人协会于脸书直播了会议全程。\n\n吉姆•麦考文在发言时指出，藏中对话停滞，且西藏境内人权状况不断恶化，在这样一个时刻，他认为美国需要就其西藏政策进行更新、加强。因此他宣布，自己将同议员托马斯•苏奥齐在众议院提出一项新的法案，以加强《西藏政策法案》，参议员马可•卢比奥（Marco Rubio）将在参院提出同样的法案。\n\n麦考文表示，将提出这项法案的有共和党成员，也有民主党成员，因为双方在任何时候，总是能够对西藏问题达成共识。\n\n据他介绍，这项立法将加强美国的援助西藏政策，明确表态——藏传佛教的领袖继任者或者转世，包括第十五世达赖喇嘛的选择，完全为宗教事务，只能由西藏佛教徒来处理。该法案还将提出，那些试图干预达赖喇嘛继任者与转世确立过程的中国官员，将会以《马格尼茨基人权问责法》来受到经济与签证等方面的制裁。\n\n这份新法案还包括，除非中国允许美国在拉萨建立领事馆，否则中国也不该再被准许于美国设立新领事馆。法案也提到对西藏境内与流亡藏人社区的文化、教育、人权工作的继续支援。\n\n议员托马斯•苏奥齐致词时告诉各方，中国的威胁不仅仅在于当前的贸易战，而在于其对待公民的方式与侵犯人权的恶行，将伴随着他们的不断强大，而成为其信奉的哲理，这才是世人应该警惕的巨大威胁。\n\n苏奥齐议员还表示，他准备在华盛顿的下一届年度“全国祈祷早餐会”上，邀请5至10名宗教迫害幸存者参加，同美国与世界分享他们的悲惨遭遇。苏奥齐承诺，届时一定会安排藏人代表以宗教迫害幸存者的身份出席。\n\n国际声援西藏运动主席玛提奥•梅卡奇（MatteoMecacci）在发言时指出，美国国会已经通过了《西藏旅行互惠法》，而在这项法律的落实方面，藏人也可以提供帮助。他鼓励在座的美籍藏人去中国大使馆申请西藏签证，而大家受到的歧视对待将成为美国用来推动这些法律的证据。\n\n美国国会在2002年为支持藏人保护自己独特身份的精神，通过了《西藏政策法》。该法案中提出的援藏行动步骤包括：保护西藏传统宗教与语言文字、敦促中共当局保障藏人人权、促成达赖喇嘛尊者的代表与中国政府间举行对话、立即释放西藏良心犯、在拉萨设立美国领事馆，并且要求中共允许十一世班禅喇嘛在不受官方干预下，自由地接受宗教教育等。"
		},
		{
			"post_id": 148,
			"title": "美第二届“促进宗教自由部长级会议”闭幕，副总统提西藏人权",
			"date_published": 1563543600.663,
			"body": "【西藏之声2019年7月19日报导】美国国务院主办的第二届“促进宗教自由部长级会议”于昨日闭幕，美国副总统彭斯以及国务卿蓬佩奥先后致词，对中国的恶劣宗教信仰状况提出谴责。蓬佩奥指中国的人权状况是本世纪的污点，而彭斯则特别提及已被中共劫持二十四年的西藏班禅喇嘛的遭遇。\n\n来自世界各地的宗教信仰迫害幸存者、各国政府代表共数百人聚集在华盛顿，出席由美国国务院举办的第二届“促进宗教自由部长级会议” （Ministerial to Advance Religious Freedom）。为期三天的会议于昨天闭幕。美国副总统与国务卿分别发表了讲话，同声谴责中国为主的迫害信仰政权。\n\n---\n\n**中国的人权侵犯问题是这个世纪的污点**\n\n根据美国国务院公布的视频，在本届会议最后一天，国务卿蓬佩奥致词时提及中国宗教状况，他指中共控制着其治下所有人民的身体以及他们的信仰，中共官员甚至怂恿其他国家不要参加此次会议，其所作所为与中国自身《宪法》也相违。\n\n蓬佩奥提到法轮功学员、基督教徒，以及穆斯林、佛教徒遭中共迫害的案例，并指中国发生着这个时代最为恶劣的人权侵犯行为，是本世纪的污点。\n\n**中国对西藏佛教的迫害已持续数十年**\n\n美国副总统彭斯在致词时指出，自由的思想创造自由的市场，拥有宗教信仰自由的地方，必然会繁荣昌盛。而当一个国家限制宗教信仰等自由时，便埋下了暴力冲突的种子，而且未来纷争必将影响周边国家。\n\n彭斯提到中共对其治下各民族的迫害，他说，中国对西藏佛教徒的迫害已经持续了数十年，其中包括1995年对年仅六岁的班禅喇嘛实施的劫持。之后的二十四年，班禅喇嘛与他的家人音讯全无。彭斯还提到百万穆斯林被关押进“新疆自治区”再教育营的情况，以及当局对基督徒的打压。\n\n在此次为期三天的会议上，国务院负责宗教自由事务的无任所大使山姆•布朗拜克曾强调，在捍卫信仰自由等基本人权方面，美国绝对不能无所作为。\n\n而美国众院议长佩洛西也发表讲话，要求制裁在迫害藏人与维吾尔人方面恶名昭彰的中共官员陈全国。她强调：“如果我们对中国的人权与宗教信仰迫害问题保持沉默，那么我们就失去了在世界任何一个地方谈论人权的道德权威。”\n\n**中共外交部：不要干涉中国内政**\n\n此外，在本届会议进行期间，包括已故藏人政治犯丹增德勒仁波切的外甥女尼玛拉姆、维吾尔政治犯伊力哈木•土赫提的女儿菊尔•伊力哈木等17个国家的宗教迫害幸存者，一道获得美国总统川普的接见。\n\n中共外交部昨天18日透过例行对此表达了抗议，声称“中国不存在所谓的宗教迫害情况、中国公民依法享有宗教信仰自由”并称此次会面是“对中国内政的干涉”。"
		},
		{
			"post_id": 147,
			"title": "藏人代表尼玛拉姆面见川普总统：西藏需要美国的支持",
			"date_published": 1563543432.705,
			"body": "【西藏之声2019年7月18日报导】第二届促进宗教自由部长级会议在美国华盛顿举行之际，美国总统川普接见了遭受中共宗教迫害的西藏佛教徒与维吾尔穆斯林幸存者。已故藏东高僧丹增德勒仁波切的外甥女尼玛拉姆在活动上告诉川普总统，境内藏人的诉求是能够迎请达赖喇嘛尊者回到西藏，她并指出西藏需要美国的支持。\n\n---\n\n美国国务院于本月16日召开第二届“促进宗教自由部长级会议”（Ministerial to Advance Religious Freedom），邀请世界各地的数百名信仰迫害幸存者、宗教界人士与政府代表与会，共同讨论中共等专制政权的侵犯人权恶行。\n\n尼玛拉姆也参加了此次会议的第二天会程，在发言时介绍了她的舅舅丹增德勒仁波切在藏东理塘弘扬佛教、关注社会公益而享负盛名、备受藏人爱戴，最终被中共污蔑判刑入狱，服刑十三年后突然过世的状况。\n\n尼玛拉姆还在会议上呼吁国际社会敦促中国为丹增德勒仁波切的死亡负责、让藏人享有宗教自由，并允许外国记者、外交官与公民不受限制地访问西藏，以了解那里的真实状况。她还就达赖喇嘛的转世问题指出：“我敢肯定超过百分之九十的藏人会尊重达赖喇嘛尊者的决定，而非中国政府的命令。”\n\n与此同时，尼玛拉姆也提到年仅六岁时便遭中共劫持的十一世班禅喇嘛。她表示，班禅喇嘛或者其他藏人政治犯若发生任何不测，责任要由中国来承担。\n\n尼玛拉姆昨天也同其他17个国家的宗教迫害幸存者一道获得美国总统川普的接见。白宫稍后发布了接见影片。\n\n川普向各方致意表示，现场来自不同国家与宗教的人士，都曾因为自己的信仰而遭受迫害，他们都是促进世界各地宗教自由重要性的见证者。\n\n在二十多分钟的见面过程中，川普与宗教迫害幸存者们交流。尼玛拉姆主动发言，向川普表明自己的藏人身份，并指出境内藏人希望迎请达赖喇嘛尊者返回西藏，而且西藏需要美国的支持。\n\n维吾尔政治犯伊力哈木•土赫提的女儿菊尔•伊力哈木也在与川普见面时，介绍了百万穆斯林被中共关押在“再教育营”的情况。"
		},
		{
			"post_id": 146,
			"title": "联合国人权理事会大会多国发声关切西藏与维吾尔状况",
			"date_published": 1562509874.036,
			"body": "【西藏之声2019年7月4日报道】在日内瓦举行的联合国理事会第四十一次大会上，欧盟、法国、捷克等八个会员国，以及非政府人权机构代表发声谴责中共打压人权，尤其对西藏与维吾尔人权、中国维权律师遭迫害的情况提出关切，呼吁中共尊重人权，落实国际人权法规。\n\n![1.jpg (0x0)](data/img/post_146_1.jpg)\n\n联合国官网视屏截图\n\n---\n\n联合国人权理事会第四十一次大会正于日内瓦举行，在昨日的会程上，欧盟与捷克、澳洲等国的代表对中国的人权状况提出关切。联合国官网对会议全程进行了直播。\n\n欧盟代表在会上呼吁中国尊重人权，并提及新疆与西藏的人权状况，尤其是当局实施的大规模监控、针对维权人士的任意拘捕，以及为维吾尔人开设的“再教育营”。\n\n捷克代表提及上月的天安门屠杀三十周年纪念，并关切中国维权人士遭打压问题，同时呼吁中国立即释放人权律师王全璋、余文生，以及西藏语言权利倡导者扎西文色等。捷克要求中国作为人权理事会成员，应该遵守、落实国际人权准则，包括在新疆和西藏。\n\n英国对“新疆自治区”内的大规模拘押表达担忧，建议联合国观察员前去调查。英国亦提及佛教徒、穆斯林、基督徒以及法轮功学员在中国遭受的不公对待。\n\n澳洲与德国均对“新疆自治区”内的任意拘押、被失踪、行动自由受限制等情况表达了担忧。\n\n芬兰、瑞典、法国特别提及西藏局势，呼吁中国立即着手缓解上述地区的紧张局势。\n\n此外，国际声援西藏运动欧盟政策主任文森特.迈腾也代表赫尔辛基人权基金会，在非政府机构发言环节，提出西藏问题。\n\n他指中国正在透过加大管控范围与力度、加速同化等手段，来消灭西藏的身份，并且竭力阻挠外界了解西藏的真相。因此，联合国机构必须争取不受限制地独立进行西藏的权利。\n\n国际声援西藏运动透露，昨天人权团体受威胁人民协会代表卓玛亚拉（Dolma Yaklha)发言介绍西藏局势时，中共代表两度打断她的发言，指控她使用了“不恰当的语言”，委员会主席未接受中方的抗议，而是准许藏人代表继续发言。"
		},
		{
			"post_id": 145,
			"title": "重拾哈维尔人权原则，布拉格市长力挺西藏台湾获褒赞",
			"date_published": 1562509692.362,
			"body": "【西藏之声2019年7月4日报道】捷克执政党为加强与中共的经贸关系，在人权问题上的立场日趋变弱。而上任不久的该国首都布拉格市长却频频向中共说不，数度力挺台湾与西藏，因此获得各方褒赞。有分析人士指出，布拉格市长蔑视中共强权，声援藏台人权，是在重拾哈维尔的价值原则。\n\n---\n\n据英国《卫报》报道，捷克首都布拉格市市长贺吉普(Zdeněk Hřib)今年1月与各国外交官举行会议，中共驻捷克大使以“一个中国政策”为由而要求他驱逐台湾代表。\n\n报道指出，中共近年来对捷克共和国大力投资，而且布拉格市政府本就与北京签署过承认“一中政策”的双城协议，因此这位新市长本可以很容易就同意驱逐台湾代表。然而，贺吉普却拒绝了中方的要求，并让台湾外交官留下。\n\n贺吉普上任以来力挺台湾与西藏，他曾提议删除北京与布拉格缔结姊妹市协议中一项有关承认“一中政策”的内容，并公开表态“有关人权的辩论不应该成为捷克政客们逃避的事物，特别是考虑到捷克自身的历史。”\n\n而在今年的西藏310自由抗暴日，布拉格市政厅亦恢复了中断数年的传统，升挂西藏国旗，以示对藏人抗争的支持。\n\n贺吉普当时接见到访的藏人行政中央司政洛桑森格，他指出：“有关人权的辩论不应该成为捷克政客们逃避的事物，特别是考虑到捷克自身的历史。”\n\n今年4月，中共要求捷克交响乐团“布拉格爱乐团”批评贺吉普上任以来“伤害中国”的言行，但是被乐团代表拒绝，中共便直接取消乐团在中国的行程。\n\n为此，贺吉普对乐团成员表达感谢并赞扬他们拒绝接受中共无理条件、没有放弃自己的城市，他并斥责中共不应该以政治打压文化交流。与此同时，贺吉普表示考虑让乐团更改行程到台湾演出。\n\n在接受《卫报》采访时，贺吉普谴责中国针对公民实施的“社会信用评分”制度，他并指出北京与布拉格达成的协议并不平等，因此他更倾向同民主的台湾合作。\n\n布拉格纽约大学校长吉里·佩赫(Jiri Pehe)指出，贺吉普正在以首都市长身份来重拾哈维尔的价值理念。他说：“所有捷克人都知道，当你支持台湾与西藏时，你就是在延续哈维尔曾经的价值理念。”"
		},
		{
			"post_id": 144,
			"title": "美国务院再次发表“西藏问题谈判报告”关切西藏人权议题",
			"date_published": 1561264232.511,
			"body": "【西藏之声2019年6月20日报导】美国国务院于近日第二次向国会递交“西藏问题谈判报告”，针对西藏严重缺乏自治权利、中共持续侵犯人权，以及语言、宗教文化遭受破坏等情形，表达了深切的担忧。然而，国际声援西藏运动组织指出，该报告仅显示出美国政府对西藏人权的关怀，却缺乏促进藏中间恢复对话的关注。\n\n![11.jpg (0x0)](data/img/post_144_11.jpg)\n\n截图自西藏问题谈判报告\n\n---\n\n美国总统川普执政至今，国务院于五月底第二次向国会递交“西藏问题谈判报告”，美国政府透过第二份报告针对西藏严重缺乏自治权利、中共持续侵犯人权，以及语言、宗教文化遭受破坏等情形，表达了深切的担忧。该报告指出，中共当局必须立即解决这些问题。\n\n该报告亦详细介绍了美国政府在过去一年中采取的行动，其中包括美国政府鼓励中共当局与达赖喇嘛尊者代表间就西藏的未来展开对话。\n\n然而，根据国际声援西藏运动（ICT）网站发布的声明指出，在“西藏问题谈判报告”中，只有提及一位美国高级官员，即是国际宗教自由无任所大使布朗拜克（Sam Brownback）呼吁中共当局与达赖喇嘛其代表间恢复对话。\n\n声明亦提到，美国总统川普与中共领导人习近平举行了至少四次峰会。而报告中仅强调美国副总统与国务卿蓬佩奥就西藏人权问题所作的评论，但这些言论与恢复藏中间对话无关。\n\n根据2002年《西藏政策法》内容，该法案要求美国政府任命一名西藏事务特别协调员，透过推动中共与达赖喇嘛代表间重启对话，以解决西藏问题。但川普政府执政至今尚未任命一名协调员。\n\n国际声援西藏运动组织主席马提奥•梅卡其（Matteo Mecacci）亦在声明中强调，美国将宗教自由作为优先政策。但是，川普政府数次在与中共当局接触和对抗时，并未在高层提出西藏问题，以及与达赖喇嘛对话寻求政治解决方案的必要性。因此，他呼吁川普政府应采取强硬的态度，以恢复藏中对话为目标，与中共高层在公开场合展开讨论。"
		},
		{
			"post_id": 143,
			"title": "达赖喇嘛接见西藏青年会成员：中间道路并非否认西藏独立地位",
			"date_published": 1561013828.959,
			"body": "【西藏之声2019年6月19日报导】达赖喇嘛尊者今天接见西藏青年会近百名代表，鼓励大家努力保护西藏传统宗教、语言与文化。尊者表示他与藏人官方的主张是“中间道路”，但这并非否定西藏的独立历史，因此不论政治主张为何，所有藏人都有责任去研究有关西藏独立地位的历史，并让更多人知道真相。\n\n---\n\n西藏青年会上百名代表近日聚集在达兰萨拉，召开三年一度的理事大会，并选出新一届理事会成员。\n\n今天（6月19日）上午，青年会九十多名与会代表获得达赖喇嘛尊者的接见。\n\n西藏青年会会长贡布顿珠（GonpoDhondup）在见面会结束后接受本台采访。据他介绍，达赖喇嘛尊者向青年会代表强调，西藏境内两代人的接替过程中，勇气与信念并未消失。因此，尊者希望流亡社区的年轻人也能如此，在延续上一辈人的抗争事业时，保持勇气与坚定信念。\n\n尊者还同青年会代表分享了自己的几项人生使命：提升人类一体性理念、推动宗教和谐、保护西藏传统文化与环境、促进印度古文明复兴。尊者特别阐释了西藏传统宗教文化与当今世界的关联，要求年轻藏人透过学习来维护西藏传统文化。\n\n据贡布顿珠介绍，在今天见面活动上，尊者还提出“中间道路”是他与流亡藏人官方正式采纳的抗争主张，然而这并非是在否定西藏的独立历史地位。尊者鼓励流亡藏人年轻一代应该去学习、了解西藏的独立历史地位，特别是从中国自己的历史文献中，寻找有关西藏独立历史地位的记载，并去向更多人介绍。\n\n西藏青年会成立于1970年，以追求西藏独立为建会宗旨，在超过四十多个地区建有分部，共拥有三万多成员。近日青年会选出新一届理事会成员，会长由出生于拉达克的二十五岁藏人贡布顿珠担任，他也是青年会建会以来最为年轻的一任会长。"
		},
		{
			"post_id": 142,
			"title": "达赖喇嘛接见印度援藏人士：西藏问题就是印度问题",
			"date_published": 1561013481.451,
			"body": "【西藏之声2019年6月18日报道】达赖喇嘛尊者在达兰萨拉接见一批印度援藏团体的代表时，强调西藏从古印度那烂陀继承佛法并守护至今，这一悠久历史关系证明，藏人值得印度信任。而且，西藏在地缘政治上也对印度具有重要性，因此西藏问题就是印度问题，印度应该保护西藏。\n\n---\n\n西藏人民至高无上的领袖达赖喇嘛尊者于本月15日在新德里参加“穆斯林大会”，次日返回达兰萨拉。\n\n尊者抵达机场时会见了在当地参加“全印支持西藏组织大会”的印度团体代表，包括西藏运动核心小组召集人仁青堪卓•克里梅（R K Khrimey）等。\n\n据流亡藏人社区媒体报道，尊者在同印度援藏团体代表见面时表示，自己总是强调不论西藏在政治方面是不是中国的一部分，在文化及语言方面绝对与中国不同。七世纪藏王松赞干布虽娶中国文成公主，但在创造文字时却没有选择中国，而是从印度邀请大学者帮助藏人。八世纪藏王赤松德赞又选择从印度那烂陀寺邀请寂护大师入藏弘法。如今那烂陀法脉由藏人完好延续，证明藏人是印度可以信任的弟子。\n\n尊者指出，西藏的地理位置对印度国安极为重要，而且藏人今天没有在追求独立或分裂，只是在透过“中间道路”来争取名副其实的自治权利，以确保西藏的宗教、语言、文化能够持续下去。尊者强调，因此西藏问题也是印度问题，印度应该关注藏人的状况、支持藏人抗争。\n\n在与印度援藏团体代表的会面中，尊者还指出，追求西藏的独立极有可能仅顾及西藏中部与西部的利益，而非西藏传统全境，因此这一选择并不实际。藏人希望争取的是，像中国法律中规定的那样，在所有由中共划分的“藏族自治区”与“自治州、县”落实名副其实的自治权利，如此六百万藏人都能够受益。"
		},
		{
			"post_id": 141,
			"title": "以独立为目标，西藏青年会选出新一届理事会成员",
			"date_published": 1560871385.35,
			"body": "【西藏之声2019年6月18日报道】流亡藏人社区中以独立为抗争目标的团体“西藏青年会”近日召开第十七届理事大会。各方探讨了西藏抗争的未来方向，并且选举产生新一届理事会成员。\n\n![1.jpg (0x0)](data/img/post_141_1.jpg)\n\n西藏青年会新一届理事会成员\n\n---\n\n本月11日至16日，西藏青年会总部与各地方分部的一百五十多名代表聚集在达兰萨拉，举行该团体的第十七届理事大会。\n\n在会议最后一天，上百名与会代表经过数轮投票，选举出西藏青年会第十七届理事会成员，分别为贡布顿珠、索南次仁、洛桑次仁等七人。\n\n其中，贡布顿珠（Gonpo Dhondup）当选青年会会长，洛桑次仁（Lobsang Tsering）当选副会长。\n\n新会长贡布顿珠在大会闭幕仪式上表示，虽然当下并无详细行动计划，但接下来将以延续上届理事会的各项工作为主，并努力超越前辈取得的成果。\n\n贡布顿珠出生于印度拉达克境内的流亡藏人社区，拥有印度哈里亚纳邦的金德尔大学（O.P. Jindal）管理系学士学位。\n\n前会长丹增晋美在闭幕式上致词指出，新一届理事会由青年会的资深成员组成，令人感到欣慰。他希望理事会未来举办任何活动，都要确保尊重达赖喇嘛尊者。\n\n在会后接受本台记者采访时，丹增晋美介绍说，在此次为期六天的大会中，青年会讨论了数个重要议题，并通过了二十五项决议。其中一项是与台湾、香港、菲律宾等国的民间机构联手举办反抗中共的活动，因为上述国家都共同面临着中共霸权的威胁。\n\n西藏青年会成立于1970年，以追求西藏独立为建会初衷，在超过四十多个地区建有分部，共拥有三万多成员。 明年10月7日，青年会将迎来成立五十周年纪念。"
		},
		{
			"post_id": 140,
			"title": "全印支持西藏组织大会：藏人行政中央代表境内外所有藏人",
			"date_published": 1560871237.902,
			"body": "【西藏之声2019年6月18日报道】西藏运动核心小组在达兰萨拉召开“第六届全印支持西藏组织大会”。来自印度全国各地援藏组织的两百多名代表讨论了藏、印、中关系，并制定了未来支持西藏的行动计划。在一份含有十项内容的共同声明中，与会的老中青三代援藏人士呼吁新德里向达赖喇嘛尊者授予国宝勋章，同时承认藏人行政中央是代表境内外藏人的合法机构。\n\n---\n\n印度援藏组织“西藏运动核心小组”（Core Group for Tibetan Cause）于本月15日至17日，在达兰萨拉举办“第六届全印支持西藏组织大会”。\n\n来自印度二十一个邦的二百一十六名援藏团体代表与会，探讨西藏境内的人权状况、西藏在生态与战略等方面对印度的重要性，以及如何去落实藏人行政中央制定的“五年与五十年”规划、寻求印度政府与民间的更大支持等等。\n\n昨天大会结束前各方发表共同声明，呼吁印度政府向达赖喇嘛尊者授予国宝勋章，同时要求中国当局与达赖喇嘛尊者或藏人行政中央的代表进行对话。\n\n这份共同声明并指出，承认藏人行政中央是能够代表境内外藏人的合法机构，同时要求中国政府停止对境内藏人的一切镇压措施、停止一切破坏西藏环境的工程。\n\n藏人行政中央内阁代表卫生部长曲君旺秋在大会闭幕式上致词，他指出此次与会的各方印度援藏者年龄包括老、中、青三代，这证明印度对西藏正义事业的支持范围之广。他呼吁大家返回各自地区后，向地区议会与官员进一步推介西藏运动。"
		},
		{
			"post_id": 139,
			"title": "第六届全印支持西藏组织大会，吁新德里向达赖喇嘛授予国宝勋章",
			"date_published": 1560602949.416,
			"body": "【西藏之声2019年6月15日报道】西藏运动核心小组今天在达兰萨拉召开“第六届全印支持西藏组织大会”。各方与会者将讨论西藏对印度的重要性，制定援藏行动计划，并将继续呼吁印度政府向达赖喇嘛尊者授予平民最高荣誉“国宝勋章”。\n\n![1.jpg (0x0)](data/img/post_139_1.jpg)\n\n印度援藏组织“西藏运动核心小组”于今天（6月15日）在达兰萨拉举办“第六届全印支持西藏组织大会”。藏人行政中央司政洛桑森格受邀出席了开幕仪式。\n\n---\n\n据会议筹备方介绍，此次有来自印度各地的180多名援藏团体代表参加会议，并计划探讨西藏境内的人权状况、西藏在生态与战略等方面对印度的重要性，以及如何去落实藏人行政中央制定的“五年与五十年”规划、寻求印度政府与民间的更大支持等等。\n\n来自阿鲁纳恰尔邦的援藏团体代表伦珠告诉本台，他们在会上将提出加大开展声援西藏的计划方案，同时将继续呼吁印度政府向达赖喇嘛尊者授予平民最高荣誉“国宝勋章”，并且要求印度国会邀请达赖喇嘛尊者前去演讲。\n\n据主办方介绍，在此次为期两天的会议结束时，与会各方将发布共识，并且推出一份未来三年的行动计划。\n\n![2.jpg (0x0)](data/img/post_139_2.jpg)"
		},
		{
			"post_id": 138,
			"title": "全印支持西藏组织大会将于藏人行政中央会议大厅举行",
			"date_published": 1560602746.244,
			"body": "【西藏之声2019年6月14日报道】由印度援藏组织“西藏运动核心小组”举办的“第六次全印支持西藏组织大会”即将于明天在达兰萨拉召开。主办方举办新闻发布会介绍了相关会议详情，表示各方参会者将讨论藏人行政中央的“五年与五十年”规划，以及西藏对印度国安的重要性等等。\n\n---\n\n印度援藏组织“西藏运动核心小组”召集人、前阿鲁纳恰尔邦议员仁青堪卓•克里梅（R K Khrimey）等今天（6月14日）在达兰萨拉举办新闻发布会，宣布时隔四年后，全印支持西藏组织大会将于明天在达兰萨拉举行。这是西藏运动核心小组举办的第六届援藏组织大会。\n\n西藏运动核心小组（Core Group for Tibetan Cause）发表声明指出，来自印度各地的180多名援藏团体代表，将在为期两天的会议中探讨如何去落实藏人行政中央制定的“五年与五十年”规划，并且聚焦西藏对印度、对印中关系的重要影响。\n\n声明指出印度虽然重视与中国的双边关系，但是中国却数次入侵印度领土，破坏友好关系。\n\n同时，声明表示，此次会议还将关注西藏生态与地理位置对印度等国的重要影响，同时讨论如何壮大印度支持西藏团体，加大推动和平解决西藏问题。\n\n据主办方介绍，藏人行政中央司政洛桑森格将作为嘉宾，同各大援藏组织的代表一道出席会议开幕式。\n\n第五届全印支持西藏组织大会于2015年在印度东北部萨姆邦的古瓦哈提市举行，当时与会各方就西藏的人权危机、生态保护的重要性，以及境内的自焚抗议浪潮等进行了讨论。"
		},
		{
			"post_id": 137,
			"title": "司政出席加拿大国会听证会：西藏问题测试各国重视人权态度",
			"date_published": 1560079064.151,
			"body": "【西藏之声2019年6月7日报导】藏人行政中央司政洛桑森格近日赴加拿大，出席加拿大国会参院外交及国贸委员会的西藏人权状况听证会。司政介绍了境内的恶劣人权状况，并且强调西藏问题是测试各国重视民主人权与否的试金石。他并指出，日前由亲中共人士在加拿大成立的伪藏人协会，无法代表藏人。\n\n---\n\n据加拿大西藏委员会公布的消息，藏人行政中央司政洛桑森格于本月6日，出席了加拿大国会参院外交及国贸委员会举办的西藏人权状况听证会。国际特赦加拿大分部秘书长阿里克斯‧纳维（Alex Neve）、加拿大全球事务部大中华部执行部长戴尚安（Shawn Steild）等也出席了会议。\n司政作证时首先赞扬了参议员吴蓝海日前提出的西藏动议。这份动议要求政府积极关注西藏议题，并争取不受限制访问西藏的外交对等权利。司政强调，藏人行政中央一直在秉持达赖喇嘛尊者提出的“中间道路”政策，以争取在中华人民共和国宪法框架下，使西藏的文化、语言、宗教及民族身份获得保护。\n\n在接受参议员提问时，司政表示藏人所在追求的自治，其实不及中国给予香港的权利。因为中国政府缺乏信任，才令藏中对话停滞。中方错误地认为藏人提出自治诉求里其实隐藏着独立主张 。\n\n司政指出，在是否支持人权与民主方面，西藏是测试所有国家的试金石。\n\n司政也提到日前由亲中共人士成立的伪藏人协会，表示他们无法代表藏人，很可能是由中国所操控的组织。\n\n国际特赦加拿大分部秘书阿里克斯‧纳维在听证会上介绍说，中国当局持续监控、恐吓、拘押、折磨藏人与维吾尔人，以及法轮功学员。他建议加拿大政府考虑加拿大西藏委员会的呼吁，将人权置于加中贸易关系之上。\n\n国际特赦也呼吁加拿大政府争取外交官在内的公民，能够不受限制地访问西藏。\n\n听证会主办方参院外交及国贸委员会主席瑞内尔. 安德瑞查克（RaynellAndreychuk）表示，能够问责中国官员的方法之一，就是落实加拿大版的《马格尼茨基人权问责法》，也就是《外国腐败官员受害者正义法》。\n\n加拿大全球事务部大中华部执行部长戴尚安在听取了各方的证词后指出，加拿大关切中国的人权状况，也持续呼吁中国保护所有公民。他表示加拿大政府对中国的政策需要调整，并将继续争取在入藏方面的外交对等权利。\n\n<span data-cke-bookmark=\"1\" style=\"display: none;\"> </span>"
		},
		{
			"post_id": 136,
			"title": "美国大使访藏之际，各方关注西藏在美中关系中的位置",
			"date_published": 1558956292.872,
			"body": "【西藏之声2019年5月24日报导】中共长期禁止外国外交官员与记者进入西藏，近日却突然允许美国驻中国大使布兰斯塔德访问西藏，引起各界关注。有援藏组织指出，这证明美国的《西藏旅行互惠法》对中共的确有影响。但是，布兰斯塔德想与藏人直接交流必然会受限制，因此援藏团体呼吁他能够向外媒公开真实的旅行经历。另有美国外交关系专家撰文指出，美中贸易冲突中，西藏问题或许能发挥更大作用。\n\n---\n\n中共当局长年来禁止外国外交官员、媒体记者前往“西藏自治区”，普通外国公民以及自治区外藏地僧俗想要进入也需特别许可，且极难获得。每年3月“敏感月”，当局更会全面对外封锁西藏，只有中国游客才能全年自由进出西藏。\n\n曾以西藏高海拔气候为借口来狡辩其入藏限制政策的中共，近日罕见允许美国驻中国大使特里•布兰斯塔德（Terry Branstad）访问“西藏自治区”以及被划分成“青海省”的部分藏东地区。美国大使馆发言人透露，此行布兰斯塔德将同地方领导会晤，并提出对宗教自由所受限制的关切。\n\n中共外交部在本周一次例行记者会中提及此事，闭口不谈长期封锁西藏的事实，而是声称“欢迎布兰斯塔德大使一行到西藏走一走、看一看，实地了解西藏和平解放60多年来经济社会发展和人民生产生活发生的翻天覆地变化。”\n\n美国驻中大使馆透过微博官方账号发布数张布兰斯塔德在藏东塔尔寺与“西藏自治区”拉萨等地的照片。\n\n**美国大使无可能与藏人自由交流**\n\n国际声援西藏运动昨日发表声明指出，美国大使此次访问西藏，是美国对长期遭受中共高压统治的藏人所表现出的关切，而且这次访问也证明美方采取的措施的确有效。\n\n美国国务院在今年3月的一份有关西藏旅行限制状况的报告中指出，在2018年中国官方两次拒绝了美国大使的访藏要求，并且没有解释任何原因。而在去年底，美国国会通过《西藏旅行互惠法》，紧接着由总统签字生效。这一法律促成美国大使馆在经历4年的拒绝后，首次获准访问西藏。\n\n国际声援西藏运动在声明中指出：“我们知道大使在与藏人接触时必然会受到限制，也不会被允许与藏人自由交谈。过去有藏人因勇敢向外国访客表达真实观点，便被当局严厉惩罚。”\n\n声明也指出中国政府与官方媒体一定会利用美国大使的访问，塑造出中国没有封锁西藏的假象。同时否认当局对美国外交官员、记者与普通公民访藏权利的剥夺。尤其是藏裔美国人更遭受到不公对待，他们无法访问自己祖先的土地。\n\n国际声援西藏运动指出，美国大使是否能够公开坦诚地向外国媒体介绍他的访问经历，以及他在旅途中所受到的种种限制，这非常重要。另外值得大家注意的是，这些限制是中国外交官在美国绝不会遇到的。\n\n“我们将继续努力，确保在今年底使入藏法得到全面落实，并且让中国政府认清，他们必须停止对美国公民访问西藏权利的限制。”\n\n**西藏有可能在美中关系中发挥作用**\n\n美国外交关系专家伊利诺·艾伯特（Eleanor Albert）近日撰文分析西藏在中美关系中的位置。她认为美国大使访问西藏之际，西藏问题有可能于两国关系中发挥更大作用。\n\n伊利诺·艾伯特指出，这场访问受到北京和华盛顿的关注，只是双方的关注原因各异。她认为在贸易战正酣之际，双方都希望以贸易分歧之外的方式来构建关系。北京的算盘是，这次的行程如果成功，他们便可塑造出藏汉和平共处、西藏现代化，以及西藏文化语言宗教受到完好保护的景象，而华盛顿则是希望透过这次访问来表明川普当局对人权保护的支持。\n\n作者分析道，川普政府可能会在西藏问题上采取更加明确的立场，利用西藏向北京间接施压。有评论认为中国不断增长的国际影响力，正在削弱各方对西藏的支持，缩小自由西藏运动的政治空间。但是作者指出，美国仍然于去年制定了入藏法，该法形成的压力可能会促使中国审视、调整其入藏政策。\n\n伊利诺·艾伯特在文末提出，布兰斯塔德大使访问西藏所受到的媒体关注，是否能让藏人从中获益，还有待观察。\n\n<span data-cke-bookmark=\"1\" style=\"display: none;\"> </span>"
		},
		{
			"post_id": 135,
			"title": "比利时大选临近，七大政党回复西藏议题问卷表态声援藏人",
			"date_published": 1558688759.584,
			"body": "【西藏之声2019年5月22日报导】比利时国内七大政党在大选前回应援藏团体制作的西藏议题问卷，各方均对西藏境内的恶劣人权状况表示担忧，并一致承诺将争取欧盟成员国的入藏权利，落实外交对等原则。 国际声援西藏运动表示，比利时七大政党的回应证明该国对西藏的关注，并显示在其对中政策里，西藏议题必然会被列入议程。\n\n---\n\n5月26日比利时将举行联邦与地区大选，“国际声援西藏运动”（ICT）向比利时的七个政党发去西藏议题问卷，获得积极回应，各方均承诺会支持西藏事业。\n\n佛莱芒基督教民主党(CD&V)、民主联邦独立党(Défi)、生态党（Ecolo）、 绿党（Groen）、改革运动党（MR）、新佛莱芒联盟(N-VA)、社会民主党别派(SP.A) 共七个政党回答了所有十个问题。而社会党、工党等四个政党则未做出回应。\n\n国际声援西藏运动在官网刊出七大政党对西藏问卷做出的答复。\n\n七大政党均对西藏当下政治、文化与人权状况不断恶化表达担忧，同时也就中国政府对其他“少数民族”比如维吾尔人的对待方式非常担忧。\n\n各政党也承诺，将争取本国记者与外交官在不受限制的情况下访问西藏的权利。多数政党都认为应该从欧洲议会层面争取入藏权利对等，并强调如果中国拒绝取消对西藏的访问限制，那么欧盟也应该限制中国官员访问欧洲。\n\n被问及中国政府是否应该同达赖喇嘛尊者的代表展开对话，七大政党异口同声地表示支持。而在解决西藏议题的措施方面，有政党表示会发起国会跨党派合作，让西藏议题一直有机会获得关注。也有政党认为应在欧洲议会中争取跨国、跨党派的援藏力量。\n\n七大政党也均表示愿意在联合国等国际平台提出西藏议题，同时认为比利时政府应该欢迎达赖喇嘛到访。\n\n国际声援西藏运动欧盟政策主任文森特·迈藤（Vincent Metten）在声明中指出，为了藏人能够在中国占领60年后重获自由并有尊严的生活，他们需要国际社会的积极支持。而比利时政党对西藏问卷的答复显示，比利时政府在与中国接触时，必然会将西藏列入议程。\n\n文森特·迈藤感谢比利时七大政党参与西藏问卷调查，尤其感谢他们承诺为西藏的民众发声。"
		},
		{
			"post_id": 134,
			"title": "因展示达赖喇嘛照片引中共不满，联合国人权峰会被延期",
			"date_published": 1558406677.635,
			"body": "_【西藏之声2019年5月20日报导】联合国开发计划署原计划在斯德哥尔摩举办一场大型人权峰会，却因为会议的环节之一将投射达赖喇嘛尊者与中国异议人士艾未未的照片，而引发中共抗议。这场邀请了两百多人参加的人权峰会，最终选择延期举行。与此同时，瑞典一家媒体在社论中对比台湾的民主自由与中国的专制极权，中共大使馆随即去信抗议并要求“修正”，该媒体编辑则表示：“绝不！”_\n\n![1.jpg (0x0)](data/img/post_134_1.jpg)\n\n这张图片引发中共不满 翻拍自svt网站\n\n---\n\n据瑞典电视台（SVT）报道，联合国开发计划署(UNDP)原本计划于近日邀请两百多宾客，参加在斯德哥尔摩举办的一场大型的人权峰会。然而，活动却在原定开幕时间前两个小时突然取消。\n\n联合国开发计划署在回应媒体询问时证实道，突然取消峰会的原因，与达赖喇嘛尊者及中国异议人士艾未未的照片有关。\n\n这次人权峰会原定于斯德哥尔摩摄影博物馆（Fotografiska）举行，其中一个环节是名为 《我们拥有一个梦想》的数字图片展。数十名包括诺贝尔和平奖得主、艺术家以及其他活动人士的黑白照片，将被投射出来。其中就包括达赖喇嘛尊者与艾未未。\n\n活动开始前两个小时，受邀各方收到主办方的讯息，被告知活动已经取消。据报道，中共代表对达赖喇嘛的照片将在活动中投射的安排提出不满。\n\n联合国开发计划署对媒体的询问回应说，取消活动的原因，与图片展览中的一些作品有关。主办方的邀请函封面便是达赖喇嘛尊者与艾未未的照片，中共大使馆也收到了同一封邀请函。\n\n《我们拥有一个梦想》摄影展的制作方向媒体表示：“只有我们自己才能选择展览中该放谁的照片，其他人无权选择。”\n\n据报道 ，联合国开发计划署初步预估，这次因为取消人权峰会，而损失了至少20万瑞士克朗。\n\n中共大使馆：“请客观公正地报道中国”\n\n此外，日前瑞典媒体《尼瑞克日报》（NerikesAllehanda）因在一篇社论中承认台湾为国家，并且评论了中共的专制极权，而遭到中共驻瑞典大使馆抗议。\n\n中共官员致信《尼瑞克日报》要求将台湾部分进行“修正”，同时刊登中方的回应文章。\n\n《尼瑞克日报》的编辑尼尔森（Anders Nilsson）接受媒体采访时指出：“中国是专制极权国家，而专制极权国家的所作所为就是这个样子，所以我根本不奇怪。”\n\n这篇引发中共不满的社论中，赞扬台湾的民主与新闻、结社自由，同时谴责中国的极权专制，并提到中共的霸权主义。\n\n中共大使馆除了要求该日报社做出“修正”以外，还要求他们未来能够“客观公正”地报道中国。\n\n《尼瑞克日报》编辑指出，中国的审查长手已经伸向国外，伸到一个民主自由国家的新闻媒体面前。\n\n在被问及是否会修改有关台湾的报道内容时，《尼瑞克日报》的编辑回应说：“绝对不会！”"
		},
		{
			"post_id": 133,
			"title": "西藏团体在巴黎中共使馆外集会，敦促中共公布班禅喇嘛下落",
			"date_published": 1558225734.741,
			"body": "【西藏之声2019年5月18日报导】在西藏十一世班禅喇嘛被中共劫持24周年之际，位于各国的流亡藏人团体举办不同形式的活动进行纪念。在法国巴黎与美国旧金山，藏人与援藏人士聚集在中共使领馆前，挥舞西藏国旗、呼喊口号，要求中共立即释放这位自幼便被劫持的西藏宗教领袖。此外，西班牙与印度各地的流亡藏人也举办了纪念活动。\n\n![1.jpg (0x0)](data/img/post_133_1.jpg)\n\n巴黎大使馆外的抗议 图片由法国藏人协会提供\n\n昨天（5月17日）是十一世班禅喇嘛根敦确吉尼玛遭中共劫持24周年纪念日。在印南及达兰萨拉藏人社区，民众分别以机车巡游及研讨会等形式，让更多人了解这起西藏宗教领袖被中共劫持的事件。\n\n---\n\n而在欧美国家的流亡藏人，也举办集会抗议中共持续劫持班禅喇嘛。\n\n法国巴黎\n\n当地时间17日，部分法国藏人聚集在巴黎中共大使馆前示威抗议，挥舞西藏国旗并展示十一世班禅喇嘛的照片，要求中共公布他的下落。这场活动由法国藏人协会、自由西藏学生运动、西藏青年会等藏人组织共同举办。\n\n自由西藏学生运动法国分会长丹增强秋从抗议活动现场接受本台采访指出，各方聚集在中共大使馆外集会，是为了抗议中共对班禅喇嘛的劫持。“他已经失踪24年，外界一直无法了解他现在的状况。我们要求中共当局透露班禅喇嘛的下落，并且立即释放他。”\n\n活动人士也向过往民众发放传单，介绍班禅喇嘛失踪案。\n\n西班牙巴塞罗那\n\n此外，在西班牙巴塞罗那，西藏议会欧洲区议员图丹旺青也带领活动人士进行纪念。\n\n部分藏人与援藏人士在巴塞罗那市一广场集会，展示西藏国旗与十一世班禅喇嘛的照片，抗议中共的劫持行为，同时要求当局尊重境内藏人的宗教、文化语言自由，并且停止破坏西藏的生态环境。\n\n![2.jpg (0x0)](data/img/post_133_2.jpg)\n\n旧金山中领馆外的抗议 图片翻拍自SFRTYC脸书\n\n美国旧金山\n\n美国旧金山的西藏青年会分会、自由西藏学生运动分会等团体，也于17日在中共驻旧金山领事馆前举办抗议活动。\n\n根据活动团体上传至网络的视频显示，当时有大量民众在领事馆外排队等候办理签证。活动人士们展示西藏国旗与班禅喇嘛的照片，持扩音器呼喊口号，要求中共当局向外公布班禅喇嘛的下落，同时呼吁国际社会帮助寻找这位曾是世界上最年轻政治犯的宗教领袖。\n\n与此同时，藏人行政中央昨天邀请数名专家与人权团体代表，参加以班禅喇嘛失踪事件为主题的研讨会。\n\n与会各方讨论了班禅喇嘛在藏传佛教中的重要地位、历代班禅喇嘛与达赖喇嘛之间的特殊关系，以及十一世班禅喇嘛被劫持对藏人所造成的影响等等。 此次研讨会也分析了十世班禅喇嘛撰写的《七万言书》，以及他对西藏宗教与文化的保护所做出的重要贡献。\n\n十一世班禅喇嘛背景\n\n根敦确吉尼玛于1995年5月14日当天，被达赖喇嘛尊者认定为十世班禅喇嘛的转世灵童。三天后(5月17日)，根敦确吉尼玛与家人一同被中共当局劫持，至今下落不明。\n\n![3.jpg (0x0)](data/img/post_133_3.jpg)\n\n班禅喇嘛根敦确吉尼玛失踪时年仅6岁，上月他已满30岁。在西藏团体的委托下，英国一位法医艺术家（Forensic Artist）以班禅喇嘛6岁时的照片为基础，借助科技模拟，推断他30岁的模拟肖像，并于上月他生日之际透过媒体公布。"
		},
		{
			"post_id": 132,
			"title": "加国会议员提动议，要求政府积极关注西藏议题支持藏人自治",
			"date_published": 1558093848.221,
			"body": "【西藏之声2019年5月16日报导】加拿大长期支持西藏运动的参议员吴蓝海近日于参院提出动议，要求加拿大政府积极关注西藏议题，并呼吁中共与藏人重启对话，让西藏享有名副其实的自治权利。此外，这份动议也呼吁加拿大争取不受限制访问西藏的外交对等权利。\n\n---\n\n5月4日，加拿大国会参议员吴蓝海（ThanhHai Ngo）于参院提出一份动议，要求加拿大政府积极支持西藏获得名副其实的自治。\n\n吴蓝海希望加拿大呼吁中国，向“西藏自治区”与其他藏地给予名副其实的自治，并且重启藏中对话。\n\n他在参院发言指出：“我在2017年11月23日讲过这个问题，我仍然深深地为西藏人权没有获得改善而感到担忧。在加拿大，我们的基本权利与自由获得保障，包括表达、宗教、行动与思想自由。我们能够享受的这些自由，在西藏却被不断打压限制。”\n\n西藏动议内容为：\n\n参议院敦促加拿大政府积极支持西藏获得名副其实的自治，并且呼吁中华人民共和国能够：\n\n一，真诚地以“中间道路”为基础，重启藏中对话；\n二，尊重西藏人民的语言权利，以及行动、思想与宗教自由；\n三，释放所有藏人政治犯，停止对异议人士对拘押；\n四，向加拿大提供不受限制访问西藏的外交对等权利。\n\n参议院也敦促加拿大政府能够承认，由达赖喇嘛所认证的根敦确吉尼玛才是真正的十一世班禅喇嘛。\n\n吴蓝海在这份动议中特别指出，由于达赖喇嘛是藏传佛教中最重要的精神领袖，中共一直竭力限制、掌控达赖喇嘛的决策权，妄图使他选择的班禅喇嘛失去合法性。也正因为如此，加拿大政府应该承认由达赖喇嘛认证的班禅喇嘛。\n\n去年6月，加拿大参院人权、外交事务以及贸易委员会举办听证会，藏人行政中央司政洛桑森格受邀在会上介绍了西藏的地缘政治重要性，并寻求加拿大对西藏自由抗争的继续支持。"
		},
		{
			"post_id": 131,
			"title": "美参议员敦促美国与国际合作以维护西藏宗教自由",
			"date_published": 1557815187.522,
			"body": "【西藏之声2019年5月13日报导】美国参议员们于上周连署致函美国宗教自由大使，该信中邀请他分享如何与国际社会合作以维护西藏宗教自由的看法。与此同时，信中指出包括中国政府在内的任何政府采取行动干预或“指派”下一任达赖喇嘛，都会破坏藏传佛教机构的合法性。此外，参议员们透过该信呼吁美国政府，应确保西藏在不受北京或任何其他政府的干涉下，根据宗教习俗选出第十五世达赖喇嘛。\n\n![1.jpg (0x0)](data/img/post_131_1.jpg)\n\n连署信内容截图\n\n---\n\n上周，美国参议员们连署致函美国国际宗教自由无任所大使布朗拜克，该信中邀请布朗拜克(Sam Brownback)分享美国该如何支持西藏佛教徒，以及如何与国际社会合作以维护西藏宗教自由等看法。\n\n这封信传达出签署者们的理念为“推广宗教自由必须是美国外交政策的核心支柱”，同时传达出宗教传统不应受到任何政府的侵犯。\n\n信中指出美国同样也关注保护佛教徒享有宗教自由的权利，并确保他们的宗教机构，如同所有宗教的机构不会受到破坏，并且能够自由地运作。因此，包括中国政府在内的任何政府采取行动干预或“指派”下一任达赖喇嘛，都会破坏藏传佛教机构的合法性。\n\n此外，该信在谈及西藏转世制度的问题时表示：“虽然我们不能作为佛教信仰或转世制度的仲裁者，但我们坚信维护宗教自由的制度──西藏佛教社区和达赖喇嘛能够在没有政府干预下决定转世的地点和人选。”\n\n信中最后呼吁：“我们敦促你们推动美国政府和国际社会共同努力，确保西藏在不受北京或任何其他政府的干涉下，根据宗教习俗选出第十五世达赖喇嘛。”\n\n![2.jpg (0x0)](data/img/post_131_2.jpg)\n\n美国议员们连署信的签名"
		},
		{
			"post_id": 130,
			"title": "世界国会议员西藏大会圆满落幕，并公布三十三条共识",
			"date_published": 1557814839.954,
			"body": "【西藏之声2019年5月13日报道】第七届“世界国会议员西藏大会”于近日在拉脱维亚首都里加举行。来自数十个国家的国会支持西藏组织代表公布了一份含有三十三条关于西藏议题的共识。该共识批评中共当局侵犯西藏人权，呼吁中共以中间道路为基础同西藏重启和谈。\n\n![1.jpg (0x0)](data/img/post_130_1.jpg)\n\n第七届“世界国会议员西藏大会”于本月8日至10日间在拉脱维亚首都里加召开，该大会由国际议会援藏联络组织、拉脱维亚议会援藏组织，以及西藏人民议会等组织联合举办。来自数十个国家的国会支持西藏组织代表、西藏人民议会议长以及藏人行政中央司政洛桑森格等一同出席会议。\n\n---\n\n据本台驻瑞士记者发来的消息，与会者们在为期三天的会程中，讨论多项有关西藏的议题。会议最后一天，他们公布了一份含有三十三条关于西藏议题的共识。\n\n西藏人民议会议长白玛炯乃受访时介绍说，共识内容包括强调西藏在历史上的独立地位、反对中共干涉藏传佛教的转世制度、关切藏人为抗议中共而自焚的事件、反对中共破坏西藏的语言文化和环境，以及践踏人权的行径等。此外，共识内容呼吁各国政府效仿美国国会去年通过的《西藏旅行互惠法》，争取自由进入西藏的权利，并敦促中共以中间道路为基础同西藏重启和谈。\n\n白玛炯乃还指出：“这些援藏议员们不顾中共的施压手段,并排除万难参加会议，这已向中共传达一个信息——中共企图施压议员们的妄想是无法达成的。”\n\n参加“第七届世界国会议员西藏大会”的与会人士有来自拉脱维亚、澳洲、英国、新西兰、法国、罗马尼亚、加拿大、捷克共和国、印度，以及尼泊尔等数十国家的二十四名议员。\n\n据了解，首次国际议会支持西藏组织大会于1994年在印度新德里举行，上一次大会于2012年在加拿大首都渥太华举行。当时达赖喇嘛尊者与数十个国家的50多名国会议员，以及多个非官方机构代表共120余人参加了大会。"
		},
		{
			"post_id": 129,
			"title": "加拿大议员吁政府争取自由进入西藏的外交对等原则",
			"date_published": 1553310537.71,
			"body": "【西藏之声2019年3月22日报道】《西藏旅行互惠法》在美国生效后，引起其他国家议员的效仿。继欧洲议会议员日前联署要求欧洲实践同样互惠原则之后，加拿大国会参议员吴蓝海也提出动议通知，敦促政府向中国争取自由进入西藏的互惠权利，同时推动以中间道路为基础的藏中对话。 此外，人权观察今天呼吁法国总统会见习近平时，要求对方释放扎西文色等政治犯。\n\n加拿大国会参议员吴蓝海（Ngo ThanhHai）于昨天（3月21日），在参院提出有关西藏议题的动议通知“Notice of motion”。\n\n---\n\n**加拿大应该推动以中间道路为基础的藏中对话**\n\n该动议通知内容敦促加拿大政府支持西藏争取名副其实的自治，同时要求加拿大推动以中间道路为基础的藏中对话，并敦促中国尊重藏人的语言权利、行动自由、宗教自由，释放所有藏人政治犯，停止对异议人士的任意拘押。\n\n吴蓝海在动议中特别提出，加拿大应该争取在不受限制的情况下访问西藏的权利，如此才顺应两国间的外交对等原则。\n\n去年底，美国国会参众两院先后通过“西藏旅行互惠法”, 并由总统签字生效，成为法律。这一法案旨在结束中国对西藏的封锁，要求中国政府允许美国记者、外交官以及游客，在西藏不受限制地旅行，正如中国的记者与外交官以及大众能够自由访问美国一般。\n\n美国通过这一法律后，北京宣布将加速外国游客入藏程序，这一反应被指是入藏法产生效果。\n\n就在上周，数十名欧洲议会议员及欧洲各国国会议员联署发表诉求信，要求欧洲也能够采取美国《西藏旅行互惠法》一样的举措，以使欧洲重新平衡与中国的关系，争取无限制访问西藏了解真相的权利。\n\n**人权观察：法国马克龙应就人权施压习近平**\n\n与此同时，习近平将于2019年3月24日至26日访问法国，人权观察今天（3月22日）致函法国总统马克龙，促其遵守诺言，不得在中国国家主席习近平近期访法期间“掩盖”中国侵犯人权事实。\n\n人权观察中文网消息指出，该组织敦促马克龙采取各种举措向习近平施压，并且要求中国允许联合国人权事务高级专员和其他联合国代表进入“新疆”进行有意义的视察、释放王全璋、伊力哈木.土赫提、扎西文色和李明哲等等被非法拘留的人权护卫者及和平异见人士。"
		},
		{
			"post_id": 128,
			"title": "数十名欧洲议员联署呼吁重新平衡欧中关系要求中国停止封锁西藏",
			"date_published": 1552828044.334,
			"body": "【西藏之声2019年3月15日报导】欧洲议会议员，以及欧洲各国国会议员共三十五人，联署发表诉求信，要求欧洲也能够采取美国《西藏旅行互惠法》一样的举措，以使欧洲重新平衡与中国的关系，争取无限制访问西藏了解真相的权利。"
		},
		{
			"post_id": 127,
			"title": "法议员质询：当习近平访问法国时，政府该如何捍卫西藏",
			"date_published": 1552827989.242,
			"body": "【西藏之声2019年3月16日报道】法国一位参议员向法国政府提交书面质询，要求法国政府在今年3月下旬习近平访问法国时提及西藏议题，并质询政府将采取什么措施来挑战中共，以便让西藏的语言文化得到保障和维护。"
		},
		{
			"post_id": 126,
			"title": "援藏人士呼吁联合国敦促中共同西藏重启和谈",
			"date_published": 1552639238.525,
			"body": "【西藏之声2019年3月14日报道】联合国人权理事会第四十届会议于2月下旬在日内瓦举行，援藏人士凯•穆勒在会上指出，解决藏中问题的唯一途径就是进行和谈，因此他呼吁联合国为重启藏中和谈而采取更大的行动。此外，人权组织“保护受威胁人民协会”举办了一场周边会议，数位藏人代表受邀出席，并于演讲期间遭受中共领事馆人员闹场，企图影响会议进行。\n\n![1.jpg (0x0)](data/img/post_126_1.jpg)\n\n联合国人权理事会第四十届会议于2月下旬在日内瓦举行，欧盟、瑞典、新西兰，以及爱尔兰和捷克等国的代表们提及了中共的人权问题。此外，德、法两国则对西藏和新疆地区的人权问题表示担忧。国际声援西藏运动驻德国分部成员凯•穆勒（Kai Müller）在本月13日当天，以赫尔辛基人权基金会（Helsinki Foundation for Human Rights）代表的身份出席会议并发表演讲。\n\n---\n\n根据本台驻瑞士记者消息指出，凯•穆勒在会议中提到，中共当局严重破坏西藏的宗教与语言文化，打压境内藏人的言论和表达自由等基本人权，因此导致一百五十多名藏人自焚。\n\n凯•穆勒表示中共当局限制外国人进入西藏，尤其在敏感月期间，禁止外国记者和官员等进入西藏。因此，他呼吁联合国人权部向中共施加压力，并允许联合国特别代表小组、自由观察员，以及其他官员前往西藏调查那里的真实状况，并指出中共的这些举措分明践踏了联合国的有关规章制度。\n\n凯•穆勒还指出解决藏中问题的唯一途径就是进行和谈，因此他呼吁联合国为重启藏中和谈而采取更大的行动。\n\n藏人行政中央驻日内瓦办事处人权处负责人甘丹措姆，她以人权组织“保护受威胁人民协会”（Society for Threatened Peoples）的代表身分出席，并介绍了过去六十年里西藏人权状况不断恶化的现象，包括数百藏人自焚抗议中共的事件等，并呼吁联合国加强对西藏人权问题的关注，以及敦促中共同西藏重启谈判。\n\n此外，13日午后人权组织“保护受威胁人民协会”举办了一场周边会议。有联合国非官方代表、领事馆员，以及其他援藏人士出席会议。藏人的代表有流亡藏人议员朗杰卓嘎、西藏前政治犯顿珠旺青、藏人行政中央外交部人权部工作员赤列曲吉等人，他们在会议上依次发表演讲。\n\n![2.jpg (0x0)](data/img/post_126_2.jpg)\n\n在藏人代表演讲的时候，一名中共领事馆人员在众人面前喧闹，试图扰乱会议，但随后工作人员将他驱赶，会议照常进行。\n\n当天，数十名藏人在联合国大楼前举办活动，除了推介西藏人权问题外，他们还呼吁联合国关注西藏人权问题。该活动由瑞士的三个藏人家庭联合，于2012年国际人权日起开始举办，这是他们第八十八次举办活动。"
		},
		{
			"post_id": 125,
			"title": "美国宗教自由无任所大使呼吁中共立即释放班禅喇嘛",
			"date_published": 1552638972.951,
			"body": "【西藏之声2019年3月14日报导】近日美国国际宗教自由无任所大使布朗巴克出席了一场在由香港外国记者会举办的早餐会，谈及中共长期以来干涉藏人选择宗教领袖的决定，包括下一任达赖喇嘛尊者转世制度的选择。布朗巴克呼吁中共立即释放藏人所认可的班禅喇嘛，或是告诉全世界事情的真相和他的现况。此外，他表示：“我们不接受中国政府总是解释班禅喇嘛正在学习并且不想被打扰的理由。”\n\n![9.jpg (0x0)](data/img/post_125_9.jpg)\n\n取自FCC HK视频截图\n\n美国国际宗教自由无任所大使布朗巴克（Sam Brownback）于3月8日出席了由“香港外国记者会FCC HK”举办的早餐会，谈及中共如何打压其治下各地区的宗教自由，他指出美国政府根据“国际宗教自由法”连续十八年将中国列为“特别关注国”。根据香港外国记者会公布的视频，在演讲期间，布朗巴克谴责中共一直以来干涉藏传佛教选择其宗教领袖的决定，如下一任达赖喇嘛尊者转世制度的选择。\n\n---\n\n此外，他明确地指出中共对西藏宗教领袖的干涉，包括1995年绑架当时年仅六岁的第十一世班禅喇嘛根敦确吉尼玛和他的父母，中共当局一直拒绝向外透露他的确切状况，目前世人仍不清楚十一世班禅喇嘛是否还活着。\n\n为此，布朗巴克强硬地表态：“我们呼吁中国政府立即释放藏人所认可的班禅喇嘛，或是告诉全世界事情的真相和他的现况。而且，我们不接受中国政府总是解释班禅喇嘛正在学习并且不想被打扰的理由。”\n\n与此同时，布朗巴克还列举了中共对藏传佛教习俗和西藏文化涉及侵略性的干涉。包括中共规定限制藏人僧俗们朝圣，当局任命党员干部管理寺院并禁止儿童参加宗教活动。不仅如此，有的寺院还被中共拆毁，成千上万的僧尼被驱逐出寺院，他们被迫接受政治再教育，此外，中共要求所有僧尼诋毁达赖喇嘛尊者。\n\n布朗巴克指出，中共当局在西藏境内禁止达赖喇嘛的画像以及尊者弘法的画面，并逮捕那些在公开场合对达赖喇嘛表示崇敬的人。他补充道：“中国政府种种举措表明他们可能会干涉达赖喇嘛下一任转世制度的选择。”\n\n布朗巴克提到：“国际社会必须明确表示我们相信西藏人如同其他信仰团体的成员一样，能够在没有政府干预的情况下选择他们的宗教领袖，并且尊重他和给予他教育。”\n\n美国总统川普多次表示“美国是有信仰的国家”，他在上任后积极推动促进宗教自由相关举措，2016年12月，川普推动《全球马格尼茨基人权问责法》正式落为法令；2018年5月，美公布“2017年国际宗教自由报告”，中国连续十八年被列为“特别关注国”；2018年7月，举行首次全球部长级宗教自由大会，会后发布“波托马克宣言”(Potomac Declaration)和“波托马克行动计划”(Potomac Plan of Action)，敦促世界各国政府把宗教自由作为优先政策。"
		},
		{
			"post_id": 124,
			"title": "外媒：西藏抗暴六十周年中共武装封锁达赖喇嘛诞生地",
			"date_published": 1552635246.58,
			"body": "【西藏之声2019年3月14日报道】路透社记者在西藏抗暴六十周年前夕，赴达赖喇嘛尊者的诞生地西藏当采(今青海省平安县红崖村)采访，但却发现仅有六十户人家的小村，被配有自动武器的警察与不明身份的便衣人士阻拦。对方告诉记者，那里是“私人的”，“不对外开放”。\n\n![1.jpg (0x0)](data/img/post_124_1.jpg)\n\n照片翻拍自路透社\n\n达赖喇嘛尊者的诞生地为西藏塔尔寺附近的当采（སྟག་འཚེར་又：塔泽），如今被中共政府划分为青海省平安县红崖村。那里长年有信众前去朝拜，吸引外国游客的同时，也出现不少中国安全人员。\n\n---\n\n路透社记者在达赖喇嘛尊者被迫流亡六十周年之际前往当地，却发现通往这个只有六十户人家小村的主要道路，被配备有自动武器的警察封锁。\n\n![2.jpg (0x0)](data/img/post_124_2.jpg)\n\n照片翻拍自路透社\n\n警察与另外十几名不愿表明身份的便衣人员，拒绝路透社记者进入村落，声称该村是“私人的”，不对外开放。\n\n中共当局长期宣称达赖喇嘛是“披着袈裟的狼”，不断污蔑诋毁达赖喇嘛策划暴力事件、意图分裂中国。日前，中共治藏一把手吴英杰在人大会议期间称：“达赖没有对西藏人民做一件好事。”\n\n境内六百万藏人普遍尊崇爱戴达赖喇嘛尊者，他们甚至不允许持有一张达赖喇嘛的照片。\n\n记者前往临近当采的的热贡（今同仁县），一名藏人告诉他，境内藏人其实都知道今年是达赖喇嘛流亡六十周年，尽管当局禁止任何形式的公开纪念活动。\n\n他对记者说：“你只能将此藏在心中，只是不讲出来而已。我们没有反对政治的能力，只能追随社会。”"
		},
		{
			"post_id": 123,
			"title": "全球各地的藏人与援藏者共同纪念西藏自由抗暴六十周年",
			"date_published": 1552381668.415,
			"body": "【西藏之声2019年3月11日报导】3月10日西藏自由抗暴六十周年纪念日当天，世界各国的流亡藏人、援藏团体均在各地举行纪念活动，徒步游行或在中共使领馆前示威抗议，同时声援境内仍在遭受中共统治的藏人，呼吁国际社会加大对藏人自由抗争的关注与支持。\n\n![1.jpg (0x0)](data/img/post_123_1.jpg)\n\n**藏人行政中央官方纪念仪式**\n\n昨天（3月10日），藏人行政中央于印北达兰萨拉大乘经院中，为西藏抗暴日举办官方纪念仪式。内阁及议会成员、印度与各国的外国宾客，以及达兰萨拉僧俗共同参加了活动。\n\n---\n\n司政洛桑森格宣读内阁声明时，呼吁中共应该与达赖喇嘛尊者的特使重启藏中间的和谈，而特使也早已准备好以“中间道路”政策，透过和谈解决西藏问题。\n\n司政洛桑森格表示六十年的占领和武力镇压对西藏来说持续太久了，而西藏所遭受的苦难清楚地提醒内阁还有许多工作需要完成，他指出为确保西藏争取自由抗争向前推进，内阁已正式宣布2019年为“承诺年Year of Commitment”，他呼吁全世界热爱自由的人们承诺终止中共对西藏的压迫，并且他承诺将十四世达赖喇嘛尊者送回拉萨布达拉宫。（内阁抗暴日声明：英文、中文）\n\n西藏议会议长白玛炯乃宣读议会声明，强调由达赖喇嘛尊者提倡、藏人行政中央秉持的中间道路立场无任何改变，无论中共何时重启和谈，藏方早已做好准备，并提醒中共当局别妄想毁灭西藏以及把西藏改造成汉地，而是立即与藏人代表重启对话，和平解决西藏问题。（议会抗暴日声明：英文、中文）\n\n博茨瓦纳前任总统伊恩•卡马(Ian Khama)也出席官方纪念仪式，他指出南非曾经被压迫的人民也像藏人一样，他们在寻求创造更美好未来的同时，也仍然坚持不懈地寻求国际社会的支持。此外，他勉励在场的藏人们，“你的抗争虽然漫长而痛苦，但仍可在内心保持着不被击败，在心中你已经自由了。有了这样心态和决心的共同力量，最终胜利肯定是你的。”\n\n**印度（达兰萨拉、新德里）**\n\n如同往年，官方纪念仪式结束后，游行活动才开始，今年活动由五个非官方组织共同举办。流亡藏人以及援藏人士皆于达兰萨拉大乘经院外集合，徒步游行到下达兰萨拉警察广场(Police Ground)。\n\n此外，游行最后的亮点是两个滑翔翼分别吊挂印度国旗、西藏国旗盘旋在警察广场的天空上以纪念这次抗暴日六十周年。\n\n两千多名藏人和印度援藏人士在印度首都新德里坚德曼德示威区（Jantar Mantar）举行大型的抗议活动，活动由西藏青年会组织主持，从新德里的拉姆.利拉（Ram Leela）广场徒步游行到坚德曼德示威区。前藏人行政中央内政部长嘉日卓玛、新德里议会议员艾卡•兰巴(Alka Lamba)、印度议员巴许思坦•纳连辛(Bashistha Narain Singh)、印度著名作家维杰•克兰蒂(Vijay Kranti)等人出席活动，他们依次进行了讲话。\n\n**北美地区（美国、加拿大）**\n\n数百藏人与援藏人士在纽约举办西藏自由抗暴纪念活动，他们于早上八点从纽约布鲁克林的卡德曼广场公园（Cadman Plaza Park）开始示威游行，抗议者们手持西藏国旗、高呼西藏自由和独立等口号。\n\n接下来他们在联合国广场(United Nations Plaza）集会，由藏人行政中央驻北美办事处代表欧珠次仁、多伦多士嘉堡大学学生会长齐美拉姆（Chemi Lhamo）以及许多援藏人士依次发表讲话。随后，抗议者们前往中共使馆前，同样手持西藏国旗和高喊口号，纪念活动由西藏的八个团体联合举办。\n\n此外，美国国会众议长的南希•佩洛西也发表抗暴日声明，她指出美国国会将继续采取行动，直到所有藏人都能生活在和平、希望，以及繁荣之中。\n\n加拿大渥太华、多伦多、蒙特利尔以及温哥华等城市的藏人协会，联合加拿大全国藏人协会，共同于3月1日提前纪念。数百名藏人与援藏人士手持西藏国旗于加拿大国会大厦前集会，宣读了部分国会议员的支持声明，并安排不同团体代表致词。之后，众人一路呼喊口号，游行至中共大使馆前再度集会示威。\n\n加拿大国会议员阿里夫•威尔拉尼（Arif Virani）和兰德尔•加里森（Randall Garrison）参加外，保守党议员吴兰海（Thanh Hai Ngo）还发表了支援西藏的声明。\n\n**欧洲国家（比利时、奥地利、意大利、捷克、瑞士、法、英、德）**\n\n五千多名来自英、德、意，以及法国和瑞士等十六个国家的藏人和援藏人士，在比利时布鲁塞尔展开“欧洲支持西藏”（EuropeStandwithTibet）的活动。欧洲议会议员们出席活动，他们并发表支持西藏自由抗争运动的演讲。此外，藏人行政中央的内政部长阔拉仓•索朗多杰和来自欧洲的西藏议会议员亦出席活动。\n\n在法国、奥地利、意大利，以及德国等欧洲的其它国家内亦举办各种活动，包括唱西藏国歌、升西藏国旗等。在捷克共和国与英国的数千处地方升挂了西藏国旗来纪念抗暴日。瑞士国会援藏团体的三十三名议员也向欧洲议会提交了呼吁欧盟支援西藏的联署信。\n\n**其他地区（澳州、日本、台湾）**\n\n三百多名藏人和援藏人士在澳州首都坎培拉举行抗议活动，他们手持横幅、高举西藏国旗、口喊西藏自由、达赖喇嘛尊者要回家、西藏独立等口号，徒步游行到中共使馆前。澳州国会议员迈克尔•丹贝（Michael Danby）、藏人行政中央驻澳州办事处代表拉巴措果，以及不同团体的代表出席纪念的活动，他们依次发表演讲。\n\n同样，在悉尼、墨尔本、昆士兰等地的藏人和援藏人士亦在各地举办纪念活动。\n\n3月10日游行当天早上，日本援藏人士们手持境内自焚者海报在中国驻日大使馆前抗议，随后下午在东京浅草集会游行，现场共有一百四十名援藏人士参与游行。\n\n这次在台湾的310游行活动有超过二十个台湾民间团体共同主办，游行当天天候不佳，但在台湾的藏人及援藏人士们仍穿上雨衣并风雨无阻的参加游行，现场参与游行的人数高达一千二百人。\n\n此外，在台湾的民间团体也发起了“邀请达赖喇嘛来台连署”，短短一天时间连署人数已达两千人，共有十三个民间团体参与连署，其数字持续增加中。"
		},
		{
			"post_id": 122,
			"title": "联合国人权理事会第四十届会议，中共称坚决反对他国干涉内政",
			"date_published": 1552024781.937,
			"body": "【西藏之声2019年3月7日报道】联合国人权理事会第四十届会议于近期在日内瓦召开，中共回应对第三轮普遍定期审议中346项有关藏人、维吾尔人、蒙古人，以及香港人等人权的提问当中，中共逃避回答部分问题。\n\n联合国人权理事会对中国人权的第三轮普遍定期审议，于去年11月6日在日内瓦召开。有美、加、英、日，以及法国、瑞典、德国等十三个国家的代表在审议时，要求中共改善对藏人实施的政策，包括宗教信仰、言论、集会的自由，并允许联合国人权高专和其它官员，以及外国的媒体记者自由进入西藏。\n\n---\n\n联合国人权理事会第四十届会议于2月下旬在日内瓦举行，中共对去年数十个国家的代表所提出的谴责作出回应，但中共仍表示否认，指出以上提及的要求只能按照中共的法规来实施，并指出“坚决反对他国干涉内政”。\n\n藏人行政中央驻日内瓦办事处人权处负责人甘丹措姆向本台驻日内瓦记者介绍说，中共虽然在此次会议上拒绝接受数十个国家的代表们所提出的要求，但对藏人而言仅仅能够提交意见也算是一个收获，因为这毕竟施加给中共一定的压力。\n\n甘丹措姆继续表示：“在每一轮普遍定期审议中，不仅各国的提问数量普遍增多，而且中共亦增加了参与的人数。，在第三轮普遍定期审议时，中共透过书籍和图片等一系列粉饰太平的宣传方式，企图美化西藏人权目前的处境。因此，这已证实了各国对中共施加了一定的压力。”\n\n中共在联合国人权理事会第三轮审议时，有比利时、克罗地亚、捷克、匈牙利、希腊，以及墨西哥和土耳其等许多国家的代表们提出了有关“少数民族”的权利外，亦有部分国家在审议过程中提及了346项有关藏人、维吾尔人、蒙古人，以及香港人等人权的提问，但目前中共逃避回答部分问题。\n\n甘丹措姆还介绍说，联合国的其它有关人权的会议中，每一个国家都有权不作答复，但在联合国普遍定期审议中，凡是被提问都必须回答。然而中共逃避回答则显示出他们在人权上有极大的问题。\n\n据悉，人权组织“保护受威胁人民协会”（Society for Threatened Peoples）于本月13日，以西藏政治犯的状况、宗教信仰权利，以及儿童权利为主题进行一场会议，与会人员有西藏前政治犯组织主席朗杰卓嘎、西藏前政治犯顿珠旺青，以及藏人行政中央外交部人权部工作人员次乃秋结等人。"
		},
		{
			"post_id": 121,
			"title": "英国与加拿大等多个城市提前纪念西藏310自由抗暴六十周年",
			"date_published": 1552024521.787,
			"body": "【西藏之声2019年3月6日报导】西藏310自由抗暴六十周年纪念日将至，英国北安普顿市政厅连续20年以升挂西藏国旗的方式进行纪念。与此同时，加拿大多个城市的藏人与援藏者也提前在渥太华举办集会，并在中共大使馆前示威抗议，提前纪念抗暴日。在台湾，藏台人权连线完成了今年最后一次“为西藏自由而骑”骑程，呼吁各方支持3月10日当天在台北举行的大游行。\n\n今年3月10日是西藏自由抗暴六十周年纪念日，世界各地支持西藏团体与流亡藏人社区都在积极筹备纪念活动。也有部分国家的政府和议会，以及民间团体，以集会、示威、升挂西藏国旗等途径提前纪念。\n\n---\n\n**台湾“2019为西藏自由而骑”末次骑程**\n\n西藏台湾人权连线按照传统，在今年310西藏抗暴日前夕又发起一轮“为西藏自由而骑Cycling for a Free Tibet”活动，先后在台北、高雄与台中举办共计9场骑行与西藏议题推介活动。\n\n今天是“2019为西藏自由而骑”在310自由抗暴日前的最后一次骑程。藏台连线在直播活动中强调，这并不是纪念活动的结束，希望大家在3月10日抗暴日当天，参加由台湾多个民间团体联合举办的“浩劫一甲子西藏要自由，310西藏抗暴日60周年大游行”。\n\n藏人行政中央驻台办事处与在台藏人福利协会也于3月3日至15日间，在台北自由广场举办“西藏流亡一甲子纪念展”，希望让更多台湾民众与来自中国的观光客能够了解西藏议题。\n\n**英国北安普顿市政厅升挂西藏国旗**\n\n英国中部北安普顿市的市长托尼.安塞尔(Tony Ansell)在其官方脸书发布声明，表示3月5日当天，自己与该市行政官员杰妮. 克罗夫茨（Jayne Crofts)、其他多名市议员、藏人行政中央驻英国代表索南次仁、西藏人民议会议员索南诺布，以及当地民众约百人，一同聚集在市政厅前，以升挂西藏国旗的方式，向争取自由的藏人们致意，纪念西藏抗暴六十周年。\n\n据悉，北安普顿市已经延续了20年的传统，在自由抗暴日前后升挂西藏国旗，以示对藏人的支持。\n\n另据藏人行政中央英文官网消息，英国国会支持西藏小组与援藏组织“英国西藏社区”也于3月5日提前纪念抗暴日。\n\n英国国会支持西藏小组共同主席克里斯•罗（Chris Law）、议员蒂姆•劳顿(Tim Loughton)等四名不同党派的国会议员，以及西藏人民议会议员欧珠索南、英国援藏团体成员与当地藏人，聚集在伦敦西敏寺外的“无辜战争受难者”纪念碑前，举办献花仪式提前纪念抗暴日。\n\n**加拿大藏人在中共大使馆前集会**\n\n据西藏人民议会秘书处发布的消息，加拿大渥太华、多伦多、蒙特利尔以及温哥华等城市的藏人协会，联合加拿大全国藏人协会，共同于3月1日提前纪念西藏310自由抗暴六十周年。\n\n数百名藏人与援藏人士手持西藏国旗于加拿大国会大厦前集会，宣读了部分国会议员的支持声明，并安排不同团体代表致词。之后，众人一路呼喊口号，游行至中共大使馆前再度集会示威。\n\n**捷克首都布拉格将升挂西藏国旗**\n\n此外，捷克首都布拉格市长贺吉普(ZdeněkHřib)日前公开表态，指出将于3月8日至11日间，于市政厅前升挂西藏国旗，纪念西藏自由抗暴日。\n\n布拉格市从2004年开始了于310西藏抗暴日升挂西藏国旗的传统。但是2014年至2018年期间，该市由竭力同中共建立关系、甚至不惜牺牲人权问题的市长执政，一度停止升挂西藏国旗传统。\n\n现任市长贺吉普表示自己不会为了经济利益，而像上任一样无视中国人权与自由问题。\n\n据悉，藏人行政中央司政洛桑森格已经抵达布拉格，出席“感谢捷克”活动，并参加“同一个世界”捷克国际电影节，担任颁奖嘉宾。布拉格市长日前公开表示，将于3月6日接见流亡藏人政治领袖。"
		},
		{
			"post_id": 120,
			"title": "加拿大官方反对党领袖发表声明支持西藏中间道路",
			"date_published": 1551789822.08,
			"body": "【西藏之声2019年3月5日报导】西藏自由抗暴六十周年纪念日将至，世界各国的援藏团体和藏人均在计划各种形式的纪念活动。同时是加拿大联邦保守党党魁和官方反对党领袖的安德鲁•谢尔发表声明，指出支持加国藏人诉求西藏自由的抗争运动。\n\n![9.jpg (0x0)](data/img/post_120_9.jpg)\n\n声明书截图至加拿大援藏团体推特\n\n今年3月10日是达赖喇嘛尊者带领数万藏人流亡印度的六十周年，世界各国的援藏团体和藏人均在计划各种形式的纪念活动。同时是加拿大联邦保守党党魁和官方反对党领袖的安德鲁•谢尔（Andrew Scheer）近日发出声明，表示支持加国藏人诉求西藏自由的抗争运动。声明由“加拿大援藏团体”（CanadaTibetCommittee）推特分享。\n\n---\n\n安德鲁•谢尔在声明中指出，藏人们一再诉求中间道路，而3月10日象征着所有藏人为争取正义与平等所进行的非暴力抗争，今年的六十周年纪念日证明了藏人们的坚韧和决心。他还称赞居住在加拿大的藏人，指出他们在外界不断地为境内藏人所遭遇的苦难发声，包括中共当局打压西藏人权、侵犯宗教信仰等。他还表示支持加国藏人对中间道路坚信的态度。\n\n最后，安德鲁•谢尔指出加拿大联邦保守党为捍卫人权和宗教自由，会继续在世界各地发出声音。他还表示，他将会与所有藏人在西藏自由抗暴六十周年纪念日，共同纪念和缅怀过去六十年里为西藏自由抗争而牺牲的所有藏人，并指出牺牲者们不屈服的精神激励了所有人。\n\n此外，美国加州里士满市政厅数日前发表支持西藏声明，决定3月8日在市政厅前以升挂西藏国旗的方式支持藏人，并将3月10日设立为西藏日进行纪念。同样，捷克共和国首都布拉格市政厅亦将恢复传统，于310西藏抗暴60周年升挂西藏国旗，这将成为布拉格市政厅第11次升挂西藏国旗。"
		},
		{
			"post_id": 119,
			"title": "西藏机构与其他信仰团体联盟：促美制裁中共宗教迫害",
			"date_published": 1551789719.633,
			"body": "【西藏之声2019年3月5日报道】国际声援西藏运动与包括维吾尔穆斯林、中国基督教、法轮功学员在内的各方组成联盟，共同呼吁美国采取行动制裁中共迫害治下各群体宗教信仰自由的行为。与此同时，美国众院外委会也致信国务卿，呼吁川普当局对维吾尔人正遭受的严酷打压采取行动。\n\n---\n\n近日有维吾尔穆斯林、中国基督教徒、藏人佛教徒，以及法轮功学员代表共同组成联盟“The Coalition to Advance Religious Freedom in China，CARFC”，旨在推进中共治下宗教信仰自由。\n\n综合媒体报道，CARFC联盟于3月4日当天，与非政府机构“国际宗教自由圆桌会”（IRF）一同于华盛顿举办新闻发布会，同声谴责中国对治下各民族信仰自由的打压迫害，同时施压美国政府，敦促采取制裁行动。\n\n新联盟在活动上要求中共遵守自己的宪法，以及国际法律义务，同时呼吁中共尊重其所有公民的基本人权。\n\n美国国际宗教自由无任所大使布朗拜克（Sam Brownback）与国会众议员吉姆•麦考文 (Jim McGovern)等出席了新闻发布会，承诺将一同推进美国对中共侵犯宗教自由行为的制裁。\n\n该联盟成员包括国际宗教自由圆桌会、国际声援西藏运动，以及维吾尔人权工程等。\n\n国际声援西藏运动副主席布琼次仁在新闻发布会上发言，介绍了西藏宗教自由与其他基本人权遭中共打压状况，以及中共高压统治所导致的自焚抗议浪潮等等。\n\n与此同时，美国国会众院外交委员会4日致信国务卿蓬佩奥（Mike Pompeo）,呼吁川普当局必须采取行动谴责中国在“新疆维吾尔自治区”的大规模拘押迫害行为。\n\n去年8月外委会也曾致信行政当局，昨天再一次作出相同呼吁：“美国必须与受压迫者站在一起，必须借一切机会向中共政府表明——美国非常关切新疆自治区的人权状况。”"
		},
		{
			"post_id": 118,
			"title": "美國藏人为西藏独立奋斗，310前夕从费城徒步游行到纽约",
			"date_published": 1551699783.282,
			"body": "【西藏之声2019年3月4日报导】西藏自由抗暴六十周年前夕，美国七位藏人于昨日发起徒步游行活动，宣布将从费城国家独立公园徒步至纽约市的联合国大楼，旨在为西藏独立奋斗。游行组织者之一的扎西阿旺表示：“我们之所以选择从费城开始，是因为这里是美国独立诞生地，因此我们认为这个地方在争取独立上有着非凡的意义。”\n\n![9.jpg (0x0)](data/img/post_118_9.jpg)\n\n美国藏人于费城国家独立公园集会，照片取自媒体询问者(Inquirer)\n\n根据美国费城媒体“询问者(Inquirer)”报导，3月3日早上约有六十位美国藏人社区的民众手举雪山狮子旗、美国国旗以及抗议告示牌于费城国家独立公园前集会，其中七位藏人宣布将以徒步游行的方式为西藏独立奋斗，他们计划在3月9日抵达纽约市的联合国大楼。\n\n---\n\n今年是西藏自由抗暴六十周年，为此世界各国的援藏团体均在计划各种形式的纪念活动。报导中指出，游行组织者之一的扎西阿旺(Tashi Ngawang)提到发起徒步游行有四项诉求，**一是要求中国结束对西藏的占领；二是要求释放所有西藏政治犯；三是争取美国政府给予西藏独立更多的支持；四是敦促联合国官员和记者进入西藏调查中共侵犯人权的行为。**\n\n历年来，世界各地的藏人都以徒步游行的方式表达其诉求，而西藏独立徒步游行活动是由达赖喇嘛尊者的大哥塔泽仁波切从1996年开始发起的，后来塔泽仁波切逝世后，由他的三子晋美诺布继承父业，继续为西藏独立徒步活动，直到2011年出车祸身亡。因此，晋美诺布的哥哥贡嘎诺布决心继续完成父亲和弟弟的心愿，报导指出他在活动上表示，他以徒步游行的方式纪念他已离去的父亲和弟弟以及所有受到中国压迫的西藏人。他说：“我们需要我们的国家，我们不需要中国，西藏是属于西藏人的。”\n\n报导指出，藏人民众聚集在国家独立公园约一个多小时，他们共同站立在寒风中歌唱和祈祷，而发起活动的藏人们则一一向现场的游客们介绍西藏的处境以及徒步活动的诉求。扎西阿旺表示：“我们之所以选择从费城开始，是因为这里是美国独立诞生地，因此我们认为这个地方在争取独立上有着非凡的意义。我们有一个国家，但它已被占领了六十年了。我们有自己的语言、自己的传统。这证明了我们的独立性。”\n\n集会活动结束后，这七位藏人从费城国家独立公园出发，他们正式展开了全程约148公里的徒步游行，并将在3月9日抵达纽约市的联合国大楼。"
		},
		{
			"post_id": 117,
			"title": "美国加州里士满与捷克布拉格等城市将升挂西藏国旗纪念310抗暴日",
			"date_published": 1551601386.93,
			"body": "【西藏之声2019年3月2日报导】310西藏抗暴60周年纪念日将至，美国加州里士满市政府发表声明关注西藏议题，并决定今年同样以升挂西藏国旗的方式支持藏人。在捷克首都布拉格，市长也宣布将连续四日升挂西藏国旗，“回顾自身历史，捷克政客更不应该逃避人权议题。”\n\n![9.jpg (0x0)](data/img/post_117_9.jpg)\n\n2016年10月达赖喇嘛尊者访问捷克时拍摄\n\n今年3月10日是西藏自由抗暴60周年纪念日，世界各国的援藏团体均在计划各种形式的纪念活动，其中也包括诸多市镇政府升挂西藏国旗的活动。\n\n---\n\n美国加州里士满发表支持西藏声明\n\n美国加州里士满市政厅2月26日发表支持西藏声明，市长与市议会主席，以及加州藏人协会代表均参加了发布活动。\n\n藏人协会成员丹增让卓透过电话告诉本台，里士满市政府在声明中对境内遭受苦难的藏人表达同情，并且谴责中共持续阻挠美国公民入藏，包括美籍藏裔公民。声明并呼吁政府落实已经通过的《西藏旅行互惠法》内容。\n\n里士满市政府也强调将继续支持由达赖喇嘛尊者提出、藏人秉持的非暴力抗争。市政府同时决定，将于3月8日在市政厅前升挂西藏国旗，并将3月10日设立为西藏日进行纪念。\n\n据介绍，这是加州里士满市连续第三年升挂西藏国旗，以此纪念310西藏自由抗暴日。\n\n捷克布拉格市长：不该为经济而忽视人权\n\n捷克共和国首都布拉格市政厅亦将恢复传统，将于310西藏抗暴60周年升挂西藏国旗.\n\n据布拉格TV等多家捷克媒体报道，布拉格市政厅将于3月8日至11日间，于办公楼前升挂西藏国旗。\n\n布拉格市长贺吉普(ZdeněkHřib)在推特上表示，将于3月6日接见藏人行政中央司政洛桑森格。他指出：“有关人权的辩论不应该成为捷克政客们逃避的事物，特别是考虑到捷克自身的历史。”捷克文化部长丹尼尔•赫尔曼（Daniel Herman）也将接见藏人司政。\n\n这将是布拉格市政厅第11次升挂西藏国旗\n\n2004年时任市长公民民主党（ODS）成员帕韦尔•贝姆（PavelBém）开创了该市升挂西藏国旗的先例，一直延续至2008年，再从2011年延续至2014年。然而2014年至2018年期间，来自不满公民行动党(ANO)的时任市长科尔娜乔娃（Adriana Krnáčová）中断了这一传统。\n\n布拉格市现任市长贺吉普在2月28日的一场公开活上批评自己的前任，指其为了经济利益，而无视中国的人权与自由被侵犯问题。\n\n据报道，前任市长曾因同中国北京建立姐妹城市关系而引发争议。今年一月，市长贺吉普获得授权，针对删除协议中一项有关“布拉格承认一个中国政策”的内容，与北京市长进行洽谈。"
		},
		{
			"post_id": 116,
			"title": "援藏团体发表声明支持美国通过“维吾尔人权政策法案”",
			"date_published": 1551506515.807,
			"body": "【西藏之声2019年3月1日报道】国际声援西藏运动（ICT）透过该组织网站发表声明，指出支持美国参众两院的“维吾尔人权政策法案”，ICT同时表示：“现在是时候让美国国会为维吾尔人的处境采取行动。”\n\n---\n\n近年来，中共对“新疆自治区”内维吾尔等穆斯林民众所进行的压迫，逐渐被外界所知，受到国际关注。尤其是当局在新疆各地设立“再教育营”、拘押上百万穆斯林、强迫灌输中共意识形态等行为，更引发西方民主国家为主的谴责声浪。\n\n国际声援西藏运动（ICT）于昨天（2月28日）透过该组织网站发表声明，指出支持美国参众两院的“维吾尔人权政策法案”。\n\n声明还指出，中共当局在新疆地区对穆斯林民众实施着违反人权的行为，为了阻止中共当局日益膨胀的压迫性政策，美国国会应带头通过“维吾尔人权政策法案”，让中共知道侵犯人权该付出的代价。\n\n“西藏旅行互惠法”在美国国会参众两院获得通过后，于去年12月19日由美国总统川普签字生效，成为法律。国际西藏运动的声明里指出，“西藏旅行互惠法”的成功明确表达了美国国会对西藏议题的关切，同时表示：“现在是时候让美国国会为维吾尔人的处境采取行动。”\n\n“维吾尔人权政策法案”由参议员马可•鲁比奥（Marco Rubio）、议员鲍勃•梅南德兹（Robert Menendez）共同向参议院提交。在众议院的发起人则是众议员克里斯托弗•史密斯（Christopher H. Smith）与议员托马斯•苏奥齐（Thomas Suozzi ）。法案旨在敦促川普政府针对中共当局打压穆斯林人的行为作出更强硬回应。"
		},
		{
			"post_id": 115,
			"title": "海外藏人建“西藏独立网”：需要阵地表达复国理念",
			"date_published": 1551147494.396,
			"body": "【西藏之声2019年2月25日报道】居住在澳洲的藏汉双语作家安乐业等人创办“西藏独立（复国）网”，近日正式开通。他受访时表示，建立该网旨在让海外藏人能够拥有属于自己的中文平台，自由地向海外中国民主人士传播西藏独立的理念和思想。\n\n![9.png (0x0)](data/img/post_115_9.png)\n\n网站主页截图\n\n名为“西藏独立网”（Tibet Independence）的论坛网站于近日开通，其总部设立在美国。该网站的简介写道，为纪念即将来临的三月十日西藏反抗运动60 周年， 特推出西藏独立网“以示藏人恢复尊严，坚定复国之意志。”\n\n---\n\n网站创办人之一的安乐业为居住在澳洲的藏汉双语作家，他接受本台采访时介绍说，曾同友人在2017年创建同名博客，今年则建立开通了功能较强大的西藏独立网站，方便更多人自由创作并参与辩论探讨。\n\n在解释为何要使用中文作为网站语言时，安乐业表示，在传播西藏独立的思想并介绍西藏历史、文化、宗教和政治情况方面，藏文传播的对象范围具有一定局限性，英文的网站则多且内容丰富。\n\n安乐业：“我们也可以通过中文向海外的中国民主人士传播西藏独立 (复国)的理念和思想，让他们有所了解，西藏人民需要的是真正的独立。这实际上也是西藏境内的很多人的想法，他们只是没有办法自己表达而已。”\n\n据了解，网友不需注册便可在西藏独立网自由发表文章、参与讨论、跟帖回复。\n\n安乐业认为，海外的中文网站平台不限有关“中道”与自由民主，以及抨击中共内容的文章，但鲜有中文网站让藏人自由表达西藏复国立场。\n\n“海外中国人的大一统思想根深蒂固。他们自已追求民主， 但不愿意西藏独立。所以说海外藏人需要自己的中文网站才能够自由地坚强地表达关于西藏独立(复国)方面的理念。”"
		},
		{
			"post_id": 114,
			"title": "西藏国歌",
			"date_published": 1551147407.961,
			"body": "[西藏国歌](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/data/users/1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv/1551147645-.mp4)\n\n有寂利乐妙源宝藏\n教法如意三宝灿烂\n\n法趣大地怙主持宝\n事业兴 海浪增\n稳于金刚界\n\n十方慈悲护\n天赐百喜威望 权齐天\n\n圆满四部 威力增\n藏区三域之遍布 幸福新 圆满劫\n\n佛法政教 福德兴\n法教增广 十方故\n安置世界\n众生瑞祥\n\n大千法趣 善相荣光\n放射十万 光明吉祥\n邪恶黑暗 之战必胜\n\n(西藏国歌为1950年代前后由第三世赤絳仁波切洛桑益西·丹增嘉措创作的Gyallu。现为海外藏人流亡者采用)"
		},
		{
			"post_id": 113,
			"title": "针对中国学生反藏声浪公开信：捍卫并尊重选举的过程 ",
			"date_published": 1550823684.355,
			"body": "【西藏之声2019年2月21日报导】多伦多大学士嘉堡校区新任西藏裔女学生会长遭中国籍学生网络霸凌事件引发全球关注，近日多伦多大学各个校区的教职员工和学生们自发性的在网络签署一份针对反藏声浪的公开信，该信署名给多伦多大学士嘉堡校方及学生会，信中公开谴责中国籍学生的网络霸凌行为，并表示捍卫及尊重齐美拉姆(Chemi Lhamo)当选学生会长的过程。"
		},
		{
			"post_id": 112,
			"title": "美总统授权拨款1700万美元援助西藏境内与流亡社区",
			"date_published": 1550823565.642,
			"body": "【西藏之声2019年2月21日报道】美国总统川普签署《综合授权法案》，授权2019年多个政府部门的财政预算中，对西藏境内与流亡藏人社区的1700万美元经济资助。这也是自川普上任初期传出缩减对外藏援助资金的消息后，连续第二年照常授权拨款法案 。\n\n---\n\n美国总统川普本月15日签署2019年《综合授权法案》（Consolidated Appropriations Act，2019），授权了2019财政年多个政府部门的资助项目预算。\n\n该项授权法案内容包括对中国统治下的“西藏自治区”与其他藏地提供800万美元援助、对印度与尼泊尔藏人社区提供600万美元，以及对流亡藏人行政事务的300万美元。援助资金共计1700万美元，另有其他相关西藏支援项目未包含在其中。\n\n2017年美国总统川普上任后，曾在预算中大幅度缩减对外援助项目资金，包括对境内外藏人的支援，引发舆论哗然。\n\n而后，在美国国会参众两院等各方的努力下，去年3月通过2018年财年预算，恢复了对西藏境内外藏人的经济援助。今年的财政预算再次包含了对境内与流亡社区的1700万美元资助。\n\n日前流亡藏人在华盛顿举办“感谢美国”活动，向过去六十年来美国政府与民间对藏人抗争所给予的支持帮助，表达感谢。\n\n当时达赖喇嘛尊者曾录制一段影片讯息指出，藏人在抗争过程中，对美国寄托了极大的希望，而美国也从始至终都在支持西藏的正义事业。\n\n尊者还强调，藏人永远不会忘记美国政府与民众所给予的同情与支持。\n\n藏人行政中央司政洛桑森格昨日也透过官网发表声明，感谢美国政府与国会授权，继续对西藏境内与流亡社区提供经济支援。"
		},
		{
			"post_id": 111,
			"title": "西藏青年会将在新德里举办为期三天活动纪念抗暴六十周年",
			"date_published": 1550558402.145,
			"body": "【西藏之声2019年2月18日报道】“西藏自由抗暴六十周年”纪念日即将到来之际，西藏青年会在达兰萨拉举行新闻发布会，指出将会在新德里于抗暴日当天起展开为期三天的大型纪念活动，并呼吁居住在印、尼、不丹三国的所有藏人前来参与此次活动。\n\n流亡社区非官方机构“西藏青年会” 今天在印北达兰萨拉举行新闻发布会，表示将从3月10日起于印度新德里展开为期三天的大型纪念活动，目的是为境内藏人所遭遇的苦难发声、表达对自焚者的敬意和支持他们的诉求。\n\n![9.jpg (0x0)](data/img/post_111_9.jpg)\n\n该组织会长丹增晋美指出，今年是“西藏自由抗暴”六十周年，达赖喇嘛尊者带领数万名藏人流亡在外已有六十年。因此，西藏青年会决定将于3月10日起在印度新德里展开为期三天的大型纪念活动，包括集会和示威游行等。\n\n---\n\n丹增晋美表示：“当前，中共当局对西藏仍保持着打压的政策，除了破坏西藏的宗教和语言文化外，并让藏人的身份面临存亡的危险。同样，中共当局在流亡藏人间亦制造各种矛盾、挑拨离间，设法破坏流亡藏人的团结，但由于达赖喇嘛尊者的教导，以及境内藏人的勇气和坚定信念，中共的这种幻想是绝对不会得逞的。”\n\n他提到：“在六十年里，西藏境内外的藏人们团结一致、齐心协力，为西藏事业不断地奋斗，这也是我们的成功。”他同时还呼吁世界各地的所有藏人，担起肩负的责任，继续为西藏事业作出抗争的努力。\n\n最后，丹增晋美提醒所有流亡藏人，切记流亡在外的目的、责任、以及境内藏人的状况和烈士们的奉献精神，并呼吁居住在印、尼、不丹三国的所有藏人前来参与此次活动。\n\n西藏青年会背景介绍：\n西藏青年会于1970年10月7日在印北达兰萨拉成立，目前在世界各国设有87个分会，会员共有3万5千多人，是流亡社区中人数最多主张西藏独立的非官方组织。"
		},
		{
			"post_id": 110,
			"title": "挪威自由黨青年組織发表聲明:支持西藏恢復獨立",
			"date_published": 1550407818.987,
			"body": "【西藏之声2019年2月16日报道】挪威自由党旗下的青年組織“Unge Venstre/Liberal Party of Norway”透过官网发表声明，指出支持西藏自由抗争运动，并谴责中共当局侵犯西藏人权，同时呼吁中共当局让达赖喇嘛尊者返回西藏，让西藏获得独立。\n\n![9.jpg (0x0)](data/img/post_110_9.jpg)\n\n声明稿网站截图\n\n挪威自由党旗下的青年組織 “Unge Venstre/Liberal Party of Norway” 2月10日透过官网发表支持西藏自由抗争的聲明。\n\n---\n\n该组织还谴责中共自侵占西藏以来，不仅有系统地破坏了西藏的历史建筑、寺院、经典等外， 他们还剥夺了藏人的人身自由与其独立的自由，导致数十万藏人在“文化大革命”期间丧失生命。\n\n声明还指出：尽管达赖喇嘛尊者所带领的藏人一直恪守着非暴力理念，并施行了民主改革，但中共当局仍以暴行应对，藏人的基本人权不断地遭受打压，导致自2011年以来，至少有上百名藏人自焚抗议中共。\n\n中共当局禁止持有西藏国旗及唱西藏国歌，也不允许供奉达赖喇嘛尊者的画像，任意强加罪名逮捕藏人的情形更是常见，藏人在狱中往往都受到不人道的对待，如最近被释放的僧人确吉即是一例。\n\n最后，挪威自由党呼吁了中共当局必须终止对藏人的侵犯人权的行为，并让达赖喇嘛尊者返回西藏，让西藏获得独立。\n\n挪威自由党背景介绍：\n\n挪威自由党（NUV），或称挪威青年自由党，是挪威社会自由主义政党，成立于1909年1月27日，是挪威最古老的青年党。"
		},
		{
			"post_id": 109,
			"title": "西藏团体以各种方式纪念《西藏独立宣言》公布106周年",
			"date_published": 1550210876.949,
			"body": "【西藏之声2019年2月14日报道】《西藏独立宣言》公布106周年当天，自由西藏学生运动在纽约与新德里等地，以音乐会及示威等不同形式纪念了这一具有特殊意义的日子。该运动位于纽约的总部还邀请了加泰隆尼亚独立抗争人士，分享抗争经验与挑战。\n\n昨天（2月13日）是十三世达赖喇嘛发布《西藏独立宣言》106周年纪念日。援藏组织“自由西藏学生运动”（SFT）在纽约与新德里等地，以不同形式纪念了这一具有特殊意义的日子。\n\n---\n\nSFT 印度总部昨晚于新德里举办“独立音乐会/Rangzen Concert”。邀请藏印音乐团体献唱，共同纪念《西藏独立宣言》发布纪念日。\n\n自由西藏学生运动新德里分部成员仁增曲珍告诉本台驻新德里记者，昨晚的音乐会是为了向印度民众介绍西藏议题，同时也为唤起藏人追求独立的诉求。\n\n在独立日声明中，该组织强调，每个国家都拥有自己的独立日或者国庆日，不论这个国家当下的政治状态如何，西藏当然也不例外。\n\n位于纽约的自由西藏学生运动总部，也于13日举办座谈会，邀请加泰隆尼亚国民大会成员、作家罗泽（RoserCaminals-Heath），分享独立抗争经验与挑战。\n数名援藏人士手持西藏国旗，在法国巴黎中共大使馆前进行抗议\n\n而在法国巴黎，数名援藏人士手持西藏国旗，在中共大使馆前进行抗议，同时也对维吾尔人发起的“MeToo Uyghur” 活动表达声援。\n\nSFT孟买分部则将印度友人对西藏独立日送上的祝福整理剪辑成一段影片。\n\n一些印度友人希望藏人在抗争中保持正面积极的心态，也有学生指出在经历无数困顿后，藏人的努力付出将很快换取西藏的和平。\n\n另有印度人士在影片中指出，自由与独立是两个完全不同的概念，但她坚信西藏最终必将同时争取到这两个目标，希望年轻一代藏人能够继续抗争。\n\n西藏独立日背景：\n\n2013年2月13日是第十三世达赖喇嘛公布《西藏独立宣言》百周年，自由西藏学生运动为进行纪念，将这一天设为“西藏独立日”，每年都会举办活动，向各方推介西藏的独立历史地位。今年是该团体所设的第六个“西藏独立日”。"
		},
		{
			"post_id": 108,
			"title": "中共间谍日益猖獗，企图阻止立陶宛支持西藏独立立场",
			"date_published": 1550056412.761,
			"body": "【西藏之声2019年2月11日报导】近日，根据立陶宛的安全报告指出，已将中共列为立陶宛的国家安全威胁，其原因为中共利用经济影响力遂行间谍活动，并越来越猖獗，甚至企图影响立陶宛对西藏和台湾独立的立场。\n\n![9.jpg (0x0)](data/img/post_108_9.jpg)\n\n尊者与立陶宛首位总统\n\n立陶宛军事情报局于2月5日联合发表了一年一度的安全报告，并在报告中指出，已将中共列为立陶宛的国家安全威胁。据悉，立陶宛军事情报局每年发表的年度报告通常都将俄罗斯、白俄罗斯视为主要安全威胁的国家，但这是立陶宛第一次将中共列为国家安全威胁。\n\n---\n\n而中国驻立陶宛大使馆于2月8日宣称立陶宛情报和安全部门依赖猜测和想像没有根据地歪曲事实，并坚称中国对立陶宛不构成任何威胁。\n\n报告中指出，随着中共在西方世界政治和经济野心膨胀，中共安全情报机构利用其经济影响力在立陶宛加强间谍活动，且越来越猖獗，并试图招募立陶宛公民当线民，因此将中共列为立陶宛的国家安全威胁。\n\n自由之家《2019年度国际自由度报告》\n\n根据国际非政府组织“自由之家”（Freedom House）《2019年度国际自由度报告》中，中国毫不意外地被评为“不自由”国家，仅拿到11分，而西藏则仅仅获得1分自由度，也显示西藏在中国的统治下，毫无自由度可言。\n\n中共利用各种手段针对海外异见者的举动屡见不鲜，并透过舆论监督机构将其观点强加于本国公民及海外华人，甚至其他国家。而中共又极为关注西藏和台湾的问题，其在立陶宛的间谍活动除了阻止当地的政界和其他各界人士支持西藏和台湾，也不让立陶宛在国际舞台上提出西藏和台湾问题。\n\n立陶宛的安全报告还预测，未来中共在立陶宛的间谍活动规模将会持续扩大，因近年来，中共一直企图透过中国与十六个中东欧国家的对话和峰会等平台，扩大在当地的影响。但因为中共对内迫害人权以及宗教自由等举动，因此，中共越来越不受西方国家的欢迎。\n\n与此同时，因华为涉嫌替中共从事间谍活动事件，立陶宛国家情报和安全部门注意到许多西方国家对华为所采取的行动，最近也在积极分析评估华为的潜在威胁。"
		},
		{
			"post_id": 107,
			"title": "反对中共罔顾人权，人权组织联署发表公开信寻联合国支持",
			"date_published": 1549188253.037,
			"body": "【西藏之声2019年1月31日报导】四十个国际人权组织发表联署公开信，敦促联合国人权理事会成员国应通过相关决议，以反对中共任意羁押和其他侵犯人权等行为。而这次联合行动是让联合国向中共明确表示“他们将不再袖手旁观”。\n\n昨日（1月30日）四十个国际人权组织发表联署公开信，呼吁联合国正视中共罔顾人权的行为，并敦促联合国人权理事会成员国应通过相关决议。该信中大力谴责中共践踏人权，恶意打压异议，并破坏国际法保障的人权，其中数百万名的西藏人，维吾尔人，律师，记者以及学生所面临的镇压最为严重。\n\n签署公开信的人权组织包括自由西藏，国际声援西藏运动，西藏观察，世界维吾尔大会等四十个组织。\n\n此外，公开信内容提出三点，表示支持联合国采取措施，更进一步监督中国的人权状况，并敦促联合国支持通过相关决议：\n\n**一、联合国人权事务专员及记者能获得更多的许可，实地观察中国所有地区的人权情况，包括西藏及新疆地区。\n二、要求中共停止滥用国家安全法，并要求取消对言论自由，结社和宗教自由等限制。\n三、要求立即释放被任意羁押的人。**\n\n同为签署公开信的自由西藏（自由西藏）组织负责人埃莉•诺拜恩•罗森格伦（Eleanor Byrne-Rosengren）亦提出声明表示：“此行动要求人权理事会成员采取统一立场，反对中共实施大规模侵犯人权的行为”。\n\n与此同时，她指出数百万人受到监控，折磨和杀害，中共撇的一干二净，并全盘否认对其控制下的人民所造成的虐待。而这次联合行动是让联合国向中共明确表示“他们将不再袖手旁观”。"
		},
		{
			"post_id": 106,
			"title": "司政洛桑森格访日，日议员表态支持中间道路",
			"date_published": 1549019998.931,
			"body": "【西藏之声2019年2月1日报导】藏人行政中央司政洛桑森格对日本展开为期八天的参访行程，会见日本国会议员、慈善家、援藏人士等多名政要。司政在访问期间向他们推介西藏议题的同时，呼吁对方为重启藏中和谈而发声。而日本议会援藏成员们一致发表声明，表示支持“中间道路”政策。\n\n---\n\n据藏人行政中央官网消息：藏人行政中央司政洛桑森格，于1月25日起对日本展开访问。26日，司政出席了由藏人行政中央驻日本办事处主办的宴会，并会见日本国会议员、慈善家、援藏人士等多名政要。\n\n当天，司政洛桑森格向他们介绍西藏境内的人权状况，以及中国当局对全球的影响所造成的威胁性。司政还赞扬日本议会成立了全球人数最多的议会援藏小组，并敦促日本加深在正义、自由、人权、民主及西藏议题上的发言。\n\n1月29日，司政洛桑森格在日本大阪市出席了一场由日本援藏团体举办的活动，聚集了日本国会议员和援藏人士等数百人。司政分别向他们介绍了西藏境内的人权状况，并强调：“如果需要理解中国的话，首先必须了解西藏。”\n\n司政洛桑森格还呼吁日本，为保护西藏文化和生态环境而发声，并加大对西藏议题的支持，支持藏人行政中央所秉持的“中间道路”政策，以及为重启藏中和谈而发声。\n\n昨天（1月31日），司政洛桑森格在东京议会办公大楼会见日本议会援藏小组的议员，包括前教育部部长、自由民主党成员、希望之党（Party of Hope）成员、日本创新党（Japan Innovation Party）成员，以及媒体记者等。\n\n在为期一小时的会见中，司政向日本议员们推介了西藏局势和国际社会对西藏事业的支持，包括2018年“西藏旅行互惠法”和川普政府的“印太再保证倡议法（Indo-Pacific Reassurance Act）”。而后，日本议会援藏成员们一致发表声明，表示支持“中间道路”政策，并强烈批评中国政府压制西藏独特的文化、教育、语言和宗教自由。\n\n据报道，司政于今天（2月1日）结束对日本的参访行程，啟程返印。"
		},
		{
			"post_id": 105,
			"title": "驻华外国记者遭中共骚扰，ICT呼吁落实《西藏旅行互惠法》",
			"date_published": 1548852253.162,
			"body": "【西藏之声2019年1月30日报导】驻华外国记者协会(FCCC)发布2018年度工作条件报告显示，外国驻华记者在西藏、新疆地区遭受到中共各方面的骚扰以及打压，包括干预报导内容、采访被监控、限制行动、签证被拒等等。国际声援西藏运动（ICT）呼吁，任何海外记者和公民都有权利在西藏不受限制地旅行，期许全面落实《西藏旅行互惠法》。\n\n---\n\n近日，驻华外国记者协会(FCCC)发布2018年度工作条件报告，指出中共监控行为以及其干预对于有关西藏、新疆地区的报导，致使2018年驻华记者的工作环境显著恶化。\n\n该报告提到了在西藏境内受到骚扰的记者的具体案例。\n2018年2月，“纽约时报”记者史蒂文•李•迈尔斯(Steven Lee Myers)和一名摄影师在西藏德格宗萨寺参加新年仪式后被拘留近17个小时。在被送到最近的机场之前，他们遭到中共警方的训斥并被禁止使用手机。\n\n此报告亦指出，根据中国的相关规定，除西藏外，外国记者无须提交特别申请前往采访。但实际上，中共警方和官员经常告知记者在一些敏感区域是受限制的或禁止采访。\n\n驻华外国记者协会主席汉娜•萨尔伯格(Hanna Sahlberg)观察到，中国对外国媒体的打压越来越多，同时中国官方媒体正在向海外扩张，并在全球散播对北京的宣传。\n\n国际声援西藏运动(ICT) 副主席布琼次仁(Bhuchung K. Tsering)表示：“透过这份报告，驻华外国记者协会已经证明了《西藏旅行互惠法》的重要性。我们期待与国务院合作，全面落实这项法律，并继续争取记者进入西藏。”\n\n《西藏旅行互惠法》这一法案旨在结束中国对西藏的封锁，要求中国政府允许美国记者、外交官以及游客，在西藏不受限制地旅行，正如中国的记者与外交官以及大众能够自由访问美国一般。\n\n中共外交部声称并未长期严格限制外国记者、官员等进入西藏。然而，这份法案却明确指出：美国政府官员从2011年5月至2015年7月间，共递交39份进入“西藏自治区”的外交访问申请，其中仅有4次获得批准。\n\n**《西藏旅行互惠法》背景：**\n\n旨在对抗中共封锁西藏政策的《西藏旅行互惠法》，最初由美国众议员吉姆•麦考文（Jim McGovern） 与兰迪•赫尔特格伦（Randy Hultgren）在众议院提出，并由参议员马可•卢比奥（Marco Rubio）与塔米•鲍德温（Tammy Baldwin）在参议院提出。\n\n2018年7月25日，众议院司法委员会核准了这一法案，两个月后，众院正式通过该法案，并递交参议院。同年11月28日，参院外交关系委员会核准了这一法案；12月11日，参议院正式通过了该法案。 12月19日，经总统川普签字后，《西藏旅行互惠法》生效成为法律。"
		},
		{
			"post_id": 104,
			"title": "加拿大外长重申支持西藏人权立场并承诺继续为藏人发声",
			"date_published": 1548772175.731,
			"body": "【西藏之声2019年1月29日报道】加拿大外长方慧兰近日在一份书面声明中，重申加拿大对西藏人权议题的关注。方慧兰列举出近年来加方对西藏人权所提出的关切，并承诺未来也将继续为西藏人权发声。\n\n---\n\n据加拿大西藏委员会（Canada Tibet Committee）发布的消息，加拿大外交部长方慧兰（Chrystia Freeland）昨天（1月28日）在一份书面声明中指出，加拿大持续深切关注藏人的人权、表达自由、宗教信仰自由，以及保护语言文化自由等权利所受到的限制。\n\n日前加拿大国会议员兰德尔•加里森（Randall Garrison）发起西藏议题联署，将请愿信递交下议院。外长方慧兰的这份声明便是对联署信所作出的回应。\n\n方慧兰并在回应中指出，加拿大曾在数个场合向中国当局提出对人权问题的关切。她表示在去年11月，加中两国总理举行年度领袖会议时，就曾对表达自由与宗教自由进行“友好开放”的讨论。\n\n此外，去年在美国国务院主办的首次“促进宗教自由”部长级会议上，加拿大代表也提出对西藏议题的关切。而在中国于日内瓦接收第三次联合国普遍定期审议时，加拿大代表同样为西藏议题发声。\n\n加拿大西藏委员会透过官网感谢加拿大政府长期关注西藏人权被侵犯议题，同时呼吁中国政府尊重藏人的文化、语言、宗教与经济权利。\n\n加拿大外长方慧兰在昨天发布的声明中还承诺，加拿大将继续关注中国与西藏的人权问题，同时将继续呼吁中国履行其国际义务。"
		},
		{
			"post_id": 103,
			"title": "达赖喇嘛：西藏文明使藏人坚守勇气并让西藏被世界所见",
			"date_published": 1548424223.614,
			"body": "【西藏之声2019年1月24日报道】西藏人民至高无上的领袖达赖喇嘛尊者于今天上午，接见一批印度各大学中从事西藏议题研究的年轻学者。尊者在与大家交流时强调是源自那烂陀的西藏文明，使得藏人在从古至今面对包括内战、分裂、中共入侵等等巨大困顿面前，一直保持勇气与信念；而且，今天世人在关注西藏独特文明的同时，也将了解藏人所在遭受的困苦。\n\n---\n\n今天（1月24日）上午，二十多名来自印度各大学的年轻学者在达兰萨拉拜见尊者。双方就印度古文明与西藏议题研究等等进行了交流探讨。\n\n**为什么需要帮助复兴印度古文明**\n\n达赖喇嘛尊者首先向年轻学者强调了三千年前诞生于印度的心识学与非暴力理念，并指深受此影响的那烂陀佛教由藏人保存延续至今，其特点为重视基于逻辑理路的学习探究方法。佛陀要求追随者不能盲信自己的教导，而是经过实践后再来决定接受与否，那烂陀学者就曾依此而对佛祖的某个观点提出质疑。尊者认为这样尊重逻辑的探索精神同现代科学重视事实不谋而合。\n\n在尊者的大力推动下，过去30多年来科学界与佛教界展开无数次接触对谈，双方取长补短，相互产生助益。但尊者表示，遗憾的是关注这些精深智慧的印度人，在已经习惯于接受现代教育的社会中，已经寥寥无几。\n\n尊着强调，暂不提信仰，印度古文明中对人类情绪的深层剖析，能够帮助人们获得平和的内心，而这在今天充满情绪危机的世界极为重要。“我们需要获得内心的和平，否则想要创建外部的和平根本无可能。”尊者认为印度古代文明与今天的世界息息相关，若能够复兴将利益无数人。\n\n**西藏文明让藏人在困顿中坚守勇气**\n\n在接受印度学者的提问时，尊者鼓励各方应该多关注西藏的文明学识。\n\n尊者强调，西藏有着世界上独一无二的文明，这样的文化遗产带给藏人内在力量与自信。也正因为拥有这样的内在力量，过去两千多年，西藏无论发生内战、分裂、或者遭中国侵占，种种巨大困顿都没有让藏人失去信念。即便在中共入侵后，任凭他们软硬兼施，都未能让藏人屈服。总之西藏文明就是藏人的精神来源。\n\n**信仰什么宗教应该由自己来决定**\n\n尊者在问答阶段还提到，自己从来不会去宣扬佛教是唯一真理，也决不会去试图转化他人的信仰，只是努力思考应该怎样透过佛法来帮助大家成为更和平、更快乐的人。\n\n“比如，看到自己同信仰的人改信其他宗教，就会感到不满；那么同理，你自己也不该去试图转化他人的信仰。所以宗教完全是在于自己的意愿，是否信仰宗教、信仰何种宗教，都是个人的自由。”\n\n**西藏文明能够让西藏困顿被世人所见**\n\n尊者在回答问题的过程中，再度提及西藏文明的重要意义，强调这一独特文明能够吸引更多人的关注，同时也能够让世界看到西藏的局势。这不是借助政治方法来推介西藏议题，而是透过文化途径。\n\n**达赖喇嘛执政传统有封建制度之嫌**\n\n被问及民主与佛教之间的关联，尊者进行了说明，并强调民主是最佳的模式。\n\n尊者以达赖喇嘛制度为例直言道：“比如我自己的例子，从17世纪开始，第五世达赖喇嘛成为西藏的政教领袖，我认为那与封建体系存在某种联系。从2001年，我开始卸下政治权责，2011年，我将政权完全交给民选的政治领导。所以在未来，如果达赖喇嘛制度继续存在，也不再与政治权责有任何瓜葛。我认为，喇嘛制度涉入政治因素，是以宗教名义而存在的封建体制。所以，民主才是最佳的模式。”\n\n**西藏是否会获得自治？**\n\n尊者毫不犹豫地给予了肯定的答复：“这可以确定，中国自己的宪法就提到了这些。问题在于中国的集权专制体系。虽然他们有人民代表大会，但是所有权力集中在一个人的手中。从全球角度来看，专制集权早已过时。现在中国内部的不满也在增加。”\n\n今天拜见尊者的这批年轻印度学者，是受藏人行政中央之邀，参加西藏政策研究中心举办的首次印度年轻学者西藏议题研讨会。在为期三天的会议中，各方分享并探讨了西藏难民状态、藏中印关系，以及西藏与印度安全等研究论文。"
		},
		{
			"post_id": 102,
			"title": "藏台连线发起2019为西藏而骑“浩劫一甲子西藏要自由”",
			"date_published": 1548423353.084,
			"body": "【西藏之声2019年1月23日报道】西藏台湾人权连线今天发起“2019为西藏自由而骑Cycling for a Free Tibet”活动。在台湾立法院前举行的记者会上，台湾国会立委林昶佐与尤美女，以及其他团体代表共同出席表达声援，并与藏人一起呼喊口号“浩劫一甲子，西藏要自由”。藏台连线理事长札西慈仁在活动上提醒台湾人：“如果中共要跟台湾谈什么事情，台湾应该要看西藏的历史，我们根本不相信中共。”\n\n![9.jpg (0x0)](data/img/post_102_9.jpg)\n\n图片翻拍自西藏台湾人权连线脸书\n\n今天（1月23日）是“一二三世界自由日”，西藏台湾人权连线发起2019年度的“为西藏自由而骑Cycling for a Free Tibet”活动，并透过脸书直播过程。\n\n---\n\n藏台连线理事林欣怡在立法院前的记者会上介绍说，今年的310抗暴纪年日临近，但近年来中共对台湾的恐吓打压不断升级，无法确定届时会有多少台湾人走上街头挺西藏，“因此我们提早开始在每个礼拜三的时候，希望用‘为西藏自由而骑’这样的行动，走遍台北市，向市民以及各国民众包括中国游客说明我们的理念，也是为了邀请大家参加今年的310西藏抗暴日活动。”\n\n台湾国会西藏连线召集人时代力量立委林昶佐也发言提出，台湾近期的选举结果令不少人对台湾理念产生不确定性，而在新的一年中透过参与声援藏人的游行，能够打消疑虑。“最有机会让大家听到台湾的声音，看到台湾仍然站在自由、民主与人权这边的机会，就是在3月10号的时候跟藏人朋友站在一起，还有在3月10号之前，所有为西藏而骑的暖身活动，大家尽可能地来参加，我想这是让台湾不一样的声音可以被全世界看到的机会。”\n\n国会跨党派国际人权促进会会长尤美女也于记者会上发言，提到中共对其治下各民族、各宗教群体的打压，以及对世界民主所造成的威胁，“我们也希望在台湾，大家不要觉得西藏离我们很遥远。事实上，同样的问题就会发生在台湾。而且从这次公投的结果其实我们看到，中国的势力已经伸展到国内来。所以希望大家在‘一二三自由日’，除了声援西藏以外，也要为捍卫我们台湾的自由而努力，让世界看见西藏，也看见台湾。”\n\n藏台连线理事长札西慈仁致词时，向大家概述了中国与西藏签署所谓“十七条协议”后，立即武力吞并西藏、迫使达赖喇嘛尊者与数万藏人流亡，以及境内藏人被压迫至今的情况。他提醒台湾，“跟中国要什么样的谈判，我们是完全没有办法相信的。如果中共要跟台湾谈什么事情，台湾应该要看西藏的历史，我们根本不相信中共。”\n\n据林欣怡介绍，西藏台湾人权连线延续数年举办“为西藏自由而骑Cycling for a Free Tibet”活动，其中的“Cycling”也有循环不断之意，因此该团体也希望藉由这一活动展现藏人的意志。\n\n在记者会结束后，十几名活动人士身披西藏国旗，一路呼喊“西藏是西藏人的”、“西藏要自由”、“达赖喇嘛要回家”、“中国军队滚出西藏”等口号，沿着中国银行和101大楼的路线，展开今年的第一次骑程。\n\n据藏台连线发布的消息，2019年“为西藏而骑”行动，除在台北之外，也会在高雄，台中举行。时间地点分别是：1/23（台北），30分之1（台北），2/6（台北），2- / 13（台北），2/16（高雄），2/20（台北），2/23（台中），2/27（台北），3/6（台北），共计9场。"
		},
		{
			"post_id": 101,
			"title": "美国议员指西藏旅行法引起中国注意 美方应尽速落实",
			"date_published": 1547480878.806,
			"body": "【西藏之声2019年1月14日报道】在“西藏自治区” 中共人大会议上，自治区主席表示将会缩短境外游客进藏申请程序，令各界不禁联想到美国刚刚通过的《西藏旅行互惠法》。而后美国国会两名议员表示，正是互惠法引起了中国的重视，接下来希望美国能过确切落实这项法案，同时也呼吁中共取消入藏限制，停止迫害藏人。\n\n---\n\n1月10日“西藏自治区”中共当局召开第十一届人大第二次会议，区主席齐扎拉在报告中宣称，今年将会完善境内外游客进藏旅游服务管理办法，力争审批时间缩短一半，境外游客人数增长一半。这一表态引起各界将此与美国日前通过的《西藏旅行互惠法》联系在一起。\n\n《西藏旅行互惠法》于去年12月由美国总统川普签字生效，成为法律。这一法案旨在结束中国对西藏的封锁，要求中国政府允许美国记者、外交官以及游客，在西藏不受限制地旅行，正如中国的记者与外交官以及大众能够自由访问美国一般。\n\n在参议院提出入藏互惠法的议员马可•卢比奥（Marco Rubio）本月11日发推指出，“看起来《西藏旅行互惠法》引起了中国政府的注意。中国是否能够真的开放西藏，并且停止粗暴压迫藏人，将由时间来证明。”\n\n依照这条已经生效的法律，美国国务卿需在90天内，提交那些涉及阻挠美国人入藏的中国官员名单，并禁止他们进入美国。\n\n马可•卢比奥指出，现在国务院应该尽速落实这一法案。\n\n最初在众议院提出这一法案的议员吉姆•麦考文（Jim McGovern）也于11日发推指出：“很明显，《西藏旅行互惠法》引起了中国的注意，因为美国通过了这一新法后，中国宣称计划加速外国人入藏许可程序。”\n\n国际声援西藏运动主席在一篇声明中指出，美国国会两院研究入藏互惠法时，中国官员曾发表虚假声明试图进行误导，此次官方宣布将加速外国人入藏许可程序这一消息，其目的同样是误导。“美国政府与所有关切人权与民主的美国公民，必须继续向中国政府施压，使其停止对西藏的封锁，并让藏人享有基本自由。”"
		},
		{
			"post_id": 100,
			"title": "中共怒批“入藏法”显示其畏惧西藏获美国支持",
			"date_published": 1546955117.624,
			"body": "【西藏之声2019年1月8日报道】中国当局愤怒回应美国通过《西藏旅行互惠法》，并将矛头指向达赖喇嘛，连续发旧文进行诋毁的同时，也在藏地开展“清理达赖画像”运动。国际声援西藏运动指出，这些举措恰恰反映出：中共妄图消灭达赖喇嘛在国际上的权威与在藏人心中的影响力，但是并未能得逞。这也证明，他们非常恐惧美国对西藏所给予的支持。\n\n---\n\n《西藏旅行互惠法》在美国国会参众两院获得通过后，于去年12月19日由美国总统川普签字生效，成为法律。这一法案旨在结束中国对西藏的封锁，要求中国政府允许美国记者、外交官以及游客，在西藏不受限制地旅行，正如中国的记者与外交官以及大众能够自由访问美国一般。\n\n中共外交部于该项法案生效后的第二天声称“对美方执意签署美国会通过的所谓‘2018年对等进入西藏法案’表示坚决反对。”中共外交部并称，该法案“向‘藏独’分裂势力发出严重错误信号。”\n\n国际声援西藏运动昨发表文章，指出当局近期加大了对达赖喇嘛尊者的攻击，连续重发毫无根据的旧文诋毁尊者，这显示当局非常恐惧美国这一获得两党两院大力支持的新法。\n\n中共官媒连续发表数篇冗长、毫无根据地诋毁尊者的社论，将尊者描绘成境内自焚与其他形式抗议的怂恿者，并与美国的新法连接在一起。这些都显示北京意识到，他们破坏达赖喇嘛在国际社会的权威与影响力的计谋并未能得逞。\n\n依照这条已经生效的法律，美国国务卿需在90天内，提交那些涉及阻挠美国人入藏的中国官员名单，并禁止他们进入美国。\n\n而中共官媒采访的相关人士，是以朱维群为首的长期以诋毁达赖喇嘛为生的中共官员，显示出他们非常担忧这部法案。朱维群称：“当美国对中国加大施压之际，对达赖喇嘛的分裂行为来说，就成了机会。”\n\n中共当局去年底在西藏东部佐盖多玛地区实行“十四世达赖画像专项清理工作”，用习近平为首的中共领袖像来取代藏人供奉的尊者画像。当局指在该地区还对村组干部和部分群众党员家中的达赖喇嘛画像进行了清理，并悬挂了领袖像。国际声援西藏运动认为，这恰恰显示出，这位流亡领袖在境内藏人，包括藏人党员心中仍存在极大的影响力。\n\n文章强调，当局的一系列举措，都是以消除达赖喇嘛在藏人心中的影响力，同时将藏传佛教“中国化”为目的，这些目的都已完全失败，同时也是导致境内包括自焚在内各种抗议不断的主要原因。"
		},
		{
			"post_id": 99,
			"title": "西藏议员会见两百多名印度国会成员寻求支持",
			"date_published": 1546875901.274,
			"body": "【西藏之声2019年1月7日报道】印度国会正于新德里召开冬季议程，在国会支持西藏小组的安排下，西藏人民议会议员分组拜访了两百多名印度议员，寻求各方对西藏运动的继续支持，并设宴感谢了长期关切藏人命运的各方。\n\n---\n\n印度国会于去年12月11日开始，在新德里召开冬季议程，定于今年1月8日结束。因此次议程之后，印度将举行新一轮大选，故在国会支持西藏小组的安排下，西藏议会议长白玛炯乃、副议长益西平措，以及其他议员分成数个小组，从本月2日开始，先后拜会了230多名印度议员，争取各方对西藏议题的关注。\n\n据本台驻新德里记者发来的消息，昨天6日下午，西藏议会副议长又带领数名议员于新德里一家饭店，宴请国会支持西藏小组议员，以及其他政界人士，以向各方长年来对西藏的支持表达感谢，同时呼吁大家继续关注、支持西藏的民主自由运动。\n\n参加活动的包括前印度国会支持西藏小组召集人、前喜马偕尔邦首席部长香塔•库玛尔（Shanta Kumar）。\n\n他在活动上致词指出，印度与中国可以透过改善双方关系来解决西藏困顿。西藏领袖达赖喇嘛尊者提出的双赢“中间道路”政策，虽然未获得部分藏人青年的理解，但那是依照国际实际状况出发而构想的伟大方案，我们应该给予大力支持。\n\n香塔•库玛尔还表示，西藏议题也是人权问题，一个热爱和平的民族遭受这样的困苦，在他看来是非常令人无法接受的情况。\n\n据了解，在各国国会支持西藏小组中，印度国会的西藏小组成立日期最为久远。最初由著名法學家及外交家恰格拉（M.C.Chagla）于1970年带头组建，而后又由前国防部长乔治·费尔南德斯（George Fernandes）继续带领。"
		},
		{
			"post_id": 98,
			"title": "援藏团体欢迎美国“亚洲再保证倡议法”关注西藏",
			"date_published": 1546515378.355,
			"body": "【西藏之声2019年1月3日报道】美国刚刚通过《西藏旅行互惠法》，近日又制定《2018年亚洲再保证倡议法案》，其中提到将继续于西藏、印度与尼泊尔的藏人社群，支持藏人保护自身文化传统，以及发展教育及环保的努力。援藏团体对这一法案表达了欢迎，并强调若西藏的法治与基本自由得到尊重，那么将对印太区域的和平与繁荣做出巨大贡献。\n\n在刚刚过去的2018年，美国参众两院通过“2018年亚洲再保证倡议法案”（Asia Reassurance Initiative Act of 2018），并在总统川普签字后正式生效。\n\n---\n\n该法案旨在“发展美国具长期战略视野，以及整体、多面向、有原则的印太区域政策”。法案并强调，在印太区域捍卫人权、提升法治，对美国具有根本利益。\n\n这份法案还特别提到西藏，表示美国将继续在位于中共治下“西藏自治区”与其他藏地，以及印度与尼泊尔境内的藏人社区中，支持藏人保护文化传统、提升可持续发展，以及教育、环境保护等方面的努力。该法案也对中国试图进一步钳制中国公民社会的空间、破坏印太区域基于法治的秩序等行为，表达了严重关切。\n\n参议员科里•加德纳(Cory Gardner)是《2018年亚洲再保证倡议法案》的提出者之一，他表示这一法案确保美国将会继续支持藏人，透过授权资助那些有关西藏的项目，也透过揭露中国侵犯藏人人权的行为。\n\n国际声援西藏运动在一份声明中指出，这一法案正确地将西藏议题置于美国安全利益的主要考量内。一个局势稳定、法治与基本自由得到尊重的西藏，将可以对印太地区的和平与繁荣做出巨大贡献。\n\n就在几周前，《西藏旅行互惠法》于美国国会参众两院获得通过后，由美国总统川普签字生效，成为法律。互惠法旨在结束中国对西藏的封锁，要求中国政府允许美国记者、外交官以及游客，在西藏不受限制地旅行，正如中国的记者与外交官以及大众能够自由访问美国一般。"
		},
		{
			"post_id": 97,
			"title": "桑杰嘉：2008年西藏抗议运动遭第二次屠杀",
			"date_published": 1545630713.597,
			"body": "【西藏之声2018年12月22日报道】2008年3月14日中国政府对藏人在拉萨的抗议实施武力镇压，14日晚上整夜枪声不断，射杀西藏人的情况到处发生，而且，尸体被中国军警抢走。3月15日，整个拉萨被正规军队控制戒严，并开始大规模的抓捕行动，据当时的消息说至少抓捕了600名西藏人。由于中共对拉萨的抗议实施血腥镇压在拉萨周围和西藏其他地区，特别在安多和康区发起了更大规模的抗议，中国政府仍然采取武力镇压，在安多各地中国军警开枪射杀数十人。3月16日是中共2008年3月14日在拉萨对西藏抗议运动实施大屠杀后，再次在西藏安多地区进行血腥射杀藏人。\n\n![9.jpg (0x0)](data/img/post_97_9.jpg)\n\n2008年3月15日中共武警在拉萨巡逻 AFP图片\n\n---\n\n3月16日，西藏大学生首次举行抗议，谴责中共屠杀藏人，并表达了对抗议游行的支持，之后各大院校的西藏学生进行了类似的抗议游行。\n\n3月16日凌晨4点，西藏安多阿坝县（四川省阿坝藏族自治州）的知识份子觉勒达瓦（学校老师，2006年当地焚烧皮毛的组织者之一）等被抓走，不知下落。上午，县城中心的格尔登寺举行佛活动，遭到寺院附近军营的军人骚扰，引起僧人和民众在县城内僧侣和民众上万人举行游行和抗议游行，冲击县政府和公安局，遭到军警残酷镇压，当场开枪射杀30人，有僧人、学生和牧民，其中有一位孕妇、一个五岁的孩子，还有藏文中学初二一班的一个叫楞珠措的女孩。上千军人，约70辆军车、30辆军用麵包车包围县城。后来有18具尸体已送到格德寺念经超度，其他尸体送到其他寺院，还有很多人失踪。一些遇难者被拍到照片，血淋淋的照片迅速地传播到国外。之后，阿坝县增派大量军队，全面戒严，各寺院被封锁，许多僧俗藏人被抓。\n\n3月16日在阿坝县遭杀害的藏人中已知名单如下：扎西旺秀，27岁。次增，34岁。楞珠措，学生，17岁。罗布，学生，17岁。格坚，40岁。洛次，25岁。格盼塔阔，64岁。阿底夏，21岁。其余的遭杀害的藏人的名单等信息十年后的今天仍然无法获悉。\n\n3月16日，若尔盖县（阿坝州）朗木寺抗议事件中军警开枪， 死3人，伤多人，当地医院拒绝接受伤患。\n\n3月16日下午，安多玛曲县（甘肃省甘南藏族自治州）发生了规模空前的抗议活动，玛曲县当地寺院僧众的带领下藏文中、小学的学生，以及玛曲县上千名民众走上街头，一些汉人和回人的商铺被砸毁，16辆汽车被烧毁，大部分乡镇部门陆续被砸，当局急派军警镇压，当场开枪射杀了12名示威藏人，80多人拘捕，200多人受伤。被打死的其中一人是刚毕业于合作市医学院的仁青多杰，约25岁。当晚枪声不断，电源被切断。\n\n3月16日下午，在甘肃省会兰州，西北民族大学500余名西藏学生在校园内举行抗议示威游行，最后集中到操场静坐，并在校园张贴介绍拉萨情况的传单，表达与拉萨等地藏人“同甘共苦”。静坐从下午4点开始，藏语言文化学院多识教授（珠古）、该校院长以及西藏人教师前后劝说学生放弃静坐，但学生们仍然通宵静坐到17日晚。成都西南民族大学也有大量军警巡逻监视，担心西藏学生有行动。成都武侯祠被戒严，藏人居住区被员警严加看守。\n\n甘南合作师专、青海师专以及四川省甘孜州、阿坝州的一些学校西藏学生也有抗议行动。\n\n3月16日，拉萨城内的一些区域还在发生抗议，当局军队镇压抓捕。全城戒严。中午，在拉萨市内的主要道路和环绕城市的二环路，被抓捕的40多名藏人由军车载着被游街示众。两辆警车开道，在两辆军车上，40多个年轻的藏人男女，被捆绑双手，压着头，每人背后都有持枪的军人押守。\n\n拉萨附近达孜县有30-40人被逮捕；墨竹工卡县僧人举行和平抗议游行，遭到当局军警镇压，部分僧人遭到逮捕，部分僧人现已躲避他乡。山南桑耶寺的僧侣坐满两辆卡车准备去地区首府泽当举行抗议活动，被寺管会向军警告发，僧侣遭驱逐，寺院被围困。羌塘的那曲镇也有游行和抗议活动。在日客则的班禅喇嘛的主寺扎什伦布寺也有僧人的抗议活动。萨迦县等方也有僧人和民众的抗议活动,中共军警逮捕了最少四十名抗议者。\n\n3月16日下午，安多恰卜恰（青海省海南藏族自治州共和县）的僧侣和民众举行游行和抗议，被当局军警驱散。安多热贡（青海省黄南藏族自治州同仁县）的安多大寺隆务寺内有300多僧俗举行抗议活动，被数千武警包围，有十多辆军车、装甲车在街上巡逻。果洛拉加（青海省果洛藏族自治州玛卿县）拉加寺举行了和平抗议游行。噶巴森多县（青海省海南州同德县）民众举行了抗议游行活动，他们手持西藏国旗和达赖喇嘛画像。科才（甘南藏族自治州）僧俗举行了喂桑等宗教活动后，千人举行了抗议活动。安多（甘肃省甘南州夏河县）阿木去乎寺僧人举行了抗议活动。噶克（阿坝藏族自治州红原县）有数百名军人增派进驻。\n\n3月16日下午，康区（四川省甘孜藏族自治州）炉霍县各寺院准备游行抗议，当地派干部到各寺院劝阻和威胁，上千军人抵达该地。\n\n2008年3月14日，中国政府对拉萨的藏人抗议进行血腥镇压之后，16日再次在西藏安多阿坝和玛曲等地开枪射杀了参加抗议的藏人。这是中国政府向2008年藏人抗议运动第二次开枪射杀事件，16日在安多阿坝、玛曲等已知60十多人被杀，中国政府再次对藏人抗议的血腥镇压激起了藏人更多的抗议，藏人的抗议从西藏各地向中国各大城市的大学蔓延，在中国首都北京的西藏学生也举行静坐等方式抗议中国政府对藏人抗议实施武力镇压。\n\n另外，中国政府对藏人抗议再次实施武力镇压之后，激发了藏人更坚定的抗议决心。3月16日之后的西藏各地的抗议运动虽然未能举行大型的抗议活动，但是在各地的抗议继续此起彼伏。也直接影响了2008年之后十年里藏人接二连三的抗议运动，从乡村到牧区、从寺院到学校、从西藏到中国首都—-西藏人的抗议继续在蔓延—以集体抗议游行到自焚抗议，单独上街抗议到知识界的抗议，还在继续中的自焚抗议—-\n\n回顾中共非法侵占西藏的六十多年，相信各种抗议运动将会继续进行下去，直至西藏自由。"
		},
		{
			"post_id": 96,
			"title": "展开宣传攻势",
			"date_published": 1545462311.449,
			"body": "类似这种监控民众的岗位是很方便对其展开宣传攻势的。这种监控岗位晚上没有人了，也没有什么阻止别人进入的设施，可以在晚上把宣传资料直接放在这些监控岗位。监控人员无聊的时候可以拿来阅读。\n\n![9.jpg (0x0)](data/img/post_96_9.jpg)\n\n这种监控岗位总有楼梯走上去的，还可以在监控人员必经的楼道张贴传单，对其进行思想教育。每天都让他们看看中共的腐败生活，对比一下自己的监控工作条件，相信他们会有些感想的。"
		},
		{
			"post_id": 95,
			"title": "不要自焚，要积极行动！",
			"date_published": 1545453289.799,
			"body": "不知道拉萨这种小巷多不多。如果拉萨有很多这样的小巷，那就很容易张贴传单。这种小巷不太会安装监控摄像头，安装了也很容易破坏掉，即使不破坏掉，这种小巷晚上的照明也很差，摄像头看不清楚的。\n\n![9.jpg (0x0)](data/img/post_95_9.jpg)\n\n在这种小巷子内张贴传单，揭露中共的腐败，把中共在美国，加拿大的二奶村做成图片，给巡逻的军警，保安人员看太好了。他们每次清除传单的时候都是你的一次成功宣传。反复地张贴传单，过来巡逻的军警就会越来越多，看你传单的人就会越来越多，你的宣传目的就达到了。"
		},
		{
			"post_id": 94,
			"title": "西藏流亡政府要加快行动",
			"date_published": 1545407109.996,
			"body": "先做3件事，为西藏全民大起义做好准备。\n\n要尽快建立信息传播的通道；\n\n现在就要向中共驻西藏的军警传递宣传品，不能蛮干，要拿出办法来，把中共高层在海外的腐败情况做成图片向中共驻西藏军警驻地，派出所传递；\n\n像伊朗人民学习，在西藏各地建立反抗小组，接受西藏流亡政府的行动指令，各自独立行动，互相不联系。"
		},
		{
			"post_id": 93,
			"title": "川普簽署《西藏旅行對等法》 相關中國官員將禁入美國",
			"date_published": 1545277698.433,
			"body": "儘管先前中國抗議，美國總統川普仍在今天正式簽署《西藏旅行對等法》成為法律，國務卿龐皮歐將在未來90天內，公布相關中國官員名單，反制中國禁止美國人進入西藏的做法，這些中國相關官員也將不得進入美國。\n\n綜合媒體報導，白宮發表聲明指出，川普今天簽署4項法案，其中包含《西藏旅行對等法》（The Reciprocal Access to Tibet Act of 2018, H.R.1872） ，該法案由麻州民主黨眾議員麥考文（Jim McGovern）在2014年6月歐巴馬政府時期向國會提案，要求中國鬆綁對美國官員、記者和一般公民進入西藏的管制，根據對等外交原則，國與國之間應向對方公民提供對等的權利，確保美國人與中國人有一樣的外交權利。\n\n根據《西藏旅行對等法》要求，國務卿龐皮歐將在90天內，評估美國公民赴西藏的情況，並向國會提交報告，點名究竟是哪些中國官員禁止美國人進入西藏，並依此法對其實施制裁，未來5年國務卿也都必須每年向國會提交報告。\n\n美國參議院本月通過《西藏旅行對等法》後，中國外交部發言人陸慷14日表示，西藏事務屬中國內政，不容其他國家干涉，中國敦促美國行政部門阻止該案簽署成法。\n\n美國國務院負責東亞及太平洋事務的代理亞太副助卿石露蕊（Laura Stone）先前表示，一旦該法案成為法律，國務院必定落實執行。"
		},
		{
			"post_id": 92,
			"title": "援藏团体指中共无胆开放西藏 因有太多事实需隐藏",
			"date_published": 1545063036.132,
			"body": "【西藏之声2018年12月17日报道】美国国会两院先后正式通过《入藏互惠法》，中共外交部作出“粗暴干扰中国内政”等回应。国际声援西藏运动发表声明指出，中共无胆向美国开放西藏，因为他们在那里有着太多需要隐藏掩盖的事实。\n\n---\n\n美国国会参众两院先后正式通过旨在对抗中共封锁西藏政策的“入藏互惠法案”，获得流亡藏人官方与民间的欢迎和感谢。中共外交部则回应称：“美国国会通过的有关法案罔顾事实，粗暴干涉中国内政，违反国际关系基本准则……”。\n\n国际声援西藏运动本月15日于官网对中共的说辞提出反驳。\n\n该运动主席马提奥•梅卡其（Matteo Mecacci）在声明中指出，美国国会想要透过《入藏互惠法》来促成美国公民享有进入西藏的权利，就如中国公民在美国享受的对待一样。实际上今年10月就有媒体披露指出：中国官方曾致信一些参议员，敦促他们不要支持这份法案，这才是干预美国的立法程序。\n\n国际声援西藏运动指出，美国国会只是要求在美中关系中，互惠宗旨能够得到尊重，不仅仅是在贸易问题上，也包括美国公民的行动自由方面。\n\n中共外交部并未承认长期严格限制外国记者、官员等进入西藏的事实。然而，这份法案却明确指出：美国政府官员从2011年5月至2015年7月间，共递交39份进入“西藏自治区”的外交访问申请，其中仅有4次获得批准。\n\n今年五月上任的国务卿蓬佩奥（Mike Pompeo）在回应国会书面提问时，也曾表示：“川普总统一直希望美中关系能够具有互惠性质。我也将致力推动有关开放访问权限方面的互惠性，中国与其他许多国家正在美国享受着这些权利。”\n\n国际声援西藏运动质疑说，如果中国共产党有关西藏的宣传属实，为何还阻止美国的记者、外交官员在西藏自由旅行？他们又为什么阻止藏裔美国人前往西藏访问亲人？\n\n声明指出，**在将近70年的侵占统治过程中**，中共的压迫对藏人造成了巨大的痛苦。在对西藏实施奥威尔式的管控制度的同时，对外则封锁西藏，以消除任何异议。这已经造成超过150位境内藏人自焚抗议。“中国无胆依照互惠原则来向美国开放西藏，因为他们在那里有着太多需要掩盖隐藏的东西。”\n\n“入藏互惠法案”旨在结束中国对西藏的封锁，要求中国政府允许美国记者、外交官以及游客，在西藏不受限制地旅行，正如中国的记者与外交官以及大众能够自由访问美国一般。那些涉及阻挠美国外交官员、媒体记者与游客进入西藏的中国官员，也将被禁止进入美国。\n\n就在不久前，中共驻美大使曾以西藏的高海拔气候会令人不适为由，辩解中国限制外国人士入藏的政策。"
		},
		{
			"post_id": 91,
			"title": "德国人权专员获准访问西藏参加德中人权对话",
			"date_published": 1544114274.149,
			"body": "【西藏之声2018年12月6日报道】德国人权专员柯夫勒（Barbel Kofler）获得中国官方允许，于昨天（12月5日）前往中国控制下的西藏进行访问，并与中方官员进行“人权对话”对话。消息指出，柯夫勒访问“新疆自治区”的要求，被中国拒绝。\n\n![9.jpg (0x0)](data/img/post_91_9.jpg)\n\n德国人权专员柯夫勒在一份声明中指出，她希望能够访问新疆，那里预估有上百万以维吾尔人为主的穆斯林被关押在“政治再教育营”，中国官方对外宣称，这是为了打击恐怖主义与宗教极端主义。\n\n---\n\n有关新疆状况的报道令人感到震惊\n\n据美联社与华盛顿邮报等媒体报道，柯夫勒在声明中指出，“我对有关维吾尔少数民族所受对待的报道感到震惊。”她并表示将继续要求访问新疆。曾在“集中营”关押的维吾尔人证词指出，这些集中营的条件如监狱一般，被关押者遭强迫诋毁自己的宗教与文化背景，同时向共产党领袖与习近平主席表达忠诚。\n\n与此同时，有超过百万地方政府工作人员被派遣入住维吾尔家庭，监督他们的宗教活动与政治忠诚度，若有人被认为不忠，就会被送往集中营。\n\n维吾尔人与藏人一样，长期遭受中国当局打压，在经济、政治与文化方面遭受着中国的歧视对待。尤其是近年来中国设立的集中营，受到国际社会的关注。\n\n柯夫勒也在声明中指出，西藏的状况同样令她极度关切，因为传统佛教文明遭受严格限制管控。据悉她定于今明两天同中方官员对话。\n\n西藏遭受严管因此适合举办人权对话\n\n本月4日，德国总统施泰因迈尔展开对中国为期6天的访问行程。德媒《南德意志报》呼吁总统在中国应该关注人权问题，并提到德政府人权专员柯夫勒也同施泰因迈尔一道访问中国，并将前往西藏首都拉萨，在那里与中国官员进行为期两天的“德中人权对话”。\n\n报道指出，德中间的上一次人权对话于2016年举行，去年的对话被中国取消。德媒也引述柯夫勒的声明，表示她对无法前往新疆感到遗憾，但认为西藏也同样适合举行人权对话，因为有许多报道指当地的宗教活动与日常生活遭受着过度的管控限制。\n\n世界各国应该效仿美国的《入藏互惠法》\n\n今年11月，中国在联合国人权理事会接受普遍定期审议，其人权退步现象受到批评的同时，有9个国家特别关切西藏议题，共给出12项相关建议。其中多次提及允许外国外交官、记者与独立调查团访问西藏的事项。\n\n美国国会众院司法委员会、众议院、参院外交关系委员会，先后通过《入藏互惠法案》，该法案提出，正如中国人能够自由访美一般，美国官员、媒体记者及民众，也应该享有进入西藏的权利与自由。\n\n英国前内政部部长诺曼•贝克（Norman Baker）曾于日前在“全球法治委员会”网站撰文指出，中国长期禁止美、英等国的记者、包括他本人在内的外交官和公民进入西藏，尽管中国公民可以自由地到美国和英国旅行。偶尔被允许进入西藏的外国人也只能在中国当局的监督下旅行，与普通藏人的接触一般都受到阻碍，而且极有可能让对方陷入被当局拘捕折磨的危险。\n\n他表示在今天的国际趋势下，《入藏互惠法案》不失为一个有效的工具，来向中国施压。他呼吁欧盟与各国政府效仿美国这一举措。“真正的危险在于，如果放任中共肆无忌惮地践踏法治，形成新的国际规则，那么世界将回到黑暗的过去。”"
		},
		{
			"post_id": 90,
			"title": "卡尔梅克总统奥尔洛夫访问达兰萨拉拜见达赖喇嘛",
			"date_published": 1543683182.579,
			"body": "【西藏之声2018年12月1日报道】卡尔梅克共和国总统奥尔洛夫近日访问达兰萨拉，拜见达赖喇嘛尊者，并同藏人行政中央司政洛桑森格见面。\n\n![9.jpg (0x0)](data/img/post_90_9.jpg)\n\n图片版权：OHHDL 翻拍自CTA英文官网\n\n俄罗斯联邦卡尔梅克共和国总统阿列克谢•奥尔洛（Aleksey Orlov）近日访问印度达兰萨拉，昨天（11月30日）前往达赖喇嘛居所拜见尊者。\n\n---\n\n藏人行政中央驻俄罗斯联邦代表戴洛仁波切接受本台专访时介绍说，卡尔梅克总统奥尔洛夫还未当选前就曾多次访问达兰萨拉，当选总统后又于2011年前来拜见达赖喇嘛尊者，而且曾多次在尊者访问欧洲国家期间进行简短会面。\n\n据介绍，总统奥尔洛夫这次拜见尊者，特别介绍了卡尔梅克在政治、经济等方面所取得的进展，而且因明年9月总统任期将结束，他有意再度参选、继续服务，故希望获得尊者的加持。\n\n随同奥尔洛夫一同拜见尊者的戴洛仁波切告诉本台，尊者在接见总统时开示应努力成为重视佛学的21世纪佛教徒。尊者还回溯了卡尔梅克与西藏之间的历史关系，同时建议卡尔梅克也能够在基础教育体系中融入世俗伦理内容，成为其他俄罗斯联邦可效仿的榜样。尊者并且邀请卡尔梅克代表出席定于明年4月举行的世俗伦理教育国际会议，总统奥尔洛夫承诺将照做。\n\n此次访问达兰萨拉，卡尔梅克总统奥尔洛夫还拜访了乃琼护法“沽丹”即降神者，并与藏人行政中央司政洛桑森格会面。\n\n据戴洛仁波切介绍，当时总统奥尔洛夫与司政洛桑森格针对俄中、美中、美俄的政治关系，以及俄罗斯联邦政府对西藏议题的看法等进行了交流。总统向司政表示，在卡尔梅克几乎没有不了解西藏议题的人，大家都同情藏人遭遇的苦难。但是因特殊政治因素，卡尔梅克对西藏的援助方式也分公开与私下，这点各方应予以理解。\n\n卡尔梅克过半人口信奉藏传佛教，尊者曾于1992年与2004年先后两次访问该国。之后的14年中，尽管该国佛教徒一直在邀请尊者访问，但俄联邦外交部未再核发过签证。"
		},
		{
			"post_id": 89,
			"title": "习近平访问西班牙流亡藏人持西藏国旗集会抗议",
			"date_published": 1543506138.363,
			"body": "【西藏之声2018年11月29日报道】西班牙流亡藏人与支持西藏人士近日持西藏国旗与标语，在中共领导习近平访问马德里时进行抗议，要求习与达赖喇嘛对话。活动除受到中国人士的愤怒回应外，也获得了民众与媒体的关注。\n\n![9.jpg (0x0)](data/img/post_89_9.jpg)\n\n图片翻拍自图丹旺青脸书\n\n中共领导习近平于本月27日对西班牙展开访问，居住在西班牙的流亡藏人与支持者在马德里抗议中共对西藏的持续侵占统治。\n\n---\n\n活动参与者之一、流亡藏人议会欧洲区议员图丹旺青接受本台电话采访时介绍说，11月28日当天，十多名西班牙藏人与援藏人士在马德里市习近平经过的路段举办活动，持西藏国旗并展示出“西藏要人权”、“停止破坏西藏生态”，以及“习近平与达赖喇嘛对话”等英、中文标语。\n\n据介绍，为了避免参加活动的人数太多，引起警方过度限制，因此这次活动并未联络大众，只在事前约了个别藏人与支持者。\n\n图丹旺青表示，虽然活动人数并不多，但是受到很大关注。现场有大量中国人欢迎习近平，皆为中国官方安排的留学生，都穿着统一颜色的服装。藏人活动者未被允许接近习近平的车队，但习抵达时，几名成员仍挥舞西藏国旗进行抗议。“立即有一些中国人围住我们，用中国话愤怒咆哮，我们听不懂也没有回应，只是将手中的中文标语向他们展示，曾一度有警察介入。很多人注意到我们的活动，阅读我们的标语并拍照，还有电视媒体对我们进行采访。”\n\n在受访时，图丹旺青向西班牙记者表示，西班牙与中国进行贸易固然重要，但也应该重视中国的人权状况。遗憾的是，面对经济利益，西班牙与其它西方国家都未能挑战中共侵犯人权的行为。图丹旺青同时警告，如果不能重审中国政策，继续任由中共摆布，那么未来西班牙将与沦陷无异。\n\n就在本月1号，藏人行政中央司政访问西班牙，与马德里市市长卡梅拉会面，并受邀与图丹旺青一同参加“2018年全球自然环境资源展览会”。中方曾向主办方施压，要求取消对流亡藏人司政与议员的邀请，被拒绝后中国参展方宣布退展。\n\n司政洛桑森格在开幕式上致词感谢主办方及马德里市市长：“当许多世界领袖在中国的压力下避免与我见面时，您勇敢地邀请我在这一活动上致词，我非常感谢。世界各地的藏人也将向您的道德立场致敬。”"
		},
		{
			"post_id": 88,
			"title": "美国国会参议院外委会一致通过西藏旅行互惠法",
			"date_published": 1543505628.827,
			"body": "【西藏之声2018年11月29日报道】“入藏互惠法”今年早些时候在美国国会众院外委会一致通过，而后在众院正式通过，近日又在国会参院外委会获得通过。目前该项旨在对抗中共封锁西藏政策的法案，仅剩下在参院投票表决这一关。长期关注此法案的国际声援西藏运动指出，入藏互惠法取得又一个里程碑。\n\n![9.jpg (0x0)](data/img/post_88_9.jpg)\n\nICT主席感谢美参院外委会主席鲍伯•寇尔克 图片翻拍自ICT官网\n\n入藏互惠法案于今年九月在美国国会众院通过，这一法案旨在结束中国对西藏的封锁，要求中国政府允许美国记者、外交官以及游客，在西藏不受限制地旅行，正如中国的记者与外交官以及大众能够自由访问美国一般。那些涉及阻挠美国外交官员、媒体记者与游客进入西藏的中国官员，也将被禁止进入美国。\n\n---\n\n国际声援西藏运动主席马提奥•梅卡奇（Matteo Mecacci）在官网的一份声明中指出，“参议院外交关系委员会对此法案的一致通过，再一次反映出美国民众对西藏境内局势的担忧，以及对本国公民无法访问西藏的关切。”\n\n这一法案也提出，美籍藏人在试图申请签证去西藏探亲或朝圣时，总是会受到中共使领馆的歧视性对待。当下，中国严格限制美国在内的外国人进入西藏，而中国公民则可在美国与其它民主国家自由旅行。\n\n根据入藏互惠法，美国国务卿必须向国会递交报告，指证涉及相关限制政策的中共官员。这些官员将被禁止进入美国，直到中共改变其政策。近年来，美国两党的许多政客都对中国的不公平措施表示不满，并且要求中国政府在贸易，以及美国记者、外交官与公民进入中共治下各地的权限方面，落实互惠原则。\n\n美国国会众议员吉姆•麦考文（Jim McGovern）于2014年向众院提交“入藏互惠法案”，指出正如中国人能够自由访美一般，美国官员、媒体记者及民众，也应该享有进入西藏的权利与自由。今年7月25日，美国国会众院司法委员会通过 “入藏互惠法案”；9月25日，众议院正式通过了这项法案，获得援藏团体的欢迎。\n\n就在日前，国际声援西藏运动（ICT）发起活动，呼吁所有美籍藏人与支持西藏人士致信各自的民意代表，要求他们在国会中支持“入藏互惠法”。\n\n据了解，此次在参议院提出入藏互惠法的议员为马可•卢比奥（Marco Rubio）与塔米•鲍德温（Tammy Baldwin），而后获得伯尼•桑德斯（Bernie Sanders）、鲍伯•寇尔克（Bob Corker），以及苏珊•柯林斯（Susan Collins）等参议员的支持。"
		},
		{
			"post_id": 87,
			"title": "西藏青年会在美澳与台湾等国巡游推介西藏运动",
			"date_published": 1543505100.827,
			"body": "【西藏之声2018年11月29日报道】西藏青年会理事成员近期分组巡游北美和澳洲、台湾等国家，对西藏运动进行介绍推展，寻求各方的关注与支持。\n\n![9.jpg (0x0)](data/img/post_87_9.jpg)\n\n本月初，西藏青年会理事成员分成两支代表团，在北美、澳洲以及台湾等各国发起一场西藏运动巡游推介活动。\n\n---\n\n青年会会长丹增晋美接受本台采访时介绍说，西藏青年会理事成员扎西兰桑同扎西顿珠于本月4日前往美国，并在明尼苏达、威斯康星、旧金山、波特兰等地的藏人社区巡回演讲，介绍境内状况并阐释流亡藏人的责任，以及青年会所在开展的活动等。\n\n据介绍，该团队接下来将赴西雅图、犹他州、纽约、华盛顿特区，而后将前往加拿大继续巡游。\n\n另一支由理事成员次旺卓玛和边巴次仁组成的代表团，于本月15日前往澳洲，在悉尼、墨尔本、昆士兰等地进行了演讲，而后前往台湾。\n\n昨天（11月28日），青年会两名理事参加了藏台人权连线举办的座谈会，会议全程由主办方脸书账号直播。在会上，次旺卓玛介绍到青年会的成立初始与当下状况，以及西藏境内外的局势等，并在演讲结束后同参会者进行了问答交流。\n\n当天次旺卓玛还参加了李明哲宣判一周年纪念日的发布会，并呼吁中共政府释放李明哲。\n\n藏台人权连线发布消息指出，青年会两名理事将于11月30日，在台中东海社会科学院与好民文化行动协会两地进行公众讲话活动。\n\n此外，在今年12月，西藏青年会将另派遣一支代表团，前往瑞士、法国、比利时、英国、奥地利等欧洲国家展开巡游活动。"
		},
		{
			"post_id": 86,
			"title": "专访：流亡议员介绍“十六届西藏人民议会第六次会议”",
			"date_published": 1542437015.152,
			"body": "【西藏之声2018年11月17日报道】第十六届西藏人民议会第六次会议于今年9月下旬在达兰萨拉举行。在十天会程中，议员们针对内阁各部门工作进行审议质询，并对相关法案的修改、西藏境内状况与藏人抗争趋势等进行了讨论。西藏人民议会议员洛桑扎巴于会后接受了本台的专访，对此次会议进行了详细的介绍。以下为访谈内容：\n\n---\n\n西藏之声：第十六届西藏人民议会第六次会议已圆满结束，首先请你大概介绍一下这次会议，你们在这十天内都讨论了些什么内容?\n\n洛桑扎巴：第十六届西藏人民议会第六次会议已经圆满结束，西藏人民议会会议是每年举行两次，一次是在3月份，另一次是在9月份。这次的会议是属于“各部门的工作总结报告的质询会议”。像往常一样，不仅要让各部门部长做工作总结报告，而且要让来自各地的议员们进行质询，并让部长们一一作答。此外，这次会议中还通过了一些修法案，以及讨论了西藏境内外的趋势。\n\n西藏之声：这十天下来，你对此次会议怎么看？你觉得最乐观的部分是什么？\n\n洛桑扎巴：我们藏人行政中央是属于民主制，在议员们中有持有不同观点和策略的人，能够在这些不同当中可以进行讨论，我觉得这是一个民主社会所拥有的一个价值，觉得这是一个积极的成就。在这个会议当中我觉得值得最乐观的部分就是通过了几项极为重要的修法案，那就是藏人行政中央的选举法案。以前有很多不同组织以组织的名义提出某人为司政或者议员的候选人，并做大力宣传，但是在这次的修法案里已解除了该制度，这是一个很重要的修法案。第二个是，司正候选人在“预选”中得票数为百分之六十以上的话，不用通过“正式选举”的过程。这两个法案都通过了，对此感到乐观。\n\n西藏之声：这次会议当中有没有就“中间道路”和“西藏独立”这两个立场进行过讨论？\n\n洛桑扎巴：这次会议上对这两个立场没有进行过特殊的讨论，西藏人民议会是来自持有不同观点的议员所组成的，每个成员都应许秉持不同观点，所以在这次会议当中没有讨论过针对这议题的事情。\n\n西藏之声：藏汉间已经进行了九次商谈，但是至今还没有取得任何进展，你是不是还觉得解决西藏问题的最佳途径还是中间道路？\n\n洛桑扎巴：达赖喇嘛尊者的代表同中共已经进行了九次的商谈，到目前没有取得乐观的成果，这一事实我们可以接受。但是，我认为我们至今没有取得成果的原因不在于我们这一边，而是中共没有对中间道路这一政策采取严肃的态度，对我们藏人行政中央的真诚持有怀疑的态度，说成“倾向于独立”之类的借口，因此导致了没有成果的余地。以我本人的角度来说，中间道路是解决藏汉问题的最佳政策，其原因在于中间道路所提倡的和要求的不是西藏独立，而是寻求中华人民共和国宪法的框架下享有名副其实的自治而已，这个要求本身就接受了西藏不从中华人民共和国分割出去的条件。因此，中间道路这个互利的政策已经满足了他们的要求，所以中共政府对这政策应该采取严肃的态度来考虑。\n\n西藏之声：西藏人民议会第16届6次会议中，这次除了不同部门的工作总结报告之外，还通过了一些决议，请你能否给大家介绍一些主要内容。\n\n洛桑扎巴：第十六届西藏人民议会第六次会议中，除了不同部门的工作总结报告之外，也通过了一些决议。其中有为境内藏人在中共政府的打压下遭受着无尽的折磨，为此，警告中共政府改善西藏现今的局势，并呼吁中共政府与西藏至高无上的精神领袖达赖喇嘛尊者的代表团进行和平谈判。此外，还通过了一些悼念的议案，分别悼念近日过世的前西藏流亡议会副议长格桑占堆、印度前总理瓦杰帕伊，以及美国资深参议员约翰•麦凯恩。\n\n西藏之声：这次议会的会议是全程直播，不仅有很多流亡藏人观看，而且在境内也有很多人关注。因此，你作为一名西藏人民的议员，透过挪威西藏之声对境内的听众朋友有什么特别想要说的话？\n\n洛桑扎巴：作为一名西藏人民议会议员，我很同情境内藏人在中共的不同政策下所遭受着的痛苦。在西藏境内，宗教、语言、文化等各方面都处于紧张局势。但是我想呼吁大家，我们敬佩你们坚定不移的勇气，我希望这种精神能够持续下去。达赖喇嘛尊者一直坚定的信念着“中间道路”这一政策来解决藏汉问题，我本人也对这一政策报有很大的信心。我相信不久的将来在中共和西藏共益的条件和中间道路的政策下能够相聚在雪域圣地，我们的家乡西藏，谢谢！"
		},
		{
			"post_id": 85,
			"title": "藏人司政洛桑森格于美国会见参众两院议员",
			"date_published": 1542279615.015,
			"body": "【西藏之声2018年11月15日报道】藏人行政中央司政洛桑森格结束对欧洲的访问后，近日抵达美国，先后与美国国会参众两院的议员见面，并且出席了有关中共“一带一路”项目的研讨会。而后，司政将前往加拿大继续访问。\n\n藏人行政中央司政洛桑森格于10月底从达然萨拉启程，前往欧洲访问。\n\n10月31日，司政洛桑森格抵达西班牙首都马德里进行访问，并于11月2日在瑞士日内瓦出席“2018年人权论坛”。\n\n---\n\n11月11日与１２日，司政受德国援藏组织的邀请，在弗赖堡市等地发表了多场西藏议题的演说。\n\n结束对德国的访问后，司政前往美国华盛顿。据司政脸书帐号发布的消息与图片，洛桑森格于华盛顿会见了美国国会众议员吉姆•麦考文（Jim McGovern）、参议员科里•加德纳(Cory Gardner) 等议员。\n\n而本月13日，司政出席由“美国国家民主基金会”（National Endowment for Democracy）举行的论坛，就中共的“一带一路”项目发表了演说。\n\n司政再度以西藏60年前的遭遇为例，揭露了中共所谓“一带一路”的真面目。他表示，中共当年建造通往西藏的公路，承诺给予藏人和平与繁荣，但藏人们等到的却是被殖民的命运。因此，今天中共对其“一带一路”项目的美化宣传，亟需受到各方警惕。"
		},
		{
			"post_id": 84,
			"title": "司政洛桑森格：六百万藏人在精神层面已战胜中共",
			"date_published": 1542128119.564,
			"body": "【西藏之声2018年11月13日报道】藏人行政中央司政在访问德国期间，以西藏的未来为主题发表演说。他强调，中共侵占西藏后摧毁了98%的佛寺、强迫99%的僧尼还俗。但是藏人将剩余的2%视作机会继续努力，60年过后，藏人依旧没有舍弃对佛教的信仰，并推动佛教的复兴。因此，从精神层面来看，六百万藏人已战胜中共。\n\n11月11日，**藏人行政中央司政洛桑森格受德国援藏组织的邀请**，围绕西藏未来主题发表公开演说。藏人行政中央英文脸书帐号上传了演说全程视频。\n\n---\n\n司政向聚集的德国民众介绍了西藏的过去与当下状况，同时强调西藏的地理位置与环境生态特殊，因此西藏议题与世界其它国家的命运也息息相关。\n\n司政并提到，西藏议题有关人权、正义、民主与真理，而这些就是德国民众，乃至全世界都应该极力维护持守的价值。中国政府千方百计阻挠任何人提及西藏议题，其实恰恰证明西藏的局势有多么严峻。就在本月4日，一名23岁的藏人成为第153位抗议中共统治的境内自焚者。\n\n司政将中共当局近年大力宣传的“一带一路”项目，与中共侵略西藏时先建设基础设施后进军侵略的情况进行了对比，提醒那些仍然对这一项目抱有幻想的国家谨慎对待。\n\n在演讲结尾，司政指出今年是藏人流亡的第六十个年头，从一方面看，西藏的悲剧仍然没有结束，但从另一方面来看，流亡藏人不但生存了半个多世纪，更延续了西藏的宗教与文化。中共入侵后摧毁了98%的西藏寺院，99%的僧尼被禁止修学佛法，但是在流亡过程中，藏人重建佛寺、延续了佛法传统，境内的佛法也得到复兴，而且中国的佛教徒人数也不断上升。\n\n“这就是西藏的精神，98%的佛寺被摧毁，藏人则将那剩下的2%视作机会，继续努力，60年后的今天，境内外藏人却依旧延续珍贵佛法。当年让佛法在西藏消失殆尽的毛泽东若有灵，应该也会对此不解。因此从精神层面来看，六百万藏人战胜了中共。”"
		},
		{
			"post_id": 83,
			"title": "澳洲智库：所谓“中国特色人权”意味那根本就不是人权",
			"date_published": 1541937041.647,
			"body": "【西藏之声2018年11月8日报道】中国于联合国人权理事会接受普遍定期审议时，一口否认所有针对其人权退步的谴责，并声称将继续走“中国特色人权发展道路”。澳洲一智库发文评论所谓“中国特色人权”根本不是人权。针对中共代表此次声称将邀请外国外交官访问西藏等地的承诺，外界表示将拭目以待。\n\n中国于本月7日在联合国人权理事会接受其第三轮普遍定期审议，各大民主国家就西藏人权、新疆集中营，以及维权律师遭打压、香港自由被不断钳制等问题提出关切与建议。中共代表团则在会上继续否认、辩解一切指控。\n\n---\n\n中共代表团团长、中共外交部副部长乐玉成在审议中发言，美化中共对藏人与维吾尔人等民族的打压迫害政策，并声称将继续走“中国特色人权发展道路”。\n\n澳洲智库戰略政策研究所（ASPI）今天（11月8日）刊登研究员瑞安（Fergus Ryan）的评论文，直指所谓“中国特色人权”，根本就不是人权。\n\n文章指出，澳洲代表此次在审议中提出习近平治下人权的持续恶化，包括言论表达、宗教信仰、死刑、以及对维权人士的拘捕打压。澳洲代表特别呼吁中国停止对维吾尔等穆斯林的大规模拘禁。中国治下除西藏以外，没有其他地方人权恶化比新疆所经历的更快、更系统化。中共在新疆采取打压措施之迅速，以至于根本没有给其他国家做出实质性反应的机会。\n\n中共声称正在发展“中国特色”的人权，作者在文章中指出，这一词汇也被北京用来形容其政治体制——“中国特色社会主义”，这意味着它根本不是社会主义，正如赵紫阳秘书鲍彤所写，这一词汇只是在证实中共的无上掌控权威。\n\n中共代表团团长还在发言中称将“结合国际会议和学术交流等活动，邀请有关外国政要和驻华使节访问西藏等少数民族地区。”中共外交部于审议后发表的“人权保障新举措清单”中，也列出这项内容，并指将“邀请人权高专巴切莱特女士适时访华，支持人权高专根据授权开展工作。”\n\n此次审议中许多国家均提出建议，要求中国允许联合国相关人员与其他国际独立机构代表，进入西藏与新疆等遭受封锁的地区，调查真实状况。有评论指出，中国是否能真的允许外国政要与外交人员进入西藏，各方还需拭目以待。"
		},
		{
			"post_id": 82,
			"title": "藏人声援台湾，香港。",
			"date_published": 1541490982.456,
			"body": "![9.jpg (0x0)](data/img/post_82_9.jpg)"
		},
		{
			"post_id": 81,
			"title": "不惧中共压力西班牙国际展会邀司政与会中方代表退出",
			"date_published": 1541249028.776,
			"body": "【西藏之声2018年11月3日报道】西班牙马德里举办“2018年全球自然环境资源展览会”，邀请正于当地访问的藏人司政洛桑森格参加，结果引发中方参展单位的不满。在妄图透过施压来阻止藏人出席活动未果后，中方退出展览会。\n\n“2018年全球自然环境资源展览会”于11月1日在马德里国际会展中心举办，活动主题为山地旅游业与其可续发展性。藏人行政中央司政洛桑森格与流亡藏人议会欧洲区议员图丹旺青应邀出席开幕式。\n\n---\n\n据藏人行政中央英文官网消息，中国参展方曾向主办方施压，要求取消对流亡藏人司政与议员的邀请。这一无理要求被主办方拒绝后，中国参展方从“2018年全球自然环境资源展览会”退出。\n\n司政在开幕式上致词感谢主办方及马德里市市长卡梅拉（Manuela Carmena）：“当许多世界领袖在中国的压力下避免与我见面时，您勇敢地邀请我在这一活动上致词，我非常感谢。世界各地的藏人也将向您的道德立场致敬。”\n\n在致词中司政介绍了藏人自古延续下来的生活方式，与大自然之间的和谐关系，同时提及境内恶劣人权状况，包括牧民遭当局强迫搬离世代居住的草场、西藏自然资源被掠夺、环境遭破坏等情况。他指中国使用“西藏”这一名称，并非巧合，而是显示出其侵占西藏的意图——就是要掠夺“西部的宝藏”。\n\n此外，在中国即将于联合国接受普遍定期审议前夕，藏人行政中央于日内瓦举办“2018人权论坛 ”，司政出席论坛并发表了讲话。\n\n据英文官网报道，主办方邀请了多位人权专家、学者、外交官员、活动人士讨论中共治下各地的恶劣人权状况。\n\n中共外交部则于近日声称已向联合国提交《国家人权报告》。疑似预料必将面对各方对新疆、西藏及香港自由情况的严厉质询，中共称此次除派遣外交部官员参加联合国审查外，还特别派出“新疆和西藏自治区、港澳特区政府代表组成的高级别代表团参加。”"
		},
		{
			"post_id": 80,
			"title": "洛桑森格会见西班牙国会议员吁建立支持西藏小组",
			"date_published": 1541161352.231,
			"body": "【西藏之声2018年11月2日报道】藏人行政中央司政洛桑森格近日访问西班牙，与马德里市市长见面，并会见多名国会议员，向对方介绍西藏境内局势的同时，呼吁建立国会支持西藏小组。\n\n![9.jpg (0x0)](data/img/post_80_9.jpg)\n\n司政洛桑森格近日对西班牙展开首次访问，于10月31日受马德里企业联合会（CEIM）邀请，发表演说。\n\n据藏人行政中央英文官网刊登的消息，司政在演讲会上感谢马德里企业联合会发出的邀请，以及该组织对西藏议题的关注。在被问及该如何帮助西藏时，司政指出该团体可以推动对西藏脆弱生态环境的保护，他并介绍了西藏被誉为亚洲水塔，是因为与数亿亚洲人生活息息相关的主要河流都源自那里。\n\n而后，司政同多名西班牙国会议员见面，感谢大家在议会召开之际能够前来，并强调这向藏人，尤其是境内藏人传递了一个正面的讯息，在得知外界仍有许多人关注和平、正义和人权，他们必将受到鼓舞。\n\n在向议员们介绍西藏境内的严峻局势时，司政形容状况犹如文革再现。他提到过去数年中西藏境内有152人自焚抗议，如果藏人真如中国政府所说的那样满足于现状，为何还有这么多人自焚？\n\n---\n\n司政再次引述自由之家的报告结果指出，西藏的自由程度甚至低于叙利亚，而且记者无疆界的报告也显示西藏比北韩更难于进入。\n\n司政并强调，中间道路是解决西藏问题的唯一途径。这是超越继续现状与选择独立之间的一条道路，也就是既不接受中国当局对西藏实施的现行压迫性政策，也不去寻求从中华人民共和国独立。\n\n在向西班牙国会议员发出访问达兰萨拉的邀请后，司政也敦促各方在国会中为西藏议题发声，并且成立西班牙国会支持西藏小组。\n\n据报道，司政此次也拜访了马德里市市长卡梅拉 (Manuela Carmena)，并在当地西藏之家的邀请下，向西藏关注者发表演说，主题为西藏文化的价值与重要性。\n\n在演说中，司政提出要想了解中国，就必须了解西藏议题，否则便很难认识中国与其意识形态。中国入藏前声称会带去和平与繁荣，他们以发展为名修建公路、桥梁与机场，并且与少数宗教领袖及贵族合作，仅为影响大众。但是最后，中国没有能够赢得藏人的心，超过百万藏人在中国的不公政策下死亡。有些死于军事入侵，有些死于中国不合逻辑的经济政策所造成的饥荒，还有人在中国劳改营中受迫害而死。\n\n司政指出，中国政府从最初就计划将西藏改变成中国，将藏人同化成中国人，意图完全消灭西藏传统与文明的基础。如今，中国当局不去反省其错误政策，反而继续政治压迫、文化灭绝、社会歧视、经济边缘化与环境破坏行为，这些都使得藏人无法信任中国政府。"
		},
		{
			"post_id": 79,
			"title": "智利国会代表团参访达兰萨拉觐见达赖喇嘛",
			"date_published": 1540908528.117,
			"body": "【西藏之声2018年10月30日报道】一支由智利国会成员组成的代表团，近日访问达兰萨拉觐见达赖喇嘛尊者，并参观藏人行政中央与非政府机构。代表团此次访问达兰萨拉的目的，是为进一步了解西藏议题与达赖喇嘛尊者所倡导的世俗伦理。\n\n---\n\n在藏人行政中央驻南美代表次旺平措的陪同下，一支智利国会代表团近日访问印北达兰萨拉。该团队由智利自由党议员瓦杜格（Vlado Mirosevic Verdugo）带领，其他成员包括另外三名来自不同政党的议员、智利援藏组织代表，以及“世俗伦理项目”负责人等。\n\n今天（10月30日），该团队拜见了达赖喇嘛尊者。据介绍，尊者在会面中向他们仔细阐释“世俗伦理”，以及人类不容忽视的道德和慈悲心等主题。\n\n驻南美代表次旺平措接受本台采访时介绍说：“由于距离等各方的因素，智利与西藏少有接触。但是，这个国家对达赖喇嘛尊者的崇敬，以及对西藏文化的关注却相当高。”\n\n该团队参观了西藏儿童村，了解到流亡社区的教育状况，并计划前往西藏图书馆，了解由图书馆正在实行的多项“世俗伦理”推展计划详情。\n\n2015年11月，智利国会议员及援藏组织代笔曾参访达兰萨拉，并会见达赖喇嘛尊者。当时尊者讲述了世俗伦理概念，给议员们留下深刻印象，于是他们回国后在一所学校里开设世俗伦理课程。此次国会代表团再度访问达兰萨拉的目的之一，便是就世俗伦理的推展经验进行交流。"
		},
		{
			"post_id": 78,
			"title": "流亡藏人官方发布西藏独立历史与当今自治诉求三语报告",
			"date_published": 1540907775.404,
			"body": "【西藏之声2018年10月30日报道】藏人行政中央在印度首都新德里举办研讨会，同时发布藏中英三语报告《西藏从来不是中国的一部分，但解决西藏问题“中间道路”仍然是一个可行的解决方案》，以强调西藏独立历史的同时，推介中间道路。\n\n![9.jpg (0x0)](data/img/post_78_9.jpg)\n\n2016年12月藏人行政中央曾发布报告《西藏不是中国的一部分，但是“中间道路”政策是解决西藏问题的最好途径》。昨天（10月29日），行政中央发表了名称极为相近的藏、中、英三语新报告《西藏从来不是中国的一部分，但解决西藏问题“中间道路”仍然是一个可行的解决方案》。\n\n---\n\n本台驻新德里记者发来报道指出，昨天下午，藏人行政中央司政洛桑森格、印度尼赫鲁大学教授阿南德•库马（Anand Kumar）等人，共同于新德里为这份新报告揭幕。其他与会者包括关注西藏抗争的印度学者、研究人士，以及各国驻新德里大使馆官员共六十余人。\n\n司政在发布会上致词指出，这部报告是对中共大肆歪曲西藏议题而做出的反驳。此外，报告内容也包括针对中共干预藏传佛教上师转世的谴责。司政强调，按照西藏的宗教传统习俗，转世制度除了相关的高僧大德之外，其他任何人都没有权利干涉。中国共产党不论如何都与这一事务无关。\n\n司政也希望中国政府认清现行治藏政策的错误性质，并指六十年的统治下，第二、第三代藏人仍然参加各种形式的抗议活动，传递出一个清晰的讯息——现行的压迫政策无法被藏人所接受。他呼吁中国政府认清现实，与达赖喇嘛尊者的代表进行对话。\n\n在发布会上，尼赫鲁大学教授阿南德•库马指出，中国领导拒绝从苏联与大英帝国的解体中汲取教训，他们应该认清帝国主义不会有结果，并且接受藏人的中道提议。\n\n发布会结束后，司政洛桑森格与印度专家展开研讨，主题围绕近代中印政治趋势，以及喜玛拉雅民众眼中的西藏议题。"
		},
		{
			"post_id": 77,
			"title": "西藏与蒙维港台独立人士在日本成立“自由印太联盟”",
			"date_published": 1540659100.518,
			"body": "【西藏之声2018年10月26日报道】流亡藏人社区与南蒙古、东突厥斯坦、香港及台湾的代表今天在日本国会举办新闻发布会，宣布正式成立“自由印太联盟”，以对抗中国殖民霸权。\n\n![9.jpg (0x0)](data/img/post_77_9.jpg)\n\n今天（10月26日），西藏台湾人权连线理事长札西慈仁、流亡藏人议员朗杰卓嘎、南蒙古大呼拉尔主席席海明，以及来自维吾尔团体、香港、台湾、越南等方面的组织代表，共同聚集于日本国会，召开新闻发布会，宣布正式成立“自由印太联盟”（Indo-Pacific Strategy）。\n\n据自由印太联盟官方脸书账号发布的视频直播，南蒙古代表席海明、维吾尔代表热比娅、以及越南联盟团体的代表先后在新闻发布会发言，介绍了各自的理念与诉求，以及对中共殖民的抗议。\n\n---\n\n流亡藏人议员朗杰卓嘎在新闻发布会上指出，此次结盟的各方都经受着由中共所造成的创伤痛苦。大家在此聚集是重写历史，为了将来各个民族的下一代能够拥有属于自己的和平、自由、民主的国家。\n\n朗杰卓嘎并向各方强调西藏被中共武力侵占统治这一事实。她申明，境内藏人一切形式的抗议，都是中共非法侵占与高压统治所造成的，绝非中共所言由境外策划煽动。\n\n她谴责中共系统化消灭藏人文化身份，因此西藏议题不仅仅是人权问题，也有关一个民族的存亡。如果今天世界放任中共的霸权扩张，那么今天西藏的苦难，就极有可能发生在其它国家与民族的身上。\n\n朗杰卓嘎发言时，西藏台湾人权理事札西慈仁全程站立在其身后，向与会各方展示西藏国旗。\n\n长期支持西藏独立抗争，并曾去过西藏的印度摄影记者维杰•克兰蒂（Vijay Kranti）也与会致词，为各方分析了中印藏关系及国际趋势。\n\n自由印太联盟官方脸书发布的一份中文声明指出，近年来印度、日本、美国、澳洲等印度-太平洋民主国家的政府提出“印太战略”，以反制中共霸权扩张及殖民主义，维护印太地区的自由与开放。自由印太联盟筹备方认为：“为了维护印太地区的自由、和平与人权，不能只有政府间的军事与安全合作，还需要印太各民族、各地区的民间力量联合起来。因此，西藏、南蒙古、维吾尔、台湾、日本、印度、越南致力于民主和人权运动的人士，决定成立一个民间的自由印太联盟”。\n\n“自由印太联盟”的宗旨为：“透过民间力量，并游说相关国家政府，以有效之策略和方法追求和维护印太地区各民族的自由、人权与民主；要求相关国家尊重少数民族信仰宗教，使用民族语言，以及保护、发展民族文化的自由。”"
		},
		{
			"post_id": 76,
			"title": "被中國封殺的美國影星李察・基爾　為西藏人權發聲獲德國大獎",
			"date_published": 1540560874.342,
			"body": "![8.jpg (0x0)](data/img/post_76_8.jpg)"
		},
		{
			"post_id": 75,
			"title": "图博特与满洲有条件先独立建国",
			"date_published": 1540469542.495,
			"body": "![1.jpg (0x0)](data/img/post_75_1.jpg)"
		},
		{
			"post_id": 74,
			"title": "美国国会参众两院工作团队访问达兰萨拉了解西藏议题",
			"date_published": 1540392999.849,
			"body": "【西藏之声2018年10月24日报道】美国国会参众两院的三工作人员为进一步了解西藏议题，而于近日访问达兰萨拉。他们觐见达赖喇嘛尊者，并拜会藏人行政中央司政及议会议长，认识了流亡藏人官方机构的运作，以及民主制度的发展。\n\n![8.jpg (0x0)](data/img/post_74_8.jpg)\n\n近日，美国国会参众两院的一支工作团队访问印北达兰萨拉。该团队成员包括参议院外交理事会工作人员迈克尔•席费(Michael Schiffer)、达米安•莫菲 (Damian Murphy)，以及众议院外交理事会工作人员萨吉特•甘地（Sajit Gandhi）。\n\n---\n\n本月22日，该团队拜见了西藏人民至高无上的领袖达赖喇嘛尊者，随后又与司政洛桑森格及其它阁员见面，并同西藏人民议会议长堪布索南丹培进行了交流。\n\n据藏人行政中央外交与新闻部接待人员介绍，此次美国参众两院的工作人员访问达兰萨拉，主要是为了解藏人行政中央和流亡藏人社区的状况。因此，该团队还参观了西藏图书馆、难民接待中心、大乘经院、成人教育学校，以及罗布林卡西藏文化保护中心等单位。\n\n在各国国会中支持西藏的力量，主要来自两院不同政党议员。与此同时，与议员们合作的国会不同部门的工作人员同样扮演着重要角色。去年5月，藏人行政中央便邀请欧洲议会的多名工作人员访问达兰萨拉，与藏人官方及民间接触交流，帮助对方进一步了解西藏议题。"
		},
		{
			"post_id": 73,
			"title": "西藏与维蒙团体在布鲁塞尔集会吁亚欧峰会关注人权",
			"date_published": 1540051231.77,
			"body": "【西藏之声2018年10月20日报道】“非联合国会员国家及民族组织”于近日联同世界维吾尔大会、南蒙古人权讯息中心，以及国际声援西藏运动等团体，在布鲁塞尔的欧盟委员会外举办集会，呼吁前来参加亚欧峰会的各国领袖，促使中国为其侵害人权的行为负责。\n\n![9.jpg (0x0)](data/img/post_73_9.jpg)\n\n本月18日，“非联合国会员国家及民族组织”（UNPO）在布鲁塞尔举办集会，与藏人、维吾尔人以及南蒙古团体成员一道，挥舞西藏与东突厥斯坦旗帜，用不同语言呼喊抗议中共的口号，现场并有越南团体参与声援。\n\n---\n\n根据活动现场的图片与视频显示，各方代表在集会上致辞，要求欧盟认清中国政府的极权性质，并且能够恪守欧盟的人权、民主与法治价值。\n\n欧洲议会支持西藏小组主席托马斯•曼（Thomas Mann）在讲话中发出呼吁，希望欧盟成员国团结应对中共的侵犯人权行为。他代表欧洲议会对藏人、维吾尔人、南蒙古人表达支持，并且强调欧洲议会将继续推动中国的变革。“欧洲议会就是人权的议会，永远不会停止为人权发声。”\n\n国际声援西藏运动欧盟政策主任文森特.迈藤（Vincent Metten）在发言中指出，人权往往不在亚欧峰会这类国际会议的议程中，因此极有必要在此提醒各国的与会者，包括中共总理李克强，请将人权放入主要议程。\n\n在“非联合国会员国家及民族组织”官网发布的声明中指出，过去数年来，中国的人权状况持续恶化。特别是民族与宗教群体，更遭受着严重的迫害。当局以“反恐”为名，公然进行民族歧视、大规模监控、肆意拘禁等。面对不断争取基本人权的少数民族，中国的回应方式是持续加强的迫害。\n\n声明指出，亚欧峰会是欧洲与亚洲各国间的重要互动，涉及各方共同面对的政治、经济与社会文化议题，并且旨在追求增加合作与互信。因此，这样的平台，也是欧盟领袖针对中国恐怖人权状况进行施压的绝佳机会。"
		},
		{
			"post_id": 72,
			"title": "西藏流亡议员继续对印度各地政府开展游说活动",
			"date_published": 1540048637.809,
			"body": "【西藏之声2018年10月20日报道】西藏人民议会成员日前分组前往印度各邦开展游说，争取印度政界对藏人抗争的更大支持。近日，议员们分别拜会北方邦、哈里亚纳邦，以及旁遮普邦的行政长官和首席部长在内的政要，就西藏议题进行了详细介绍。\n\n第十六届西藏人民议会第六次会议结束后，议会派遣多支代表团前往印度各地，拜访各邦首席部长在内的政要，就西藏议题展开游说。\n\n---\n\n由议员次仁玉珍带领的议会小组，从本月10日起在北方邦进行为期5天的游说活动。该小组拜会了北方邦首席部长阿蒂提亚纳特（Shri.Yogi Adityanath）和前首席部长亚达夫（Akhilesh Yadav），以及印藏友好协会会长舒克拉（Shri Sanjay Shukla）等数十名官方与民间人士。\n\n议会代表团向北方邦政要介绍了印藏特殊历史关系，以及中共对境内藏人所实施的镇压政策、藏人行政中央所秉持的“中间道路”政策等。此外，议员们还向迄今该邦政府和人民对藏民给予的帮助表达敬意，同时呼吁邦政府继续对藏人经商者提供帮助。\n\n另一组由议员达瓦次仁等组成的代表团，于本月初在北阿坎德邦拜会该邦行政长官拉尼•莫亚(Shri Baby Rani Maurya)和首席部长特里温德拉•辛格•拉瓦特(Shri Trivendra Singh Rawat)、首席秘书库马•辛格(Shri Utpal Kumar Singh)等。\n\n结束对该邦的游说后，代表团于12日对哈里亚纳邦(Haryana）展开游说，拜会了邦行政长官（Satyadev Narayan Arya）和众议院议员，以及非政府组织的代表。\n\n随后，议员们又前往旁遮普邦，拜会了该邦首席部长阿马林德•辛格（Capt. Amarinder Singh）和议会议员，以及非政府组织的代表。\n\n议员们在哈里亚纳和旁遮普两个邦内为期六天的游说活动中，总共拜会了行政长官和首席部长，以及议会议员等近五十人，并向他们介绍了境内的藏人自焚事件，呼吁对自焚者的诉求给予关注，以及希望印度在与中国政府举行会面时，将西藏议题纳入讨论，并推动藏中重启和谈。此外，也对印度政府和民间一直以来的支援表达了感谢。\n\n本月16日起，该团队开始对查谟•克什米尔邦展开游说活动。\n\n藏人行政中央将今年设为“感恩印度”年度。因此，议员们在开展这一活动的同时，也对印度政府和民间一直以来的支持和援助表达了感谢。"
		},
		{
			"post_id": 71,
			"title": "ICT：法国与捷克组建国会西藏小组展现欧洲援藏态度",
			"date_published": 1539780421.334,
			"body": "【西藏之声2018年10月16日报道】国际声援西藏运动发表声明，欢迎近期法国与捷克先后成立各自的国会援藏小组。声明并指出，这是欧洲持续支持藏人的一个重要表态。\n\n![9.jpg (0x0)](data/img/post_71_9.jpg)\n\n捷克国会9月组建支持西藏小组，并于近日司政洛桑森格访问布拉格时正式宣告成立。该小组拥有50位来自参众两院不同政党的议员，成为欧洲最大的国会支持西藏小组。\n\n而在法国众议院，本月也重新建立支持西藏小组，拥有17名不同政党的众议员加入。法国参院则已经设有包含23名议员的西藏小组。\n\n---\n\n国际声援西藏运动昨天（10月15日）发布声明指出，鉴于西藏的局势持续严峻，因此西藏问题是否仍然存在于国际与国家政治的主要议程中，极为重要。“因此，我们对法国与捷克成立国会支持西藏小组的举措感到鼓舞。”\n\n声明特别指出，近年来在中国的影响下，捷克官方传统的支持西藏立场出现了巨大的变化。中国利用经济诱惑来促使捷克领袖消除针对中国人权侵犯问题的批评之声。\n\n2016年，捷克总统泽曼就拒绝向一位大屠杀幸存者授予奖章，仅仅因为该人的侄子——也就是时任文化部长赫尔曼与达赖喇嘛尊者进行了会面。这个国家在后共产主义时代的政策原本一直倾向于对人权的提倡，这一态度在中国面前却出现180度转变。\n\n国际声援西藏运动在声明中强调，就在这样的趋势下，捷克能够成立欧洲最大的国会支持西藏小组，更值得各方的欢迎。"
		},
		{
			"post_id": 70,
			"title": "法国众议院组成第十五届国会支持西藏小组 ",
			"date_published": 1539261697.206,
			"body": "【西藏之声2018年10月9日报道】法国国会众议院近日组成新一届“支持西藏小组”，有十六名来自不同政党的议员加入，表达对西藏抗争的支持。"
		},
		{
			"post_id": 69,
			"title": "援藏团体代表在联合国普遍定期审议前期会议关切西藏",
			"date_published": 1539261555,
			"body": "【西藏之声2018年10月10日报道】中国定于下月接受联合国普遍定期审查，在此之前，有多个团体就中共践踏人权行为向联合国提交报告与建议。而本月9日，德国西藏倡议组织与香港及维吾尔等团体的代表，在日内瓦 …"
		},
		{
			"post_id": 68,
			"title": "推动西方各国立法“入藏互惠法案”",
			"date_published": 1534429399.721,
			"body": "流亡藏人组织，西藏独立运动组织，尽快行动起来，推动西方各民主国家像美国一样立法“入藏互惠法案”。"
		},
		{
			"post_id": 67,
			"title": "达赖喇嘛透过视频在美促进宗教自由部长级会议致词",
			"date_published": 1532919121.939,
			"body": "【西藏之声2018年7月26日报道】美国国务院近日召开“促进宗教自由部长级会议”，不仅邀请西藏前政治犯果洛晋美等藏人代表出席，并在会上播放达赖喇嘛尊者对此次活动录制的视频。尊者强调，各大宗教延续了数千年，也将继续延续下去，因此彼此之间保持和谐极为重要。关键就在于认清并非所有人类都适合同一种宗教。\n\n---\n\n美国国务院本月24日于华盛顿召开“促进宗教自由部长级会议”（Ministerial to Advance Religious Freedom）。西藏前政治犯果洛晋美、藏人行政中央驻北美办事处代表欧珠次仁、国际声援西藏运动副主席布琼次仁等，与其他民族及宗教信仰团体代表，以及美国国务院官员一道出席活动。而达赖喇嘛尊者也透过视频，对此次会议作出祝福与期许。\n\n尊者向与会者致意之后，表示这样的会议与今天的世界非常有关联，而且极为重要。“首先，我们今天仍然需要宗教信仰，而且为了更加有效地利用宗教信仰，来推动社会和谐，这样的会议就更加有必要。”\n\n“我一直在致力的，是以佛教传统来为社会和谐付出贡献，但绝不是在宣扬推介佛教信仰。我总是在关注自己的宗教能够如何帮助大家培养内心平，也包括那些无信仰的人。因此我希望，所有宗教信仰都能够关怀人类的整体福祉利益，也认清所有人不可能全部选择同一种信仰。”\n\n尊者继续表示，世间不同宗教信仰已经流传数千年，未来也必定会继续存在下去，同时对信徒产生利益，因此大家保持彼此之间的和谐极为重要。\n\n“我坚信，你们聚集在那里，必定能够对宗教和谐产生贡献。而且大家可以更有效地利用‘世俗’的方法来推动和谐。这里的‘世俗’，是使用了古印度的解释——尊重所有宗教信仰，也尊重没有信仰的群体。这非常适应实际。”\n\n尊者强调：“因为有10亿人没有宗教信仰，他们也是人类兄弟姐妹，他们也希望获得平和的内心，所以，透过世俗的方法来服务人类，是最为实际的途径。”"
		},
		{
			"post_id": 66,
			"title": "美国众院司法委员会一致核准“入藏互惠法案”",
			"date_published": 1532917567.061,
			"body": "【西藏之声2018年7月26日报道】美国国会议员吉姆•麦克高文等，于2014年向众院提交“入藏互惠法案”指出，正如中国人能够自由访美一般，美国官员、媒体记者及民众，也应该享有进入西藏的权利与自由。昨天7月25日，美国国会众院司法委员会一致通过 “入藏互惠法案”，下一步将于国会中提出。该委员会委员纳德勒指出，这项法案之所以非常重要，是应为这能够帮助曝光西藏所在发生的人权侵犯状况。\n\n---\n\n根据美国众院官网公布的视频，众院司法委员会委员们轮流发言对“入藏互惠法案”表达支持。\n\n众议院司法委员会主席鲍勃•古德拉特（Bob Goodlatte）发言指出，是份法案关切在“西藏自治区”与其他受中国控制的藏地一直存在且不断恶化的问题——中国对藏人的对待方式。1950年中国解放军进藏以达到统治当地的目的，之后中国政府一直严格限制藏人的人权自由，包括宗教信仰、行动自由、维护文化语言的自由。与此同时，中国在西藏实施法外处决、折磨、以及任意拘捕，近年来有超过150名境内藏人自焚抗议，希望世界对西藏的处境给予关注。\n\n古德拉特表示，中国为了阻止外界目睹并记录西藏宗教信仰遭限制、人权遭侵犯的情况，因此严格限制外国人士进入藏地，这使得美国外交官员、媒体记者、人权活动工作者，甚至游客都很难前往西藏。在极个别获得入藏许可的案例中，入藏人士的一举一动都被严格监视、控制。但是，无数中国代表团、中共官员，前往西方各国自由地宣扬其意识形态时，却不会受到阻碍。而且，那些直接制定或参与制定限制外国人士入藏政策的中国官员，也一直被允许自由访问各国。古德拉特强调，现在国会是时候在外国人士入藏权限问题上采取立场了。\n\n议员普拉米亚•杰亚帕尔（Pramila Jayapal）指出，如果中国官员、记者与其它公民可以自由地访问美国，那么美国公民也该能够享有同样的自由才算公平。\n\n议员杰罗德•纳德勒(Jerrold Nadler)指出，这项法案之所以非常重要，是应为这能够帮助曝光西藏所在发生的人权侵犯状况。他强调，中国限制外国人入藏，将藏人与外界隔绝，同时也阻止国际社会目睹中国对西藏人权的持续侵犯。\n\n议员史蒂夫•夏伯特（Steve Chabot）也提出，中国一直在试图破坏国际社会的秩序。中国不断派遣国家代表团去西方国家，并且在各国首都建立北京当局控制的媒体分支，包括华盛顿。而议员洛福格林（Zoe Lofgren）则指出，入藏互惠法案将能够确保中美关系变得公平、互惠。\n\n国际声援西藏运动主席马提奥•梅卡奇在一份声明中指出，众院司法委员会通过这一法案，是重要的一步。这证明美国国会两党对藏人的支持态度。这也向中国当局传递了强烈的讯息，警告对方限制访藏权限的行为不会被容忍，而且入藏权限事关美国的战略利益。"
		},
		{
			"post_id": 65,
			"title": "美国从多方面向中共施压",
			"date_published": 1532916557.207,
			"body": "美国国会通过了关于西藏的重要法案《入藏法案》，向中共发出警告。《西藏关系法》 : 美国要求中国放宽限制，准许更多美国人进入西藏，否则会用同等方法限制中国人进入美国。该法案确保美国人可以自由出入西藏，否则美国将禁止中共相关官员进入美国。议员称：中国人可以自由出入美国任何一个地方，美国人也应该享受同样的待遇。这才叫公平。"
		},
		{
			"post_id": 64,
			"title": "美众议院委员会通过《入藏法案》  希望藉此改善藏人处境",
			"date_published": 1532777085.496,
			"body": "美国众议院周四（26日）以大比数通过《国防授权法案》，协助强化台湾的军事力量及扩大双方高层交流。法案待参议院表决通过后，将送交美国总统特朗普签署正式生效。另外，众议院司法委员会亦一致通过《入藏互惠法案》，要求中国放宽美国人进入西藏，否则美国根据法律进行同样的限制，但有关法案仍有待两院审核通过。有关注藏人的组织表示，冀法案能对中国构成压力，从而改善目前境内藏人的处境。亦有学者指出，法案经历四年才正式进入国会程序，估计与中美贸易战有关。\n\n![1.jpg (24x24)](data/img/post_64_1.jpg)\n\n《入藏互惠法案》于2014年，由美国国会民主党议员吉姆‧麦克高文（Jim McGovern）以及共和党议员兰迪‧霍尔格伦（Randy Hultgren）向众议院提交，要求美国官员、媒体记者及民众，能享有进入西藏的权利与自由。同时，负责歧视美国人进入西藏的中国官员将被禁止进入美国。\n\n---\n\n然而经过近四年的时间，众议院司法委员会周三（25日）一致通过有关法案，接下来将在众议院表决。该委员会委员纳德勒（Jerrold Nadler）指出，这项法案之所以非常重要，是因为这能够帮助曝光西藏发生的侵犯人权状况。\n\n总部设在美国首都华盛顿的“国际声援西藏运动”发表声明，表示有关法案获得众议院司法委员会通过是重要的一步，能向中国大陆当局传达一个强烈的讯息，就是限制访藏权限的行为不会被容忍，而且入藏权限事关美国的战略利益。\n\n藏人行政中央驻台代表达瓦才仁欢迎，有关法案获得众议院司法委员会通过。他指出，特朗普当选美国总统后，在外交或经贸等各个领域的立场上都要求“对等关系”，《入藏互惠法案》也是属于其立场表态之一。若将来法案最终成为美国的法律，美国便有法律依据进行限制，这种限制对中国来说就是一种压力，从而让大陆当局在放宽外国人入藏外，亦能有助改善藏人被侵犯人权的情况。\n\n达瓦才仁说：这不是中国要不要承认的问题，变成是美国中国打交道的原则。如果有这样一个清楚的认识的话，我们相信中国政府在针对西藏，或是维吾尔族等任何侵犯人权行为时，不得不实际考虑美国或是国际社会的反应。\n\n关注西藏问题的台湾中华大学行政管理学系副教授曾建元指出，《入藏互惠法案》即使提出约四年时间才获得众议院司法委员会通过，不过与《台湾旅行法》相比，其进度快了很多。他指出，美国的法案一般都是由国会议员提出，然后必须经过繁复的程序，最终能成为真正法例的法案并不多。若不是有外在环境的刺激下，没有迫切性的法案也许要经历漫长的时间才能进入两院，并进行表决。\n\n曾建元教授认为，有关法案最近正式进入众议院审议阶段，估计与中美贸易战有关。\n\n曾建元说：西藏议题随著中美关系的变化，我想会越来越受到美国人民，从过去的同情的层次，把它愿意再进一步跨出来，转化成为一种政治上的行动，而且会有一个法律上的基础。明确地表达了美国在这个问题上的立场，这个是重要突破。\n\n众议院司法委员会的委员在会议上均表示，自解放军于1950年进入西藏后，一直严格限制藏人的人权自由，包括宗教信仰、行动自由、维护文化语言的自由。与此同时，大陆限制外国人进入西藏，亦将藏人与外界隔绝并肆侵犯藏人的人权，导致近年来有超过150名的藏人以自焚的方式进行抗议，冀藉著向国际社会展示西藏的处境，从而寻求关注。\n\n司法委员会主席鲍勃‧古德拉特（Bob Goodlatte）指出，大陆当局为了阻止西藏的情况曝光，一直限制外国人士进入。即使有极个别曾经在美国国会工作的人员获得进入西藏，但是其一举一动都被严格监视、控制。相反，中国的官员却能允许自由访问各国。古德拉特强调，现在国会是时候在此问题上表态。议员洛福格林（Zoe Lofgren）表示，有关法案能确保中美关系变得公平、互惠。\n\n来源：自由亚洲\n作者：文宇晴"
		},
		{
			"post_id": 63,
			"title": "ICT：中国应立即停止剥夺西藏学生宗教自由",
			"date_published": 1532537022.566,
			"body": "国际声援西藏运动指出，中国意图以政治宣传来取代寺院教育。"
		},
		{
			"post_id": 62,
			"title": "UN人权高专：西藏与新疆人权状况正迅速恶化",
			"date_published": 1529412214.658,
			"body": "【西藏之声2018年6月18日报道】联合国人权高专扎伊德今天于人权理事会第38届会议上致词，他指出中国持续拒绝向高专办人员提供自由访问西藏与新疆的权利，而两地的人权状况正在迅速恶化。\n\n![8.jpg (24x24)](data/img/post_62_8.jpg)\n\n联合国人权理事会于今天（6月18日）召开第三十八届常会，人权高专扎伊德-拉阿德-侯赛因（又：胡笙亲王／Zeid Ra’ad Al Hussein）致开幕词，同时提出高专办对全球人权状况的担忧。\n\n其中扎伊德提到中国，表示尽管一直努力为对话制造条件，但是高专办工作人员却一直没有获得不受约束地访问权利，包括“西藏自治区”与“新疆自治区”，报告指两地的人权状况正在迅速恶化。\n\n不仅如此，虽然在过去五年中有两名任务执行者访问了中国，但是那期间被中国扣下的访问申请多达15项。\n\n中国持续阻止公民社会独立成员与人权机制接触，包括条约机构的审查、人权普遍定期审议，扎伊德对此表示失望。他表示：“我鼓励当局能够为所有国际人权机制提供方便，同时本着开放、双赢的精神与他们合作，以提升对中国治下民众人权与自由的尊重。”"
		},
		{
			"post_id": 61,
			"title": "达赖喇嘛会见立陶宛国会议员首都市长及前总统",
			"date_published": 1529195688.042,
			"body": "【西藏之声2018年6月15日报道】昨天达赖喇嘛尊者先后同立陶宛国会支持西藏小组的议员、首都维尔纽斯市市长，以及该国首任总统等进行会面。结束立陶宛行程后，尊者已经于当地时间15日上午抵达拉脱维亚里加，受到印度大使馆与拉脱维亚拯救西藏组织等人员的迎接。\n\n![8.jpg (24x24)](data/img/post_61_8.jpg)\n尊者与立陶宛首位总统 图片翻拍自OHHDL网站\n\n---\n\n西藏人民至高无上的领袖达赖喇嘛尊者今天（6月15日）上午抵达拉脱维亚。据藏人行政中央驻俄罗斯代表戴洛仁波切介绍，尊者抵达该国首都里加机场时，受到拉脱维亚拯救西藏组织、俄罗斯拯救西藏基金会、以及印度驻里加大使馆等各方代表的迎接。\n\n戴洛仁波切告诉本台，尊者一行从机场驱车抵达下榻的酒店后，与200多名等候在那里的支持者及媒体简单交流。除此之外今天并无其他活动安排。\n\n明天16日至18日三天，尊者将向来自拉脱维亚及周边各国的信众传法，教授宗喀巴大师的《菩提道次第略论》及《缘起赞》，并将传授白文殊菩萨随许、观音灌顶。此次法会由拉脱维亚“拯救西藏”组织、莫斯科“拯救西藏基金会”，以及莫斯科“西藏文化与信息中心”三方共同举办。\n\n据戴洛仁波切介绍，因俄罗斯信众无法迎请尊者至当地弘法，因此为满足该国及周边国家无数信众的愿望，尊者便决定在拉脱维亚弘法，利益周边各方信众。\n\n**会见立陶宛国会议员、首都市长、前总统**\n\n此外，昨天（6月14日），达赖喇嘛尊者会见了立陶宛国会议员及维尔纽斯市市长。\n\n据达赖喇嘛官网发布的消息，尊者在会见立陶宛国会支持西藏小组的议员时表示，“西藏境内正在发生严重的人权侵犯问题，我们一直在经历困顿。我的主要关切，是保护西藏的独特文化遗产，这源自印度古代智慧中针对内心情绪运作的剖析，由此可达成内心平和、对抗破坏性情绪。这与今天的社会非常有关联。”\n\n尊者向援藏议员们表达感谢，“藏人的精神一直保持坚强，而你们的关切会给他们更大的勇气，也给中国强硬派传递了清晰的讯息——西藏问题必须透过务实方法来解决。因此，我想要代表六百万藏人感谢你们。”\n\n**西藏的文化地图大过政治地图**\n\n有议员提出西藏的地图问题，尊者阐释道：“政治边界或许不能反映确切的文化边界。在历史上，中国帝国以政治权力闻名、蒙古帝国则是以强大军事力量而著称，西藏帝国的特殊之处，就在于其精神力量。曾有一段时期，蒙古依靠军事力量统治西藏与中国。西藏则在关注宗教信仰，影响力远传至今天的吉尔吉斯斯坦、阿富汗、伊朗，中国、蒙古以及喜玛拉雅区域。所以，一个反映藏传佛教文化延伸范围的地图，必定远远大过西藏的政治地图。”\n\n接下来，尊者会见了立陶宛前总统兰斯柏吉斯（Vytautas Landsbergis），他是立陶宛 1991年获得独立后的首位总统。尊者回忆当年受兰斯柏吉斯邀请访问该国时的情景，表示自己当时非常高兴，深受立陶宛人民的喜悦、激情与决心所感动。\n\n而后，尊者在西门子体育馆向2500多人发表演说，威尔纽斯市市长希马休斯（Remigijus Šimašius）也参加活动，以东道主身份向观众们介绍了尊者。\n\n**白色哈达的意义**\n\n尊者向市长赠送哈达时，解释了白色哈达的意义。“白色代表善良、真实、诚恳。哈达的柔顺质料代表非暴力品行——竭力帮助他人并且避免伤害他人。在哈达底部，用藏文写着祈愿接收者快乐，不分昼夜。这种礼物习俗也是最初出现在印度，而后在西藏采用。又因为哈达也会用源自中国的丝绸制作，所以它可说是反映了印度、西藏与中国三方的和谐。”\n\n![9.jpg (24x24)](data/img/post_61_9.jpg)\n\n在接受了于立陶宛的各项活动行程后，尊者今天（15日）前往另一个波罗的海国家——拉脱维亚访问。"
		},
		{
			"post_id": 60,
			"title": "法国国会参议员要求外交部关注西藏人权状况",
			"date_published": 1529167640.457,
			"body": "【西藏之声2018年6月16日报道】日前，法国国会参议员米歇尔•莱森以书面形式向该国外交部提出质询，要求法政府关注西藏语言权利倡导者扎西文色遭非法宣判一案，以及藏人基本人权被剥夺的状况。\n\n![8.jpg (24x24)](data/img/post_60_8.jpg)\n\n2016年尊者访法时与Michel Raison会晤 图片翻拍自OHHDL网站\n\n法国国会支持西藏小组主席米歇尔•莱森（Michel Raison）于6月14日，以书面形式质询该国外交与欧洲事务部长，提出西藏语言权利倡导者扎西文色上月在“煽动分裂国家”罪名下，被中共判刑5年的情况。\n\n米歇尔•莱森指出，扎西文色仅仅是因为接受媒体采访，对藏语母语教学状况发表评论，便遭指控“煽动分裂国家”，并被判处5年徒刑。他指出，这一判决违反了基本人权中的行使文化、教育和观点表达自由。米歇尔•莱森作为法国国会支持西藏小组主席，谴责对基本自由的罪名化，以及对藏人身份的攻击。\n\n---\n\n今年4月25日，法国总统马克龙在访问美国时曾指出，如果法国能够在达赖喇嘛和西藏人民与中国之间对解决西藏局势有用的话，他将尽力从中斡旋。\n\n米歇尔•莱森向外交部长提问，希望了解法国是否有意效仿联合国人权高专，对扎西文色案提出关切。他并希望知道法国是会兑现承诺，去推动中国与西藏间的对话。"
		},
		{
			"post_id": 59,
			"title": "达赖喇嘛于立陶宛呼吁让“对话”成为世界趋势",
			"date_published": 1529128899.593,
			"body": "【西藏之声2018年6月13日报道】达赖喇嘛尊者在立陶宛维尔纽斯大学演讲，呼吁各方一道努力推介透过对话解决分歧的精神，以创建更加美好、和平的未来。\n\n达赖喇嘛尊者昨天（6月12日）抵达立陶宛首都维尔纽斯，于机场受到印度驻立陶宛大使馆官员、当地西藏之家主任等各方的迎接。在抵达下榻的酒店后，又受到持西藏国旗的支持者欢迎。\n\n![8.jpg (24x24)](data/img/post_59_8.jpg)\n\n今天（6月13日），尊者在维尔纽斯大学，向大众发表演说“教育中的人类价值”，阐释人类一体性慈悲理念，并接受观众提问。维尔纽斯大学透过网络对演讲全程进行了直播。\n\n提到对金钱的看法，尊者直言经济条件与人们的物质生活有着直接关系，的确具有其重要性。比如，当年佛陀托钵化缘，若没有具备供施能力的村落，便无法生存。但是尊者也申明，凡事要适可而止、懂得知足。即便是亿万富翁也并非就一定快乐。金钱有助于身体安康，内心安康更需要注重。\n\n达赖喇嘛尊者特别呼吁大家要推动透过对话来解决争端的精神，让21世纪成为对话的世纪。透过学校来教育学生认识对话的价值，让对话成为生活的一部分。尊者表示，如果各方从当下开始便着手付出努力，那么三十年后，世界或许就能够发生改变。\n\n明天14日，尊者将在立陶宛西藏之家的邀请下，以“快乐的艺术”为主题，发表公共演说。"
		},
		{
			"post_id": 58,
			"title": "西藏司政与议员在加国会作证：我们才代表藏人",
			"date_published": 1529046406.063,
			"body": "【西藏之声2018年6月13日报道】日前中共安排其“人大西藏代表团”访问加拿大国会，歪曲西藏历史并粉饰中共治藏政策。近日，藏人行政中央司政与流亡藏人议会代表团抵达加拿大，在国会众院作证介绍真实的西藏问题。司政强调，“我们才代表藏人”。\n\n![8.jpg (24x24)](data/img/post_58_8.jpg)\n\n今年5月，由拉萨市中共市委书记白玛旺堆等四名中共官员组成的“人大西藏代表团”，按照北京安排指示参访加拿大国会，重复中共歪曲宣传如“西藏自古属于中国”、“共产党解放封建农奴制旧西藏”、“西藏的宗教信仰、人权自由都获得保障”等等。\n\n---\n\n昨天（6月12日），藏人行政中央司政洛桑森格带领驻北美代表，以及西藏流亡议会的多名议员，赴加拿大国会众院就西藏问题作证。\n\n根据加拿大国会众院网站发布的听证会视频，司政洛桑森格发言时，特别提到不久之前才访问国会的中共“西藏代表团”。他指出，实际上自己与在座的流亡议会议员，都是由流亡藏人透过真正的民主方式选出的代表，“我们才真正代表藏人。”\n\n司政指出，以殖民者身份安排被殖民者去世界各地歪曲、掩盖殖民真相，是中国当局的一贯伎俩。西藏自由与否，透过各种国际独立机构的人权报告便可知晓。中国当局面对质疑总是回应说——“请大家亲自到西藏看一看”，然而实际上，中共一直没有改变对西藏的访问限制政策。\n\n在听证会上，司政从地缘、环境、政治角度提出西藏对国际的重要性，呼吁加拿大继续予以关注。他并阐释了中间道路所追求的名副其实自治权，与外国政府所承认的“一个中国”政策并无冲突，所以各方应该公开表态支持。"
		},
		{
			"post_id": 57,
			"title": "照片中的那位小姐名叫普赤噶布切，她是加拿大籍藏人",
			"date_published": 1528941344.407,
			"body": "![9.jpg (24x24)](data/img/post_57_9.jpg)\n\n2018年6月7日，来自新民主党候选人普赤噶布切在加拿大安大略省高公园地区选举中获胜，成为有史以来第一位被当选为加拿大国会的藏籍议员。身为藏人，这是我们都感到自豪的时刻。在此祝贺她！"
		},
		{
			"post_id": 56,
			"title": "首位藏人委员当选【美国国际宗教自由委员会】主席",
			"date_published": 1528897594.021,
			"body": "2016年被任命为【美国国际宗教自由委员会】首位藏人委员的丹增多吉，昨天全票当选该委员会首位藏人主席。\n\n![9.jpg (24x24)](data/img/post_56_9.jpg)"
		},
		{
			"post_id": 55,
			"title": "美国务卿：将公开呼吁中国无条件与达赖喇嘛重启对话",
			"date_published": 1528711622.686,
			"body": "【西藏之声2018年6月8日报道】美国国务卿在回应国会参院的书面质询时强调，他将建议美国政府以最高层管道，公开敦促中国与达赖喇嘛代表间展开无条件对话，以解决西藏问题。\n\n![8.jpg (24x24)](data/img/post_55_8.jpg)\n\n美国国务院刚刚向国会众院递交“西藏问题谈判报告”，介绍去年在推动藏中对话方面美方所作出的努力。\n\n与此同时，今年五月上任的国务卿蓬佩奥（Mike Pompeo），近日在回应国会参院外委会书面提问时，表示他会公开要求中国与达赖喇嘛的代表间，就解决西藏问题而开展无条件的对话。\n\n蓬佩奥写道：“我将建议美国于政府最高层公开表态，呼吁中国当局与达赖喇嘛或其代表，在无任何前提条件的情况下，展开直接对话，以缓解局势、解决分歧。”\n\n他并承诺将落实《西藏政策法案》，尤其是敦促中国停止对藏人宗教、语言、文化传统权利的限制。\n\n蓬佩奥强调在同中国官员接触时，将致力敦促对方尊重藏人的人权，包括宗教与信仰自由，同时为藏人政治犯的获释，以及美国记者、外交官的入藏权利而做出努力。"
		},
		{
			"post_id": 54,
			"title": "流亡藏人足球队参加CONIFA世界杯惹恼中国",
			"date_published": 1528423158.46,
			"body": "![9.jpg (24x24)](data/img/post_54_9.jpg)"
		},
		{
			"post_id": 53,
			"title": "藏港台民運會議商討形成對抗中共統一陣線",
			"date_published": 1528368179.723,
			"body": "海外藏人活動人士、維吾爾活動家和來自香港、台灣的活動者6月6日在美國首都組織舉行第二屆西藏、香港、台灣圓桌會議，討論各方如何統一行動，對抗中共在多地區、多方面對民主自由運動的壓迫。\n\n![9.jpg (24x24)](data/img/post_53_9.jpg)"
		},
		{
			"post_id": 52,
			"title": "流亡藏人社区召开第五届“西藏独立理念者大会”",
			"date_published": 1527405978.027,
			"body": "【西藏之声2018年5月23日报道】位于印度与欧美流亡藏人社区的150多名复国理念者，今天聚集在达兰萨拉召开第五届“西藏独立理念者大会”（International Rangzen Conference）。\n\n![8.jpg (24x24)](data/img/post_52_8.jpg)\n\n---\n\n今天（5月23日）上午，第五届“西藏独立理念者大会”于印北达兰萨拉召开。与会者包括来自世界各地的藏人复国理念者约150人，以及邀请来的嘉宾——长期支持西藏运动的印度知名摄影记者韦杰•格兰迪（Vijay Kranti）、印藏友好协会会长阿杰•辛哈•曼果提亚（Ajay Sigh Mankotia）等。\n\n会议筹备人员之一是独立活动人士丹增尊珠，他致词说道，选择5月23日为会议开幕时间，是因这一天也是藏人无法认可的《17条协议》的签署日，借这一会议来表达抗议。\n\n丹增尊珠并提出，境内外藏人尊重达赖喇嘛尊者、认可藏人行政中央，虽政治立场不同，但那不代表对立。两种理念追随者均是在争取全体藏人的福祉利益。他指出，60多年来的压迫，并未让藏人失去信心勇气，“我们也希望藏人社会不要丧失对独立的追求，这是此次会议的宗旨之一。”\n\n知名独立理念者拉桑次仁致词时强调，藏人必须追求独立。他认为，藏人的独立抗争不应该成为生意——觉得能盈利才放手去做，不然就放弃。独立是正义抗争，输赢固然重要，但更重要的是抗争的目标——正义，因此藏人必须坚持这一抗争。\n\n他并指出，若争取自治权利，就如同中国政府所说的一样成为内政；而追求独立，则能够让西藏问题成为国际事务，赢得国际关注。\n\n另一位知名复国理念者嘉央诺布在开幕式上发言表示，面对中国的强大军事与经济力量以及它的残酷性，似乎让人气馁不知所措，但藏人仍有机会寻找应对策略。他并提议成立一个集合所有独立理念者的组织，以方便今后规划开展独立活动。\n\n印藏友好协会会长阿杰•辛哈•曼果提亚（Ajay Sigh Mankotia）在今天的活动上致词指出，藏人的运动长远且强壮，必将会成功。他建议与会者注重规划与行动、不要让运动被情绪支配，不要让自负阻碍继续发展，并能够在运动中坚守道德伦理。“请记住，印度会一直肩并肩与大家同在，提供支持。请永远不要放弃对自由西藏的抗争。”\n\n第五届“西藏独立理念者大会”活动经费来源为民众捐款，大部分与会者都是自掏腰包前来。第五届会议的主要宗旨为，让更多藏人青年了解西藏独立运动。前四次会议先后于达兰萨拉、新德里、纽约及巴黎举行。"
		},
		{
			"post_id": 51,
			"title": "藏台活动人士探讨亚洲自由民主与中国威胁",
			"date_published": 1526311331.962,
			"body": "【西藏之声2018年5月14日报道】西藏青年会近日邀请台湾、南蒙、越南以及尼泊尔等12国的活动人士聚集新德里，围绕着亚洲的民主、自由、和平，以及中共的威胁而展开国际性研讨会。\n\n![8.jpg (0x0)](data/img/post_51_8.jpg)\n\n本月11日、12日，流亡社区非官方组织“西藏青年会”于新德里印度国际中心（IIC）举办国际研讨会，主题为亚洲自由民主与和平。\n\n---\n\n主办方邀请了来自台湾、南蒙古、香港、越南、缅甸、泰国、南韩、菲律宾、日本、尼泊尔、印度，以及西藏的活动人士、律师、记者及学者等与会。台湾方面的与会者为西藏台湾人权连线的札西慈仁与杨宗澧。\n\n西藏青年会会长丹增晋美接受本台驻地记者采访时指出，此次会议是按照2014年青年会理事会第45次会议所制定的决议而举行的。数年前各方就认识到国际性交流的重要性，以及亚洲各国所面对的共同问题——中共。\n\n在会议开幕式上，曾先后担任印度驻瑞典、哈萨克斯坦以及拉脱维亚等国大使的资深印度外交家阿肖克•萨杰哈尔（Ashok Sajjanhar），致词介绍了国际政局变动、中国经济力提升与国际自由民主和平受威胁情况。他指出，在关注亚洲的自由、民主与和平问题时，如果不将西藏所遭受的压迫与不公对待纳入考量，就不算完整。\n\n会议结束后，全体与会者发布联合声明指出，经过两天的讨论，各方代表达成共识——亚洲国家与人民必须在倡导与支持人权自由方面，扮演更加积极的角色。各方并呼吁中国政府，立即采取行动来保障西藏、台湾与香港民众的自由、人权与自决权，并停止霸凌周边国家。"
		},
		{
			"post_id": 50,
			"title": "英国国会跨党派支持西藏小组讨论入藏限制",
			"date_published": 1526181636.945,
			"body": "【西藏之声2018年5月11日报道】英国国会跨党派支持西藏小组近日举办圆桌会议，讨论如何督促英国政府与中国建立以互惠、平等为基准的双边关系，使得英国的公民、外交官与记者，能够像中国人在英国所享受的待遇一般，自由进入西藏。\n\n![9.jpg (0x0)](data/img/post_50_9.jpg)\n\n5月9日，英国国会跨党派支持西藏小组举办会议，讨论英国公民入藏受阻议题。国际声援西藏运动主席马提奥•梅卡奇（Matteo Mecacci）与英国“西藏社区”成员格洛瑞亚（Gloria Montgomery）等，同包括克里斯•罗（Chris Law）、蒂姆•劳顿(Tim Loughton)在内的十几名英国议员、英国外交和联邦事务部代表，一同出席了会议。\n\n---\n\n根据西藏社区发来的新闻稿，此次圆桌会讨论了长期存在的入藏受阻问题。中共官方宣传与事实恰恰相反，西藏很大程度上仍对外国人士处于封锁状态。今年2月《纽时》两名记者访问藏东时被拘留、驱逐，也只是无数此类事件中的一个例子而已。中国一直在限制外国人士进入藏地，严控相关讯息被传至外界。\n\n英国西藏社区成员格洛瑞亚指出，习近平所谓“西藏向国际开放”实为空话。中国当局持续拒绝外国人士进入西藏，这清楚证明当局试图隐藏发生在西藏的真相，并且会不择手段地阻止国际团体监督其治下西藏的人权纪录。\n\n此次圆桌会也关注了中共不愿与包括英国在内的国家，建立互惠关系的态度。\n\n欧洲领袖与议员们，包括法国总统马克龙与德国首相默克尔，都曾指出互惠是与中国建立双边关系的关键，但是在落实方面往往存在问题。\n\n马提奥•梅卡奇指出，互惠原则是否能被落实极为关键，不仅是在贸易与经济领域，也要落实在行动自由、信息及民众交流自由领域。\n\n梅卡奇还向与会各方介绍了美国国会在推动的入藏互惠法案内容。各方都认为，中国公民、外交人员、记者与非政府机构能够自由进入英国，但是英国公民却无法在入藏事项上享有同样的对待。英国政府应该施压中国当局，以同中国建立基于互惠及公平的双边关系。"
		},
		{
			"post_id": 49,
			"title": "欧洲议员：支持藏人就是在支持自由正义真理",
			"date_published": 1526170122.386,
			"body": "【西藏之声2018年5月10日报道】正于印北达兰萨拉访问的欧洲议会代表团今天召开记者会，向藏印媒体介绍觐见达赖喇嘛尊者的感受，以及对西藏运动未来走向的看法。议员们重申，欧洲议会将继续支持藏人的自由抗争。\n\n欧洲议会支持西藏小组主席托马斯•曼（Thomas Mann）、议员萨巴.绍格尔（Csaba Sogor）与议员拉蒙•特雷莫萨（Ramon Tremosa）近日抵达印北达兰萨拉流亡藏人社区，与官方及非官方人士见面，并受到司政洛桑森格的欢迎。\n\n![8.jpg (0x0)](data/img/post_49_8.jpg)\n\n今天上午，代表团三位成员与行政中央驻布鲁塞尔代表扎西平措，一同召开新闻发布会，同藏印媒体记者交流。\n\n---\n\n托马斯•曼首先透露，昨天（5月9日）“欧盟日”，他们获得与达赖喇嘛尊者见面的机会。尊者非常清楚地指出欧盟存在的重要意义，表示欧洲国家的确有着不同意见，比如针对难民问题的分歧，但最重要的是，大家联盟共建正义、人权、自由的体系。\n\n托马斯•曼再次介绍了欧洲议会长期作出的努力，包括支持达赖喇嘛尊者提出的中间道路、反对中国开展的所谓“再教育运动”，并指欧洲一贯抗议中国的压迫手段，同时支持藏人学习、使用母语的权利、持守文化及生存的权利。\n\n议员萨巴.绍格尔在发言时指出，非常荣幸获得尊者的接见。他赞扬尊者为藏人自由正义抗争所付出的贡献。“我们也希望其他欧洲成员国的政客、大众，能够有机会聆听尊者的观点。”\n\n来自加泰罗尼亚的拉蒙•特雷莫萨提到，欧洲经历了极为暴力的过去，最终决定结盟不再重蹈覆辙。“我们参观展览馆时了解到无数藏人遭中共迫害、无数藏人冒着生命危险流亡印度的情况。我意识到，纵使自己生活在较为自由的欧洲，但是如果在世界上某些地区自由仍然被禁止，人权仍然不被尊重，就如西藏所遭遇的一切；那么，其实我也并未完全自由。因此，我们支持藏人就是在支持正义、自由、人权、信任与真理。”\n\n特雷莫萨并指出，人们必须支持自由的抗争，因为即便在今天，自由也并非从天而降，必须透过不断努力才能争取、守护。议员们承诺，欧洲议会将继续声援藏人的自由抗争。"
		},
		{
			"post_id": 48,
			"title": "西藏人权与民主促进中心发布2017年度人权报告",
			"date_published": 1525763094.946,
			"body": "【西藏之声2018年5月7日报道】流亡藏人机构“西藏人权与民主促进中心”发布报告，记录了中共当局过去一年对藏人言论、宗教自由的打压，以及中共持续实施的任意拘留和酷刑手段。报告呼吁中共当局遵守国际法律与自身宪法，停止打压藏人的各项基本人权。\n\n![8.jpg (0x0)](data/img/post_48_8.jpg)\n\n设立于达兰萨拉的“西藏人权与民主促进中心”（TCHRD）发布“2017年西藏人权状况年度报告”。\n\n---\n\n在今天（5月7日）举行的报告发布会上，该中心主任次仁措姆与英文研究员丹增达瓦，先后概述了报告主要内容。次仁措姆强调，过去一年境内人权状况最为严重的问题，就如报告封面上的摄像头照片所代表的一般，是当局借助各种先进器材来监视、限制藏人种种自由的行为。\n\n报告第一部分“见解和言论自由权”中，主要记录 2017年中国对西藏开展的监视措施，包括数千党政干部、官员在扶贫等幌子下进行的监督与政治教育活动。当局并发展支持语音识别系统和面部识别摄像头等先进技术，以进一步压制民间异议。\n\n在“任意拘留和酷刑”部分中，报告聚焦中共对藏人实施的强迫失踪、任意拘留，以及拘留期间的刑讯逼供等措施。\n\n报告第三个部分关注中共对藏人宗教信仰自由的迫害，指出当局透过修订《宗教事务条例》，限制涉及宗教的网络交流等，并继续试图抢夺西藏佛教转世系统的主导控制权，同时进一步实施由无神论中共来管理佛教寺院的政策。\n\n第四个部分记录中共在西藏实施的所谓“发展”背后的真相，包括强迫农牧民搬迁等措施。\n\n西藏人权与民主促进中心在报告中向中国当局提出若干建议，包括：“停止实施大规模监视和其他控制措施、控制侵犯人权行为”；“在促进和保护隐私权方面实施国际公认的最佳做法、标准和保障措施”；“公布被关押人的资料、并释放被强迫失踪的人、释放所有为自身权利而抗争的良心犯”；“寺院管理委员会，并允许寺院成员独立管理领导佛学院等机构。”\n\n报告的建议部分还呼吁中共停止诽谤达赖喇嘛尊者，停止迫害持有尊者照片的人士，同时将西藏牧民纳入一切有关草地使用计划的决策过程中。"
		},
		{
			"post_id": 47,
			"title": "获准以西藏之名参加CONIFA世界杯　藏人球队等待签证",
			"date_published": 1525696244.738,
			"body": "【西藏之声2018年5月5日报道】流亡藏人球队获准以西藏之名参加今年的“独立足球联盟世界杯”（CONIFA）足球赛。因身份敏感，在获取赴英签证方面，英国议员、藏人行政中央官方都加入协助行列，而本届CONIFA世界杯的资助人更亲自来到达兰萨拉社区，与流亡藏人互动，为其球队带去鼓励。\n\n![8.jpg (0x0)](data/img/post_47_8.jpg)\nCONIFA视频截图\n\n“独立足球联盟”（CONIFA）于2013年成立于瑞典，其成员多为未受普遍承认、无法加入国际足联（FIFA）的国家、属地、少数群体和无国家民族。成员国包括欧、美、亚以及非洲的40多个国家与地区。\n\n---\n\n2018年“独立足球联盟世界杯”将于5月31日至6月9日间举行。总部位于印北达兰萨拉的“流亡藏人体育协会”创建的藏人足球队，获准以西藏名义参赛。\n\n本月底比赛便将于英国举行，然而流亡藏人球队的签证仍无音讯。流亡藏人体育协会秘书巴桑多杰接受本台采访时表示，预想到签证申请程序必然会困难重重，因此获得藏人行政中央司政、驻伦敦代表处、驻新德里代表处，甚至两名英国议员在内各方的协助，但3月就已递交申请，至今仍无下文。他认为问题出在流亡藏人的敏感身份之上。\n\n藏人球队包括来自印度的15名队员，以及加拿大、美国、欧洲各两名队员，另外在英国本地也有一名队员将同大家汇合。巴桑多杰表示希望能够提前抵达英国，以便加深队员彼此间的熟悉配合度，并且与一些球队举行表演赛。“签证拖得越久，对我们就带来更大的困难。预先制定的各种计划，都受到影响。所以我们大家都在祈愿尽早获得签证。”\n\n若最终无法获得签证，流亡藏人体育协会也备有应对措施。巴桑多杰透露，届时将由欧美的藏人球员参赛，但目前阶段仍将希望寄托于原定的计划之上。\n\n今年CONIFA世界杯的资助人爱尔兰博彩业主派迪•鲍尔（Paddy Power）于3月藏历新年期间，亲自来到达兰萨拉，与流亡藏人互动，近日发布了相关纪录片，其中藏人行政中央司政洛桑森格也评论了藏人与足球的关联。\n\n司政洛桑森格告诉派迪•鲍尔：“正如西藏足球队无法参加世界杯一般，我也无法去西藏；我们的球队可以去伦敦参加CONNIFA世界杯，而我也可以去世界任何地方，除了我自己的国家西藏以外。”\n\n司政还表示：“我们的球队也有着参加世界杯、与其他国家球队竞争的梦想。这不仅仅是体育，这关乎我们的激情、我们的抗争事业，因此我们的球员会更加情绪化、我们的支持者会更加狂热，当然不是指酗酒、丢啤酒瓶的那种狂热，这代表了我们的抗争。”\n\n“虽然藏人是佛教徒，乐于施舍分享，但是在CONIFA球赛中，我们不愿分享，而是希望取胜。”\n\n流亡藏人体育协会于1999年成立，2003年起在流亡社区举办“国母杯”足球赛，并且分别成立有男子与女子球队，经常参加印度国内的球赛。"
		},
		{
			"post_id": 46,
			"title": "达赖喇嘛特使介绍与北京谈判的细节",
			"date_published": 1525625395.455,
			"body": "就在达赖喇嘛访问法国之际，我们请达赖喇嘛驻欧洲特使格桑坚赞（Kelsang Gyaltsen）先生回顾总结了十多年来北京与达赖喇嘛方面举行的多次谈判的具体经过。格桑坚赞作为达赖喇嘛的谈判代表曾经参加了所有的谈判会议。由于这些谈判都是闭门会议，外界只能间接地获得一些零散的传闻，对谈判进展的过程，北京谈判代表的立场以及态度知之甚少。格桑坚赞今年六月在巴黎藏传佛教节日期间接受了本台的采访，他向本台详细介绍了双方谈判的前后经过。\n\n![8.jpg (0x0)](data/img/post_46_8.jpg)\n\n---\n\n法广：首先请您介绍一下同北京举行了多少谈判，谈判的时间以及地点。\n\n格桑坚赞：2002年，我们同中国政府取得直接的联系，从此以后，我和我的同事曾经去过九次中国，期间有一次是在中国驻瑞士使馆，所以总共有过十次会议，九次谈判，一次非正式会议，谈判从2002年开始到2010年结束，2010年是最后一次。\n\n法广：谈判使用的是什么语言？藏语的“独立”与“自治”这两个词的含义是否同中文等语言一样明确，不存在任何模棱两可的可能？\n\n格桑坚赞：我们说藏语，我们的翻译翻成中文，然后，中方代表说中文，由他们的藏语翻译翻成藏语。我们藏语中对独立与自治有两个不同的词，分别是十分明确的。我们藏语中确实有这两个词。\n\n法广：能否介绍一些九年来十次谈判的整体状况？\n\n格桑坚赞：谈判大约经历了九年的时间，一开始的时候，中国代表的态度还是比较积极的，他们显示对谈判的兴趣，也认为双方之间应该进行对话。尽管双方的立场以及观点分歧十分重大。然而，双方都认为见面对话是十分重要的。但是，2006年的时候，中方的立场开始显得十分强硬。他们明确地表示不再就自治或者藏民的未来进行谈判，唯一可以讨论的是达赖喇嘛个人的问题。\n\n法广：那他们当时有没有解释是出于什么原因？今天回想起来，您明白是什么原因吗？\n\n格桑坚赞：没有人知道中国代表团是由于什么原因改变立场，为什么变得如此强硬。有分析认为是由于中国政府内部的权力争斗，江泽民当时受到来自党内强大压力，所以不得不显示强硬姿态。也有人认为可能同2006年达赖喇嘛在印度南部施教大会有关，因为这次讲经大会曾经汇聚了上万名来自西藏的藏人，当时讲经的主题是要保护动物，达赖喇嘛强烈呼吁藏人不再穿着动物皮毛服装，尤其是虎皮等动物皮。讲经大会之后不久，在全藏区就有许多人开始焚烧皮革，曾经引发很大的轰动。而皮革服装对藏民来说是十分昂贵的服装，但是，达赖喇嘛一呼吁既然有这么多人响应。有人就认为这可能是北京政府采取强硬立场的原因。但是，真正的原因究竟是什么，没有人知道。之后，2008年就爆发了西藏大规模的游行示威事件，达赖喇嘛当时对西藏的状况十分担心。他要求我们同北京官方联系，要求北京不要采取镇压措施。所以，我们的目的是试图说服北京不要采取强硬措施，所以，2008年6月，北京政府突然告诉我们，说要求我们解释我们所说的高度自治的是什么，要求我们拿出具体的文件。我们对此感到十分欣慰。所以，在之后的会议上，我们就递交了我们的自治备忘录。我们的备忘录是完全按照中国的宪法撰写的。但是，遗憾的是，中方全盘拒绝我们的要求。他们说，我们的所谓自治其实就是半独立，违背了中国的宪法。但是，他们却没有解释我们的备忘录中究竟有哪一条违背了中国的宪法，为什么说是一个半独立的要求。他们说我们不尊重中国共产党的领导，不遵守中国的自治区的运作规章。不尊重中国式的社会主义的模式。所以，2010年，我们在备忘录上增加了一些附加的注解，并且递交给了中国政府，但是，到今天都没有收到中方的回应。所以，如果你们登录我们的网站，你们就可以看到我们递交的备忘录以及注解这两份文件，这两份文件涵盖了我们有关要求西藏全面自治的所有的立场的观点。\n\n法广：既然他们全盘解决你们的提议，那么，中国代表是否提出什么建议呢？\n\n格桑坚赞：他们什么都不提议，当我们问他们为什么全盘解决我们的要求；既然如此当初为什么要我们拿出备忘录时，中方谈判代表，中国统战部负责人朱维群就明确地回答说，这是一场测试，目的是测试你们对中华人民共和国立场的理解，是要看西藏代表同中方立场之间的差距。也就是说，他们根本就没有进行有关自治谈判的意愿。\n\n法广：这九次正式谈判中对那一次的影响最好？\n\n格桑坚赞：在所有的会议中，应该说是2008年的那次是最积极的谈判。那是2008年6月和七月，在北京奥运召开之前。北京代表突然向我们表示，他们愿意听取我们的意见。这是唯一的一次。之前，也有一些积极的表态，但仅仅停留在应该继续对话等等，2006年态度又突然改变。2010年以后，就没有收到中方的任何回应。\n\n法广：那就达赖喇嘛个人的议题呢？他们不是只愿意讨论这个议题吗？达赖喇嘛2011年正式脱离政权之后曾经表示希望能够返回中国朝圣，去佛教圣地五台山等地云游，中方对此是否做出回应？\n\n格桑坚赞：没有，达赖喇嘛长期流亡国外，因为只有在海外他才能自由地为藏人发声。达赖喇嘛将政权转交给西藏民选政府之后，曾经表示希望能够前往五台山访问，但是，中国官方并没有做出任何回答。\n\n法广：从2010年之后是否还有恢复谈判的希望？\n\n格桑坚赞：我们的立场是否明确，在任何时候，任何地方我们都愿意同北京举行谈判，这是我们一贯的立场，今后也将一如既往。\n\n来源：法广"
		},
		{
			"post_id": 45,
			"title": "达赖喇嘛的访客：美国驻印大使与印度板球传奇人物",
			"date_published": 1525606742.284,
			"body": "【西藏之声2018年5月4日报道】每年有无数人前来印北达兰萨拉，希望一睹达赖喇嘛尊者的风采。其中包括不少印度与外国的政客、名人。昨天尊者接见的两名访客分别是美国驻印度大使与印度的板球传奇人物。\n\n昨天（5月3日），美国驻印度大使肯尼斯•賈斯特(Kenneth Juster)于达兰萨拉拜见达赖喇嘛尊者。他在会面结束后接受媒体采访司机时表示：“与尊者的见面非常美好，他是一位非常鼓舞人心的人物，我们进行了很好的交谈，如果他能够访问美国将非常棒。这次见到他，我深受鼓舞启发，其他代表团成员也一样。”\n\n![2.jpg (0x0)](data/img/post_45_2.jpg)\n\n---\n\n肯尼斯•賈斯特大使去年11月上任，这是他首次访问达兰萨拉。他指与尊者讨论了一系列议题，“最重要的话题，是尊者对透过培养个人内心平和来影响世界和平的这一观点。”\n\n被问及美国总统川普与尊者见面的可能性，肯尼斯•賈斯特表示大家惟有拭目以待。\n\n昨天拜见尊者的另一位名人是印度板球传奇人物、前印度国家板球队队长萨钦•邓杜卡（Sachin Tendulkar）。\n\n萨钦•邓杜卡在结束会面之后向媒体表示，能够获得达赖喇嘛尊者的加持令他极度兴奋，“我一直想要来达兰萨拉，获得尊者的加持、向他致意。我们在会面中谈了快乐与和谐的推展途径。”"
		},
		{
			"post_id": 44,
			"title": "美国国会通过决议应由藏人佛教社区自行选择转世活佛",
			"date_published": 1524800361.926,
			"body": "美国国会通过决议说：未来第15世达赖喇嘛指定或继位的企图都是对包括西藏和美国在内世界各地藏传佛教徒宗教自由权利的侵犯，因而无效；应由藏人佛教社区自行选择转世活佛。\n\n![9.jpg (0x0)](data/img/post_44_9.jpg)​​​​​​​"
		},
		{
			"post_id": 43,
			"title": "印度藏人难民保护在故乡受威胁的语言文化",
			"date_published": 1524721516.138,
			"body": "![8.jpg (0x0)](data/img/post_43_8.jpg)\n\n流亡藏人纪念达赖喇嘛逃离家园抵达印度60周年。他们说，他们成功保护了藏人文化和民族认同。藏人领袖警告说，在他们的家乡，中国的统治威胁着藏人文化传统。印度有着世界上最大的藏人难民社区，藏人流亡政府在印度开办了大约70所学校，这些学校处在保护藏人传统文化努力的核心。美国之音记者最近走访了新德里的一家藏人学校。\n\n在新德里的这所学校里，孩子们全部用藏语唱歌和吟诵童谣。他们的教师身穿传统藏袍。\n\n---\n\n桑耶寺TCV日间学校的校长米格玛·次仁说，这帮助100多名孩子了解他们从来也没有见过的家乡。\n\n他说：“他们告诉孩子们跟政治无关的西藏情况，我们有美好的国家、美好的语言、美好的民族认同，我们有美好的宗教。”\n\n这样的学校是由印度境内的藏人流亡政府开办的。孩子们学习藏文并阅读翻译成藏文的故事。小女孩学习传统的藏族乐器。\n\n教师索南曲登说，三年级以前的所有科目都使用藏语。\n\n她说：“在西藏，中国人现在压制藏语，即使是在课堂上也不许说藏语。所以，为了在流亡中保持我们的语言，尤其是在学校里，我们尽量只用藏语交谈。”\n\n有些人担心，维护藏人文化的努力可能会受到挑战，因为年轻一辈的藏人在印度以外寻找机会。其他人说，他们在藏人安置区和学校吸收到的文化在他们的身上扎下了根，即使在海外也不会失去。丹增德江就是一个例子。她是逃到印度的藏人难民的女儿，2014年移居澳大利亚。\n\n她说：“通过老一辈和老师们给我们讲的故事，我们了解到西藏话题，了解到很多历史，我真的觉得自己跟西藏文化紧密相连，我能想象出西藏周边都是山、都是寺院的样子。”\n\n培育他们心中的藏人文化根也让他们维持着有那么一天能够把传统带回故乡的梦想。\n\n校长次仁说：“我们拥有真理。总有那么一天，我们会回到西藏的。我坚信这一点。”\n\n印度有着世界上最大的流亡藏人社区。如今，藏人难民的第三代正在印度成长。\n\n来源：美国之音\n作者：帕斯里恰"
		},
		{
			"post_id": 42,
			"title": "藏人行政中央",
			"date_published": 1524463251.618,
			"body": "藏人行政中央于印度时间2017年5月10日（周三）上午9时，在印度达然萨拉举行盛会，隆重欢迎南希佩洛西女士率领的美国国会跨党派代表团，尊者达赖喇嘛将出席盛会。"
		},
		{
			"post_id": 41,
			"title": "美国众议院和参议院要求全面落实“西藏政策法”",
			"date_published": 1524420948.312,
			"body": "本月4日，美国众议院和参议院提交了有关西藏问题的决议，该决议案（H. Con。Res.89）是由美国众议院外交委员会主席伊莱亚娜·罗斯·莱蒂宁和众议员艾略特·恩格尔与外交事务委员会委员，亚太地区小组委员会主席，及成员特德·约霍和布莱德·谢尔曼提交。\n\n该决议呼吁特朗普政府将西藏问题置于美中关系的重要方面，全面落实美国“西藏政策法”。还要求美国政府敦促中国与达赖喇嘛或其代表进行对话，促进在美的藏人，还包括美国公民进入西藏。\n\n![9.jpg (0x0)](data/img/post_41_9.jpg)​​​​​​​\n\n10年前，美国国会给尊者颁发国会金质奖，并对西藏日益加剧的镇压表示担忧。“达赖喇嘛尊者接受国会金质奖十年以来，中国在西藏实行的压制政策越来越严重，包括（1）对藏人和美国公民的旅行限制； （2）对宗教事务的限制性规定；（3）佛教文献信息审查；（4）西藏佛教遗址的拆除；（6）监禁西藏政治犯； （6）“干涉赖喇嘛尊者转世决定权”。\n\n美国国际宗教自由委员会（USCIRF）就特朗普政府提出的有关宗教自由的类似呼吁，并敦促要求释放十一世班禅喇嘛根敦曲吉尼玛。第十一世班禅喇嘛是在1995年，达赖喇嘛尊者确认后的第三天，中国政府便秘密带走当时只有六岁的第十一班禅喇嘛及其家人，从此，藏传佛教第二大领袖班禅喇嘛杳无音讯。\n\n十一月 8, 2017\n\n《西藏之页》首发"
		},
		{
			"post_id": 40,
			"title": "美国国会批准向西藏境内外藏人提供1700万美元",
			"date_published": 1524395307.512,
			"body": "美国国会已经在2018财年专门向西藏境内的藏人和流亡印度的藏人社区拨款1700万美元。此举对于在印度流亡藏人社区最大的聚集地以及藏人行政中央事实上的首都达兰萨拉来说，是一个值得欢迎的进展。\n\n藏人行政中央开设的tibet.net网站星期五说，这项法案包括用于西藏境内的800万美元以及在印度和尼泊尔藏人社区的600万美元，另外还有300万美元用于加强藏人机构和流亡政府的能力。\n\n---\n\n37名美国国会议员去年6月曾经致信美国总统川普，要求他尽快任命一位西藏问题特别协调员，但这一职位至今仍然空缺。\n\n此外，2017年5月有报道，川普政府计划在2018年10月开始的新财年取消对“西藏基金会”的拨款，并不再向“那旺曲培奖学金”提供资金。这一消息曾经引发西藏流亡政府的担忧。\n\n来源：美国之音\n作者：安华"
		},
		{
			"post_id": 39,
			"title": "瑞典起诉一藏人 指其为北京搜集流亡藏人信息",
			"date_published": 1524385771.741,
			"body": "瑞典检方星期三以间谍罪起诉一名藏人，指控其为北京搜集瑞典和挪威的流亡藏人的信息。\n\n据瑞典检方公布的消息，49岁的多杰嘉登（Dorjee Gyantsan）涉嫌搜集流亡藏人的信息交予中国官员换取报酬。\n\n---\n\n多杰嘉登从2000年起以难民身份获得在瑞典的居住权。瑞典检方称他曾为了搜集流亡藏人的信息而在挪威参加支持西藏独立的示威活动，并以记者身份为流亡藏人媒体《西藏之声》报道达赖喇嘛到访挪威一事。\n\n检方指，他从2015年7月到2017年2月被捕前曾多次与中国驻波兰使馆的工作人员见面传递信息并获取报酬。\n\n多杰嘉登是在从波兰返回瑞典时被捕的，当时他携带着6000美元的现金。检方认为这是中国方面给他的酬金。\n\n多杰嘉登的律师迈克尔·索德伯格（Mikael Soderberg）否认瑞典当局的指控。\n\n瑞典检察官迈茨·荣格维斯特（Mats Ljunqvist）对法新社表示，多杰嘉登的行为是严重的犯罪，影响的是弱势群体。\n\n荣格维斯特说：“从一些极权国家逃到瑞典的人必须能够感到安全，感到他们可以实践宪法保障的示威的自由，不用因此担心他们自己或他们的家人会受到迫害和攻击。”\n\n根据“瑞典藏人社群”（Tibetan Community in Sweden）组织，目前大约有130名藏人生活在北欧。\n\n来源：美国之音"
		},
		{
			"post_id": 38,
			"title": "美议员吁藏人发动更有力运动，引起中国政府注意",
			"date_published": 1524376327.926,
			"body": "藏人事业的坚定支持者、美国众议员吉姆·麦考文表示，藏人及其支持者组织必须调整他们的行动，发动更加有力的运动，引起中国政府的重视。麦考文众议员是星期四在华盛顿举行的庆祝藏人权益组织“国际声援西藏运动”成立30周年的大会上说这番话的。\n\n吉姆·麦考文众议员表示，“尽管‘国际声援西藏运动’进行了30年很好和很重要的工作，西藏的形势正在变得更糟，而不是更好。中国没有觉得自己的压制会产生任何后果。”他呼吁政府通过“入藏互惠法案”（HR 1872），向中国控制达赖喇嘛转世的努力说不，加倍努力争取西藏的良心犯获释，并让11世班禅喇嘛获得自由。\n\n现年58岁，来自麻萨诸塞州的麦考文众议员表示，“我们需要投入更多的资源和力量让中国政府回到谈判桌，并恢复西藏和中国的对话。”\n\n出席庆祝活动的还包括“国际声援西藏运动”主席理查德·基尔、美国众议院少数党领袖南希·佩洛西以及众议员伊丽亚娜·罗丝-雷提南等。\n\n来源：美国之音"
		},
		{
			"post_id": 37,
			"title": "联合国人权专家有必要前往西藏调查",
			"date_published": 1524198595.253,
			"body": "![8.jpg (0x0)](data/img/post_37_8.jpg)​​​​​​​"
		},
		{
			"post_id": 36,
			"title": "在台藏人纪念西藏抗暴日晚会",
			"date_published": 1524187197.231,
			"body": "![8.jpg (0x0)](data/img/post_36_8.jpg)​​​​​​​"
		},
		{
			"post_id": 35,
			"title": "流亡藏人在新德里集会请愿",
			"date_published": 1524149784.526,
			"body": "![8.jpg (0x0)](data/img/post_35_8.jpg)​​​​​​​"
		},
		{
			"post_id": 34,
			"title": "流亡台湾的藏人在“抗暴纪念日”游行",
			"date_published": 1524071295.484,
			"body": "![9.jpg (0x0)](data/img/post_34_9.jpg)​​​​​​​"
		},
		{
			"post_id": 33,
			"title": "流亡英国的藏人在“抗暴纪念日”游行",
			"date_published": 1524056973.001,
			"body": "![8.jpg (0x0)](data/img/post_33_8.jpg)\n\n![9.jpg (0x0)](data/img/post_33_9.jpg)​​​​​​​"
		},
		{
			"post_id": 32,
			"title": "美国会议员提议设立“西藏权利日”",
			"date_published": 1524050415.938,
			"body": "![8.jpg (0x0)](data/img/post_32_8.jpg)​​​​​​​"
		},
		{
			"post_id": 31,
			"title": "我对西藏地位的看法",
			"date_published": 1524028867.19,
			"body": "西藏，**大明**（就是汉地18省），西域（满清后来改成新疆），台湾，都是满清的占领地，这与大英帝国占领印度（以前中国称为5印，有5个邦国）一样，没有区别。\n\n大英帝国结束殖民时代，退出印度之后，原殖民地印度有选择，可以是一个大印度，也可以分裂成印度，巴基斯坦，孟加拉（原来叫东巴基斯坦），殖民地人民自己选择。\n\n满清结束殖民时代，西藏，**大明**，西域，台湾本来也应该可以有选择，（如果台湾没有被割让，当然台湾已经被满清割让给日本了，情况不同。）西藏可以选择独立，也可以选择与**大明**（汉地18省）合并，成立中华民国。\n\n大英帝国主动退出殖民地与满清退位结束殖民没有本质区别。\n\n但是，满清结束殖民地统治以后，**大明（汉地18省）**内战不断，先是孙文在广东另设一个政府，大明变成有2个政府，后来蒋介石又北伐推翻大明政府中华民国，后来又宁汉分裂又变成大明有2个政府。后来共产党又设立一个苏维埃政府，再后来中日之间爆发战争。\n\n从1912年满清结束殖民地统治，到1938年中日爆发全面战争的20几年里，**大明（中华民国）**战乱不停，从来就没有时间与西藏，西域协商过是合并成一个国家，还是大家各自独立，成立自己的国家。\n\n接下来中日之间爆发全面战争，**大明（中华民国）**更没时间与西藏，西域协商。\n\n到1949年，**大明（中华民国）**政府自己都被推翻了，中华民国都被赶出大明的国土了，去了台湾了。\n\n**大明**的国土上建立了一个新政权，中华人民共和国。这个中华人民共和国与满清没有殖民关系，与满清也没有政权更替关系，因为这个中华人民共和国成立的时候满清已经没有了。这个中华人民共和国与西藏，西域也没有历史关系。\n\n这个中华人民共和国只与大明（中华民国）有关系，是敌对政权。\n\n**这个中华人民共和国的国土比满清小很多，特别是没有包含蒙古；比大明又大不少，特别是包含了山海关以外的满洲。**\n\n这个中华人民共和国声称对西藏，西域拥有主权，可是它对西藏，西域的主权并不继承自满清，因为这个中华人民共和国建立时满清已经没有了，无法继承。\n\n中华人民共和国也无法从大明继承对西藏，西域的主权。首先，大明（中华民国）还存在。其次，满清殖民大明之前，大明对西藏，西域并不拥有主权，满清结束殖民地统治之后的大明（中华民国）也没有与西藏，西域协商过合并建立新国家，还是各自独立建立新国家。\n\n中华人民共和国声称的对西藏的主权**即无法从满清继承，也无法从大明（中华民国）继承。**所以，中华人民共和国对西藏，西域并不拥有主权。"
		},
		{
			"post_id": 30,
			"title": "如果我是西藏人，当然也要求独立啦。",
			"date_published": 1524022009.834,
			"body": "西藏，青海这么大，人口才600万，与新西兰相当，可是土地比新西兰大多了，独立以后生活肯定比现在好，至少能够达到新西兰的生活水平。\n\n所以，西藏人要求独立是再自然不过的事情。如果我是西藏人，我也会要求独立的。将心比心，我很能理解他们的独立愿望。所谓“己所不欲，不施与人。”当然我也支持他们独立。\n\n而且，西藏独立对普通中国人根本就没有利益冲突，西藏是不是一个独立国家，根本对普通中国人的生活水平没有任何影响。西藏的独立与否只对中共利益集团中的一部分在西藏有重大利益的帮派有影响。\n\n如果我是在中国的一些落后地区生活的人，我一定会参与西藏独立运动，积极争取在西藏独立以后获得西藏的公民身份，拿西藏的护照，改变自己的贫困状态。"
		},
		{
			"post_id": 29,
			"title": "朱瑞：中華民國虛構的宗主權",
			"date_published": 1523983095.134,
			"body": "——簡談范普拉赫先生和他的《西藏的地位》\n\n范普拉赫（Michael. C. Van Walt Van Praag) 先生生于荷兰，现为普林斯顿高级研究院现代国际关系和国际法学访问教授，也是国际著名藏学家。他的《西藏的地位》一书，对藏中历史上的所有关节点都进行了梳理，学术地还原了一直被中国御用学者们模糊的蒙藏关系和蒙中关系、满藏关系与满中关系、供施关系和朝贡关系、宗主国与附属国关系、保护国与被保护国关系、钦差驻藏大臣的真正地位、金瓶掣签的实施程度等，并从国际间遵循的原则即国际法的角度， 严谨地呈现了中华人民共和国入侵之前，西藏独立的事实。\n\n---\n\n此书的参考资料详实可靠，大多来自印度、尼泊尔、孟加拉等国有关西藏事物档案，还有当事人的通信和日记等，以及印度、尼泊尔等国历史学家的相关文章。在最后的附录中，还例出了自松赞干布以来，西藏与其他国家，如英国、印度、不丹、尼泊尔、蒙古、俄罗斯等，独立签属的条约原文，以及与中国签属的《十七条》和联合国大会的几项决议等，披露了许多鲜为中国人所知的西藏历史常识。其中，中华民国在西藏问题上虚构宗主权的几件典型事例，需要特别谈一谈。\n\n一、杜撰“五族共和”\n\n稍微了解西藏历史的人都知道，1912年，在没有任何外援的情况下，藏人独立地战胜了满清军队，藏中双方接受尼泊尔调解，以藏文、中文和尼泊尔文签属了《藏中协议》，主要内容为：中国军队缴械投降后必须撤离西藏。1913年1月，钟颖率其所属的最后一批军队离开拉萨，接下来，十三世达赖喇嘛发出文告，重申了西藏的独立地位。\n\n有趣的是，正是在中国惨败的情况下，袁世凯发布了一个似乎是面向中国国内的命令：“现今五族（汉满蒙回藏）共和，凡蒙藏回疆各地，同为我中华民国领土，则蒙藏回疆各民族，即同为我中华民国国民……”注释1史无前例地提出了蒙藏为中国的一部分，蒙藏民族为中国公民。1912年底，袁世凯又致函十三世达赖喇嘛，要求西藏予以承认。然而，十三世达赖喇嘛回复如下：\n\n“中华民国刚刚建立，国家之根基尚未稳固，总统需致力于维护秩序与安定。至于我们西藏，我们藏人完全有能力保护自己的生活方式，总统在任可时候都不必为遥远之西藏分心忧虑。西藏人所以不喜欢中央政府，是由于中国军人残暴对等他们，使他们怒火中烧。例如，不管中国军队何何摧毁或焚烧西藏的寺院和庙宇，当时的中国领导人都没有做出任何对策，如此则西藏人又怎么会不反对中国呢。”注释2\n\n同时，钟颖也交给了尼泊尔国王一封信，内容与给十三世达赖喇嘛的信几乎完全相同，以下是尼泊尔总理的回复：\n\n除了与尊重尼泊尔独立之盟友或邻帮维持长期友好和平以外，尼泊尔并无他求。尼中关系历史悠久，我们自然很乐意继续保持这种关系。但尼泊尔是一个珍惜自己独立，希望单独处世之古老的印度教国家，因而无法接受并入所谓中华民国五族一体的建议。注释3\n\n二、“出席”国民代表大会的神话\n\n第二次世界大战结束后，西藏派出代表团祝贺同盟国。同时，也向国际社会展示西藏作为独立国家的事实。对此，伦敦印度事务部政治与机密档案记载：注释4\n\n“去年十月底，西藏政府向我们提出，他们决心表现西藏独立的现状（英国政府承认而中国政府不承认的），为此计划派出高级官员 （但没有喝伦一级）所组成的代表团前往德里和重庆，向驻印英国总督庆祝获胜，并向英国陛下和总督献上达赖喇嘛和两位摄政的礼物，同时，代表团还将向美国总统献上哈达与祝贺之意，然后计划前往重庆向蒋介石将军表示祝贺。”\n\n西藏代表团抵达印度后，受到了隆重的接待，被邀请参加了在德里举行的胜利周之庆典仪式，英国总督也亲自接待了西藏代表团，藏方通过总督转交了给英王的信件。接下来，代表团拜会了美国大使，并转交了达赖喇嘛、摄政王，以及噶厦给美国总统的信。信中表达了希望进一步加强两国和两个政府之间业已建立的友好关系。当时的国际媒体，就西藏代表团的到来，进行了大量报导，称为“西藏政府亲善代表团”。\n\n然而，西藏代表团抵达南京后，国民政府几乎把他们视为了人质。因为当时正在准备召开国民代表大会，中国坚持要求西藏代表参加，但藏方坚持国民大会讨论的主要内容都是中国问题或中国宪法草案，他们无权参与和表达立场。噶厦也在得知中国官员不愿让代表团在召开国民大会以前离开时，命令代表团立即返回西藏。但国民政府不给代表团准备交通工具，同时还以等待总统的回信和需要准备送别仪式等为藉口，让西藏代表团滞留在中国。最后，民国政府又通知西藏代表团，藏方信中谈到的诸项问题，只能等国民大会做出决定。\n\n待西藏代表团列席会议后，国民政府立刻进行了与事实相左的宣传。因此，英国驻南京大使馆兰姆（L.H.Lamb)在给英国政府的信中直言：“中国人喜欢自欺欺人是众多周知的（他们对西藏拥有宗主权的虚构可能会使人产生幻觉），不管中国人如何在报纸上宣传或在国民议会煞有其事地通过决议，这些装腔作势的行为都很难获得世界其他国家的相信。……因为英国和来自世界各地的代表也列席了会议，谁也不会认为这些国家也是中国的一部分。”注释5\n\n三、泛亚洲会议上国民政府的妄念\n\n1947年3月，印度国大党召开泛亚洲会议，印度方面通过西藏外交局，邀请西藏与亚洲其他国家一样派出代表团。西藏立刻接受邀请，并责成代表团，在会议上阐述自松赞干布到历代达赖喇嘛在西藏执政之历史，西藏文化的发展，西藏与印度和中国的边界等。\n\n代表团抵达印度后，尼赫鲁和筹委会主席亲自到西藏代表团的下塌处表示慰问，印度的各家官方报纸也都进行了报导，包括甘地和英国驻印度总督，也对代表团进行了专门的接见，甘地甚至感慨：佛教是在印度教的基本上创立的，印度教和佛教，根是一个。表达了印度与西藏，源远流长的友情。\n\n与此同时，西藏国旗也和包括中国在内的所有与会国家的国旗一道迎风舒展。\n\n然而，民国政府的代表抵达新德里后，立即向印度外交部和会议组织者提出抗议，提出西藏是中国的一部分，并要求西藏代表团归入中国代表团，否则中国政府代表将抵制此次会议。然而，印度政府婉转拒绝了民国政府的这一要求，同时，尼赫鲁还特别安排西藏代表团团长桑颇. 才旺仁增讲了话。\n\n总之，中华民国在西藏问题上虚构宗主权之事实，举不胜举，包括黄慕松和吴忠信的进藏，也都进行了虚张声势的宣传，如今，早已成为国际藏学界的笑话。尤其是范普拉赫先生的《西藏的地位》中文版的发行，更使华人世界有机会系统地了解国际法中，西藏作为一个独立国家继续了几千年的事实。\n\n四、美國華人民主圈西藏研究的盲點\n\n如今，一些华人民主追求者，再次举出了五色旗 注释6，要求恢复中华民国。民国在西姆拉会议上，连宗主权都不承认，坚持对图伯特拥有主权。而现在那些举起五色旗的人，也同样明确不承认西藏在民国时的事实独立，也坚称依据《清帝退位诏书》，民国从满清继承了对图伯特的“主权”。\n\n尤其是在联合国咨询机构国际法学家协会数次论证结论“西藏在1949年以前事实独立”， 包括藏人、国际藏学学者、国际法学家、以及越来越多了解历史真相的汉人，都对西藏问题的本质是侵略形成普遍共识的情况下，却有中国宪政民主学者在去年出版了《中国民主转型中的西藏问题》一书，以朝贡体系想象的权属关系和中共官方篡改史实的宣传资料等，“论证”了图伯特自元朝起就“臣属”于“中国”，明朝、清朝都属于中国，并指十三世达赖喇嘛“图伯特是一个独立的国家”的严正声明“不诚实”。这本探讨民主转型中的西藏问题之书，包含强烈的国家主义意识，其改写史实的手法与对图伯特的“主权”主张，与中共没什么区别，但，得到了美国华人民主人士圈里这几年比较活跃的西藏历史研究者的推介。\n\n这位华人民主人士中的西藏历史研究者，在行文中频繁使用“中央政府”这类用语，并认为，西藏问题就是“共藏问题” 、“西藏问题的根源和本质是民主改革”、噶厦政府几百年没有管辖康和安多等理论， 并且，在回应藏人的批评，贬低西藏只在“吐蕃帝国时代”才独立过，只是最近终于松口承认了西藏在民国时期独立过，但，文章标题起得颇有趣：《事實分治下的民國和西藏：簡談民國時期西藏事實性分治的史實 》。\n\n事实上，在国际法的概念里，分治指的是过去统一体的地区，因不可避免的因素而分裂为新的领土和政权，例如“印巴分治”。另外，西藏历史上赞普世系之后，萨迦王朝之前，大约有四、五百年的时间被称为“分治时期”，因为这时，王室世系分崩离析，没有涵盖整个西藏的中央权威。总而言之，“分治”是相对于“统治”而言，不曾统治，何来“分治”？那么，在国民党之前，中国统治过图伯特吗？依据何在？\n\n朱瑞\n2015年3月23日星期一"
		},
		{
			"post_id": 28,
			"title": "西藏17条",
			"date_published": 1523978375.737,
			"body": "![1.jpg (0x0)](data/img/post_28_1.jpg)\n\n![2.jpg (0x0)](data/img/post_28_2.jpg)​​​​​​​"
		},
		{
			"post_id": 27,
			"title": "New blog post",
			"date_published": 1523974424.811,
			"body": "![3.jpg (0x0)](data/img/post_27_3.jpg)\n\n![4.jpg (0x0)](data/img/post_27_4.jpg)​​​​​​​"
		},
		{
			"post_id": 26,
			"title": "New blog post",
			"date_published": 1523969145.177,
			"body": "![5.jpg (0x0)](data/img/post_26_5.jpg)\n\n![6.jpg (0x0)](data/img/post_26_6.jpg)​​​​​​​"
		},
		{
			"post_id": 25,
			"title": "New blog post",
			"date_published": 1523964537.843,
			"body": "![7.jpg (0x0)](data/img/post_25_7.jpg)\n\n![8.jpg (0x0)](data/img/post_25_8.jpg)​​​​​​​"
		},
		{
			"post_id": 24,
			"title": "流亡藏民示威集会",
			"date_published": 1523958413.532,
			"body": "![7.jpg (0x0)](data/img/post_24_7.jpg)​​​​​​​"
		},
		{
			"post_id": 23,
			"title": "藏独组织与疆独，蒙独，台独，及越南反共团体等在日本集会。",
			"date_published": 1523952534.308,
			"body": "![8.jpg (0x0)](data/img/post_23_8.jpg)"
		},
		{
			"post_id": 22,
			"title": "洛桑森格访美拜会国会重要议员",
			"date_published": 1523942634.771,
			"body": "![8.jpg (0x0)](data/img/post_22_8.jpg)\n\n图片：流亡印度的藏人行政中央司政洛桑森格（右一）会见美国国会议员\n\n流亡印度的藏人行政中央司政洛桑森格4月11日呼吁美国国会加快任命**西藏问题特别协调员**和通过**《西藏旅行对等法》**等重要事项。洛桑森格4月6日开始对美国进行正式访问，4月10日抵达首都华盛顿。\n\n洛桑森格跟国际声援西藏运动董事会主席理查德·基尔一起星期四（4月12日）在华盛顿拜会了众议院少数党领袖南希·佩洛西、众议员吉姆·麦戈文、众议院外委会名誉主席、众议员罗斯-雷提南和众议员史蒂夫·夏伯特等重量级议员。洛桑森格敦促他们提出任命**西藏问题特别协调员**，以及支持西藏人员和宗教自由的**《西藏旅行对等法》**等问题。\n\n洛桑森格感谢美国国会议员对西藏事业的支持，特别感谢**国会批准3000万美元西藏项目拨款**，用于援助西藏境内外项目。洛桑森格将于4月17日结束访美返回印度。\n\n来源：美国之音"
		},
		{
			"post_id": 21,
			"title": "13世达赖喇嘛遗言中的预示",
			"date_published": 1523937662.987,
			"body": "![1.jpg (0x0)](data/img/post_21_1.jpg)​​​​​​​"
		},
		{
			"post_id": 20,
			"title": "达赖喇嘛抵圣地亚哥加大演讲一票难求",
			"date_published": 1523932904.305,
			"body": "![8.jpg (0x0)](data/img/post_20_8.jpg)​​​​​​​\n\n到访美国的西藏宗教领袖达赖喇嘛，于当地时间周四（15日）上午，从明尼苏达州飞抵加利福尼亚州的圣地亚哥市，周五将到加州大学分校公开演讲。此前曾表示反对达赖喇嘛到访的中国留学生，表示拒绝出席活动。\n\n---\n\n达赖喇嘛飞抵加州圣地亚哥市时，市长凯文•弗尔克纳夫妇和加州大学圣地亚哥分校校长布拉德普•克斯拉都到机场迎接。\n\n数百名当地藏人和华人，亦到其下榻的宾馆外欢迎。按计划，达赖喇嘛将在周五早上与新闻界会面，随后到加州大学圣地亚哥分校的毕业礼上发表演讲。最新消息指，届时将有9000名学生和15000名来宾参加此次盛典。\n\n该校中国学生学者联合会此前曾发出声明指，该校的中国留学生将杯葛达赖喇嘛的演讲，并报告中国大使馆。从今年2月以来，该校的中国留学生一直给校方施加压力，试图改变校方邀请达赖喇嘛的决定，但遭校方拒绝。\n\n旅居洛杉矶的中国作家吴祚来表示，这些学生并不清楚达赖喇嘛要讲什么，也不明白他为何在美国社会受到广泛欢迎。这些中国学生的做法，不但妨碍了美国的学术自由和言论自由的底线，还因愚昧和无知充当了中共官方的帮凶。\n\n他说：他应该是亚洲在美国这个主流社会最受尊敬的宗教界人士。这些小孩呢，他们应该去现场听一听这位老先生讲什么。讲的都是一些人生的智慧。因为美国是个多元社会，这些小孩这样做，实际冒很大的一个风险，他们实际是在用愚昧无知的方式配合中共做一些非常不恰当的事情。"
		},
		{
			"post_id": 19,
			"title": "习近平在西藏与人权团体的抗议声中访问英国",
			"date_published": 1523926983.249,
			"body": "![8.jpg (0x0)](data/img/post_19_8.jpg)\n\n2015年10月21日习近平正式对英国展开访问行程。在白金汉宫外，习见到了中共使馆安排的留学生欢迎队伍，也听到了西藏与人权团体的抗议声。\n\n西藏之声"
		},
		{
			"post_id": 18,
			"title": "自由西藏人士示威",
			"date_published": 1523898403.555,
			"body": "![8.jpg (0x0)](data/img/post_18_8.jpg)​​​​​​​"
		},
		{
			"post_id": 17,
			"title": "自由西藏人士示威",
			"date_published": 1523891570.461,
			"body": "![3.jpg (0x0)](data/img/post_17_3.jpg)\n\n![4.jpg (0x0)](data/img/post_17_4.jpg)​​​​​​​"
		},
		{
			"post_id": 16,
			"title": "德国自由西藏人士示威",
			"date_published": 1523890763.67,
			"body": "![8.jpg (0x0)](data/img/post_16_8.jpg)​​​​​​​"
		},
		{
			"post_id": 15,
			"title": "习近平访问捷克遭藏独人士抗议",
			"date_published": 1523884957.927,
			"body": "![1.jpg (0x0)](data/img/post_15_1.jpg)\n\n![2.jpg (0x0)](data/img/post_15_2.jpg)​​​​​​​"
		},
		{
			"post_id": 14,
			"title": "达賴5月11日在美帝波特兰市演講",
			"date_published": 1523878222.789,
			"body": "![8.jpg (0x0)](data/img/post_14_8.jpg)​​​​​​​"
		},
		{
			"post_id": 13,
			"title": "声援西藏大集会在日内瓦联合国总部前展开",
			"date_published": 1523875587.624,
			"body": "![8.jpg (0x0)](data/img/post_13_8.jpg)​​​​​​​"
		},
		{
			"post_id": 12,
			"title": "自由西藏在美国集会，要求习近平与达赖喇嘛展开对话。",
			"date_published": 1523868038.744,
			"body": "![9.jpg (0x0)](data/img/post_12_9.jpg)​​​​​​​"
		},
		{
			"post_id": 11,
			"title": "流亡藏人在印度游行示威",
			"date_published": 1523859333.124,
			"body": "![8.jpg (0x0)](data/img/post_11_8.jpg)\n\n![9.jpg (0x0)](data/img/post_11_9.jpg)​​​​​​​"
		},
		{
			"post_id": 10,
			"title": "自由西藏人士在德国的运动会上展示雪山狮子旗帜",
			"date_published": 1523849333.089,
			"body": "![8.jpg (0x0)](data/img/post_10_8.jpg)\n\n自由西藏人士在德国一个运动会上展示雪山狮子旗帜，中国运动员退出了比赛。"
		},
		{
			"post_id": 9,
			"title": "西藏独立理念者大会",
			"date_published": 1523842115.898,
			"body": "![8.jpg (0x0)](data/img/post_9_8.jpg)​​​​​​​\n\n【西藏之声2017年8月22日报道】来自海外的中国民主活动人士，以及台湾、维吾尔、南蒙古等遭受中共打压的群体代表，参加了在巴黎举行的第四届西藏独立理念者大会，强调各方应携手对抗中共的殖民统治。\n\n---\n\n第四届西藏独立理念者大会昨天（8月21日）在法国巴黎市召开。该场活动除流亡藏人社区持独立理念者出席，亦有来自世界各地其他民族群体的志同道合者出席。\n\n台湾法学博士曾建元、流亡德国的中国女作家徐沛、世维会秘书长多里坤•艾沙、世界南蒙古大会主席席海明，以及旅澳学者袁红冰等出席了会议。\n而根据活动筹备方公布的视频与新闻稿，西藏议会议员朗杰卓嘎作为主要嘉宾之一，在致开幕词时提出，理念与派系间的相互敌视绝不应该出现在西藏抗争中。她认为，壮大西藏独立运动，主要依靠团结对抗中共，在介绍西藏独立历史的同时，也应该向民众阐释争取西藏独立的利益。\n西藏前政治犯李科先发言时，提到藏人必须做好准备，抓住世界趋势变化的机遇，而世维会秘书多里坤•艾沙则谈到东突厥斯坦的未来与独立抗争，强调与所有反抗中共统治的人民进行联盟的重要性；徐沛博士在发言中介绍了中共对世界民主的威胁。\n\n在研讨会首日下午的会程中，西藏议员莫朗塔青发表了主题演讲“没有独立，西藏的宗教与文化便无法生存”，另一位议员丹巴亚培的主题为“西藏独立与世界和平的密切关联”。前议员哲彤•丹增旺布则在会上分析了中共于西藏实施的移民政策及其影响。"
		},
		{
			"post_id": 8,
			"title": "德国似乎是支持西藏独立最广泛的国家",
			"date_published": 1523812807.769,
			"body": "![9.jpg (0x0)](data/img/post_8_9.jpg)​​​​​​​"
		},
		{
			"post_id": 7,
			"title": "第四届西藏独立国际研讨会在巴黎外郊举行",
			"date_published": 1523808993.813,
			"body": "![9.jpg (0x0)](data/img/post_7_9.jpg)​​​​​​​"
		},
		{
			"post_id": 6,
			"title": "西藏和平解放背景",
			"date_published": 1523797002.426,
			"body": "（内容来自维基百科）\n\n1950年10月6日，中央政府与西藏噶廈政府谈判破裂后，中国人民解放军二野第十八军三万余人發動昌都戰役，向康区首府昌都发起攻击，很快就打败了只有八千余人的西藏军队。19日解放军攻克昌都，21日在后路被截断的情况下，藏军被迫投降。解放军殲滅5,700餘名西藏士兵，俘虏了包括多麦总管阿沛·阿旺晋美在内的军官和2,600余名士兵。\n\n1950年11月7日，噶廈政府決定向聯合國求助制止中國的侵略，紐約聯合國總部13日收到印度代遞的要求。由於西藏並非聯合國成員，而印度因為地理與歷史淵源最有發言權，英美兩國決定此議案應由印度帶頭，而印度因不願得罪中國，因此不支持排入聯合國議程。11月14日，中美洲国家薩爾瓦多代表團團長埃克托·卡斯特罗（Hector Castro）要求聯合國秘書處直接將西藏遭侵略議案提交聯合國大會，被拒绝。11月24日總務委員會會議中，埃克托·卡斯特罗的提案再度遭印度與蘇聯提議而無限期擱置。"
		},
		{
			"post_id": 5,
			"title": "有关西藏17条",
			"date_published": 1523791666.543,
			"body": "（这内容来源于西藏流亡政府网站）\n\n藏中有關人員之著作或回憶錄所展示歷史事實\n\n前言\n\n當今，西藏人民的正義斗爭在國際政治領域內已成為世人所關注的焦點，同時達賴喇嘛的聲譽業績傳遍世界各地。這種積極的發展趨勢自然令中共惱怒和恐懼萬分，因此，自然就會竭其所能地進行反撲，混淆視聽，企圖把西藏問題從國際輿論的焦點中分散開來。\n\n* * *\n\n1951年5月23日，中共強迫西藏代表在北京簽訂了不平等的所謂”十七條協議”。今年正值簽訂協議五十週年之際，中共當局準備在以西藏首都拉薩為中心的其它城市大力籌辦”十七條協議”簽訂五十週年紀念活動。同時大肆宣染所謂”十七條協議”的意義，宣稱『自那時起西藏人民就回到祖國大家庭的懷抱中；百萬農奴得到了徹底的解放，以及在中國共產黨的領導下如何的進步與發展』云云。鑒於此，根據歷史事實和西藏人民的切身感受正確評定”十七條協議”對西藏與西藏人民帶來的利害問題是一個不容忽視的重大問題。中共強迫西藏政府簽訂了與同樣被中共”解放”了的其他省或民族自治區之間所沒有簽訂過的”十七條協議”。根據強加給西藏人民的”十七條協議”之第一條內容”西藏人民回到中華人民共和國祖國大家庭中”，就再明白不過地表明了在此之前的千百年里，西藏做為一個完全獨立自主之國家的事實。”十七條協議”的簽訂是西藏歷史上的一大悲劇。自此整個西藏變成了中國可以隨心所欲的殖民地，六百萬西藏人民成為遭受被中共暴虐、奴役統治的直接受害者。也因此，過去的五十年，是西藏人民反抗奴役爭取自由的五十年，期間激烈的政治自由斗爭從未停止，整個西藏的局勢也從未穩定過，以至于不分日夜一直都是由全副武裝的軍警以武力鎮壓西藏人民反抗，維持對西藏的軍事占領。雖然如此，中共為了達到自己的政治目的，不擇手段地利用簽定”十七條協議”五十週年之際，曲解”十七條協議”的內容和意義，粉飾對西藏的暴虐統治和民族壓迫，因而在此之際，向不了解真相的人們說明簽訂這一不平等協議之經過，通過『國際法』說明”十七條協議”的非法和無效性就成為我們應盡的責任。\n\n在此，我們衷心期望中共政府停止利用早已因中共自己的踐踏而失去法律效力的”十七條協議”大作文章，混淆視聽的做法。誠懇地面對現實，順應潮流，重新審視達賴喇嘛基于和平與互利的原則提出的『中道』思想，為圓滿合理地解決西藏問題而開始與西藏政府展開談判，為了西藏和中國人民的長遠利益而簽定真正符合雙方人民的利益、為世界人民所承認的『協議』。\n\n西藏流亡政府外交與新聞部\n\n公元2001年5月22日\n\n一、 概論\n\n1951年5月23日，在如不在協議上簽字就以立即派兵進藏相要脅下，中華人民共和國政府強迫西藏政府簽訂了所謂的《關於和平解放西藏辦法十七條協議》。\n\n中共出版發行的部分文件中指出，簽定這個協議已表明了中國政府承認西藏獨特的歷史、政治、文化等。除西藏外，中共從未與別的地區簽訂過此類協議。(注1)\n\n國際上的許多學者也認為此協議實質上就是中共現今所謂的『一國兩制』。西藏人民則認為中國政府強加給西藏的這個協議不僅抹煞了西藏千百年來主權獨立的歷史地位，而且協議本身是中國政府以武力威脅下的產物，因此是無法接受的。1952年中共駐藏代表張經武在一次會議上提起”十七條協議”時，西藏代總理魯康娃指出﹕”西藏人民並不接受中國宣稱的在北京簽定的這個協議。西藏之東部領土現仍處于中共佔據下而未歸還給西藏政府”。(注2)當時由於西藏軍隊慘敗，整個西藏陷于中國大軍壓境的情況下而無所適從之時，在此危難之際，達賴喇嘛為了國家和人民的利益，竭力設法尋求與中共和平共處的途徑，八年來認真遵守協議各項內容，但中方卻背信棄義，無視或肆意踐踏協議內容。遑論遵守協議內容，甚至利用其強大的軍事力量，為徹底侵占西藏，消滅西藏的民族特徵而從西藏東部開始推行西藏歷史上亙古未有的暴虐、壓迫與迫害，從而使西藏民族陷于西藏歷史上從未有過的黑暗時期。1959年3月，鑒於與中共合作的失敗，西藏政教領袖達賴喇嘛被迫流亡國外，並在可以自由發表言論之時宣布廢止”十七條協議”。\n\n二、侵略\n\n1949年10月1日中華人民共和國成立。北京電台發布新聞宣稱﹕『中國人民解放軍要解放西藏、新疆、海南島、台灣在內的所有中國領土』。公元1949年11月2日西藏外交部就此新聞致電中共主席毛澤東。電文指出﹕”西藏是觀世音菩薩的教化圣地，是一個佛教興盛、與眾不同、獨立自主的國家，任何國家都未曾侵略過西藏。西藏始終反對外國侵略勢力，保衛著自己的家園，因此，中共不僅要保證其軍隊不得侵入西藏領土，不得進行與此有關的軍事活動，而且要對中藏邊界的地方官員嚴加指示，以便讓我們西藏人安心。此外，我們愿就中共以前侵佔的西藏領土問題與中共進行談判解決”。(注3)\n\n此電文內容也分別告知英、美、印度等政府，並要求說︰”共產黨領導如無視電文內容，強制派兵侵入西藏，西藏政府有責任竭盡全力保衛自己的國家，屆時請貴國政府給予協助”。對于西藏政府發出的呼籲，上述三國雖然也認識到目前正是共產主義膨脹之時，將會對南亞的安全構成相當大的威脅，但由於不和中國政府和談，則中國政府必定會訴諸武力，因此他們都建議西藏政府盡力尋求與中國政府展開和平談判。\n\n當時中共解放軍逐漸用武力侵佔西藏的東部地區,並散發包括十條內容的”驅逐帝國主義侵略勢力出西藏”的文件，中共的這種宣傳令人感到驚訝，因為當時在西藏的外國人不到十個人。西藏政府通過電台以藏、英、中三種語言指出﹕”根據歷史，中、藏在歷史上就是施者與被施者的關係，西藏不屬于中國。強大的中國如若想以強欺弱，以大國吞併小國西藏，則西藏哪怕是男盡女絕也將戰鬥到底”。(注4)同時西藏政府提出可以在俄羅斯、新加坡或香港等任何第三國舉行雙邊談判，結果中共方面選擇香港作為談判地點。西藏政府對此予以承認，並選任澤夏堪瓊．圖丹嘉吾和孜本．夏格巴旺秀德登二人為西藏代表。\n\n1949年藏歷12月26日，西藏代表從拉薩起程，于3月7日抵達印度噶倫堡，代表們從西藏政府那裡接受的使命是就”西藏外交部給毛澤東的信”、”西寧與北京電台宣稱人民解放軍要解放西藏”以及”爭取整個西藏的領土完整，如果中共非法干涉西藏事務，則西藏在任何時候都是無法接受”等事項與中共進行談判。(注5)\n\n兩位代表在德里向英國使館申請前往香港的簽證，結果遭到英使館的拒絕。這顯然是因為英政府怕在西藏政府頒發的護照上給予簽證將會激怒中國政府而採取的一種逃避手段。這是中國方面又通知說中國駐印度德里使館的大使即將到任，屆時可以和他進行談判。(注6)\n\n中國政府的新大使袁仲新（音譯）抵達後向西藏代表提出了\n\n1、承認西藏屬于中國。\n\n2、西藏國防由中國政府負責。\n\n3、西藏與任何國家的政治或商貿等外交活動，必須要經過中國政府。如接受上述三個條件，則西藏代表可以前往北京與中國政府進行談判。(注7)\n\n二位代表把中國方面提出的條件如實匯報給西藏政府，西藏政府則認為無法接受上述條件。因此，談判沒能進行。\n\n1950年10月7日，中國西南軍區的軍官張國華和王其美指揮的四萬多名中國軍隊兵分八路突然向康區首府昌都發起攻擊，在昌都地區的八千多名藏軍雖然英勇抵抗，但因實力懸殊，寡不敵眾，經過二十餘次的戰鬥後終于19日被擊敗，約5799名藏軍官兵在戰鬥中殉國。(注8)中國軍隊攻佔昌都並俘虜了時任昌都總督的阿沛．阿旺晉美。(注9)\n\n印度政府對中國武力侵略西藏的行為感到驚訝，1950年10月26日，印度外交部在給中共的一份措辭嚴厲的電文中聲稱﹕”現今因中國政府已下令侵佔西藏，由此無法同時展開和平談判，在現今國際局勢下，對中國軍隊用武力侵佔西藏的行為我們深感遺憾。印度政府認為這種行為對中國的和平是極為不利。”(注10)以美、英為主的許多國家對印度政府的這一立場表達支持的態度。\n\n由於中國政府非法以武力侵佔西藏，因此，西藏政府決定呼籲聯合國給予正義的支持。1950年11月11日西藏政府向聯合國呈交了報告，報告指出﹕『西藏人民深知阻止不了中國人的進攻，我們已接受與中共進行談判，雖然始終熱愛和平的西藏人民要抵抗具有豐富戰爭經驗的中共軍隊似乎並沒有戰勝之希望，但我們堅信不論世界任何國家發生侵略戰爭，聯合國都會給予幫助和制止』。 (注11)\n\n同時西藏政府召開西藏國民大會的擴大會議，緊急決定要求達賴喇嘛親政，在西藏面臨生死存亡之危難時刻，年僅十五歲的達賴喇嘛根據西藏政府與人神共同的願望和要求承擔起了西藏政教事業的大任。(注12)\n\n藏歷鐵虎年10月8日、公元1950年11月17日，在布達拉宮舉行了盛大的登基典禮。\n\n為了通過談判恢復西藏原有的地位，達賴喇嘛給中國主席毛澤東寫了一份信，信中指出︰”在我年幼期間，我們國家之間的關係出現緊張，如今我已承接了全部的責任，因此真誠期望能恢復雙方以往的友好關係。另外請求放回被俘虜的西藏人，并把軍隊撤出他們武裝佔領的西藏地區”。(注13)\n\n西藏外交部就關於達賴喇嘛親政的公告中指出︰”在達賴喇嘛承擔的西藏全部政治事務的後面，是團結一致、共同擁戴達賴喇嘛的西藏人民。我們呼籲世界人民以和平方式制止這種侵略行為。\n\n1950年11月17日南美洲的薩爾瓦多向聯合國提出中國侵佔西藏的議案，但由於印度代表聲稱為了西藏、印度、中國的利益，可以找到和平解決辦法而未能在聯合國展開討論。1950年12月8日，西藏代表雖然再次向聯合國提交報告，但未能產生任何結果。\n\n根據基於安全考量的建議，達賴喇嘛以及隨行的噶廈于1950年1月12日離開拉薩前往卓木，駐錫東噶寺。離開拉薩之前，達賴喇嘛任命堪欽洛桑扎西和孜本德凱才旺熱丹（魯康瓦）為代總理，安排負責政務工作。\n\n三︰尋求在昌都進行談判\n\n當時昌都在中共控制下，中共為了收買被俘的總督阿沛阿旺晉美及其工作人員，不斷地向他們解釋中共的民族和平政策，宣稱與中共合作將會得到寬大等政治教育。(注14)\n\n在中共策劃鼓勵下，阿沛阿旺久美從昌都連續派出孜仲堅參彭措和噶仲桑凌以及堪窮洛智格桑和嘉仲吉嘉等到拉薩。向政府提出中共要求西藏方面派出和平談判代表前往昌都，中共保證在和平談判解決之前軍隊不會前往拉薩。對達賴喇嘛和西藏官員的安全可以由阿沛及多麥總督全體工作人員擔保等。並表示政府最好是及時派出代表團等等。(注15)同時阿沛阿旺久美還提出如果西藏政府以為有益，則他願意代表西藏政府參加談判等意見。\n\n鑒於西藏東北地區已處于中共控制下，多麥地區的少量部隊，這些軍隊遭到慘敗。解放軍數萬大軍向衛藏進發。所以，在沒有國際上有利援助的情況下達賴喇嘛和西藏政府從拉薩派遣昌都談判代表有阿沛阿旺久美為主要代表，勘窮圖丹勒蒙、桑頗丹增頓珠為助理。\n\n堪窮圖丹列門和桑頗‧登增頓珠帶著西藏政府的文件從拉薩啟程前往昌都。他們持有的文件除了說明西藏政府昌都總督噶倫阿沛阿旺晉美為談判的主要代表，勘窮圖丹列門、桑頗‧丹登頓珠為代表，還指出可以和中共進行談判，但必須要堅持西藏的主權獨立地位，表明不同意解放軍進入西藏等。(注16)\n\n在第二份文件中指出西藏與中共談判的五條原則﹕\n\n1、西藏根本沒有帝國主義勢力，西藏和英國間存在的外交關係是第十三世達賴喇嘛前往印度後產生的，西藏和美國只是貿易關係。\n\n2、歸還以前的舊政府和現在解放軍所佔領的西藏領土。\n\n3、西藏如果遭到外國入侵，則請中國政府給予幫助。\n\n4、請進入康區和青海的解放軍撤出。\n\n5、今後請勿聽班禪和熱振方面的挑撥。(注17)\n\n以上內容由昌都總督阿沛阿旺久美轉交給到昌都的解放軍軍官王其美，中共對此的答復是﹕\n\n1、英國、美國干涉我國內政是極為明顯的。阻止西藏和談代表前往北京談判就說明了這一點。\n\n2、鞏固國防事關重大，所以必須進藏。\n\n3、我軍進入西藏後要實行民族平等、地方自治的政策。對西藏的軍政制度和達賴喇嘛的地位不進行更改。達賴喇嘛不許出國，要維護原有地位。\n\n4、對西藏實行自治時對達賴喇嘛的原有地位不予更改。\n\n5、對西藏內部的各集團之間的關係要以團結的原則為基礎進行談判的方式來解決。我們沒有復仇思想。(注18)\n\n在昌都的西藏談判代表因無法以西藏政府的原則進行談判，所以和王其美商討後決定中共代表團前往拉薩進行談判。為此阿沛阿旺晉美派孜仲魯珠南捷和雪仲頓雲前往拉薩進行說明。在這期間，因亞東的噶廈與中國駐印度的新任大使取得聯繫，談判已經改在北京舉行。(注19)\n\n四︰在北京的談判\n\n1951年3月在亞東的噶廈決定派出五名代表前往北京進行談判。其中主要的談判代表為噶倫阿沛阿旺晉美、堪窮圖丹列門、桑頗丹登頓珠等原已任命的直接從昌都前往北京。另從亞東派出凱墨‧索安旺堆、圖丹旦達、中文翻譯達拉彭措、英文翻譯薩堆仁欽通過海路前往北京。\n\n西藏政府給從卓木出發的兩位談判代表帶去給阿沛阿旺晉美秘密指令和禮物以及以達賴喇嘛的名譽要求印度總理對兩位談判代表給予指導的信件等。在給阿沛阿旺晉美的指令中，西藏政府任命阿沛等代表西藏，提出了與中共談判時西藏政府的五條原則︰\n\n1、西藏佛教之國是一個自由、獨立的國家。保持和發展歷史上即已存在的西藏與中國間的供施關係。\n\n2、西藏政府和中國新政府之間的關係繼續維持類似西藏政府與國民黨政府間的關係。\n\n3、中國政府向西藏派出不超過一百人的代表和工作人員，他們的安全由西藏政府負責。\n\n4、歸還打箭爐以西的西藏領土，中國軍隊和機構撤出西藏。\n\n5、西藏的國防安全由西藏軍隊負責。(注20)\n\n除了上述五條，西藏政府的指令中還指出，所有最終的決定和其他的重大問題必須隨時請示西藏政府等。(注21)\n\n由此，西藏代表們並沒有被授與做出超越西藏政府原則之決定的權力是非常明顯的。\n\n西藏代表從亞東經加爾各答到新德里與印度總理會面，期間他們除轉交達賴喇嘛的信函。還要求印度總理就西藏政教長續存在提供建議，以及要求印度政府出任西藏和中國和談之中間人等要求，但未獲應允。\n\n3月29日，阿沛等從昌都出發前往北京。途中，中國政府派巴瓦‧彭措旺杰和陸義宏(音譯)等，為統戰西藏代表團施展了各種手段。還有鄧小平等文武官員不斷對他們進行統戰，宣傳中國少數民族政策和宗教政策等等。(注22)\n\n4月22日阿沛等抵達北京火車站時受到中共總理周恩來、副主席郭沫若、政府秘書長林白渠(音譯)、統戰和民族事務委員會負責人李維漢等中共領導人和各部門人士、在北京的藏人代表等近百人前來迎接。(注23)\n\n四天後的4月26日，從亞東前往北京的西藏談判代表團抵達北京火車站，受到中共政府秘書長林白渠(音譯)、李維漢等官員和各校學生、扎什倫布寺院的部分工作人員、從康區到北京的噶倫阿沛和兩位助理的歡迎。(注24)\n\n西藏和平談判代表被安排在北京飯店。飯店里除了前蘇聯的客人和中共工作人員外沒有任何跟外界接觸的機會，如欲外出時，中方總是以安全為理由進行限制，臨時不得不外出時，不分日夜明里暗里都有人監視跟蹤，從而完全無法與外界其他人進行接觸談話，形同囚禁。(注25)\n\n4月28日民族事務委員通知西藏政府代表團，要在民族委員會介紹談判準備情況、時間、談判程序等。西藏政府代表團按通知時間到了民族事務委員會，李維漢給西藏政府代表團發了以前他們在西藏安多地區散發的有十條內容的小冊子。並聲稱明後天要以這個為基礎進行談判。(注26)那十條是︰\n\n1、西藏人民團結起來，驅逐帝國主義侵略勢力，西藏人民回到中華人民共和國祖國大家庭中來。\n\n2、在西藏實行民族自治。\n\n3、對于西藏現行的政治制度，中央不予變更。達賴喇嘛固有的地位及職權，中央亦不予變更。各級官員照常供職。\n\n4、保護宗教自由和寺院，尊重西藏人民的宗教自由和風俗習慣。\n\n5、對西藏軍隊的制度不進行改革，將西藏軍隊編入中華人民共和國國防部隊。\n\n6、要發展西藏人民的語言、文學和教育。\n\n7、發展西藏的農牧、工商業，改善西藏人民的生活。\n\n8、在西藏需要改革時以人民的意見為根據，和西藏人民和領導們商量解決。\n\n9、以前和英國、美國或國民黨有關係的官員，現在斷絕關係不從事反對和破壞活動，可以繼續擔任原有的職務，對原有的罪行不進行追究。\n\n10、為了保衛國防，中國人民解放軍進駐西藏，人民解放軍將遵守以上政策。軍隊的所有開支由中央人民政府支出，人民解放軍進行公平買賣。(注27)\n\n西藏政府代表凱墨‧索安旺堆將蓋有西藏政府大印的有關談判的五條原則文件準備交給噶倫阿沛阿旺晉美時，中共表現極為不滿，而且未讓提該文件的內容。\n\n1951年4月29日，西藏和中國的第一次談判在中共軍事委員會聯絡廳召開。(注28)中國談判代表團以統戰部部長、民族事務委員會主任李維漢、中國書記處辦事處主任張經武、中國西南軍區十八軍軍長張國華、西南軍政委員會秘書長孫志遠等。另外中國方面以非代表身份與會的還有十八軍聯絡科科長巴瓦‧彭措旺捷和他的助理樂于泓、翻譯安多卓倉（今樂都）彭措扎西等。(注29)\n\n中共首席代表李維漢強烈要求以十項方案為雙方談判的基礎，西藏政府代表拒絕接受中共提出的方案和對此的解釋，並極力要求以西藏政府提出的五條原則為基礎進行談判。對此巴瓦‧彭措旺傑在其所著的《回憶西藏和談前後》中提到﹕”他們（西藏政府代表）對李維漢同志論述的上述原則以及對國內外的情況缺乏必要的認識或無法理解，在解釋自己的觀點和要求時和中央的想法與期望有較大的差距……做為代表團成員，如實闡述西藏政府的觀點和要求是無可非議的，這就是談判初期所遇到的困難。”\n\n阿沛阿旺晉美提出﹕青海、新疆兩地的解放軍正在向拉薩和阿里進軍，如此，則達賴喇嘛很難留在西藏，因此請解放軍不要再繼續前進，如果答應這些，則我們要向達賴喇嘛發電匯報。對此王維漢說需要向中央請示，然後休會。(注30)\n\n藏中第二次談判在5月2日繼續進行，阿沛阿旺晉美闡述了西藏自古以來是獨立的理由和藏中關係只是供施關係，(注31)提出如目前這樣解放軍進入西藏乃是關鍵的問題，這些問題如得不到明確的解決，則由於在談判的原則問題上產生矛盾，因此要向西藏政府發電報做請示。(注32)\n\n李維漢拒絕接受西藏代表的提議，表示這里不是在討論西藏的地位問題，西藏做為中國的一部分是不容討論的。(注33)他還故做威嚴地說﹕解放軍進軍西藏是中央既定方針，西藏是中國不可分割的一部分，我們一定要解放全中國，解放軍進藏對西藏民族有利，對全中國也有利，中央政府幫助西藏人民驅逐帝國主義侵略勢力，特別是為了西藏的邊防，建立中國國防軍是非常必要的。對此不管過去將來都不會有任何變化的政策，西藏做為中國不可分割的一部分這一事實為英國和印度兩國所承認。解放軍進軍西藏是中國內部的事情，與英國和印度等沒有任何關係。達賴喇嘛親政時毛澤東發了賀電，他如果去印度將會失去他現有的名譽地位。(注34)\n\n李維漢咆哮過後，張經武也臉色發紅地站起身說﹕西藏和平解放之十條是中華人民共和國成立時以共同綱領為基礎提出的等又是一陣咆哮。西藏代表方面雖然盡量進行澄清和做出說明，但因中國代表不予聽從，從而遺憾地結束了這天的談判。(注35)\n\n5月7日上午，藏中間舉行第三次談判，當天除了聽中國代表長篇大論和教訓而外沒有任何機會。對此桑頗‧登增頓珠在《人生春潮》中指出︰”雙方代表遑論平等地進行談判，存在的只有教訓者和被教訓者的意識。”\n\n5月10日下午，藏中間舉行第四次談判，在開始的交換看法期間，中國首席代表李維漢表示︰西藏和平解放辦法協議簽訂後，將在西藏成立軍政委員會。西藏代表們對”成立軍政委員會”產生很大的疑慮，土丹旦達問﹕『為什麼要成立軍政委員會？軍政委員會是幹什麼的？』李維漢回答﹕『軍政委員會是管理全西藏軍政事務的主要機構。』土登丹達又問﹕『如果是那樣，那不是和”不改變達賴喇嘛的權位”相互矛盾嗎？』李維漢聽後大怒，雷霆大發地說﹕『誰說中央不改變達賴喇嘛原有的權位，你們是不是要和中央對著干，西藏是中國的一個地區。如果用那種立場那根本沒有辦法和談，你們什麼時候回去都可以，明天、後天回去也可以，也可以在西藏武力解放後回去，期間你們可以留在北京。我們的人民解放軍已經到西藏地區，除了給地方發個電報而外沒有其他的麻煩和困難。總之，你們是要和平解放西藏還是要武力解放？可以從中作出選擇』。面對威脅，土丹旦達回答說﹕『我不懂所以詢問，如果連詢問的余地都沒有而如此強橫，則你們猶如年輕力壯的成年人，我們好比七、八歲的小孩，要打要殺都在你們手中，如叫回去也可以回去』。雙方激烈辯論後散會，談判也中斷幾天。(注36)\n\n談判中斷後西藏政府的代表們多次集聚到阿沛阿旺晉美的房間，大家對在中國方面蠻橫強勢下的談判結果甚為擔憂，也個自提出了各種意見。當時噶倫阿沛阿旺晉美說﹕我們已經在中國人手中，要殺要剮隨他們願，這樣欺凌則和談很難，我們也沒有必要害怕。(注37)\n\n由於談判中發生爭論雙方聯係似乎已經中斷，但中國方面派巴瓦‧彭措旺捷和中共工作人員從中說合等種種誘騙手段下，雙方于5月14日舉行第五次的談判，當時，西藏政府代表們鑒於如果繼續堅持西藏政府的原則，則中國軍隊可能會向西藏衛部進發，造成地方和生命無法估量的損失；同時由於中國政府不讓西藏代表和西藏政府進行聯係以及由於時間緊迫；不知道達賴喇嘛是否已經到了國外；如果達賴喇嘛到了國外應該怎樣辦？在各種利害、希望與疑慮中代表團經過反覆商討後，認為雖然中共提出的作為談判基礎的內容難于接受，但如果達賴喇嘛已經出了境，為了將來能夠有迴旋的餘地等，西藏代表決定如果得到中國政府保證達賴喇嘛即使已經出國，未來返回西藏時也將繼續保有原有的職權，則暫時同意在協議上簽字。(注38)\n\n中國政府最後接受了如果簽訂協議後達賴喇嘛和西藏政府不予承認，達賴喇嘛前往國外留住四、五年，但他任何時候返回西藏都要保留其原有的地位。達賴喇嘛在印度停留期間所需要品都由西藏政府提供等條件。\n\n但是中國政府也聲稱，由於協議是要向世界宣布，如果將這些條件寫入協議，可能引起國際社會的議論，因此為避免此類事情，這些內容將不列入協議正文中，而是另外簽訂一份附加協議。故那些條款沒有寫入協議正文。(注39)\n\n中國政府將他們早已經確定的十項條款以泰山壓頂之勢強加給西藏代表，使西藏代表在沒有機會向西藏政府請示的情況下對藏中間的協議條款做出了大概的確定。在此之際，中國政府又魚目混珠，竟然強烈提出要將西藏內部的政府與班禪堪布會之間的矛盾納入協議之中。對此阿沛阿旺晉美強烈表示反對，他說『我們不會對西藏的內部問題進行談判，我們只是代表西藏政府和中國政府進行談判，沒有對西藏政府和扎什倫布寺問題進行談判的使命和權力，我們藏人內部的問題可以另外討論，所以沒有必要列入協議』。中國方面發出最後通牒，宣稱你們內部的問題沒有解決之前無法在協議上簽字。噶倫阿沛阿旺晉美在無可奈何之中提出『如果是這樣，無法簽定協議也是沒有辦法的，請中國政府把凱墨等亞東來的四位代表安全送回西藏，我是昌都解放委員會的人，叫我去昌都也可以，叫我留在北京也行』。他還對其他西藏代表說﹕『現在無法在協議上簽字，請你們返回西藏，對你們的安全已經要求中國政府負責，我個人怎麼處置隨他們的便』。由於提出無關的新問題，雙方的談判再次停頓幾天。(注40)\n\n從以上言論和情況不難看出他們已經完全失去自由地位的事實。\n\n有一天中國代表孫志遠帶著翻譯巴瓦‧彭措旺捷來到阿沛阿旺晉美的房間。和阿沛阿旺晉美對有關班禪堪布的問題激烈地討論了一天。最後，孫志遠提出在條約中列入十三世達賴喇嘛與九世班禪額爾德尼彼此和好相處時的地位及職權的問題，獲得西藏代表的同意後列入協議第六條。(注41)\n\n在談判期間，中國代表自始至終對西藏政府代表以歧視、欺凌和強制威脅等方式施加壓力，將他們的意志強加給西藏人。西藏代表雖然根據西藏政府的談判原則多次進行激烈的爭論，但由於強弱懸殊，孤懸他國的情況下，無法擔負所謂武力解放對西藏生命的殺戮摧殘之責任等情況下，不得不被迫在協議上簽字，因為除此而外他們沒有其他的選擇。\n\n五︰”十七條協議”\n\n5月21日最後一次談判在民族事務委員會禮堂舉行，中國方面規定了正式協議和被稱為七條秘密附加協議的草案。”十七條協議”除了新增加的有關班禪喇嘛一些條款外，中共在談判一開始就提出的十條原則則沒有任何變化地列入協議。在很長的協議前言中，寫著西藏民族是一個有悠久歷史的屬于中國的民族等。這些內容西藏代表是首次看到的。\n\n所謂的”十七條協議”是︰\n\n1、西藏人民團結起來，驅逐帝國主義侵略勢力，西藏人民回到中華人民共和國祖國大家庭中來。\n\n2、西藏地方政府積極協助人民解放軍進入西藏，鞏固國防。\n\n3、根據中國人民政府協商會議共同綱領的民族政策，在中央人民政府統一領導之下，西藏人民有實施民族區域自治的權利。\n\n4、對于西藏現行的政治制度，中央不予變更。達賴喇嘛固有的地位及職權，中央亦不予變更。各級官員照常供職。\n\n5、班禪額爾德尼的固有地位及職權，應予維持。\n\n6、達賴喇嘛和班禪額爾德尼的固有地位及職權，係指十三世達賴喇嘛與九世班禪額爾德尼彼此和好相處時的地位及權職。\n\n7、實行中國人民政治協商會議共同綱領規定的宗教信仰自由的政策。尊重西藏人民的宗教信仰和風俗習慣，保護喇嘛寺廟。寺廟的收入，中央不予變更。\n\n8、西藏軍隊逐步改編為人民解放軍，成為中華人民共和國國防武裝的一部分。\n\n9、依據西藏的實際情況，逐步發展西藏民族的語言、文字和學校教育。\n\n10、依據西藏的實際情況，逐步發展西藏的農牧工商，改善人民生活。\n\n11、有關西藏的各項改革事宜，中央不加強迫。西藏地方政府應自動進行改革，人民提出改革要求時，得採取與西藏領導人員協商的方法解決之。\n\n12、過去親帝國主義和親國民黨的官員，只要堅決脫離與帝國主義和國民黨的關係，不進行破壞和反抗，仍可繼續供職，不究既往。\n\n13、進入西藏的人民解放軍遵守上列各項政策，同時買賣公平，不妄取人民一針一線。\n\n14、中央人民政府統一處理西藏地區的一切涉外事宜，並在平等、互利和互相尊重領土主權的基礎上，與鄰邦和平相處，建立和發展公平的通商貿易關係。\n\n15、為保證本協議之執行，中央人民政府在西藏設立軍政委員會和軍區司令部，除中央人民政府派去的人員外，盡量吸收西藏地方人員參加工作。\n\n參加軍政委員會的西藏地方人員，得包括西藏地方政府及各地區、各主要寺廟的愛國分子，由中央人民政府指定的代表與有關各方面協商提出名單，報請中央人民政府任命。\n\n16、軍政委員會、軍區司令及入藏人民解放軍所需經費，由中央人民政府供給。西藏地方政府應協助解放軍購買和運輸糧秣及其他日用品。\n\n17、本協議于簽字蓋章後立即生效。\n\n有關秘密附加的”協議”\n\n中共對十七條協議有附加的七條協議至今保密而不向外界宣傳。但是，在阿沛阿旺晉美、凱墨、達拉彭措等的書中記載有關附加協議的內容如下﹕\n\n1、如果達賴喇嘛已經出境，在國外居留四、五年後回西藏時，可以保留原有的職權。居留國外的這一時期達賴喇嘛的所需品等由西藏政府提供。\n\n2、解放軍駐西藏的國防部隊數量在一個軍左右，在建立西藏軍區時要任命一至兩個噶倫為副總司令。\n\n3、保留五百名藏軍做為達賴喇嘛的警衛隊，另外為了維護各地治安而保留一千名藏軍，其余藏軍全數解散。（在正式協議第八條中只有藏軍逐步改編為人民解放軍的內容）\n\n4、西藏政府外交部編入中國政府外交部的下屬單位，西藏政府外交部的工作人員在外交部所屬擔任適當的職務。（這一條和正式協議的第十四條有關）\n\n另外還有三條，由於當事人忘卻失憶或由於壓力而在五十年之後的今天仍然是個秘密。\n\n六︰協議的簽字\n\n1951年5月23日在北京中南海勤政殿禮堂舉行”中國中央人民政府和西藏地方政府關於和平解放西藏辦法的協議”簽字儀式。簽字後中國政府副主席朱德、中國首席代表李維漢、西藏首席代表阿沛阿旺晉美等發表了講話。阿沛阿旺晉美的講話也經過和中方多次討論後按照中國要求發表的，並沒有得到表達西藏方面真實意願的機會。(注42)\n\n在協議簽字之前，西藏代表明確鄭重地聲明他們沒有權力以達賴喇嘛或西藏政府、西藏人民的名義簽字，只能以他們個人的名義進行簽字。(注43)\n\n但中國政府還是舉行了簽字儀式並公布了西藏和平解放協議的簽定。由於協議的簽定是在不平等的情況下被迫簽定，因此除了阿沛帶著昌都總督的公章而外，其他代表只有私人徽章而沒有帶公章。但中國政府卻專門派人給每個西藏代表們新刻製了木質名章並蓋在協議上。(注44)\n\n5月24日西藏代表們會晤中國國家主席毛澤東，當時，毛澤東長篇論述有關重視西藏等說盡好話。他說﹕我們共產黨是來幫助你們西藏發展文化和經濟事務，而不是來當官、做壞事的。如果漢族工作人員欺負你們，你們可以來找我們。西藏通過的協議是藏民族和漢民族的光榮。藏人也可以做北京的主人，藏人也可以做中華人民共和國主席等等。(注45)\n\n在和平協議上沒有簽字前，以阿沛阿旺晉美的名譽給周恩來寫了一份報告，要求將西藏安多和康區等所有西藏地區全部統一划入西藏地方政府的統轄下。但是簽字以後周恩來對這一問題的口頭回答是﹕現階段是和平解放西藏，其他藏區早已解放，不僅革命積極性很高，而且藏族地區歷史上遺留下的矛盾糾紛尚未解決，因此現在還沒到將全部藏族地區統一為一個行政區域的時候，幾年後各藏區互相協商下可以實行統一政策等。(注46)但是，後來中國對此不僅沒有實施，甚至從未提起。\n\n七︰西藏政府對十七條協定不滿\n\n5月17日，北京電台全文播送了十七條協議，達賴喇嘛和西藏政府由此才知道此事。這個消息使暫住卓木的達賴喇嘛和拉薩方面驚訝萬分，(注47)不久十七條協議之概要通過電報發送到在卓木的噶廈手中，西藏政府當即指責說︰『給從卓木前往的五位代表的密函中明明指示一切問題都要經過請示後根據指示做出決定，但你們竟然擅自簽約，實屬過分』。噶廈還指示談判代表『儘快將協議和附件寄送卓木，在未做出明確決定之前，談判代表繼續留在北京』。(注48)\n\n但中國政府以難于用電報將十七條協議全文傳送，秘密附件涉及國家機密，不適合通過電報傳送為由進行阻攔。\n\n因此以阿沛為首的西藏政府談判代表表示為了向達賴喇嘛報告簽約過程而準備經印度前往卓木時，中國政府方面又以阿沛是西藏的首席談判代表，不便經過印度前往，如通過印度前往，外國特務將會對其不利為由，要阿沛經康區返回拉薩。其他代表則可以經印度返回卓木。(注49)\n\n由此阿沛和助手堪瓊圖登列門、孜仲江贊朋措以及中國軍官張國華、巴瓦朋措旺傑一同經康區前往拉薩，其他談判代表與中國政府代表張經武及其助手樂毅泓取道香港、印度前往卓木。\n\n當時在卓木的西藏政府通過電報獲知中國代表軍官張經武將取道印度前來卓木，同時由於十七條協議的簽定不僅危害西藏長遠的政教利益，尤其是達賴喇嘛的安全亦難于保障的情況下，一些人建議達賴喇嘛從卓木前往印度，另一些人則反對前往印度，主張返回拉薩。幾經爭論，最後決定等中國代表張經武趕到後再視情況做出決定。(注50)\n\n7月15日，在卓木的噶倫和張經武見面，張經武不僅解釋了十七條協議的簽定，而且要求西藏政府通過電報向中國政府表示擁護十七條協議。噶倫們對此未做正面回答，轉而討論達賴喇嘛與張經武會面的問題，張經武提出中央代表與達賴喇嘛的見面儀式上，必須正確地表現出中央政府與地方政府的關係。次日，達賴喇嘛在東嘎寺的駐錫地與張經武會面，張在解釋簽定十七條協議的同時，再次提出給領袖毛澤東發出擁護協議之電報的問題，達賴喇嘛也未予正面回答。張經武的電報員何宮福<音譯>指出︰『雖然十七條協議已經簽字，但西藏地方政府中的一些高層官員對協議的簽定持反對的態度……甚至西藏地方政府派到北京的談判代表中，對協議的談判過程指認事宜不盡一致。』(注51)\n\n克門和拉烏達然一到卓木即向噶廈呈交了詳述協議簽定過程的報告，並要求拜見達賴喇嘛，西藏政府為了表明對簽定協議的不滿而未準。(注52)\n\n中國官員張經武反覆要求發出擁護十七條協議的電報，噶廈表示等阿沛到了拉薩與全體噶倫見面後再做出決定，張經武稱西藏政府如早日發出擁護協議的電報最好，這樣在全國人民中對達賴喇嘛的聲譽也有好處等。\n\n7月20日，以噶廈的名義向中國政府發出電報，表示等阿沛返回後對協議進行討論後再予實施。(注53)\n\n7月21日，達賴喇嘛一行離開卓木開始返回拉薩。兩天後張經武一行離開卓木前往拉薩，他們8月8日抵達拉薩。雖然張經武要求西藏政府的兩位代總理前來迎接，但西藏政府派來迎接的是噶倫拉魯才旺多杰和代理噶倫圖登然庸。(注54)\n\n由於西藏中國各為一國，因此在西藏政府和民眾中對協議的簽定明顯地表露出不滿情緒時，中國官員立即及時地對西藏政府的高層官員、喇嘛、堪布、著名人士展開統戰工作，給各大寺院發放佈施等以收買人心。(注55)\n\n張經武前後與代總理樂康瓦和洛桑扎西見面，解釋中國政府對西藏的政策，要求西藏政府對十七條協議的簽定儘快發出電報表示擁護，其中一次會面時，樂康瓦回答說︰『實際上協議的內容和電台廣播的不一樣，阿沛前往北京時，給他的任務是為和平進行協商，並未授權在軍事等方面進行談判，十七條協議完全出人意外，協議的核心是什麼？等阿沛回來提出報告後經過討論再說，知道昌都被侵占，西藏是一個熱愛和平的宗教國家，歷輩達賴喇嘛都致力于和寧，十四世達賴喇嘛亦竭力爭取和平，當時西藏人雖然憤懣，但達賴喇嘛始終秉持尋求和談而派出了談判代表團，西藏做為一個宗教興盛的國家，以其派出軍隊，不如派出一些有智慧能幹的代表前來，否則那些睡著的人也會爬起來反抗，如果壓迫西藏民眾，我本人已經是鬍子花白的臨死之人，西藏人民的力量雖小，但他們會向三寶祈禱而遭受報應。』(注56)\n\n8月17日達賴喇嘛抵達拉薩。9月9日，侵占昌都的中共十八軍副軍長王其美率領的先頭部隊三千餘人以及阿沛、巴瓦朋措旺傑等抵達拉薩。其後王其美與巴瓦朋措旺傑前去拜會兩位代總理和諸噶倫，代總理樂康瓦明確地說︰『你們和滿清、國民黨沒有任何的區別，昌都是武力強佔的，佛教之國秉持中立，從未想過要侵占中國的領土，不管是誰要吞噬西藏是辦不到的，中國一個大國在欺壓我們西藏小國，你們所說的西藏歷史是中國人偽造的，你們並不知道我們西藏人自己的歷史。』(注57)\n\n張經武不斷地催促要求達賴喇嘛對已經簽定的十七條協議在大軍未到拉薩之前向中國政府做出擁護的表態〈當時由張國華和譚冠三率領的中國軍隊仍在行進當中，尚未到拉薩〉，兩位代總理提出對協議的表態要經過西藏民眾大會全體會議的討論後確定應如何做出反應。\n\n9月24-26日，在西藏民眾大會全體會議上，阿沛將中國軍隊剛開始侵入西藏以及侵占康區到奉命前去進行談判等經過做了詳細的說明以後，表示以目前的狀況，他認為難于求得更好的結果，並表示對於他們五人未經請示而簽約，甘願在身家性命方面接受任何的處罰。民眾大會也認為在目前的情勢下已經難于求得更好的結果，因此他們提出五個問題，建議噶廈對這些問題作出慎重考慮後向中國政府發出擁護協議的電報。\n\n西藏民眾大會提出的五個問題是:\n\n一︰盡力爭取不要讓大量中國軍隊進入西藏，進入西藏的軍隊不得集中在拉薩，應直接前往南部卓木等邊界地區。\n\n二︰在執行協議時對無法接受的部分內容應該可以提出異議。\n\n三︰軍政委員會的職責是管理軍隊，不使軍隊違犯政策和紀律，\n\n四︰西藏的建設和邊防要根據西藏的情勢。\n\n五︰在執行協議當中，對違反協議的行為，西藏政府可以插手干涉。(注58)\n\n西藏噶廈根據西藏民眾大會的建議，向中國政府提出三個問題，並表示在得到中國方面的書面回覆後，即向北京發出擁護協議的電報。\n\n噶廈提出的三個問題是︰\n\n一︰軍政委員會和軍區司令部的職權。\n\n二︰政治、經濟、文化得到一定發展後，西藏全區的統一問題。\n\n三︰多麥地區歸屬西藏管轄的問題。(注59)\n\n張經武對西藏政府提出的問題除了重複中國政府的政策而外未做回覆。對西藏全部統一問題，張經武表示要由在青海、甘肅、四川、西康藏族人民投票決定，只要他們贊成即可，但目前初獲解放，一切尚未就緒，而且其他藏區解放早，工作進展快，現在還不能談統一。(注60)\n\n其後不久，在西藏東部和新疆的中國軍隊兩萬餘人進入西藏與印度邊界地區的日土、噶妥等地，逐漸侵占了江孜、日喀則、拉薩等城市，在西藏東北部集結了大量的軍隊，對西藏實施軍事佔領，由於中國勢力日趨強大，他們已經不願意與西藏政府就十七條協議再此展開談判，從而使達賴喇嘛和西藏政府已經失去對協議表示同意與否的自由。\n\n在簽定協議五個月後的10月24日，以達賴喇嘛的名義向毛澤東發出了擁護十七條協議的電報，其內容用詞都是由中國方面一手操辦的。當時達賴喇嘛基于西藏人民眼前和長遠的利益，除了與中國政府尋求合作而外，已經喪失了其他的選擇。\n\n西藏人民對協議和侵略者中國的不滿以各種方式表現出來，切斷電話線和砸毀電線桿上的瓷器以及在街上向遇到的中國人扔石頭、推擠、吐唾沫，張貼要求中國人離開西藏的標語等(注61)，幾萬名中國軍隊陸續抵達拉薩後，造成拉薩糧食價格暴漲十倍以上，是西藏面臨西藏歷史上第一次發生飢荒的危險。由於西藏人民的生活和中共官員的行為日趨惡劣，人民只好起來進行反抗，1952年3月31日人民召開會議，4月1日，千餘名藏人圍住中共代表張經武在拉薩的住處，高呼西藏獨立，中國人離開西藏的口號，并向西藏政府和中國代表呈交了有六條內容的請願書，中共指責人民會議是西藏上層反動集團頭子樂康瓦之懷恨在心以及帝國主義的陰謀。向西藏政府施壓，要求禁止人民會議的活動，撤銷兩個代總理的職務，(注62)因此達賴喇嘛不僅被迫下令禁止人民會議活動，而且也不得不讓最傑出的兩位代總理辭職，在西藏的中國官員雖然軟硬兼施，極力設法讓西藏政府和人民擁護十七條協議，但很明顯的並未達到目的。對此毛澤東于1952年4月6日的指示中指出︰『不僅兩個司倫，包括達賴在內的這個集團之大部分人認為協議是被迫簽定而並不情願執行，我們在目前不僅沒有全部施行協定的物質基礎，也沒有全部施行協議的群眾基礎，也沒有全部施行協議的上層基礎。』(注63)\n\n中國軍隊一進入拉薩，中國方面即開始竭盡全力地從三個方面進行削弱達賴喇嘛與西藏政府政治權力的活動，第一︰根據分而治之的政策在西藏人之間製造政治或地域矛盾。第二︰推展不為藏人所接受的政治、經濟制度的改革，以摧毀西藏的社會結構和基礎。第三︰在西藏成立北京政府的機構或由其控制的機構，賦予它們實質的權利，讓他們和原有的西藏政府機構一道工作，架空西藏政府，使西藏政府失去實質權利。\n\n為了削弱西藏反抗侵略的力量而在行政劃分方面採用分而治之政策，分割西藏，在康區和安多強加社會、政治和土地改革，同時不斷指責各宗教領袖和寺院，對此西藏人則以不斷升級的武裝反抗做為回應，在西藏東部強制進行所謂的改革開始，中國政府殘暴地掠奪藏人的財產，摧毀著名寺院的神像等，成千上萬的僧侶和宗教修行者被處死或投入監獄中，在肆無忌憚的暴虐下，忍無可忍的西藏人只好以武力進行反抗，西藏東部的康區和安多發生大範圍的武裝反抗運動，影響到1959年3月10日西藏首都拉薩發生的全國人民抗議暴虐，宣告西藏恢復原有的主權獨立，面對中共的鎮壓，西藏政教領袖達賴喇嘛和西藏政府噶廈以及無數人民被迫流亡國外，達賴喇嘛一到印度，即獲得自由發表言論的機會，1959年4月18日，在印度阿薩姆底租布向新聞媒體宣佈所謂的十七條協議是被迫簽定的。\n\n其後的6月20日，在麥索日的記者會上，達賴喇嘛再次宣佈，首先中國軍隊擅自侵入西藏是極其蠻橫沒有道理的，其後的協議西藏人也是在被迫無奈的情況下簽定的，決非藏人甘心情願而簽定。達賴喇嘛並指出即使這一強加的協議最後也是被中國方面逐步踐踏破壞了的。由此所謂的十七條協議也就失去了法律效力。\n\n1959年國際法學會提出的<<西藏問題與法律>>的文件中指出『1951年的協議由於是強制簽定，因此其無效的爭議是成立的。對1951年協議的另一個爭議是該協議中屬于中國方面遵守的內容均遭到破壞，西藏人也就沒有執行協議的義務，如果一方違反協議內容，則另一方可以對無法執行的協議提出已失去效力而停止執行。又1959年6月20日，達賴喇嘛在麥索日的記者會上回答記者提出的1951年的協議是否還有效的詢問時指出︰「根據中國人的意願簽定的十七條協議由於中國方面不予遵守，從而使協議失去效力，因此我們也無法認為其有效。」達賴喇嘛指出十七條協議已經無效，則西藏可以說恢復了其原來自由時的地位。\n\n總結\n\n1951年西藏與中國在北京簽定不平等的十七條協議以來至今已逾五十週年，在此之際，我們通過協議簽定的過程、中間雙方的分歧鬥爭以及最後中國方面破壞十七條協議，鎮壓西藏人民等歷史事實和國際法的原則，概要地說明了所謂的和平解放西藏辦法十七條協議不具有效力的事實。"
		},
		{
			"post_id": 4,
			"title": "简单介绍一下自由西藏运动",
			"date_published": 1523773312.506,
			"body": "自由西藏运动主要有2部分，或者说有2种不同的观点，也是2种不同的目标。\n\n一种是以达赖喇嘛为代表的“中间路线”，所谓“中间路线”是以与中共谈判，以和平的方式争取西藏的自治，并不追求脱离中国，并不争取独立建国。\n\n一种是以藏青会为代表的独立运动。追求西藏独立建国，也主张用武力争取达到独立建国的目标。不过藏青会也只是一种主张，目前并没有武力革命的行动。\n\n西藏一直有自己的流亡政府，并且流亡政府是选举产生的。达赖喇嘛只是精神领袖，并不是流亡政府的行政老领导。"
		},
		{
			"post_id": 3,
			"title": "简单介绍一下西方人对西藏的认知",
			"date_published": 1523770727.027,
			"body": "我在加拿大20年从来没有遇到过一个加拿大人认为西藏是中国的一部分，无论他对中国的历史，或者西藏的历史有多少了解。\n\n加拿大人普遍的认为西藏是在1950年被中国占领的。中国入侵西藏这是加拿大人的普遍认识。\n\n这点，与中国人自以为是的认为世界上大部分国家都承认西藏是中国的一部分是完全不同的。\n\n中国人普遍地只能认可自己的主观认识，或者只能认可与自己的主观认识没有冲突的客观事物，无法接受，或者无法认同与自己的主观认知有冲突的客观事物，这是中国文化的内在缺陷。"
		},
		{
			"post_id": 2,
			"title": "先简单介绍一下西藏与中国的关系",
			"date_published": 1523769519.959,
			"body": "西藏古时被中国称为“吐蕃”，这个“蕃”就是外国的意思，与“蕃薯”的“蕃”一个意思，外国来的“薯”称为“蕃薯”，一个称为“吐”的外国，称为“吐蕃”。\n\n吐蕃在历史上有时候是中国的敌国，有时候是“属国”。但一直不是行政区域，这个意思就是中国历史上从来没有设立过西藏刺史，西藏太守，西藏巡抚之类的官职。\n\n满清时期，吐蕃是满清的属国，这没有疑问。以上的历史也没有疑问。\n\n所以“自古以来，西藏就是中国的一部分。”这个说辞是没有根据的。"
		}
	]
}