{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1524431786,
			"title": "Книги серии \"Меганезия\"",
			"body": "На Флибусте появилась новая (III-я) часть \"Апостола Папуа\".\n\nhttp://www.flibusta.is/a/33681",
			"added": 1524431785
		},
		{
			"topic_id": 1524754909,
			"title": "GDPR как оружие массового поражения",
			"body": "_Источник: [Habr.com](https://habr.com/company/plesk/blog/354386/)_\n\n### Под угрозой все. Вообще все\n\nБытует мнение, что сочинение законов, которые нарушают практически все -- это изобретение нашей Родины. Но, как и со слонами, всё не так однозначно: при изучении [General Data Protection Regulation (GDPR)](https://www.eugdpr.org/) я понял, что в этом мы безнадёжно отстали от Европы. Шутка ли -- завиноватить одним махом весь мир! Думаете, вашей компании не предстоит прогибаться под GDPR? Я развею это опасное заблуждение.\n\nВ этой статье я не буду описывать все закорючки GDPR, знакомство с которыми первым делом порождает вопрос «А нельзя ли просто забанить всех европейцев?» (и это не шутка, так и спрашивают), но сосредоточусь на запугивании тех, кто до сих пор не исследовал вопрос влияния GDPR на свою работу, априори полагая, что находятся вне зоны поражения.\n\n![](https://habrastorage.org/webt/jn/am/te/jnamtetkl8tzwmwbzbnyorttc6g.jpeg)\n\nЯ технарь (program manager), поэтому пересказываю положения GDPR в применении к техническим аспектам, а не бумажному оформлению. И хотя я не юрист со специализацией на европейском праве, но потратил прорву времени на изучение GDPR и вполне разбираюсь в том, что пишу:\n\n-   читал сам закон;\n-   участвовал в семинаре по нему;\n-   читал официальные разъяснения к нему;\n-   читал частные мнения по поводу;\n-   читал судебную практику, из которой выросли некоторые новые положения этого закона;\n-   обсуждал всё это с нашим юристом-швейцарцем;\n-   и т.д.\n\nВ целом на погружение в тему ушло больше двух месяцев.\n\n![](https://habrastorage.org/webt/ts/lm/io/tslmiozncwya3mutwljyrbk7fxo.jpeg)\n\nИ такое «непрофильное» использование технического специалиста в данной ситуации неизбежно -- многие опасные места в продуктах или инфраструктуре не обнаружит никакой юрист, только технарь, одновременно хорошо ориентирующийся в технических решениях и понимающий GDPR.\n\n![](https://habrastorage.org/webt/fw/hm/od/fwhmodgz0f6-nthzfwm7blmglsi.jpeg)\n\nИтак, почему я утверждаю, что GDPR накрывает практически всех?\n\nТри аспекта:\n\n-   Расширенная география действия.\n-   Расширенное толкование понятия персональных данных.\n-   Под ударом и «контроллер», и «процессор». (Кто это?!)\n\nРассмотрим подробнее:\n\n### Расширенная география действия\n\n> GDPR применяется к обработке персональных данных, осуществляемой организациями, действующими в ЕС.\n\nКто расположен в Европе -- те давно в курсе. Но формулировки GDPR распространяют влияние намного шире:\n\n> Это также относится к организациям за пределами ЕС, которые предлагают товары или услуги частным лицам в ЕС / гражданам ЕС (независимо от того, требуется ли оплата).\n\nУ вашего бесплатного сервиса существует английская версия и регистрация пользователей (хотя бы только e-mail)? Поздравляю -- вы влипли. Те, кто активно продаёт свои продукты и сервисы на европейском рынке -- те уже знают про GDPR, а вот для бесплатных проектов это может быть сюрпризом. Так же сюрприз подстерегает тех, кто на европейском рынке как таковом не действует активно, но по факту часто обслуживает граждан Евросоюза (граждан, где бы они ни находились!). А так же тех, кто может быть обвинён в направленности на европейцев по формальным признакам -- достаточно перевести сайт на один из языков Евросоюза (английский, например) и принимать оплату в Евро (например, через какую-нибудь мультивалютную платёжную систему).\n\n> Это также относится к организациям за пределами ЕС, которые отслеживают поведение, происходящее в границах ЕС.\n\nА это вишенка на торте -- её подлость я раскрою чуть позже.\n\n![](https://habrastorage.org/webt/ar/et/6h/aret6hjirk2p7sm168khe6suzwe.jpeg)\n\n### Расширенное толкование понятия персональных данных\n\nНо даже если никакой регистрации пользователей нет -- знаете ли вы, что именно GDPR теперь определяет как персональные данные?\n\n> Физические лица могут быть связаны с онлайн-идентификаторами, предоставляемыми их устройствами, приложениями, инструментами и протоколами, такими как адреса интернет-протокола, идентификаторы файлов cookie или другие идентификаторы, такие как теги радиочастотной идентификации. Это может оставить следы, которые, в частности, в сочетании с уникальными идентификаторами и другой информацией, полученной серверами, могут использоваться для создания профилей физических лиц и их идентификации.\n\nОпаньки! Особенно интересно становится, когда понимаешь, что адреса интернет-протокола (internet protocol addresses) в GDPR -- это привычные нам IP адреса (IP addresses). Многие толкователи сего священного манускрипта, не мудрствуя лукаво, просто заносят IP адреса в список персональных данных, чем вызывают страшные пожары у технарей -- такая трактовка не совсем верна, но довольно часто совпадает с правильным ответом.\n\nИтак, в GDPR персональными данными объявляется не только информация, прямо идентифицирующая или позволяющая идентифицировать физическое лицо, но и та информация, которая, в совокупности с другой имеющейся или доступной информацией, с разумной вероятностью может быть использована для идентификации физического лица. Не удивлюсь, если в этом месте вы сломались -- со мной уже пытались спорить, что в законе не могут использоваться какие-то «вероятности», тем более «разумные»... По сути, в GDPR говорится следующее: «если имеющийся у вас набор данных в совокупности с доступными вам из других источников данными позволяют вам с разумными затратами ресурсов идентифицировать физическое лицо, то это персональные данные». Google имеет достаточно данных, чтобы идентифицировать почти всех -- значит он работает с персональными данными.\n\n![](https://habrastorage.org/webt/ry/ma/-c/ryma-c0k_u1zjr8w0elpr-dq-88.jpeg)\n\n### Под ударом и «контроллер», и «процессор»\n\nПереходим к самой сложной комбинации: регистрации нет, да и сайт только на русском, т.е. на оказание услуг гражданам Евросоюза не нацелен. Свободны? А вот и нет!\n\n> GDPR применяется как к «контроллерам», так и к «процессорам» -- контроллер указывает, как и почему обрабатываются персональные данные, и процессор действует от имени контроллера.\n\nНичего не поняли или вроде бы поняли, но не нашли где засада?\n\nОбъясняю:\n\nЕсли «выключатель» какой-то функциональности у вас в руках (в виде явной настройки или просто власти добавить функционал или нет), то вы «контроллер». А «процессор» -- тот кто получает персональные данные через вас или мимо вас, но по вашему решению.\n\nЧитаем выше про «персональные данные в совокупности» и про Google, а потом вспоминаем -- Google Analytics (или Яндекс.Метрика, или ещё что подобное) на сайте есть? Ну вот, Google «процессор», а вы «контроллер» и вы попали. Недавно Google [явно задокументировал это](https://www.google.com/about/company/consentstaging.html):\n\n> Если ваше соглашение с Google включает эту политику или иным образом использует продукт Google, который включает эту политику, вы обязаны предоставить определенную информацию и получить согласие конечных пользователей в ЕС.\n\nТеперь делаем следующий шаг -- вспоминаем «отслеживают поведение, происходящее в границах ЕС» и задумываемся ещё глубже: «А не бродят ли по моему исключительно посконному сайту русскоязычные туристы с территории Евросоюза?»\n\n![](https://habrastorage.org/webt/sl/vq/wu/slvqwuzbp_eammpejcoipdre-3m.jpeg)\n\n### Спасение утопающих --- дело рук самих утопающих\n\nА для тех, кто уже надумался сам на сам и желает переобсудить надуманное в кругу других страдальцев, мы организуем митап. На тему GDPR не продаём никаких продуктов или сервисов, мы такие же пострадавшие, так что будет предельно честный разговор. Анонс о митапе появится в ближайшее время на [meetup.com в Plesk-events](https://www.meetup.com/plesk-events/), в «заблокированном» [Telegram в чате NSK IT events](https://t.me/NSKITevents), в пока еще работающем [Facebook в группе NSK IT events](https://www.facebook.com/groups/nsk.it.events/). Для иногородних планируется трансляция.\n\nP.S.: И не верьте тем, кто обещает «Купите наш Х -- и станете соответствовать GDPR!» Равно как и тем, кто предлагает шпаргалки вида «пять простых шагов для соответствия GDPR». Достижение соответствия GDPR -- задача комплексная, а решения в каждом случае индивидуальны. И мы это обсудим.\n\n![](https://habrastorage.org/webt/3_/yu/bz/3_yubzlkbbjtnu5kfkcq9g1meiy.jpeg)\n",
			"added": 1524754907
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1525692962_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 1,
				"body": "Я не топикстартер, поэтому скажу как сам вижу.\n\n> [skgdzero](#comment_1_1CTdxmRMVgY51giu76kHReG5WNqGLSskqa): В этой виртуальной общей юрисдикции как решается вопрос взаимодействия с традиционными государствами?\n\nВначале — никак. То есть на этапе становления и начальном росте виртуальщина не должна конкурировать с государством. Иначе раздавят. Это должна быть какая-то независимая культура, которая прямо не угрожает государству. Государство, как правило тупое, инерционное и не заметит этот этап. А вот после набора силы можно уже и показать зубы. С разной степенью реакции, в зависимости от реакции государства.\n\n> Будут ли и если до то как эти ресурсы будут делится между гражданами меганезии?\n\nНапомню — наше государство виртуальное. Наши ресурсы — вычислительные и информационные. Когда/если возникнет конфликт с государством, лучше подчинить государство (возглавить, прийти к компромиссу и т.п.) и пользоваться его ресурсами.\n\n> Посещение и проживание на территории других государств - как решаются юридические вопросы визовых разрешений?\n\nВ виртуальном пространстве пока нет границ. Когда/если они возникнут — тогда надо будет смотреть на их вид и технологии.\n\n> Как осуществляется юридическая поддержка, если их полиция решит необоснованно обвинить тебя в преступлении ?\n\nНам нужны будут свои адвокаты. Это неизбежно.\n\n> Я так понимаю что самоуправляющееся сообщество подразумевает что ВСЕ граждане будут участвовать так же и в судебных делах, общим голосованием выносить вердикт.\n\nНе обязательно. В настоящей Меганезии вопросы решают локальные судьи. Спорные случаи, включая вопросы руководства — верховные судьи.",
				"added": 1539298931
			}
		]
	},
	"comment_vote": {}
}