{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1577499241,
			"title": "Hong Kong",
			"body": "does anyone know what's happening. \ni.e. what's China doing",
			"added": 1577499240
		},
		{
			"topic_id": 1577593821,
			"title": "\"Deniable\" Cimate change",
			"body": "https://www.abc.net.au/news/2019-12-29/people-told-to-leave-east-gippsland-as-bushfire-risk-rises/11831304",
			"added": 1577593819
		},
		{
			"topic_id": 1578557098,
			"title": "money creation",
			"body": "can money be created or generated",
			"added": 1578557095
		},
		{
			"topic_id": 1578622228,
			"title": "Trump",
			"body": "why did he back down. \nis it he is scared of Iran's ally Russia",
			"added": 1578622224
		},
		{
			"topic_id": 1578622553,
			"title": "RE: Money creation",
			"body": "so following on from the topic. So money cannot be created by an average person. Well delving deeper is there any legit sites that have working leaked CCs",
			"added": 1578622548
		}
	],
	"topic_vote": {
		"1576672826_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1
	},
	"next_comment_id": 21,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "> [draugrdeathlord](#comment_13_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Nope\n\nnope",
				"added": 1577428415
			}
		],
		"1576672826_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 2,
				"body": "> [randomshits](#comment_347_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): People don't seem to understand what it means to have reached the potential of this planet's resource output coupled with a sustained population growth with littler concern or preparations for sustainable living,, it would only be natural to expect far worse to come.\n\ngot to branch out into space",
				"added": 1577479619
			},
			{
				"comment_id": 3,
				"body": "there must be no limit to what China will do",
				"added": 1577479722
			},
			{
				"comment_id": 4,
				"body": "> [anonymouslogin](#comment_171_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Call up Elon. It's expensive, but I believe he will make it to Mars inside of two decades.\n\nanything to do with space is",
				"added": 1577498809
			}
		],
		"1577433117_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 5,
				"body": "expansion into space",
				"added": 1577498955
			}
		],
		"1576584251_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf": [
			{
				"comment_id": 6,
				"body": "> [nickwa](#comment_495_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): The clearnet understood more during the wild west days. When normies got on, it changed, and then became more about looking good for others. The reason ZeroNet will be different is because ZeroNet has a barrier to normies in how you access the content. You can still find intellectuals on the clearnet, but its harder to find, and only in more niche communities.\n\nmay be true but it's more like a community here more connected",
				"added": 1577499135
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 7,
				"body": "> [fke13](#comment_70_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): It can not possibly stay like that. It's the people, who determine, what the content in ZeroNet will be.\n\nyeah but we get the de voiding crap though",
				"added": 1577503504
			},
			{
				"comment_id": 8,
				"body": "> [fke13](#comment_71_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Your argument is that it is such a bad business environment for the medieval age \"reader-writer profession\", because nowadays almost everyone can read and write.\n\n+1 same thing we have taxis even though we could drive",
				"added": 1577503690
			}
		],
		"1577499241_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 9,
				"body": "> [edgelordofdecent](#comment_364_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): testuser3 can tell you. He posts a lot about what is going on.\n\nwhere would I find it",
				"added": 1577511037
			},
			{
				"comment_id": 10,
				"body": "maybe Britain should of fought to keep Hong Kong",
				"added": 1577593075
			},
			{
				"comment_id": 11,
				"body": "> [luoyewuheng](#comment_4_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN): 美国陷入内部政治斗争；种族歧视；强权政治；资本控制舆论随意抹黑；中国人在推特和facebook的反抗言论的相关账号遭批量删除还被美狗随意抹黑，美帝还意图干扰中国内政，你们以为中国是伊拉克？至于美帝为什么要花那么多资金打伊拉克我至今搞不懂，你们搞懂了？你们以为打击香港，试图冲击港币体制进而疯狂敛财就可以打击中国经济？那是1997年以前而不是2019年。你们美国政府的理念与世界发展背道而驰，建议闭关锁国。中国的香港，台湾和西藏问题全都都在预料之中，也是历史的遗留问题，因此出现了一带一路，中国喜欢交朋友，不喜欢到处签合约乱结盟。美政试图控制舆论打击中国经济，美政没做到，看来特朗普会相当失望，没想到中国会把香港问题长久的控制在香港范围内吧。中国的领土权是最后的底线，特朗普政府不是很牛逼？把战舰开过来试试？\n\n\nGoogle version \nThe United States has fallen into internal political struggles; racial discrimination; power politics; capital control public opinion has been arbitrarily discredited; Chinese accounts on Twitter and Facebook's rebellious speech have been deleted in batches and discredited by American dogs. Think China is Iraq? As for why the US emperor spent so much money in fighting Iraq, I still don't understand it, do you understand? Do you think that hitting Hong Kong, trying to hit the Hong Kong dollar system and then madly accumulating wealth can hit the Chinese economy? That was before 1997, not 2019. The idea of ​​your American government runs counter to the development of the world and proposes to shut down the country. China ’s Hong Kong, Taiwan, and Tibet issues are all expected, and they are also a legacy of history. Therefore, the Belt and Road Initiative has emerged. China likes to make friends and does not like to sign contracts and make alliances everywhere. The US administration is trying to control public opinion to crack down on the Chinese economy. The US administration has failed to do so. It seems Trump will be quite disappointed. I did not expect China to keep the Hong Kong issue under the control of Hong Kong for a long time. China's territorial rights are the bottom line. Isn't the Trump administration very aggressive? Drive the battleship over and try?\n\nBing version\nThe United States is mired in internal political struggles; racial discrimination; power politics; capital controls public opinion is being smeared at will; Chinese's twitter and Facebook accounts of resistance speech have been bulk deleted and the Us suisted by the US, and the US emperor is also trying to interfere with China's internal affairs, do you think China is Iraq? As for why the United States emperor spent so much money to fight Iraq I still do not understand, you understand? Do you think that hitting Hong Kong and trying to hit the Hong Kong dollar system and then amassing money can hit the Chinese economy? That was before 1997, not 2019. Your U.S. government's philosophy runs counter to world development and suggests closing the country. China's Hong Kong, Taiwan and Tibet issues are all expected and a legacy of history, so there has been an Belt and Road, and China likes to make friends and don't like to sign contracts everywhere. The U.S. government is trying to control public opinion to hit China's economy, the U.S. government failed to do so, it seems that Trump will be quite disappointed, did not expect China will put Hong Kong's problems in Hong Kong for a long time to control the scope of Hong Kong. China's territorial power is the bottom line, the Trump administration is not a bulldozing force? Drive the warship over and try it?",
				"added": 1577593574
			}
		],
		"1577575267_18geLXyGaD6oU3wBj7GXVpqP9Wk1QzGtC8": [
			{
				"comment_id": 12,
				"body": "wtf",
				"added": 1577594292
			}
		],
		"1578547730_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 13,
				"body": "right...",
				"added": 1578557043
			}
		],
		"1578622228_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_1673_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Maybe he's only meeting the globalists halfway so they don't assassinate him, plus his ass was nearly on fire.\n\nwho are they",
				"added": 1578622599
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_1675_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Rothschilds, Bildeberg Group, Bohemian Grove, Skull and Bones Society,  etc.\n\nand how would they assassinate",
				"added": 1578622747
			},
			{
				"comment_id": 17,
				"body": "> [styromaniac](#comment_1676_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): They did Kennedy in. They want the world.\n\nwhy",
				"added": 1578622804
			},
			{
				"comment_id": 18,
				"body": "> [styromaniac](#comment_1677_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Do the research on any video site.\n\nwell I see no proof just crack pot theories",
				"added": 1578622909
			}
		],
		"1578622553_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_1674_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Coagulated cummies? That would be your mom.\n\nCCs=credit cards",
				"added": 1578622680
			},
			{
				"comment_id": 20,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1612_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): hopeless moronWhy should we help you 'make money'?What's in it 'for me'?\n\nfree money",
				"added": 1578623076
			}
		],
		"1578171577_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 19,
				"body": "tick tick tick",
				"added": 1578622990
			}
		]
	},
	"comment_vote": {
		"171_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"71_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1
	}
}