{
	"next_comment_id": 14,
	"comment": [
		{
			"comment_id": 1,
			"body": "genial!!! ahora nos conocemos todos!!! y gracias por editar la wiki",
			"post_id": 209,
			"date_added": 1479003026
		},
		{
			"comment_id": 2,
			"body": "jajaja, si, lo más normal es no ver lo que tenemos ante la nariz :) vemos ZeroHello a cada momento y a nadie se le ocurrió clonar y retocar :) \n\nPOsdata <i>lectura recomendada: La carta perdida, Edgar Alan Poe</i>",
			"post_id": 212,
			"date_added": 1479042388
		},
		{
			"comment_id": 3,
			"body": "he!! como dicen los mendigos andaluces: \"dame argo\" :)  documenta porfa eso de como administrar los cometarios.",
			"post_id": 210,
			"date_added": 1479043737
		},
		{
			"comment_id": 4,
			"body": "Lista de desertores :)\n\nZorriko,Zorrito, (se donde chateas)\nMamaLibre (se donde microblogueas)\nXikuZero (se donde chateas, donde microblogeas y más)\n\nYa podemos extorcionarlos para que cumplan con su deber :)\n\n",
			"post_id": 209,
			"date_added": 1479044133
		},
		{
			"comment_id": 5,
			"body": "Bueno, no olvides que spydroid no es GNU pero si linux, sin duda la peor distro linux, una asquerosa utilización del kernel linux, por lo tanto...",
			"post_id": 214,
			"date_added": 1479217756
		},
		{
			"comment_id": 6,
			"body": "> [cer](#comment_38_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Justamente no habia pensado en Spydroid... sino en Linux Arch o algo parecido\n\neso digo, si se puede instalar spydroid que usa el nucleo linux, se podrá intentar con otro linux,  supongo que se tratará de averiguar que kernel contiene más drivers para tablets, en caunto lo logres pon unas capturas :)",
			"post_id": 214,
			"date_added": 1479257045
		},
		{
			"comment_id": 7,
			"body": "secundo!",
			"post_id": 222,
			"date_added": 1479731069
		},
		{
			"comment_id": 8,
			"body": "Uno de los más formidables actos de hacktivismo conocido fue cuando Aaron Swartz y sus secuses crearon un sistema de peticiones online para parar la ley SOPA que incluía un sistema para llamar y enviar faxes gratis a los legisladores. ¡¡¡funcionó, pararon la ley sopa!!!! ",
			"post_id": 223,
			"date_added": 1479859846
		},
		{
			"comment_id": 9,
			"body": "\"En mi humilde opinion, la union de soluciones estilo MESH, redes libres independientes o paralelas a la internet tradicional, con sistemas de descentralizacion, distribucion, cifrado, anonimo, privado, ciudadano y sin necesidad de servidores sera probablemente el mejor camino para salir del emcierro en que nos encontramos.\"\n\nAmén!!!\n\n",
			"post_id": 280,
			"date_added": 1480803253
		},
		{
			"comment_id": 10,
			"body": "Podemos elegir nuestro menú mconlads y como dice Galeano, podemos elegir con que salsa nos han de comer, pero eso de que no nos cocinen no es opción. \n",
			"post_id": 281,
			"date_added": 1480990778
		},
		{
			"comment_id": 11,
			"body": "\nHe aquí interesante reflexionar separadamente sobre el concepto “enciclopedia colaborativa” y sobre “wikipedia” en particular.  \n\nEl concepto de  enciclopedia colaborativa es muy interesante ya que enraíza en concebir el conocimiento como algo dinámico, como algo por descubrir, como algo que construir y no como algo preexistente a difundir, también está basado en la horizontalidad y no en pirámides intelectuales.\n\nEn el primer factor wikipedia intenta cumplir pero nunca podrá hacerlo por no basarse en el segundo principio nombrado. El pecado original de wikipedia es su base fundacional: “wikipedia no es fuente original” lo que quiere decir que todos los artículos (todas sus partes) han de tener referencias externas de fuentes conocidas  osea del sistema establecido. Y para peor esto queda a criterio de una casta meritocrática, toda fuente no conocida por esta casta o en la que esta casta no confíe es descartada y el contenido que estas sostienen también. \n\nPienso como tu que hacen falta otras enciclopedias colaborativas, no una que haga sombra a wikipedia,    hacen falta muchas por que me temo que la neutralidad humana no existe,  y me da que han de ser p2p, con algunas herramientas más de administración, notificaciones de modificaciones por ejemplo, bloqueo de usuarios y unos detalles más ZeroWiki puede ser una gran, gran herramienta de conocimiento compartido. \n\nPero no debemos olvidar que en todo caso, la lectura siempre ha de ser crítica y no debemos tomar ningún medio ni autor como santa santorum, y mucho menos a wikipedia. \n\nPosdata: wikipedia y su software wikimedia no es la primer enciclopedia colaborativa, muchos años a el camarada  Aaron Swartz a sus 10 años creo una enciclopedia web colaborativa, donde todo ser conectado a Internet podía publicar y editar artículos libremente,  los sabiondos lo trataron de loco ¿para que puede servir eso? si cualquiera puede editar todos los artículos serán erróneos :). En wikipedia olvidan esta parte que para el caso me parece algo relevante sobre la vida  y los trabajos de Aaron, apenas dicen algo como hizo softwares educativos colaborativos :) tendré que documentarme y editar. ",
			"post_id": 288,
			"date_added": 1481656589
		},
		{
			"comment_id": 12,
			"body": "En la última versión de desarrollo  0.5.1 (rev1786) se crean sitios nuevos vacíos en un click desde el menú ) ya antes comentamos esto de que este es un desarrollo muy rápido ) \n",
			"post_id": 16,
			"date_added": 1481923722
		},
		{
			"comment_id": 13,
			"body": "Ya tengo trabajo para esta noche... ¡te odio Cer! :)",
			"post_id": 295,
			"date_added": 1482240889
		}
	],
	"comment_vote": {},
	"post_vote": {
		"206": 1,
		"223": 1,
		"279": 1
	}
}