{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1572121659_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "You have to laugh at all the chimpout videos though.",
				"added": 1572218233
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_1162_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Haven't heard of them and I don't want that in the tailored algorithm.\n\nNice to meet you too, thanks for the nod to my post in the other room.\n\nWhat's this tailored algorithm you speak of? Do yeee be needing coders? I beee in need of a job you see.",
				"added": 1572221995
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 2,
				"body": "Well guess what, your grandkids are all going to be niggers thanks to demographics and Zionist brainwash telling white women to racemix more.",
				"added": 1572218437
			}
		],
		"1572028122_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 3,
				"body": "Yeah new here just got Zeronet working on this remote system, is this where all the cool kids hang out, I take it even though you have the free speech to say nigger shit fuck cunt dick wank kike gas the jews hitler did nothing wrong....\nYou seem passed all of this, i.e. even though you have the freedom here to say whatever you want without fear of shadowbanned you choose not to. Curious.\n I can see more people will migrate to Zeronet in the future, there's a genocide happening right now. Mathematically impossible to get an affordable wage, lack of affordable housing, mass unemployment, mass homelessness, mandatory vaccinations, chemtrails, GMOs, 5G, police shooting people dead in the street, Where is epstein's body? Is the Earth a level plane or a ball 6,371km in radius? What's ACTUALLY in area 51? Was the New Zealand mosque shooting a staged event to grab people's guns? Why is anyone who quotes verses from the Talmud immediately silenced? Why are Ashkenazi Jews all in positions of power in media, banking, politics, television, military industrial complex, mass surveillance?\n What happened to Bin Laden's body? Who really did 9/11? Where are Saddam's Weapons of mass destruction? Why is there fluoride in the water? Why do the Jesuits IHS Society of Jesus control all the observatories and what are they hiding in the Vatican archive? Why is it forbidden to even talk about the aether but you must conform to the belief in virtual particles that nobody's seen?\n Why are so many more people autistic, studies that show links between autism and the vaccines are attacked so fiercly and hollistic doctors supporting it are being suicided.\n Why is the entire internet right now under total lockdown of free information, what is really going on? What are they desperately trying to hide?\n\n Thank you for reading my rant,",
				"added": 1572219653
			},
			{
				"comment_id": 8,
				"body": "> [bb6]\nHow do you know it's round? You're not seriously saying there's wind on the moon to wave the flag now are you? Where's the curvature? Scientifically prove gravity? Measurement of Radius 6,371km when deepest hole ever dug is 12.3km deep? Sticks and shadows prove the Sun is 150millionkm away with no refraction? No more land to discovere, you ever looked? Why are all the border regions on google maps all skewed and squished? You think those images from \"space\" are real? You think that map you got is real? You ever actually measured it yourself? No you haven't. So how do you know?\nTalmud clearly states verses like: \n\"Jews may lie to non-Jews, Baba Kamma 113a\", \n\"Non-Jews are not human, Baba Mezia 114a-114b Only Jews are human\" \n\"OK to cheat non-jews, Sandhedrin 57a\"\n\"Jews have superior Legal Status, Baba Kamma 37b\"\n\"Aboda Zarah 36b Gentile girls are in a state of niddah (filth) from birth\"\nSo why do you trust information that comes from people who view you as an animal and for thousands of years have preached it's fine to lie to you because you're a dirty goyim.\nWell obviously Area 51 is full of experimental weapons, but prove they haven't been reverse engineered from the shapeshifting reptillian aliens, or the giants behind the ice wall, or the zeta reticullans, or the top secret Operation Paperclip Hamaburi program, or the Nephillim, or the angels or from Satan?\nIf the Aether isn't real, then what empty space full of when it has properties like permitivity, magnetism, dielectricity, \"gravity\", resistivity, impedence, light?\nFluoride in water also has studies that show it gives bone cancer in mice!\nYou clearly haven't looked at all the immunization failures, the fact the DTAP insert itself says it can cause autism, blind, independent, non pharma funded, peer reviewed studies now exist comparing vaccinated to unvaccinated children between 6 and 12 years old and the vaccinated population were 4 times more likely to have autism, ADHD, 20 times more likely to develop allergies. Now they are mandating vaccines and even putting ID2020 microchips in them forcing them on the homeless.\nEpstein, mosque shooting, 911 and bin laden meh?\nSo a billionairre pedo is on the loose and you don't even know where his body is?\nThe Mosque shooting being totally staged, people locked up for a video that proves how fake it all is whilst NZ and AUS hand over their guns ripe for wholesale slaughter at ease by the ZOG?\nBin Laden's body fell into the sea? No we can't show you the photos they are too graphic?\nAmerica blowing up their own buildings with MOSSAD's help to bring in the patriot act, war of terror, warrantless wiretaps and that's all MEH to you?\nYou are one sleepwalking mouthbreathing knucklehead I swear!\nHow much research have you actually done?",
				"added": 1572313708
			}
		],
		"1572281379_1KJWLBhkwmtbUH2zhcbfWinQK9kJ4Kosfb": [
			{
				"comment_id": 5,
				"body": "You do realise that left and right is just a game of hegellian dialectic played by the Government against the masses to conduct divide and conquer psychological warfare?\nProject Veritas did some outstanding work on this and they shut them down after they exposed the DNC, the abortion clinic selling baby parts to vaccine manufacturers and Google with their ML Fairness orwellien mass censorship automation.\nUndercover investigation is really hard now, nobody trusts each other, people are more divided, more isolated, thier guard is up now more than ever. To sit down and have a conversation with someone is almost impossible unless you are giving out free drinks and you have a massive bag of weed and you have the cops on the payroll.\nThe fact you're recruiting on the Zeronet for this kind of shit tells me you're desperate, also I doubt you have the cash to pull off this kind of thing.\nAlso you're just going to get Antifa saying \"the evil nazis are doing this, let's get them\" and you go into attomwaffen they will say \"the evil jews are doing that, let's get them\" Tell me why don't you recruit someone to infilitrate George Soros or Rothschild or the Bankers? Because you're likely just instigating the same time old divide and conquer routine done since at least the time of Rome.",
				"added": 1572282673
			}
		],
		"1572299410_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 6,
				"body": "The military stopped using it, it's slow and insecure, didn't help Dread Pirate Roberts, did it?\nCase and point.\nHow robust zeronet turns out to be remains to be seen, so far so good, only downside is there aren't too many people using it. A lot of very smart people, not a lot of common ground.",
				"added": 1572300960
			},
			{
				"comment_id": 7,
				"body": "> [filips](#comment_277_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Tor is open source so you can check its source code if you want. [...]\n\nSo use GPG then.",
				"added": 1572303598
			}
		]
	},
	"comment_vote": {
		"21_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"1161_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}