{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1612299574,
			"title": "Please, don't download Linux or open source messenger from ZeroNet",
			"body": "I just browsed a bit through ZeroUp and there are quite some Linux ISOs and open source messenger/chat apps. Don't download these things here, it's dangerous. Get this stuff from the developers websites/repositories etc.",
			"added": 1612299573
		}
	],
	"topic_vote": {
		"1610045007_1Dt486kkbdhZktV8JXcv7F9YqpSNBAsxYt": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1609922680_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 1,
				"body": "Bitcoin and basically every cryptocurrency is completely built around encryption. If you mean anonymity then that's a different topic. You can have a Bitcoin address which is not in any way connected to your identity at all. Theoretically you can create one with pen and paper if you know the algorithm and use dice or coin flip for randomness. You can send BTC to that address. Only when you want to send BTC from that address to another you have to use software connected to the internet. You would need an anonymous way to buy and/or send BTC to that address so the address can't be tied to your identity.",
				"added": 1610038255
			},
			{
				"comment_id": 2,
				"body": "> [mentos](#comment_27_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK): Sorry for the confusion, I mean do they both (or individuals) use any sorts of encryption for communicating with each peers?\n\nAh, I see. I don't know about that but since all the data on a blockchain can be verified cryptographically I guess it doesn't matter. The data isn't secret in any way and nodes sending wrong/manipulated data can be identified via consensus and then be ignored",
				"added": 1610110297
			}
		],
		"1610152196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "Do we really want him here?",
				"added": 1610153792
			}
		],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "> [theborg](#comment_18_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): Its everywhere.You just need to look.\n\nPretty much what everyone ever said if there was no proof.",
				"added": 1612300188
			},
			{
				"comment_id": 8,
				"body": "> [theborg](#comment_19_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): I really dont want to try and prove anything to you because its very hard to show people that are looking\n\nMy statement didn't rule out that there is proof. But \"Its everywhere.You just need to look\" is still what everyone ever said if there was no proof.\n\nYou still provide no evidence because \"its very hard to show people\". With good evidence it's pretty easy to show people!\n\nAnd the book, well I can't tell anything from a book cover. But you seem to have (read) it so why don't you provide us with the sources section of that book. Or is it just full of claims and phrases like \"open your eyes, it's everywhere\".\n\nIt's obvious to flat earthers that the earth is flat. It's obvious to moon landing denyer that there was no moon landing. It's obvious to vaccine critics that vaccines cause autism. It's very obvious for many people that homeopathy works. It's very obvious for many, many people tht there is a god. It's very obvious to many people that [fill in idea without proof]!",
				"added": 1612615810
			},
			{
				"comment_id": 9,
				"body": "> [theborg](#comment_27_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): Lol, you seem retarded. You sound like the U.S media claiming there's no evidence of election fraud. Believe whatever you want, I don't give shizzle. The truth is obvious to everyone that wants to know it.\n\nThanks for prooving my point. \"The truth is obvious to everyone that wants to know it.\"\n\nQuoting myself:\n\"It's obvious to flat earthers that the earth is flat. It's obvious to moon landing denyer that there was no moon landing. It's obvious to vaccine critics that vaccines cause autism. It's very obvious for many people that homeopathy works. It's very obvious for many, many people tht there is a god. It's very obvious to many people that [fill in idea without proof]!\"",
				"added": 1613310509
			},
			{
				"comment_id": 10,
				"body": "@theborg:\nI don't ask for hundreds of pieces of evidence and hours of work on your side. Give us just one, give us your best one. If your best one isn't sufficient then hundreds won't be anyways...",
				"added": 1613310812
			}
		],
		"1612299574_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": [
			{
				"comment_id": 5,
				"body": "> [asdf111](#comment_10_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN): well, it would be safe if it would use a hash that can be verified on the developer page\n\nTrue. But then why not download from there in the first place?",
				"added": 1612300747
			},
			{
				"comment_id": 6,
				"body": "> [orien3242](#comment_68_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): You know it might be a good idea to share the offical magnet links for official ISOs. The whole point of zeronet is to literally replace the normal old internet and make it uncensorable.\n\nWell, the internet is basically just computers and routers. So the essence for torrenting and ZeroNet as well.\n\nI get that you mean the server/client structure and I'm on your side here. I started using freenet (not anymore) and I2P ~12 years ago. I really like decentralized systems but there might be some problems.\n\nThink about the normal user searching for this new fancy app or some Linux distro. Using google or some other search engine the chance is pretty high they get to the correct download. Now imagine everyone uses ZeroNet tomorrow and the same user tries to download some software. Since all the scum will be on ZeroNet as well I guess chances are way higher this user downloads some shit.",
				"added": 1612303367
			},
			{
				"comment_id": 7,
				"body": "> [orien3242](#comment_69_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): Sorry to burst your bubble but your hypothetical will LITERALLY never happen. Even in the wake of big tech censorship, WSB, and internet shutdowns in oceanic countires tor and zeronet traffic have not significantly increased.  [...]\n\nI could scream when I watch some of my friends/family using the internet. They don't care what they download as long as it runs in the end everything is fine for them. I saw it often enough on freenet/I2P that there are dubious ISOs with a lot of seeders, so... it has nothing to do with \"thinking\" or opinion. I know.\n\nLinux distros provide where they see fit but they can't have official mirrors repos everywhere. There are for example official .onion debian mirrors. But distributions can't just have a repos everywhere. Tor, I2p, freenet, ZeroNet, retroshare, IPFS, thahoelafs. These are just from the top of my head, there are more possible places for people to download danger stuff.\n\nFinally, what bubble? I never said ZeroNet or other networks will go mainstream.",
				"added": 1612614722
			}
		],
		"1613332768_1KKDj2JuKJ1M6SsUyTuFG4Wbndu7Y7XAJr": [
			{
				"comment_id": 11,
				"body": "Do people really fall for this?",
				"added": 1613718580
			}
		],
		"1613761105_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 12,
				"body": "Gold isn't modern at all, it's old school as it can get. But you should still have some from both in my opinion",
				"added": 1613763958
			}
		]
	},
	"comment_vote": {
		"1_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": 1
	}
}