{
	"title": "茶杯小生",
	"description": "喝点什么?",
	"links": "- [ZNSC >>](https://github.com/HelloZeroNet)\n- [零网教学 >>](http://127.0.0.1:43110/1NCezLP8aXjABVreBB1CKGPub2tKTtyhWU/?Page:home)\n- [土也 >>](http://127.0.0.1:43110/1BAHxSB47wUKh1XQjWXFc5jiB324j1usw5/)\n- [TWC >>](http://127.0.0.1:43110/codegass.bit/)\n- [kaffiene 搜索 >>](http://127.0.0.1:43110/kaffiene.bit/)\n- [零蛋 >>](http://127.0.0.1:43110/1Fftqx7RuXCKw8haAQGex362GxvJYfW6bB/)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1490438846,
	"post": [
		{
			"post_id": 4,
			"title": "大数据小话：大数据的一天",
			"date_published": 1490438738.662,
			"body": "马克思说过：资本家是靠剥削剩余价值来获取利润的。这句话在今天有了新的含义，因为在大数据时代，人最可宝贵的已经不再是劳动时间，也不是贞节牌坊，而是——你身上产生的数据。无数的互联网巨头和大数据专家们，像欣赏鹿茸和牛黄那样，细细品味着你每天都去过哪里、吃的什么、买了几卷卫生纸，并用人工智能技术依次向你推送扎了洞的安全套和无痛人流医院。\n---\n　　什么，你觉得这些数据还属于你自己?我只能说你很傻很天真!让我们以某互联网屌丝小明的一天为蓝本，快来看看大数据时代是如何榨取你的数据价值的吧!\n\n　　小明在一家互联网英语教育公司工作，主要职责是写 bug。从阶级成分上看，他是互联网社会的最底层——码畜。小明不占有生产资料，也无法从数据变现的大碗里给自己捞一块肉，只能被动地、无可奈何地，象中世纪农奴给领主献上初夜权那样，主动扒光自己隐私的遮羞布，向码皇和资本献出自己的数据，还得呲牙咧嘴地摆出被大数据临幸后的满足感。\n\n　　一大早9点钟，小明刚一下地铁，手机就“叮”的一声送来了短信：“老爷爷家乡鸡望京店，现推出十元油条豆浆早餐，绝对不含二手地沟油!”奇怪，这推销来的这么精准，是怎么做到的呢?看来大数据大有可为啊!正好还没吃早点，干脆进去尝尝!\n\n　　【画外音：通过 GPS 或者蜂窝信号，可以测得手机移动速度，当用户在早上九点由高速运动变为低速运动时，可以判断是从地铁出来，这时候就可以向他推荐附近的早点了。】\n\n\n\n　　吃完了早点，小明满口地沟油的余香，慵懒地坐在了电脑边。这时，电话铃突然响了起来，接通后传来一个女生的声音：“请问先生您有提高英语口语的意愿是么?”咦，这不是同事小娜的声音么?怎么推销业务推销到公司内部来了?“是我啊，同事也不放过么?”小娜扑哧一声乐了，放下电话走到小明身边：“我们运营部昨儿新买了个软件，提交一组关键词上去，就能返回一批电话，打通一个才交几块钱，这比投搜索引擎便宜多了!”小明这才明白，原来自己昨天查过“口语培训”这点儿事，这么快全北京的英语班儿都知道了啊!\n\n　　【画外音：通过运营商 DPI 技术，可以截取搜索引擎的搜索行为，并将其与电话号码相关联。】\n\n\n\n　　上网转转，平复一下心情吧!可是不论打开新浪搜狐看看八卦，还是上个新华网学学中国梦，旁边总有一块狗皮膏药一样的广告，上面有个中段的美女，穿着十分简约，还配着一句广告词：“正品硅胶义乳，做女人挺好!”唉，都怪自己昨天为了对付指纹门卡，在某电商上看了几个“硅胶指纹模具”，这谁还有心思看新闻啊，还是关了罢!\n\n　　【画外音：根据电商的浏览、购买等行为，可以向用户追身投放广告，这称为重定向;今天，随着广告程序化交易的发展，不论你看哪个网站，只要该网站接入了 ADX，你就都别想跑了!】\n\n　　被大数据盯得这么紧，小明有点儿手足无措。好在饭点儿到了，为了尽可能躲开地沟油，小明踱出写字楼，晃进了对面的购物中心。美食城就在购物中心的四层，小明刚迈下扶梯，手机上的“小撮点评”应用就发出了一条提醒：“欢迎您光临吃了吐美食城，前方直行五十米右转，厕所对面的煎饼摊今日九八折优惠(不接受按揭)!”奇怪了，这应用怎么连我到四层都知道呢?再低头一看自己的安卓手机，似乎又明白了什么。\n\n　　【画外音：这是利用 Wi-Fi 定位技术实现的精准室内追踪。当你的安卓手机 Wi-Fi 处于打开状态时，会与周围的 Wi-Fi 热点握手，若干热点可以根据你的信号强度反算出你的位置，并与你的 MAC 地址相关联，精准度可达米级。苹果手机如果你打开了蓝牙，也可以实现类似的定位。通过买来的数据将 MAC 与设备号映射起来，手机上的应用就能在你走下扶梯的一刻作出反应了。】\n\n\n\n　　饭也没心情吃了，还是回去干活吧!小明翻出一份数据集，这是“朝阳区大数据教会”组织的视频推荐大赛提供的数据集，老板让小明先看看。小明心不在焉地一行行扫着，突然，下面这条数据让他眼前一亮：\n\n　　某甲，蓝猫淘气三千问(2016.1.15)、喜羊羊与灰太狼(2016.2.10)、熊出没(2016.2.16)...\n\n　　虽然名字隐去了，不过还用问啊，这条记录准是对面 cubic 小刚的啊!这家伙弱智得只看得懂动画片，还每天看了啥都到班上来讲讲。嗯?等会!除了动画片，后面怎么还有一串东洋岛国的爱情动作片儿?小明乐弯了腰，拿着电脑走到小刚面前：“看，这些片是你看的不是?”小刚当时就傻了，心下当然非常不爽，不过人家没有写自己的名字，还真是哑巴吃黄连。\n\n　　【画外音：即使没有姓名、电话这些个人可定位信息，对目标用户有一定背景信息了解的熟人，也通过互联网稀疏行为数据对应到个人从而获取更多隐私。新兴的“差分隐私”技术，也是为了克服这一难题。】\n\n\n\n　　一波未平，一波又起，小明刚刚坐定，电脑右下角的企鹅嘟嘟嘟叫起来，是小明的同学小宏，现在在某大互联网公司上班。“老同学，你上周去东莞干啥了?怎么还搜了'发廊'这个词?你可别犯错误啊!” “少废话，我上东莞是给公司出差去了，理个发还不行么?不对啊，你怎么知道的啊?” “嘿嘿，我在这边搜索团队啊，你不是拿手机号注册的我们应用么?” 小明放下电话，默默地删除了“盯梢搜索”这个应用。\n\n　　【画外音：绝非危言耸听，有很多互联网公司、甚至包括一些大公司，内部对数据使用规范性的管理混乱到了令人发指的程度。像上文这样的情形并不是虚构。】\n\n　　“小明的快递!”门口又响起了熟悉的快递员喊声，“到付的，一百块钱!”小明一时想不起来是什么，不过经常在网上买东西，到付的也不少，也就没多琢磨。把一百块钱递给快递员，一边往回走一边拆包裹：纸盒子里面拿出个泡沫塑料袋，泡沫塑料袋里面是个牛皮纸包，牛皮纸包里面是个牛皮纸袋，牛皮纸袋里面有个信封儿，信封撕开一开，有一张小纸条，上书两个大字：“挠挠!”小明当时两眼发直，一口血差点喷在纸条上，这么个玩意儿就蒙了我一百块钱啊!\n\n　　【画外音：不法分子通过各种手段批量买到用户的地址和电话，通过发到付快递的方式可以大规模获利，至于数据从哪儿买到的，前一段某电商数据部门被开除的事儿，您还有印象吧!】\n\n\n\n　　天黑了，终于熬到了9点的下班点儿，“嘟嘟”打车软件如约发来消息：“您下班时间快到了，要不要再给您预约去 ** 会所的专车呢?“小明心说：”那是昨天跟老板陪客户去的，天天去哪有那美事儿?我还是骑着单车奔城乡结合部租的 8 平米小复式吧!“\n\n　　【画外音：根据个性化数据进行的推荐，应该在没有用户主动意图时尽量保守一些，否则会带来不好的体验，也会让更多人质疑隐私使用的合法性。】\n\n　　好容易到了自己租的小屋，可以忘掉这惊悚的一天了吧!小明想蹲会儿马桶，一个人静静。屁股刚往马桶圈上一沾， 胯下的大数据智能马桶就开始发言：“根据您的毛细血管进行光学臀相分析，发现您血色稠暗，可能是二手地沟油摄入过多;另外臀堂发暗，可能是被人窥视私密之事受惊吓所致，建议您珍爱生命，远离地沟油和大数据!” 当时，小明吓得便意全无，不由得抬头望了望窗外的繁星，似一串串 0 和 1 那般闪烁跳跃，顿觉在大数据时代，虽有大地之广，宅院之深，却无半点屌丝立锥之地......\n\n\n\n　　亲爱的朋友，您在大数据时代的一天，又是如何度过的呢?欢迎来稿分享您的数字人生，把更多的负能量传递给全社会吧!\n."
		},
		{
			"post_id": 3,
			"title": "如何构建自己的密码",
			"date_published": 1485835209.336,
			"body": "原理很重要，技巧是浮云，抛砖引玉，且看且思考。 \n---\n> 来源： http://k162.space/password_strategy/ http://www.chinagfw.org\n\n##一、为不同的账户类型制定不同的密码策略\n### 1. 账户类型\n首先我们可以很容易把账户分为两类：重要账户与一般账户。 分类是为了制定密码策略，因为这两类账户的密码需求是不一样的。 这个分类不绝对，可以自行斟酌，比如微博微信都可以放在重要类别。\n\n重要账户是指涉及个人重要隐私或者财产的：\n银行、社保、支付宝、QQ、手机pin码...\n\n一般账户指各种论坛、社交媒体、产品使用授权等：\n微博、微信、天涯、知乎、星巴克、路由器、WIFI、宽带...\n\n### 2. 密码策略的基本原则\n不同账户采用不同密码\n若密码相同，一个账户密码泄露了就要改所有账户的密码，显然是下下策。\n目前个人密码最容易被泄露的一种情况是——撞库。简而言之，就是你注册了网站A，又注册了网站B,C... 结果 C 网站不幸有漏洞，被黑客收集了用户和密码信息，然后黑客就用这个去尝试登陆网站A,B，尝试批量登陆其他网站后，得到一系列可以登录的用户了。这类情况其实非常常见，必须谨慎对待。\n\n越高的密码复杂度越安全\n\n密码的复杂度并不是指密码看起来越长越无序越安全，而是指采用数字+字母+符号的组合形式，不要小看一个符号，这种混搭的形式将极大的提高破暴力解难度。暴力破解又叫做穷举法，是指一个个试密码，逐个推算直到找出真正的密码为止。\n\n例如一个已知是四位并且全部由数字组成的密码，其可能共有10000种组合，因此最多尝试9999次就能找到正确的密码。若加入符号，可以极大提高密码组合的可能，因此能有效防范暴力破解。通常来说，真正通过暴力破解来攻破个人密码的情况不多，但不管怎样，提高复杂度总是好的。\n\n尽可能方便记忆\n\n掐指一算自己注册的论坛就有十几个，可如果不同账户采用不同密码，怎么可能记得住这么多密码呢？别急，先仔细想想自己是不是真的需要记忆那么多密码。根据我们的账户类型，我们可以采用不同的密码储存方式，忘记密码这种事自然是不能忍的。\n### 3. 重要账户的密码策略\n这类账户的密码一般只允许使用数字，例如银行，支付宝，通常这类账户不担心被暴力破解，他们有防范机制，输错几次密码后便不能输入了。因此，密码复杂度不是第一位的。重要密码需要满足：\n\n便于记忆\n\n心里熟记，同时写个小本放家里存着，以备不时之需\n没有明显规律\n\n`绝对不要用生日，111111，123456，000000 这类大众密码。`\n\n 越无序越不容易被人猜到。\n当然还有绝对不要跟一般账户的密码相同，谨记不同账户采用不同密码的基本原则。\n\n### 4. 一般账户的密码策略\n这类账户其实我们经常会用到，但记忆其实不是第一位的，我们完全可以做一份密码表，需要的时候用下即可。一般这类账户的密码做到相对独立和高复杂度即可。关于密码表的安全性后面有详述。\n相互独立\n前面已经提到，为防范撞库，这类账户密码要做到相互独立。\n复杂度高\n网络账户容易被暴力破解，因此要复杂度越高越好\n## 二、根据自己的策略进行密码构建与储存\n绝佳的密码无外乎就是好记又不容易被人猜到，那如何做到呢？下面我就分享一些密码构建的技巧。\n### 1. 如何提升复杂度与无序性\n数字，字母，符号兼备。\n对个别字母变形即可提高复杂度，很好记 比如我的名字 leeway 可以变形为 1EE^^@y 下表是可以参考的变形，当然自己可己设定自己的变形表。\n原字符\t变形\na @\ne 3\nd b\no 0\ns $\nt 7\nx \\>< \nv ^ \nz 2\n … …\n通过这种字母与数字符号的互换，一串便于记忆的句子就能变成看似乱码的密码了：\n\n`password --> P@$$w0rd`  \n这是种简便易行的方法。\n\n### 2. 如何使密码相互独立\n很多时候要使用某个app就要注册个账户，这个时候要临时想一个密码显然比较困难，如果单纯得采用 自己的常用密码+应用名称记号的组合形式是比较容易被人识破的，而且这些账户通常不重要，这种时候可以采用 UUID 。\n\nUUID 叫做通用唯一识别码，只要理解成一串随机的字符就可以了，一般包含32个16进制数字，UUID 可以通过很多方法生成，比如这个网站 可以一次性生成很多UUID，需要的时候生成一个即可，随机生成的两个 UUID 重复的可能性极低，可以放心使用。\n那如何记忆这么多“乱码”呢？没事，请接着看。\n\n### 3. 如何储存密码与记忆\n很显然，密码的复杂度和可记忆程度是成反比的。毕竟不是最强大脑，要记忆住这么多相互独立的密码很困难，这时候就要使用一些工具和技巧了，这里重点讲讲密码表。\n重要账户密码记小本，一般账户密码存可加密的网络笔记。\n重要账户的密码一般复杂度不高，数量也不多，尽可能记心里，家里备个小本藏好。\n\n唐诗密码 \n\n唐诗密码是我在github( https://github.com/fangj/mima )看到的一个开源项目，其实这类方法就是指用一串好记的句子来联想出相关密码，跟前面提到的变换字符是一样的。\n\n这种密码随机性强，看不出特定规律，关键是非常好记。\n`2AYSTBZ QZ1GWC3  \n两岸猿声啼不住，轻舟已过万重山`\n\n加密的在线笔记\n一般账户我们就存加密笔记，你之需要记住两个密码就可以了，一个是笔记的登陆密码，一个是笔记的加密密码。目前市场上有不少网络笔记工具可以选择，这里不做推荐，大家可以自己找找。云端的笔记有个优点就是储存和输入方便，无论是手机和电脑都可以方便访问。 这时候你一定在想一个严肃的问题，要是我存密码的笔记被黑了怎么办，如果遇到黑客或者有权限的内部人员，岂不是把我给看光了？不妨学习下古人的技法。\n斯巴达密码\n斯巴达密码也就是密码棒，是个可使的传递讯息字母顺序改变的工具，由一条加工过、且有夹带讯息的皮革绕在一个木棒所组成。在古希腊，文书记载着斯巴达人用此于军事上的讯息传递。简而言之就是只有根据规律选取特定位置的字符才是有效的，其他都是用来干扰的无效字符。\n\n* 密文：KGAWIBRXLQOPLCSDKVRGIASDNGBHG\n* 阅读规律：K GAW I BRX L QOP L CSD K VRG I ASD N GBH G\n* 解密后的：K I L L K I N G\n\n衍生的方法\n\n看完斯巴达密码是不是有种茅塞顿开的感觉？我在存云端的笔记时就会采用衍生的方法，由于只有自己知道有效的密文，因此就算笔记被人黑了也没关系。每个人可以自己想好自己的有效字符串，比如下面这几个账户，可能最后一串字符是有效，或者只有第三个字符是无效的，除了你自己，没人看得出规律。\n\n* 知乎 5d37e74b-4f22-403a-a54f-e25b2e8bba91\n* 果壳 fca63075-ecad-4214-8083-9e2bc2c12423\n* 豆瓣 e6fb2d22-9bc0-4861-a72c-f6d8a866013d\n* 简书 dea62500-fcf8-485f-937a-7f926d54a1ef\n\n## 三、总结\n账户分类\n账户密码相互独立，忌讳一个密码对应多个账户——有效防止“撞库”\n\n通过替换字符来增加密码复杂度，最好大写、小写、数字、符号兼备\n重要账户密码记小本，靠脑袋记忆，可用“唐诗密码”\n\n一般账户存云端笔记，加密笔记再加密——采用“斯巴达密码”\n准备好一些随机密码备用，比如采用 UUID\n最后写一下为什么我不用三方的密码管理工具，比如 KeePass、LastPass、1Password。原因无非是不方便与不信任，基于本地的密码管理工具不方便，云端跨平台的相当于把自己的密码都交给一家公司的服务器上，这让我更不放心。如果一家公司掌握了许许多多人的账户，难免会被成群的黑客惦记。\n\n\n\n."
		},
		{
			"post_id": 2,
			"title": "五笔的故事",
			"date_published": 1485834066.168,
			"body": "\n五笔这个 90 年代笑傲打字领域的输入法，如今已经几乎被人遗忘。\n---\n\n> 作者：爱范儿 著作权归作者所有\n\n五笔这个 90 年代笑傲打字领域的输入法，如今已经几乎被人遗忘。\n但五笔落伍了吗？最终会走向灭亡吗？讨论这些问题之前，我们先来看看它的诞生历史。\n\n### 一、拯救了中文输入法\n\n80 年代前后，随着计算机被引进中国，一个实际的问题出现了——如何输入汉字？\n\n虽然拼音输入法也能用 26 键解决汉字输入法问题，但彼时却出现了 “汉字落后论” 的观点，有部分人主张 “汉字拼音化”，“拼音代替汉字” 甚至 “一语双文”，让汉字输入与字形没有直接关联，这是中国文化史上前所未有的汉字危机。\n\n当时中外研究人员的主流思路都是打造汉字输入键盘，如日本的 “主—辅” 键整字输入键盘、北京大学包括 256 键、1000 个部件的汉字拼形组字 “中键盘”。\n![图片从外网加载中...](https://pic1.zhimg.com/v2-b1cd922291c38f69a4e93ca3a2b87f08_b.jpg \"（图片来自：王码官网）\")\n\n1978 年，在河南南阳科委工作的王永民，因对川光厂花费了 9 万元研制出的 “幻灯式” 键盘（用来解决汉字排版机的校对问题）感到不满意，发誓做出更好的汉字输入键盘的王永民，开始了长达五年的研究工作。\n\n一开始，王永明也免不了走 “做键盘” 的老路，但他一步步将键盘由 188 键压缩至 36 键。这一切，还是在没有电脑的情况下完成的。\n又经过一系列改进后，1983 年，五笔字型横空出世。\n\n![图片从外网加载中...](https://pic4.zhimg.com/v2-ed610b92453dc289fb779cfc51688adb_b.jpg \"五笔字根图\")\n\n虽名为 “五笔”，但原则上每个字最多只需要四码便能输入。之所以叫五笔，是因为汉字字型可以按照首笔笔画 “横竖撇捺折” 分为五种，键盘的 26 个字母键上也由此被分为 5 个区，分别对应不同的字根，如木、目、女等。\n\n五笔字型仅仅使用 26 个字母，完全依据笔画和字形特征对汉字进行编码，按王永明的说法，就是 “用科学的方法和设计，让汉字跨越数字化鸿沟”。\n\n新华社将五笔字型誉为中国文化史上 “意义不亚于活字印刷术” 的重大发明。\n\n### 二、从碾压拼音输入法到没落\n\n尽管五笔字型解决了汉字输入的问题，但从推广到应用，又经过了整整十年时间。\n\n随着 1986 年全球第二大电脑公司 DEC 花费了数十万美元买下了 “五笔字形” 的使用权、1987 年和 1988 年国家科委和国防科工委分别发文推广五笔字型、到王码 86 及王码 98 被嵌入微软 Office 组件，90 年代出现了全民学五笔的热潮，王码五笔输入法终于迎来了辉煌期。\n![图片从外网加载中...](https://pic2.zhimg.com/v2-3f5d08445d0786f6e268e4427f22c0b1_b.jpg \"王码\")\n（王码 86 及王码 98 被嵌入微软 Office 组件）\n\n相比于拼音输入法，五笔的最大优势在于重码率低。\n\n或许现在用着各种智能拼音输入法的你，对于选词的问题并没有太大感觉，各大厂商早已用强大的词库和云联想技术将拼音输入法这一劣势降至最小。\n\n但在 90 年代至 21 世纪初，拼音输入法的使用体验算不上美好，打一个字往往需要翻上好几页，词库的容量也小得可怜。而几乎不需要选词，可以直接盲打的五笔在当时简直是神器般的存在。\n\n大量的五笔学习班、教程也由此出现，带有五笔字根键盘的 “小霸王” 学习机更是很多人童年的回忆。\n![图片从外网加载中...](https://pic3.zhimg.com/v2-7b016b402429c5660ae8f2b9638ea17e_b.jpg \"王码\")\n然而，智能拼音的出现却打破了五笔在汉字领域独领风骚的格局，成为了拼音输入法用户的福音。\n\n2006 年，搜狐推出搜狗拼音输入法。这一产品起初并未引起过多关注，毕竟当时的拼音输入法已是智能 ABC 和紫光拼音的天下。\n\n未曾想，搜狗输入法开创的整句输入、联想输入、云联想等功能，加上强大的联网词库，彻底颠覆了拼音输入法的体验。\n\n在此之后，腾讯、百度、Google 等厂商也纷纷推出拼音输入法产品，也无外乎是依赖庞大的词库、编码优化和大数据优化等，用技术手段硬是让拼音输入法的速度实现了质的飞跃。\n\n![图片从外网加载中...](https://pic3.zhimg.com/v2-2ee47bb40605df0c53083d37398e9566_b.jpg \"拼音输入法\")\n\n虽然并无确切的统计数据表明五笔的使用人数少于拼音，但通过日常生活也能看出，伴随各位在电脑前键字如飞，无疑是搜狗拼音、QQ 拼音等。\n\n仍坚守在五笔阵营的，要么是不会拼音的长辈、要么是需要大量录入文字的专业人员（如银行职员、会计等），当然还有少数因初期拼音输入法体验过差，为了追求速度而学习了五笔的 90 后。\n\n对我们普通人而言，且不说如今的拼音输入法各种强大，即使是在 90 年代，借助智能 ABC 等优秀工具，拼音在效率上也并非一无是处，很多人甚至能将智能 ABC 上字词的页码倒背如流，从而实现盲打。这也是五笔虽然得到了国家相关部门的大力推广，但迟迟无法普及开来的原因之一。\n\n一边是需要投入精力学习、忍受学习速度爬坡的五笔，另一边是上手即可用，日常打字速度也几乎与五笔无异的拼音输入法，加上各大厂商重金投入推广，大部分用户也乐得投入后者的怀抱了。\n\n### 三、制约五笔发展真正原因\n\n五笔比拼音输入法难学，这是很多人对其望而却步的原因。\n\n然而，我们觉得拼音输入法没有上手难度，只是因为我们已经经历了它的学习过程。\n\n托九年义务教育的福，大多数人在接触电脑前，已能熟练掌握拼音。因此，将需要从头开始学起的五笔，与我们其实已经掌握用法的拼音输入法进行学习难度的对比，本身就不是一个公平的比较。\n\n还有，五笔的学习曲线非常陡峭。\n\n![图片从外网加载中...](https://pic3.zhimg.com/v2-c16c943900026c2ad050a6c762829d7a_b.png \"学习曲线\")\n（图自 @张抗抗 ）\n\n如果让一个既不会拼音也不会五笔的人，从零开始学习打字，恐怕拼音并不比五笔好学。这一点也可以从很多老一辈的人使用五笔得到佐证。\n\n五笔并不比拼音难，但仅仅是一个 “需要专门学习” 的门槛，足以拦住绝大多数人。\n\n从小到大，我们学习语数外、理化生、各种乐器，又有哪些不是从零开始的？可我们为何愿意投入精力去学？因为我们都知道其重要性，讲得更功利些，我们能够从中获得巨大收益，因此选择迎难而上。\n\n至于五笔，这只是一门锦上添花的技能。会与不会，并不影响我们在网上愉快地聊天、写文章。\n\n归根到底，还是一个投入与产出比的问题。如果你是对于文字输入准确率有极高要求的人员，如速记员、会计、秘书等，那么你学习五笔的动力无疑要充足得多，因为你需要它。\n\n### 四、用简单的方式满足大众的 “专业” 需求\n\n尽管五笔输入法已不复当年辉煌，但在某些领域，如出版社、银行、会计做账等，五笔依然有着拼音无法比拟的优势。换而言之，五笔从一项曾经是大众化的技能，又变成了专业人士的工具，这或许才是它的正确定位。\n\n遥想当年的 P 图党，只是想为照片想去个红眼、修一下皮肤、加个滤镜，我们都需要掌握各种 PS 技巧，搞清楚色域、色阶的区别，看懂直方图等。\n\n现在，哪个姑娘手机里没几款美颜相机？磨皮、瘦脸、袪痘，都只是简单的几次操作而已。你辛辛苦苦在 PS 上调了半天的色彩，效果可能还不如 VSCO Cam、Instagram 上滤镜。\n\n或许这些软件所实现的效果仍与 PS 有差距，但对于普通人来说，够用就行，我并不在意那调好的滤镜是否口味过重、磨皮是否把五官都磨没了。\n\n将部分专业的功能用简单的方式实现，这也是如今不少面向大众的产品的生存之道。同样的情况还发生在 WPS、Google Doc 等产品上。这些产品可能在功能上无法与 Office 抗衡，但功能的减少也意味着使用难度的降低，毕竟我们很多人需要的只是最基本的文档编辑功能而已，Office 组件里那些复杂的按钮又有多少人能用得上？\n\n从胶片相机、到卡片机，再到如今手机的拍照功能，拍照的门槛也是一再降低，单反依然屹立不倒，但拍照不再是专业人士的专属。\n\n五笔与拼音的相爱相杀过程，也是同样的道理。输入法并无优劣之分，只有专业与日用之别。\n\n往长远看，拼音和五笔输入法或许都将被语音输入、文字自动识别等技术所取代。就目前的发展来看，语音输入的准确率和速度已经达到了相当高的水平。当然，短期内键盘输入仍有其用武之地，但并不排除在未来会出现更高水平的技术将这些输入法取而代之，比如无需借助双手的脑电波之类的，这就是后话了。\n\n在 95 后、00 后都已经不知五笔为何物的今天，用着五笔大概是一种暴露年龄的体验吧。\n\n> 现在的零网，感觉似乎与当时遇到五笔是一个感觉吧\n\n原文作者：爱范儿 · 吴羚\n."
		},
		{
			"post_id": 1,
			"title": "Welcome!",
			"date_published": 1484881871,
			"body": "# 欢迎来到茶茶的小馆\n\n------\n\n文章概要如下：\n\n> 什么是markdown\n> MD示例\n> ZBlog入门\n> 闲聊\n\n---\n这是一个ZN的blog页面，ZN的源代码可以在这里找到：\n\n### [ZNSC](https://github.com/HelloZeroNet)\n\n> 有时候编辑了CSS样式，但是前台没有效果的时候，如果用的是chrome浏览器，请 <i class=\"icon-file\"></i> **刷新** 或者使用快捷键 `Ctrl+Alt+DEL`来清理缓存。\n\n------\n\n## 什么是 Markdown\n\nMarkdown 是一种方便记忆、书写的纯文本标记语言，用户可以使用这些标记符号以最小的输入代价生成极富表现力的文档：譬如您正在阅读的这份文档。它使用简单的符号标记不同的标题，分割不同的段落，**粗体** 或者 *斜体* 某些文字，更棒的是，它还可以\n\n### 1. 制作一份待办事宜\n\n- [ ] 支持以 PDF 格式导出文稿\n- [ ] 改进 Cmd 渲染算法，使用局部渲染技术提高渲染效率\n- [x] 新增 Todo 列表功能\n- [x] 修复 LaTex 公式渲染问题\n- [x] 新增 LaTex 公式编号功能\n\n### 2. 书写一个质能守恒公式\n\n$$E=mc^2$$\n这里好像不支持\n\n### 3. 高亮一段代码\n\n```python\n@requires_authorization\nclass SomeClass:\n    pass\n\nif __name__ == '__main__':\n    # A comment\n    print 'hello world'\n```\n\n### 4. 高效绘制流程图\n\n```flow\nst=>start: Start\nop=>operation: Your Operation\ncond=>condition: Yes or No?\ne=>end\n\nst->op->cond\ncond(yes)->e\ncond(no)->op\n```\n这里好像不支持\n### 5. 高效绘制序列图\n\n```seq\nAlice->Bob: Hello Bob, how are you?\nNote right of Bob: Bob thinks\nBob-->Alice: I am good thanks!\n```\n这里好像不支持\n### 6. 高效绘制甘特图\n\n```gantt\n    title 项目开发流程\n    section 项目确定\n        需求分析       :a1, 2016-06-22, 3d\n        可行性报告     :after a1, 5d\n        概念验证       : 5d\n    section 项目实施\n        概要设计      :2016-07-05  , 5d\n        详细设计      :2016-07-08, 10d\n        编码          :2016-07-15, 10d\n        测试          :2016-07-22, 5d\n    section 发布验收\n        发布: 2d\n        验收: 3d\n```\n这里好像不支持\n### 7. 绘制表格\n\n| 项目        | 价格   |  数量  |\n| --------   | -----:  | :----:  |\n| 计算机     | \\$1600 |   5     |\n| 手机        |   \\$12   |   12   |\n| 管线        |    \\$1    |  234  |\n\n### 8. 其他\n\n想要查看更详细的语法说明，可以去互联网上查找，很方便。\n\n\n## ZeroNet建站+签名+发布\n### 建站\n\n * 1，克隆建站：当有你喜欢的网站时，在ZeroNetHello页面，右边有三个点的按钮，点下可以找到clone这个按钮，点击就可以克隆该网站，如果没有该按钮，表示该站不允许一键克隆。之后，选择克隆好的站点进入。知道了网站id，则可以像传统网页一样，在data目录编辑文件修改网页了。另外，请多多注意js，不要误操作导致网站不能正确使用与相应了。\n\n* 2，命令行建站：\n```\n第一步：zerobundle/zeronet文件夹下打开命令行程序，\n第二步：在命令行里输入..\\Python\\python zeronet.py siteCreate,回车\n第三步：输入yes,\n第四部：保存好相应密钥，进data找到相应网站，就可以进去编辑网站了。\n```\n\n* 3，首页菜单建站：点开首页左上角logo旁边的三点菜单，点击创建空白站点\n\n### 签名\n\nzerobundle/zeronet文件夹下打开小黑窗，输入：`..\\Python\\python zeronet.py siteSign 网站地址 PrivateKey `\n\n### 发布\n\n同一命令行窗口，输入：`..\\Python\\python zeronet.py sitePublish 网站地址`再回车。这时可以到浏览器打开你的网站，向左拉开右上角的按钮，出现隐藏菜单。点击this is my site，先点sign一下，输入私钥。接着去找个代理，打开你的网站，这是代理显示正在寻找peer，此时用越多代理打开你的网站越好，然后点击publish，之后刷新一下代理的网页，你就会发现可以浏览了，这时你的网站就可以让别人来浏览了。\n【摘自零网教学】\n\n.\n\n"
		}
	]
}