{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "Fantastic post, very informative for a new ZN user like me!\n\nA few questions if you dont mind;\n\nWhy does namecoin addresses expire? I though the blockchain was akin to an ever growing ledger, and as long as someone kept the full list it was practically permanent.\n\nIf I understand the address book system description, a user can end up with several different domain names for the same eepsite depending on what address books one subscribes to?\n\nAnd a suggestion to the DNS problem on ZN, inspired by your description of I2P's address books:\n\n1. Every zite has meta-information tags or a file \"suggesting\" the zite's name to a users address book or if missing, scraped and short-form'ed from the zite.\n\nIn this blog's case the auto-generated name could be main page title+TLD, so \"anshorei.zen\"\n\nA full featured set of meta information could contain:\n\nURL\nTitle\nDescription\nCategory\n\nand this information would be available in the users address book.\n\n2. The user auto-accepts all zites suggested names into his/her address book.\n\n3. If two zites have the same suggested name, the user is prompted to select which one he/she want to link to the domain name in their address book, current or new.\n\n4. The next time the user visits a zite previously linked to a domain name, they get a prompt to rename the zite domain name, or use default \"thatzite(2).zen\"\n\nOR\n\nThe address book is available to others as a DNS zite. Other users address books is obtained by copying all zites, including other DNS zites, from the first address book the user gets in contact with - either by having a hardcoded default first site or having a list of suggested DNS zites etc.\n\nWith a script that could be automated or triggered, the users address book/DNS zite could contact all other zites tagged as DNS zites to copy their content. Thus the list of DNS zites will grow every time the script is run and every time two \"islands\" of DNS zite networks get in contact, they merge.\n\nUpon visiting a new zite from a raw URL, the users address book would use a script to checks the new zite's suggested/generated name in other random users address books until three DNS records show up or none is found, where the users own address book stores it. This avoids domain name spoofing.\n\nIf trying to access a domain name not found in the address book, it would trigger a script that contacts random known DNS zites to request a DNS resolve. Three identical resolves adds the new zite to the users address book, and have already verified the site name legitimacy.\n\nOf course several tweaks to the concept remain, creators should be able to exempt their sites from listing, users should be able to blacklist categories etc.\n\nBut if my though exercise is technically possible, I think it could be the framework for a decentralized, self-controlled, auto-propagating, anti-spoofing DNS system for ZN that comes with a user-accessible directory listing with tags and descriptions plus a built in content-blocker system where the user could preemptively block i.e. \"gore\" and \"porn\" zites without censoring them.\n\nThoughts?",
			"post_id": 6,
			"date_added": 1570052746
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}