{
	"posts": [
		{
			"id": "ad647a15-9208-4fc3-a7d2-cff78501002d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": ">datamining",
			"time": 1565634003007,
			"files": "[]"
		},
		{
			"id": "ff946e83-5117-4592-b32e-3937dcf29c6b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "c3ea90f8-c3b9-49d0-befa-e1f669d8b747",
			"body": ">>09bd49d1-ef41-4fcf-a788-d45acf3a4be4\nhe won't because of muh different css and namefagging enabled by default",
			"time": 1565634940515,
			"files": "[]"
		},
		{
			"id": "7ed9cc12-1365-4db3-a003-66ee843e7bda",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>e0a78272-e382-4188-9f06-408818d2bf0c\n>i can't even reply most of the time\nTry not being retarded.\n>and zip files from sketchy file hosts is PAJEET TIER\nIf you were such a hax0r you'd know the source code is on gitgud.io, newfaggot.\n>set up a public git repo somewhere.\nHow about you set it up, shithead?\nIf you don't like AnonFiles the compiled code is already on this board posted as an .mp4.\n<inb4 b-but it's not been posted by the admin\nYou shouldn't trust the admin either unless you know him in real life anyways. He could be a fed. If you don't trust ZeroNet's API sandboxing, then you shouldn't be visiting the zite at all, or running it on a firewalled VM.",
			"time": 1565636059800,
			"files": "[]"
		},
		{
			"id": "00716241-8493-43d8-a75f-7c3fa4b2f586",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "b0cfa239-461f-481e-87b9-1ed5fd58eaed",
			"body": ">>04432f40-b60f-4902-b9f6-3c9c9185b1b2\nI think the \"this is my site\" stuff doesn't do anything anyways. It only enables the buttons for you to sign board files you'd use if you were indeed the site owner.",
			"time": 1565640159300,
			"files": "[]"
		},
		{
			"id": "ea6296e6-2d2d-4be3-9b71-9d19f05b03b8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c461c664-86e1-4933-b221-861bb909957e",
			"body": ">>e037d6db-28c4-49d3-a5c6-f0e369b4dd5a\nI imagine you would have to destroy multiple datacenters.",
			"time": 1565642395245,
			"files": "[]"
		},
		{
			"id": "184f382b-97a3-4749-af3c-89df51677c42",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": ">>9d0e3988-9406-4d72-894b-5eda0cdadf84\n>and they (atleast state in their TOS) they keep zero logs so I'm feeling good.\nOf course they all say that lol.\nBut think about it this way, what is likely to be a more important legal pressure?\n-getting sued by their users for not doing what they're supposed to be doing (and how would the users know that? all that goes on inside their facility stays behind closed doors)\n-getting sued by the FBI for not producing evidence",
			"time": 1565647865206,
			"files": "[]",
			"last_edited": 1565647891665,
			"subject": null,
			"capcode": null
		},
		{
			"id": "4b104c2f-0bda-4a16-895b-76a89a49e6ee",
			"directory": "users/1Ew94C1V9PozFSdCZ4n6r7oK3BBTKo2xTZ",
			"uri": "cyber",
			"thread": "93d8d6b2-994d-4437-aff2-5e1426142879",
			"body": "1. The gun mechanics which by what I've seen are aimed at 8 yo kids who are impressed by lots of sparks, smoke and that \"badass\" jerky unrealistic reloading animation that's on every other modern normalfag game for some reason.\n2. Having a large amount of women and flaming homos, rather than something like the original Deus Ex in which rebels were either poor mercenaries risking their lives to make some brouzouf to survive, or normal people who just wanted to end the actual misery that was all around them dressed in a bit of tactischway gear.\n3. Having too many gimicky interactions with the environment that aren't interesting, funny nor increase immersion, and are done in the same \"badass\" jerky style of animation that I mentioned above. At least in Quake 4 they were just an excuse to show more gore scenes.\n4. The character being a bullet sponge and healing by itself because of some nano-augmentation bullshit excuse they'll make so normalfags don't get frustrated by dying.\n5. I'm calling it now: the dialogue and storyline will be less reactive to the choices the player makes than the original Deus Ex. You will get the typical 3 endings you can choose from at the end and that's it. Maybe you will be able to choose which ones and in which order you do the missions, like in the GTA series. Police will be retarded so you can have fun killing random people as long as you wait a bit for the wanted state to go away. Bodies will be made of indestructible rubber, no gore other than a little blood.\n6. The plot will be kosher copy-paste bullshit from century old themes (muh corporations and government composed mainly of white people with no slanted noses, muh vibrant diverse revolutionaries, muh Ayy Ai turning against its creator) with no interesting aspects or depth whatsoever.\n7. Muh \"hackers\", \"augs\" and \"the net\" with no understanding of how the underlying tech is supposed to work by the liberal arts writers who created the plot and the dialogue. Maybe they'll name drop some \"fiber optics link\" once or twice.\nThe gameplay footage makes it clear this game will be an SJW call of duty wanna be pile of trash.\nArma 3 is more cyberpunk than this  without even trying. I'd rather replay Deus Ex or Half Life yet another time than this crap.\nEven the shitty Deus Ex spinoffs don't make it this obvious (except with the whole aug lives matter thing which is so ridiculous that it could have been done as some kind of satire with plausible deniability).",
			"time": 1565651704849,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}