{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"category": "movies",
			"title": "Alita [1080] [Castellano]",
			"torrent_imdb": "",
			"body": "Cuando Alita (Rosa Salazar) se despierta sin recordar quién es en un mundo futuro que no reconoce, Ido (Christoph Waltz), un médico compasivo, se da cuenta de que en algún lugar de ese caparazón de cyborg abandonado, está el corazón y alma de una mujer joven con un pasado extraordinario. Mientras Alita toma las riendas de su nueva vida y aprende a adaptarse a las peligrosas calles de Iron City, Ido tratará de protegerla de su propio pasado, mientras que su nuevo amigo Hugo (Keean Johnson) se ofrecerá, en cambio, a ayudarla a desenterrar sus recuerdos. Cuando las fuerzas mortales y corruptas que manejan la ciudad comienzan a perseguir a Alita, ella descubre una pista crucial sobre su pasado: posee habilidades de combate únicas que los que ostentan el poder querrán controlar a toda costa. Sólo manteniéndose fuera de su alcance, podrá salvar a sus amigos, a su familia y el mundo que ha aprendido a amar. Remake del clásico anime de 1993 \"Alita, Ángel del Combate\".",
			"magnet": "",
			"torrent_file": "data/users/1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa/Alita_1080p.torrent",
			"added": 1565365163
		},
		{
			"topic_id": 2,
			"category": "movies",
			"title": "Kick Ass [HDRIP] [Castellano]",
			"torrent_imdb": "",
			"body": "“Kick-Ass” sigue la historia de Dave Lizewski, un adolescente de quince años que desea convertirse en un auténtico superhéroe. El problema es que no posee ningún poder especial, y sus razones para luchar contra el crimen tampoco se ajustan a los estereotipos del género.",
			"magnet": "",
			"torrent_file": "data/users/1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa/kick-ass-dvdrip-azvuY.torrent",
			"added": 1565365240
		},
		{
			"topic_id": 3,
			"category": "movies",
			"title": "Vengadores: Endgame [1080] [Castellano]",
			"torrent_imdb": "tt4154796",
			"body": "Después de los eventos devastadores de 'Vengadores: Infinity War', el universo está en ruinas debido a las acciones de Thanos. Con la ayuda de los aliados que quedaron, los Vengadores deberán reunirse una vez más para intentar deshacer sus acciones y restaurar el orden en el universo de una vez por todas, sin importar cuáles sean las consecuencias... Cuarta y última entrega de la saga \"Vengadores\".",
			"magnet": "magnet:?xt=urn:btih:cfe85cace4a894e11ee9863be6644bce43b47460&dn=Avengers+Endgame+%5B1080p%5D%5BCastellano%5D%5BwWw.EliteTorrent.IO%5D&xl=8663533600&tr=udp://tracker.openbittorrent.com:80/announce&tr=udp://tracker.opentrackr.org:1337/announce",
			"torrent_file": "data/users/1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa/1566066652-Avengers Endgame [1080p][Castellano][wWw.EliteTorrent.IO].torrent",
			"added": 1566320997
		},
		{
			"topic_id": 4,
			"category": "movies",
			"title": "Detective Pikachu [1080] [Castellano]",
			"torrent_imdb": "tt5884052",
			"body": "Ryme City, una metrópoli futurista en la que los humanos y los Pokémon conviven en armonía. Tras la misteriosa desaparición de su padre, toda una leyenda en la ciudad, el joven Tim Goodman (Justice Smith) comienza una investigación para buscarle y averiguar lo que le ha sucedido. En esta misión le ayudará el adorable súper-detective Pikachu, un inteligente Pokémon que habla, aunque curiosamente el chico es el único que puede entenderle. Ambos unirán sus fuerzas y trabajarán juntos para resolver este gran misterio, con la ayuda de Lucy (Kathryn Newton), una reportera que trabaja en su primera gran historia. Será una aventura en la que descubrirán a entrañables personajes del universo Pokémon, además de una trama espeluznante que podría amenazar la convivencia pacífica de todo este universo.",
			"magnet": "magnet:?xt=urn:btih:66201730273e81a956a4901f07d97494fd729329&dn=Pokemon+%5B1080p%5D%5BCastellano%5D%5BwWw.EliteTorrent.IO%5D&xl=5177920321&tr=udp://tracker.openbittorrent.com:80/announce&tr=udp://tracker.opentrackr.org:1337/announce",
			"torrent_file": "data/users/1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa/1566537504-Pokemon [1080p][Castellano][wWw.EliteTorrent.IO].torrent",
			"added": 1566586658
		},
		{
			"topic_id": 5,
			"category": "movies",
			"title": "Spider-Man: Un nuevo universo [1080] [Castellano]",
			"torrent_imdb": "tt4633694",
			"body": "En un universo paralelo donde Peter Parker ha muerto, un joven de secundaria llamado Miles Morales es el nuevo Spider-Man. Sin embargo, cuando el líder mafioso Wilson Fisk (a.k.a Kingpin) construye el \"Super Colisionador\" trae a una versión alternativa de Peter Parker que tratará de enseñarle a Miles como ser un mejor Spider-Man. Pero no será el único Spider Man en entrar a este universo, 4 versiones alternas de Spidey aparecerán y buscarán regresar a su universo antes de que toda la realidad colapse",
			"magnet": "magnet:?xt=urn:btih:2146f6ed3ca15a5b79f62c5dc5cc9fd98df29e58&dn=Spiderman+Universo+%5B1080p%5D%5BCastellano%5D%5BwWw.EliteTorrent.BiZ%5D&xl=5443878370&tr=udp://tracker.openbittorrent.com:80/announce&tr=udp://tracker.opentrackr.org:1337/announce",
			"torrent_file": "data/users/1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa/1552814493-Spiderman Universo [1080p][Castellano][wWw.EliteTorrent.BiZ].torrent",
			"added": 1566834449
		},
		{
			"topic_id": 6,
			"category": "movies",
			"title": "El Gran Showman [1080] [Castellano]",
			"torrent_imdb": "tt1485796",
			"body": "Estados Unidos, siglo XIX. P.T. Barnum (Hugh Jackman) acaba de perder su trabajo de oficinista porque la empresa para la que trabajaba se ha ido a la bancarrota. Deseoso de ofrecer a su esposa Charity (Michelle Williams) y a sus dos hijas la vida que siempre les había prometido, Barnum se embarca en un proyecto colosal: crear un gran y asombroso espectáculo circense. Para ello, este inventor del show bussines buscará artistas únicos, desde enanos, a mujeres barbudas, equilibristas y toda clase de shows imaginativos. Su lema: para hacer algo nuevo hay que hacer algo poco convencional.",
			"magnet": "magnet:?xt=urn:btih:dd2cc57af2ae96f7647219cbf3ef9b0738dda7b1&dn=El+Gran+Showman+%5B1080p%5D%5BCastellano%5D%5BwWw.EliteTorrent.BiZ%5D&xl=6605805631&tr=udp://tracker.openbittorrent.com:80/announce&tr=udp://tracker.opentrackr.org:1337/announce",
			"torrent_file": "data/users/1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa/1523056399-El Gran Showman [1080p][Castellano][wWw.EliteTorrent.BiZ].torrent",
			"added": 1568415915
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"4_1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa": [
			{
				"comment_id": 1,
				"body": "> [upqxhzppexdl2d9t](#comment_1_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w): English?\n\nPone castellano (spanish) en el título",
				"image": "data/users/1BViJWmqvV2LNJVnUMLfgjwTKzNedzPpLa/",
				"added": 1567283060
			}
		]
	},
	"comment_vote": {}
}