{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1592416438_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1592059237_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": [
			{
				"comment_id": 1,
				"body": "Idk but it's pretty cool if you ask me.",
				"added": 1592059586
			},
			{
				"comment_id": 2,
				"body": "> [ransbits](#comment_82_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): Zeronet has been my home for years, now I visit the clearnet and frown at the levels of censorship of ideals, the censorship of education, and even the censorship of opinions.\n\nAmen to that, I like the no password part of it as well, using bitcoin to login to things",
				"added": 1592060050
			},
			{
				"comment_id": 4,
				"body": "> [eltheal](#comment_15_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): without it having more user base and higher traffic it will not mean anything\n\nI kinda like it having a smaller user base, feels \"exotic\" if that makes any sense",
				"added": 1592066081
			},
			{
				"comment_id": 8,
				"body": "> [zaron](#comment_140_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Before Google and Facebook it was slower. because we were on 14.4k modems\n\n\"Back in my day\"",
				"added": 1592234503
			}
		],
		"1591995772_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 3,
				"body": "i've always thought the opposite tbh, but that's probably just because I tend to listen to rock stuff more",
				"added": 1592060837
			}
		],
		"1592140848_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 5,
				"body": "The system definitely needs a reform to at least a large extent, at least in my opinion. The amount of unlawful acts the police and other enforcing agencies do is honestly ridiculous at this point, while not all members of the agencies/groups do, a large margin does. This just happened to be \"the straw that broke the camel's back\" and caused shit to hit the fan after dealing with it for so many years.",
				"added": 1592150023
			},
			{
				"comment_id": 6,
				"body": "> [eltheal](#comment_19_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): they do not need any reforms, they need to harden up even more\n\nthat would be a type of reform, my dude...",
				"added": 1592151934
			}
		],
		"1592157079_1LZUsLPdv5RUx1VVGP81RyKwiHTfSxgSL1": [
			{
				"comment_id": 7,
				"body": "Strong aggression or resentment towards someone",
				"added": 1592233070
			}
		],
		"1589480365_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": [
			{
				"comment_id": 9,
				"body": "> [zeroglow](#comment_2_1L2ZwsfRArS2LcgnNbDy8JK3rYVSgATMmz): No I forgot where I found the source from but the main company that owns NordVPN also owns ProtonVPN. I use to use Nord up until the latest breach they didn't tell anyone about. The best VPNs I used since then are AirVPN and ExpressVPN. The more I looked into Nord being a shady company, the more I felt uncomfortable using them. The breach was the icing on the cake and I finally deiced to drop them.\n\nProtonMail owns ProtonVPN, afaik nord has nothing to do with it.",
				"added": 1592234833
			}
		],
		"1592416438_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "This would be very nice",
				"added": 1592421855
			}
		]
	},
	"comment_vote": {
		"82_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"15_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": 1,
		"1_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1
	}
}