{
	"next_topic_id": 43,
	"topic": [
		{
			"topic_id": 1612726861,
			"title": "Galacteek is a multi-platform Qt5-based browser/toolbox for the IPFS peer-to-peer network.",
			"body": "[Galacteek](https://galacteek.github.io/) is offered under the GNU GPL3 license. Supports win/mac/linux.\n\n- Decentralized Identifiers (DID) support with IPID\n- Browser-to-browser DID authentication over libp2p streams (Verifiable Credentials with RSA-PSS)\n- Browsing sessions with automatic pinning (pins every page you browse)\n- Distributed chat with pubsub (chat channels syncronized with CRDT+DAG)\n- File manager with drag-and-drop support and timeframes (per-day view of files in the MFS)\n- File sharing\n- BitTorrent to IPFS bridge\n- Tor support\n- Search content with the ipfs-search search engine as well as with cyber\n- Built-in blog with Atom feeds\n- Webcam to IPFS capture (image and videos)\n- Basic built-in media player with IPFS-stored playlists\n- Image viewer and QR codes support\n- Use the IPFS filestore to avoid file duplication\n- ENS (Ethereum Name Service) resolving (access to ENS+IPFS websites)\n- Run WASM binaries with wasmer (use Open on a WASM object from the clipboard manager)",
			"added": 1612726860
		},
		{
			"topic_id": 1612762070,
			"title": "Talk at FOSDEM '21 - I2P, blockchain and the application - an Introduction Diva.Exchange",
			"body": "[odysee.com](https://odysee.com/@diva.exchange:d/diva-exchange-fosdem-21:c)\n[diva.exchange](https://www.diva.exchange/en/)\n\nImagine: I2P (aka \"Darknet\"), a highly energy-efficient, new and fully distributed storage engine, some basic banking business logic and a fresh user interface.\n\nResult: a highly privacy-respecting, in theory secure, yet very slow, personal bank. Meet diva.exchange - the first non-profit, non-corporate, very-small-tech and research-driven association developing \"Free Banking Technology - For Everyone\". All licensed under AGPLv3+.\n\nThe presentation is about the technology stack of the truly distributed free banking technology \"DIVA\". It's also about the fact that \"distributed technology\" does not offer anything like a \"business model\" in the old-fashioned-cloudy way. It's about the overlay network \"I2P\". It's about the distributed storage engine \"Iroha\" and the challenges with a very slow network. It's about banking business logic, the user interface and its challenges being fully distributed. And it's about the research co-operations in Switzerland.\nDIVA is small and local tech for everyone.",
			"added": 1612762068
		},
		{
			"topic_id": 1612926129,
			"title": "NEW: eepHttpd - easy-to-use tool for setting up P2P I2P Sites (eepsites)",
			"body": "[eepHttpd](https://github.com/eyedeekay/eephttpd)\nNow available: P2P multi-share I2P Sites. Users can now download and seed eepsites. (Both ends needs to run eepHttpd ) \nThis serves simple static sites directly to i2p via the SAM API.\neepHttpd is the easiest tool for hosting new sites on the I2P network from your own computer(As long as they are mostly static sites, for now). You start the application and it sets up a directory in a logical place on your system. It has some neat features to make your sites available to people who want it even when you aren't available to host it. Probably the most cool thing that it can do is that it can mirror most github pages as long as they are statically pre-generated. The I2P Site itself is actually just a clone of the github repository, making the act of mirroring the site also the act of mirroring the source code. If you have an account at i2pgit.org or git.idk.i2p then you should use this to self-host your gitlab pages.\n\n Use this for things You want to SHARE ANONYMOUSLY with a large audience, not for things you want to keep secret. This allows people to clone the site in order to mirror it.",
			"added": 1612926126
		},
		{
			"topic_id": 1612927209,
			"title": "By referring to COVID-19 vaccines as “vaccines” rather than gene therapies, the U.S. government is violating its 15 U.S. Code Section 41, which regulates deceptive practices in medicine",
			"body": "[tapnewswire.com](http://tapnewswire.com/2021/02/by-referring-to-covid-19-vaccines-as-vaccines-rather-than-gene-therapies-the-u-s-government-is-violating-its-15-u-s-code-section-41-which-regulates-deceptive-practices-in-medicin/)\n\nBy referring to COVID-19 vaccines as “vaccines” rather than gene therapies, the U.S. government is violating its 15 U.S. Code Section 41, which regulates deceptive practices in medical claims\n\nThe mRNA injections are gene therapies that do not fulfill a single criteria or definition of a vaccine\nCOVID-19 “vaccines” do not impart immunity or inhibit transmissibility of the disease. They only are designed to lessen your infection symptoms if or when you get infected. As such, these products do not meet the legal or medical definition of a vaccine",
			"added": 1612927205
		},
		{
			"topic_id": 1613128614,
			"title": "The Great Firewall of...America? WTZ!",
			"body": "[invidious.tube](https://invidious.tube/watch?v=38za1LYj2XQ)\n\nThis past week on Feb 2 - Feb 7, 2021 a massive attack was conducted on encrypted services, particular VPN's. VPN traffic was throttled to near unusability.\n\nBasically in 2021, the Great Firewall of the USA was turned on. And then abrubtly turned off.",
			"added": 1613128609
		},
		{
			"topic_id": 1613196054,
			"title": "The best RSS Search experience you can find",
			"body": "[datorss.com](https://datorss.com/)\nA seamless RSS Search Engine experience with a hint of Machine Learning.",
			"added": 1613196048
		},
		{
			"topic_id": 1613197883,
			"title": "Heads up: Microsoft repo secretly installed on all Raspberry Pi’s Linux OS",
			"body": "[cyberciti.biz](https://www.cyberciti.biz/linux-news/heads-up-microsoft-repo-secretly-installed-on-all-raspberry-pis-linux-os/)\n\nWhy is this bad news?\n\nIt seems RPi foundation officially recommends MS IDE, and hence this was included Raspberry Pi OS. They should keep this to GUI image for kids or anyone who wish to to learn Python and other stuff using VS Code. Most Linux geeks and power users use RPi as a git server or adblocker and so on as a headless server. There is always a trust issue when unwanted software repo configured and gpg keys are installed secretly, which is the main issue.",
			"added": 1613197876
		},
		{
			"topic_id": 1613642362,
			"title": "THE GREAT RESET EXPLAINED IN 5 MINS",
			"body": "https://open.lbry.com/@Vaccines:4/the-great-reset-explained-in-5-mins:1",
			"added": 1613642354
		},
		{
			"topic_id": 1613831892,
			"title": "MuWire 0.8.6 is out! It comes with: * New I2P router - 0.9.49 for increased speeds * Dark theme - \"Darcula\"",
			"body": "[MuWire](https://muwire.com/)",
			"added": 1613831883
		},
		{
			"topic_id": 1613912064,
			"title": "Patents concerning COVID-19 virus and COVID-19 Vaccines",
			"body": "- [Source](http://d.p.h.free.fr/covid19/)\n- [IPFS](https://ipfs.io/ipns/k2k4r8kwmtbpk4nebuqmv1qqjpx4jf6htdjyd8scl3py5oewjb13kgr1)",
			"added": 1613912054
		},
		{
			"topic_id": 1613919312,
			"title": "libp2p comes to ProtoSchool",
			"body": "[blog.ipfs.io](https://blog.ipfs.io/2021-02-17-libp2p-comes-to-protoschool/)\nThe ProtoSchool team is pleased to announce the launch of a shiny new multiple-choice tutorial introducing libp2p, the modular peer-to-peer networking stack that spun out of IPFS into its own first-class project and a dependency of IPFS itself. Today, IPFS focuses on content addressing (i.e., finding, fetching and authenticating any piece of content in the web) while libp2p focuses on process addressing (i.e., finding, connecting and authenticating any data transfer processes in the network).",
			"added": 1613919301
		},
		{
			"topic_id": 1613921922,
			"title": "COVID-19 breath test developed by Melbourne-based company likely key to reopening world",
			"body": "[invidious.tube](https://invidious.tube/watch?v=KKmnyO4xvf4)\n[greyscandetection.com](https://greyscandetection.com/)\nA company from Melbourne has developed a COVID-19 breath test that is said to be more accurate and faster than any other test currently available on the market, as seen on Friday.\n\nGreyScan is the manufacturer of portable devices used to detect explosives and has now adapted the technology to detect viruses. The breath test is non-invasive and goes much further than currently available forms of testing, as explained by GreyScan CEO Samantha Ollerton, \"we can tell the difference between live virus, dead virus, and active virus, and also the infectivity of somebody that may be transmitting the virus.\" \n\nOllerton went on to explain this test can \"actually assess if somebody is going to be a risk, either passing through in an event or getting on an aeroplane, or pretty much any environment you can imagine.\" It can be done quickly and easily and she believes this is the best route back to normal life.\n\nGreyScan is now seeking government funding for mass manufacture of the test kit, which avoids false positives and negatives. This form of testing could be implemented in some places by the end of the year.",
			"added": 1613921910
		},
		{
			"topic_id": 1613969481,
			"title": "[tor-consensus-health] Possible Sybil Attack",
			"body": "[lists.torproject.org](https://lists.torproject.org/pipermail/tor-consensus-health/2021-February/012345.html)\n[Source: ramble.pw](https://ramble.pw/f/tor/2498/tor-consensus-health-possible-sybil-attack)",
			"added": 1613969468
		},
		{
			"topic_id": 1613979442,
			"title": "A win for free speech as Canada’s Superior Court strikes down anti-“fake news” law",
			"body": "[reclaimthenet.org](https://reclaimthenet.org/canadas-superior-court-strikes-down-anti-fake-news-law/)\n\nIn a ruling by the Ontario Superior Court of Justice, the federal election censorship law was struck down this week. The ruling was a significant win for freedom of expression as the law would have resulted in a chilling effect on political discussions about election candidates.\n\nIn 2019, Canada amended its Elections Act to criminalize attempts to influence elections through the publishing of specific types of “falsehoods” against election candidates. The amendment stated that a person could be prosecuted for a false statement even if they were not aware that the statement was false, meaning an innocent statement could result in unjustified punishment.\n\nCritics of the law noted that the amendment did away with the term “knowingly.” Additionally, they were concerned that the term “false statement,” in the amendment, was vaguely defined. However, the definition did mention that biographical information and criminal records.\n\nThe law carried crazy punishments; a five-year sentence and a maximum fine of $50,000.\n\nThe amendment was challenged in court by the Canadian Constitutional Foundation (CCF), a non-partisan constitutional freedoms and right advocacy organization.\n\n“Today’s decision is a major victory for Canadian voters and for freedom of expression,” said CCF Executive Director, Joanna Baron. “The court struck down the provision of the Canada Election Act that prohibited publishing false statements because the government had removed the requirement to prove that the publisher knew the statements were false.”\n\n“This legislation had the potential to fine and even imprison people for honest mistakes. This would create a chilling effect on the free exchange of political ideas and opinions, and the law acts as a form of unjustified censorship. We are thrilled that the law has been struck down. This result will improve the electoral process and also protects the fundamental right to freedom of expression,” Baron added",
			"added": 1613979428
		},
		{
			"topic_id": 1614062736,
			"title": "'Bill Gates is continuing the work of Monsanto', Vandana Shiva tells FRANCE 24",
			"body": "[open.lbry.com](https://open.lbry.com/@maryinJAPAN:c/%27Bill-Gates-is-continuing-the-work-of-Monsanto%27%2C-Vandana-Shiva-tells-FRANCE-24:a)\n\nFRANCE24's guest is Vandana Shiva, a world-famous environmental activist from India. Her latest book is entitled \"One Earth, One Humanity vs. the 1%\". She tell us about more her opposition to big multinationals such as Monsanto for their nefarious influence on agriculture. But Shiva also singles out billionaires like Bill Gates and Mark Zuckerberg for criticism. \"When Bill Gates pours money into Africa for feeding the poor in Africa and preventing famine, he’s pushing the failed Green Revolution, he’s pushing chemicals, pushing GMOs, pushing patterns\", she tells FRANCE 24's Marc Perelman.\n\nVisit Vandana Shiva's site/documentary film \"[The Seeds of Vandana Shiva](https://vandanashivamovie.com/)\"",
			"added": 1614062721
		},
		{
			"topic_id": 1614109016,
			"title": "OnionShare new release: New feature 'chat with friends using the Tor network'.",
			"body": "[onionshare.org](https://onionshare.org/)\n\nOnionShare is an open source tool that lets you securely and anonymously share files, host websites, and chat with friends using the Tor network.",
			"added": 1614109000
		},
		{
			"topic_id": 1614365249,
			"title": "IBM and Qt Don’t Understand Free Software and They Now Impose Terms and Conditions on Who Qualifies for Use of Free Software Free of Charge",
			"body": "[techrights.org](http://techrights.org/2021/02/25/rhel-with-new-terms-and-conditions/)\n\nRED HAT (or IBM) has just announced this ‘free’ (with conditions) offer that’s already coming under severe criticism. Basically, after IBM took away CentOS from users (years after Red Hat had bought CentOS) it offers something similar, but this time with conditions, first a limit on the number of instances (up to 16) and now limitless albeit only for ‘Open-Source Infrastructure’, whatever that even means. They clearly feel the pinch, seeing that people might move away to Oracle or ‘Alma’ or ‘Rocky’ (and who knows what else is still in the pipeline, set aside non-RHEL-like distros).\n\nClockQt did something similar about a year ago, in effect taking away what was largely or widely regarded as Free software. They used a “bait/switch” kind of approach, in effect getting people ‘hooked’ on the free product (with high and increasing exit barriers) and now they want money. The code of many projects now depends on a proprietary stack again. Freedom isn’t an option and one needs to pay, regardless. They try to make it inconvenient to not pay, never mind if the timing is ever more sensitive due to a pandemic.",
			"added": 1614365232
		},
		{
			"topic_id": 1614509069,
			"title": "Dr. Simone Gold on Covid 19 Facts & Fiction!",
			"body": "[open.lbry.com](https://open.lbry.com/@enlightenedones!:1/Dr.-Simone-Gold---Covid-19-Lies---Truths!:d)\n\n[americasfrontlinedoctors.com](https://www.americasfrontlinedoctors.com/)\n\n[SIGN THE PETITION: stopmedicaldiscrimination.org](https://stopmedicaldiscrimination.org/)\n\nDr. Simone Gold provides the facts and exposes the myths of Covid 19.\nShe emphasizes that the vaccine (RNA) is experimental and that all who take it are part of a medical study. Without consent...\nThis woman is amazing.",
			"added": 1614509051
		},
		{
			"topic_id": 1614693108,
			"title": "BILL GATES DELETED DOCUMENTARY WHY HE SWITCHED FROM MICROSOFT TO VACCINES",
			"body": "https://www.bitchute.com/video/0mLq6F7rIw6I/",
			"added": 1614693089
		},
		{
			"topic_id": 1614833395,
			"title": "Spyware-Free Phones in 2021: We're being Squeezed!",
			"body": "[open.lbry.com](https://open.lbry.com/@RobBraxmanTech:6/Your-Internet-Identity--How-you-are-tracked-by-Google-and-Facebook:d)\n\nMany changes have occurred in 2021 and it's time to reassess our privacy phone choices again. Things that worked for us in 2020 no longer work. And we have to evaluate all our options.\n\nWhat's the status of Flip phones, feature phones, Linux phones in 2021? Did new Androids and IOS phones become more privacy friendly? Or Not? Will De-Googled phones continue to work in 2021?",
			"added": 1614833375
		},
		{
			"topic_id": 1614944690,
			"title": "New York Governor Cuomo announces vaccine passports",
			"body": "[reclaimthenet.org](https://reclaimthenet.org/new-york-governor-cuomo-announces-vaccine-passports/)\n\nWhile the highly controversial issue of introducing so-called Covid passports is being deliberated in many parts of the world, New York Governor Andrew Cuomo seems to have made up his mind: this US state has started to test one.\n\nThe scheme, called the Excelsior Pass, is currently a pilot project that will be tested in Madison Square Garden and Barclays Center, Cuomo announced in a statement, adding that the first test was carried out during a basketball game at Barclays Center on February 28.\n\nThe technology is developed with IBM, and involves what Cuomo says is a secure way to transfer confidential data that will prove the holder of this “coronavirus passport” has either been vaccinated or has a recent negative test. People will have to show a QR code that contains this information – either printed or stored on their phones.\n\nThe goal is to eventually make this a requirement for entering areas where a large number of people gather, such as stadiums and theaters. These venues will be provided with an app to be used to scan the QR code.\n\nBut reports note that Cuomo is currently embroiled in a political struggle to keep his emergency powers, which New York legislature is seeking to remove because of a series of scandals – including deliberate underreporting of Covid deaths in nursing homes as a ploy during the presidential election, and sexual harassment accusations – that have hit his administration recently.\n\nThis means that Cuomo, if the state senate votes to strip him of his powers, may not be able to implement the coronavirus passport scheme.\n\nFor now, this Democrat is talking it up as a way to speed up reopening of businesses that cater to larger gatherings of people, in order to let New Yorkers achieve their “new normal.”\n\nIMB General Manager Steve LaFleche said that other states could follow New York’s example and start using what he referred to as “a simple, secure, and voluntary” way of proving that a person has tested negatively, or has been vaccinated against Covid.\n\nIn his statement, Cuomo promises “robust privacy protections” based on “an encrypted digital smartphone wallet or printed credential” – while those using the pass will not be sharing their personal medical data, he said.",
			"added": 1614944669
		},
		{
			"topic_id": 1615057235,
			"title": "Bokhari: Microsoft and Friends Want to Destroy Online Privacy",
			"body": "[breitbart.com](https://www.breitbart.com/tech/2021/02/25/bokhari-microsoft-and-friends-want-to-destroy-online-privacy/)\n\n[originproject.info](https://www.originproject.info/)\n\nMicrosoft has teamed up with a number of tech and media companies to create a system of tracing content around the internet that could destroy online privacy and anonymity, radically transforming the nature of the web.",
			"added": 1615057213
		},
		{
			"topic_id": 1615383647,
			"title": "Italian Bank BPER Moves Mainframe Core Banking Apps To Linux",
			"body": "[forbes.com](https://www.forbes.com/sites/tomgroenfeldt/2021/03/09/italian-bank-bper-moves-mainframe-core-banking-apps-to-linux/)\n\nBPER Banca, one of Italy’s largest banks, has migrated about 30 services from its mainframes to a Linux environment with tools from LzLabs and technical and business support services from CWS. The applications chosen for the first phase of migration control BPER’s front end customer portals, used to manage its retail banking account access.",
			"added": 1615383624
		},
		{
			"topic_id": 1615487471,
			"title": "Mexico Set to Legalize Marijuana, Becoming World’s Largest Market",
			"body": "[nytimes.com](https://www.nytimes.com/2021/03/10/world/americas/mexico-cannabis-bill.html)\n\nLawmakers in Mexico have approved a bill to legalize recreational cannabis, but in a country still marred by a deadly drug war, the proposal has proved divisive.\n\nMEXICO CITY — Lawmakers in Mexico approved a bill Wednesday night to legalize recreational marijuana, a milestone for the country, which is in the throes of a drug war and could become the world’s largest cannabis market, leaving the United States between two pot-selling neighbors.\n\nThe 316-to-129 vote in Mexico’s lower house, the Chamber of Deputies, came more than two years after the Mexican Supreme Court ruled that the country’s ban on recreational marijuana was unconstitutional and more than three years after the country legalized medicinal cannabis.",
			"added": 1615487447
		},
		{
			"topic_id": 1615599959,
			"title": "Fake Security From Linux Foundation",
			"body": "http://techrights.org/videos/ibm-google-against-software-freedom.webm\n\nhttp://techrights.org/2021/03/11/fake-security-brought-by-lf/\n\nLinux Foundation as a front group (of IBM and others) is once again falsely marketing as ‘security’ something which in practice gives more control to a handful of monopolies that spy on people and steal people’s personal data (that in itself is a security breach)",
			"added": 1615599934
		},
		{
			"topic_id": 1615689898,
			"title": "New Browser Attack Allows Tracking Users Online With JavaScript Disabled",
			"body": "[thehackernews.com](https://thehackernews.com/2021/03/new-browser-attack-allows-tracking.html)\n\nResearchers have discovered a new side-channel that they say can be reliably exploited to leak information from web browsers that could then be leveraged to track users even when JavaScript is completely disabled.\n\n\"This is a side-channel attack which doesn't require any JavaScript to run,\" the researchers said. \"This means script blockers cannot stop it. The attacks work even if you strip out all of the fun parts of the web browsing experience. This makes it very difficult to prevent without modifying deep parts of the operating system.\"\n\nIn avoiding JavaScript, the side-channel attacks are also architecturally agnostic, resulting in microarchitectural website fingerprinting attacks that work across hardware platforms, including Intel Core, AMD Ryzen, Samsung Exynos 2100, and Apple M1 CPUs — making it the first known side-channel attack on the iPhone maker's new ARM-based chipsets.",
			"added": 1615689872
		},
		{
			"topic_id": 1615693178,
			"title": "WatchIt App decentralizes the way you watch your movies",
			"body": "[github.com](https://github.com/ZorrillosDev/watchit-desktop)\n\nWatchIt decentralizes the way you watch your movies. In short, it is a \"collective entertainment methodology\" in which each user consumes movies from the network and at the same time shares movies with other users.\n\nIndeed, Watchit is a movie playback system, in its most basic form it allows you to filter, search, play movies. Well, in order to decentralize our movies so that everyone can have access to them, we resorted to incredible tools such as IPFS and OrbitDB, which allowed us to have created a DAPP (Decentralized App). In simple words, Watchit is an application that does not require external resources, but rather everyone helps everyone to make it work.\n\nIt is also possible that WatchIt can be synchronized through different movie channels opening the possibility to many libraries with different content across the network.",
			"added": 1615693151
		},
		{
			"topic_id": 1615938789,
			"title": "NAMED: Black Hat Hackers Behind Gab Attack Led By Canadian Man Named Aubrey Cottle",
			"body": "[nationalfile.com](https://nationalfile.com/named-black-hat-hackers-behind-gab-attack-led-by-canadian-man-named-aubrey-cottle/)\n\nThe “criminal demon hackers” behind the Gab attack can now be revealed after a National File investigation into the attack on the free speech social network.\n\nAs National File reported, the hackers used the Discord server for 420chan, a left-wing messaging board founded in 2005, to organize and orchestrate the hack. Screenshots from the server show Aubrey Cottle, otherwise known as Kirtaner, or RealOGAnonymous, providing the information used to mastermind the hack in the Discord server.",
			"added": 1615938761
		},
		{
			"topic_id": 1616036792,
			"title": "Dr Steve Hotze says it's ' gene therapy ' which is illegal",
			"body": "[open.lbry.com](https://open.lbry.com/@science.nikipress.com:4/Dr-Steve-Hotsie:b)\n\nWarning against experimental gene therapy by Dr Steven Hotze",
			"added": 1616036763
		},
		{
			"topic_id": 1616203894,
			"title": "The Decentralized Web Is Coming",
			"body": "https://invidious.zapashcanon.fr/watch?v=R1ccwyP6fjc",
			"added": 1616203864
		},
		{
			"topic_id": 1616224608,
			"title": "DeSantis Cancels All COVID-19 Fines Issued By Local Governments",
			"body": "[patch.com](https://patch.com/florida/west-palm-beach/s/hgsrg/desantis-cancels-all-covid-19-fines-issued-local-governments)\n\nFlorida's governor signed an executive order Wednesday canceling all fines related to pandemic-related restrictions by local governments.\n\nFLORIDA — Gov. Ron DeSantis signed an executive order Wednesday canceling all fines related to violations of COVID-19 pandemic-related restrictions put in place by local governments.\n\nExecutive Order No. 21-65 cancels the fines imposed on all businesses and people between March 1, 2020 and Wednesday \"in light of the unprecedented local government restrictions.\"\n\nThe governor's order was approved by the state's Board of Executive Clemency.\n\nThe order can serve as a defense against the collection of pandemic-related fines by local governments. It doesn't apply to any COVID-19-related orders or enforcement by the state, including any fines imposed by the state on assisted living facilities, hospitals or other health care providers.",
			"added": 1616224577
		},
		{
			"topic_id": 1616239441,
			"title": "Myanmar Regime Seizes Bank Accounts of Soros' Open Society Foundation",
			"body": "By [THE IRRAWADDY](https://www.irrawaddy.com/news/burma/myanmar-regime-seizes-bank-accounts-soros-open-society-foundation.html) 16 March 2021\n\nThe military regime has seized control of the bank accounts of billionaire George Soros’ Open Society Foundation (OSF) in Myanmar and announced that it will take legal action against the foundation, which is accused of violating restrictions on the activities of such organizations.\n\nOn Monday, military-controlled MRTV announced that the military had issued arrest warrants for 11 staff members of OSF Myanmar, including its head and deputy head, on suspicion of giving financial support to the civil disobedience movement against the military junta.\n\nThe regime also claimed that the world’s largest private funder for justice, democratic governance and human rights had failed to obtain approval from the Central Bank of Myanmar (CBM)’s Foreign Exchange Management Department for a deposit of US$5 million (7.04 billion kyats) with the Small and Medium Enterprise Development Bank (SMED) in Myanmar in 2018.\n\nThe foundation is also accused of illegally withdrawing $1.4 million from its account at SMED a week after the military takeover in Myanmar, as the civil disobedience movement was gaining momentum among civil servants across the country.\n\nThe military junta also took control of assets totaling $3.81 million and 375 million kyats in OSF bank accounts at four private banks—Kanbawza Bank (KBZ), Ayeyarwady Bank (AYA), SMED and Co-operative Bank (CB), according to MRTV.",
			"added": 1616239409
		},
		{
			"topic_id": 1616339553,
			"title": "Israeli Jews Petition International Criminal Court, Say Israel's Mandatory COVID Vaccines Violate Nuremberg Code",
			"body": "[nationalfile.com](https://nationalfile.com/israeli-jews-petition-international-criminal-court-say-israels-mandatory-covid-vaccines-violate-nuremberg-code/)\n\nThe group believes that Jews are being experimented on en masse, in a program similar to the Nazi regime in Germany.\n\nIsrael became one of the first nations in the world to mandate COVID-19 vaccines, and to introduce a COVID passport system that would only allow individuals to participate in society – including commerce – after they received the vaccine and were approved to join the system. Now, a group of Israeli Jews are suing the Netanyahu administration in international court, making the case that Israel is violating the Nuremberg Code by essentially making Israelis subject to a medical experiment using the controversial vaccines.",
			"added": 1616339520
		},
		{
			"topic_id": 1616552791,
			"title": "Announcing: The National Action Task Force",
			"body": "[invidious.fdn.fr](https://invidious.fdn.fr/watch?v=IuwYw5Kg4CI)\n[national-taskforce.org](https://national-taskforce.org/)",
			"added": 1616552757
		},
		{
			"topic_id": 1616553738,
			"title": "US startup unveils battery made from nuclear waste that could last up to 28,000 years",
			"body": "[energylivenews.com](https://www.energylivenews.com/2020/09/02/us-startup-unveils-battery-made-from-nuclear-waste-that-could-last-up-to-28000-years/)",
			"added": 1616553703
		},
		{
			"topic_id": 1616900693,
			"title": "Reddit vs Wallstreet - GameStop, The Movie",
			"body": "[invidious.zapashcanon.fr](https://invidious.zapashcanon.fr/watch?v=YFQ-v1jCpF0)",
			"added": 1616900657
		},
		{
			"topic_id": 1617244448,
			"title": "YouTube To Remove ‘Dislike’ Feature As Biden WH Content Continues To See Likes Massively Trail Dislikes.",
			"body": "[thenationalpulse.com](https://thenationalpulse.com/breaking/youtube-to-remove-dislike-count/)\n\nFkn fake asses !!! Shameless piece of shit !!!!!!!!\n\nThe move was announced via Twitter on March 30th, with YouTube explaining “in response to creator feedback around well-being and targeted dislike campaigns, we’re testing a few new designs that don’t show the public dislike count.”",
			"added": 1617244411
		},
		{
			"topic_id": 1617658789,
			"title": "Analyst pleads to leaking secrets about drone program",
			"body": "[apnews.com](https://apnews.com/article/trials-nashville-virginia-espionage-tennessee-727a67a4b0d93651c93394d1f49f6dfb)\n\nALEXANDRIA, Va. (AP) — A former Air Force intelligence analyst pleaded guilty Wednesday to leaking classified documents to a reporter about military drone strikes against al-Qaida and other terrorist targets.\n\nThe guilty plea from Daniel Hale, 33, of Nashville, Tennessee, comes just days before he was slated to go on trial in federal court in Alexandria, Virginia, for violating the World War I-era Espionage Act.\n\nHale admitted leaking roughly a dozen secret and top-secret documents to a reporter in 2014 and 2015, when he was working for a contractor as an analyst at the National Geospatial-Intelligence Agency (NGA). While court papers never specified the recipient of the leak, details about the case make it clear that the documents were given to Jeremy Scahill, a reporter at The Intercept, who used the documents as part of a series of critical reports on how the military conducted drone strikes on foreign targets.\n\nHe faces up to 10 years in prison at sentencing scheduled for July 13",
			"added": 1617658751
		},
		{
			"topic_id": 1617899570,
			"title": "LinkedIn Phishing Campaign: A New Threat",
			"body": "[maketecheasier.com](https://www.maketecheasier.com/linkedin-phishing-campaign-new-threat/)\nHackers Hit LinkedIn\nIt seems like nothing is off limits anymore. After a year of the pandemic that saw unemployment at record highs, hackers are now hitting the inboxes of people who are just trying to find employment. It’s the epitome of kicking someone when they’re down.\n\nCybersecurity firm eSentire has issued a warning about a hacking group that launched a spearphishing campaign on LinkedIn.\n\nLinkedin Phishing Campaign User\nFake job offers lead to a backdoor trojan. This gives the hackers control over the users’ computers and data. Not only are they unemployed, now they are losing everything connected to their computers. During the pandemic, this is their lifeline.\n\neSentire’s Threat Response Unit (TRU) was able to put together how the LinkedIn phishing campaign worked. A user of the social media site would get a malicious zips file in an email offering a job position that matched up with their LinkedIn profile.\n\nOnce a user opened the zip file, the more_eggs backdoor was launched. It could download even more malicious plug-ins, giving the hackers access to the user’s computer. The backdoor was then sold to other hackers, leading to all sorts of malware.",
			"added": 1617899531
		},
		{
			"topic_id": 1617932358,
			"title": "Signal embeds shady cryptocurrency in its service",
			"body": "[osnews.com](https://www.osnews.com/story/133275/signal-embeds-shady-cryptocurrency-in-its-service/)\n\nMany technologists viscerally felt yesterday’s announcement as a punch to the gut when we heard that the Signal messaging app was bundling an embedded cryptocurrency. This news really cut to heart of what many technologists have felt before when we as loyal users have been exploited and betrayed by corporations, but this time it felt much deeper because it introduced a conflict of interest from our fellow technologists that we truly believed were advancing a cause many of us also believed in. So many of us have spent significant time and social capital moving our friends and family away from the exploitative data siphon platforms that Facebook et al offer, and on to Signal in the hopes of breaking the cycle of commercial exploitation of our online relationships. And some of us feel used.\n\nSignal users are overwhelmingly tech savvy consumers and we’re not idiots. Do they think we don’t see through the thinly veiled pump and dump scheme that’s proposed? It’s an old scam with a new face.\n\nAllegedly the controlling entity prints 250 million units of some artificially scarce trashcoin called MOB (coincidence?) of which the issuing organization controls 85% of the supply. This token then floats on a shady offshore cryptocurrency exchange hiding in the Cayman Islands or the Bahamas, where users can buy and exchange the token. The token is wash traded back and forth by insiders and the exchange itself to artificially pump up the price before it’s dumped on users in the UK to buy to allegedly use as “payments”. All of this while insiders are free to silently use information asymmetry to cash out on the influx of pumped hype-driven buys before the token crashes in value. Did I mention that the exchange that floats the token is the primary investor in the company itself, does anyone else see a major conflict of interest here?",
			"added": 1617932318
		},
		{
			"topic_id": 1617968655,
			"title": "Nancy Pelosi Rents Office Space To Group Designed By Pedophile, Connected To Pedophilia And Child Porn",
			"body": "[nationalfile.com](https://nationalfile.com/nancy-pelosi-rents-office-space-to-group-designed-by-pedophile-connected-to-pedophilia-and-child-porn/?utm_source=rss&utm_medium=rss&utm_campaign=nancy-pelosi-rents-office-space-to-group-designed-by-pedophile-connected-to-pedophilia-and-child-porn)\n\nDemocrat House Speaker Nancy Pelosi personally rents office space to a child welfare group, First 5 San Mateo County, that was set up by a convicted pedophile. The group partners with a nonprofit that ran a group house where child molestation occurred and partners with a conflict resolution center that had a volunteer convicted for storing hundreds of images of child porn. NATIONAL FILE has exclusively obtained the lease documents showing that Nancy Pelosi is the group’s landlady dating back to 2002, the same year monstrous pedophile Dr. William Ayres was given an award by city politicians for his work with the group. By that time, numerous pedophilia allegations including a police report had been made against Ayres, who was later convicted on pedophilia charges in 2007 and died in prison.\n\nFirst 5 is a statewide supposed child welfare group in California that was previously chaired on a state level by Rob Reiner, and is funded with cigarette tax money. California is in the middle of a massive crisis involving child sex trafficking allegations and pedophilia arrests in the Child Protective Services (CPS)/foster care system. In fact, California does not even send out an Amber alert for missing foster care children, instead counting them all as runaways. San Mateo County, where pedophile Ayres set up the local First 5 chapter that calls Pelosi landlady, is arguably the center of the child sex trafficking crisis in California. Nancy Pelosi spends a lot of time in San Mateo due to her friendship with San Mateo lawyer and Democrat fundraiser Joe Cotchett. Cotchett, who is picking federal judges for the Biden administration, and was accused by his ex-wife in his divorce case of physically assaulting his children and being nude around his daughters. A partner in Cotchett’s law firm protects judges from her perch on the Commission on Judicial Performance.\n\nOur source explained, “Pedophile Dr. William Ayres served with former San Mateo County District Attorney Jim Fox and former San Mateo County Supervisor Richard Gordon on the San Mateo County Children and Families First Commission (now called the First 5) in the early 2000s. Ayres designed the group in San Mateo. Rich Gordon was instrumental in having Ayres employed by the commission and honoring him with the lifetime achievement award. After his time on the board of supervisors in San Mateo, Democrat Rich Gordon became an assemblyman in Sacramento. There were red flags about Ayres for decades. I believe that First 5 knew because there is a broad representation on the commission.”",
			"added": 1617968614
		},
		{
			"topic_id": 1617975007,
			"title": "Can Blood from Young People Slow Aging? Silicon Valley Has Bet Billions It Will",
			"body": "[newsweek.com](https://www.newsweek.com/2021/04/16/can-blood-young-people-slow-aging-silicon-valley-has-bet-billions-it-will-1581447.html)\n\nEarlier this year, Grifols closed on a $146 million-deal to buy Alkahest, a company founded by Stanford University neuroscientist Tony Wyss-Coray, who, along with Saul Villeda, revealed in scientific papers published in 2011 and 2014 that the blood from young mice had seemingly miraculous restorative effects on the brains of elderly mice. The discovery adds to a hot area of inquiry called geroscience that \"seeks to understand molecular and cellular mechanisms that make aging a major risk factor and driver of common chronic conditions and diseases of older adulthood,\" according to the National Institutes of Health. In the last six years, Alkahest has identified more than 8,000 proteins in the blood that show potential promise as therapies. Its efforts and those of Grifols have resulted in at least six phase 2 trials completed or underway to treat a wide range of age-related diseases, including Alzheimer's and Parkinson's.\n\nAlkahest and a growing number of other geroscience health startups signal a change in thinking about some of the most intractable diseases facing humankind. Rather than focusing solely on the etiology of individual diseases like heart disease, cancer, Alzheimer's and arthritis—or, for that matter, COVID-19—geroscientists are trying to understand how these diseases relate to the single largest risk factor of all: human aging. Their goal is to hack the process of aging itself and, in the process, delay or stave off the onset of many of the diseases most associated with growing old.\n\nTo test out his hypothesis, Rando conjoined elderly mice with younger rodents so that they shared the same circulatory system, then tested their ability to heal small wounds. The results were dramatic. Elderly mice were able to repair small tears in their muscles far faster than their peers not conjoined to younger mice. The younger mice, on the other hand, healed far slower than they normally would.\n\nThe results were exhilarating. They suggested that stem cells could be revitalized simply by reintroducing back into the blood stream the molecules, present in young blood, that could turn them on. The next step was finding the specific youth-promoting factors in the blood responsible for the change. But that would not be easy.",
			"added": 1617974965
		}
	],
	"topic_vote": {
		"1612546234_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1612700256_12yaDiCxvgRDRn3xUVdxM2PDUwJhKZ7GGB": 1,
		"1612927209_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613014388_1NdUxC9ySwvpHrg5EdL5H3BAiUdPkqJyqM": 1,
		"1612976844_16E25Tu9jf8GTS2S1W5mZs6Ayc9vQkC8SN": 1,
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1613128614_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613142823_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": 1,
		"1613152940_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1,
		"1613642362_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613831892_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613921922_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613979442_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613919312_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613912064_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1614062736_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1614109016_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1,
		"1614206367_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": 1,
		"1614509069_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": 1,
		"1614247182_1NSyEdCNMmed6Er224HDTUY6iyhdVEeRG2": 1,
		"1615284757_151PYjK7U3iMqZMtdoVVSBQXrA55XghrVU": 1,
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": 1,
		"1605111093_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"1615487471_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1615689898_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1614402994_168Diza6QrAArkHB5AFJESWpNAkKgUWvtw": 1,
		"1570989643_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"1616203894_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1616239441_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1616339553_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1616503348_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1616896201_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1615300036_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": 1,
		"1616553738_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1616864409_1ASw9nbUv8QsYxWggwsMsNZ37STaEo26Di": 1,
		"1616871818_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1617244448_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1617658789_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1617873274_1Nv7HrYvwPjyGyx6iUG7KZrj4TNduUBcah": 1,
		"1617373305_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1617899570_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1617932358_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1617968655_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1612700256_12yaDiCxvgRDRn3xUVdxM2PDUwJhKZ7GGB": [
			{
				"comment_id": 1,
				"body": "[Galacteek](https://galacteek.github.io/) offers a lot more.\n\n- Decentralized Identifiers (DID) support with IPID\n- Browser-to-browser DID authentication over libp2p streams (Verifiable Credentials with RSA-PSS)\n- Browsing sessions with automatic pinning (pins every page you browse)\n- Distributed chat with pubsub (chat channels syncronized with CRDT+DAG)\n- File manager with drag-and-drop support and timeframes (per-day view of files in the MFS)\n- File sharing\n- BitTorrent to IPFS bridge\n- Tor support\n- Search content with the ipfs-search search engine as well as with cyber\n- Built-in blog with Atom feeds\n- Webcam to IPFS capture (image and videos)\n- Basic built-in media player with IPFS-stored playlists\n- Image viewer and QR codes support\n- Use the IPFS filestore to avoid file duplication\n- ENS (Ethereum Name Service) resolving (access to ENS+IPFS websites)\n- Run WASM binaries with wasmer (use Open on a WASM object from the clipboard manager)",
				"added": 1612727088
			}
		],
		"1612927209_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 2,
				"body": "> boot13: Please stop posting this fact-free garbage\n\nYou are the garbage you fkn fool!",
				"added": 1612987797
			}
		],
		"1613425717_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Debian stable",
				"added": 1613425753
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 4,
				"body": "https://open.lbry.com/@AgoraTVNEWS:5/26_Et-en-plus-ils-s%27enrichissent:4\n\nhttp://d.p.h.free.fr/covid19",
				"added": 1613835273
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 5,
				"body": "NO!",
				"added": 1613921354
			}
		],
		"1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 6,
				"body": "[luakit](https://github.com/luakit/luakit/)\n[nyxt](https://github.com/atlas-engineer/nyxt/)\n[w3m](https://github.com/tats/w3m/)",
				"added": 1614694234
			}
		],
		"1614693108_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 7,
				"body": "> [deuxzaron](#comment_105_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): When you have the money to help save lives, and you do just that. And then people hate you for it\n\nHelp and save lives ??? You're a big fkn brainwashed morron believing Gates helping and saving lives.  You fkn retard!!",
				"added": 1614944794
			},
			{
				"comment_id": 8,
				"body": "> [calmdownholden](#comment_22_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Oh, quit your conspiracy theory bullshit please.He didn't \"switch\".As soon as he made bank he started getting invested in art, photography, philanthropy, etc.The philanthropy lead to an interest in diseases.After being outed as moderately narcissistic and sociopath in the Microsoft monopoly case, he turned his focus towards more philanthropy; partially to repair his image and legacy, partially to improve himself and the world around him.He's analytical. Deal with it.\n\n You blind fkn fool. Dont forget to take the fake vaccine and bring all your relative with you PLEASE!!!",
				"added": 1614944947
			}
		],
		"1617244448_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 9,
				"body": "> [deuxzaron](#comment_126_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Why do people post fake news that can be very easily verified? Just look on Youtube. Dislike is still there. Even on Biden videos. Announced on Twitter? Nothing there. You sure this isn't an April Fools joke?\n\n[YouTube deletes more than 2.5M dislikes from Joe Biden’s White House channel](https://reclaimthenet.org/youtube-deletes-dislikes/)\n\nAbout 2.5 million dislikes have been removed from Biden videos on the official White House channel since Biden became president, according to an analysis.",
				"added": 1617718280
			}
		],
		"1617932358_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 10,
				"body": "> [darkoo](#comment_37_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG): A few years ago I solved this mental problem this way : I see more \"my\" digital devices, as a table in a market... In the sense, I don't expect privacy on it, even if I try my best to achieve a little. I hope it helps. [...]\n\nI never used signal. I use [P2P ONLY](https://ipfs.io/ipns/k2k4r8psab16o6xcobtp7s72b0yris8zhgjjn19vx961ryam0j1wrrjz)",
				"added": 1617957292
			}
		]
	},
	"comment_vote": {
		"62_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"40_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"21_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"1_1MQYwBXkiSJupZey2tuHxT4B7CpHU1ravx": 1,
		"14_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"2_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu": 1,
		"10_1Dsw1CpgZiPYkVWLiqrgMJDTyXWEggCg2m": 1,
		"4_13kyRkukBSEXhXA3w72Gv1mo5n7Pgtuqg5": 1,
		"8_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"35_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"9_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"5_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": 1,
		"6_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"5_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7": 1,
		"3_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"79_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"74_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"52_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"3_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8": 1,
		"246_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"2_1DEsTiJMbpa4RVnszAq66me45KxFxPxvt5": 1,
		"9_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"294_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"19_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"642_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1_18Lb3iZCdFAg3pvxgeTo6oe7qPTeRjR2dm": 1,
		"36_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": 1,
		"4_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": 1
	}
}