{
	"title": "GrandPhil Blog",
	"description": "Blogging since '17",
	"links": "[ZeroMail](/Mail.ZeroNetwork.bit/?to=grandphil)\n\n[PC Watercooling Project](/grandphil.bit/?Toc=tag:PCWC)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1539296840,
	"post": [
		{
			"post_id": 9,
			"title": "PCWC: Part 2 - The Planning",
			"date_published": 1539292200,
			"body": "For every water cooled PC, there is quite some planning to do when you want to get everything you need in just a single order. In practice, this proves to be very difficult for a beginner like me.\nFirst, you'd want to know how much cooling is required to keep your components from overheating. It heavily depends on the hardware you use and whether you are going to overclock it.\n\nA good starting point is probably the EKWB Configurator ([https://www.ekwb.com/custom-loop-configurator/](https://www.ekwb.com/custom-loop-configurator/)). Even if you don't want to use any of the EKWB cooling gear. It asks you which components you want to cool and if you want to overclock things or prefer a more silent build.\n\nI want to cool my CPU, Mainboard VRM, and my GPU and I'd like to overclock CPU and GPU as you might know from part 1\\. The configurator estimates my heat load to be 505W and recommended to me two 360mm slim radiators. Luckily the case features enough space for three 360mm radiators so space won't be a problem here. I decided to get one 360mm long 28mm thick radiator and place it on the side and one 360mm long 60mm thick radiator and place it on the top.\n\nYou also need water blocks for the components you want to cool. This is usually the simple part. If you want to cool your CPU simply get a normal CPU water block. If you want to cool the Mainboard VRM as well, get a Monoblock specified for your Mainboard. And finally get a GPU water block specified for your GPU.\nYou don't have to go with EKWB but I liked the design of them. I went with these water blocks:\n\n*   EK-FB MSI Z270/Z370 GAMING RGB Monoblock - Nickel\n\n*   EK-FC1080 GTX Ti - Nickel\n\nTo connect the water blocks you need tubing. There are two types of tubing: rigid and soft tubing. Rigid tubing might look nicer while soft tubing is easier to handle. Since I prefer hard tubing, I am only explaining the process for this type of tubing but there are no huge differences between them. I bought four 80cm tubes which should be more than necessary. I ended up ordering another one because I miserably failed at bending the tubing. I will be covering more about bending rigid tubing in a future part.\n\nNext, you also need a water reservoir and a pump. You can't really make a bad choice here. Just take one that fits inside your case and looks nice. This is the one I decided to buy.\n\n*   Alphacool Eisbecher D5 250mm Acetal inkl. 1x Alphacool Eispumpe VPP755\n\nTo connect tubes to your water blocks and radiators you also need fittings. Look for them to be compatible with the type of tubing you choose. For hard tubing, you want to get compression fittings. They compress a rubber ring around the tube to create a waterproof connection. You can also use angled fittings to make bending the tubes on some places easier. It depends on your components how much fittings you need. To help visualize the loop I recommend to sketch the positioning and the tubes on a piece of paper or drawing software. These are my sketches, the green dots indicate fitting connections. The first picture shows the arrangement of the components and in the second one I planned the tubing:\n\n![wak_.png (0x0)](data/img/post_9_wak_.png)![wak__tube.png (0x0)](data/img/post_9_wak__tube.png)\n\nLook at those amazing drawing skills!\n\nI ended up needing a total of ten fittings. I decided to buy six of the 90° angled fittings and a pack of six normal fittings just to have some spares. Four angled fittings on each radiator and two on the GPU. This is where I made my first mistake. To screw the angled fittings into the radiator you need an extension between fitting and radiator because otherwise, the fans you are going to position on the radiator will block the angled fitting. So I added four extensions. Another sketch I made for clarification:\n\n![radiator.png (0x0)](data/img/post_9_radiator.png)\n\nSo this is my final shopping list for all the watercooling parts I need:\n\n*   1 x EK-FB MSI Z270/Z370 GAMING RGB Monoblock - Nickel\n*   1 x EK-FC1080 GTX Ti - Nickel\n*   1 x Alphacool Eisbecher D5 250mm Acetal incl. 1x Alphacool Eispumpe VPP755\n\n*   1 x Alphacool Eisrohr 13/10mm PETG HardTube 80cm - 4pcs\n\n*   6 x Alphacool Eiszapfen 13mm HardTube compression fitting 90°\n\n*   1 x Alphacool Eiszapfen 13mm HardTube compression fitting sixpack\n\n*   4 X Alphacool Eiszapfen extension 20mm\n\nIn part 3 I am going to complete the shopping list with other useful things and give you a quick overview of reputable retailers."
		},
		{
			"post_id": 8,
			"title": "PCWC: Part 1 - The Hardware",
			"date_published": 1539027000,
			"body": "The PC Watercooling Project is about building my first PC Watercooling.\n\nIn this first part I'm going over the hardware I'm using.\n\n**Mainboard**: MSI Z370 Gaming Pro Carbon\n**CPU**: Intel Core i7 8700K\n**RAM**: 2x Corsair Venegance 7 GB DDR4 3200 MHz\n**GPU**: Nvidia GTX 1080 Ti Founders Edition\n**Power Supply**: Be Quiet! Dark Power Pro 1000W\n\nThis Power Supply is probably absolute overkill but it was the most fitting PSU I already own.\nI don't want Watercooling just for the aesthetics, I want to overclock things! So I already tried to overclock the CPU to 5 GHz.\n\nIt worked at first with no problems but after doing a stress test the Processor quickly started reaching 95°C and thermal throttling. There is no way around changing the thermal interface material between Die and Heatspreader when you plan to overclock. So I'm going to delid the CPU and use liquid metal instead of the standard paste Intel uses. The whole process about preparing the Hardware for overclocking / water cooling is going to be handled in Part 4\\. This includes applying the Water Blocks to Mainboard and GPU.\n\nBecause I still want to use my PC without frying my processor I returned to stock clocks.\nWith all this Hardware I also need a nice Case to put all the Watercooling gear in. I want something with Glass side panels and enough space for quite a bunch of Radiators. A clean and simple case. I went for the [LianLi O11 Dynamic](http://www.lian-li.com/pc-o11-dynamic/) (Clearnet Link!). Here you get an image of this thing.\n\n![lianli011dynamic.png (0x0)](data/img/post_8_lianli011dynamic.png)\n\nJoin me in part 2 when I start planning which parts I need for water cooling.\n\nOh yeah. And let me know what you think about this project so far. Did you already think about water cooling your PC?"
		},
		{
			"post_id": 7,
			"title": "Let's start over",
			"date_published": 1538860500,
			"body": "After complete silence for one year, it is finally time to revive this blog.\n\nMy idea is to write about random things that happened to me in my everyday life.\n\nSo currently I'm building a custom Watercooling for my Gaming PC. I'm planning to post about my progress here. Maybe it's helpful to other Zeronet Users.\n\nSee you later!"
		}
	],
	"tag": [
		{
			"value": "PCWC",
			"post_id": 8
		},
		{
			"value": "Meta",
			"post_id": 7
		},
		{
			"value": "PCWC",
			"post_id": 9
		}
	]
}