{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1615585805,
			"title": "dear erik prince !",
			"body": "I am fucking impressed with the fleet ! amazing, more guns, more power !",
			"added": 1615585804
		},
		{
			"topic_id": 1615585941,
			"title": "Glory to the Vatican !",
			"body": "god blesses you to not have fallen in the crap pool !\nyou wait for a return isn't it? I guess, but who I am to judge, that this non aligment is NECESSARY ... there is no other option. none.",
			"added": 1615585939
		},
		{
			"topic_id": 1615593042,
			"title": "How would you invest to defend Taiwan, one of the few area not under UNO control?",
			"body": "Discussion !",
			"added": 1615593039
		},
		{
			"topic_id": 1615614143,
			"title": "USA being taken down + EU = new China + UNO CHINA...",
			"body": "there is no one left to liberate us but ourselves !",
			"added": 1615614139
		},
		{
			"topic_id": 1615615805,
			"title": "what's the future of israel once nethanyahoo is gone?",
			"body": "UNO take over using a charismatic leader who will crush and censor all opposition using the usa/eu/china model? maybe... at least you are warned.",
			"added": 1615615800
		},
		{
			"topic_id": 1615616402,
			"title": "an individual strategy in the UNO framework?",
			"body": "work hard, get on top of the world gov, kill the children of bill gates and all american traitors legally backed and as the UNO world gov using various so called nations as proxy. smart... ez... efficient and what will happen anyway :). hahaha",
			"added": 1615616396
		},
		{
			"topic_id": 1615625783,
			"title": "The goal of Barr/trump in pedogate isn't only to protect themselves and their buddies",
			"body": "but to accentuate the wage between common defense (usa, dod, fbi, nsa, cia etc) and we the people, to of course foster the UNO agendas. \n\nsmart, I guess trump/barr and the us pedos didn't get that :) naturally too low iq :).",
			"added": 1615625776
		},
		{
			"topic_id": 1615627648,
			"title": "what will the idf do if/when there is a bug with the vaxx?",
			"body": "as they vaxxed them all, and the reserves and vets... I hope it's a lie, and only half at worst :). will see... time will tell, as always.",
			"added": 1615627640
		}
	],
	"topic_vote": {
		"1615614143_1FHHvsRRQx2WLVx4pgVwk2v9q51Kj4rhwX": 1
	},
	"next_comment_id": 57,
	"comment": {
		"1615580474_13jbVt6WuLu9Rp7YZwUceYVkYgyaxBfWWk": [
			{
				"comment_id": 1,
				"body": "treason 101... all is written. no need to ask rinos or demoNcrats... all is there. \n\nstep 1 overthrow the dod traitors\nstep 2 wipe congres , scotus . wh\nstep 3 elections, honest fair, 1 man 1 vote (aka everyone legal resident over 18 reduce less migrants regularized to win, aka real americans)\nstep 4 peace wih china / russia = neutrality\nstep 5 too the stars !\n\nor die trying to fullfil an agenda of submission, the babelians.",
				"added": 1615581830
			},
			{
				"comment_id": 2,
				"body": "I already imagine pedo austin dreaming of his african child sex slaves ! what a pig ! fucking traitors, like all before him... all those slimballs... what 's the name of the gay of malta?`",
				"added": 1615581892
			},
			{
				"comment_id": 3,
				"body": "16.1  Significantly reduce all forms of violence and related death rates everywhere \n\nthat's the BEST, their war on war itself !! just LoL !!! you will never disarm PLA ! dream off !",
				"added": 1615581971
			},
			{
				"comment_id": 4,
				"body": "and that's what I said syria was a low iq djhadis trap ! well done kiddies... well done... next gen soon ready for the next wars !",
				"added": 1615582030
			},
			{
				"comment_id": 5,
				"body": "because I think there is ONLY ISLAM to defeat you and burn your cities to the ground...",
				"added": 1615582046
			},
			{
				"comment_id": 6,
				"body": "there is no way in the middle, or it's quran law : SHARIA or it's yours. one will die.",
				"added": 1615582071
			},
			{
				"comment_id": 7,
				"body": "american intelligence... we could be on alpha santori without all this shit !",
				"added": 1615582107
			},
			{
				"comment_id": 8,
				"body": "all of htis to pimp in your shit mcmansion without even helipads? suckers... like the b52 vietnam pilot... what the fuck NAV !",
				"added": 1615582159
			},
			{
				"comment_id": 9,
				"body": "there is all the treason from the dod explained ! shame on you for eternity. death to your children. death to you.",
				"added": 1615584249
			},
			{
				"comment_id": 10,
				"body": "I see it's going well... your real challenges are china and israel... you know that putin isn't eternal, and it's your bet...\n\nfor israel... I mean, a donkey has a flexible mind in relation to them :) (and it's a compliment), the Chineses... you are too dumb to rule them... islam...yeah you control the sunnah leaders... for how long? the shia? I don't know... \n\nafterall only God knows.\n\nI just see what I read. and understand better what I didn't. what a shame, and the worst you really believe you are patriots at the dod, patriots of the UNO... that's for sure. shame on you. for eternity.",
				"added": 1615584431
			},
			{
				"comment_id": 25,
				"body": "a little... And then I ask myself European Union = new china? And EU + UNO CHINA = global tyrannies on earth? alexjones seems right...",
				"added": 1615613994
			}
		],
		"1611850021_1N6HArdCgfF7zK7vWNR5UEPBDSXAbv2WEN": [
			{
				"comment_id": 11,
				"body": "nailed. real diversification and uncorrelation is only possible through investment in non uno aligned countries... otherwise it's all a lie !\n\nwant to know more? read the wsb :) where wars are financed.",
				"added": 1615585009
			},
			{
				"comment_id": 50,
				"body": "+1",
				"added": 1615627673
			}
		],
		"1615585941_1FHHvsRRQx2WLVx4pgVwk2v9q51Kj4rhwX": [
			{
				"comment_id": 12,
				"body": "so they all have fallen but the vatican and eretz external areas... seem normal to me ! birth place and the foundation... nice ! enough :).",
				"added": 1615586001
			},
			{
				"comment_id": 13,
				"body": "applauze, but but, let's wait for the final judgement, but I am very satisified with the current position. no more, no less. exact.",
				"added": 1615586063
			},
			{
				"comment_id": 14,
				"body": "conclusion, I have to learn latin :) great !",
				"added": 1615586160
			}
		],
		"1615593042_1FHHvsRRQx2WLVx4pgVwk2v9q51Kj4rhwX": [
			{
				"comment_id": 15,
				"body": "air - sea - space (land - floating) - cyber !\n\nI like C-rams ! it works great... 1 each 1km + 1 higher... as just for this gen.\nI like short range nuclear tactical nuke : it blasts everything under and on surface. \nI like to be able to detect subs and be able to wall before the coast (submarine invasion)\nI like david-sland and co against planes and drones\nI like long range nuclear real munition : to get deeper into mainland territory for retaliation (to raze greater bay area, beijing, and all major cities over 1m people)\nI like to be able to saturate the sky with mrvs, armed and decoy.\n\nwhat else?\n\ndefense is easier from a static unsinkeable position.\n\ncyber? deconnect and true decentralized + isolation back ups in a different full chips logic.",
				"added": 1615593308
			},
			{
				"comment_id": 16,
				"body": "cost 2 trillions, wild guess... just for this gen to 2025.",
				"added": 1615593346
			},
			{
				"comment_id": 17,
				"body": "by 2024 the next tranche should be ready and that for a little cost of 4 additonal trillions... objective is to reach 20 trillions deployed by 2030 !\n\nthe idea is very simple : or ccp leaves the UNO, denounces it to never again return to such a crap, and then all stops immediatly, or ccp keeps being serfs to the UNO, and the turtle gets harder and harder and harder, until the world armies combined would be defeated !\n\na lot of the buget goes underground, aka being able to absorb full on nuclear strikes and to deploy lazers and more once readily available.\n\nfor me the air war takes place behind taiwain... it sound strange but the front won't be for humans :). and that's the whole point.\n\nis the usa still capable of doing this? greedy enough? time will tell... or maybe ccp is really about liberation... time will tell...",
				"added": 1615593956
			},
			{
				"comment_id": 18,
				"body": "for me all of this is very cheap !",
				"added": 1615593967
			},
			{
				"comment_id": 19,
				"body": "it's the exponential war walls. not about words, but maff. if ccp capitulate, and renounce UNO FOREVER discussion, otherwise, scaling, and FAST... HUUUUUURRRRYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY\"!!! it's really URGENCYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY!",
				"added": 1615594042
			},
			{
				"comment_id": 20,
				"body": "then I would like 3 Arleigh Burke-class guided missile destroyers under us flag north mid south facing china, in taiwanese territorial water + some others doing rounds... again, you aren't facing the UNO, but it's proXI and it's way way more advance than you are lead to believe, the goal is just to scoot... it always makes things more difficult.\n\nthe deal is simple as long as ccp doesn't leave the UNO, taiwan get stronger.\n\nthen it's really a question of political will, intelligence and greed !\n\nit's the perfect opportunity to really scale american war industries... just the cram first batch made and installed is a lot of work ! and as you saw, just the beginning !\n\nstop the UNO and all it's proxies. once and for all. at what ever the cost.",
				"added": 1615594879
			},
			{
				"comment_id": 21,
				"body": "why not at least build 9 more  Zumwalt-class ? so the first 3 can soon replace the 3 in taiwanese water?",
				"added": 1615595082
			},
			{
				"comment_id": 22,
				"body": "what is going wrong with this dod? at pla, once out of the UNO shakles it will be the moon and beyond, so fast, you will believe it's FTL :).",
				"added": 1615595112
			},
			{
				"comment_id": 23,
				"body": "subs subs subs...",
				"added": 1615595936
			},
			{
				"comment_id": 24,
				"body": "> [styromaniac](#comment_3024_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Buy made in Taiwan goods?\n\nno, not enough industrial capacity...",
				"added": 1615613929
			},
			{
				"comment_id": 26,
				"body": "https://www.zerohedge.com/geopolitical/war-games-showed-us-would-lose-fast-against-china-if-it-invaded-taiwan-us-general\n\nusa is fighting ground between UNO (demoNcrats + rinos) vs patriots\neu is controlled by UNO like each member state (specially france)\nchina is UNO...\n\nmaybe time to wake up? just maybe...",
				"added": 1615614281
			},
			{
				"comment_id": 27,
				"body": "you know it's like in bowling,... some time it's just important to throw the ball, to wreck a little...\n\nmaybe starting with an ICC operators campaign with bidet as cover? you know, just saying...",
				"added": 1615614351
			},
			{
				"comment_id": 28,
				"body": "just to be clear i am 100% for the reunification of china, 1 china etc, but the CCP is still under the control of the UNO. as such... I am now with taiwan.",
				"added": 1615614528
			},
			{
				"comment_id": 29,
				"body": "aka to taiwan belongs to the mainland, but if taiwan with the mainland start to be the occupiers for the UNO, I will switch again, until all the UNO personals are DEAD, taiwanese, mainlanders or americans.",
				"added": 1615614580
			},
			{
				"comment_id": 30,
				"body": "and including emmanuel macron, imposter president of occupied france.",
				"added": 1615614615
			},
			{
				"comment_id": 34,
				"body": ">Amid the Sino-Soviet split and Vietnam War, United States President Richard Nixon entered into negotiations with Communist Chairman Mao, initially through a secret 1971 trip undertaken by Henry Kissinger to visit Zhou Enlai. On 25 October 1971, Albania's motion to recognize the People's Republic of China as the sole legal China was passed as General Assembly Resolution 2758. \n\nin short henry kissinger is the devil.",
				"added": 1615615466
			},
			{
				"comment_id": 35,
				"body": "one man as fucked the west, the usa, and china !",
				"added": 1615615490
			},
			{
				"comment_id": 36,
				"body": "so the question how does henry kissinger feats into pedogate origins?",
				"added": 1615615543
			},
			{
				"comment_id": 37,
				"body": "and in short taiwan was the traitor earlier, before 1971?",
				"added": 1615615584
			},
			{
				"comment_id": 38,
				"body": "and more probably certainly still is, just not allowed by the mainland.",
				"added": 1615615621
			},
			{
				"comment_id": 45,
				"body": "> [e2333333](#comment_1_1F8AqiV4hBFyVL3gkvKP7GyiR39c3YQt8S): what is UNO?papercard?\n\nGreat question. it's the real name of the United Nations organization, they like now to call themselves UN to imply they have become the world authority and rule maker.\n\nfor more information please read this  : https://www.un.org/en/development/desa/population/migration/generalassembly/docs/globalcompact/A_RES_70_1_E.pdf\n\nor search it yourself on their website : uno global agenda 2030... \n\nhave a nice day.",
				"added": 1615624259
			}
		],
		"1615614143_1FHHvsRRQx2WLVx4pgVwk2v9q51Kj4rhwX": [
			{
				"comment_id": 31,
				"body": "what I don't understand is the treason of nato, french so called secret service + army, and in the usa... I mean...",
				"added": 1615614824
			}
		],
		"1611430566_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 32,
				"body": "I see all the french politicians in love and admiration with navalny. all those french politicians have betrayed me and for generation. I come to the only conclusion : navalny must die. absorb the protest in the cold. end.\n\nmost young people are too dumb and believe in the one world gov, no border, no country etc.\n\nthey believe it will be the utopia and all will get a high paying job in paris or london or miami.\n\nthey will be global citizen..,\n\nthey forgot, it will just be SU on a global scale.\n\nand that's a positive or happy outcome\n\nit can be much worse.\n\nnavlany dies today.\n\ntoo big of a risk.\n\nunless navalny is profoundly against the UNO and ready to nuke the ICC\n\nin this case, putin is gettting old.\n\nbut I bet navalny is just UNO / EU / browder and co front.\n\nfronts are made to die.",
				"added": 1615615264
			},
			{
				"comment_id": 33,
				"body": "> [peace001](#comment_4_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX): (Serious topics to be discussed on serious site, in order to avoid the troubles of 50 K limit by Nofish. )\n\ndelete user.json\n\nyou value a digital ID, when your own body is mortal, you are lost in your value appreciation.",
				"added": 1615615331
			}
		],
		"1615615805_1FHHvsRRQx2WLVx4pgVwk2v9q51Kj4rhwX": [
			{
				"comment_id": 39,
				"body": "do you count the votes with the machines? or print ballots without ids? hmmm... you will have no one to blame but yourselves...",
				"added": 1615615923
			}
		],
		"1615616402_1FHHvsRRQx2WLVx4pgVwk2v9q51Kj4rhwX": [
			{
				"comment_id": 40,
				"body": "or defeat the uno, which will save the children of bill gates :). but how (defeat the uno) on an individual basis?",
				"added": 1615616449
			},
			{
				"comment_id": 41,
				"body": "they remind me of the bolshevicks, they were so happy to have won all of russia, and then they meet the georgians :). heheheh.",
				"added": 1615619829
			}
		],
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 42,
				"body": "go back to twitter and the UNO digital framework for global take over.",
				"added": 1615620633
			},
			{
				"comment_id": 43,
				"body": "> [wwg1wga](#comment_24_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Look idk what you do in your free time, and I do not CARE what you do in your free time man! xD\n\nwanker!",
				"added": 1615620656
			},
			{
				"comment_id": 44,
				"body": "> [peace001](#comment_7_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX): The above user-level moderation mentioned \"erase the comment\", which may be taken as censorship in the traditional web. Such style moderation may be against the pursuit of total freedom of speech.  However, another style of operation can bePin comments to the top which will help people better fight against some rubbish comments, while at the same time, not go to the extremity of censorship as by Twitter, Facebook, etc.\n\nthere is no middle path... or it's free speech and pedocontent will be available for the wicked (see most zsite but those only text based) or it's not free speech and very fast it will become twitter/UNOdigitalframework.\n\nno middle path.\n\njoin bitmessage... pure text.",
				"added": 1615622888
			},
			{
				"comment_id": 46,
				"body": "> [peace001](#comment_8_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX): Free information without censorship is a special emphasis on ZeroNet. However, the 50 K data limit can become a dangerous censorship for some users who don't know how to or just don't like to create independent forums on Zeronet, on serious topics.  Then it means that the 50 K limit will be quickly run out, and become another variation of censorship in a new style.About User-level moderation  [...]\n\nwrong you just delete the user.json and move to a new one. don't get attached to anything, let it go, and what can't will remain, always.",
				"added": 1615624577
			},
			{
				"comment_id": 47,
				"body": "> [peace001](#comment_9_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX): By the way, is Nofish still alive or not? Is he disappeared by Covid19? It's indeed a matter of concern for active users who care about ZeroNet's progress.\n\nlearn to code.",
				"added": 1615624602
			},
			{
				"comment_id": 48,
				"body": "> [peace001](#comment_9_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX): By the way, is Nofish still alive or not? Is he disappeared by Covid19? It's indeed a matter of concern for active users who care about ZeroNet's progress.\n\nyou want his keys to delete posts here? right?",
				"added": 1615625693
			}
		],
		"1615625783_1FHHvsRRQx2WLVx4pgVwk2v9q51Kj4rhwX": [
			{
				"comment_id": 49,
				"body": "and of course to create a symetric wedge between the troops and the people.\n\nthe troops must see the people as the enemies\nand the people the troops as theirs.\n\nit's a full take down of the republic, it's history, past, present and future.\n\nremember western ruling class are too low iq to compete with the chineses in the nwo take over battle... it's for now, armless... but if you follow a little you will understand.\n\nxi maybe going ashtray, however \"his\" ship has YUGE inertia...",
				"added": 1615625986
			}
		],
		"1578088043_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 51,
				"body": "+1",
				"added": 1615627703
			}
		],
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 52,
				"body": "https://www.feinstein.senate.gov/public/_cache/files/a/7/a77ca0d0-07b0-4cc1-8ce5-271997fe1947/063DD11B94F08E05113DFC5F9841B0C4.assault-weapons-ban-of-2021.pdf\n\nwill see if it goes as easily as raping kids with full legal immunity. I believe it will, however I could be wrong... and hope so ! Independence war 2 or death of the republic > chose, soon it won't be possible anymore.",
				"added": 1615627919
			},
			{
				"comment_id": 53,
				"body": "who will blade feinstein? or bat her or her kids? https://en.wikipedia.org/wiki/Katherine_Feinstein",
				"added": 1615628162
			},
			{
				"comment_id": 54,
				"body": "first the kid, then snipe her and her buddies at the funerals... more lulz :).",
				"added": 1615628199
			},
			{
				"comment_id": 55,
				"body": "Eileen Feinstein Mariano",
				"added": 1615628264
			},
			{
				"comment_id": 56,
				"body": "2 funerals... more fun !",
				"added": 1615628271
			}
		]
	},
	"comment_vote": {}
}