{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1558748943_1it9RV9vuxwM3fEdT6B9k5sGjn91kMkYp": [
			{
				"comment_id": 1,
				"body": "i've had the same problem and was able to solve it after reducing my content to a little bit less than 10 MB and modyfing the main index.html before publishing...",
				"added": 1558772214
			},
			{
				"comment_id": 2,
				"body": "Downloading more than 10 MB requires user interaction and that's a good thing. It protects the visitor from accidentally downloading a huge site. Someone could create a 1TB zite and flood your hard drive with garbage.",
				"added": 1558855022
			},
			{
				"comment_id": 5,
				"body": "> [boobaloo](#comment_6_1it9RV9vuxwM3fEdT6B9k5sGjn91kMkYp): Well, what do you know? I scrapped my original site and started completely over, with a completely different webpage, bare as bones, that was under 10MB and, viola! It uploaded without a hitch. Now, I am going to see if I can expand the size of the site now it is signed.\n\nAt least how to sign and publish a site that is larger than 10MB but other than that: nothing :)",
				"added": 1558942453
			}
		],
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": [
			{
				"comment_id": 3,
				"body": "voting or not voting...it doesn't matter they all suck",
				"added": 1558862111
			},
			{
				"comment_id": 4,
				"body": "use crypto, use decentralized websites, build useful things on top of it so they will lose power and of course spread the word",
				"added": 1558862285
			},
			{
				"comment_id": 6,
				"body": "here's what i would love to see\n\nEU bureaucrat: We've recently found out about your zite !\n\nZite owner: Yes SIR?\n\nEU bureaucrat: your zite does not comply with our garbage laws\n\nZite owner: Sorry SIR i didn't know that..\n\nEU bureaucrat: you MUST shut it down or we will PUNISH you... !!!!\n\nZite owner: okay i've just deleted my zite from my computer...\n\nZite owner: ...but what about the other 1000 peers who do have a copy of it ... ?\n\nEU bureaucrat: you're the owner so you MUST realease an updated version or we will PUNISH you !\n\nZite owner: but i've already deleted it like you wanted.....\n\nZite owner: sir i forgot you tell that someone stole my private keys yesterday...",
				"added": 1559041863
			}
		]
	},
	"comment_vote": {}
}