{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1513599200,
			"title": "Що корисне можна створити у ZeroNet?",
			"body": "У кого які ідеї на цю тему? Що ще крім шарінгу платних файлів тут можна реалузувати, але таке щоб притягувало і було цікавим користувачам звичайного інтернету?",
			"added": 1513599199,
			"parent_topic_uri": "2_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5"
		},
		{
			"topic_id": 1513621161,
			"title": "Розвиваємо український ZeroNet",
			"body": "Ділимося посиланнями на зайти українською які ще не мають пірів для 100% впровадження їх у ZeroNet\nСтворив українську ZeroWiki http://127.0.0.1:43110/1Ewfx8U1QvPs61QoKvoCdx775CLv1xbC7/",
			"added": 1513621159
		},
		{
			"topic_id": 1515875303,
			"title": "Анонімний збір коштів",
			"body": "Хто знає як можна зручно реалізувати анонімний збір коштів. Які варіанти, сервіси розглядати? Гугл не дав результатів. Потрібно для складчини але хочу перестрахуватися, якщо правовласники заметушаться))\n\n****\nПродублював питання на *RU* версії, там ніби аудиторія активніша: http://127.0.0.1:43110/0sh.bit/?Amb7",
			"added": 1515875300
		}
	],
	"topic_vote": {
		"2_1M6mvowPpeYyegFe6byJKP1aoehgKk84d2": 1,
		"5_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": 1,
		"3_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": 1,
		"2_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"1513599200_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": 1,
		"1_1nqdBSrhCPJwj7v3gAHvjUFyeoQzwPH84": 1,
		"1513621161_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": 1,
		"1515875303_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": 1,
		"1516822487_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": 1,
		"1520190095_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"1522619809_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"1525090186_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"1_1M6mvowPpeYyegFe6byJKP1aoehgKk84d2": 1,
		"1539533626_1LXfMdhEvW8VNuUVH8uJb3Y7WvVEvwzCmJ": 1
	},
	"next_comment_id": 11,
	"comment": {
		"2_1M6mvowPpeYyegFe6byJKP1aoehgKk84d2": [
			{
				"comment_id": 1,
				"body": "> [zeronetix](#comment_2_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): Так, таке можливо. Файл із персональними ключами знаходиться у /ZeroNet/data/users.jsonПросто копіюєте його на інший комп’ютер в ту саму директорію /ZeroNet/dataАле при копіюванні бажано вимкнути свою локальну ноду зеронету.\n\nТакож вдячний, так як планую пере-встановлювати систему і навіть не надіявся так швидко знайти відповідь.",
				"added": 1513370773
			}
		],
		"5_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 2,
				"body": ";)",
				"added": 1513370855
			},
			{
				"comment_id": 7,
				"body": "> [sigmaister](#comment_3_16S3TLaVJM6inhcBLAc7AAx5LWDg7mKiiY): якщо тут буде набагато більше і активніше сидіти народ ніж в riot.im (чат,месенжер, звонілка, форум, для технічних розробницьких спільнот), то буду тут постійно висіти\n\nу нашому чатику теж можете зависнути https://t.me/ZeroNet_Chat хоча там поки активність не велика(",
				"added": 1518107274
			},
			{
				"comment_id": 9,
				"body": "> [sigmaister1](#comment_1_1Ctbiim5t8PZvvA6dAgaVQM68arpM8fRGb): А в чатику всі з України, чи звідусюди?\n\nзвідусюди, я не запитував тож не знаю поки звідки",
				"added": 1520537732
			}
		],
		"3_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 3,
				"body": "Також можете спробувати Карбованець - українську криптовалюту, яка показує стрімкий ріст",
				"added": 1513370976
			},
			{
				"comment_id": 4,
				"body": "> [blinkel](#comment_14_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Карбованець\n\n“Карбованець” (Karbo) — це децентралізована однорангова пірінгова обмінна мережа, яка не має централізованого управління і емітента, та забезпечує конфіденційність і анонімність операцій без посередників і регуляторів. “Карбованець” — це криптографічно захищена (зашифрована) інформація, а карбованці — це одиниці обміну, тобто одиниці інформації. Вони захищені від копіювання й підробки технологією “блокчейн”.\n\nОднорідність і конфіденційність Карбованця\nАнонімність реалізована за рахунок кругових підписів, які приховують відправника та одноразових адрес, які приховують адресата.\nКонфіденційність\n\nПерекази карбованців не відслідковуються і не пов'язуються. Карбованець забезпечує повну анонімність і приватність за допомогою криптографічної технології ring signature. Всі транзакції підписуються групою так, що неможливо достовірно визначити хто з групи підписав транзакцію і, відповідно, не можна з певністю сказати хто проводив платіж. Чим більше учасників у групі, тим конфіденційніша операція. Крім того, транзакції карбованців неможливо пов'язати, – навіть якщо вихідні транзакції не відслідковуються, все одно можна було б побачити перекази які ви отримали на свою адресу, але завдяки варіанту протоколу обміну Діффі-Хеллмана, одержувач має численні унікальні одноразові адреси, що походять з його публічного ключа. Кошти, надіслані на ці адреси, може використати тільки одержувач. Пов'язати ж між собою ці транзакції неможливо, тому що їх не можна відрізнити серед інших транзакцій у мережі.\nОднорідність\n\nНеповторні одноразові адреси і групові підписи транзакцій (ring signature) забезпечують стійкість до аналізу блокчейну. Кожна транзакція тільки збільшує ентропію і створює додаткові перешкоди для тих, хто хотів би покопирсатись в операціях з карбованцями.\n\nСтійкість до аналізу, у свою чергу, забезпечує дуже важливу характеристику, – однорідність. Однорідність – це коли всі варіації одного номіналу мають однакову купівельну спроможність.\n\nОсновна відмінність і перевага над Біткойн – саме однорідність. Усі карбованці є взаємозамінними й уніфікованими на відміну від біткойнов, так як у Біткойні кожному охочому доступна можливість у будь-який час переглядати всі фінансові операції за рахунками всіх без винятку учасників і бачити скільки біткойнів є на балансі тієї чи іншої адреси. Це може привести до цензури активів людей, в результаті чого частина коштів стануть \"гіршими\", ніж решта коштів в системі. Наприклад, продавець може не захотіти приймати ті біткойни, тому що вони буцім використовувались для якихось підозрілих оборудок попереднім власником, чи були вкрадені тощо. А Карбованець не дозволяє так слідкувати за вами. Тому використовуючи карбованці ви отримуєте більшу приватність, незалежність і свободу, так як би ви користувались готівкою.\n\nДетальніше на офіційному сайті https://karbowanec.com/ua/ або у мережі",
				"added": 1513603336
			}
		],
		"1513599200_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": [
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Тут хороші блоги і форуми. Головне - інформація в них не залежить від примх якогось хостера.\n\nРізниця в тому що ці блоги можна створювати безкоштовно і їх важче заблокувати, і все?\nМені здається такі самі блоги можна створити і в звичайній мережі просто доведеться заплатити за хостинг.",
				"added": 1513603621
			}
		],
		"1516822487_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 6,
				"body": "[MegaBonus](https://megabonus.com/?u=81397) підтримує і номера твого типу і просто циферні без букв:\nСкрін -- https://image.ibb.co/i5UEuG/2018_01_25_11_50_35.png",
				"added": 1516874059
			}
		],
		"1520190095_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 8,
				"body": "на рахунок меншої кількості людей, думаю що раніше був ріст популярності мережі та й активності вцілому. Зараз слідує невеличкий спад і нових людей менше приходить. Та це вбільшості в нашому сегменті (СНГ) така статистика, англомовні та китайські спільноти, здається, тільки зростають..",
				"added": 1520328605
			},
			{
				"comment_id": 10,
				"body": "> [zeronetix](#comment_41_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): Знаєте, якщо не пишуть тексту, це не означає спаду активності. Моуть писати код. Тому треба заглянути на гітцентр http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/Та й на zeroMe крутяться розробники, просто треба підписатись на конкретних активних людей\n\nвсе вірно, просто треба слідкувати за правильними людьми і новинами, тоді не буде таких питаннь",
				"added": 1520537930
			}
		]
	},
	"comment_vote": {
		"2_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"1_1M6mvowPpeYyegFe6byJKP1aoehgKk84d2": 1,
		"2_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": 1,
		"14_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": 1,
		"4_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": 1,
		"2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"11_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"1_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": 1,
		"13_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"20_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"2_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"3_1DFZig8o8PG1anKBgVd5qw6zHjoWVjS3B5": 1,
		"27_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"39_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"11_1KWWKVJPZoHdMLWBSmLJZVrVZJmLxkxwee": 1,
		"8_1KWWKVJPZoHdMLWBSmLJZVrVZJmLxkxwee": 1,
		"10_1KWWKVJPZoHdMLWBSmLJZVrVZJmLxkxwee": 1,
		"1_1EPZvJuUmcnL1Grz7mos34Qs3fXqMrKVck": 1,
		"5_1EPZvJuUmcnL1Grz7mos34Qs3fXqMrKVck": 1,
		"2_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"1_16S3TLaVJM6inhcBLAc7AAx5LWDg7mKiiY": 1,
		"3_16S3TLaVJM6inhcBLAc7AAx5LWDg7mKiiY": 1,
		"41_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"43_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"44_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"45_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"56_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"57_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": 1,
		"2_1LXfMdhEvW8VNuUVH8uJb3Y7WvVEvwzCmJ": 1
	}
}