{
	"next_topic_id": 26,
	"topic": [
		{
			"topic_id": 1527416420,
			"title": "People are talking about how anime might be censored on steam. Do you agree?",
			"body": "Thoughts? try not to be biased.....",
			"added": 1527416419
		},
		{
			"topic_id": 1528019786,
			"title": "Is using single element materials like silicon and metals to make \"cybernetics\" safe for the body and cells?",
			"body": "this is about all those movies and shows talking about \"cybernetic\" implants using chips, metals, plastics, ect to augment the human body and if its even possible? or is it alot more complicated then getting a huge macro object and sticking it right into your body....",
			"added": 1528019784
		},
		{
			"topic_id": 1529288071,
			"title": "Hi you talk to me I want to know what you like........",
			"body": "Tell me what you think im interested...",
			"added": 1529288068
		},
		{
			"topic_id": 1529734243,
			"title": "Anyone seen this website its pretty nice",
			"body": "https://sukebei.nyaa.si/                       Its pretty good",
			"added": 1529734239
		},
		{
			"topic_id": 1536035206,
			"title": "Can we make a future for humanity by creating a new internet?",
			"body": "Information suppression and Manipulation is a big problem on the internet.",
			"added": 1536035201
		},
		{
			"topic_id": 1537416113,
			"title": "LBRY A new Decentralized based network for hosting videos on a Beta internet.",
			"body": "Speak your thoughts about centralized vs decentralized based networks of information and weather or not the WWW s  method of these networks is still effective",
			"added": 1537416107
		},
		{
			"topic_id": 1539752687,
			"title": "US handing control of net 1.0 Code WWW to UN",
			"body": "Does youtube being down have to do with this? I really want to know whats going on.",
			"added": 1539752680
		},
		{
			"topic_id": 1540357812,
			"title": "Google Microsoft all these big tech companys are A GIANT PEICE OF SHIT!!",
			"body": "Fuck data collection money makeing bullshit that we dont own ourselves!!!!",
			"added": 1540357804
		},
		{
			"topic_id": 1540369913,
			"title": "This video speaks alot of words.",
			"body": "https://www.youtube.com/watch?v=F-blKKLgljY",
			"added": 1540369904
		},
		{
			"topic_id": 1540443278,
			"title": "Watch out for people using data as a weapon against you.",
			"body": "Its hard to explain but all the devices we use are collecting massive amounts of data about our minds that could very well be used against you. especially if you use Twitter Facebook or any other social media platform. Data weapons they a very real.",
			"added": 1540443268
		},
		{
			"topic_id": 1541300923,
			"title": "Freedom for the People Not Left Wing Not Right Wing The people",
			"body": "We are not defined by structures of culture, ideas, or systems, for the people create all these things themselves. Just like someone can build a house. you build a house to protect from weather but you yourself are not the house.",
			"added": 1541300912
		},
		{
			"topic_id": 1544138177,
			"title": "STOP ARTICLE 13 SAVE YOUR INTERNET",
			"body": "There is a bill that could be passed in the United Nations that could change the face of the internet as we know it, by adding restrictions to the free flow of information. We must stop it at all costs even if the bill is passed, we must not let people govern how technological & epigenetic evolution progresses, if so, control of a population could very well be possible though the higher class having access to better technology...",
			"added": 1544138165
		},
		{
			"topic_id": 1551258681,
			"title": "It is up to the people to create their own network to thrive rather then CORPS",
			"body": "We need to rise up and create our version of the internet and not let the big banks create their version the the internet... we need to not let the big corps create the internet.",
			"added": 1551258668
		},
		{
			"topic_id": 1551837029,
			"title": "Taking care of our new internet",
			"body": "Max decentralization is required to have free flow on this new beta internet.... I suggest hackers to defend our human rights and pirating websites.... and to not allow the corporations to make a blockchain network first!",
			"added": 1551837015
		},
		{
			"topic_id": 1552649236,
			"title": "Map of the dollar bills piramide",
			"body": "https://i.imgur.com/BuEKdjl.png I am stating that this is the reason its missing, its because it is actually impossible to complete it to begin with.....",
			"added": 1552649221
		},
		{
			"topic_id": 1552979216,
			"title": "Newzelend shooters manafesto Highly covered up read guys",
			"body": "newzelend shooters manafesto is a plot by the media to take freedom out of the hands of the individual, its plan is to take gun rights away from us and information freedom by staging an event",
			"added": 1552979200
		},
		{
			"topic_id": 1552984055,
			"title": "The universe is phi, so be it life aswell, and spirit be... infinite",
			"body": "",
			"added": 1552984038
		},
		{
			"topic_id": 1553054808,
			"title": "Choice of humanity",
			"body": "To form a full free flowing information system that covers the world, one must consider the responsibility of the client and how to teach the client to control their resource... theres only so much an entity can do when it comes to protecting its users.. a full decentralized, world wide, free, Democratic Republic, internet network is possible, with enough collective effort of planet earth.. but only if the human body can execute it\nill leave that up to the geometrics to work that out.. I see a world free of ideology religion or cultural entrapment where the epigenetical phenomenon of DNA can truly  be expressed in information through the external, for it is ultimately the internal..",
			"added": 1553054790
		},
		{
			"topic_id": 1553796164,
			"title": ":Free-Internet.",
			"body": "(\"To form a full free flowing information system that covers the world, one must consider the responsibility of the client and how to teach the client to control their resource... theres only so much an entity can do when it comes to protecting its users.. a full decentralized, world wide, free, Democratic Republic, internet network is possible, with enough collective effort of planet earth.. but only if the human body can execute it\nill leave that up to the geometrics to work that out.. I see a world free of ideology religion or cultural entrapment where the epa phenomenon of DNA can truly  be expressed in information through the external, for it is ultimately the internal..\")",
			"added": 1553796145
		},
		{
			"topic_id": 1554700422,
			"title": "Dont use Intel ME or Management Engine",
			"body": "If you use these new Management engine chips you'll lose all control of your computer because it runs its own os in the backround that you cant control meaning anyone of the corps can peek inside your machine.....",
			"added": 1554700402
		},
		{
			"topic_id": 1555185007,
			"title": "Moors law is about to end 2020 is next year! ReadHere.",
			"body": "Moors law is about to end, 2020 is next year and companies around the world are spending billions and billions of dollars to dominate what the future of our chips will be.. they are buying other companies so that they have the upper hand.... let this not happen, Intel ME is going to add artificial intelligence as a background separate OS, the problem is that it isn't the most secure Being that A you cant turn it off as in the chip, as it is always on, and B..  2 security loopholes have already been found.. this is not old I repeat not old news this moment is going to determine the future direction of the internet and the computer revolution. Quantum Computation, 3d Stacked Chips, The long skepticized Dna data storage, Morphological Computation, Photon based chips, and more... This is very important, we must take the control of crypto away from the big banks and corps... and we must decentralize all of the internet or it may not look bright going forward. Spread this word... & Good Luck to Mans future.",
			"added": 1555184986
		},
		{
			"topic_id": 1555551409,
			"title": "The Power pyramid is not a pyramid!",
			"body": "The matrix of power is light itself I warn Mankind.. illuminati deriving from the word illuminate its light... light is the deception light is the bringer of deception... in truth this is the matrix thats on planet earth... we all know that light and dark are not us... spread this message.",
			"added": 1555551387
		},
		{
			"topic_id": 1556150091,
			"title": "Wake Up Call for Mankind. This video is no where to be found on bitchute...",
			"body": "https://www.bitchute.com/video/j8AyuP7eoBcG/",
			"added": 1556150068
		},
		{
			"topic_id": 1556874220,
			"title": "Hey I have an I idea",
			"body": "Hey I have an idea. Youtubes shit right? well why dont we make a program.. of our own and make it take videos from the archive of youtube... so that we can rank are own videos with our own algorithm on our own program the way we want it not the way Google wants it all while its taking videos off of the main site.. and also make it so the main sites algorithm dosnt know what we are looking at because we can code our program algorithm to look random to the main sites algorithm..... who ever knows how to code please do this I will support anyone who makes this with real intent.",
			"added": 1556874196
		},
		{
			"topic_id": 1611623437,
			"title": "Searching anything on the subject of depersonalizing youtube is censored",
			"body": "Searching anything on the subject of depersonalizing youtube or questioning the validity of the home page and how it recycles videos is censored on every search engine. Why is this? if not screenshot your results.",
			"added": 1611623412
		}
	],
	"topic_vote": {
		"1540357812_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"1540369913_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"1556874220_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1528751326_1Jhso1pp8VNBQJBFuU7AjKC6NYdxsYLTHx": [
			{
				"comment_id": 1,
				"body": "what is the difference between hording material things and hoarding data. and if there is no difference does it mean we are greedy with our thoughts?",
				"added": 1529287526
			}
		],
		"1528096119_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "You should look up the biocentric universe theory by Robert Lanza its pretty interesting. in my opinion",
				"added": 1529287742
			}
		],
		"1527596303_1LUBKJAgAW6JDqTD57RYqKV83VKhRxvXMG": [
			{
				"comment_id": 3,
				"body": "I like zeromaps as I believe p2p based data share of the globe is a good idea. I would like to see the map show you what it looks like to other countries. because the common globe in the us is the us version.",
				"added": 1529287930
			}
		],
		"1526455814_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 4,
				"body": "One things for sure diversity is needed. I think its just a matter of being creative.",
				"added": 1529288309
			}
		],
		"1528086173_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "What is reality. https://www.youtube.com/watch?v=w2xzIgdD_XA",
				"added": 1529288483
			}
		],
		"1550754018_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 6,
				"body": "List of Corps not to support\nGoogle\nFacebook\nTwitter\nMicrosoft\nFacebook Google based websites ect\nany company that collects data off of you\nor any company that gives you a service that not on your local machine.\nencrypt all your files\nadd 40 letter passwords to all accounts\ndo not use online password managers\ndont use alot of software programs that are apart of multi billion dollar corps",
				"added": 1551157807
			}
		],
		"1552649236_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 7,
				"body": "Or Pyramid",
				"added": 1552649318
			}
		],
		"1552979216_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 8,
				"body": "Same with 911 with the patriot act..",
				"added": 1552979331
			},
			{
				"comment_id": 9,
				"body": "evil be gone in this domain",
				"added": 1552984095
			},
			{
				"comment_id": 10,
				"body": "May the number four be the king never ever three nor 3.",
				"added": 1552984181
			},
			{
				"comment_id": 11,
				"body": "Fuck the manifesto I already saw the original footage its fake to the point of laughing.. heres the thing..  the dude for one, shot a pump shotgun like an automatic that was strange, there were no alarms strange, blood on the first 4 bodys was nowhere to be seen, and when he went into the car he shot the shotgun again and all the sudden is pumping it.. all while shooting the window in the front and at the same time its 2 shots didn't break it or make parts fall....then shooting the windows to the left and having that window completly shatter and glass all in the car.... also bodys in the church were on the ground before he came in like... its fucking ridiculous..",
				"added": 1553153699
			},
			{
				"comment_id": 12,
				"body": "also might I add no one had a reaction they all just driving on the road and people walking like nothing was wrong its retarded.",
				"added": 1553153786
			},
			{
				"comment_id": 13,
				"body": "> [mseses](#comment_1_1FrMj7Gj8vLfwWYZqifCcyCgZwn5851mGA): Having a gun is not a freedom.\n\nits not a matter of it giving you freedom its there incase the country were to take away our rights there would be no way to protect our selves.",
				"added": 1553154238
			},
			{
				"comment_id": 15,
				"body": "> [gyhj5gf4jk](#comment_1_1N4oTqx9Ydim7JPaHEwqiqSCfewiU34pEu): Video is available all over here: [...]\n\nThanks make sure not to most them too much on the clear net its chaos up there you could get in trouble .... I would also encrypt them so that its safe.",
				"added": 1553236588
			}
		],
		"1553195701_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "Fear is never the key to life.",
				"added": 1553236407
			}
		],
		"1552871704_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 16,
				"body": "The problem is humans have PSI  AI does not PSI is the influence that consciousness has on reality.. it has the power to collapse the wave function AI does not because theres no real observer also.... take the 100th monkey experiment that cant happen with AI because theres no quantum connection or even string energy connection which is what the brain has... the neurons of the brain are most likely connected to quantum and sub quantum hyper demensional strings while classical computation and quantum early stage computation are just quantum by itself.. all while we dont know how the brian works at the same time....",
				"added": 1553237074
			}
		],
		"1552871267_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 17,
				"body": "Well heres the thing if you want to know the absolute truth.... you are the only one having a subjective experience.. reason why being that its impossible to know anything outside of you because all electrical signals including everything you see hear taste touch think ect is all inside your brain.... so the since of true perception no one but you can experience.... not to say people arn't people thats not what im saying at all ... but yeah....",
				"added": 1553237687
			}
		],
		"1555551409_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 18,
				"body": "Light is the second manifestation in the universe the first is Void or Tao in the Chinese culture. most people think that people who speak of these things are mad... and its sad... but the knowledge of these things have been suppressed for thousands and thousands of years... call me mad if you want but there's massive amounts of data on supporting the fact the temporal reality of the physical is an illusion.... the mysteries of consciousness go beyond many what we think and it is because of it, that mainstream science has rejected the notion of it for as long as its existed....... if yall want to be ignorant fine be my guests.",
				"added": 1556150772
			},
			{
				"comment_id": 20,
				"body": "1- Christian - “Anointing”\n2- Christian - “Holy Spirit”\n3- European - “Etheric Energy”\n4- European - “Life Force”\n5- European - “Vital Force”\n6- Greek - “Pneuma”\n7- Hindu - “Kundalini”\n8- Hindu - “Prana”\n9- Hindu - “Shakti”\n10- Hindu - “Vril”\n11- Japanese - “Ki”\n12- Jewish - “Shekinah”\n13- Madagascar - “Hasina”\n14- Sufi - “Baraka”\n15- Tibetan - “Tummo”\n16- Traditional Chinese Medicine - “Qi” or “Chi”\n\nNames for Subtle Energy from Indigenous Traditions\n\n17- Akan- “Kra”\n18- Akawaio - “Akwalu”\n19- Iriquois - “Orenda”\n20- Lakota - “Waken”\n21- Mayan - “Itr”\n22- Palau - “Kalit”\n23- Polynesian - “Ha”\n24- Polynesian - “Mana”\n25- Shoshon - “Boha/Poha/Puha”\n\nNames for Subtle Energy from Scientific Researchers\n\n26-  Henri Bergson - “Elan Vitale”\n27- R. Blondlot - “N-Emanation”\n28- Oscar Brunler - “Mental Radiation”\n29- Barry Carter - “Exotic Matter”\n30- P. Dubrov - “Biogravity”\n31- Gerald Feinberg - “Tachyon”\n32- Alexander Gurwitsch - “Mitogenetic Rays”\n33- Thomas Galen Hieronymous - “Eloptic Energy”\n34- Barry Hilton - “Fluoroplasmic Energy”\n35- Victor Inyushin - “Bioplasma”\n36- Nikolai Kozyrev - “Time Density”\n37- Nikolai Kozyrev - “Torsion”\n38- Wilhelm Reich - “Orgone”\n39- Carl von Reichenbach - “Od”\n40- Ivan Shakhparonov - “Kozyrev-Dirac Emanation”\n41- Shakhparonov and Shipov - “Dark Matter”\n42- William Tiller - “Deltrons”\n43- William Tiller - “Subtle Energy”\n44- Veinik - “Chronal Field”\n45- George de la Warr - “Biomagnetism”\n46- Nikola Tesla - \"Aether\"",
				"added": 1556153344
			},
			{
				"comment_id": 21,
				"body": "its not a point of view, its a statement based on a empirical analysis. I was just speaking like that to get peoples attention.",
				"added": 1556153682
			}
		],
		"1556150091_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 19,
				"body": "This is an artistic view of the reality and our situation on the planet...",
				"added": 1556151704
			}
		],
		"1556874344_1AnpXwyjaKj6ccazqk7NKYCL8skScCMpG1": [
			{
				"comment_id": 22,
				"body": "Make sure, this is a last resort... if you back up to a cloud make sure that its trusted and encrypted... No google microsoft dropbox.. Mega is a maybe although I lost access to my account because the site could never load my drive.. if you want to go the long and lasting and most secure route then get a raid storage system or download a automatic fileback up program with atleast 2 drives...",
				"added": 1556874579
			}
		],
		"1556874220_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 23,
				"body": "Its not the money dude relax... NewPipe Ill look it up.",
				"added": 1556879278
			}
		]
	},
	"comment_vote": {}
}