{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1543327932_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1543809355_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1
	},
	"next_comment_id": 19,
	"comment": {
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 1,
				"body": "I'm using pop linux by system76, I use it for developing in node and angular 6",
				"added": 1543604500
			}
		],
		"1543487242_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 2,
				"body": "Someone needs to make a YouTube type website.",
				"added": 1543604547
			},
			{
				"comment_id": 14,
				"body": "> [anonymouslogin](#comment_171_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): someone did make a youtube like website\n\nYou happen to know the link?",
				"added": 1543700402
			}
		],
		"1542967986_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 3,
				"body": "I plan on running a few tor websites once I get some free time but I'm thinking I might make a zeronet site instead.\n\nThe problem I see with this is how to people find your site?\n\nAs for article 13 it needs die and after. Google is already gather public interest and I'm sure there will be massive public push back if it ever passes.\n\nNothing changes policy like pissing off most of the public.",
				"added": 1543604800
			},
			{
				"comment_id": 4,
				"body": "I plan on running a few tor websites once I get some free time but I'm thinking I might make a zeronet site instead.\n\nThe problem I see with this is how to people find your site?\n\nAs for article 13 it needs die. Google is already gather public interest and I'm sure there will be massive public push back if it ever passes.\n\nNothing changes policy like pissing off most of the public.",
				"added": 1543604821
			},
			{
				"comment_id": 5,
				"body": "I plan on running a few tor websites once I get some free time but I'm thinking I might make a zeronet site instead.\n\nThe problem I see with this is how to people find your site?\n\nAs for article 13 it needs die. Google is already gather public interest.\n\nNothing changes policy like pissing off most of the public.",
				"added": 1543604851
			},
			{
				"comment_id": 6,
				"body": "article 13 it needs die. Google is already gather public interest.\n\nNothing changes policy like pissing off most of the public.",
				"added": 1543604875
			},
			{
				"comment_id": 7,
				"body": "Sorry about spam it was telling me it failed to post.",
				"added": 1543604920
			}
		],
		"5_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 8,
				"body": "Zeronet is not anonymous as it's peer to peer though you can use it through tor.",
				"added": 1543613658
			}
		],
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": [
			{
				"comment_id": 9,
				"body": "> [nekololi](#comment_309_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): there comes a point where sending a canary down to check the coal mine is a waste of avian life. think of how many bird's lives could be saved if we were just a little smarter in the platforms and services we support. [...]\n\nSee what I don't get is facebook and Twitter have had their fair share of people how used the platform and then went on killing spree and no one bats and eye lid but get a small site and the media turn on it like a pack of dogs.\n\nTo me to seems like the bigger networks were trying to force out the competition.",
				"added": 1543615189
			}
		],
		"1543327932_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 10,
				"body": "I had a problem with this package today at work, it's not one of our dependants so must be used by a package.\n\nMonday morning is going to be fun.",
				"added": 1543620617
			},
			{
				"comment_id": 13,
				"body": "> [eightyfour](#comment_36_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): As long as your work isn't cryptocurrency related, monday is probably going to be not that bad.\n\nWe create final CRM system and I've been needing an excuse to vet are packages.",
				"added": 1543690029
			}
		],
		"1543672789_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 11,
				"body": "> [quantumworld](#comment_9_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I got banned from twitter after I made fun of a stuffed pig. They said that I was insensitive to vegetarians. And it had nothing to do with vegetarians. They are insane.\n\nIt's a sad time to be alive when offending someone is a crime.",
				"added": 1543689803
			}
		],
		"1543656691_1HbvuN84epzW1vjpRjgemxPADB6UqdZpvy": [
			{
				"comment_id": 12,
				"body": "> [bitcoder](#comment_8_1HbvuN84epzW1vjpRjgemxPADB6UqdZpvy): I'm using my home internet connection. I have no special firewall rules on it. Unfortunately I can't setup UPnP or port forward on my router right now because I have forgot the admin password. Probably the AV firewall has messed something up here? Please note that I am a Linux user although I'm connecting to ZeroNet from a Windows PC at the moment, so I don't have much knowledge about this crap OS. Thanks for your help. :)\n\nWhy are you using an av or an av firewall on linux?\n\nThe av software will likely introduce more holes for you to be attacked from and you can use iptables, there is even a gui for it, to control access.",
				"added": 1543689950
			}
		],
		"1535881177_147dKWfEsmiinRTaUvoY3gXWXyk1gmZdtL": [
			{
				"comment_id": 15,
				"body": "> [quantumworld](#comment_46_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): The Creator Of ZeroNet Tamas Kocsis Ted Talkshttps://www.ted.com/talks/tamas_kocsis_the_case_for_a_decentralized_internet#t-583793 [...]\n\nThis is how I found out about it.",
				"added": 1543820519
			},
			{
				"comment_id": 16,
				"body": "> [kaffie](#comment_637_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): This would be ideal. But having a bot auto-mirror all the major news sites/articles would really help keep people on ZeroNet while we don't have many people producing unique content.\n\nI've created a few news bots in my time notably a hacker news bot.\n\nThough I think it would be better make some sort of feed back loop, such as LTT do, get your user name featured on the WAN show. Not sure how you would create a system like that here",
				"added": 1543820724
			}
		],
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 17,
				"body": "> [ornataweaver](#comment_84_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): I think we should begin with http://127.0.0.1:43110/Sites.ZeroNetwork.bit/\n\nDoes it ever stop loading?",
				"added": 1543820995
			},
			{
				"comment_id": 18,
				"body": "> [quantumworld](#comment_49_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Hopefully you got to the full page. But it will send data out to you every time a site is updated.\n\nI was on my phone at the time and it kept loading and unloading the links, I just left it and it's all find now",
				"added": 1543846419
			}
		]
	},
	"comment_vote": {
		"1_1BUMpsdLbAwJPwb1fpH6zqSbqxC6BYjfdo": 1,
		"5_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"4_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"171_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"46_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"637_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}