{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1580340450_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1580643454_17FotRRc6msHBzM2jrs6tQCmpLaXi1kHd5": 1,
		"1580617751_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": 1,
		"1586741722_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1602348205_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": 1,
		"1602987903_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1607556822_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1607096892_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1630932576_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1580487512_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 1,
				"body": "AFAIK, Hardware backdoors are actually in software which might not even visible / reachable by user. Like any software, these can have bugs, and backdoors.\n\nIf such a backdoor exists, than it would make every encryption pointless, as it can see what you type in your keyboard, or virtual keyboard in case of mobile phones.\n\nbut correct me if I'm wrong.\n\nand I have an idea to solve it:\n\n[offline device] <==> [online device] <---> connection <----> [online device] <==> [offline device]\n- offline devices can never reach internet\n- pub/priv keys are generated on the offline devices, getting entropy from the environment (sensors, whatever)\n- the connection between the online - offline device ( == ) \n  - when you want to send a message, you type it in a keyboard in the offline device, it does the encoding, and send it to the online device, encrypted, via a simulated USB keyboard.\n  - when you want to see an encrypted message, the offline message recognizes the encrypted text via a camera, decrypts, and displays it to you.\n\nI know it sounds complicated, but this is the only way I can think of, which avoids risks of working with \"backdoored\" devices. Let me know what you think :)",
				"added": 1580495696
			}
		],
		"1584324810_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 2,
				"body": "none.",
				"added": 1584348450
			}
		],
		"1586463960_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 3,
				"body": "> [bigbadbob](#comment_1072_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Sounds like the people need to get organized and govern themselves.\n\nI think dictatorship can only happen where people can't organize themselves, starting to depend on the government too much, which will in turn take advantage of the situation, basically just fulfilling the needs of the majority. Dictatorship can not happen where the majority of the people are smart, healthy, cooperative, kind, .... By the capability of self-organization, I'm not talking about resistance, opposition, fighting against someone / something... no, nothing like that. I'm talking about everyday lives, starting with \"what you do when a neighbor upsets you\" ? A) talk with them, organize your family, negotiate, try to make an agreement, ... B) ask the police to intervene, then be surprised when they start they feel the need to have power to tell you, how to live your life inside your home.",
				"added": 1586514228
			}
		],
		"1587123797_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": [
			{
				"comment_id": 4,
				"body": "notfound",
				"added": 1587123869
			}
		],
		"1588234152_118dJLoeiH6sQFtqXkPaqU9LeRHsFRzCs": [
			{
				"comment_id": 5,
				"body": "what is rdos and clos ?",
				"added": 1588267517
			},
			{
				"comment_id": 6,
				"body": "thx @styromaniac ! :)",
				"added": 1588326559
			}
		],
		"1593220425_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 7,
				"body": "It's not difficult at all. I'm using a simple tracker: https://github.com/chihaya/chihaya - almost no setup required, works perfectly. Then I create the torrent with mktorrent -a 10.77.0.9:9885/announce ./backups (where 10.77.0.9:9885 is my tracker address which I set up with chihaya), send the torrent to some servers, \"aria2c backups.torrent\", aaaand it works perfectly for me. I hope it helped.",
				"added": 1593365749
			}
		],
		"1594225869_1FYnqRnNx4xbmec3dhwMaq1aE8WCqAVPHL": [
			{
				"comment_id": 8,
				"body": "The best thing you could do is to tell your parents you understand the problem, and  and you want to be the part of the solution. IMHO.\nDoing illegal things like selling drugs are even more risky these times, and without multiple years of real experience, you'll most likely get your family into even bigger trouble.",
				"added": 1594289067
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 9,
				"body": "I think what you're experiencing is that your cognitive abilities are improving rapidly. \n\nUnfortunately there's a stage in between \"thinking like a sheep\" and \"really understanding things\", which can be very depressing, because you understand more things, which you can actually process. Calm down, you'll get through this in a matter of days, weeks at most. You just have to allow your mind to do its job and solve it, don't push it. Lots of people been through this, and it totally worth it I think.\n\nFor those who thinks I'm talking bullshit: maybe. maybe not ;) feel free to judge if it makes you feel better :D",
				"added": 1607697677
			}
		],
		"1606796276_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "I'd suggest to learn more about networking first, and then play with SDN software. I think it's not for end-users.",
				"added": 1607698413
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 11,
				"body": "You're vastly overestimating our governments. They couldn't even organize Brexit for how long? :D renewables, climate crisis, left/right-wing stuff, ... ? and then they suddenly agree on a pandemic, which has MUCH bigger impact AND urgency? Shadow governments controlled by lizards would be the only logical explanation if we talk about hoax and conspiracy and stuff, but in this case, why they couldn't solve much simpler things before; it just doesn't add up. You CAN believe you solved a complex equation by cherry-picking two numbers and adding them together, and you can feel good about yourself until you try to verify. Hence, the best is never to verify what you're talking about and accept anything as evidence.",
				"added": 1607759220
			}
		],
		"1612901550_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": [
			{
				"comment_id": 12,
				"body": "yep",
				"added": 1612974893
			}
		]
	},
	"comment_vote": {
		"25_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": 1,
		"509_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"2106_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2105_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"85_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"6_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": 1,
		"624_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"2791_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"492_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"79_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1
	}
}