{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [nippletwister](#comment_1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Personally I am waiting for new decentralized reputation systems to emerge. Because I think that decentralized reputation + self-budgeting and self-governance system (like DASH's DGBB, see https://www.dashwhale.org/budget) = new powerful economy.\n\nI like DASH's governance model. Needing 1000 DASH means those voting having a vested interest in making sure DASH remains valuable and becomes more valuable to people and they will vote that way. And anyone who wants to harm DASH through its governance system would need to buy a lot of DASH to do it, and they will inadvertently make DASH more expensive and create a speculative bubble making their goal even harder, so if they manage to do it they will have wasted a large amount of their own wealth, or will have destroyed the currency they are utilizing to buy into DASH, weakening themselves economically.\n\nA functioning currency works as a decentralized reputation system, except when the currency fails and counterfeiting, theft, fraud are made abundant and the state centralizes markets. If I am doing something good and desired, I will be paid more boosting my wealth which is equivalent to building a reputation, but if a person is able to gain wealth by doing bad and undesired things (stealing, fraud, etc) its the equivalent of gaming reputation, but usually those activities are short lived or less common, except when they are systemized within a state controlled market, a fiat currency controlled by the state is a direct example, but also the creation of the legal concepts of corporations would be another.\n\nBut I am not sure how that would work for ZeroNet. With ZeroNet we want to reduce the impacts of middlemen by having a large set of middlemen (peers), for some this means no censorship (no single peer controls what is distributed), for others it is about efficiency of distribution (a single peer can't bottleneck the network). That is why I think my outline above will likely be the way things would work and thrive within ZeroNet, but this obviously doesn't take into account how technology external to ZeroNet will impact ZeroNet, whether DASH, Ethereum, MaidSafe, storj, et al, may coop ZeroNet to create something completely different or enhance it in ways I can't possibly imagine.\n",
			"post_id": 5,
			"date_added": 1458238871
		}
	],
	"comment_vote": {},
	"post_vote": {}
}