{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"category": "movies",
			"title": "Infested Planet 1.10.9 - GOG",
			"torrent_imdb": "",
			"body": "A game symbolising the European Crisis. \n\nCommand a team of 5 elite soldiers against an alien horde of 100,000. \nSurrounded on all sides, you must outmaneuver and outsmart the enemy. \nThe enemy is closing in around you. \nYour soldiers are being flanked and the perimeter is slowly collapsing under a vicious alien assault. Robotic turrets will not last much longer. \nJust a little more and the bugs will swarm into your unprotected base. \nWhat are your orders? \nYou order your soldiers to fall back to a defensive chokepoint and rebuild your defenses. \nSacrifice the forward squads to gain some extra time. \nGather your team while equipping them with flamethrowers and laser guns. \nStart building a siege cannon for fire support. \nThen, while the aliens are busy, flank their main hives to destroy and capture them. \nYou have just pulled off a tactical victory - but there's no time to rest. \nThe aliens are constantly mutating. \nOne moment your shotguns are ripping through the horde, the next the aliens grow hard, bullet-proof armour. You must adapt as well. Equip your team with stealth suits, miniguns, grenade launchers - your commands will decide the battle's outcome. \n\nFeatures:\nReal time tactical combat. \nA lengthy campaign where you develop new weapons.\nProcedural maps and random mutation system keep the game fresh. \n21 Human weapons and buildings for you to wield. \n33 Alien mutations to keep you on your toes. \nFight thousands of enemies at once.",
			"magnet": "",
			"torrent_file": "data/users/1k555k4g18HFLCkQFD3f43cx3u1SHbiTN/Infested.Planet.Inclu.ALL.DLC.GOG.rar",
			"added": 1503875835
		},
		{
			"topic_id": 2,
			"category": "tvepisodes",
			"title": "Doctor Who - The Complete Classic 26 Seasons Collection + Extras",
			"torrent_imdb": "",
			"body": "This torrent is by 834ch4 from pirate bay. From doctor 1 season 1 to doctor 7 season 26.\n\nThis torrent was created so that each season of the original dr who can be a separate torrent for faster downloading.  Instead of dling a torrent of 280 gigs you get 28 separate 10gig torrents.  \n\nThis torrent includes torrent files:\na torrent file for each season 1~26\na torrent file for the movie\nand a torrent file for the extra movies in 1965-1966 (that most people ignore because the the doctor is Peter Cushing, but they only have a vague similarity to the TV series)  \n\nI give full credit and many kudos to UMe2, who originally uploaded this collection.  But due to popular demand and because the torrent that UMe2 280+gigs, i have uploaded that same collection in smaller segments.\n\nNote: this is my first ever upload to a torrent site, please let me know if you have any suggestions.  I will have this, and all torrents included, seeding for as long as possible due to my love of all that is Doctor Who.  But we all know that laptops are portable for a reason and the tower containing this collection may not always be attached, so don't lose hope if it takes a while (took me 2 weeks straight) to get them all.  So please seed after download.  Thank you.",
			"magnet": "",
			"torrent_file": "data/users/1k555k4g18HFLCkQFD3f43cx3u1SHbiTN/(torrent folder) Doctor Who - The Complete Classic 26 Seasons Collection + Extras.rar",
			"added": 1503876541
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_1k555k4g18HFLCkQFD3f43cx3u1SHbiTN": [
			{
				"comment_id": 1,
				"body": "Fuck, wrong category, how do I edit/delete?",
				"image": "data/users/1k555k4g18HFLCkQFD3f43cx3u1SHbiTN/",
				"added": 1503875935
			}
		]
	},
	"comment_vote": {}
}