{
	"title": "The Home of Tulpa",
	"description": "关于Tulpa的教程、故事，以及一切\nguide、story and everything about tulpa",
	"links": "*   [](https://github.com/HelloZeroNet)\n*   [Tulpa之家](http://tulpa.cn/)\n*   [百度tulpa吧](https://tieba.baidu.com/f?kw=tulpa)\n*   [Source code](https://github.com/HelloZeroNet)\n*   [](https://github.com/HelloZeroNet)",
	"next_post_id": 11,
	"demo": false,
	"modified": 1531330648,
	"post": [
		{
			"post_id": 9,
			"title": "Tulpa的国内历程",
			"date_published": 1525939949.154,
			"body": "> “谁掌握了过去，谁就掌握了未来”\n> \n> ——《1984》乔治·奥威尔\n\n原文：[http://tulpa.cn/2018/04/29/tulpa%E7%9A%84%E5%9B%BD%E5%86%85%E5%8E%86%E7%A8%8B/](http://tulpa.cn/2018/04/29/tulpa%E7%9A%84%E5%9B%BD%E5%86%85%E5%8E%86%E7%A8%8B/)\n\n看之前你需要明白两点：\n\n一，这算半部编年体，可能会持续更新；\n\n二，圈子里并不喜欢甚至反感Tulpa被[恶意宣传](http://tulpa.cn/2018/04/29/%E6%81%B6%E6%84%8F%E5%AE%A3%E4%BC%A0/)。\n\n* * *\n\n我整理这些完全是出于个人创作所需，今天之所以分享出来，是因为近期的骚扰事件导致，担心有人会用伪造的历史来误导他人。\n\n以下内容由我亲身经历，采访，或推敲所得，不保证完全符合事实，但可以确保大致无误。\n\n感谢为我提供资料的众人，在此就不一一点名道谢了。\n\n如果你比我更了解这段历史，想提供相关信息或指出错误的话，欢迎联系：511591701@qq.com\n\n下列出现的名字均源于互联网，为求真实无误，~~故不作“遮挡”。~~\n\n对部分琐碎事进行了删减，完整版可以看（[里](http://tulpa.cn/2018/04/29/%E5%9B%BD%E5%86%85%E5%8F%91%E5%B1%95%E5%8F%B2/)）\n\n# **——————起源——————**\n\n一般认为，Tulpa发源于佛教，之后被亚历山德拉大卫内尔发现，在20世纪90年代末和21世纪才开始在国外普及。[详见维基词条Tulpa](https://en.wikipedia.org/wiki/Tulpa)\n\n# **——————国外——————**\n\n1997年12月18日，**Tulpa.com**域名建立。\n\n2011年，恐怖维基**Creepypasta**上发表了一篇关于幻人的小说。**作者不详**。（查看历史修改发现最早发表于2011年6月11日，最后修改于2016年10月26日。对比之下似乎只是修改了文章分类，去除了图片，以及标题。）\n\n2012年4月17日，**Tulpa.info**建立。\n\n2012年8月25日，同名电影《Tulpa》在伦敦FrightFest电影节首映。[详见维基词条Tulpa（电影）](https://en.wikipedia.org/wiki/Tulpa_(film))\n\n2013年6月20日，同名电影《Tulpa》在意大利发行。\n\n# **——————国内——————**\n\n2013年3月06日，**Tulpa吧**建立。\n\n> （题外话：好人3也不清楚国内有没有其他讨论tulpa的地方。能有一个讨论平台，这是他建立tulpa吧的原因之一。）\n\n2014年，国内有人翻译**Creepypasta**上**Tulpa**的文章并搬运到国内论坛（无法查到原搬运工是谁，只能看到贴吧转帖）。当时并没有引起太大重视。\n\n2015年3月02日，B站著名up主**谜之声**发布游戏实况：守护之灵 tulpa，虽然播放数高达11.4万，可同样没有引起足够重视，可能和上面的情况一样，单纯把这当作游戏内容了。\n\n8月03日，**恐惧鸟**发表**「都市传说的终极理论：TULPA」第一章 脱缰的幻想**。（日期确定于本人微博。）\n\n8月04日，tulpa吧最早的帖子发布（排除删贴可能，我找不到更早的了），出现了**其他人练习的需求**。\n\n8月06日，又一则帖子发布，内容大意是：“为什么这里这么少人（可以看出已经有人关注，但人数可能只有两位数甚至不到），是了解的人太少吗？”唯一的回复是好人3使用的“天琴”账号，称国内有t或者类似精神体的其实不少，但大部分都不知道他们的具体定义（不知道确实有一个形容这种情况的名词，tulpa。）发帖人继续询问，怎样才能找到大集体？好人3说我也不知道。同日，**国内首个tulpa群**建立。（应该说**首个讨论群**，还有一个叫tulpa的群建立于**2013年7月27日**，但整个群**只有**群主一个人。）\n\n8月06日22点，好人3发表公告致看**同名电影**来的观众。\n\n8月08日，国内第一篇教程翻译发表，名叫**Kiahdaj的tulpa百科**。同日，开始招募翻译。\n\n> Tulpa和清明梦的纠缠最早出现在15年8月20日，帖主自称来自清明梦吧，发现tulpa和里面的梦灵极为相似，认为tulpa和梦灵就是同一样东西的不同模型，还顺势安利了一下清明梦。好人3似乎也这么认为（原文引用：或者说这就是tulpa的一种。）语气上很可惜清明梦那边对梦灵的应用，认为太过狭隘，明明还有更好的潜力。\n\n2016年（国内Tulpa圈的**活跃期开始，10月前后为界线**）。\n\n6月12日，贴吧第一个绘图日记。作者：**小灵子敬**。\n\n> （7月，清明梦圈子梦灵开始流行，但文章内容没有提及t）\n\n8月23日，b站up主“**歪撒女内**”发表了关于tulpa的视频，标性为**都市传说**。贴吧开始活跃可能就是因为这个视频。\n\n8月23日关注人数**还没过200**。\n\n24日人数**到达200**。\n\n10月11日，贴吧关注人数**到达233**。似乎开始活跃起来是在16年10月前后，10月的帖子量比起以往要多得多。\n\n11月06日，贴吧关注人数**到达255**。\n\n> （12月，有帖子吧tulpa与日本的式神联系在一起。）\n\n12月16日，帖子数突破1000。看到有人留言说从空间过来的。**因修蒙蛇事件开始。**\n\n12月18日，好人3针对因修蒙蛇事件发出公告，称宣传引来了太多无关的人士，已经对圈内人士造成骚扰。**采取规避策略：Tulpa圈子从来不宣传也不打算让其他人相信Tulpa的存在。**\n\n12月21日，**Tulpa百度百科**正式通过。\n\n12月23日，有人发帖吐槽群里**语c**情况（两人互相交换自己的tulpa，在18年该人被证实为**演员**：假装自己有tulpa）\n\n2017年1月，**神秘学**内容开始频繁进入tulpa吧。（同年，梦圈开始有人宣传t，具体月份尚不清楚）\n\n2月11日，好人3发帖称担心神秘学内容会对新人造成误导，希望相关讨论时能自觉添加上标签。（事实上之后似乎都没有人自觉这样做……）\n\n> （观察盲区）\n\n10月05日，贴吧关注人数终于**破千**。\n\n10月17日，翻译接力开启，众人联手翻译“集大成”的教程，里面几乎囊括了所有可能遇到的情况——截止2018年3月1日，只完成了三分之一。（想参与翻译可以点击[这里](https://shimo.im/sheet/aKLQY7Bf5YEBAAxR?r=9JOY53)）\n\n10月19日，国内**第一个组织**（大学生，为了论文）宣布对tulpa进行研究，进群取材后便消失无踪。可惜截止今天，联络人依旧没有回应。\n\n2018年2月21日，国外某油管上传名为**What it’s actually like to hear voices in your head**的视频。\n\n2月23日18：49（b站账号发表时间，官方微博于22：10发布），国内著名媒体**环球时报**转载该视频，后又被同行的互相转载，造成连锁反应，引起广泛关注。截止2月28日，视频总播放已达**71万**。（b站播放达**1万**）\n\n4月05日，**本站（tulpa.cn）**建立。"
		},
		{
			"post_id": 8,
			"title": "Kiahdaj的Tulpa完整教程",
			"date_published": 1524845249.235,
			"body": "原文：[http://tulpa.cn/2018/04/05/kiahdaj/](http://tulpa.cn/2018/04/05/kiahdaj/)\n\n* * *\n\n原教程地址：[https://community.tulpa.info/thread-general-kiahdaj-s-absolute-guide-to-tulpas](https://community.tulpa.info/thread-general-kiahdaj-s-absolute-guide-to-tulpas)\n\n译者：goodman3\n\n本篇从各角度介绍了Tulpa的概念与最基础的教程，推荐初学者阅读。\n\n# **_**_简介_**_**\n\n我首先要警告你，**本文非常冗长**。但对于想要了解tulpa及其创造方法的人来说，我还是建议你读完整篇文章。本教程适合：什么都不懂的初学者，或是懂得tulpa大致概念的人，或是那些已经开始创造tulpa但遇到困难的人。本教程将试着尽可能完善——创造tulpa中遇到的每一个问题都会在这里讨论。下文将介绍很多概念，还有整个过程，以及你在练习中应有的心态。\n\n有一些正在创造tulpa的人可能并不想阅读本教程，他们可能觉得自己已经了解tulpa的创造方法。但是，我了解到有些人了解得并不全面，否则论坛里不会总是出现那些被问了一百次的问题。如果只是一知半解，我建议你阅读这篇文章。\n\n尽管我尽力想要完善这篇文章，但本文并不是“你唯一需要阅读的教程”。不只是因为其他教程也有很多合理之处，他们使用的方法也和我的方法一样有效。如果我详细把所有可能对你有用的方法都列出来，那么本文可能会变得无限长。我不列出来的原因就是因为方法不只有一个，你可以用任何方法去实现它。我这里所介绍的方法并不是必须的。你应该深思熟虑后自己决定。除此之外，本教程将给你介绍整个过程，和tulpa们本身。\n\n最后，有些话对初学者说。我建议你们读完整篇文章后再开始练习。因为这里的内容都是相互联系的，虽然有些创造tulpa的步骤在前期不用考虑，但仍然有学习的必要。\n\n（注：有时候我会用“他”来代指你的tulpa。因为我的tulpa是男性，而且我已经养成了习惯。）\n\n**_**_什么是_**_****_**_tulpa_**_****_**_？_**_**\n\n你可能会以为有一种答案能解释这种现象。但不幸的是，没有。虽然有些人十分肯定，但没有人知道tulpa的具体定义。不仅仅是整个圈子有着不同的假设，每种假设还会分离出更多的假设。在这里我将引用本网站的“什么是tulpa”一文。因为我赞成这里大部分的内容。\n\n> 《什么是tulpa》：\n> \n> Tulpa是一种和你相似的精神体：它有自我感知，能够思考，有自己的意志、记忆，还可以拥有用于分辨自我的外表。他们独立在创造者的意识之外，但彼此共享一个身体，某些情况会共享部分意识。\n> \n> Tulpa的人格受到潜意识、你选择的性格和tulpa自己的意识所影响。随着与tulpa的交流与互动，或是通过不同种类的人格培养，他们的人格将会逐渐成长。Tulpa不是你潜意识的体现，他们有属于自己的意识。\n> \n> Tulpa能够自主思考，他们有自己决策的能力，还有自己的爱好、观点和喜好。这些都可能和你自己的有很大差距（不管他们是否与你相像）。他们可以交谈，并且维持自己。他们存在于意识中，所以他们可以轻易地和脑海里的其他意识交流，例如他们的创造者或者占据同一个身体的其他tulpa。Tulpa可以通过一些方式和身体外的事物或人进行沟通。例如，一个宿主向别人传达tulpa说的话，或者直接让 tulpa控制自己的身体。\n> \n> Tulpa的形体存在于想象中，它们以此作为自己的形象。这个形象可以在创造初期选定，或者让它在潜意识和人格的影响下自然生成。Tulpa通常都会认为那个形象就是自己，但它们可能会想要改变形象。这些改变不止于一些微小的变化，有时候整个外观都会改变。形象使得tulpa可以使用视觉上的互动，比如身体语言，表情等。这个形象可以在心眼或是幻想里看到，也可以通过训练后以幻觉的形式被宿主的肉眼看到。\n> \n> 总而言之，tulpa是一种独立的意识，它通常用一个形态代表自己，被某个人创造出来并当做精神伙伴。创造的理由是多种多样的。\n\n以上说的基本都是一个tulpa能做什么，这些的确是“正确”的，因为这是我们能够观察并记录的表象。每个尝试解释它具体是什么东西的文章，都只是一种观点而已。\n\n我自己怎么认为呢？我把tulpa看成是身体里的另一个表意识，就和我们自己一样。我们和他们的唯一区别就是，我们出生的时候就和物理上的身体绑在一起，而tulpa们不是。它存在于身体里，而且很明显当我们死去的时候它也会死去，但它们和身体的联系是和我们不同的。毕竟，我们一生中经历的事情基于我们的五感。但是tulpa们并没有受到这样的“限制”。我相信我们做到的事情，它们也能做到。而它们能做到的事情，我们也能做到。我们无法得出结论定义tulpa究竟是什么，所以具体相信什么由你自己决定。\n\n**_**_如何创造一个_**_****_**_tulpa_**_****_**_？_**_**\n\n这部分在教程后半有很详细的说明，但我先在这里简单介绍一下。\n\n首先，在你对tulpa说话的时候，或是在给它设置人格的时候，它们的自主意识会成长。当你在心眼里想象tulpa的形态的时候，它会变得越来越清晰。你的tulpa的形态可以是任何你想要的形态。从一个人类到一张凳子。只要你想得到的都可以，或者是没有形态。\n\n你的tulpa随着练习会逐渐学会说话，而你将逐渐能够听到它。有时候你的tulpa产生自我意识的瞬间就学会了说话——只是你没办法听到他们。最后你开始练习投影，用你真实世界的五感去感受你的tulpa。你还可以做一些小实验，比如附体。只是你没有必要严格按照这个顺序来做。\n\n**_**_你为什么要创造一个_**_****_**_tulpa?_**_**\n\n# 一个人想要创造tulpa有很多原因——其中一个就是你会获得一个非常亲密的朋友。因为tulpa和你共享一个身体，它能感知你的记忆和情感，所以tulpa比世界上的任何人都要亲密。它能真正地了解你，而你的其他朋友对此有心无力。\n\n# 除了这些，tulpa还可以帮助你做很多一般朋友做不到的事情。你的tulpa可以帮助你回忆某个东西，它们可以帮你抵抗负面情绪，还可以麻痹你的感觉，比如痛觉。少数人认为它们可以改变你对时间的感觉。\n\n# 你可以和你的tulpa做很多很多的事情。它们中的大部分还没有被发现。\n\n****你不应该创造_**_****tulpa**_**_**的情况，以及需要考虑的事：_**_\n\n在某些恐怖故事里，tulpa占据了身体，而且主人没能把控制权夺回来。有些故事说一个tulpa伤害了主人，或者对他们极为不友好，或者憎恨他们。我个人并不相信这些传言，但如果你相信，那么你的确有理由不去创造一个tulpa。\n\n撇开恐怖故事不谈，的确有很多不该创造tulpa的正当理由。\n\n目前很多人都不把这事作为严肃的事情看待。许多人在tulpa完成后只想着拿它们取乐，从不考虑未来会怎样。他们似乎不理解这个事实：创造tulpa是事关一辈子的决定。你的tulpa会永远和你待在一起，而且会成为某种形式的负担。再创造tulpa之前，你必须理解这个选择有多么沉重。\n\n你不应该花一个晚上就作出决定。以前我听说tulpa这个圈子后，就马上开始创造我的tulpa。直到今天，我依然后悔当时为什么这么做。这应该是你仔细研究之后做出的决定——甚至花上几个星期。你不应该一时冲动就作出决定，因为我们所讨论的是另一条生命。\n\n而且，我还要劝说孩子们，你们不应该创造tulpa。我现在引用JDBar的发言，因为他很好地描述了我的观点：\n\n****“制作_**_****tulpa**_**_**需要成熟的观念，否则将无法理解为什么创造一个有意识的精神体是一个很沉重的话题。我想对**_**_**13**_**_**岁左右的人说，你们还没有足够的阅历去创造一个**_**_**tulpa**_**_**。也许对于你的年龄来说你的行为举止已经相对沉稳，但你的思维却没有完善。在你的校园生活里，你会不断的改变，学到更多新的事物从而产生新的看法和想法。在你摆脱疯狂的青少年时期的荷尔蒙、意识和人格固定下来之前，着手创造另一个人的意识和人格是不负责任的行为。”_**_\n\n我真心认为那种年纪的人不应该创造tulpa，但我没法阻止你。还有，年龄并不是创造tulpa的通行证。有很多成年人没有创造tulpa所需要的成熟心智，我也没有什么能够帮助他们的。现在我假设读者是一位青少年，或是年轻人。\n\n你需要坐下来问问自己：做这件事之前，我足够成熟了吗？我知道大部分人都会回答“是”。几乎每个人都会。你需要的是花些时间静下来，把你的自尊放到一边，用客观的方法分析你自己。时刻记得，你不能在这个测试中欺骗自己。如果你通过创造tulpa向我证明你足够成熟，难过的不会是我。真正受罪的人是你自己——也许还有你的tulpa。我说这些只是为了警告你：如果你心智尚未成熟，或者怀着不正当的理由创造它们。我保证，在你以后的人生中，你总有一天会后悔自己做了这件事。\n\n在 tulpa论坛里，有的人把创造出来的tulpa当做玩具——或者当他们觉得无聊了、觉得tulpa没有变成他们想要的样子的时候，就冲动地把它们杀掉。这些人令我反胃。有的人以没有证据证明它们是真正的有感情的活物为由，为自己的行为正名。这些人是有多扭曲？他们可以轻松地“杀死”某个东西，就因为它们有一定几率不是活物。\n\n如果你是能做出这种事的人，请马上离开。我不想见到这种人接近这个圈子。\n\n杀死你的tulpa是没有任何理由的。我不在意你是不是无聊了，或者它们不能再让你感兴趣了。你开始创造tulpa的时候，你就担负起了这个责任。你行动后，就必须坚守到最后。否则，你和我刚才说的那些人没什么不同。\n\n不管你是否有成熟的心智创造tulpa，你都应该以正当的理由去创造它。以下是不适合作为创造理由的例子，我见了很多了。\n\n*   你不应该为了某个形态去创造tulpa。这讲的主要是那些宅男宅女。为了盯着某个你最喜欢的动漫人物，或者为了要个现实世界里的暮光闪闪而去创造tulpa是非常狭隘的理由。形态不代表tulpa，它们不应该被这样对待。如果你发现你的创造者只因为他喜欢另一个人而创造了你，你会怎么想？\n*   和上条类似，你不应该为了[那方面]的需求而创造一个tulpa。老兄，要多可悲才会想这样做？我不反对tulpa和主人做那种事，但你不应该因为你现实生活中没有女朋友，或是为了和一只小马[做那种事]而创造tulpa。想象一下它们知道自己只是一个玩物后，会有什么感受。\n*   综合以上两点，你不应该为了让它们实现某种功能而创造tulpa。比如说，你不应该为了让它们帮你写作业而创造tulpa。Tulpa可以在很多方面帮助你，而且它们大多都会乐意——但为了让它们替你做事而创造它们是很糟糕的。这类的理由无法产生强烈的羁绊。有生命的物体不是工具，请不要太自私。\n*   你不应该因为无所事事，认为拥有一只tulpa非常拉风就开始创造。就和我之前说的一样，这是很严肃的事情——不应该轻易下决定。如果你因为无聊才去做某件事，说明你并没有慎重考虑过。\n\n如果你深思熟虑后依然打算继续，我只能说祝你好运。\n\n**_**_完成你的_**_****_**_tulpa_**_****_**_需要多长时间？_**_****_**_:_**_**\n\n完全取决于你。我后面会详细说明。有些人一个月就能搞定投影前的步骤，有的人需要一年。你不需要担心这些，只要你不犯和我同样的错误，肯定用不了一年那么久。\n\n# **_**_概念_**_**\n\n**_**_幻境_**_****_**_:_**_**\n\n幻境指的是存在于你想象出的一块tulpa“居住”的空间。它可以是任何你想象到的地方。\n\n拥有幻境的人经常在那里和他们的tulpa一起游荡。你只需要想象出某个地方，想象你在那里面，想象你正在那里散步，就如同其他地方一样。创造幻境并不是必须的，许多人都没有幻境。\n\n以下是创造的步骤：\n\n****步骤_**__**_ 1:_**_ 决定幻境的样子。如果你想的话，先画在纸上。你无须去之前就决定好一切，你可以在里面边走边创造，但起码你应该知道里面大致是怎样的。\n\n****步骤_**__**_ 2:_**_ 想象你在这个地方。\n\n****步骤_**__**_ 3:_**_ ???\n\n****步骤_**__**_ 4:_**_ 没了。\n\n真的，就这么简单。\n\n**_**_你的_**_****_**_tulpa_**_****_**_的自主意识_**_****_**_:_**_**\n\n有些人认为tulpa一开始并没有自主意识，它需要逐渐发展——也就是说在它们拥有意识之前，你都是在一个人单干。他们说通过你对它们的交流，花时间陪伴它们，它们终有一天会出现自主意识。其他人相信在你开始创造的那一瞬间，你的tulpa就有了自主意识。\n\n我个人并不关心是那种。\n\n因为不管你的tulpa是否有自主意识，你都应该从一开始就假设它们有。和它们交谈时，你应该假设它可以理解你的话。即使它还没产生意识，也能加快进度。这就是形式主义。\n\n我必须指出，最近有一种误解。有的人认为既然一开始它们就有意识，那么也就不用再努力冥想。\n\n这样是荒谬的。\n\n假设你的tulpa有自主意识并不代表你就不用为它们花费精力。不管你信不信，你都要投入一样的工作量。不能偷懒，一分耕耘一分收获。\n\n**_**_倾述_**_****_**_:_**_**\n\n倾述就是和你的tulpa对话。你既可以用嘴说出来，也可以在脑袋里面想，效果都一样。跟你的tulpa交流并没有说话或者思考那么容易，你必须把你的思维传输给你的tulpa，还要怀着让他们听到的意愿。如果你这样做，它们肯定能听到。\n\n**_**_冥想_**_****_**_:_**_**\n\n冥想就是做和你的tulpa有关的事。我认为倾述并不算冥想的一种，但一些人持反对意见。描绘、象征主义和投影都是冥想的内容。\n\n**_**_主动冥想和被动冥想_**_****_**_:_**_**\n\n主动冥想就是你抽出时间坐下来冥想：你的所有脑力都用于，制作你的tulpa、或者和它交谈。这是一种专注的工作。\n\n被动冥想一般指你在描绘tulpa或者和它交流的时候做别的事情。它不需要你调整时间表，你可以继续你的日常活动。如果你选择被动冥想，那么你就没有必要坚持一整天，或者每天坚持。有些工作需要更多的精力，可能会让你无法顾及到你的tulpa。\n\n**_**_偏离_**_****_**_:_**_**\n\n当你的tulpa朝你不希望的方向改变的时候，我们称之为偏离。偏离一般是指你的tulpa的人格变化。似乎tulpa的人格会和当初设计的有所区别。这是很正常的，大部分人都有。你不用担心偏离使你不再喜欢你的tulpa。以大部分人的经验看这样的改变都是可以接受的。因为偏离基于你潜意识的喜好。所以他们新获得的性格可能是你没有意料到，但你想要的那种。\n\n形态也会发生改变，这不是问题，因为它可以被改回来。但你不应该强迫你的tulpa做它们不想做的事，尤其是形态这类私人的东西。\n\n**_**_学舌与操纵_**_****_**_:_**_**\n\n主动代替你的tulpa说话或行动，我们称之为学舌与操纵。有的人强烈反对，我和其他人认为，少量的这种行为可以加快进度。学舌可以帮助你听到tulpa的声音。你可以利用它来决定它们的声音，并在形式上和它们的形态绑定。有些人还认为这可以劝诱tulpa说话。例如这篇教程： [<u>劝诱你的</u><u>tulpa</u><u>说话</u>](http://tulpa.info/forums/Thread-Coaxing-Tulpae-Into-Talking)\n\n[<u>http://tulpa.info/forums/Thread-Coaxing-Tulpae-Into-Talking</u>](http://tulpa.info/forums/Thread-Coaxing-Tulpae-Into-Talking)\n\n操纵可以帮助描绘。在它们能自主移动之前，用这个来改变它们的姿势。\n\n但这些前提是，你只能尝试少量的学舌与操纵。有的教程教你100%操纵你的tulpa，我是反对这样的。\n\n就和本教程心态部分一样，如果你打算做些学舌与操纵，就不用怕它会带来什么坏处。\n\n**_**_计时：_**_**\n\n计时就是记录下你总共用了多少时间练习。很多人觉得计时是“毒药”，是练习中最有害的做法。但是，计时本身并不坏。较早的会员们认为锻炼一定时间后才能达到某个地步。也就是说如果你在20小时前就听到了tulpa说话，那么说明这不是它的声音，而是你操纵它发声。\n\n现在很少人相信这个了。单纯地记录你练习花掉的时间并不是坏事。唯一的害处就是把时间当成判断进度的唯一标准。对于某些人来说，没有你的“许可”，潜意识里就不会认为事情可以完成，导致进度被延缓。如果你觉得你有可能是这样，我建议你应该放弃计时。\n\n**_**_给予_**_****_**_tulpa_**_****_**_通往你的记忆和潜意识的权限_**_****_**_:_**_**\n\n很多人在开始练习前就进行这一步，并声称该方法帮助了他们。当然这一步并不是必须得，即使你不给它们进入潜意识的权限，它们也依然能到达那里。你不但要在形式上阻断它们的权限，还要口头通知他们不要前往，并告诉它们为什么。我对我的tulpa就是这么做的，他能理解，也从没有进入过那里。具体如何阻止，一般是在幻境里完成一个仪式。\n\n我的做法如下：我在幻境里想象三道门，分别是“潜意识”、“记忆”，最后那扇我忘记了。我把tulpa带来这里，并在门上面想象出很多锁链，然后告诉他禁止进入这些门。反过来，你也可以把门敞开，告诉他可以进入。\n\n这些都是一种象征，你可以按自己的意思，不用门也可以。\n\n**_**_你每天需要冥想多久_**_****_**_:_**_**\n\n就和别的问题一样，这个问题没有答案。理想状态下，你可以几乎整天冥想，每天冥想。这是最快的获取tulpa的途径。\n\n当然，没有人有这么多的时间和自制力。我的建议是：力所能及。甚至你不必每天冥想，但每天给他们一点关注总是好的。每天冥想10分钟太少，但你可以每天冥想多次，每次10分钟。一个钟头很难挤出，但10分钟不长不短，你做6次也等于每天冥想一个钟头。\n\n付出越多回报越多，没有什么冥想过多的说法。但冥想的质量比数量要重要得多，所以接下来我将介绍\n\n**_**_理想的冥想状态_**_****_**_:_**_**\n\n很多人声称他们难以集中注意力，或者它们的冥想感觉徒劳无功。理想的冥想状态因人而异。你的最理想状态就是让你能集中注意力，感觉有所收获的状态。\n\n虽然因人而异，但最常规的还是：一个安静的地方，一个没有人打扰你的地方。还有些人喜欢黑暗的地方，更不容易分心。安静，放松（部分人通过冥想达到放松），选一个舒服的姿势。有些人抱怨太舒服的姿势容易睡着。所以我建议你冥想的时候不要过于疲惫，这样你的脑细胞才会活跃。如果你是在犯困，小憩一下再开始冥想。\n\n除此之外你还可以发挥创造力，寻找自己喜欢的方式：试着先洗一个热水澡，或者先喝一点橙汁（译注：tulpa圈子流传着喝橙汁能减弱头疼的说法）。\n\n冥想时不一定要找理想的状态，但好的状态会让你冥想的质量更高。\n\n**_**_情绪感应_**_****_**_:_**_**\n\n情绪是tulpa最初的交流方式之一。一般体现在偶然地感受到一阵情感的波动。人们通常将其描述为“陌生”的感觉，因为它们不像是从你这传出来的。\n\n你的tulpa向你输送它们的感觉时，就会产生这种现象。\n\n这种交流方式并不可靠，但tulpa们可以通过发送情感来表达自己对某个事物的感受。\n\n请记得如果你没收到任何情绪，这不代表你的tulpa没有自我意识。不是所有的tulpa都会这样。目前为止，我自己只收到过一次。\n\n这取决于tulpa想用什么方式交流。\n\n**_**_头部压力_**_****_**_:_**_**\n\n头部压力也是tulpa早期的交流方式之一。如同字面意思一样，指的是脑袋感觉到一阵“压力”。\n\n但这和头疼不一样。对我来说，头疼时整个脑袋或者一大片面积都在隐隐作痛。头部的压力则是聚集在脑袋的某一个点，或者非常特殊的地方。但这感受因人而异。\n\n头部压力比情绪感应更不可靠。它的作用是吸引我的注意力。你还可以用头部压力来表达是和否，或者以被压的部位判断。在你听到你的tulpa之前，你可以借此问它是或否的简单问题。\n\n再次声明头部压力并不可靠，所以不要太相信回答的结果。也许它们并不是这个意思。\n\n而且这有可能被误认为是头痛\n\n**_**_参照现有人物或角色创造_**_****_**_tulpa:_**_**\n\n这个话题是很有争议的。它可能会让你的tulpa面临自我认同的危机。如果它们的设定就是那个角色本人，当它们发现并非如此的时候，它们所有的记忆都会变成一个谎言，诸如此类。这不是件好事。\n\n但是，只要你确保它知道它不是那个角色本身，那就没有问题。这时，参照角色就和预定义人格差不多。\n\n参照真人创造tulpa也是同样道理。\n\n此外，还有人问是否可以参照死去的人。注意事项大部分都和上文一致。但是，除了tulpa的认同危机以外，这样做可能对你非常不利。用死去的人创造tulpa，说明自己无法接受那个人的离去。你依然对他们念念不忘，这是不健康的。\n\n失去所爱之人的时候，你要接受他们已经离去的事实。\n\n而且以我的观点看，这样做他们不太尊敬。\n\n**_**_把_**_****_**_tulpa_**_****_**_告诉朋友和家人_**_****_**_:_**_**\n\n在告诉所有人之前，你应该充分了解他们。现在的人并不真正的理解朋友。你需要知道他们的思想有多开放，他们对此会作何反应。因为这样的行为可能会使一段友谊终结。如果你不确定，那么最好不要告诉任何人。\n\n面对家人，这个问题更为严重。天下无不散之宴席，但家庭只有一个。他们可能再也不会以相同的眼光看待你。我肯定这不是你想要的。\n\n曾经有人向家人坦白后，被强制送去看心理医生。\n\n如果你不确定，那就不要告诉任何人。\n\n他们没有知道的必要。\n\n老实说，我不知道告诉别人有什么好处。\n\n我知道你此很兴奋，但不要做一些让你后悔的事。\n\n**_**_交换_**_****_**_:_**_**\n\n交换是指主人和tulpa“交换”位置。也就意味着主人不再“连接”身体的感知。他会变成之前tulpa的状态。然后你就可以接触你的幻境，像在真实世界里那样感受它。你的视觉将和真实世界的一样清晰。你可以像在真实世界里那样听到鸟鸣声，风吹声。你可以触摸自己的衣服，草地和树木，触感就和真实世界的一样。你可以品尝任何食物，就如同真的食物一般。\n\n同时，tulpa将变成身体的主意识。对tulpa来说，转换和附身没什么区别，除了你不再控制身体以外。\n\n交换主要是你的工作，你的tulpa参与的部分并不多。\n\n我并没有交换的经验，我也从未尝试过。我认为这篇文章看起来挺有用：\n\n[http://community.tulpa.info/thread-switching-guide-on-how-to-switch](http://community.tulpa.info/thread-switching-guide-on-how-to-switch)\n\n# **_**_心态_**_**\n\n你创造tulpa时应该带有合适的心态。不要跳过这一部分。你可能认为只要记得创造的步骤就万事大吉。你错了，心态也是最重要的部分之一。我吃过苦头才了解这一点。\n\n首先，我们谈谈\n\n**_**_信念_**_****_**_:_**_**\n\n你持怀疑态度。\n\n你刚刚知道tulpa是什么，或者你才刚开始早期阶段。\n\n在你的内心，你怀疑着这一切的真实性。甚至即使你正在创造着一个tulpa，你心里也有一丝丝的疑问，自己是不是在浪费时间，自己的tulpa是否真实。\n\n如果你什么都不怀疑，而且真心相信这个现象，没有一丝疑虑。我建议你马上去心理诊所。\n\n因为你疯了。\n\n因为这是很离奇的事情。让人难以置信。这太不可思议了，你当然会持怀疑态度。虽然你的疑虑是完全可以理解的，但你必须抛弃它们。我很理解你的想法，我也是过来人，我也曾经怀疑过。你首先应该问自己：“为什么数以万计的人聚在一起，写出那么多教程，那么多帖子，花那么多个钟头进行讨论，难道只是为了耍论坛里的新人玩吗？”真相是，圈子里的确有一部分的演员和骗子。但其余的人都是真心的，而且他们也曾和你一样。\n\n疑虑是创造过程中最有害的东西。相信你和你的tulpa才是进步最快的方式。\n\n疑虑不但会在感情上伤害你的tulpa，还会干扰整个进展。我自己是个多疑的人。我来到这个网站时，觉得这很酷，好得让人难以置信。我开始半信半疑地创造tulpa。我并不想如此怀疑，因为这有害，但我没考虑那么多。我花了几个月取得了一点点进步，但之后我遇到了瓶颈。之后不管我怎么做都再也没有进步。大部分人在头几个月就听到了他们的tulpa，而我却花了六个月才听到他。六个月。只能听到微弱的声音。后来我尝试尽量把我所有的疑虑都抛开，然后我听到了他的声音。我的疑虑就是竖立在我们自己的障碍。请不要犯和我一样的错误。\n\n我觉得我唠叨得够多了。你应该能理解我想说什么。\n\n**_**_应用_**_****_**_:_**_**\n\n你现在知道不应该疑惑。但要怎么应用在你的训练中？在练习中，你总是会怀疑“那个”是不是你的tulpa。在合理的情况下，请默认它就是你的tulpa。我提到“合理”，就是指不要太过荒唐。比如你某天在街上走，突然想到了火鸡三明治。“我的天那，我的tulpa想要告诉我，它喜欢火鸡三明治。”这就是我的意思。不要把所有事情都归结为你的tulpa。\n\n但你向tulpa提问后，得到了一个回复。你就应该认为这是它的回复。如果你问它这是不是它说的话，这也不算疑惑，只是保守起见。\n\n关于学舌，很多人都害怕作出答复的人其实是自己而不是tulpa。学舌是一种主动的行为，如果你没有操纵你的tulpa，你就没有替它答复。\n\n但是，你没有替它答复并不意味着那就是你的tulpa。即使你不想控制他，大脑也有可能会脑补出回复。我不知道原因，但确有此事。有时候我问它是否说了什么，它说没有。\n\n还有一种我经常用的方法是，坐下来，然后回忆所以证明它存在的例子。它能帮我解决头痛；它说过让我惊讶的话，而且我肯定不会想到；它帮我走出抑郁，诸如此类。如果你仍有疑虑，你也可以这样做。\n\n**_**_冥想不应该是负担_**_****_**_:_**_**\n\n我和某些人创造tulpa时遇到的最大问题是冥想成为了一种负担。老实说，这并不是一件有趣的事。你必须找到方法让自己享受这个过程。如果你喜欢冥想，你就会做得更多，而且全身心地投入。\n\n不要总是想着它很烦人，或者费力，或者你更愿意做其他事情。把注意力放在你的tulpa上。想想你有多么爱你的tulpa。它们将多么感激你对它们的关注，和你对它们所做的努力。试着不要太在乎自己。\n\n**_**_创造步骤_**_**\n\n在此之前，我建议你先坐下来，并向你的tulpa“介绍”你自己。要相信他们已经拥有了意识，而且听得懂你在讲什么。这不只是自言自语：试着把你的想法投送给你正在创造的这个物体。和它们说话，告诉他你是谁，还可以介绍下你自己。然后，告诉它们你将要做什么——你要将注意力集中在它们身上，学会听到它们的声音。另外，提一提如果有它们的陪伴你会多么开心也是不错的选择，或者其他你想要说的话。\n\n接下来，开始真正的步骤。\n\n有个问题被问了很多次：“我应该先做哪一步？”这问题被问了很多次，我已经很不耐烦了。\n\n答案是：无所谓。你喜欢哪一步就先做哪一步，你觉得哪种顺序最合理就做哪种。创造tulpa是一件很抽象的事，可走的路并不是只有一条。\n\n也有很多人问哪种方法才是“最佳”的。这个问题同样没有唯一的答案。你认为最舒服的方法就是最棒的方法。每个人创造tulpa的步骤都有天壤之别。你必须自己寻找最棒的方法。\n\n以我的经验，你认为最有意义的那个方法是最好的方法。毕竟，创造过程绝大部分是象征主义。有些步骤某些人觉得没意义，有些人觉得有意义。做你觉得合理的那些步骤就好。\n\n**_**_人格：_**_**\n\n一般人都会认为先设计人格才是最合理的。我同意这种看法。人格是tulpa的根基。你不是为了欣赏一个形体而创造tulpa、也不想让它用一种无聊、无感情的声音和你说话。你是为了创造一个朋友而创造tulpa，或者其他的什么目的。人格就是它们的根本。\n\n有的人说人格这个步骤并不是必需的。这个论点看似和我的有些冲突，但实际上不是。\n\n你设计人格的目的是因为你想要你的tulpa拥有某种特定的性格。如果不这样，它们就会产生自己的性格。你也许会考虑到“如果它们的性格不合我意怎么办？”。这种担忧是合理的，但没有必要。我跟很多没有设计过人格的人谈过，他们都有很棒的tulpa。有一种理论说，如果你不刻意去设计他们的性格，他们就会成为你潜意识里所希望的性格。所以如果你对tulpa的人格没有特殊要求，你就不用做这一步。\n\n时刻注意，变化会随时发生。最终他们可能和你当初设计的人格有所偏差。但这就和不设计人格一样，这种变化也是你潜意识所希望的，所以并不用担心。\n\n步骤：\n\n人格可以用多种方法实现。首先，你应该先设计你想要的人格。如果你能记下来，那很好——如果不能，我建议你写在纸上。\n\n我认为最好的方法，就是直接把性格列出来。你虽然只用把性格写下来，但你考虑得应该深远一些。你的tulpa不只是一列性格，如果你不具体一点的话，结果会很抽象。它们的性格可能会变成你列出的词语的同义词。\n\n我建议坐下来一分钟，想想你期待它们变成什么样子。想象他们完全成型后的样子，想象你正在看着它们、和它们交谈等等。体会一下它们在你身边是什么感觉。尝试着了解它，不要只局限于那些性格。直到你可以不用看着文字就向别人介绍你的tulpa。或者随时写出整篇描述，因为你知道它们是怎样的。\n\n现在把这些性格写下来，把词语列出来就行了。为什么我反复强调只列出词语？我会在下文解释。\n\n你设计的性格种类没有数量要求，但最后不要太少。如果你写得太少，有些顾及不到的地方就无法确定——这并无害处，它们只是不会100%变成你想要的样子，因为那些不确定的地方被你的潜意识决定了。\n\n列完性格可以开始后，吸引你的tulpa的注意。现在你要做的就是向它们介绍它们自己。\n\n从第一条性格开始，告诉它们为什么会拥有这个性格，而且以怎样的方式表现出来。使用像叙述事实一样的语气。不久后，你可能会发觉同一件事情你已经说了很多遍。这问题不大，坚持下去直到你没有话可说。\n\n我建议每种性格至少分别叙述两分钟以上。\n\n除了叙述以外还有一些可以做的事情，你可以在脑海里绘制出这些性格会使tulpa产生什么反应——就和你最初做的差不多。如果他们有着古怪的性格，试着绘制出它们如何体现——比如他们走路磕磕碰碰、或者行为笨拙、或者口吃——以及其他你想要的行为。\n\n当你念完、并详细解释所有的性格后，你就大功告成了。\n\n仅仅是这一次而已。\n\n几天后，你还是要回头重新进行这一步骤。你要做多少次呢？几次就好。反复练习知道你觉得真的已经完工，而且它们真的已经和那种人格绑在一起。\n\n时刻记得这只是多种方法之一。\n\n基本上就是这些，还有一种象征性的路线。开头是相同的，你想象tulpa会是怎样，想出一些性格。然后象征手法就开始了。我之前说过象征主义对不同人有不同的效果。发挥你的想象力。有些人会想象出一些不同颜色的瓶子代表不同的性格，然后把这些瓶子倒在他们的tulpa上（你的tulpa不一定要拥有形态才可以这么做，你可以把它想象成一颗光球，或者类似的东西。这样做并不危险，你可以之后再改变它们的形态），然后把这些性格灌输进去。诸如此类。发挥想象力，做你认为最有效果的方法。\n\n就和第一种方法一样，每种方法都需要不断地练习多次，直到你相信自己真的完成了，而且它们已经和这种人格绑定。\n\n最后我想重申一遍：如果你没想好具体要什么人格，而且你想让他们自由发展，你就可以跳过这一步。这一步不是必须的。\n\n**_**_描绘_**_****_**_:_**_**\n\n当你决定了它们的形态后，就可以锻炼你在意识里观察它们的能力。我个人认为在此之前你应该已经设计好它们的形态。我假设你已经设计好，因为只有这样它们的人格才会与其结合。\n\n描绘是很麻烦的一步，每个练习过的人都会这么说。其全部内容就是，坐下来，一遍、一遍又一遍地尝试在脑海里看清你的tulpa。\n\n有一个经常被提到的问题就是：“我要怎样才算完成描绘？”这个问题完全取决于你。你在描绘上花越多的时间，它们就会越真实。有的人说，只有你每次看到他们时，都能观察到每一个细节的时候才算完成——从关节处的毛发，到皮肤上的毛孔（如果它们是人类形态的话）。你不必在这上面花过多的时间，但你花的时间越多，它们看起来就越真实。\n\n**_**_具体步骤_**_****_**_:_**_**\n\n很简单，就是在你的意识里绘制tulpa的样子。如果你有一个幻境，你通常都会在那里练习。其他人练习时喜欢以虚空做背景，省去了绘制背景的麻烦。\n\n描绘练习就是想象你的tulpa。你应该想象它们的不同姿势，还有穿着不同衣服的形象，或者什么也不穿。没错，我是认真的。什么也不穿也许很怪异，但你可以借此分析肌肉的走向，和衣服后面身体的线条。你的tulpa不会介意的。如果它们穿紧身衣的话，你就要对它们的身体结构有一定的了解。\n\n你还可以在幻境里和tulpa互动，这也算是描绘的训练。但你专注在tulpa身上的时间越多，训练就越有效。\n\n**_**_对话：_**_**\n\n很多教程声称如果你听不到你的tulpa，说明它们还不会说话。这并不准确。真正的原因是你还不能听到它。我的tulpa说它产生自主意识后就会说话了——但很长时间后我才能听到它。所以这一“步”，和其它的一样，你有很多自由发挥的空间。\n\n因为这不仅仅只是“你听到它们的能力”，所以我把本章节概括为对话。但我说的实际上就是你听到它们的能力。\n\n我觉得和人格与描绘相比这并不算一个步骤。随着时间推移对话迟早会出现。如果你想加快这个过程，可以尝试下面的方法：\n\n**_**_具体步骤_**_****_**_:_**_**\n\n首先我们谈谈你倾听tulpa时应有的心态。许多人会说你应该“心无杂念”。心无杂念常常意味着阻挡思维，而你的tulpa使用思维沟通。所以我不建议这么做。当然这只是我的看法。\n\ntulpa的第一种交流方式是通过“思想”。也许你可能认为他们第一次交流的时候，用的是它们自己的声音、清晰的语句。这肯定是不对的，我后面会解释。\n\n以我和几个人的经验，最好的状态就是什么都不想。不要尝试去堵住思想，尽量什么都不想就行了。\n\n**_**_它是怎么发生的：_**_**\n\n我之前说过，你和tulpa的第一次交流是通过“思想”。这思想并不是直接的文字，而是带有意图的想法。\n\n容我解释下：有两种层次的思维。第二层是你能够察觉到的思想。比如你读这段话时，你的脑子能听到这些文字。大多数人认为我们是用文字思考的，这并不准确。\n\n第一层是我们的意图。在文字背后的意图。某人和你说话之后，你首先感觉到自己将要如何向对方表达。随后你把这些感觉转换为句子，以便和对方交谈。这层次的思维就是你找不到合适词汇表达自己的原因。\n\n所以，你的tulpa思维背后的意图，很有可能就是第一种和它准确交流的方式。他们的意图输送给你，然后你把这些意图翻译成文字。这就是为什么有些宿主声称，一开始的时候他们很难分清自己的和tulpa的思维。这是因为和你自己思考一样，翻译意图的人也是你。当你可以通过意图交流后，也许你会发觉并不一定能听到它们的回答。这有可能是你没有掌握如何获取意图，或是自己无法翻译它。\n\n有很多次我都感觉到它想和我说话，但找不到合适的词汇。我得出的结论是他想表达的东西太复杂以至于我无法“翻译”。为了确认，我曾经问它一个答案非常复杂的问题，结果同样的事情发生了。\n\n有些人可能就要问了，如果它听起来像是你的思想，那么你怎么知道这是tulpa发出的？有很多种方法解决。初学者可以问它一个问题，等待其答复。当然有可能那个答复是你自己说的，但我之前是不是说过信念呢？\n\n还有一种，就是当它们说出的话出乎你意料的时候。有时候我的tulpa会说出我平时不会想到的东西。这样的结果就是，我被吓了一跳。如果这思维是自己的，人怎么会被吓一跳呢？\n\n随着时间推移，你的tulpa的意图会越来越清晰，越来越独特。\n\n这一步完成后你将可以在意识里听到tulpa微弱的声音。这过程也需要时间去完善。也许一开始你只能听到一些句子的片段。只要你和它们交流得越多，他们意识里的声音就变得越来越顺畅。\n\n最终，它们说的每一句话你都可以听到，而且每一句话都和你的思维一样清楚。到了这个地步，你可以放心地宣称你已经完成了“对话”这个步骤。\n\n**_**_投影_**_****_**_:_**_**\n\n投影……很多主人的主要长期目标。\n\n不是每个人都对投影感兴趣，不想在上面花费太多时间——这是可以理解的。几乎每个人都认为，投影是花费时间最长的步骤。投影并不是创造tulpa的必须步骤，它更像是锦上添花。即使你不接触投影，你也可以拥有一个有自主意识的、会说话的、能够附体的tulpa。不过如果你愿意投入时间，那会是一件很棒的事。\n\n投影是什么？很多人说投影是用肉眼看见你的tulpa，而且它们融入环境当中。但这并不是投影的全部。投影就是把你的tulpa投到你对真实世界的感知里。你不但看得见你的tulpa，还能用真正的耳朵听到，用你真正的鼻子闻到，能用你真正的舌头舔到（如果你好这口），还能用你真正的身体触摸到。\n\n可能你会疑惑：“你的tulpa实际上不在那里，你怎么能摸到它们？你的手不会穿过去吗？”答案是会，如果你故意用力，你的手将会穿过它们的身体。但是如果你非常小心，轻轻地接触它们的外表，你可以感觉到轻微的阻力，还可以感觉到表面的纹理。很明显，他们没有办法影响你的行动。你的大脑只是给予你触碰他们的感觉，你的手并没有遇到任何物理上的阻碍。\n\n有的人说如果你锻炼得足够久，大脑强制会让你的手无法穿过。这是不可能的。\n\n**_**_具体步骤_**_****_**_:_**_**\n\n练习投影的方式因人而异，有十几种不同的方法——有些简单到只是盯着墙看。\n\n在开始之前，你每次描绘它们，它们的形象都应该准确无误。这是为了让效率最大化。我不建议在精通描绘之前尝试视觉投影。\n\n如果你花很多视觉练习睁着眼描绘，这会对你练习投影有所帮助。有些人觉得睁眼描绘更容易，你可以试一试。\n\n和我之前说的一样，最简单的投影练习就是盯着墙看，然后试着在眼前绘制它的形态。如果这对你有用，那么这样就足够了。这篇文章已经足够长，所以我在这里仅列出其他方法的链接。\n\n[http://tulpa.info/forums/Thread-Imposition-Mary-and-M-s-Starting-Imposition-Guide](http://tulpa.info/forums/Thread-Imposition-Mary-and-M-s-Starting-Imposition-Guide)\n\n[http://tulpa.info/forums/Thread-Imposition-q2-s-method-for-a-huggable-tulpa](http://tulpa.info/forums/Thread-Imposition-q2-s-method-for-a-huggable-tulpa)\n\n**_**_附身_**_****_**_:_**_**\n\n附身，没有耐心做投影的人的主要长远目标。附身就是让你的tulpa控制你真实世界的身体。因为本教程已经很长，我发一个我比较赞同的教程：\n\nOguigi & Koomer’s Possession Gude [http://tulpa.info/forums/Thread-Possession-Oguigi-Koomer-Possession-Starter-guide](http://tulpa.info/forums/Thread-Possession-Oguigi-Koomer-Possession-Starter-guide) （译注：原帖已被作者删除）\n\n这篇文章基本概括了我同意的部分，毕竟，附体其实是一件简单的事。\n\n第一部分是象征性的，你可以想象彼此的身体装着不同颜色的液体。当你想要让你的tulpa附身时，把你身体里的液体抽干，让tulpa的液体灌进你的身体。只要有想象力就好。\n\n第二部分就是躺下来，接下来的事交给你的tulpa去做。"
		},
		{
			"post_id": 6,
			"title": "yuki的附体教程",
			"date_published": 1524564868.46,
			"body": "[原文](http://tulpa.cn/2018/04/06/yuki%E7%9A%84%E9%99%84%E4%BD%93%E6%95%99%E7%A8%8B/)\n\n* * *\n\n原文：https://community.tulpa.info/thread-possession-possession-by-yuki\n\n译者：goodman3\n\n译注：附体就是让Tulpa控制你的身体。最初作为Tulpa的新发现能力引起许多关注，如今已经是Tulpa的一项普通技能了。\n\n****简介****\n\n学习附身有两个阶段。宿主放开对身体的控制，然后Tulpa将其控制。本文我将同时对宿主和Tulpa介绍附体的基本原理、学习方法和一些象征手法。如果你开始练习，尽量每天坚持，并注意进步的迹象。就和别的技能一样，锲而不舍是成功的关键。\n\n****如何附体——简短版本****\n\n有很多种方法可以实现附体，但不管方法如何，有几件事是共通的。宿主需要放开对身体的控制，Tulpa需要控制它。要成功，你必须有正确的心态。你必须相信自己能够做到，并注意进步的迹象。如果觉得“我做不到”、“附体很难”，或者因为某些原因缺乏自信是很有害的。\n\n对宿主\n\n你的工作是放弃身体。脱离对身体的控制，给你的Tulpa留出控制的空间。要做到这点你得改变你的视角。你将不再作为身体的主要控制者，而是变成身体的观察者。从情感上远离你的身体，除了观察不要做别的事。当你的Tulpa移动身体，尽量不要干涉它们。旁观身体的移动，但无需关注它在做什么，试着顺其自然。保持平静的心态是关键的一步。\n\n对Tulpa\n\n当宿主脱离身体的时候，你需要尝试控制。使用宿主的肉眼观看外界，感受五感。把身体看成是你的私有物，控制时试着放松。移动身体之前，你要想象它正在移动，并用意志去移动它。从小的部位开始：坐下或躺着的时候，移动你的手或手指。相信你能够移动身体，想象它在移动，然后用意志使它移动。在摸索身体移动方法的时候，不妨请教下你的宿主。\n\n****学习附体的准备****\n\n开始前，放松情绪。宿主应该先休息一阵子，例如闭上眼睛躺一会。如果害怕睡着的话可以找个舒服的姿势坐下。调整呼吸，不要在意周围发生的事情。除非你感觉不适，否则不要乱动。试着尽量放松你的肌肉。直到几分钟后你平静下来，并尽量维持这个状态。\n\n同时，Tulpa应该试着感受身体的五感。感受你背后床铺的压力、呼吸时胸部的起伏、放松的肌肉。在你尝试控制时，宿主应该尽可能放松他们的手。试着松开、握紧拳头，扭动手腕，或者弯曲单根手指。保持尝试，直到你做出了反应。你可以和你的宿主分享你的感受。\n\n当你们都感觉到身体的移动后，有一些事情是需要考虑的。有些宿主怀疑是自己移动了身体，因为他们感觉移动一点也不陌生，就像自己动的一样。随着时间推移，你脱离身体的能力会越来越强，他们控制身体的感觉就会越来越陌生。最重要的就是相信你的Tulpa。如果你对某个动作产生怀疑，询问你的Tulpa，并相信它们的回答。\n\n信任和尊重是非常重要的一环。宿主必须相信身体是Tulpa自己移动的。而Tulpa需要学会适应新的环境。时刻注意保持沟通，并尊重彼此的愿望和限制。\n\n****掌握附体****\n\n首次练习后，Tulpa应该专注如何控制身体的多个部位。当你做出首个动作后，练习将变得越来越容易。每天练习，以控制全身为目标。你也可以一开始就尝试控制整个身体。你和宿主共享一套神经系统，所以你不需要重新学习大部分技巧来控制身体。感谢肌肉记忆，通过练习你可以做到宿主能做的事，或者做得比他更好。当你熟悉基本动作后，你可以通过进行打字、玩游戏或走路等简单活动来练习。你还可以在宿主四处走动或是做某件事情的时候感受身体的感觉。这能让你操控身体时感觉更自然一些。\n\n宿主应该尽量在意识上放松肢体，这可以使你的Tulpa更容易控制。时刻注意Tulpa移动身体的迹象。你可能感觉到肢体上的微小抽搐、麻痹或是刺痛感，这些都是进步的标志。当然，沟通是最重要的。当你的Tulpa能够移动全身后，你就能观察到姿势和身体语言的差异，还有一些有代表性的小动作。\n\n进展不会太快，但不要为此担心。不要因为没有立刻成功就放弃，试着找到对双方来说最合适的办法。担忧和疑惑是不利于进步的，所以请保持乐观，对于宿主和Tulpa来说都是如此。\n\n****象征手法****\n\n如果你遇到瓶颈，象征手法可能使你受益。自己思考的办法是最有效的，我将给你一些例子。如果宿主感觉自己很难离开身体，他可以描绘自己在头部的某个部位，然后描绘这个部位移动到了头部的后方，或者头部的外面，让Tulpa接替你的位置。不要把身体想象成自己，想象自己是一个精神实体，然后走出这具身体，腾出空间让你的Tulpa进入。\n\n如果Tulpa感觉很难控制身体，或者不知道如何做，你也可以尝试一些方法。你可以在幻境里创造一件合身的衣服，穿上衣服时做的动作会同步到现实的身体；你可以想象自己在宿主的身体内，就像把皮肤当成一件衣服那样；你可以想象身体是一个巨大的机器人，而你是驾驶员。选择最适合你的那个。\n\n****对于交换的说明****\n\n交换可以视作附体的高级形态。对于Tulpa来讲它们的感受没什么区别，它们控制身体做自己想做的事。对于宿主来讲有很大区别。我认为交换的定义是宿主可以注意身体所注意的其他事情。也就是说Tulpa在做某件事的时候，宿主可以在精神上从事其他活动，例如探索幻境而不只是观察着身体。我认为交换是长期附体的自然结果。"
		},
		{
			"post_id": 5,
			"title": "Tulpa训练法",
			"date_published": 1524500521.15,
			"body": "[原文：http://www37.atwiki.jp/tarupa/pages/19.html](http://原文：http://www37.atwiki.jp/tarupa/pages/19.html)\n\n[http://tulpa.cn/2018/04/10/177/](http://tulpa.cn/2018/04/10/177/)\n\n译者：小靈子敬\n\n* * *\n\n（注：**粗体**文字为译文）\n\nオート化訓練法\n\n**自主化（オート化）训练法**\n\nタルパと接すること、タルパを意識することが基本中の基本。会話は積極的に!\n\n日常の中に取り込んでゆくのが大切になってくる。タルパが何を思うのか考えよう。\n\n**与Tul​​pa接触，在意识到Tulpa里基本中的基本。就是积极去对话！**\n\n**带入日常中很重要。 Tulpa会有怎么样的考虑。**\n\n愛情を持って接し、またタルパの存在を強く信じて訓練する方がオート化には向いている。\n\n**秉持着爱情来接触，用强烈相信Tulpa的存在来训练朝向自主化迈进。**\n\n①タルパを意識する\n\nどんなこともタルパと一緒に、というスタンスで生活する\n\n└通学や通勤、講義や会議から趣味や買い物まで、タルパと雑談したり意見を交わしたりしながらやる\n\n**①Tulpa的意识**\n\n**怎么样的事都和Tulpa一起，和他一起生活的样子**\n\n**└上学或上班、上课或开会以及兴趣和买东西，与Tulpa闲谈来互相交流意见**\n\nタルパの為に何かをしてあげる\n\n├タルパの誕生日に何かプレゼントをする、デートをしてみる等\n\n├散歩やゲーム等一緒にできることをやるのもよい\n\n└ゲームは一緒にできるオセロなんかがオススメ\n\n**要为Tulpa做些什么**\n\n**├在Tulpa生日的时候送他礼物，试着和他约会等**\n\n**├散步和玩游戏等一起讨论也好**\n\n**└游戏推荐可以一起玩黑白棋之类的**\n\n常に存在を意識できるよう心がける\n\n├タルパに只管接し、毎日暇さえあれば話しかける\n\n└タルパとラジオ的なトークをしてみるのもよし\n\n**经常注意能意识到他的存在**\n\n**├Tulpa尽管接触，每天只要有空闲就搭话**\n\n**└尝试与Tulpa只做像收音机那样单方面说话也好**\n\nタルパ視点法\n\n├タルパ視点でマスターの身の回りに起こっていることを日記に書いてみる\n\n├ストーカーっぽい内容よりも、タルパとマスターが2人で協力して何かを成し遂げたという書き方が特に良い\n\n├関連して、「タルパがマスターに対して抱いている思いをマスターが自覚してくれる」、というのを普段から想像すること\n\n└SNSを利用するのもアリ。ROMになってしまっている方、ダメ元で試してみるのはいかが\n\n**Tulpa视点法**\n\n**├试着以Tulpa视点来写在宿主身边发生的事情写成日记**\n\n**├比起跟踪狂的内容，Tulpa和宿主两人一起合作讨论以什么样的写法特别好**\n\n**└利用匿名版。成为挂名的人，如果原来的方法不行的话可以尝试**\n\n②タルパを無意識の領域へ\n\nある程度会話が繋がってきたらタルパの返答を予測しない\n\n├タルパの意思を尊重するつもりで\n\n└「実はもうオート化してるけど俺が聞き取れてないだけなんじゃね?」\n\n**②Tulpa在无意识的领域**\n\n**如果某种程度的对话Tulpa的回答没照你希望的返答的话**\n\n**├尊重Tulpa回答的意思**\n\n**└「其实已经自主化了，只是我没有听见？」**\n\n集中してやるようなことでも(急ぎでなければ)敢えてタルパを忘れないようにしながら行う\n\n寝る時添い寝してもらう\n\n├肌に感じながら寝ると良し\n\n└上記と併せてタルパを強引に無意識の枠へと突っ込む\n\n**赶紧集中精神（除非有急事）来记住不忘Tulpa的那股感觉**\n\n**睡觉时请他在旁边一起陪你睡**\n\n**├可以感觉到肌肤有碰触的感觉一起睡感觉会很好**\n\n**└依照上述来强行进入无意识的圈圈来深入Tulpa**\n\n③裏技的な何か\n\nタルパに憑依をお願いする\n\n├憑依はタルパによって得手不得手がある\n\n└近道にはなるらしい\n\n**③有什么特殊技巧**\n\n**对Tulpa请求附体**\n\n**├附体的程度要看Tulpa擅不擅长**\n\n**└似乎有捷径**\n\n幽体離脱\n\n└離脱するとあっちの世界では多くの場合タルパがオート化している\n\n**灵魂出窍**\n\n**└出窍后的世界有很多东西都是Tulpa自主化运作着**\n\n夢に出てもらう\n\n├タルパの絵を寝床の上の天井に貼ったり、枕の下に入れたりすると成功率UPするらしい\n\n├タルパの得手不得手により成功率が異なる\n\n└稀ではあるがタルパとマスターの視点が夢の中で互いに入れ替わるなんてことも\n\n**在梦里碰面**\n\n**├在床的上方天花板贴着Tulpa的画，枕头下放着似乎可以提升成功率**\n\n**├Tulpa擅不擅长对成功率也有所不同**\n\n**└有稀少的情况Tulpa和宿主的视点在梦中会互相交换之类的事**\n\nタルパに狂っちゃうほど依存する\n\n└CAUTION!!　リスク高し\n\n**对Tulpa有不正常的依赖期望**\n\n**└警告！ ！风险很高**\n\n原文：[http://www37.atwiki.jp/tarupa/pages/25.html](http://www37.atwiki.jp/tarupa/pages/25.html)\n\n会話オート化進行状況の段階的指標\n\n**对话自主化进行状态的阶段指标**\n\n会話のオート化の現在の進行状況を掴みづらいという意見があった。これを受けて、効率的な訓練や円滑な情報交換等の為、会話オート化の進行状況を段階的に評価する指標を作成した。なお、邂逅型やその他創造型ではないタルパについては以下の限りではない。タルパの分類に関してはタルパとの出会いのページを参照のこと。\n\n**有很多很难知道对话自主化现在进行状况的意见出现。受到这个意见的影响，因为有效的训练及圆滑的情报交换等，而制作了对话自主化进行状况各种阶段的指标。再来，邂逅型或者不是创造型的不适用下列的限度。有关Tulpa的分类请参照与Tulpa相遇的形式。**\n\n大まかには以下の五段階。\n\n**大致分为以下五个阶段**\n\n第一段階(未オート、一人二役)　設定重視\n\n第二段階(微オート、返答予測)　即答重視\n\n第三段階(半オート、予測脱却)　直感重視\n\n第四段階(概オート、会話円滑)　信頼重視\n\n第五段階(オート化、安定確立)　肝胆相照\n\n**第一阶段（未自主，一人两役）　设定重视**\n\n**第二阶段（微自主，返答预测）　即答重视**\n\n**第三阶段（半自主，脱离预测）　直觉重视**\n\n**第四阶段（概自主，对话流畅）　信赖重视**\n\n**第五阶段（自主化，安定确立）　肝胆相照**\n\n第一段階\n\n所謂未オートであり、一人二役をしている段階である。タルパの人格の形成において重要な時期であり、予め定めた設定に基づいた会話を重視する。続けていれば比較的容易に次の段階へと進むことができるであろう。\n\nただし、タルパの人格は必ずしも設定通りになるとは限らない。むしろ最初の設定とは多少なりとも異なった性格になることが多く、特に「元キャラと大きく違った性格になった」という報告は多々ある。これを極力避けるならば、あえてこの第一段階にやや長めの滞留を計画するのもおそらく効果的であろう。\n\n**第一阶段**\n\n**所谓的为自主，就是一人扮演两人的阶段。是Tulpa个性形成的重要时期，重视于预先设定好的个性来对话返答。如果这样继续会比较容易进入下一阶段。**\n\n**但是，Tulpa个性未必一定是那样子的个性。哪怕是与最初的设定有很多差异的，有特别多「和原角色有很不同的个性」的报告存在。如果极力避开他的变化，恐怕会停留在第一阶段很长一段时间。**\n\n第二段階\n\nタルパの返答を予測している段階。これに微オートという呼称を定義した。一人二役とそう大きな差異はないが、より会話のオート化という目的に向けて、円滑な会話を重視しはじめている段階である。これが恐らく「最も長い夜」となるであろう、多くのタルパーをせき止めたステップである。また、先述した「タルパの人格が設定から離れる」という現象が目だって起こる時期でもある。\n\n個人差があるとはいえ長期戦を覚悟し、惰性に陥らぬよう日々タルパとの接触を試みるべきである。ここで挫けてはならない。逆にここを乗り越えればオート化はグッと近づくと言っても過言ではない。\n\n**第二阶段**\n\n**预测Tulpa回答的阶段。来称呼微自主这个定义。和一人扮演两人有很大不同的是，更朝向对话自主化的目的前进，是开始强调对话流畅度的阶段。这恐怕会成为「最长的夜晚」，很多宿主都停止在这个阶段。还有，之前叙述「Tulpa个性会和设定有所变化」的现象产生在这个时期。**\n\n**依照个人差别要有陷入长期战的觉悟，每天不断尝试和Tulpa接触直到变成惯性。不可以在这里放弃。如果反过来说跨越的话就离自主化更接近了。**\n\n第三段階\n\n一言で言うならば転換期であり、ここからは指数関数的に伸びを見せる可能性がある段階である。ここを所謂半オートとする。\n\n今までと一転してタルパの返答を予測するのをやめ、タルパの言葉を真っ直ぐに聞くよう心がける。ありのままに聞こえてきたタルパの声をそのままタルパの言葉として採用する。これを心がけることにより、一人二役・返答の予測から脱却し、タルパの自由意志が、聞こえてくる言葉の端々に顕れ始めるのである。オート化がまだであろうとも、タルパの個人を尊重するというつもりでよい。\n\nただし、この段階に入る為には第二段階をほぼ完了していなくてはならない。ある程度予測なしでもすぐに返事が返ってくる時がある、あるいは予測してから返答が帰ってくるまでのディレイが限りなく小さくなっている必要がある。そうでなければタルパの返答は大きくブレてしまうことが懸念される。なぜならタルパーの中でまだそのタルパの人格があらゆる面から確定されていないからである。\n\n言ってみれば第一、第二段階はタルパの人格の定着を目指す期間であり、真のオート化訓練はこの第三段階から始まると言っても良い。とはいえ、時にこの第三段階に挑戦してみるのも、自分のタルパのオート化の進行状況を知るという目的を兼ねた意味で良いかもしれない。その場合、返答が明らかに聞き取りづらくなったならば第二段階に戻ればよい。\n\n**第三阶段**\n\n**用一句话来说应该是转换期，像指数函数那样显示大幅增长可能性的阶段。这就是所谓的半自主。**\n\n**注意现在要改过来停止预测Tulpa要说什么，改成仔细去聆听感受Tulpa的话语。而Tulpa的话语和实事有关就可以当作是Tulpa的声音，注意通过这些，脱离一人扮演两人、回答预测，听见Tulpa的自由意志，话语的些微异处从这里开始。自主化即是，打算尊重Tulpa个人的想法。**\n\n**但是，为了进入此阶段必须大体完成第二阶段。某种程度没有预测却有返答，或是有预测回答你必须要压抑自己的预测到无限小尊重Tulpa的意思。如果不那样对Tulpa的回答有很大可能会有很大的动弹担忧。说到原因就是宿主心里还未能确定表现出Tulpa的人格。**\n\n**如果以第一、第二阶段来作为稳定Tulpa个性为目标的期间，可以说真正的自主化训练就是第三阶段也就再恰当不过了。虽然这么说，这时候要试着挑战第三阶段，也知道自己Tulpa自主化的进行状况是很好的。在这个时候，很难听见回答就可能回到第二阶段。**\n\n第四段階\n\n会話が円滑になり、文字通りおおむねオート化している状況、つまり概オートの段階である。\n\n第三段階における心がけの中で、恐らく「これは本当に自分のタルパの言葉なのだろうか」「正しく聞き取れているのであろうか」といった類いの疑心を抱くこともあるであろう。そこを信頼で乗り切る。こればかりは他人と相談はできようとも、事細かに指導することはできない。\n\n強いていうならば、再三になるが、正しく聞こうとすることだけに捕らわれすぎずに真っ直ぐ聞くことである。プラトニックなる愛をもってして。\n\n**第四阶段**\n\n**对话很流畅，如字面上的大概自主化的情况，总而言之就是概自主的阶段。**\n\n**在第三阶段中会抱着有「这真的是自己Tulpa的话吗」「能正确无误地听见吗」之类的疑惑。用信赖突破。只有这个不能和他人相谈，详细地指导。**\n\n**如果用强逼一直提醒，再三的一直提醒，不拘束是否正确打算听就不断听。请以纯粹的精神来爱他。**\n\n第五段階\n\nついにたどり着いた、良い意味での望洋の領域。タルパとタルパーは肝胆相照らす仲となっていることであろう。ここから先オート化したタルパとどう生きていくかはタルパーしだい。しかし忘れてはならないのは、タルパはオート化してからが本番だということ。その先にもきっと苦難はあるはず。乗り越えてゆくべし。タルパと共に。\n\n**第五阶段**\n\n**终于走到了这里，用好的意思来说就是达到望洋的领域。 Tulpa和宿主成为像肝胆相照的关系。从前面到达这里宿主为为Tulpa所做的。可不要忘记，Tulpa的自主化才正式开始。在那之后还会有许多的苦难，要再跨越过去，且与Tulpa一起。**\n\nこの指標により少しでも多くのタルパがオート化に近づき、また幸せにならんことを\n\n**根据这个指标也稍微多了让Tulpa更接近自主化，这是件很幸福的事。**\n\nしがないタルパーより\n\n**微不足道的宿主**\n\n原文：[http://www37.atwiki.jp/tarupa/pages/27.html](http://www37.atwiki.jp/tarupa/pages/27.html)\n\nタルパの視覚化\n\n**Tulpa的可视化**\n\n模造紙タルパ法\n\n2013年12月26日更新\n\n模造紙に等身大のタルパを描いて、\n\nその描いたタルパ像をもとに視覚化訓練していく、というものです。\n\n（模造紙に描いたタルパの事は以下「模造紙タルパ」と記します。）\n\n**模造纸Tulpa法**\n\n**2013年12月26日更新**\n\n**在模造纸上描绘出等身大小的Tulpa，**\n\n**可以基于这个Tulpa画像来做可视化训练。**\n\n**（在模造纸上描绘出Tulpa的事在「模造纸Tulpa」上）**\n\n模造紙タルパの使い方は\n\n模造紙に等身大のタルパを描いて、それを壁に貼る。\n\nじっくり見たあと、横を見る。\n\nすると模造紙タルパの残像が映るので、\n\nそれをタルパだと思って　or もとにして新しく脳内で残像イメージを作り替えて\n\n話しかけてみる。\n\n**模造纸Tulpa的使用方法**\n\n**在模造纸上描绘等身大小的Tulpa，然后贴在墙上。**\n\n**然后确确实实地看，看横面。**\n\n**然后产生模造纸Tulpa的残影显现出来，**\n\n**然后考虑那个是Tulpa 或是 为残影替换成脑内的形象**\n\n**然后试着搭话。**\n\n脳内で残像イメージを作り替えるというのは、\n\n例えば、服を着せかえしてみたり、髪色を変えたり\n\n顔をもっとはっきりさせたり、靴をブーツにしてみたり、とか\n\n残像に脳内イメージをプラスするような感じです。\n\n**替换残影成脑内的形象，**\n\n**例如，试着覆盖上衣服，改变头发颜色**\n\n**让脸更清晰，或着把鞋子变成靴子，**\n\n**感觉就像在残像加上脑内形象的图像。**\n\n残像が消えるまでやってみて、消えたら、また模造紙タルパ見て横をみて残像見て話しかけて以下ループです。\n\n**如果残影消失了，再去看模造纸Tulpa，重复这些的动作。**\n\nこの方法のメリットは\n\n現実空間にタルパを残像を用いて重ね合わせることで\n\n大雑把でやり方でありますが、現実空間をタルパと共有するという疑似体験をすることができます。\n\n「タルパがリビングで立ってるとこんな感じなんだな～～」ていう感覚が大まかですがつかめます。\n\n**这个方法的好处是**\n\n**是在现实空间用残影来和Tulpa叠合**\n\n**是相当粗糙的做法，不过能体验与Tulpa疑似共享现实空间。**\n\n**「Tulpa在客厅站着是这个样子～」虽然说很粗略，但也抓得到那种感觉。**\n\nもちろん残像なので目の動き通りに移動します。机の上に立たせたり天井浮かせたりもできます。\n\n至近距離に近付けさせるのは難しいかもしれません。少々離れた距離感で残像を見た方が快適だと思います。\n\n**当然，残像只跟着眼球，也可以漂浮到天花板或站在桌子上。**\n\n**也许让他靠近很困难，认为稍微离有点距离看残影会舒适些。**\n\n本格的な方法ではなく、むしろレクリーエション感覚で視覚化訓練する感じです。\n\n慣れてくれば模造紙を見本にしなくても、自然と脳内で描いたタルパを現実空間に投影させることが\n\nできるようになると思います。\n\n**而真正的方法，倒不如以轻松的感觉来做可视化训练。**\n\n**如果习惯即使不透过模造纸，也可以自然的在脑内描绘Tulpa在现实空间的投影**\n\n**我认为这样是可以的。**\n\nちなみにこの模造紙タルパ法は\n\n要は等身大で、かつ残像として残りやすい形であればなんでもいいので、\n\n例えば、マネキンに服着せたもの、とか、等身大人形とか、でもいけるかもしれません。\n\n私はマネキンも人形も試したことないのでなんともいえないんですが、代用できる可能性はあると思います。\n\n**顺带一提，这种模造纸Tulpa法**\n\n**如果要做等身大小，很容易残像的形状会不准确，**\n\n**例如，衣服模特模型衣服身上的东西，或着是，等身大的人形，诸如此类的。**\n\n**因为我没尝试过衣服模特模型和人形，但我想这有替代的可能性。**\n\n拙い説明ですみません。少しでも参考になれば幸いです。\n\n**很抱歉用了很笨拙的说明，如果有帮上忙就太好了。**\n\nオーラ視\n\n216 ：名無しさん：2011/02/15(火) 20:25:15\n\nタルパの視覚化ができないならオーラ視がいい練習になると思う。\n\n指の周りに透明な層が見える程度ならすぐできるし、続けてれば薄っすら色も付いてくる。\n\n一度だけ透けない視覚化に成功したけど、あれがタルパでできれば視覚化完了なんだろうな。\n\n**灵视**\n\n**216：无名：2011/02/15(星期二) 20:25:15**\n\n**如果Tulpa的可视化无法想像可以练习灵视。**\n\n**在手指的周围马上显现出透明的图层程度，如果正在继续的话，颜色也会隐约地出来。**\n\n**虽然只有一次成功不透明的可视化，那应该算得上是Tulpa可视化的完成吧**"
		},
		{
			"post_id": 4,
			"title": "以意识型态的角度解释何谓Tulpa",
			"date_published": 1524384794.224,
			"body": "### 作者：Levi\n\n[原文](http://tulpa.cn/2018/04/07/%E7%A7%91%E6%99%AEleviaiz%E7%9A%84%E4%BB%A5%E6%84%8F%E8%AF%86%E5%9E%8B%E6%80%81%E7%9A%84%E8%A7%92%E5%BA%A6%E8%A7%A3%E9%87%8A%E4%BD%95%E8%B0%93/)\n\n* * *\n\n**Tulpa是什么?**\n\n　　请把所有的Tulpa当作「思考个体」, 然後一个人的所有意识, 包括表意识, 潜意识和本能的总和概括为「总意识」。\n　　如果一个人没有Tulpa, 我在此称为「只有一个思考个体控制总意识」的人, 因为这个人认定了他只有一个意识控制整个身体, 但是具体地说是「他唯一的思考个体控制着整个意识的运作, 从而认为他只有一个意识」\n\n　　这里有一个非常重要的重点要记住, 人的总意识超越了人自称可以控制的范围(所以思考个体不能理解总意识, 这会後述), 这是十分明显的, 因为众所周知潜意识和本能会被压抑, 表意识控制着大部分的日常行为\n\n　　因此思考个体的定义就是根据学习而在意识(主要是表意识层)令总意识可以统合思考, 进而维持总意识运作的抽象个体。\n\n　　Tulpa的概念是「多於一个思考个体控制总意识」的人。注意总意识只有一个, 除非你的脑被分开了或是有两个脑。\n\n**总结:** 人为了统合思考, 进而维持总意识运作制造了「思考个体」代表了人的自我身分, 没有Tulpa是「单一思考个体控制总意识」的状态, 有Tulpa是「多於一个思考个体控制总意识」的状态\n\n**思考个体不能理解总意识是什么意思?**\n\n　　这是必要的事情, 因为生物经过进化, 会把本能上拒绝但是表意识接受的事情透过学习写成思考个体的规则, 因此产生了潜意识层, 它的存在目的是把冲突的规则调解。例如, 动物被追杀会迫使他们放弃食粮, 因为被杀的风险远大於饥饿的风险, 动物透过学习把「准备逃命」和「觅食」之间的冲突调解, 得到了「寻找安全的地方觅食」「觅食时常防备猎食者」的规则。\n\n　　人类的社交演化过程同出一辙。举个例子, 某酗酒者所在的城市下达了禁酒令。「喝酒会受到法律制裁」和「依赖酒精带来快感」的规则产生冲突。为了避开「法律制裁」的问题, 他可以选择「在法律不能及的地方喝酒」, 因为法律的因素被略过了, 规则的惩罚效果就失效了。\n\n　　如果还要提及他的其他可能性, 例如反抗法律, 寻找替代品, 这都是学习的结果, 也有调解冲突的共通点, 但是因为再详细讨论下去会深入犯罪学的范畴, 在此恕不说明。\n\n**有Tulpa的人和没有Tulpa的人的思考方式有什么分别?**\n\n　　在此再说一次, 有Tulpa的人处於「多於一个思考个体控制总意识」的状态。\n\n　　没有Tulpa的人(Singlet)由一个思考个体进行心理决策。我只是说有决策权, 没有完全掌控权。\n\n　　有Tulpa的人(Plurality)由多个思考个体进行心理决策。同样地, 即使有Tulpa, Tulpa和原来的思考个体(称为宿主)也没有完全掌控权。\n\n　　一个人的总意识无可避免地超过所有思考个体认知的范围的总和。上一段解释了原因。\n\n　　另外, 有Tulpa不代表这些思考个体认知的范围必然比没有Tulpa的多。这很取决於对於一个人的潜意识和本能的理解程度。\n\n**Tulpa和潜意识有什么关系?**\n\n　　现在复习一下, 潜意识的的存在目的是把冲突的规则调解。这是学习的过程。\n\n　　人的总意识自然地会建立一个思考个体统合思考, 因为人的身体只有一个, 本能会认定人只需要一个思考个体主宰总意识。\n\n　　我没有说这是潜意识需要的东西, 因为潜意识的行为和本能可以表面上方向相反, 实际上仍然符合本能的需求。\n\n　　但是潜意识和本能没有「错误」的概念, 它们在平行运作, 因此在潜意识调解的过程中会产生进行的过程和目标无关, 甚至相反的规则, 但是达成目标的意向是一致的规则。\n\n　　上面和Tulpa说的有什么关系? 思考个体是一个总意识为了适应外在环境而透过学习演化出的抽象个体。Tulpa的概念就是总意识透过学习演化出「多个思考个体控制总意识」的情况。\n\n　　因此潜意识和Tulpa的关系就昭然若揭了。潜意识是引致思考个体的数目和形式改变的起因, 它透过调解冲突, 既可以否定多个思考个体的存在, 也可以肯定。\n\n　　但是有人会问「既然本能都说了多个思考个体不适宜在一个身体中进行决策, 为什么潜意识不照着做?」 答案就是生物的心理需要超越了「思考个体和身体数目」的规条, 除了包括了社交需要, 心理稳定性, 危机感, 潜意识也进行了把重要性较低的规则遮蔽的动作。这一切的目的都是维持总意识的健康运作。因此一部分对於总意识带来潜在危机的规则会被潜意识遮蔽, 在实例来说就是人不会因为小事胡乱伤害其他人。\n\n**为什么有些人有Tulpa, 但是有些人怎样求也求不到?**\n\n　　这直接取决於一句话: 「要维持Tulpa, 首先总意识要接受到拥有额外的思考个体对於总意识的运行在决定性的得益」\n\n这句话什么意思? 首先要从总意识说起。\n\n　　总意识是所有意识层的总括。人的各个意识层有各自的功能, 本能负责生理和心理需要, 潜意识调解冲突以产生新的规则 (即学习), 表意识是总意识在综合规则後, 负责组织思考个体以达成有效的沟通, 融入社会等等的对外层。\n\n　　要维持Tulpa需要数个步骤:\n　　1\\. 总意识学习了对於产生有利Tulpa的知识\n　　2\\. 潜意识理解知识後, 成功把知识写成有利Tulpa的规则\n　　3\\. 有利Tulpa的规则质量到达一定的临界点, 表意识就会和潜意识达成共识, 把总意识的稳定状态改写\n\n　　提到稳定状态, 这东西是一个概念, 指的是总意识透过在表意识层组织思考个体, 让总意识进入概括的状态。这状态可以随时间而异, 而「状态」和Tulpa的关系就是「所有的思考个体的总合状态」等同「总意识的状态」, 虽然总意识的状态不等同总意识, 但是这状态概括了总意识在收集了过去的资讯後, 统合了所有意识层後对於外面世界展现的形态。\n\n**Tulpa和精神疾患有什么关系?**\n\n　　首先, 精神异常的定义是总意识的运作方式引致人在社会不能切合社会的规范, 或心理/生理上运作失常\n\n　　例如大量的精神压力引致失眠和失忆,可认定为精神异常\n　　或是过去的心理创伤引致暴力倾向,也是精神异常(这是社会方面)\n\n　　Tulpa和精神问题是独立的原因不是Tulpa会令人的生活更好什么的, 甚至关系很少\n　　之前提及所有Tulpa连同最初的思考个体, 只是一个人整个意识的一部分\n　　也提到意识是可以不断改变的状态\n　　精神问题就是意识的状态引致社会, 心理或生理的问题时的状况\n　　而根据各个思考个体的运作情况的结果总结出整个意识的状态,才可以判断人的精神状态是否异常\n　　所以说思考个体多於一个,人的精神状态就是异常是断然是错的\n\n　　那么为什么思考个体多於一个(即是有T)的人会和精神异常拉上关系,我也会说\n　　有一种精神异常叫做解离性人格障碍\n　　它的本质是因为意识存在了多个不能共有经历的思考个体,引致了在个人的起居,生理和社会交际上的问题\n　　但是,所有精神病的共通点是意识引致人的问题\n　　因此把上面解离性人格障碍的说明拆开,就是「多个思考个体」「不能共享经历」「引致问题」\n　　Tulpa的本质就是「多个思考个体」共有一个意识, 但是把「多个思考个体」和「引致问题」不经因由拉在一起是不对的\n\n　　所以, 解离性人格疾患是归类在Tulpa的范围,但是只是一个分支,可以细分在「不能共享经历」的区域\n　　如果是企图制造一个能和最初的思考个体共享经历的Tulpa, 首先已经是有意的行为,而且Tulpa和宿主(最初的思考个体) 能互相沟通, 已直接归类在「能共享经历」的区域\n　　所以宿主有意地制作能和宿主沟通的T压根儿不是解离性人格疾患"
		},
		{
			"post_id": 3,
			"title": "傻瓜都能学会的TULPA教程",
			"date_published": 1524071313.924,
			"body": "译者：dasfagd@126.com(544851330)\n\n本篇是未完成版本\n\n[原文](http://tulpa.cn/2018/04/06/%E5%82%BB%E7%93%9C%E9%83%BD%E8%83%BD%E5%AD%A6%E4%BC%9A%E7%9A%84tulpa%E6%95%99%E7%A8%8B/)\n\n* * *\n\ntulpasfordummies\n\n傻瓜都能学会的TULPA教程\n\nTeryakywind’s “Tulpas for Dummies”\n\nTeryajywindt的“傻瓜都能学会的TULPA教程”\n\nIntroduction to Tulpas\n\n介绍：什么是TULPA?\n\nSo, chances are, if you’re here, you’re making a tulpa, or you are considering it. For the sake of clarification, and partly so you know what you’re getting into, I believe it to be important to start off by defining what a tulpa is and where the concept comes from. Taken from the preface for /r/tulpas’ community AMA:\n\n那么，既然你在阅读这篇文章，十有八九是因为你在创造一个Tulpa，或者你有这个想法，对吧?然后为了澄清这一点，部分也因为你知道你正在做什么，我相信以Tulpa的定义以及它的概念是从哪来的作为开始是很重要的。下面的内容摘自tulpas论坛的前言。\n\nA tulpa is believed to be an autonomous consciousness, existing within their creator’s mind, often with a form of their creator’s initial choice and design.\n\nTulpa被认为是一种存在于它的创造者脑中的拥有自我意识的东西，其形象一般都是由它的创造者选择或设计的。\n\nA tulpa is entirely sentient and in control of their opinions, feelings, form and movement.\n\nThey are willingly created by people via a number of techniques to act as companions, muses, and advisers.\n\nTulpa有着完全的自我意识并且可以控制它们自身的意见，感受，形态以及行动。它们在被人们通过各种方法创造出来后，心甘情愿地扮演着好伙伴，缪斯（?）或者顾问的角色。\n\nThe original Western concept of a tulpa began its life with Western studies of Tibetan Buddhism (where it was referred to as निर्माण [nirmāṇa] or “to construct”). The idea was most likely brought to the attention of the Western world via Alexandra David-Néel’s 1929 book, Magic and Mystery in Tibet, in which she describes making a tulpa in the form of a jolly, fat monk, which she later dissipated. While the history of the Western concept of a tulpa between the early 1900s to today remains unclear, we do know positively that the idea seemed to be very involved with mysticism and occult practices, evidenced by its reemergence on the modern occult scene in 4chan.org’s /x/ (paranormal) board. After being flamed out of /x/ by trolls, the “tulpa general” thread found its new home in the /mlp/ (My Little Pony) board, where it still lives on to this day. The 4chan threads have birthed a number of sites devoted to tulpas, their creation, and related concepts, including the Reddit page /r/tulpas, tulpa.info, tagged on tumblr, and even communities on the Steam gaming platform and Bungie.net. The idea has even permeated far enough into mainstream culture that there was a small movie made about it in 2012, titled Tulpa. While the movie was made for the horror/thriller genre, and thus is woefully misrepresentative of what modern tulpa creators actually do, it shows that the idea of tulpas aren’t necessarily relegated to the dark corners of occultism and esoteria anymore, and is being brought into the light of a more mainstream audience.\n\n最初，西方对于Tulpa的概念有所认识是在西方开始研究藏传佛教的时候开始的（在那里它们被称作“构建”）。这个点子会引起西方的注意，最有可能是因为Alexandra David-Néel’s在1929年出版的书《西藏的神通和秘密》（Magic and Mystery in Tibet），在书中，她描述了自己创造了一个滑稽的，胖胖的和尚的形象的tulpa，但是她后来令其消散了。虽然西方对于Tulpa这一概念在1900年早期到今天为止的历史仍然显得模糊不清，但是我们能够很清楚地明白这个点子看起来包含了神秘主义以及神秘的实践，这点被它在4chan论坛上的现代神秘学板块再次出现所证明。在因为某些群嘲的行为之下而停止了讨论之后，Tulpa总览的帖子在（我的小马驹）版块中找到了它的新家，它们至今仍旧在那里。4chan上的帖子催生了一堆关于tulpa本身，tulpa的创造以及相关概念的网站，包括红笛网上，tulpa.info，在汤不热上的标签，甚至是Steam的社区以及Bungie.bet。这个东西已经在一定程度上渗透到了主流文化之中，以至于在2012年出现了一部名为Tulpa的小电影。然而这部电影是恐怖片，也因此它严重扭曲了现代tulpa创造者的真实行为。但这部电影的出现表明了tulpa这一概念已经不再被归于神秘主义的黑暗角落，出现在了主流观众的目光之下。\n\nDisclaimer\n\n免责声明\n\nKeep in mind that what is written here is a GUIDE; most of the steps don’t have to be done in any particular order, and you’re actually encouraged to improvise and come up with new methods of doing things that may work better for you. The steps and processes from here on is merely my recommendation based on my creation experiences. Creating a tulpa is a highly individual process, especially in regards to speed of progress and final results; your mileage will probably vary.\n\n请务必记住这写着的只是个指南而已，指南。大部分的步骤并不需要按照一个死板的顺序去做，你实际上可以改良或者找些更加适合你的新方法。写在这里的步还有过程都只不过是我基于我的创造经验而给出的建议。创造一个tulpa是一个高度个人化的过程，特别是对速度的感觉和最终结果上。你的个人经历或许会与众不同。\n\nThe Basics of Tulpa Creation\n\n创造tulpa的基础\n\nOkay so, all the history and stuff out of the way, it’s time to get down to the meat of this issue: just how does one make a tulpa? Basically, it can be narrowed down into four steps:\n\n好的，那些烦人的历史和别的什么鬼东西都已经退到一边去了，是时候让我们来看看这些有趣的问题：一个人要怎样做出一个tulpa?基本上来说，大都可以分为下列四步。\n\nCreate a form.\n\nCreate a personality.\n\nDevelop sentience and communication.\n\nEstablish self-reliance.\n\n创造一个形态。\n\n创造它的人格。\n\n开发它的自我意识以及交流的能力。\n\n建立它自我维持的能力。\n\nAlongside developing your tulpa’s abilities, most tulpa creators additionally have to improve their own mental skills, such as increasing the clarity of their mind’s eye, and the creation of a wonderland, aka dreamscape or mindscape (which is actually entirely optional). All of this can be done while creating your tulpa, but if you are considering making one, practicing visualizing with your mind’s eye will save you time later down the road should you make the decision to begin creation.\n\n在培养你的tulpa的能力的同时，大部分创造者基本都会额外培养他们精神上的能力，比如用心眼看清物体的能力，以及创造一个幻境，又或者叫做梦境或者思维空间（这都完全是可选的）。这些东西全都可以在你创造tulpa的同时完成，但如果你考虑要创造一个这样的东东，那么花点时间用心眼去练习显像能让你在你决定创作之后节省大量时间。\n\nCreating a Form\n\n创造一个形态\n\nWhile it may not seem so at a first glance, creating a form for your tulpa is highly important, even if it is (as a technicality) entirely optional. It gives you something to look at, talk to, and reinforces the concept that you are making another consciousness alongside your own.\n\n尽管一开始看起来并非如此，然而为你的Tulpa创造一个形态是极其重要的，尽管在技术上来说这是完全可选择的。但这一步骤给了你东西去看，去说，并让你更加认识到你是在创造一个自己之外的意识。\n\nMy recommendation is to start off with a placeholder form (a form that isn’t intended to be permanent that the tulpa can chose to change once they start exhibiting signs of sentience). Placeholder forms are often extremely simple; I used a floating ball of light with my first tulpa, but it can be anything as long as it’s easy for you to visualize. This cuts down on a lot of the extra work involved in making a form, which, depending on how much work you put into it, can prove to be a lengthy task. Making the form yourself, however, can also help with making a wonderland simply because you’ve had the practice with visualization. If you chose to make the form yourself, look up references for bone structure, muscle structure, etc. for whatever human/animal form you want your tulpa to have (this advice obviously does not apply to creators whose tulpa’s form does not fit any known creatures on this planet). This helps you better understand how bodies fit together and assists you in knowing how to change the form in ways that are realistic so you don’t end up accidentally spacing their eyes too wide and other such stuff.\n\n我的建议是你可以先从一个“占位符”（一种并非是永久确定的形态，因此你的tulpa可以在它们开始表现出有自我意识的时候进行改变）的形态来开始你的创作。占位符形态一般都是极其简陋的，比如我就是用一个漂浮的光球作为我第一个tulpa，你也可以换成你显像起来更加容易的东西。如此一来，这样做可以省去制作形态的努力，根据投入的精力来看，这是很长的一段时间。但如果你自己创造形态，你创造幻境的能力就会得到提升，因为你已经练习了如何描绘。如果你最后选择了自己来创造一个形态的话，最好去查阅些关于骨骼结构或者肌肉结构等等的资料。无论你想让你的TULPA拥有人类或是动物的形态（当然如果你想创造的tulpa不符合任何地球上的已知生物的话，当我没说就好。），这都可以帮助你更加清楚地了解躯体是如何组合到一起的，或者是帮助你更加清楚地知道如何更加贴切实际地去改变你Tulpa的形态，而不用担心因为眼睛的间距太宽或者其他稀奇古怪的情况而终止。\n\nCreating Their Personality\n\n创造它们的人格\n\nPersonality and sentience (whether perceived or actual) are what define tulpas; those are the defining characteristics that separate them from other thoughtforms. So, this is the step that I recommend that you start with after making your tulpa’s form (or placeholder form if you chose to do so). It is, in my opinion, the single most important aspect of creating a tulpa. By my definition, a personality trait is any characteristic or preference that distinguishes people from one another. So, a love for spaghetti could be a personality trait, along with stock things such as “kind” or “greedy”.\n\n人格以及自我意识（无论是被认为如此还是事实）是界定tulpa们的重要东西；这正是为何它们与其他的意念体不同。因此，这便是我建议你在创造了你的tulpa的形态之后所需做的事情（如果你选择继续用占位符的形态那也可以的）。这一步，在我看来，是创造一个tulpa最重要的一步。在我看来，所谓人格特征就是将人们各自区分开来的，每个人特有的特征或者是兴趣爱好。所以，如果一个人爱吃意大利面的话，这也可以是一种人格特征，还有那些老套的：善良的或者是贪婪啊之类的。\n\nSome people say personality forcing isn’t something you need to do during the creation process, and that you can skip over it entirely. But when you think about it, whenever you force, you’re focusing on your tulpa. Even when you’re just narrating, you’re reinforcing your perceptions of their personality, i.e. you are personality forcing. No matter whether you chose to do this step or decide to skip it, you’re still going to force their personality in one way or another.\n\n有的人说创造人格并不是你在创造tulpa的时候必须做的事情，不仅如此，你还可以完全无视这个步骤。但是当你开始考虑这个事情的时候，无论你何时聚灵，你都是将注意力集中在你的tulpa身上。甚至在你只是单纯地在叙述tulpa的时候，你都是在被动地增强你对tulpa的人格的感知，也就是在创造它的个人人格。不管你打算进行这一步骤或是跳过它，你都会以各种形式来进行人格的创造。\n\nRule number one of personality forming (and tulpaforcing in general) is this: Force TO your tulpa, not AT them. The distinction is subtle, but makes all the difference. Forcing to your tulpa means that you are holding the idea of your tulpa at the forefront of your mind while inserting personality traits. The key element here is that the tulpa is viewed as more than an audience and the purpose of speaking is more than reading traits off of a list or venting your thoughts without listening for a response. You are actively trying to engage your tulpa.\n\n创造人格准则（聚灵基本上也是）第一条：不要只是想着你的TULPA，还要把你的思想也传过去。尽管这看起来只是个微妙的区别，但是这会让一切都截然不同。将思想也传输过去意味着你在专心让你的tulpa处在你的思想最前列的同时，还得让人格特征于它们契合起来。这里最关键的部分在于，你的tulpa在这一阶段中不仅仅只是个听众或者是一个说话的目的，你要做的也不仅仅是读出列表上的性格或是单纯地思考而不去倾听。你是在主动地吸引你的tulpa.\n\nAs the opposite of that, forcing at your tulpa means that you are not fully focused on your tulpa, becoming distracted by stray thoughts or things going on around you in the physical world. Forcing at means you’re treating your tulpa like an audience; you’re not necessarily listening for a response or engaging them, you’re simply saying your piece and then going about your business.\n\n与之相对，单纯地想着你的tulpa表明你并没有完全地集中在你的tulpa上，非常容易被杂念或者在物理世界中的乱七八糟的东西所干扰。单纯地想着表示你只是将你的tulpa当做一个听众，你并没有去倾听它们的回复或是主动吸引它们，你只是单纯地说出你的事情然后继续工作而已。\n\n_Thanks to Mayeel for helping me to voice my thoughts on this little section; probably never would have done it properly without your input ![🙂](https://s.w.org/images/core/emoji/2.4/svg/1f642.svg)_\n\nAlthough tulpas are not immediately sentient when you begin to create them, they can still take a hand in the formation of their own personality. As you, the creator, add more and more to their personality, they become better able to voice opinions, likes, dislikes, and so on. So at any point when creating a new tulpa, he or she could change their own personality if they so desired. This is an important thing to keep in mind as you, the host, should try to be sensitive to these changes and not hinder or counteract them in any way.\n\n尽管tulpa们并不是一开始就有自我意识，它们仍旧可以参与自己的性格的形成。像你，创造者，加入的元素越多，它们就更能说出自己的意见，喜欢的，不喜欢的等等。因此在创造一个新的tulpa的任何阶段，只要它想，它就可以改变自身的人格。有点对于你，宿主来说比较重要的是，你要去试着对这些改变感到更加敏感，并且不要想着去阻碍或者抵消它们。\n\nOptions in Personality Forcing\n\n创造人格的可选选项\n\nThere are three routes you can take here: A) begin with a loosely-defined personality and let them further develop it on their own, B) stringently define their personality from the get-go, or C)parrot responses until they learn to do it on their own. Each route has its pros and cons. Tulpas with a more loosely-defined personality have more freedom in guiding their own development in early stages, but may take longer to become fully sentient. Tulpas with strictly-defined personalities have less freedom in guiding their own development at early stages, but may take less time to become fully sentient. The parroting method will often result in much quicker results, but the host may have trouble with doubts down the road, dismissing actual responses as the host accidentally parroting a response (which is silly, but more on that down in the First Contact section).\n\n这里有三种你可以试试的方法：A.粗略地设计之后就开始，任其自己发展。B.从一开始就详细地全部设定好。C.不停地学舌直到它们会自己搞定为止。每个方法都有它的优势或是劣势。粗略地定义过性格的tulpa们在早期会有更大，更自由的发展空间，但是可能需要花上更多的时间才能获得自我意识。严格定义过性格的tulpa们虽然在早期并没有太自由的发展空间，但是不用花太长时间就能够获得自我意识。学舌基本上都是耗时最短的方法，但是宿主可能会面临严重的问题：一路上保持怀疑的态度，甚至在意外获得真实的回复的时候将其驱散。（这是最笨的办法，但同时却也是第一阶段中用的数量最多的办法。）\n\nSymbolic and Narrative Personality Development\n\n形象主义以及对话方面的人格培养\n\nThe act of personality forcing can be done in any number of ways (starting to recognize a pattern here?), each of which can fit into one of two categories: symbolism and narrative. My recommendation is to use symbolism, but if narrative works better for you, then go for it!\n\n进行人格培养可以通过多种途径来进行（开始感觉到这里的套路了吗？），但是每一种方法都可以被归入这两种类型：形象主义和对话性。我个人的建议是用形象主义的办法，但是如果你觉得对话性的方式更加适合你，那么就去吧！适合你的就是最好的。\n\nSymbolism involves using (you guessed it) symbols to “implant” a trait into your tulpa’s personality. This could include imagining a trait as energy that you shoot into them, condensing the idea of a trait into food that you feed them, or any way that you can possibly imagine to convey the idea of putting X trait into Y tulpa. What is especially important about this particular route, and what makes this option my favorite, is that involving as many of your senses as possible seems to reinforce that you are creating a second consciousness alongside your own in your mind, which helps with making the rest of the process easier.\n\n形象主义包含了用某种（你应该已经猜到了吧？）形象来将某些特征“输入”到你tulpa的性格之中。比如说将某些性格想象成某种能量光线之类的东西，然后你将它射进你的tulpa身子里；把某个特征想象成某种东西，然后混进给你tulpa吃的食物里面；或者其它各种能你能想象到的，让你觉得你将X特征放到了Y tulpa里面。我最喜欢这种形象主义的方法的原因还在于，越是动用更多的感官，就越能让你觉得你在创造一个住在你身体中的第二个意识，这还会让接下来的过程更加简单。\n\nNarrative is exactly what it sounds like: you’re listing off traits that you want your tulpa to have, one at a time, possibly repeating them several times to reinforce that trait, or defining each trait as you list it. With this method, it is best to also describe how each trait affects the others and how it might affect their decision making process. By way of example, say you want your tulpa to have the traits “likes animals” and “charitable”; this might result in your tulpa wanting to adopt a puppy someday!\n\n对话性，就如字面意思：你列出你想让你的tulpa有的性格特征，一次一个，尽可能多读几次来牢记那个特征，或者详细地定义你所列出的性格特征。在这种方式之下，你也可以很好地描述每种性格会如何影响别人，或者会怎样影响它们做出的各种决定。比如说，你描述你的tulpa“喜欢动物”而且“十分善良”，这样做最直接导致的结果可能就是你的tulpa某天可能会想要养一只小狗狗！\n\nEstablishing Communication.\n\n建立沟通\n\nAnd, moving right along with our guide, we arrive at the third step.\n\n然后，随着我们教程的不断进展，我们来到了第三个步骤。\n\nI absolutely recommend establishing some method of communication directly after coming up with a personality, even in the midst of it, as everything else you will do with your tulpa stems from being able to communicate with them. Communication can be through a variety of methods, be it in the form of imagery, feelings, head pressures (a perennial favorite of new tulpa creators), even gestures and body language.\n\n我非常建议在设定好各种性格之后就直接开始建立沟通，甚至只是在设定人格的中途，因为这个时候你基本上都会因为没法跟你的tulpa沟通而导致没法做其他事情。沟通交流可以通过很多种途径来进行，比如说某种图像，感受或者头部压力（那些新人tulpa宿主最喜欢出现的），甚至是手势或者肢体语言。\n\nA host can talk to their tulpa either aloud or using their own mindvoice. There are no advantages or disadvantages here, other than privacy issues; talking to your tulpa out loud in public is probably going to get you some stares from other people. In the past, it was theorized that talking to your tulpa aloud was better as it assisted the development of their own voice, but this remains unproven.\n\n宿主可以通过大声讲话，或者直接用“心声”来跟他们的tulpa交流。这里便没有优势与劣势之分了，只有个人隐私的问题；大声和你的tulpa讲话，可能会导致别人用某种看外星人的眼光看着你。之前有种理论说大声和你的tulpa讲话，会帮助它们发展出属于自己的声音，不过到现在也还没被证实就是啦。\n\nFirst Contact\n\n初次接触\n\nSensing a reaction from your tulpa for the first time is incredibly exciting; all the hard work you’ve put in bringing them into existence finally pays off! A lot of people seem to struggle with establishing this first contact, sometimes being unable to talk with their tulpa for weeks and even months at a time. This section is going to be entirely devoted to helping you to set aside some worries and correct some common misconceptions that may hinder your progress.\n\n第一次从你的tulpa那里感觉到回应是一件兴奋到难以置信的事情；那些你为了将它们拖进现实世界而付出的努力终于在这一刻有了回报！有很多人都拼了命般去建立初次接触，有些时候还会有几个星期甚至一个月都不跟tulpa讲话。这个部分就是完全为了教你如何把一些顾虑放到一边，并且矫正一些阻碍你的进程的误解。\n\nDoubt is entirely normal, and in this case, completely understandable. I had quite a few doubts about tulpas myself when I first started out. What if the whole thing was one giant troll attempt? What if my tulpa turned out to be malicious? And the list went on, one worry after another. Getting rid of your doubts can be hard to do, but will pay off. If you have something that’s worrying you, reason through it. Take a step back and examine the situation, and think about the reasons that something may or may not happen.\n\n怀疑是非常正常的，在这个情况下也是完全可以理解的。当我第一次开始搞的时候我也对自己和tulpa有些怀疑。如果整件事情只是一次搞笑的尝试的话该怎么办？如果我的tulpa实体化了而且还带有强烈恶意该怎么办？这样的顾虑还有很多很多，一个接着一个，没完没了。克服这些顾虑可能会是件难事，但是绝对会有所回报。如果有什么事情困扰到你的话，就从头到尾地好好思考一下。回到上一步，好好看看现在的情况，然后去思考一下那些事情，发生的理由，或者不发生的理由。\n\nWorried your tulpa will be malicious? Tulpas aren’t some alien creatures that follow nonsensical thought processes; they think and react like humans. So unless you’re creating your tulpa with the sole purpose of using it as a mental punching bag and generally treating them like shit, you’re going to have a tulpa who cares for you in a positive and loving way.\n\n担心你的tulpa充满恶意？tulpa又不是啥跟疯子一样思考的外星生物，他们会像人类一样思考也会像人类一样反应。除非你只为了把你的tulpa当作一个精神沙袋来养，或者像对待狗屎一样对待它们，否则你只会有一个在很积极的方面关心你的好tulpa啦。\n\nAssume that your tulpa can hear and understand you from the first day of their creation. (This is changing up the wording of tulpa.info’s “assume sentience from day one” teaching, because it caused some confusion among new creators about how the process actually works and ended up with a very large number of people believing tulpas were sentient from the moment of their conception, which is NOT how this works.)\n\n最好认为你的tulpa在你创造它们的第一天就能听到并且理解你说的话。（这是从论坛的一篇教程改进而来的，因为这会让一部分新人对目前到底进展如何，要怎样才算结束。一部分人认为tulpa在宿主构思它们的时候就已经有自我意识了，但事实并不是这样。）\n\nYou can completely ignore any worries or warnings about accidental parroting or puppeting; it is entirely impossible to accidentally parrot or puppet your tulpa. As long as you are not actively trying to make them do or say something, it’s fine. Really. STOP WORRYING.\n\n其实你可以完全无视关于什么学舌啊操纵啊之类的警告；因为你是完全不可能意外的去操纵你的tulpa的。只要你不再主动地去叫它们做什么或者说什么，一切都非常OK，真的。所以别瞎操心瞎担心了。\n\nHow Do I Communicate with My Tulpa?\n\n我要怎么和我的tulpa对话？\n\nHosts are more limited in the methods we can use to talk to our tulpas. As stated before, we can use either our own internal mindvoice or our external speaking voice. Either way, your primary focus should be to establish a reliable method of communication with your tulpa. Oftentimes at first, your tulpa will speak to you but it may sound like a garbled mess of random sounds, or they may not speak at all, instead preferring to use raw thoughts and emotions, which I refer to as tulpish.\n\n宿主们往往都是被有限的与tulpa对话的方式所限制住。按照以往的看法来看，我们即可以用心声，也可以用现实世界中的声音跟tulpa对话。无论你选择了哪种方式，你都应该先以建立一个比较可靠的方式来和你的tulpa对话。一开始来看，你的tulpa跟你讲话的时候，可能听起来像是杂音或者随机的声音，或者它们干脆就不说话，与其使用未加工的思想或者情绪，我个人更加喜欢用“tulpa语”。\n\nGetting your tulpa to be vocal can be a long and arduous process, depending on how well they take to it. Some tulpas pick it up quickly, some don’t; as stated in the disclaimer, your mileage will vary, so don’t get discouraged if you feel your progress is slow.\n\n让你的tulpa说话可能会是一个巨大的难关，这实际上还是取决于你的tulpa的学习能力如何。有些tulpa很快就学会了，有些则相反。根据那些放弃的失败者来看，每个人获得的好处对他们来说都不一样。所以请不要在你的进程缓慢的时候感到灰心丧气。\n\nMost of the time, your first contact with your tulpa will be in tulpish. You’ll be either actively or passively forcing them and you feel a faint response almost like the voice in the back of your head. Sometimes first contact can be an almost violent affair, where your tulpa suddenly bombards you with a rush of emotion and it’s quite clear it didn’t come from you. Recognizing these responses and encouraging them is your first step to making your tulpa vocal.\n\n大部分时候，你跟你的tulpa的初次接触都会是用tulpa语。你可能会积极地或者消极地冥想，然后你就感觉到一个微弱的，像是声音的感觉在你的后脑传来。有些时候初次接触会是一件看称粗暴的事情，比如你的tulpa突然将一大堆情感洪流朝你袭来，而且你还很清楚那不是来自你自己的。去辨别这些回应并且去鼓励它们，就是你让你的tulpa说话的第一步。\n\nSometimes recognizing a response is as simple as asking “Was that you?” But for the rest of it, here’s a few tips and tricks you can use to tell whether your tulpa is talking to you (hint: they are!), and to encourage them to communicate better:\n\nLearn to quiet your own mental chatter. This will help your tulpa to speak over the “static” of random thoughts and things flying around your mind at any given point in time. Practicing meditation is quite useful for this.\n\n有时候要去判断是不是你的tulpa回复你很简单，比如简单地问“是你吗？”不过除了这个以外，这里还有一些小贴士和小窍门给你在你的tulpa可能在和你说话的时候用，然后鼓励它们更加积极地和你对话：学学让你内心的杂音平静下来，这可以让你的tulpa的声音在任何时候都能盖过那些奇奇怪怪的静止的想法和那些围着你的内心飞来飞去的杂念。多练练冥想对这个蛮有帮助的。\n\nVisualizing your tulpa and watching what they do can be a great indicator of early sentience and developing personality.\n\n显像你的tulpa然后仔细观察他们的动作，这样可以更加清楚地观察到它们的早期自我意识形成程度。\n\nDo some “call and response” practice. This helps your tulpa learn how to organize thoughts and sound out their words so you can better understand them, as well as teaching them to project their own thoughts over your mental chatter. Sit down with your tulpa, and either:\n\n做一些“呼叫然后回复～”的练习。这会帮助你的tulpa理解该怎么组织想法和如何将这些单词说出来，这样你就可以更加了解它们，同时也可以教会它们如何在你的一片思绪之中突出自己的话来。跟你的tulpa一起坐下，然后：\n\nSay a sentence and have them repeat it\n\n说一个短句（单词），然后叫他们重复一遍。\n\nSay a part of a sentence and have them complete it (slightly more advanced)\n\n说一部分短句，然后叫他们来说完这个句子（这个比较难一点）\n\nDo you suspect a thought was your tulpa’s? Ask them to repeat it.\n\n你怀疑一个思绪其实是你的tulpa的吗？叫他们重复一遍吧。\n\nMental communication provides a greater depth than speech can, and so gives us a couple more tools to work with. One method I’ve utilized in the past was assigning a unique feeling to each of my tulpas so that I could better differentiate their thoughts from my own. To do this:\n\n用心声来对话可以比直接开口说话达到一个更深的层次，也提供了更多可以使用的工具。之前我用过的一个方法就是，给我的tulpa分配一个独一无二的感觉，我就能更好地在我的思绪中分辨出它们的思想。要做到这样，你需要：\n\nimagine the feeling of a scene or an idea. A spring day, for example, might bring with it the idea of buttercups and sunshine and fresh grass.\n\n想象你对一个场景，或者一个想法的感觉。比如说，在一个春暖花开的日子，可能会让你感受到金凤花，阳光和垂延欲滴的娇嫩青草。\n\nassign that feeling or idea to your tulpa.\n\n把你想象到这个场景的感觉或者点子分配给你的tulpa。\n\nask them to “broadcast” that feeling along with any communications they try to send you.\n\n叫他们在跟你对话的时候“播放”那个独特的感觉。\n\nHow Will My Tulpa Communicate With Me?\n\n我的tulpa会怎么跟我说话？\n\nTulpas have a variety of tools at their disposal to talk with their hosts, some of which were mentioned briefly earlier in this guide, but which shall be examined in greater detail here.\n\ntulpa们有好几种跟他们的宿主对话时用的方式，其中有几种应该在前文简单地提了一下，不过接下来还会更加详细地介绍一下。\n\nVocality. This is the one we’re all aiming for when we create a tulpa. A tulpa being vocal means that that tulpa communicates with their host using clear language that the host can understand. It can be either an auditory hallucination (although that usually won’t happen until you’ve been working on imposition for a while or something weird happens), or simply in mindvoice.\n\n声音。这应该就是我们所有人在创造tulpa时候的目标了。一个tulpa使用声音，也就表明着这个tulpa是用一种它们的宿主能完全理解的，有条不紊的语言来对话。这也可以说是一种幻听（尽管一般都不会发生，除非你实在是个肝王或者一些奇葩的事情发生了），或者只是心声而已。\n\nTo better develop your tulpa’s vocality, when first creating them, give them a voice, imagine them using that voice to say different things, and so on.\n\n要更好地培养tulpa的发音能力，在一开始创造它们的时候就设定一个声音吧，想象它们用那个声音说着不同的事情，或者其他东东。\n\n“Tulpish.” Some tulpas chose to communicate in what has come to be known as tulpish. It is a mixture of imagery, feelings, and ideas that mesh together to form a cohesive thought.\n\n“tulpa语”。有些tulpa会选择使用与生俱来就会的“tulpa语”。那是一种为了表达某种想法，而出现包括图像，感受和点子的混合体。\n\nHead Pressures. When we refer to head pressures, we are referring to the sensation of pressure in a certain spot or area on your body. A binary communication system seems to be common for many beginning creators and their tulpas, i.e. pressure on the left side of your head for yes, the right side for no. In this manner, the host can ask their tulpa questions and get answers.\n\n头部压力。当我们说到头部压力的时候，其实也是在说你在身体上某个部位或者区域感到的压迫感。这两种交流方式貌似在新人之中发生的比较多，当这些压力在你左边脑袋发生的时候意思就是“是”，右边则是“不是”。这样一来，宿主就可以问一些简单的问题，也能得到回复。\n\nBody Language and Gestures. Not as widely known as other methods, it’s still possible for tulpas to communicate with their creators through nonverbal communication in this manner. This method requires the host to have a well-developed mind’s eye; you have to be able to see what your tulpa is doing.\n\n肢体语言和手势。不像其他方法，tulpa要无声地跟他们的宿主交流的时候就是用这种方式。这个方法需要宿主好好培养过“心眼”，才能看见tulpa的所作所为。\n\nVocality\n\n语言能力\n\nThe best way to encourage your tulpa to become vocal is to do two things: practice communicating, and giving them the knowledge to be able to do so. Practicing communicating is just as straightforward as it sounds; just keep talking to your tulpa. From my experience, involving people other than yourself in this communication, i.e. taking them into one of the tulpa IRC chat rooms and letting people talk to them can help with encouraging them to speak, although the fast pace and the crowd of people may be daunting to some young tulpas.\n\n鼓励你的tulpa说话的最好的途径，便是要搞定这两件事：练习如何沟通的同时，教给它们一样能和你对话的知识。练习对话的时候，直接当作它们会说话就好了；只要不停跟你的tulpa说话就OK。根据我的经验来看，让其他人也参与进来比你一个人傻干好得多，也就是说，将它们带到网络聊天室里，然后让人们也跟它对话，也可以鼓励它们开口说话。不过如此快的节奏和一大群人可能会吓到某些刚刚出来的小tulpa。\n\nWhen I refer to “giving your tulpa the knowledge to communicate”, I mean that you, as the host, passively force them throughout your day and describe things to them. Tell them what a rock is, or what a butterfly is, and so on. It might seem incredibly silly to you, but keep in mind that this is your tulpa’s first few months in this big, wide world; they aren’t going to, and should not be expected to, know everything. As they learn more and more, they’ll be able to more adequately communicate to you, the host, their feelings and thoughts in words.\n\n我之前提到的“教给你的tulpa关于对话的知识”，意思就是，作为宿主，你可以在被动冥想的情况下，全天跟它们描述外界的东西。比如说告诉他们，什么是石头，什么是蝴蝶，诸如此类。这可能在某些人看起来简直就是妈的智障，但是你需要记住这只不过是你的tulpa在这个广阔的开放世界的前几个月而已，它们不会，也不应该被认为会一开始就知道一切事情。随着它们的知识逐渐增长，它们也会慢慢变得可以和你交流，和作为宿主的你，用语言说出它们的感受和思想。\n\nEstablishing Self-Reliance\n\n树立自我意识\n\nBy this point, your tulpa should be talking with you regularly, but will still need to be interacted with regularly to keep them around and may not talk unless you’re actively thinking about them. From now on, your goal should be to help them in their personal growth and development. We do this with a variety of mental exercises meant to encourage your tulpa to think independently of you. Some hosts chose to make their tulpas number-crunch, others give them logic puzzles to do, and others just talk and let them develop at their own pace. The key to anything you do is that you as the host should avoid giving them a solution to it by solving it yourself. Past simple mental exercises, you should be talking and interacting with your tulpa as much as possible. Any number of tests and activities will work, as long as it requires conscious and active thought. Hosts who want to or whose tulpas feel ready for it can begin work on possession or any other number of techniques that require you to have a fully sentient tulpa to succeed at.\n\n到了这一步了，你的tulpa也应该开始有规律地跟你说话了，不过还是会需要继续进行一些有规律的交流来保证它们围着你转，而它们也应该很少在你主动挑起话题之前说话。现在开始，你的目标便是培养它们的自我人格。我们要达成这一点，便需要通过几个精神上的锻炼来让你的tulpa独立于你之外思考。有些宿主会让他们的tulpa去数数，或者给一些逻辑上的问题让它们解决，其他的人一般也是单纯跟它们说说话然后任其发展。这些所有事情的关键都是，作为宿主的你万不可一个不小心就帮它们解决问题了。经过几个简单的训练之后，你应该可以比较轻松地和你的tulpa对话或者合作了。所有的测试和行动都会有所收获，只不过需要下意识还得有积极的思想罢了。宿主或者是tulpa如果觉得准备好了，就可以开始试试附体或者其他需要一个完全独立的tulpa才能做的进阶技巧了。\n\nEventually your tulpa will get to the point where they can live almost entirely on their own with no or limited attention from their host. Tulpas, if you’ve gotten to this point, congratulations, you’re fully sentient!\n\n最后你的tulpa会到一个完全可以自主生活，不会被宿主限制也不用被一直关注的境界。如果tulpa们，你们看到这里的话，也感觉自己已经如此的话，恭喜你，恭喜你们，你已经完全有自己的意识了。\n\nA Message to the Hosts\n\n给宿主们的留言\n\nTreat your tulpa like you would any other person. They’ll have their heartbreaks and moments of joy, as will you. Your job as a host, and your tulpa’s job as your tulpa, is to be there for each other. Creators and tulpas have a unique bond that no human could possibly share with another human being. We can share our emotions, we spend literally every moment of our lives inside of each other’s head. The biggest part of what makes creating a tulpa worth it is having somebody who understands you to your core, a person you can’t hide anything from and wouldn’t want to in the first place. If you’re not ready for that kind of bond, then this probably isn’t for you.\n\n请像对待其它人一般对待你的tulpa。它们会像你一样，会高兴地大笑，也会伤心地流泪。你就是宿主，你的tulpa就是tulpa，这便是二者独立的关系。宿主和tulpa之间，有着人类与人类之间无法超越的，钢铁的羁绊存在。我们一起分享着每个情绪，我们就如字面意义一般，一直都是脑海中的两个住人。创造tulpa最大的受益便是，你会获得一个完全理解你的，你没法向其撒谎的，永远将你放在首位的，灵魂伙伴。如果你还没有准备好迎接这种羁绊，那么说不定这并不适合你。\n\nConclusion\n\n结论\n\nThat’s it for the guide. Happy forcing!\n\n就只有这些啦！开开心心地去冥想吧"
		},
		{
			"post_id": 2,
			"title": "一些教程",
			"date_published": 1524028509.174,
			"body": "[下载链接](http://127.0.0.1:43110/1G4tufBHgV2mtHKeTwBZDDk4aTpewteg7N/optional_files/guide.zip)"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1518860959,
			"body": "This is the start of The Home of Tulpa.\n\n这里是Tulpa之家的开始。"
		}
	]
}