{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "Zeroblog needs a lot more work than just adding a dark theme. It needs some kind of admin panel or dashboard like wordpress has so people can add headers or add an image for the background without needing to get into any files like the css to code them in. Give us non-coders an admin panel please.",
			"post_id": 140,
			"date_added": 1540049547
		},
		{
			"comment_id": 2,
			"body": "> [pubg](#comment_4_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR): you can succeced if you work for it. you can, young man.\n\nWhat's that supposed to mean?",
			"post_id": 140,
			"date_added": 1540050065
		},
		{
			"comment_id": 3,
			"body": "> [pubg](#comment_5_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR): means you can develop that function, then give a pull request in github.\n\nI can't develop shit. I'm not a coder, I fucking hate coding.",
			"post_id": 140,
			"date_added": 1540051290
		},
		{
			"comment_id": 4,
			"body": "> [daniell](#comment_5_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): But do you like programmation?You could use Construct 2 game engine. It uses visual event sheets\n\nNo I don't like programming and Construct is used to make games. I don't want to create a game. All I want to do is create a site like this https://imgur.com/a/MjMMJ4W without having to get into the CSS or html to code anything. The Zeroblog needs something like Wordpress's dashboard but I don't think Zeroblog will ever get anything like that.",
			"post_id": 140,
			"date_added": 1540053341
		},
		{
			"comment_id": 5,
			"body": "I'd rather use a photo for the Zeroblog background instead of a dark theme. Can't you add another button next to the light and dark ones that gives you the option to upload a photo.",
			"post_id": 140,
			"date_added": 1541950989
		},
		{
			"comment_id": 6,
			"body": "I knew this project would die. Last update was in 2019 and no one has heard from Nofish.",
			"post_id": 152,
			"date_added": 1624652614
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"140": 1
	}
}