{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "L'album 100% de Angèle de 2020 en MP3",
			"body": "http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc/100%20Angele%20-%20French%20singer%20-%20MP3.zip\nCa se passe sur ZeroUp pour plus d'informations ;)",
			"added": 1591210000
		},
		{
			"topic_id": 2,
			"title": "\"Alternative\" à Youtube sur Android",
			"body": "Marre de Youtube?? Vous ne pouvez pas télécharger de vidéos sans bricoler, de base.\nEt bien, avec l'application NewPipe, disponible sur F-Droid, cela permet de trouver les mêmes médias que Youtube mais vous pouvez télécharger soit les vidéos, soit l'audio !!! \nTout ça, sans faire de compte :D\nAmusez-vous bien !",
			"added": 1597780100
		},
		{
			"topic_id": 3,
			"title": "Actu du 27 septembre 2020",
			"body": "Un policier a été attaqué au couteau, à la cuisse, dans le 93 en pleine rue. L'assaillant a été arrêté. \nSégolène Royal devient \"débatteuse\" régulière sur LCI à partir de ce soir.\n",
			"added": 1601219809
		},
		{
			"topic_id": 4,
			"title": "Loi Sécurité Globale",
			"body": "Loi adoptée aujourd'hui par146 députés contre une trentaine... Ca fait en gros 180 députés alors qu'ils sont censés être 577... A quoi sont payés tous ces connards?? \nPendant ce temps, les flics ont encore tapés sur des manifestants cet après-midi. Ils ont gazé, ils ont amené les canons à eau etc... La place du Trocadero et le parvis des droits de l'homme ont été interdits à la foule, avec la mise en place de gros blocs de bétons. Belle image de la France.. \nDans quel pays vit-on?",
			"added": 1605990255
		},
		{
			"topic_id": 5,
			"title": "Le web classique m'ennuie...",
			"body": "Quand j'ouvre un navigateur, je vois tout le temps les mêmes sites. Les sites d'informations, par exemple, racontent tous la même chose.\nLes GAFAM possèdent quasiment tout sur l'internet classique, mais aussi sur les  appareils mobiles..\nTout ceci me gave. Comment l'homme arrivera t-il à penser, à travailler indépendemment de tout ces trucs de merde..??\nLes gens qui ne veulent rien changer ne  s'en sortiront pas dans le futur..",
			"added": 1609249102
		},
		{
			"topic_id": 6,
			"title": "La juiverie aux manettes du monde",
			"body": "Dans la discrétion, la juiverie infiltre tous les milieux... \nPolitique / Finance: DSK, Attali, Soros, Schwaub (directeur du forum economique de Davos), Sarkozy, Rothschild, Fabius, Levy, Buzyn, Salomon, Epstein\nMedias: Weinstein, Bruel, Dany Boon, Kad Merad, Gad el maleh, Goldman Macias, Michel Drucker, Faruggia, Fogiel, elkrieff, Cymes, Semoun, Feldman, polnareff, daho, oury, bacri, benichou\n",
			"added": 1609360956
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_1PUn1V3EJAu42r66mGF2jtpXkFCPxJWi5Q": [
			{
				"comment_id": 1,
				"body": "Les gens qui se soutiennent sont ceux qui s'en sortent: juifs, musulmans, chinois, homosexuels...\nPar rapport à la religion, nous, les Chrétiens, nous ne nous entraidons plus... Plus personne ne va à l'église, ne se rapproche pour effectuer diverses actions. Le fait de passer par une banque pour avoir de l'argent pour réaliser quelque chose, c'est déjà une grande distanciation vis à vis de sa communauté.\nEst-ce que les Juifs et tous ceux que j'ai cité plus haut empruntent pour acheter une voiture, par exemple..? \nNon, par exemple chez les musulmans, celui qui veut acheter quelque chose va voir l'imam. C'est ce dernier qui rassemble les fonds.. Tous les systèmes d'entraide fonctionne ainsi sur la confiance ;)\nPour rentrer dans le business (médias, politique etc..), l'entraide est  clairement visible dans beaucoup de communautés. \nRegardez RTL (et plus précisément les Grosses Têtes), il n'y a pratiquement que des homos.. Jeanfi Janssens, Ruquier, Steevy boulay, christophe  beaugrand.\nCela est valable dans tous les domaines ... Les gens qui s'entraident, s'en sortent mieux dans  la vie que les autres ;)",
				"added": 1590911712
			}
		],
		"1_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc": [
			{
				"comment_id": 2,
				"body": "de rien. On est là pour partager notre culture ;) et contourner la censure grandissante de notre pays ...",
				"added": 1591304675
			}
		],
		"5_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 3,
				"body": "On est dirigés par l'argent et c'est de pire en pire... Les gens qui disent le contraire ne regardent pas la réalité en face. On ne sort parce qu'on a pas les moyens, on n'achète une voiture ou une maison qu'en empruntant l'argent auprès d'une banque, etc...  Les politiciens ont besoin des banques pour le moindre projet. \nLes gens voudraient bien acheter au producteur du coin mais il est 3 fois plus cher qu'Amazon, donc où achètent-ils la marchandise, finalement...? \nC'est ça le système capitaliste, je crois.",
				"added": 1592685998
			}
		],
		"4_18QJHpnhj9ZPt6Un23MaZH8MGmzbt9ffaw": [
			{
				"comment_id": 4,
				"body": "Ca te coûte la moitié de ton salaire ^^\nEt rassure toi, les étrangers ont le droit à plein de choses que tu n'auras jamais en travaillant :D",
				"added": 1601221107
			}
		],
		"1_17t6ryDjaBqen9EhuAHDhMuAJAmzn95zj1": [
			{
				"comment_id": 5,
				"body": "> [kakatwomow](#comment_1_18QJHpnhj9ZPt6Un23MaZH8MGmzbt9ffaw): voleur ! un jour peut-être que le fruit du travail de ta fille sera pillé... comment payera-t'elle ses factures? en faisant la manche ou en se prostitutant? bravo, belle éducation.\n> ps si t as pas l'argent t'as qu'a faire des économies, te le faire preter par qqn qui l'a acheté ou simplement y renoncer... petite merde.\n\nle partage d'oeuvre ne tue en rien l'industrie du film.. Et puis, de toutes façons, les films sont amortis dès leur diffusion au cinéma..",
				"added": 1601666192
			}
		],
		"1_1NTEWMpNXV7F6yUoBcrVa1AXNCuGed9Esk": [
			{
				"comment_id": 6,
				"body": "Salut, c'est user.json le bon fichier, pas users.conf ;)",
				"added": 1608813421
			},
			{
				"comment_id": 7,
				"body": "c'est cool si ça a marché! Joyeux Noêl !",
				"added": 1608876465
			}
		]
	},
	"comment_vote": {}
}