{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1567266468_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": 1
	},
	"next_comment_id": 30,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [],
		"1565476547_14E1JL1vsL8CRFjwbrXsXfQ1FFvxp36c1Z": [
			{
				"comment_id": 4,
				"body": "It's just spam which looks like underage, but it's all legal.\nArchived copy, if you want to look: https://archive.fo/bb3UO",
				"added": 1565526323
			}
		],
		"1565492359_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 5,
				"body": "Lack of eugenics and overpopulation in certain areas is the biggest problem.",
				"added": 1565526478
			}
		],
		"1565560390_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": [
			{
				"comment_id": 6,
				"body": "Image does show if slider of the textarea with encrypted text is moved up or down. Password must be entered before pasting encrypted text with image. Update: not all images show, seems there is a problem with bigger images.\n\nSuggestion - add some notice how everything is encrypted & decrypted client-side, and which crypto is being used (AES-256). People need to be assured it is safe.",
				"added": 1565562192
			},
			{
				"comment_id": 7,
				"body": "> [anglosaxon](#comment_5_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n): Thanks for input guys. I'm still debugging it in different browsers for image input, text is working pretty well.\n\nImage encryption with larger images can be slow and it is being done immediately after each password char being typed. Suggestion - add something like 500ms+ timeout before encrypting again, or make it on-request only.",
				"added": 1565567938
			}
		],
		"1565717084_1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2": [
			{
				"comment_id": 9,
				"body": "Thread with links to the zip:\n**_Friendly reminder to upload your board software to the latest version_**\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v:pol:d6c70f03-b399-45c5-9888-c0aa739d1c33\n\nMake sure you get the latest one.\n\nOtherwise, the official Millchan is here: https://gitgud.io/millchan/Millchan",
				"added": 1565749931
			}
		],
		"1565805956_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 11,
				"body": "Veritas has some strange download system, which requires app install, and many people don't want that. So, here is the magnet link to all leaked documents in one zip file (not my upload):\n**magnet:?xt=urn:btih:4dbbd7421dc85e631e09c10c190760cf03e7a78a&dn=Don%27t+Be+Evil.zip**",
				"added": 1565812700
			},
			{
				"comment_id": 12,
				"body": "Example of what they consider as hate:\nfile: Don't Be Evil.zip/Censorship/IMG_0112.JPG\n**Penalty Box > Hateful content:**\n- _Will the White Race survive?_\n- _Girl speaks about the danger in Germany due to rapefugees_\n(saw the video, it was common sense, no hate, only concern about her safety after Cologne sex attacks)",
				"added": 1565813251
			},
			{
				"comment_id": 13,
				"body": "**Current Sr. Google Engineer Goes Public on Camera: Tech is \"dangerous,\" \"taking sides\"**\n(Project Veritas, 2019-07-24)\nhttps://www.youtube.com/watch?v=ricI5t66cj8",
				"added": 1565814450
			}
		],
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 16,
				"body": ">8chan refugees had their IP addresses exposed\nIt was not a lot of users since ~2/3 were on Tor, a lot of others on VPN, additionally, a few idiots saying \"maybe someone shared something illegal\" is not legally actionable, so they will be fine.\n\nOf course, use VPN or Tor or VPN+Tor and don't use US-based or heavily-advertised VPN providers.",
				"added": 1565922872
			}
		],
		"1565661379_13Gu27WksygoMQzLpktTGzZTHumTN5pce1": [
			{
				"comment_id": 17,
				"body": "Also test thumbnail image generation when posting mp4/webm, or anything else which generates thumbnails. Even updated Millchan will output empty canvas for mp4 thumbnails when using TBB, unless you disable resistFingerprinting stuff.",
				"added": 1565924487
			},
			{
				"comment_id": 18,
				"body": "> [pexo](#comment_130_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): This is a longstanding known bug. There isn't really a fast js library that we can use to extract images(we need to use js for that because we can't extract data from the canvas-element).\nOK, so for videos resistFingerprinting must be off. Perhaps for smaller video files it could still be fast enough.\n\nAbout Tor Browser (TBB), most instructions here say to toggle these 3 to `false` in `about:config`:\n```\nprivacy.resistFingerprinting\nprivacy.resistFingerprinting.autoDeclineNoUserInputCanvasPrompts\nservices.sync.prefs.sync.privacy.resistFingerprinting\n```\nSome did report not all 3 are needed - do you have any experience with this? Would be good to know, so only most needed options are toggled.\n\nSide question, you mentioned TBB is throttling JS, and a fix for lexical parser. Is there any setting in TBB to turn the throttling off?",
				"added": 1566011586
			},
			{
				"comment_id": 24,
				"body": "Thanks! It would also make sense for Firefox to skip all the rest of sub-options when the parent one is false. Using python for processing is a great idea!\n\nI have two extra questions:\n1.) I am seeding over 40 GB and some files are incomplete. Is there any script which would check SHA-512 of those files, and possibly delete those which fail the check? It would be great for archival purposes, or to get only complete images/videos, without checking them with other tools.\n\n2.) Is there any easy way to save Millchan threads with CSS into a single mhtml/html file? 'Save Frame As' is OK, but it won't save CSS from Millchan.",
				"added": 1566352979
			},
			{
				"comment_id": 26,
				"body": "> [pexo](#comment_133_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Not that I know of, but doing this in python should be pretty straight forward. Also I'm fairly certain that, unless you enabled a experimental feature in zeronet, all files you can find in the zite directory should be complete already.\nMost are, but certain percent of optional files is not complete, from video files to pdf. A lot will eventually reach 100%, but not all are seeded. Is there any script around which could be adapted to do this? Settings wise, nothing special except 'download and help distribute all files'.\n",
				"added": 1566502823
			}
		],
		"1566051166_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 19,
				"body": ">The peak concurrent population was around 4500 peers, now its less than 900. \nIt was 11000+, right now it shows ~5600, goes up and down depending on the day of the week and time.\n\nBO recommended upgrade to Millchan, check the main stickied thread, there is a link to the zip there. You can compare the contents of the zip to the official version, to be extra sure.\n\nOther stuff... Relax. :)",
				"added": 1566052460
			}
		],
		"1566038009_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 20,
				"body": "http://dreadditevelidot.onion/",
				"added": 1566053306
			}
		],
		"1566037008_1PxkuTN6oZst8Q7inUZb6xqGJrtkHTGkDq": [
			{
				"comment_id": 21,
				"body": ">honeypot\nFUD. Use Tor.\n\n>seeding\nSeeding over 40GB, over Tor.",
				"added": 1566053524
			}
		],
		"1566210711_19J2r2jEXdB6jpjPGJtRGSAQQLqPpJFGzV": [
			{
				"comment_id": 22,
				"body": "**ZeroNet**, not Zironet",
				"added": 1566225971
			}
		],
		"1566184630_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 23,
				"body": "https://dark.fail/\nhttp://darkfailllnkf4vf.onion/\nhttp://dreadditevelidot.onion/\n\n\n> [watteau](#comment_78_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): Kim Dotcom,  currently going through lengthy legal proceedings and appeals to avoid being extradited to the United States.\nKim is not related to darknet markets. His site was Megaupload (https://en.wikipedia.org/wiki/Megaupload).",
				"added": 1566226277
			}
		],
		"1566399180_17KiwHwKMhcEVfPrnwf4wfggjmrsQZjN3x": [
			{
				"comment_id": 25,
				"body": ">Does this mean I'm still connecting without tor to some peers?\nNo.",
				"added": 1566401119
			}
		],
		"1566581844_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 27,
				"body": "VPN is not needed if you use Tor. Some argue it provides an extra layer of security, but it ultimately depends on who is running the VPN. It is good to have it for non-Tor connections. ZeroNet will use local Tor instance to connect to other peers. You can also set it to use Tor for trackers and, if needed, to use Tor bridges. This will protect your traffic from ISPs, or anyone else trying to intercept it.",
				"added": 1566589175
			},
			{
				"comment_id": 28,
				"body": "> [crazylime](#comment_164_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): Tor and VPN are unlikely to protect you from large entities.  They can, however, protect you from a pissed off troll wanting to attack your IP address.  Tor is free.\nThey want you to believe that, it's part of psychological warfare - don't even try, since they can see and do everything. According to available info entities like the NSA or CIA cannot break proper encryption, which Tor uses. This is why they invest a lot into subverting implementations of it, basically telling companies to use weaker crypto. They may also tap into the traffic of largest VPN providers, or get them to cooperate somehow. Big entities have an advantage of being able to monitor a lot, which means it is easier to get someone by other means ie. physical surveillance, text analysis, attacking vulnerable software, and various correlation attacks.",
				"added": 1566628803
			}
		],
		"1567266468_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 29,
				"body": ">I have seen a growing trend among programmers where you like to make these great programs but then all you do is post them to github and expect us non coders to know what the fuck were doing\nVery true. Even ZeroNet would have a lot more users if it was something easy-to-use like Tor Browser Bundle. Many users don't even know they can drag the icon to the left (and other directions), to get to advanced options and stats. There is a reason big companies like Microsoft and Apple spend a great amount of money and time on studying interfaces and end-user experience.",
				"added": 1567281599
			}
		]
	},
	"comment_vote": {
		"9_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1,
		"11_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1,
		"12_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1,
		"13_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1,
		"16_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1,
		"20_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1,
		"23_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1,
		"27_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1,
		"28_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1
	}
}