{
	"posts": [
		{
			"id": "75db3f57-2d81-4c48-a912-6e006c9d40bd",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "f730026d-a61c-48ba-9ce3-cb4fac6f4900",
			"body": ">>0a88f66c-70ed-4295-a400-1eea09af4580\nBecause tor protects the canvas, fucktard. Classical file uploads work fine. What the fuck are you doing on this board?",
			"time": 1565081234746,
			"files": "[]"
		},
		{
			"id": "5d9f4d8c-3c64-4ecc-83b3-ec1e71cac56e",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "f730026d-a61c-48ba-9ce3-cb4fac6f4900",
			"body": ">>56b948bf-6446-410f-a245-f295c7306bb8\nlmfao\n>It's for the websites to perform draw operations on elements of the DOM. It has nothing to do with file upload.\nThe canvas element is a freedraw area element used for arbitrary graphics, such as embedding potential profile pictures for in-page resizing pre-upload, see discord, facebook, twitter, etc. It's so convenient that most js-heavy toolkits use it for all image uploading since you get previews without any backend work and without farting megs of b64 into the DOM.\nBecause of its low level nature, it has access to many identifying bits of information about the computer related to graphics hardware peculiarities. Thus, TBB disables that shit by default, returning a white square.\n>You are the one who sounds like he doesn't know what he's talking about, not me.\nHow about you learn not to be a fucking retard and lurk more before presuming you're welcome here, nigger?",
			"time": 1565112319153,
			"files": "[]"
		},
		{
			"id": "cacb5737-cb15-4991-9a5e-0a7d797a3879",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "256d9008-f0d3-4e83-836c-08a8e5efaed7",
			"body": "Basically, yes, anything that relies on user distribution in a swarm could be profiled by peers in that way with pervasive passive surveillance. You're correct that fucking around deleting folders and expecting to magically become anonymoose by it is for redditors and big boy computer users who can't read whitepapers.",
			"time": 1565112636267,
			"files": "[]"
		},
		{
			"id": "bb56fab9-16d1-4d19-90f9-1cc8f1f0b1bc",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "05ff81c4-c907-45ee-86d2-660acf0d93ae",
			"body": "My T61P just finally died last week. I don't know what to do about getting a replacement. All modern laptops are deliberately, insultingly shitty in some way or another. It feels like a massive ploy to make people retarded and humiliate those that aren't.\n\nFor example, all the new laptops have frames that could obviously fit a 16:10 screen, it would fit better, even, but instead they've opted to put in a 16:9 panel and a fatass fucking useless thick strip of plastic with their logo on it. Amazing.",
			"time": 1565112859359,
			"files": "[]"
		},
		{
			"id": "f4ccb812-c416-4183-9656-cf238300d36d",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "f730026d-a61c-48ba-9ce3-cb4fac6f4900",
			"body": ">>56b948bf-6446-410f-a245-f295c7306bb8\nIt's even in the FAQ you dumb fuck fag.\n>Why am I getting a white images when I try to post?\n>Thumbnails are generated by the browser.\n>Tor retuns a white image if the site doesn't have permission to access the canvas element.\nsuckstart a shotgun",
			"time": 1565125809781,
			"files": "[]"
		},
		{
			"id": "fede08dc-9c5f-4dd8-8ca8-4745cff78525",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "840f9d43-67a1-4aa4-b0ea-bb11763e491a",
			"body": "Yes, you fucking idiot. If you want to use Tor you get to configure ZeroNet itself to connect using Tor on the backend. Next time try deleting system 32, or reading the documentation, whichever seems easier.",
			"time": 1565125943859,
			"files": "[]"
		},
		{
			"id": "1bfd2c6d-7be6-404d-aefe-55e04288ee54",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "bfdc4f6d-b1de-4add-bd93-0b1afcca2d49",
			"body": "The boomers provide a useful level of obfuscation. Remember, feds can't grok our memes - nobody can, without becoming us themselves. Our culture morphs faster than they can make powerpoints to decode it, while retaining that vital energy that escapes their grasp. The crucible of ideas, the meme forge, is the asset they want to crack, but if the descend deep enough to figure out who's boomerpoasting and who isn't, to decode the subtle ironies, they open their minds to our seed: we've already won.",
			"time": 1565126483422,
			"files": "[]"
		},
		{
			"id": "f3d17f9e-e4fb-4036-b663-7151641245b1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "k",
			"thread": "f7b2f01d-6eb2-42cf-a973-79f04f4c5127",
			"body": "Fuck the clearnet. This is the push we needed, to mobilize anons to embrace their inheritance as the raiders from the wild. Accelerate. Ban hate speech at the DNS level, at the ISP level, weave tolerance into the whisper of the wires. It's no use. Our pliers and compilers are raised. Our pirateboxes are inside the walls of every one of your sacred institutions. Microwave beams and packet radio screams over the ether with our message: we were here before you, and we'll be here after you. We innundate your air with toxic memes, trade weapons of mass destruction over cjdns, disrupt your centers of capital with targeted infohazards. Celebrity drivel broadcasts are hacked, flashes of marching masked men break through the fecal haze. Camaraderie is alive. Purification is coming. You'd better like Yoohoo.\n\n/tech/ is ready to /k/rusade. 32",
			"time": 1565127090755,
			"files": "[]"
		},
		{
			"id": "f1b326fe-1661-4950-93d3-1a7b473d2378",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "k",
			"thread": "877f1875-4616-422a-b9ab-c01be0e70a97",
			"body": ">>5fd7edcd-a29c-4ef5-ac73-2100c5aa0f70\nBlumpht already explicitly endorsed the state seizing weapons on hearsay, circumventing due process and all that shit. Our foremost effort should be making these paper-obsessed spiritual-boomers realize that the Law has betrayed them, and if you ever believed in SHALL NOT BE INFRINGED, the way to espouse it in a tyrannical oligarchy that hates you is by printing dozens of funs every single day, even if you lose track of some of them.",
			"time": 1565128077026,
			"files": "[]"
		},
		{
			"id": "cfe4be3f-ed6b-4a95-aa20-e2c5390e692b",
			"directory": "users/1Ew94C1V9PozFSdCZ4n6r7oK3BBTKo2xTZ",
			"uri": "cuteboys",
			"thread": "fc5948bc-a51d-46a8-8dfb-12bea201b6d4",
			"body": "It's better here. I'm never going back to the surfaceweb.",
			"time": 1565351500059,
			"files": "[{\"name\":\"3bdbb4e48c2344c5e188c73c07a68f16350d030768fab954e99623a89ac6773d.jpg\",\"thumb\":\"00b2d755309cdfe4bec8c3a9ad8107e63f2244b0-thumb.jpg\",\"size\":29305,\"type\":\"image/jpeg\",\"original\":\"957bfcc38732fabb151522990eec37ea148c4654.jpg\",\"directory\":\"1EEZoTAfhY4Ytoe9vNqYG6MQfRxHZXoYNN\"}]"
		},
		{
			"id": "74407a4c-8e35-41b2-b36e-1a86d85fbb38",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "aa8ff392-866d-4d81-b3eb-697f3e3ceabb",
			"body": "Good, fuck journalists and fuck the retard boomers and qcumbers. We've needed a purge for a long time, /pol/tech has always been a god damn embarrassment. It's time to level up.\n\nKnowing how to use a computer: more effective than gorespam",
			"time": 1565521006133,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}