{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 1,
				"body": "Это что, передел власти? Выдвигаются очень странные инициативы, больше похоже на какую-то провокацию. Хочешь застолбить вакантные места чуть ли не основателей русскоязычного сегмента, создать конфочку приближенных айтишничков, которая будет рулить одобренными ресурсами? Может еще вики сделаешь, со смешными логами из конфочки, как вы весело сосете там пивасик и айтишничаете? А калтент ты какой генерировать будешь? Вот такие простыни с самовосхвалением?",
				"added": 1549902170
			}
		],
		"1_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 2,
				"body": "Конечно нет. Люди скорее начнут приспосабливаться в клирнете, чем переедут сюда, как бы сильно их не щемили. Даже местные, по указке ГБшного лидера мнений, пользуются Телеграмом, а на остальных тем более нет надежды. Тот же Тор никому не был бы нужен без возможности подрочить на детей. Маленькая группа разложенцев в виде дрочил и наркоманов ничего хорошего организовать не сможет. А они, как обычно, формируют ядро всех альтернативных сетей.",
				"added": 1550918331
			},
			{
				"comment_id": 3,
				"body": "> [quirrel](#comment_86_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): И да, у меня ощущение, что Зеронет сейчас активно топят лахтинские боты, судя по этой теме. И, надо признать, у них получается - желание писать и общаться с подобными людьми не очень велико.\n\nТебе просто кажется, на азерском форуме пересидел, моча в голову ударила. Впрочем, можно удалить Зеронет, если не нравится.",
				"added": 1551023109
			},
			{
				"comment_id": 4,
				"body": "> [quirrel](#comment_88_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): А вот и первый ольгинец. Видите? Собственно, и без этих ребят тут было не айс, но они очень быстро всё засрать могут, если будет необходимость.\n\nИзвини конечно, но ты должен понять, что главные враги Зеронета - это вахтеры, которые делят пользователей на своих/чужих, мечтают ввести доступ по белым спискам и подмять под себя ресурсы.",
				"added": 1551024105
			}
		],
		"1_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW": [
			{
				"comment_id": 5,
				"body": "> [gsdth](#comment_10_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW): на тот случай если действующий ебнется\n\nИз zerohello его так просто не клонируешь, только с помощью инструкции в репозитории https://gitgud.io/mcdev/Millchan\nЕсть еще версия с хабами http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/ \nМожешь клонировать хаб http://127.0.0.1:43110/13kifcv8J8noDEXdztXY4qkPPPKLK2PiAe/ и пасти на нем анонимчиков, которых нет.",
				"added": 1552114924
			}
		],
		"2_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": [
			{
				"comment_id": 6,
				"body": "> fuckthepolice\n>t.me\nНет покоя красноперым рустерам.",
				"added": 1553008634
			}
		]
	},
	"comment_vote": {
		"15_1EuiXCvBRfV3qrJTyi4KPcnj9iEppALsrt": 1
	}
}