{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_132B7WMrBKXDKPxGuh82hN9m6jfH9W1TRN": 1,
		"2_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"2_12v6isNzUBMu7qmZosCrKuhRgeu1qPiUbs": 1
	},
	"next_comment_id": 6,
	"comment": {
		"3_1J7BZnp2xmjByBDG3z9UUtXv22pnQ7akfr": [
			{
				"comment_id": 1,
				"body": "Enfia o dedo no cu e lambe resto de aborto, neonazistinha de Internet",
				"added": 1553729514
			}
		],
		"2_1FNHZwnLZq8oTwXiG37GMwq2Fougmow6KP": [
			{
				"comment_id": 2,
				"body": "> [jynxed](#comment_5_1NgmdP99tdxYEKJsCmZiu9sLxiVKPrAKD1): Lembre-se que a ZeroNet não é totalmente anônima\n\nExato, ela é só descentralizada",
				"added": 1553729824
			}
		],
		"1_1CkgC7bFTCM1hW61V331Rnk1EVRpud6u87": [
			{
				"comment_id": 3,
				"body": "Olha o que você menos precisa é de \"amigos\" é bem fácil viver sem eles desde que você tenha algum propósito. Para encontrar alguma razão de viver você deve se dedicar a alguma coisa como sua familia, o conhecimento(No meu caso eu estudo bastante sobre Linux), aos ensinamentos de Deus(Leia a biblia, hoje as igrejas só tem charlatões) ou ao aprimoramento físico(Eu corro no parque de segunda a sexta). No começo a mudança de habito é dificil, eu já fui\num fudido da cabeça, mas com algum esforço e uma coleção de tentativas consegui me erguer novamente. Voltando na parte dos amigos é melhor que você esqueça todos e tente se aproximar apenas de pessoas que se dedicam ao seu auto-desenvolvimento. Eu considero que tenho apenas um amigo, mas esse cada dia que converso\ncom ele me sinto mais inteligente e disposto a me melhorar. Acabe com esses pensamentos começando pela parte\ncultural, se gosta de músicas tristes ou horrorosas pare de ouvir, a felicidade é mais sobre tirar as coisas ruins da sua vida do que conseguir coisas boas. Tentei dizer de forma rapida algumas coisas que pudessem te ajudar espero\nque funcione, FIQUE COM DEUS!",
				"added": 1554590358
			},
			{
				"comment_id": 4,
				"body": "Não ligue para os outros comentarios são apenas pessoas que não tem sucesso algum na vida tentando se sentir superior alguem, elas são semelhantes aquelas pessoas que desfazem dos colegas perto de uma garota para parecesserem superiores, no fundo são todos futeis e irrelevantes.",
				"added": 1554590559
			}
		],
		"1_1FAjgFhx96FDLwnL2JCMYDjuT9QcGneETU": [
			{
				"comment_id": 5,
				"body": "Esses dias sonhei que tinha entrado em uma cidadezinha transportando armas, andando por ela me deparei com o Zé de Abreu e rendi ele, então apareceu um cara e deu um golden shower nele e depois eu fui e matei ele",
				"added": 1554590721
			}
		]
	},
	"comment_vote": {
		"3_1CmKnRkBqGcBLEJomTcERHEMtR77TTv3ag": 1,
		"2_1CkgC7bFTCM1hW61V331Rnk1EVRpud6u87": 1,
		"3_1CkgC7bFTCM1hW61V331Rnk1EVRpud6u87": 1
	}
}