{
	"title": "Blog of nassau",
	"description": "personal blog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 30,
	"demo": false,
	"modified": 1517455128,
	"post": [
		{
			"post_id": 29,
			"title": "张敏采访宋永毅： 颠倒是非的“探索” ",
			"date_published": 1517455052.117,
			"body": "http://botanwang.com/articles/201802/%E9%A2%A0%E5%80%92%E6%98%AF%E9%9D%9E%E7%9A%84%E2%80%9C%E6%8E%A2%E7%B4%A2%E2%80%9D.html\n\n**中国教育部推出新版八年级历史教科书送审本，毛泽东“文革”错误成“艰辛探索”**\n\n日前中国教育部推出新版八年级中国历史教科书送审本，其中删去了原教科书中“文化大革命”一课，将有关“文花大革命”的内容与“十年探索”合并归入第六课，题目是“艰辛探索与建设成就”。把以前课本中“毛泽东错误的认为”中的“错误的”三个字删去，改为“毛泽东认为”。同时删去原版中的毛泽东认为“党中央出了修正主义”这九个字。目前这一送审本还没有获得高层签字，尚未印刷。未来新版教材如果投入印刷使用，将改变过去中国统一教学大纲之下多版教材的局面，成为全国初中二年级统一使用的历史教科书。\n\n**宋永毅应邀简介从事“文革”研究二、三十年以来完成的较大工程**\n\n就中国中学历史教科书这一修改送审本公布，我采访了“文革”研究专家宋永毅教授。\n\n主持人：“能不能请您先作一个简要的自我介绍？”\n\n宋永毅：“我现在在加州州立大学洛杉矶分校图书馆任教授。我从事‘文革’研究也有二、三十年了，比较大的工程比如像《中国文化大革命数据库》，那是我主编的。我还主编了整个《中国政治运动数据库》包括‘土地改革’、‘公私合营’的一个数据库，‘大饥荒’、‘大跃进’一个数据库，‘反右’一个数据库。这大概就是我做的比较大的工程。当然，一直还在从事‘文革’研究，比如还和几个朋友一起出版过英文版的《文革大字典》，更不用说英文、中文啊很多论文……这个大概就是我的研究。”\n\n**宋永毅：我觉得改革后三十年B和改革前三十年A的关系是B减去A等于现在C**\n\n主持人：“关于中国教育部这次修改中学历史教科书，您愿意从哪几方面谈谈您的看法？”\n\n宋永毅：“这个修改教科书释放出哪些信息。第二就是修改后的教科书的说法和中共十一届六中全会《关于建国以来党的若干历史问题的决议》对‘文革’、毛泽东的定论有哪些不相符合之处。此外也涉及到怎么看待修改教科书的背景和时间点。就这么几个问题简单谈谈看法。\n\n我想，中国教育部的这个变化，毫无疑问和习近平的一个说法有关，就是习近平说‘不能用前三十年来否定后三十年，也不能用后三十年来否定前三十年’。这个说法好像不偏不倚，当时我听了这个说法，就觉得习近平没有动脑子，因为他这是漫不经心随口而出的一个说法，不是论文，不是一个比较完整的报告。\n\n正好有北京的几个高干子女‘文革’中间和习近平也熟的人到我家里来，我跟他们讲，说‘习近平这还是小学的算术逻辑，他不知道逻辑作为形式逻辑，或者数理逻辑，实际上比他那个一加一等于二的算术数逻辑要复杂一点’。\n\n我跟他们讲了一个简单的算术。比如说，过去改革之前的三十年是A，改革以后的三十年是B，那么今天就是C。习近平的这个算术很简单的，因为他没有经过思考就讲，A 加上B等于C。他觉得，这个都是必要的嘛，你不能否定嘛！不能去掉什么东西。\n\n他忘掉了，这个里面，实际上改革以后的三十年和改革以前的三十年的关系是什么呢？是B减去A等于C。这个B啊，就是改革嘛，就是改错，改革就是否定。你去查一查什么叫改革，改革就是改以前错误的东西。任何一个汉语字典，百科字典都是这样。\n\n那么既然是改革开放这三十年，以前没有开放，以前错了的要改革，那就是B把以前三十年A的那些政策什么减掉，才有今天的C。我这个就是很简单的讲一个算术和数理逻辑上的一个常识性问题。”\n\n**宋永毅：我觉得习“晒”书单出于自卑心理。他没好好读过书，把自己说成伟大领袖**\n\n宋永毅：“习近平在讲那个话的时候，一方面因为他原来……你是北京人，你知道他是‘八一学校’的嘛（笑）！他是六九级，实际上这个人是小学六年级学生。后来你记得‘文革’中间江青、陈伯达把‘八一学校’给解散了，以后‘八一学校’的人就近分配到北京的一些学校去，我看过他的传记，我记得他是分到北京26中……”\n\n主持人：“网上有说是25中。”\n\n宋永毅：“但是他这个不是考进去的呀（笑），就近嘛。比如说，我中学是上海中学，那个时候上海中学来了一帮六九级的学生，他们就是莫名其妙的分进来的，从来也没有经过任何考试。这些小孩呢，实际上他只有小学水淮，大概有些可能小学都还没有读完呢。\n\n然后他进来会做两件事，第一件就是参加武斗打架，那些人很会做。第二个事呢，就是过早谈恋爱。和我们原来上海中学老初三，哪怕老初一，大不相同，因为我们至少还是读书人。”\n\n主持人：“是择优录取的……”\n\n宋永毅：“择优录取嘛，他那个完全不一样。所以我觉得习近平后来又是工农兵学员，他实际上没有好好读过书。他一天到晚‘晒’那些书单，是出于他的自卑心理。他没有好好读过书，所以他就是要把自己说成是一个伟大领袖，把自己说成是博览群书。他怎么可能看那么多书？\n\n我们都是在‘文革’中从事‘地下读书运动’的，是研究而且是参与的。那个时候，要搞到一本书多不容易，对吧？他父亲也不是一个知识分子干部。”\n\n**宋永毅：毛发动“文革”是用一个更大的错误掩盖原来较小的错误，现在的人也如此**\n\n宋永毅：“问题并不是在于习近平他漫不经意的……如果说习近平就这个东西要写一篇文章的话，我估计他写不出来。因为，这个他说说可以，他要写成一篇文章，那就要精雕细作，就要推敲，推敲呢，就写不出来这篇文章，因为会自相矛盾。\n\n但是下面……中国其他的人都缺，中国缺人才……但是不缺拍马屁的人，拍马屁的人中国随手抓一把。教育部那帮人就是拍马屁的，他看了习近平那个说法，就要落实领导的最高指示了，那么就要把习近平本来就具有逻辑错误的话，把它说圆，把这个谎也要说圆，就产生现在这个情况。\n\n现在第一步就要把教科书给修改。实际上教育部所做的事情、所反映的问题，比习近平的信口开河要严重一百倍。实际上是中共的一贯做法——要用一个更大的错误去掩盖原来一个比较小的错误。\n\n举个例子说，本来‘文革’可以不搞的。但毛泽东有两件事情他放不下。\n\n第一是‘八大’把他那个‘毛泽东思想’去掉了，变成集体领导了，他一直放不下。你去看李志绥写的《毛泽东医生回忆录》，他觉都睡不着，1956年的那个‘八大’。\n\n第二个就是‘七千人大会’，就是那个‘大饥荒’死了那么多人。\n\n他这个‘文革’……现在大家的一般研究，他‘文革’就是要翻两个案。第一个案是要翻‘八大’集体领导的案；第二个案就是要翻‘大饥荒’饿死人三千到四千万人的案。结果他发动了更加大的一场所谓的‘革命’，实际上是乱七八糟的动乱，来掩盖他原来的错误。在中共的这个历史上，‘解放’以后老毛搞的东西都是要掩盖以前的错误。”\n\n**宋永毅：“文革”毛泽东做成功一件事：把集体专制变成他一个人的独裁专制**\n\n一年多以前，在“心灵之旅”纪念“文革”爆发五十周年专题节目里，宋永毅教授谈到文革对当前中国的影响时说过：“我觉得，如果说‘文革’对当前中国政治及社会或者整个中国的影响，两件事情是一定要谈的。\n\n第一件事情，就是对中国政治的影响。第二件事情，是对中国国民精神素质的影响。\n\n当然中共已经谈了很多，像‘文革’造成多少国民经济的损失啦，‘文革’造成了整个教育的停顿啦，这一类事情已经讲得很多很多了。我觉得，这些东西是明眼人都可以看到的。甚至说‘文革’中间……叶剑英说有一亿多人被整，或者被牵连到，有多少人非正常死亡……这个课题也是有争议的，因为中共没有公布它的统计数字。\n\n我要讲的就是，‘文革’毛泽东做成功了一件事，而这个事情不管是薄熙来也好、习近平也好，是非常羡慕他的，他们还想要做的。就是‘文革’以前的中国，尤其是通过‘八大’反个人崇拜，基本上已经建立了一个一般人的统治、一般人的专制，也就是说那个‘政治局的专制’。\n\n尤其是在‘大跃进’失败以后，应当说刘少奇、邓小平、陈云、周恩来等人，这些人还是把毛泽东的风头给压下去了。那么‘文革’毛泽东要改变的，就是他要把一般人的集体专制变成他一个人的独裁专制。‘文革’毛泽东通过种种手法，比如说控制军权，比如说个人崇拜，因为他要标志出他比他那些同事们高级的地方，就要把他自己造成一个‘神’，那这个……‘文革’可以说毛泽东搞成了。”\n\n**插播1966年“八‧一八”毛泽东在天安门广场接见百万“红卫兵”纪录影片录音**\n\n现在插播一段‘文革’中的1966年8月18日毛泽东在天安门广场接见百万“红卫兵”纪录影片的实况录音。\n\n（“八‧一八”大会现场报道实况录音）\n\n合唱：“东方红，太阳升，中国出了个毛泽东……”\n\n现场播音员男：“大海航行靠舵手，万物生长靠太阳，干革命靠的是毛泽东思想。在我们的伟大领袖毛主席的亲自领导下，一个史无前例的无产阶级文化大革命高潮，正在我国兴起。\n\n8 月18 日，我们敬爱的领袖毛主席同北京和来自全国各地的一百万革命群众一起，在雄伟的天安门广场，举行‘庆祝无产阶级文化大革命大会’。\n\n中共中央政治局委员‘中央文化革命小组’组长陈伯达同志致‘开会词’”。\n\n陈伯达：“同志们、同学们，现在开会了！我们伟大的领袖、伟大的导师、伟大的统帅、伟大的舵手毛主席，今天在这里同大家见面！”\n\n众呼：“毛主席万岁！毛主席万岁！……”\n\n播音员男：“林彪同志讲话。”\n\n林彪：“同志们，同学们！我首先代表我们伟大的领袖毛主席向大家问好！我代表党中央向大家问好！我们坚决支持你们敢闯、敢干、敢革命、敢造反的无产阶级革命精神！”\n\n播音员男：“周恩来同志讲话。”\n\n周恩来：“同志们，同学们！你们好！问你们好，向你们致无产阶级革命敬礼！我们向来自全国各地的革命学生和教职员工表示热烈的欢迎！你们辛苦了！\n\n党中央刚刚开过第十一次全体会议，这次会议是在毛主席亲自主持下进行的。这次会议的成功，是毛泽东思想的伟大的新胜利！\n\n这几天，全北京在欢腾，全国城市和乡村在欢腾，到处敲锣打鼓，送喜报、开庆祝会，下决心书，亿万人民投入了无产阶级文化大革命的洪流。\n\n今天，我们又在天安门这样的广场上，同我们伟大的领袖毛主席在一起。我们开庆祝会，迎接无产阶级文化大革命的新高潮！”\n\n（众狂呼‘毛主席万岁！万岁！毛主席，毛主席……’）\n\n**宋永毅：毛泽东是这一代“红卫兵”集体的父亲**\n\n宋永毅：“我们都可以知道，这个时候毛泽东的‘最高指示’，谁敢违反？不要说老百姓不敢违反，政治局的那些常委啊什么，谁敢违反？你一违反，那就是打倒啊。\n\n所以整个这个‘文革’毛泽东的遗产，对当前的中国那些年轻领导人，就是习近平也好、薄熙来也好……为什么现在大家都说‘习近平走的是一个没有薄熙来的薄熙来的路线’？很简单的一件事情，就是因为他们的血液中间有相同的基因。\n\n这个政治基因和他们的老子没有关系，和薄一波没有关系，和习仲勋也没有关系。\n\n老实讲，毛泽东是这一代‘红卫兵’集体的父亲。”\n\n**宋永毅：“文革”变成毛泽东的“探索”，历史无是非黑白，翻案是荒唐闹剧**\n\n宋永毅：“现在把‘文革’给去掉，变成了‘毛泽东的探索’，那个就荒唐了，就是说希特勒也是探索，斯大林也是探索，萨达姆也是探索，这个历史就没有是非了。\n\n你现在判一个人，你说‘你杀了人’，你要把他枪毙。他说‘我这个是艰苦探索，我要探索怎么杀人，然后我可以用来对付那些杀人犯’。这个人类历史上就没有是与非了，没有黑和白了。这个完全是胡搞。\n\n我们那个时候读马克思的一篇名著《路易·波拿巴的雾月十八日》，马克思有句话说，历史上的事情，第一次出现可能是悲剧，但是第二次模仿出现，这个实际上就变成一场闹剧。现在对‘文革’也是这样子，你说‘文革’死那么多人，那个时候人们还比较真诚的去搞‘阶级斗争’，你现在还要翻‘文革’的案，那个就变成一个闹剧。\n\n习近平现在他要像毛泽东一样拍一个标准像，我就觉得非常可笑，而不觉得他有什么伟大，不觉得他有什么正剧的价值。”\n\n**宋永毅：习近平为什么喜欢“文革”？看他在“文革”中得到的多，还是失去的多？**\n\n宋永毅：“对于习近平，我也作过一些小小的研究。我看过他的不少东西，包括他在没有成为中共的领导之前，他接受采访的一些讲话。包括他原来的朋友，比如说像聂卫平，原来回忆知青岁月，回忆他和习近平的来往。那时候习近平不过就是福州市市委书记、市长之类的角色。他也讲到，他们那个时候都是小学生，六九级嘛，怎么样去参加武斗……\n\n习近平还讲了一个笑话，说当时武斗结果是他们陷入了一个陷阱，有一个他们的朋友就被打成脑震荡了。习近平说，还好当时跑得快，否则的话就没有今天了。确实如此，如果当时打成脑震荡，习近平也不可能成为今天的中共领导。\n\n我们现在有一个迷失就是大家都谈到，习近平在‘文革’中间受了迫害，他为什么还要喜欢‘文革’？\n\n我一直跟他们解释，第一个当然就是政治基因没有办法遗传。不是说他父亲在共产党中间属于温和派，他就一定是改革派。他父亲也未必就是改革派中间像胡耀邦，像赵紫阳那么积极的人。第二个，‘文革’对家庭的影响，你要总体来看这个人在‘文革’中间是得到得多，还是失去的多？\n\n如果看习近平，我举个例子好了。习近平‘文革’使他进入清华，习近平当时在小学的成绩也好、他今天的智商也好，他要通过考试进清华很困难。\n\n我也老老实实讲，我看过他的博士论文，四个字，不忍卒读，根本是不忍卒读。‘文革’使他入了党，进了清华。以后他才有机会当耿飚秘书啊怎么怎么样……\n\n总的来说，习仲勋在‘文革’中间所受的迫害是不严重的，基本上他就是像一般老干部所受的迫害。第二个问题就是，我觉得魏京生当时讲了一个话蛮有道理，他说‘主要整习仲勋的不是毛泽东，是刘少奇那一派。’确实如此，因为习仲勋是属于高岗那个系统的。而高岗那个系统在50年代主要反的不是毛泽东，主要反的是刘少奇嘛，后来也一直被刘少奇那派整。所以你去看，习仲勋对毛泽东也很有感情的。\n\n那后来他用来教育习近平的，据我所看到的资料，当然他们这爷儿俩可能在书房里面说那些中央内部黑暗的斗争，谁知道！但是从小叫他背毛主席著作、背毛主席诗词，那个都是非常‘左’的教育，一般的老干部家里都未必如此。\n\n所以我觉得，总的来说，‘文革’使习近平得到了（比）没有‘文革’他能得到更多的东西，清华他上不了，他那个‘八一学校’怎么考得进清华呢？！\n\n我跟清华的那些朋友讲，比如说咱们那个丁抒是清华的……”\n\n主持人：“丁抒先生也是研究中国当代史和‘文革’的专家。”\n\n宋永毅：“他说，他在所有的清华的同学中间……北京的……就没有找到过一个‘八一学校’毕业的，哈哈哈。至少他认识的几百个人中间，没有一个是‘八一学校’毕业的。大家都知道，‘八一学校’是一个纨绔子弟学校。”\n\n主持人：“您刚才谈到，可能习是随口的，并不是很正式的说了相关的几句话，然后下面的人……您理解他们是‘跟风’呢，还是说这一次举动如果没有习近平的默认，是不会有这么大动作修改教科书？”\n\n宋永毅：“我觉得这未必是一个什么中央政治局或者讨论过。唉！中国其它的就缺了，拍马屁的不缺。现在因为习近平又要作毛泽东，他们恨不得把他的话都说成是‘最高指示’，这个就是‘文革’的风嘛！你看习近平讲了那么一句话，明明是错的，还要把它说圆。\n\n当然，总的倾向很清楚，习近平说这个话实际上也是反映他思想深处，他对‘文革’还是蛮有感情的。因为‘文革’使他得到的多嘛！”\n\n**宋永毅：“习近平要这样搞下去翻‘文革’的案，就抹煞了人类历史基本的是非概念”**\n\n宋永毅：“当然，更深的分析，他要成为毛泽东这样的，就是要推翻集体领导，成为毛泽东这样不是一个集体的专政，而是他建立一个个人的专政，他必然只能走毛泽东的道路。”\n\n主持人：“这中间的还有一些细节，比方说原来中学现行教科书不是统一的，他这次改了以后，假如经过审批确定了，就会变成全国统一教材，这个动作也是比较大……”\n\n宋永毅：“是啊。”\n\n主持人：“那么，这个课本的修订会给新的一代带来什么样的一种对于……”\n\n宋永毅：“历史没有是非了嘛！杀人也是‘探索’，‘吸毒’也是探索，全部都是探索了。希特勒也是探索，斯大林也是探索，波尔布特更是探索……这个所谓的、似是而非的‘艰辛探索’，它实际上是抹煞了人类历史的一个基本的是非概念。因为他把完全错误的东西、他把罪行的东西都解释成为‘探索’了。\n\n我认为这些道理就是显而易见，大家都懂。中共历史上的一贯做法就是，你说他是‘翻案’也好……我是用了一个词，就是‘用一个更大的错误，去掩盖一个比较小的错误’。\n\n我刚才举了例子，就是说毛泽东他要翻‘八大’的案，他要翻‘大饥荒’的案，结果就搞了一个‘文化大革命’出来，越搞越不像话。中共历史上就是这样的，符合这个中国历史的……习近平他这样要搞下去，他就是要想方设法翻‘文革’的案了。”\n\n**宋永毅：中共十一届六中全会决议对毛泽东功过三七开，修改课本成毛泽东没错误**\n\n主持人：“那十一届六中全会认为，对毛泽东他的错误和他的功绩是‘三七开’，那么现在这样的一个举动，是不是意味着对毛泽东的错误方面，会越来越缩小这个比例，甚至于把他错误的也都说成是正确的？”\n\n宋永毅：“对。如果说按照他现在这个说法，历史没有是非感了。就是毛泽东他没有错误了。他还有什么错误呢？他连这个话都去掉了嘛，原来是‘毛泽东错误的认为’什么什么，他都说‘毛泽东认为’，就是毛泽东所有的东西都是正面的。”\n\n**宋永毅：习近平叫大家听话，毛泽东叫大家造反，如果“文革”重来不会像过去一样**\n\n主持人：“现在在民间都会有一种担心担忧，说‘文革’重来，但是您刚才以上的观点我听出来，对于说如果‘文革’重来……一个是，会不会？还有一个就是，如果来了以后，也会变成闹剧，您不认为那个‘文革’真的会重来，或者像过去一样？”\n\n宋永毅：“像过去一样不可能了。为什么呢？因为很简单的事情就是，毛和习的立场不一样。习近平是要叫大家听话，听他的话，拥护他作为伟大领袖；那毛泽东是叫大家要造反，为什么呢？因为毛泽东当时……就是那句话嘛，就是‘错误估计’嘛，他就是把敌人的力量估计得非常之大，然后毛泽东自己又有一套要在思想上改造整个民族的计划。那个独裁者就很危险，有那套就很危险。\n\n那么，习近平也想作毛泽东，但是习近平哪是一个什么思想家，他拿不出什么思想的东西。所以你要‘文革’像以前那样的发生啊什么，那个不太可能。\n\n习近平……老实讲他最怕的是群众运动，因为群众运动要成立什么‘造反派’什么……那还不反到他头上去了？所以他是不想叫人家造反，不想叫人家成立群众组织，他要叫人家听话。”\n\n**宋永毅：你看看天安门上毛泽东像没有拿下来，那你怎么能够说“文革”结束了呢？**\n\n宋永毅：“但是这不等于说习近平没有继承和发扬‘文革’的东西。\n\n比如说，毛泽东‘文革’建立了他一个人对整个政治局的专政，你看中央文件‘文革’中间都是‘根据毛泽东同志提议，打倒邓小平’，‘根据毛泽东同志提议’谁谁谁担任什么职务……根本那个政治局是不讨论的，没有集体领导的。\n\n老邓虽然说他后来也是搞独裁，但是他毕竟还是发了好几个文件，要集体领导。习近平不是这样，所有的政治局常委都要向他述职，就他是老板啊。所以这个一句话了。\n\n就像美联社记者采访我，说‘文革是不是结束了？文革的事……’\n\n我说‘你看看天安门上毛主席像拿下来了没有？’\n\n他说‘没有啊’。\n\n我说‘那你怎么能够说文革结束了呢？’（笑）\n\n这些东西都给习近平、薄熙来他们继承下来了，因为他们需要那个东西才能维持他们的利益，才能维持他们的政权。”\n\n**宋永毅：希望“文革”悲惨灾难历史不要重演，但我们对历史可能的反复性估计不足**\n\n宋永毅教授在“心灵之旅”的“文革”爆发五十周年专题节目中受访时说过：“第一个就是，我对习近平从来不看好，发过好多文章说他这个人不行。第二呢，那个时候对历史可能出现的反复性，以及历史在一段时间之内的停滞，甚至某些程度的上的倒退，已经有自己的看法了。\n\n因为研究历史的人主要还是对历史的研究，说到‘以史为鉴’，无非就是希望这么悲惨的灾难历史不要重演。当‘文革’刚刚结束时，我们这一代人非常有信心，觉得从此以后中国就会走向完全不同的世界。\n\n那么当‘六四’发生了以后，可以说我们这一代人的信心基本上被摧毁了百分之六十。\n\n当‘六四’以后，我们这代人还有的信心是什么呢？那就是‘进化论’意义上的信心，就是相信‘下面一代执政……到第一代老共产党人他们走掉以后，可能下一代人会超过第一代老共产党人。’\n\n那么今天这个信心随着习近平的出现……习近平还没上去，我就预料到这一点了，那时候因为有警觉了。因为‘六四’这种事情的发生，就是你不能够认为‘下一代一定比上一代好’。我看习近平就比胡锦涛要差，比江泽民也差，比邓小平也差。所以我刚才讲了，就是说我们这代人对历史可能的反复性估计不足。\n\n我们这代人实际上以前都是比较乐观的一代。你看两个——‘文革’那么大的错误，那觉得总归是好了吧；‘六四’又来了，那已经不行了；现在再来一个习近平，更觉得这个历史实在也是出于我们这些历史学家研究的……它常常给我们惊奇，没有办法。”\n\n**宋永毅：良知要求我们必须告诉这个世界“文革”真相，“文革”再也不能重复了！**\n\n主持人：“在这个过程中，人对历史的影响，或者说人的聚合的力量能不能对历史发生什么作用？”\n\n宋永毅：“比如说美国总统，当然会对历史可以发生很大的影响（笑）。对吧？整个欧盟的那个主席，或者怎么样……像我们这些文人，像我们这些一般的知识分子等等，我们所能起的作用是很有限的。\n\n但是既便这些作用有限，我们的良知还是要求我们必须要做——比如说，我们今天还是要总结‘文革’的教训，我们今天还是要用我们微弱的声音告诉这个世界，尤其是告诉我们中国这个民族——‘文革’那套东西，我们再也不能重复了！我们要告诉他们历史的真相。\n\n但是，这些抵抗是不是就能够扭转乾坤？比如说把习近平那套拉下来，恐怕很难。但是，是不是作为一个历史的合力，它会在一定的程度上发生作用？会的。\n\n所以我刚才讲了，这个是我们的良知，或者说我们的职责。但是，它能起多大的作用？我们不去管。我们要不要做？我们一定要做。\n\n这是我们对历史的一份责任。”"
		},
		{
			"post_id": 28,
			"title": "王立雄: 世俗化政策的反效果",
			"date_published": 1517452213.047,
			"body": "推进世俗化是中国当局在藏区实行的重要政策，以追逐利益和现世享乐取代民族意识和宗教追求。这一点去拉萨旅行的人都会留下深刻印象，那里的灯红酒绿、人欲横流与中国内地没有两样，已经找不到多少圣城的感觉。\n\n---\n\n世俗化立足于市场经济，有追逐金钱的渠道才有沉溺消费的可能。藏区向市场经济转型比汉地晚十年左右。上世纪八十年代中期前，毛时代的政治挂帅和阶级斗争等未退出舞台，还能压住民族问题。从八十年代中期到九十年代后期，毛的一套失效，市场经济转型还未铺开，等于失去旧的手段，尚未掌握新的手段，所以那时民族问题凸显，藏人的意识被重新复兴的宗教信仰和民族主义充填，当局只能用政治高压加经济援助的方式被动应对。\n\n从上世纪九十年代后期开始，藏区开始有了越来越多的市场化成分，当局因此获得利用世俗化消解宗教和民族主义的手段。藏人原本躁动不安的民族抗争一度出现消解趋势，对金钱和利益的追逐变成主导。政治高压只能损坏藏民族的机体，世俗化却能腐蚀藏民族的灵魂。\n\n然而民族冲突却没有因此得到解决，旧矛盾被新矛盾取代。市场经济带来人口自由流动和经济自由竞争，一旦汉人移民大量进入世俗化藏地，世俗化的藏人就会出于世俗化原因再度强化民族意识，形成新的民族冲突。\n\n新疆的市场经济转型比西藏早，维吾尔人的经商意识比藏人强，但是当局却不能利用世俗化消解新疆的民族问题，反而随市场化进程更趋严重。这是因为新疆汉人占当地人口百分之四十，掌握主要资源和权力。他们从市场经济发展之始就拿走了主要份额，占据主要机会。这里有当局的有意为之，也有市场经济的规律。既然新疆的市场绑在中国内地经济体系上，汉人的语言、人脉、经营方式比当地民族有优势，必然占上风。\n\n市场经济一旦有了民族区分，就不再有消解民族矛盾的作用，反而会制造新的民族矛盾。此前的民族矛盾集中于历史和相对抽象的是非，和百姓的日常生活距离较远，主要被民族精英关注。市场经济的矛盾却摆在了每个普通百姓眼前，充斥着现实生活的细节，因此能够激发更为普遍的民族情绪。\n\n藏地和新疆的区别在于，市场经济发展前西藏汉人少，人口主体是藏人，因此在市场经济转型初期，藏人能控制较多的份额和资源，也能获得机会和职位。待汉人大批进入西藏，开始多数是包工打工，做建筑工地、蹬三轮、开饭馆、养猪种菜等藏人不做的活。藏人当雇主或被服务的对象。在那种阶段世俗化政策是有效的，从市场经济中得到好处的藏人可以把民族问题搁置一旁。\n\n然而汉人在市场竞争中一是拥有语言、人脉的优势，文化中的逐利性也比藏人高；二是进藏汉人多有藏地汉人官员的关系，非亲即友，较多得到权力的庇护和便利；三是藏地一旦开始有钱可挣，便吸引更多能量大的汉人前来，于是西藏便出现类似新疆的状态——当地民族被排挤到市场经济的边缘，日益变得劣势。这种情况下，民族矛盾必然重新激化，甚至更加严重，导致十年前由拉萨“314事件”引发的抗议运动遍及西藏及各省藏区。"
		},
		{
			"post_id": 27,
			"title": "关于中共与宗教的讨论",
			"date_published": 1515632519.639,
			"body": "====================\n\n**Nassau**: 中共在打压境内的宗教活动, 持续打压的证据也比较多, 但目的是什么呢?\n\n---\n\n**Fengyun666**: 这是好事，呵呵。这件事情支持中共。只怕这种事不太像是真的。会打击佛教么？呵呵。\n**Nekocross**: 因为绿了\n**Pakistan**:不能出现任何一个组织有能力反抗中共，特别是基督教。\n**Mv0**:又何止打壓宗教呢\n**Holysky**:蒜头建筑可没少盖\n**Nekocross**: @Pakistan: 绿教除外\n**Nassau**:我的理解是共产党是对任何不在自己控制下的组织形式都是深怀戒备的, 宗教是比较顽固的一种, 而且压制宗教在国际上名声不好, 所以搞得有时缩手缩脚但又不甘心. 包子比较牛逼就下手重些, 不过这也是中共一贯的宗旨之一\n**Nassau**:@Fengyun666: 对于佛教的压制,我说这两点你看算不算:寺庙商业化/ 西藏寺庙里设置派出所\n**Nassau**: @Dray: 回到对信仰的定义上,我以为至少有这样一条: 信仰是即使面对阻碍和挫折,依然不会动摇的才算得上. 当然能坚守于多大的逆境,这是信仰的坚贞程度问题了. 对于独裁,独裁者自己当然是会不顾一切维护自己的地位,但他周边的人,多半有机会一定会取而代之(基于血统传承的帝位与这个不同,得另说),所以独裁算不上信仰\n\n==============================\n\n**Nassau**: 我想知道为什么大陆那么多人对宗教反感, 是因为从小接受的无神论教育的原因么?宗教在人类社会发展过程中可以说产生了极大的影响(不敢说这影响是好是坏),其实完全无法想象没有宗教现在的人类是什么样,那为什么要鄙视宗教?这与鄙视祖先似乎也可以相提并论.\n猫叉酱（小号）:我想知道为什么世界上那么多人对独裁反感, 是因为从小接受的民主教育的原因么?独裁在人类社会发展过程中可以说产生了极大的影响(不敢说这影响是好是坏),其实完全无法想象没有独裁现在的人类是什么样,那为什么要鄙视独裁?这与鄙视祖先似乎也可以相提并论.\n**Joker1024**:你才奇怪，为什么把功劳都归结于宗教呢，宗教最大的问题是要求你无条件地相信某个教条或某个神，剥夺质疑这是最要命的，人们若信得深了，甚至杀人的原因仅仅是因为两个人想法不一样，还觉得自己很正义。\n**Nassau**: @猫叉酱（小号）: 那人权宣言里宗教自由那条, 可以替换为独裁自由么? 你觉得人权宣言里保留这个的阴谋何在呢?\nNassau: @Joker1024: 我没这样的意思: 功劳都归于..., 只是现在秩序的形成, 离不开宗教的极大影响, 各种秩序, 有野蛮的,有文明的, 也许以后这个野蛮文明会重新定义\n**Pakistan**: 宗教就是信仰。就是你相信什么。所以从广义上说，党派也是宗教，宗教多以神作为信仰，而党派是以达到某种社会状态为信仰。无神论也是一种信仰，就是相信没有神。每种宗教说是不干涉另一种宗教，实际宗教之间注定是不相容的。\n猫叉酱（小号）: @Nassau: 当然可以咯，那么多小粉红自甘被中共独裁当然是他们的自由\n**Dray**:@Nassau: 信仰独裁不也是一种信仰嘛，就像信仰党国一样。严格来说，党员是不能信教的吧，因为他自己就是个宗教。特指独裁党派。\nNassau : @猫叉酱（小号）: 这还是有区别的,信仰自由是都写在宪法里的,可没谁把独裁写在里面,他们只会拐弯抹角的歌颂领袖英明,也不好意思说独裁万岁\n**Nassau**: @Dray: 独裁应该不算信仰, 权力倒是,他们崇拜的是权力,这个导向独裁.稍微有点理智的人都知道独裁的危险,只是权力崇拜利益纠葛内心懦弱,使自己裹挟其中不能自拔\n\n=================\n\n[Nassau](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1M6V4wECbz5e1aUmuij2BB72ensHCYNFmd/nassau@zeroid.bit): 中共对社会非党组织的严防死守,目标依然是防止造反,这个统治模式与满清帝国并无本质上的区别.再回头看看中共如何在苏联的支持下夺取政权的历史(中国近现代史(徐中约),蒋介石和现代中国的奋斗),以及当下毫无政治权利的现实,我认为天朝p民依然还是亡国奴的身份"
		},
		{
			"post_id": 26,
			"title": "华盛顿邮报：伊朗抗议可以借鉴阿拉伯之春的哪些教训？",
			"date_published": 1515050282.32,
			"body": "（博谈网记者赵亮编译）本文译自《华盛顿邮报》1月2日刊登的Marc Lynch的文章，题目为“伊朗抗议可以借鉴阿拉伯之春的哪些教训”。以下为文章译文。\n\n伊朗各地近日爆发的抗议活动引起了这可能是革命性变革的巨大兴趣。这场自2009年绿色运动以来最大规模的示威游行几乎让所有观察家惊讶。它们是在周边地区而不是在（首都）德黑兰爆发的，并一直是由劳工阶级和较低级别的伊朗人主导，而不象2009年的示威是由城市受过教育的中产阶级推动。在近日的抗议中，喊出的口号显然是革命性的，而不是改革性的。\n\n---\n\n这些抗议活动之迅猛及覆盖范围震惊了经验丰富的伊朗观察家。重要的是要认识到，对于这些抗议仍有许多不确定性，包括它们真正的规模、持久度、领导层和政治抱负。\n\n虽然这种热情可能部分是一厢情愿的想法，但也明显形似2011年阿拉伯起义所经历的。尽管经济和政治上的不满情绪高涨，也没有人预料到民众动员的浪潮，也极少有人预料到会在埃及和突尼斯推翻根深蒂固的独裁者。在过去的七年里，众多学者撰写了关于2011年阿拉伯之春及其后果的文章。从2011年的阿拉伯经验中可以得出什么教训呢？\n\n以下是阿拉伯起义的一些初步教训：\n\n**1、革命的时刻各有自己的逻辑……但不会持久**\n\n突然爆发的民众动员常常是不可预测的。在阿拉伯的例子中，和在伊朗一样：积聚多年的不满情绪高涨：经济衰退、治理失败、精英腐败、精英内斗、傲慢的军队和不受欢迎的外交政策。面对似乎势不可挡的政府势力，活动人士反复发起大规模抗议的努力一再失败。起义者们的突然成功让活动人士和其他人同样感到惊讶。\n\n民众动员在本国乃至各国之间迅速蔓延，远在也门和叙利亚的抗议者们受到了半岛电视台和Facebook上突尼斯和埃及场景的启发。阿拉伯地区的起义以及他们强有力地呼唤自由和社会正义让他们看上去站在了历史正确的一方。到目前为止，在伊朗，尽管受到强烈的审视和媒体关注，但这些新的抗议活动还没有在国外传播。\n\n在突尼斯和埃及，成功的动员创造了新的政治现实，因为人们突然看到了此前似乎完全不切实际的政治变革的可能性。\n\n在革命的时刻，通常的政治规则似乎被中止了。大批以前在政治上默默无闻的人走上街头；长期的对手在共同战斗的时候形成联盟；长期存在的精英们突然感到自己的生存前景不明。在这些时刻，意图、期望和渴望可以迅速转变：起初的经济抗议可能成为要求政权更迭；起初的呼吁选举可能变成要求革命性变革。\n\n不过，抗议者们在与时间赛跑。意想不到的起义给政治体系造成巨大震动。在突尼斯和埃及，街上挤满的大批民众形成不可抗拒的压力，迫使长期执政的总统在不到三周内下台。但是，无限期地维持动员是很困难的。最初的乐观情绪会消退，难以一直保持非暴力，政治抱负出现分歧。抗议者们有一个相对狭窄的窗口，来使该政权显得不可能生存下去，来说服中产阶级和精英阶层来支持他们的事业，并迫使出现终局。\n\n因此，那些政权有各种动机采取任何必要的手段等待洪水退去，生存下来。几乎所有经受住2011年民众动员的阿拉伯政权都依然在位。巴林的政权通过外部支持、大规模暴力镇压和后续的宗派报复运动而得以生存。约旦和摩洛哥的国王通过改革宪法、选举和选择性的镇压来满足民众要求。叙利亚政权在伊朗的帮助下对其挑战者进行了一场残酷的战争。对于伊朗政权，这些教训同样适用，因为伊朗象中东其他政权一样，把自身的生存看得高于一切。\n\n**2、抗议者必须赢得更广泛的支持方能胜利**\n\n把巨大数量的非积极分子带上街头，阿拉伯之春的起义产生了巨大的能量。例如在埃及，年轻的活动人士在2011年之前一直以创造性的方式抗议了十年，但他们自己无法对政府构成严重威胁。\n\n有证据表明伊朗的抗议规模和可能的覆盖范围令人震惊，但不大清楚是否有新的选民加入这场挑战。在地理分布上，伊朗人的抗议令人印象深刻，但与阿拉伯之春早期的起义或与2009年的伊朗绿色运动相比，其人数似乎颇少。\n\n在突尼斯，抗议开始于被忽视的南方，但迅速蔓延进入首都，并得到了强大的民间社会组织的支持。到目前为止，伊朗的抗议似乎是无领导的，集中在青年和下层工人阶级，与正式的政治分离，也脱离了既定的公民社会。这对伊朗改革派和民间社会活动家提出了挑战，他们不确定这些新的抗议者的身份和愿望。\n\n**3、军方的选择通常是决定性的**\n\n关于阿拉伯起义的大量研究集中在各个军方不同的反应上。在突尼斯和埃及，军方推动了总统离职，而在也门，军方使得政治瘫痪了数月，在利比亚几乎从一开始就爆发了内战。\n\n然而，在其他大多数阿拉伯起义中，军方仍然是忠于政府的。\n\n**4、社交媒体喜忧参半**\n\n来自伊朗的抗议视频迅速扩散，类似于阿拉伯起义更具象征性的特征之一。\n\n智能手机，无处不在的视频，电报和社交媒体几乎在世界各地促成了突然、迅速、出乎意料的抗议动员。它们能够协调和传播抗议方法和口号，并让示威者向国际社会传达信息。\n\n但社交媒体也充斥着抗议运动的弊病。社交媒体倾向于制造出信息泡沫，这在短期内可能会增强力度，但是会在后期推动两极分化。更重要的是，社交媒体可以传达高度误导性的事件印象，特别是当现场没有新闻记者能提供事实核查时。\n\n（译文有删节）"
		},
		{
			"post_id": 25,
			"title": "美国之音：老大哥来了",
			"date_published": 1515049243.444,
			"body": "英国作家乔治·奥威尔在他1949年出版的小说《1984》描述了一个噩梦般的集权社会，那里的集权政权老大哥（Big Brother）为了维持和巩固其凌驾社会的绝对权力，对社会成员实行全方位的监控，不但监控他们的行为，也监控他们的言论，还监控他们的思想。\n\n---\n\n在《1984》这部反乌托邦（即理想社会乌托邦的反面）小说所描写的那个噩梦般的集权社会中，老大哥是掌控社会的权力集团永远正确的最高领导人，他不知在何方又无处不在。他总是那张表情，那副神秘的笑脸，人们永远在他的视线之下；在那个国家，一种类似于电视机一样的监控器无处不在，一方面为老大哥做宣传，一方面监控着人们的一言一行，一举一动。\n\n令人生疑的世界第一\n\n如今，中华人民共和国已经被中国国内外许多观察家普遍认为是一个最接近于《1984》所描写的那个噩梦般的集权统治登峰造极的国家。\n\n不过，在观察家们看来，对社会大众的监控如今不仅仅是中国的问题，而是一个世界性问题。\n\n在西方国家，计算机和人工智能技术的日益发达首先给了技术公司庞大的监控能力，使它们得以掌控用户的种种隐私信息以便进行更有针对性的广告投放。随后，政府利用这种技术对公民进行监控。\n\n但在西方民主国家，政府对公民的监控至少在理论上、而且也常常在实际上受到法律和选民及其代表的挑战和制约。因此，西方国家的政府不能用非法监控得来的信息抓捕公民，给公民定罪判刑。\n\n然而，在实行共产党一党老大哥统治的中国，政府可以任意调遣任何资源对公民实行全方位的监控，以非法得来的得来的信息抓捕公民，给公民定罪判刑。为了方便掌权的中共监控公民，中共也可以操纵它掌控下的中国名义上的最高权力机构十拿九稳地制定和通过中共所需要的任何恶法，从而使“法治”也变成了噩梦。\n\n总而言之，网络监控如今虽然在世界各国多多少少都存在，但在诸多观察家看来，中国的网络监控之所以最受关注，是因为中共当局在网络监控方面所投入的人力物力大大超过全世界任何国家，绝对是名列世界前茅。\n\n与此同时，中共当局在肆意践踏法律或随意制定恶法以实行对公民全方位全天候一天二十四小时不间断监控的意愿和能力方面也是世界第一。\n\n噩梦般的监控无处不在\n\n中共政权对中国公民言论的监控主要是通过勒令中国的技术公司充当政府的监控工具、通过技术公司进行的。\n\n在中国国内，这种监控通常是政府当局和政府控制的媒体所回避的话题。但在本星期一，这种监控成为意外的话题。\n\n中国吉利汽车公司董事长李书福星期一（1月1日）在珠海的一个商业论坛上公开表示对网络监控感到不安。他说：“（腾讯公司首席执行官）马化腾肯定天天在看我们的微信。因为他都可以看的，随便看，这些问题非常大。”\n\n腾讯微信官方星期二发表声明否认李书福的上述说法，声言“传言中所说‘我们天天在看你的微信’纯属误解”；微信不留存任何用户的聊天记录，聊天内容只存储在用户的手机、电脑等终端设备上，而且“微信不会将用户的任何聊天内容用于大数据分析”。\n\n然而，腾讯的这种否认显然是与中国现行的法律不符，也跟微信自己发表的有关隐私权的政策不符。中国去年6月开始实行的网络安全法要求网络运营者监测和记录网络运行状态、“留存相关的网络日志不少于六个月”，并对“重要数据”进行备份和加密。\n\n路透社星期三报道说，“跟中国所有的社交媒体平台一样，微信被要求对中国所认为的‘非法’信息实行审查屏蔽。微信的隐私权政策说，微信可能需要保存和透露用户的信息，以回应政府当局、执法部门或相关机构的要求。\n\n“微信没有就路透社所提出的发表进一步评论的要求做出回应。\n\n“人权组织国际特赦发表的一份报告说，在全世界11个用户最多的经营信息应用的技术公司中，微信在使用加密技术保护用户隐私权方面名列倒数第一。”\n\n日本公共电台电视台NHK星期三报道说，“在中国，政府对互联网的管控不断收紧，从去年开始用户个人组成的聊天群也成为管控的对象。\n\n“在这种大背景之下，在微信发表（没有存留用户的聊天记录的）声明之后，许多网民发帖表示‘不能相信’，从而凸显出中国人对政府和技术公司监视他们的通信感到不安。”\n\n老大哥与资本主义结合\n\n中共当局依赖必须听命于当局的技术公司对中国公民进行《1984》式的监控，侵犯公民隐私，剥夺公民自由。\n\n在许多观察家看来，其中首屈一指的公司就是腾讯公司。腾讯（以及中国其他技术公司、互联网门户网站）的运营模式也符合奥威尔在《1984》里所描写的老大哥的监视器，即一方面为老大哥做宣传，另一方面又为老大哥监控社会成员。\n\n于是，在世界媒体和中国千百万网民看来，腾讯发表声明声言没有监控网民是一种大胆得惊人的颠倒黑白，因为就在2017年年底，腾讯还因为将在广州率先试验推出将微信面部识别与身份验证捆绑的项目而成为世界新闻。\n\n英国《金融时报》在2017年12月27日发表一篇报道，介绍了腾讯的这种为中共老大哥监控中国公民（以及在中国的任何人）的先进技术及其实施计划，以及腾讯这个中共老大哥的驯服工具如何得益于自由资本主义的怪异现象。\n\n《金融时报》报道的标题是，“中国公布与腾讯微信捆绑的数码身份证制度”；副标题是，“这一项目将进一步把9亿零200万用户纳入腾讯覆盖范围极广的技术生态系统”。报道说：\n\n“中国最大的城市之一将准许居民通过面部识别把他们的全国性的身份证号码与无处不在的手机移动通信和社交媒体应用腾讯捆绑，从而进一步把中国的消费者纳入腾讯的技术生态系统。\n\n“中国官方的新华社报道说，南方沿海省份广东省省会广州市当局宣布广州南沙区本星期推出试点项目。下个月，这一项目有可能推广全国。\n\n“2011年起步的微信是一个移动通信平台，但后来扩展进社交媒体，可以通话，进行云储存，在线购物和金融服务，包括手机支付。\n\n“腾讯有能力利用微信每日平均九亿二百万用户的数据生财，投资者对此看好，腾讯公司的股市市值自2017年以来翻了一番以上。其股值上个月一度段时间超过脸书。但是，分析家们依然担心腾讯缺乏资产多样化。\n\n“隐私权倡导者对腾讯这样的私营技术公司和中共的关系越来越紧密感到担心。中共当局操控着庞大的监视和信息审查屏蔽体制。微信对政治敏感信息和社交媒体内容实行审查屏蔽，并按照指令跟警方分享用户身份信息。\n\n“在微信上匿名已经不存在。中国当局自2013年逐步引入手机电话实名制，所有的微信账户必须跟手机号码捆绑。”\n\n当局如何变成了老大哥\n\n显然，当今中国实现奥威尔在《1984》描写的集权政权全方位监控人民方面走在全世界的前面，而且其进度惊人。\n\n1月2日，法国公共广播电台网站FranceInfo发表报道，标题是，“中国当局如何变成了老大哥”；副标题是，“现在已经不可能在中国逃避录像监控”。报道说：\n\n“中国拥有全世界最大的视频监控网络，在2017年每8个居民就有一个监控摄像头监控。到2020年每两个居民就可以摊上一个摄像头。\n\n“这些摄像头不仅是摄像，而且北京在面部识别方面也走在前头。\n\n“中国政府希望在人工智能领域领先全世界。而中国警方更是在前沿。在去年12月上旬，中国警方根据英国广播公司记者约翰·萨德沃斯提供的一张他自己的照片在7分钟之内就锁定了他的行踪。\n\n“支持全方位监控的人认为，这种技术可以使生活变得更舒畅，更安全。批评者则认为，这是对14亿中国人的进一步监控，而中国人已经生活在信息封锁和警察高压之下。”"
		},
		{
			"post_id": 24,
			"title": "保留几个网页201712",
			"date_published": 1512094705.076,
			"body": "这个blog基本也就是半死的状态, 但平时保存一些记录是放到google keep上的, 但翻墙总是很慢, 不是很方便. 一些不涉及个人的东西保存到这里也不错.\n\nnetty一些性能调优相关的文章, <netty系列之netty百万级推送服务设计要点>[http://www.infoq.com/cn/articles/netty-million-level-push-service-design-points](http://www.infoq.com/cn/articles/netty-million-level-push-service-design-points)</netty系列之netty百万级推送服务设计要点>\n\nstanford 分词器: [https://nlp.stanford.edu/software/segmenter.shtml](https://nlp.stanford.edu/software/segmenter.shtml), 从这个文章链接过去的： [http://www.52nlp.cn/python%E8%87%AA%E7%84%B6%E8%AF%AD%E8%A8%80%E5%A4%84%E7%90%86%E5%AE%9E%E8%B7%B5-%E5%9C%A8nltk%E4%B8%AD%E4%BD%BF%E7%94%A8%E6%96%AF%E5%9D%A6%E7%A6%8F%E4%B8%AD%E6%96%87%E5%88%86%E8%AF%8D%E5%99%A8，](http://www.52nlp.cn/python%E8%87%AA%E7%84%B6%E8%AF%AD%E8%A8%80%E5%A4%84%E7%90%86%E5%AE%9E%E8%B7%B5-%E5%9C%A8nltk%E4%B8%AD%E4%BD%BF%E7%94%A8%E6%96%AF%E5%9D%A6%E7%A6%8F%E4%B8%AD%E6%96%87%E5%88%86%E8%AF%8D%E5%99%A8，) 使用python处理自然语言 NLP\n\n  在尝试自己编译安装tidb, zhanglei,zhanghr提出应该尝试使用一下这个产品, 提供了mysql的接口但是能够横向扩展能力(存储 算力),  还没有完成, 按照说明直接安装有些问题, 本地主机没有连接internet, 下面记录下自己编译的过程:\n  1\\. 编译tidb-server,  pd, 这两个是完全golang实现的, 编译只需要go1.9.2, 下载路径: github.com/pingcap/tidb github.com/pingcap/pd, 分别按照完整路径放到$GOPATH/src 下, 并进入对应路径执行 make就可以了, 生成文件在各自的bin目录下\n  2\\. 安装 rocksdb,  [https://github.com/facebook/rocksdb/blob/master/INSTALL.md](https://github.com/facebook/rocksdb/blob/master/INSTALL.md)  安装方法参考, 执行命令: PORTABLE=1 make shared_lib\n  3\\. tiKV 是rust实现的, 先下载rust: rust-lang.org/后安装,  这里是编译方法:  github.com/pingcap/docs/blob/master/dev-guide/development.md"
		},
		{
			"post_id": 23,
			"title": "纽约时报： 如何让你的大脑青春永驻",
			"date_published": 1506764112.689,
			"body": "想一想你生活中的那些年龄不低于65岁的人吧。他们中的某些人正面临在老年群体中颇为常见的精神障碍，比如健忘或者注意力集中的时长变短。但其他一些人则以某种方式成功地保持了头脑的敏锐。我的公公是一名退休医生，现年83岁的他仍然在做图书编辑工作，并运营着几个医学网站。\n\n为什么一些人老年时思维依旧敏捷，另一些人却每况愈下呢？“超级老人”（Superager，由神经学家马塞尔·梅苏拉姆[Marsel Mesulam]造出来的一个词）是指记忆力和专注力不仅超出老年人的平均水平，还与健康活跃的25岁年轻人不相上下者。我和麻省总医院(Massachusetts General Hospital)的同事们[最近对超级老人做了研究](http://www.jneurosci.org/content/36/37/9659 \"Link: http://www.jneurosci.org/content/36/37/9659\")，以便弄懂他们何以有这样的表现。\n\n---\n\n#### 我们的实验室使用功能性磁共振成像扫描并对比了17名超级老人和其同龄人的大脑。我们成功地确认了把两个群体区别开来的一组脑部区域。年龄相关性萎缩会让普通老年人脑部的这些区域变得较薄，而超级老人脑部的这些区域与年轻的成年人别无二致，似乎没有受到时间的摧残。\n\n大脑中这类至关重要的区域都是哪些呢？如果你让大多数科学家猜猜看，他们可能会提到大家心目中的“认知性”区域或致力于思考的区域，比如外侧前额叶皮质。但我们发现并非如此。几乎所有的一切都和“情绪性”区域有关，比如中扣带皮质和前脑岛。\n\n我的实验室并未对这一发现感到惊讶，因为我们看到，现代神经科学已经打破了人们关于“认知性”和“情绪性”脑部区域之间存在差别的错误认知。\n\n这种差别是在上世纪40年代进入人们视野的。当时，一位名叫保罗·麦克莱恩(Paul MacLean)的医生设计了一个共有三层的人类大脑模型。古老的内层承袭自爬行动物，被认为包含着关乎基本生存能力的神经回路。中层是“边缘系统”，被认为包含着承袭自哺乳动物的情绪神经回路。最外边的一层据说掌管着为人类所独有的理性思维。麦克莱恩医生把这个模型称作“三重脑”。\n\n三重脑开始在媒体界、商界和某些科学圈子里流行开来（至今依然颇有市场）。但研究大脑的专家早在数十年前就对它提出了质疑。人类的大脑并非沉积岩，其进化也不是认知成熟度随着时间的推移逐层缓慢累积的过程。相反（用神经科学家耶奥格·施特里特[Georg Striedter]的话说），大脑是像公司一样进化而成的：它们一边拓展，一边重组。人们现如今已经知道，麦克莱恩医生眼中掌管情绪的脑部区域，比如“边缘系统”内的区域，是脑内常规通信的[主要中枢节点](http://www.jneurosci.org/content/33/36/14489)。除了情绪，它们还关乎[很多重要功能](http://www.affective-science.org/pubs/2013/barrett-and-satpute-con.pdf)，比如语言、压力、内脏器官的调节，甚至关乎把五种感官体验协调融汇成一种综合性体验。\n\n现在，我们的研究显示，这些主要的中枢区域对于超级老人的表现极具意义。这些区域越厚，受试者在参加记忆力和注意力测试时，比如记住一长串名词并在20分钟后加以复述，表现得就越好。\n\n当然了，关键问题是：如何才能成为超级老人？如果有些行为能增加你在上了年纪以后保持头脑敏锐的机会，那它们是什么？我们仍在研究这个问题，目前所能给出的最佳答案是：努力做点儿什么。很多实验室都已注意到，当人们执行困难的任务时——不论是需要付出体力还是脑力——这些关键的脑部区域的活动都会增加。因此你可以通过剧烈运动和大力用脑来帮助这些区域维持其厚度。举个例子，我公公每天都会游泳，还喜欢参加桥牌比赛。\n\n不过，变成超级老人的道路并不平坦，因为这些脑部区域有另外一个有趣的属性：当它们的活动增加时，[你会觉得非常糟糕](https://www.ncbi.nlm.nih.gov/pubmed/25631056)——疲惫，为难，沮丧。想想你上一次绞尽脑汁地做一道数学题或者挑战体力极限的情形吧。努力做事会让你在当下不太好受。海军陆战队(Marine Corps)的一句格言很好地体现出了这一原理：“疼痛是虚弱离开身体的表现。”也就是说，运动带来的不适意味着你正变得更强壮、更有纪律性。超级老人就像海军陆战队员一样：他们善于承受付出巨大努力所带来的暂时的不快。[一些研究](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3951958/)显示，其结果是拥有更加年轻的大脑，有助于保持敏锐的记忆力以及更强大的注意力。\n\n这意味着数独之类令人愉悦的谜题游戏还不足以让你享有成为超级老人的好处。各种“益智游戏”网站上的那些颇受欢迎的玩乐也不行。[你必须付出足够多的努力，直到会在心中默念“可恶”的程度](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4348332/)。要做到觉得受了伤害为止，然后再多做一点。\n\n在美国，我们对幸福感分外着迷。但研究显现，随着年龄的日益增长，人们会通过回避令人不快的境况来制造幸福感。有时，这堪称一个好主意，比如在避开粗鲁邻居的时候。但如果不停地回避与脑力活动或者体育锻炼相伴而生的不快，这种抑制就会对大脑造成损害。疏于使用会让脑组织变薄。如果不用它，你就会失去它。\n\n所以，投入到一件具有挑战性的事情中去吧。学一门外语。参加在线大学课程。熟练掌握一种乐器。让大脑动起来。让这一年成为值得铭记的一年。\n\n原文： https://cn.nytimes.com/opinion/20170104/how-to-become-a-superager"
		},
		{
			"post_id": 22,
			"title": "转：重庆教师多年调查土改真相，十九大前突遭开除",
			"date_published": 1506668552.077,
			"body": "[https://cn.nytimes.com/china/20170929/cc29-tansong/](https://cn.nytimes.com/china/20170929/cc29-tansong/)\n\n新学期开始，原重庆师范大学涉外商贸学院副教授谭松正式办理了离校手续，从此告别站了多年的讲台。9月9日教师节前夕，他在自己的微信公众号上发布了7月初写好的[一篇文章](https://commondatastorage.googleapis.com/letscorp_archive/archives/123009)，关于当天他得知自己被学校解聘的心情，那一天，他突然接到一个辅导员的电话，说他被开除了，让他去办手续。谭松曾经多次因从事红色历史调查研究而出事，对自己今年被开除并不感到意外。“其实，我不应对学校有丝毫怨言，相反，我应当感谢学校——直到现在才开除我。”\n\n在10月召开十九大的前几个月，[中共整肃高校教师之风再起](https://cn.nytimes.com/opinion/20170810/china-punished-professors/?mcubz=1)，谭松是继北京师范大学副教授史杰鹏之后，又一位因言论不当而被解职的大学教师。在重庆师范大学教西方文化的谭松认为，自己被开除，不仅是因为他在课堂上牵扯到历史与新闻的讲话偏离了“正确路线”，背离如今日益严格的党性原则，更与自己近年对于1950年代川东土改所进行的调查研究有关。\n\n---\n\n*   <a dhref=\"https://static01.nyt.com/images/2017/09/27/universal/cn29-tansong2/cn29-tansong2-popup.jpg\" dwidth=\"643\" dheight=\"500\">查看大图</a><a dhref=\"https://static01.nyt.com/images/2017/09/27/universal/cn29-tansong2/cn29-tansong2-popup.jpg\" dwidth=\"643\" dheight=\"500\">![谭松采访著名地主刘文彩的长工龙万福。2009年8月，摄于四川省大邑县苏家镇虹桥村。](https://static01.nyt.com/images/2017/09/27/universal/cn29-tansong2/cn29-tansong2-articleInline.jpg)</a>\n\n    Courtesy of Tan Song\n\n    谭松采访著名地主刘文彩的长工龙万福。2009年8月，摄于四川省大邑县苏家镇虹桥村。\n\n#### 相关文章\n\n*   [中共整肃高校教师之风再起](https://cn.nytimes.com/opinion/20170810/china-punished-professors/ \"“梁惠王”被解职，中共整肃高校教师之风再起\")\n*   [刘文彩之孙的孤军奋战](https://cn.nytimes.com/china/20160811/cc11chinalandlord/ \"为祖父正名：大地主刘文彩之孙的孤军奋战\")\n*   [遭禁作家方方谈《软埋》的“软埋”](https://cn.nytimes.com/china/20170627/cc27fang-fang/ \"遭左派围攻，作家方方谈《软埋》的“软埋”\")\n*   [中国荒诞的阶级斗争史](https://cn.nytimes.com/opinion/20140318/c18yuhua/ \"中国荒诞的阶级斗争史\")\n\n谭松1955年出生于重庆，1957年，他的父亲、当时任重庆团市委宣传部长的谭显殷到北京参加共青团第三次全国代表大会，在四川代表会上，他说：“这次会缺乏民主。”之后，谭显殷被打成右派，下放到四川东部的一个小县长寿县的长寿湖劳改。当时这里是重庆市的劳改基地，先后接纳了上千名下放干部和上千名出身不好的学生。\n\n谭松1980年代在重庆建筑高等专科学校教书，1990年代先后担任《渝州世界》报主编、《重庆与世界》杂志主编、《中华手工》杂志主编。2000年，他在担任《重庆与世界》杂志主编时做了一期抗战陪都专辑，全面肯定抗战的中心是重庆而不是延安，这与中国共产党所强调的抗战中心和领导者有所不同，这导致了他被迫辞职。\n\n谭松业余时间从事历史研究，先后进行过重庆大轰炸、[地主刘文彩等历史事件](https://cn.nytimes.com/china/20160811/cc11chinalandlord/?mcubz=1)的调查。从2001年起，他花了三年多的时间进行长寿湖右派调查，完成了50万字的《长寿湖》。此书2011年才在美国出版。还未完成时，2002年7月2日，中共当局指控谭松“收集社会黑暗面”，将他以“颠覆国家政权罪”抓捕，关押了32天，此后被取保候审一年。\n\n2003年，谭松开始对川东地区的土改历史进行调查研究。川东地区指的是原四川东部，也就是如今大重庆地区。1950年底到1952年底，与中国其他地方相似，川东也进行了土地改革运动。这一运动被历史学家认为是人类有史以来规模最大的财产重新分配和集体化，中国农村结构进行了一次前所未有的大改造，地主与富农受到严酷的迫害和肉体上的消灭。不过，至今中国官方认为这一段历史是中共建政之初的一大功绩，不容置疑。除开官方叙述外，极少有学者触碰这段历史。\n\n谭松认为，官方的叙述是“洗脑”，他的采访录填补了这段历史研究的空白。他历经14年，遍访川东土改亲历者，写下50余万字的口述史书稿《血红的土地》，将川东土改血腥残酷的真相记录下来。但也犯了官方大忌，与他所做的长寿湖右派研究一样，这本书也无法在国内出版。\n\n2013年，谭松在香港中文大学做了《川东地区的土地改革运动》的演讲，对外公布了部分调查研究成果，引起关注，同时也让谭松受到学校的约谈。2017年4月，作家方方的新小说《软埋》因触及土改而遭到左派围攻，而该故事的背景正是谭松采访的川东地区。6月21日，谭松发表文章《读了“从<软埋>历史原型看方方的反共反革命历史观”之后》为方方辩护，认为小说中谈及的土改情况是基本符合历史事实的，为此，文章特意讲述了一个在土改中被“点天灯”的年轻姑娘的故事。大约两个星期后，谭松得知自己被学校解聘。\n\n为此，纽约时报中文网用邮件和电话采访了谭松。访谈经过编辑和删减。\n\n**问**：你这次被校方解聘，与你为方方小说《软埋》辩护有关吗？\n\n**答**：这肯定是有一定关系的，因为我加入这场论战也给学校带来了很大的负面影响，人们一提到我，就说是某某学校的老师，大量骂我为地主翻案的人士还义愤填膺地说：“我们的大学怎么会容许这样的教授存在？！”再加上几年前在香港中文大学演讲川东土改，也给学校惹了很大的麻烦，上次（2013年——编注）没开除我就是万幸了，所以，我被开除是同调查土改有关系的。但是校方一直没有给我一个说法，经反复询问，只说是“正常调整”。\n\n**问**：根据你的调查，你是怎么看小说中提到的土改？\n\n**答**：长期以来，执政当局运用强大的国家力量，彻底妖魔化了地主，也打造了一个不真实的“土改丰碑”。大量的文学家、艺术家们根据当局的旨意，编造了大量的谎言，比如四川大邑县刘文彩庄园里的泥塑《收租院》就是一个彻头彻尾的虚假编造。我之所以这样说是有实事根据的，因为我八次到安仁镇（地主刘文彩庄园所在地——原注）采访，采访了还活着的所有刘文彩的长工、佃户、厨师以及几十名相关人士，了解了《收租院》的真相。\n\n方方的小说最可贵也是最有价值的，就是它是这几十年来少有的不是按照官方的调子而是根据历史事实而创作的作品。比如小说中写到的乱打乱杀地主，写到的那种恐怖，都是历史的真实。如果要说我的调查同方方的小说有什么不同的话（不是指文学形式），那就是，川东土改真实的惨烈程度，百倍于小说！\n\n**问**：你为什么会对六七十年前的土改历史感兴趣？它对当下中国有何影响？\n\n**答**：土改对中国的历史进程和社会各方面的影响极其巨大，它不仅改变了中国几千年的土地制度、改变了中国乡村的社会结构和生态平衡，而且改变了人们的价值观甚至基本人性，可以用“天翻地覆”来描述。现在我们面对的不少社会问题，都可以从那场运动中找到原因。我在香港中文大学演讲时，列举了土改造成的十大恶果，比如：它摧毁了中国农村的精英阶层和乡村的文化艺术，让不少痞子型的人登上舞台；它破坏了中国乡村的和谐，使残暴和血腥在中国乡村大行其道；它改变了农村贫富价值观——以穷为荣，以富为恶；它把不劳而获、抢劫瓜分别人财物的土匪行为当作反剥削、反压迫的革命行动。这种作法，既败坏了人心和道德，又为社会的乱象埋下了隐患，等等。这些恶果影响至今。\n\n**问**：你是怎么想到要去做土改调查的？\n\n**答**：在“文革”期间，大约是1969年，刚复课不久的我们被组织到附近的一个生产队接受“阶级斗争教育”——就是参加批斗地主、富农大会。先是唱那煽情的控诉地主的歌曲《听妈妈讲那过去的故事》；接着是声情并茂地宣讲地主的罪恶；然后是义愤填膺的口号：“不忘阶级苦，牢记血泪仇！”记得当人们的情绪调动起来之后，会场的主持人大叫一声：“把地富分子押上台来！”大约有六七个衣着破烂的中老年人被推上台。他们刚上台，一群人冲上去就是一阵拳打脚踢！那几个地富分子被打得东倒西歪、血流满面。\n\n这是我第一次亲眼目睹暴打地主，我并不清楚那几个人是不是十恶不赦的坏人，虽然共产党的宣传也让我心中充满了仇恨。但是，我坐在前排，非常清楚地看到了他们脸上和眼中的痛苦——我感到，那是一种极其无助和凄凉的痛苦。他们头破血流但却不敢叫喊，一个个只是低声呻吟。他们那种痛苦的神情和目光深深触动了我，我突然产生深深的同情。那时我只有13岁，并不清楚地主究竟是不是坏人，他们是不是活该挨打，但是，我总觉得我从他们那种痛苦的神情中看到了一种无辜。因此，当时我就没有像其他同学那样，群情激愤地呼口号。\n\n**问**：你本人亲自接触过地主吗？\n\n**答**：1974年我当“知青”下乡到四川省邻水县。我在农村呆了近三年，在同农民们相处好了之后，他们给我讲了大量的心里话，最初让我很震惊的是：他们情愿过当年给地主干活的生活而不愿意当人民公社的社员。他们还说，当年地主对他们很不错，吃得也好。这同我受的教育刚好相反，而我感觉到，他们说的是实话。\n\n给我最大启蒙的是生产队的一个老会计，我住在他家隔壁，天天朝夕相处，他经历了土改的全部过程，他是第一个给我还原土改历史真相的人，那种血腥、残暴、下流、荒诞……老会计说，他也很冤枉，因为小时候曾经抱给一个地主当过干儿子就被评为地主。我当然知道这个地主，他是生产队里最底层的人：卑微、屈辱、干最苦最累最脏的活，而且，从不敢高声说话，连他的妻子女儿，都畏畏缩缩，像个小老鼠。记得有一天，我路过他住的那个破草棚房，站在门口向里望去。看见一个女人，一个穿得很破烂的瘦弱女人，正在灶台前烧火。她发现有人在看她，抬起头来，一见是我，眼中露出惊慌和羞怯的神色。\n\n我冲着她笑了一下。我永远记得她的反应——她慌慌张张站起来，既手足无措又仿佛受宠若惊！她的那种卑微让我心里突然觉得很难受——一个生活在最低层的人——廖地主的老婆。我由同情开始产生一种隐隐的冲动：要揭示土改和地主的真相。\n\n**问**：和其他地方的土改相比，川东土改中是如何消灭地主阶级的？有什么特点？\n\n**答**：在土改中，有一个政策，叫“关、管、杀”，这是专门针对地主和所谓反革命分子的。“关”就是关押——抓进大牢；“管”就是管制，虽然没进监狱，但没有言论行动自由等等；“杀”很好理解，就是肉体消灭。除此之外，地主们的财富全部被没收了，土改让他们变得一贫如洗。另外，强大的宣传把他们描绘成十恶不赦的坏人，从此抬不起头来。\n\n当然，各个地区也有一些各自的特点，比如酷刑，不同地区就地取材，发明了它独特的刑罚。比如四川农村有一种饮酒方式，就是众人双手握着一根竹管在一个酒坛里喝酒，土改时人们就根据这个方式发明了一种刑罚叫“吃咂酒”（又叫“猴儿搬桩”），把人的两个大拇指捆在一根木桩上，把木桩破开，中间加一个削子往下敲，这样往往把人的大拇指用麻绳勒断；又如秀山县有一种又硬又尖又长的刺叫“铁棱角”，土改时对地主就大量使用这种刺，叫“滚铁梁角”。\n\n**问**：2003年，你真正开始调查川东土改。是什么触发你的？\n\n**答**：那一天，我在川东云阳县彭氏庄园偶然听说，土改时，一个地主老婆被四个民兵用铁条捅下身，导致她子宫破裂而死。当时我一下子情绪极其波动，感到非常痛苦，而以前埋藏心底的念头徒然变作按纳不住的冲动。记得当天晚上，云阳突然倾盆大雨！我曾经在《长寿湖》的后记中写道：“遗忘，让被扼杀的生命又遭受一次不幸——一种比肉体生命消亡更深刻的不幸。”然而，面对地主的苦难，岂只是生命的虐杀和虐杀之后的遗忘？！地富们在付出了财产和生命之后，还要背负着“罪该万死”的骂名，被贴上“遗臭万年”的标记，这才是更深刻的不幸，最大的不幸。人世间的大不公，莫过于此！就是那一刻，我决定不顾一切进行采访。说“不顾一切”是因为当时我还处在“取保候审”的“服刑期”。\n\n**问**：调查东川土改跟其他敏感历史问题相比，对你来说有什么特殊困难？\n\n**答**：一是缺乏线索。虽然我知道就在川东地区，仍然有不少土改的受害者和亲历者，但我很难把他们一个个找出来。土改的当事人不像右派有一个相互有联系的群体，他们主要分散在广阔的农村，而我又是在“取保候审”期间，后来又是被监控的对象，根本不敢公开行动和公开寻找，因此，要获得线索很困难。二是调查土改真相是禁区中的禁区，中共的革命合法性几乎都建立在土地革命和土地改革上，比如“消灭剥削压迫”、“打倒封建势力”、“解放劳苦大众”、“让劳动人民翻身得解放”等等。人们只能按官方标准说话，如果要让当事人说真话，他们是非常恐惧的。在我所有的采访中，最恐惧的就是土改。所以，土改的采访几乎都是“隐性采访”——即在当事人不知情的情况下以聊天的方式获取信息。即便这样，很多人一提到土改，马上就吞吞吐吐甚至闭口不言。（我还经历过被推出门）至于土改中的那些作恶者，更是拒绝采访，比如有一个参与把一个少女轮奸致死的土改民兵，他三次把我们拒之门外。三是还有经济上的困难。我多次下岗，没有收入，土改调查要跑很多地方，费用很大。当然还有信息不准，千辛万苦跑去发现不是那么回事，几乎无功而返。\n\n**问**：你采访了多少人？主要是地主阶层吗？\n\n**答**：有一百多人，最多的是地主后代，老地主们大多已经不在人世，经过土改和随后的大饥荒，已经没多少老地主能活下来。再加上我动手晚了和不敢公开寻找，因此，这一百多人中，只有几个地主。其他的有土改工作队员、土改民兵、农会干部、土改积极分子和当年的贫下中农。他们都是土改的亲历者。\n\n**问**：能不能说几个他们的故事？\n\n**答**：当然有大量的故事。比如追逼地主金银，就把很多地主逼上绝路。在川东忠县有一对夫妇叫黎大雪和肖正静，他们是工商业兼地主，在他们所有财产都交完了而土改民兵仍然酷刑追逼时，他们只有自杀。这对夫妇是手牵着手一步步走向长江，走向死亡的。\n\n又如，在原川东奉节县柏杨坝镇的大水井庄园，曾发生过一个烧烤活人的事件。被烧烤的人叫彭吉珍，是地主李亮清的儿媳妇，土改民兵许定胜（音）向她逼要金银，彭吉珍交不出，这位姓许的民兵就把她脱光了用碳火烤她，烤得她乳房和肚子往下滴油。如果不是当时在场的一位农会干事向贤早把区长叫来，彭吉珍会被当场烤死。我在听向贤早讲这个故事时，头皮一阵阵发麻。\n\n罗四鸰，自由撰稿人，现居波士顿。"
		},
		{
			"post_id": 21,
			"title": "牙齿的风波",
			"date_published": 1503325290.687,
			"body": "这是一篇流水帐。 从春节开始右边的磨牙就断断续续的牙龈发炎， 即使没发炎的时间， 牙齿也松动了， 上上周再次发炎， 感觉不能再拖了， 挨着智齿的那颗牙感觉已经要掉了， 但用手拔还是很疼也下不来， 还是决定去医院看下。\n\n---\n\n* * *\n\n（8月8日）医生大概检查了下， 说那颗第3磨牙肯定保不住了， 已经是牙周炎了， 先吃上消炎药， 明天来拍牙片确定方案（当天放射科的没上班）。 第二天去拍了片看了下， 确定只能把严重松动那颗拔掉， 不过得等炎症消去， 所以约了周5去（当天周3）。 连续吃了几天的药， 牙龈发炎已经好了， 顺利拔牙， 留下拔掉的那颗， 发现牙结石严重， 牙根部分都覆盖了已经发黑的结石， 大概是这么长时间的松动发炎， 导致结石一直向下蔓延， 而且， 很臭。 医生多次提到牙齿太脏， 结石太严重， 应该洗牙， 我也深有同感， 等拔牙过了一周， 去医生那里问下是否可以洗牙了， 医生说你那个牙太脏了， 要洗2次， 700多， 要确定洗的话就去挂号。 我当时也只带了100多， 早上出门没想起这个事， 仍然坚持去医院的原因是去年老婆也去洗过牙， 大概母女俩才100多， 这个价格太坑了。 不过当时还是觉得应该洗一下， 就说要不下周来（当天是上周5 8月18日）， 于是留下电话约了本周3。\n\n然后周5回家想起这个事情有些不爽， 去年老婆洗牙的时候我也看过taobao上超声波洗牙机， 似乎也就几百块钱， 于是再次搜了下，最便宜的480一台， 比我这洗牙还是便宜不少， 没怎么犹豫就下单了。 今天（周1）到货， 中午就回来取了包裹， 接上开始使用， 花了1个多小时， 结石搞下来不少， 晚上再次拿出来修修补补零星的几个地方。 洗牙机只需要准备一瓶纯净水， 第二次连接的时候发现还是很简单的。\n\n这么长时间的牙齿问题， 现在算终于解决了， 除了右下牙内侧留下一个大豁口外， 一切都 ok了。 医生之前说过这么多结石这么脏的， 你的牙会很快就坏掉的， 总是那种埋怨的口吻听着有些不爽。\n\n前年开始其实就在注意牙齿问题了， 我的牙从小时候开始就一直是刷牙总会出血的， 但吃消炎药那段时间发现这个问题没有了， 难道困扰20多年的牙龈出血都是因为发炎？ 有些不可思议。 损失那颗牙的原因想来有两个： 智齿横着向外生长把它顶出来， 与第2磨牙挤着它，令其慢慢向上被太高， 与牙龈松脱； 另一个是口腔卫生问题， 结石在牙齿内侧比较厚， 令松动的牙周更容易感染， 长时间的发炎成了牙周炎。 拔掉的牙上可以看到与牙龈连接的部分已经非常少了（牙根上连着扯掉的一块肉）， 大部分的牙根已经被发黑的结石覆盖。\n\n教训就两个： 智齿要趁早拔掉； 定期洗牙去掉结石。"
		},
		{
			"post_id": 20,
			"title": "转: 刘晓波的信：一个殉难者的出现会改变民族的灵魂",
			"date_published": 1500888101.4,
			"body": "刘晓波好友、中国诗人和异议作家廖亦武日前在Facebook上公开这封写于2000年1月13日的信件。\n\n---\n\n亲爱的胡子或秃头：\n\n夜以继日地读你的《证词》，刘霞读得快，我读得慢。一目十行与逐字领会之间，你应该知道哪头更热吧。以后你再猪脑子，也该知道对谁应该坦荡，对谁应该暧昧了吧。\n\n与你四年的牢狱相比，我的三次坐牢都称不上真正的灾难，第一次在秦城是单人牢房，除了一个人有时感到死寂外，生活上要比你好多了。第二次8个月在香山脚下的一个大院中，就更是特殊待遇了，除了没有自由，其他什么都有。第三次在大连教养院，也是独处一地。我这个监狱中的贵族无法面对你所遭受的一切，甚至都不敢声称自己三进三出地坐过牢。其实，在我们这个非人的地方，想有尊严只剩反抗一途，所以坐牢只是人的尊严的必不可少的部分，没有什么可炫耀的。怕的不是坐牢，而是坐过牢之后，自以为可以向社会讨还血债，号令天下。\n\n我一直知道“六•四”后有太多的被捕者判得比我这样的风云人物重，狱中的条件之恶劣，非常人所能想像。但在没有看到你的《证词》之前，这只是一种感觉而已。《证词》才使我能够真实地触摸到“六•四”悲剧的真正受难者的心跳。我的羞愧是无法形诸于文字的，所以，在我的后半生，只能为亡灵，为那些无名的受难者活着。什么都可以过去，但无辜者的血泪是我心中永远的石头。沉重，冰凉，有尖利的棱角。 《安魂》是一首真正的诗，比《大屠杀》还好。\n\n与其他共产黑幕中的人物相比，我们都称不上真正的硬汉子。这么多年的大悲剧，我们仍然没有一个道义巨人，类似哈维尔。为了所有人都有自私的权利，必须有一个道义巨人无私地牺牲。为了争取到一个“消极自由”（不受权力的任意强制），必须有一种积极抗争的意志。历史没有必然，一个殉难者的出现就会彻底改变一个民族的灵魂，提升人的精神品质。甘地是偶然，哈维尔是偶然，二千年前那个生于马槽的农家孩子更是偶然。人的提升就是靠这些偶然诞生的个人完成的。不能指望大众的集体良知，只能依靠伟大的个人良知凝聚起懦弱的大众。特别是我们这个民族，更需要道义巨人，典范的感召力是无穷的，一个符号可以唤起太多的道义资源。例如方励之能走出美国大使馆，或赵紫阳能够在下台后仍然主动抗争，或北岛不出国。“六•四”以后的沉寂与遗忘，很重要的原因是我们没有一个挺身而出的道义巨人。\n\n人的善良和坚韧是可以想像的，但人的邪恶与懦弱是无法想像的，每当大悲剧发生之时，我都被人的邪恶与懦弱所震惊。反而对善良与坚韧的缺乏平静待之。文字之所以有美，就是为了在一片黑暗中让真实闪光，美是真实的凝聚点。而喧嚣、华丽只会遮蔽真实。与这个聪明的世界相比，你和我就算愚人了，只配像古老的欧洲那样，坐上“愚人船”，在茫茫大海上漂泊，最先碰到的陆地就是家园了。我们是靠生命中仅存的心痛的感觉才活着，心痛是一种最盲目也是最清醒的状态。它盲目，就是在所有人都麻木时，它仍然不识时务地喊痛；它清醒，就是在所有人都失忆时，它记住那把泣血的刀。我曾有一首写给刘霞的诗：“一只蚂蚁的哭泣留住了你的脚步。”\n\n我没见过你的姐姐飞飞，她该是一个怎样的女人，你的笔使我爱上了她。与亡灵或失败者共舞，才是生命之舞。如果可能，你去扫墓时，代我献上一束花。\n\n晓波于公元二千年一月十三日"
		},
		{
			"post_id": 19,
			"title": "转:  查建英: 广场之后",
			"date_published": 1500887556,
			"body": "我们有许多关于中国的老生常谈，它们的广泛流传，往往是借助一些广为人知的符号，比如长城、一层套一层的「中国盒子」、毛泽东、笑呵呵的熊猫，如此等等。年代最近的中国符号，则是天安门广场。一九八九年以来，天安门好比一团充塞天空的血色乌云，笼罩了我们对于中国的想象。我们虽然不断读到关于中国经济改革的点滴报导，最近还对欣欣向荣的亚洲市场产生了兴趣，天安门却挥之不去。坦克、鲜血，还有那尊化为斋粉的小号自由女神塑像，依然在我们的脑海里繁回。在西方公众的心目当中，中国的形象蒙上了无法洗刷的污垢，因为那个千里之外的巨人故态复萌，再一次堕入了倒行逆施的高压模式，再多的金钱，再多的廉价劳动力，都不能赎清这等恶行。\n\n---\n\n围绕天安门的老生常谈之所以流传不衰，部分是因为媒体音像和报刊文章的着意渲染。跟所有的同类一样，这一个老生常谈也包含着或多或少的真相。然而，问题在于它围绕一套简单的政治事件和图景来建构中国的形象，由此衍生了一种黑白分明的二元论述，无法反映持续变化的复杂现实。这一来，西方公众心目中的中国不再是毛泽东时代那个迷信盲从的疯狂国度，不再是邓小平执政早期那个熊猫一般的可爱国度，摇身变成了一个由极权政府和失控自由市场组合而成的怪胎。这固然是一幅新奇的拼图，但却产生于一种陈旧的眼光。\n\n若是从多个角度对中国作一番更为细致的审视，我们会看到一幅更为复杂、更为模糊的图景。今天的中国，正在经历一场史无前例的变迁，人们有时称之为「第三条道路」，或者说「中国道路」，以便与苏联模式相区别。这一进程充满了矛盾与疑惑，以及往往无法解决的两难问题。我们必须放下成见，拿出耐心，才能真正理解这一进程，不受老生常谈的摆布。要完成近距离的谨密考察，我们或许不得不捐弃全景式的宏大叙事，不得不克服迅速拿出结论的急躁心理。\n\n大多数人想必都会同意，这样的考察方法确有裨益。本书便是我在这方面的一个尝试，意在以见微知著的方式，从多个侧面描绘今天的中国。宽泛地说，本书讲的是中国在天安门事件之后的变化，弥漫在北京上空的情绪，以及一些个体的心态，社会剧变的阵痛与这些个体的人生如影随形。具体地说，本书讲的是中国文化产业的一些从业人员，讲他们的信念、友情和生存能力如何应对文化政治诡满变局与重商主义新需求的考验，或是如何发生顺应时势的变化。从个人层面来说，本书讲的是我的一些中国友人，讲我们共同或各自经历的转变，从过去转向现在，从革命时代的浪漫情怀与荒唐闹剧，转向全球化时代的务实精神和种种挑战。本书所有章节都以天安门之后的中国为背景，「没了城墙的城市」除外，这一章讲的是北京的城市变迁，所以我拉长了镜头，以便为中国走向现代化的漫长奋斗提供更多的历史参照。本书以当今中国的文化变迁为中心议题，开篇章节「渴望」讲的是天安门事件刚刚结束之时，一部极具争议的电视肥皂剧的制作过程，结尾章节「岛民」则讲述了一家香港公司的故事，该公司于不久之前进军中国大陆，尝试开办中外合资的文化企业。居间章节涉及城市规划、电影制作、新闻产业、艺术、饮食、色情产品及性政治等等话题，全都在以不同的方式探讨中国文化生产及消费的变动环境。我之所以写下这些记述，目的是呈现这个半共产第三世界国家的变化，突显中国文化圈矛盾丛生的常前氛圆，刻画中国的文化生产活动走向商业化和职业化的进程，以及这一进程对未来中国社会的种种复杂而深远的影响。鉴于本书选择的事件和人物形象反映了我的个人旨趣和主观认识，或许我应当做个自我介绍。我生在北京，长在北京，成长时期适逢文化大革命的混乱年月，并且幸运地踏身于文革后第一批大学生的行列：我只在农村接受了一年的「再教育」，随后便直接踏入了北京大学的校门。一九八一年，二十一岁的我来到美国，在南卡罗莱纳和纽约的研究生院度过了五年半的时光。一九八七年，我描看论文奖学金返回中国，希望重新融入我的父母之邦。此后两年，我开始写作中文小说，事业上小有收获，与当时中国生机勃勃的文化潮流和知识分子也有了越来越深的接触。学生们走上天安门广场的时候，我正在和一群锋头正健的中国作家合作编辑北京的一本精英杂志，同时还在《纽约时报》北京分社做一份临时的工作。\n\n天安门事件使得这一切夏然而止。目睹了六月四日的大屠杀之后，我回到了美国。从那以后，我的工作─直是在中国和美国两地奔波。我从一九九○年开始担任芝加哥一个独立研究中心的中国项目协调员，由此得以时常造访中国，在北京我母亲家里住上几周乃至几月的时间，以便开展研究和访谈。过去两年，我一直在为香港的一家著名月刊撰写关于北京的评论专栏。我和一个华裔美国人结了婚，把家安在芝加哥，用中文和英文双语写作。\n\n生活经历既是如此，我在中美各自的文化场域中，便既不完全在里边，也不完全在外边。我的认同感是双重的，对于太平洋两岸不同的人和不同的文化理念，我同样心怀敬重与忠诚。每当有人问我，我究竟如何定位自己的精神家园和文化立场，我的回答往往是：我一只脚搁在中国，一只脚搁在美国，脑袋则搁在中美之间的某个地方，兴许是香港。\n\n然而，自自诩为一位英勇的世界公民，畅游在文化和地理上的深广鸿沟，这一种飘飘然的自我形象，根本不能反映身处其中的真实感受。筹备和撰写本书的过程中，我渐渐认识到，至少是对我而言，在大洲之间飞来飞去的生活看似风光，不用彻底依附单一民族与文化的生活看似自由，与之俱来的却是巨大的代价。因为这种生活，我不得不日复一日地掂量、拷问、澄清我多重的人格和声音，我爱憎交织的情感，还有我双重的视角，不得不面临种种十分痛苦甚或撕心裂肺的困惑，这些苦楚，我到现在也不敢细细思量。许多中国人曾经和我交谈，或者接受过我的采访，最终被我写进了这本书，在他们的眼里，我可能是一个朋友、一个记者、一个作家同行、一个喝小酒侃大山的伙伴、一个普通的中国人、一个西化的中国人、一个寄居海外的中国人、一个半吊子中国人，也可能是前述种种的混合体。有时候，他们把我当成无须顾虑后果、可以畅所欲言的倾诉对象，因为我不再是中国居民，也有的时候，他们仍然把我当成「自己人」，因为我们共同的背景和经历毕竟有着不小的份量。显而易见，这样的局面可以带来便利，同时也暗藏陷阱。这种特殊的信任、同志情谊和人际关系包含看许多风险，常常迫使我竭力应对至少两个问题：一方面，我必须格外小心，以免影响那些中国居民的生活；另一方面，我必须跟他们保持足够的距离，好对他们的生活做一番相对公允、相对全面的刻画。\n\n本书的大多数中心人物，都可以说是所谓的「知识分子」。这个词在中国用得比较滥，有大学文凭的人都可以算是知识分子，我说的知识分子则是指一类受过良好教育的城市专业人士，其中包括作家、建筑师、制片人、艺术家、评论家和出版人。我之所以把他们作为主要的刻画对象，道理非常简单，因为知识分子历来是中国公共生活中的重要角色，作为最优秀、最聪颖的一批中国人，他们的故事可以以一种格外引人入胜的方式揭示中国的现状。总体上看，我这个说法可以成立，话又说回来，其他人群的呼声，以及其他类型的人生波折，无疑也有权获得同等的关注，也可以引发我同等的兴趣，本书的人物选择只是因为我对这个特殊群体的个人偏好，很多时候还因为我熟悉他们，可以与他们进行轻松自如的交流。本书写到的一些访谈对象与我相识多年，还有些则是我的朋友，或者是朋友的同事。在中国，人脉、背景、关系和交情往往是做成任何事情的关键因素，再者说，中国民众在很大程度上依然处于官方的监视之下，因此我们可想而知，这样的相互信任和轻松氛围提供了极大的帮助，使我得以与他们进行坦诚深入的交流，畅谈中国人觉得「敏感」的各种话题。不过我必须声明，我写作本书的目的，并不是为当下的中国描画一幅全景，要画出那样的全景，重点就应该是占中国人口绝大部分的工人和农民。我的目光集中在大城市，集中在知识阶层和文化产业，为的是捕捉中国正在兴起的普世主义精神，它正在推动中国融入一种全球性的文化。\n\n每次到了中国，我都会产生爱恨参半的感觉，久而久之，我便对这样的感觉习以为常。有时候，北京好比一种皮肤病，使得我奇痒难当，彷佛受制于某种千回百转、莫名其妙的激情，心绪变得极其苦涩，极其脆弱，动辄大起大落。每当我在北京停留的时日超过了几个星期，这城市就会让我忍无可忍，因为那样的奇疗愈演愈烈，最终使我血流不止。我会坐上情绪的过山车，对人对事反应过激，这一来，为了找回顺畅的呼吸，找回我的平衡和理性，我只能落荒而逃。到了美国，我可以获得更为清晰、更为冷静的视角，可以理智地评判我从中国带回的一切，可以休养生息，长出一层新的皮肤。\n\n然而，过不了多久，我就会再次感受到中国的魔力。先前的奇痒卷土重来，我开始渴望返回中国，开始向往所有那些杂乱无章的顽强斗志，所有那些赤裸粗糙却令人精神振奋的生活追求。我为香港和海外的华人读者撰写专栏，在美国的生活虽然安宁有序，家里却时常有流亡美国或访问美国的中国友人进进出出，因此我开始怀念沉浸在乡音之中的美妙感觉，怀念和北京的朋友一起流连新老小店的光景。我想知道北京新近流行什么样的俚语，什么样的黑色幽默，想知道我那些朋友的别后境况。过不了多久，我就得跳上飞机，投入又一个往返循环。扪心自问，我知道，我已经对这样的生活上了瘾。\n\n也许这就是一部分的原因，可以解释本书的主角当中，为什么会有那么多身陷重围的人物，他们在时代、生活和派别的夹缝中寻找平衡，忍受撕裂的痛苦，他们的抗争与抉择给我留下了无比深刻的印象。与他们的晤谈，为我的旅程提供了许多闪光的亮点。从某种程度上说，我觉得他们与我情同手足，因为我向来喜欢敢于越界的人，他们敢于迎接并适应多种多样的人生处境，哪怕这往往使人质疑他们的忠诚、动机和根柢。他们中的大多数人都没有我所享有的特权，也就是抽身离去。他们只能在原地拼博到底，承受全部的风险与后果。他们必须应对险恶复杂的处境，使得我自愧不如，他们的经历饱含斗志与酸辛，又使我为之动容。从某种意义上说，他们是走在自己时代前头的世界公民。\n\n过去几年中，我在中国的许多熟人都蜕去了身上的旧皮，翻开了人生的新页。\n\n松子的故事，不过是千百个类似事例之一。八九年抗议运动爆发之时，这位天资聪颖的青年科学家供职于北京一家军队的武器研发机构，并且跟中国精英阶层的许多成员一样，深深地卷入了那场运动。当时他万分激动，满怀希望，每天都要给我打几次电话，向我通报广场上的最新消息，以及关于军方和政治局动向的最新传言，都是他从他那个消息灵通的圈子里打听来的。第一个通知我官方要戒严的人就是他，在我听到第一声枪响之前，也是他从北京西城打电话给我，告诉我屠杀已经开始，听声音就跟掉了魂儿似的。他是个忠诚的朋友。屠杀之后那个生死攸关的日子，北京的交通彻底中断，他主动提出帮助我离开。街上有狙击手的枪弹，还有杀红了眼的武装士兵，可他还是冒雨陪我骑车上街，直到一部黑出租最终答应送我去机场为止。\n\n将近两年之后，我再一次见到了松子，那时他已经变了一些。他养成了一种新的嗜好，前面两年一直在打麻将。他告诉我，「中国的麻将人口十分庞大，这是个消磨时间的好办法。」他长年泡看病假，成天无所事事，拿自个儿来开尖刻的玩笑（「我们研制的那些装甲运兵车可真管用！」），痛骂那些把注意力转向挣钱的人，说不想离开中国的人都是有病，他自己则是病得太重，所以才走不了。他变成了一个败兴专家，瞬间就可以把一桌宴席弄得难以下咽。天安门事件把他身上的理想主义情怀毁得一塌糊涂，简直叫人目不忍睹。\n\n然而，更叫我惊愕的还是他接下来的转变。我一九九二年造访北京的时候，有一天，松子来到我母亲的公寓，身穿三件套的西服，脚蹬亮锃锃的皮鞋，腰间别着寻呼机，脸上挂着爽朗的笑容。「现在我是生意人啦！」他如是宣布。接下来，他轻描淡写地讲了几个叫人震惊的故事，讲他和同事如何利用军队研究机构的特权倒卖石油，从中赚取差价，讲他和一个合伙人如何通过虚假广告大发横财（「中国的消费者可真好骗！」），还讲到了风行全国的走私与诈骗。他帮看妻子买通铁路官员，他妻子由此可以把大批货物（白酒、丝绸和羽绒服）带上著名的西伯利亚列车，运到莫斯科去卖，利润非常可观。他说，西伯利亚列车上载满了走私贩和贸易商，中国人、俄罗斯人、匈牙利人、罗马尼亚人应有尽有，大家都跑出来挣钱，希望凭着运气和胆识发家致富。他兴高采烈地宣称，「这就叫参与国际贸易！党用不着我们去腐蚀，它早就从心子里烂掉了。我们所里那些党的干部，还不是忙着为自个儿挣钱。我要是执迷不悟的话，那可就真成了傻子。那些双手沾满鲜血的流氓，终究会有遭报应的一天。不过，那一天还没来的时候，我最好得过且过，给我自个儿揽点儿银子。我并不喜欢赚钱，我心目中的好日子，无非是下雨天躺在床上，手里拿本好书。可是，我能有什么选择呢？」\n\n我有个北大同学，八十年代的角色是著名的先锋文学评论家，后来也经历了类似的转变。一九八九年，她上街游行声援学生；一九九一年，她成了个体户。她虽然保留了文学研究机构的公职，一礼拜却只需要去一次办公室，其他时间都待在市中心的一座百货大楼，因为她在那里开了一家小小的女装店，出售五颜六色的夹克、皮大衣和针织衫。她和合伙人在货架上方挂出一张巨大的「皮尔·卡丹」招贴，把小店命名为「夏娃之梦」。她之所以经营个体生意，直接的原因是通货膨胀、生计艰难和苦闷无聊，以及国家机关的压抑气氛，她的上司是个死硬的党棍，命令她收集其他中国知识分子的「黑材料」。不过她跟松子一样，对自己的新生活也有一套理论。她告诉我，「在以前，我们这些知识分子太过脱离社会，根本不了解那些最起码、最日常的中国现实。我们不知道普通人想要什么，也不知道社会底层是怎么运作的。」我看见她仍然把福柯（Foucault）和拉康（Lacan）的著作摆在状头，便向她指出了这一点，可她只是耸了耸肩，「睡觉之前，我有时也会读读这些书。白天卖衣服，晚上读理论，我并不觉得这两件事情有什么冲突。实际上，两者都关乎一些最基本的生活需求和冲动。」从那以后，她换了一个又一个工作，曾经在一家广告公司打工，还曾去南美寻找投资机会。我发现，她的生活方式发生了种种变化：她的衣看更加时髻，妆化得更加精致，成天坐看出租在城里跑来跑去，不再坐公交车。她的新生活节奏很快，所以我无从揣度，她还有没有读福柯和拉康的时间。\n\n我有个老朋友，原本是在北京编杂志，写一点兄艺术评论。他那本杂志是改革派的阵地，天安门之后遭到封杀，于是他坐上飞机，去了南方的深圳。到了那个没有多少规则的「经济特区」，他投身股票生意，赚了一大笔钱，然后又赔掉了其中的一半，由此变成了炒股专家，开始为一份商业通讯撰写专栏。如今他正在参与制作各种电视综艺节目，同时也在寻找机会，打算自己出资，办一本属于自己的杂志。\n\n近些年，我认识的许多小说家都挤进了写电视剧本的行当，开始炮制肥皂剧和情景喜剧。有些人把手稿拿到文学拍卖会去拍卖，后者是一种新设的平台，功能是向富裕的企业家宣传并兜售「严肃文学」。一家报纸如是鼓噪，「我们的文人应该抛弃俯就商业的传统观念。新的时代需要新的文人。」\n\n我有个做调查记者的朋友，天安门事件之后遭到了官方没完没了的纠缠，要他交代自己在事件当中的表现。于是他忍无可忍，干脆辞掉了原来的工作，办起了自己的商业咨询公司。我去过他的办公室，办公室坐落在北京一座新建的豪华高楼里，装潢精美，计算机齐备。他告诉我，他半数的员工都是天安门之后遭到清洗的学校教师。这些人如今置身于电讯噪音此起彼伏的环境，看着都像是泰然自若、游刃有余的私营公司专业人员。我这个朋友说，他心里有很多扩张计划，最终的梦想则是创办一家私立大学：「在中国，独立于官方的优质教育实在是太重要了。」他相信，他能在可预见的未来办成这件事情。\n\n我同父异母的哥哥曾经是北京一间精英中学的红卫兵，十七岁时响应毛泽东「改天换地」的号召去了内蒙古，结果是在那里的一个农业贫困县待了二十一年，一九八九年春才回到北京。回到北京之后，他径直走上了天安门广场，并且预言，「这一次胜利的会是人民。」现在呢，他的精力都用来申请银行贷款，兴办工厂，拓展业务。他在内蒙古结识的一些农民朋友追着他来了首都，成了他新办工厂里的可靠工头。他依然关心政治，依然坚信中国会迎来自由与民主，依然认为必须有人为这样的理想献出生命，可他已经认识到，他必须打下资本与财富的基础，将来才有机会在社会上发出声音。在他生意应酬和商务旅行的间隙，我俩有时会一起喝上一杯。我听着他慷慨激昂地发表关于人权和多党制的长篇大论，想看他又有一家工厂赔了钱，身上的债务越堆越高，禁不住觉得他的生活充满了讽刺。从他的经历来看，他似乎总是一只脚走在时代的前头，一只脚落在时代的背后。\n\n读到这里，大家可能会觉得这一类的故事似曾相识。冷战结束之后，前共产国家纷着手把苏式的中央计划经济改造成市场经济，社会上随之出现了许多性质与此相同的冲突。以及一种与此相似的氛围。原有的文化圈子分崩离析，生活方式也面目全非，挥之不去的是对于未来的茫然之感。社会上弥漫着一种梦想破灭、纯真不再的感觉，人们默默地哀悼那些失败的乌托邦理想，但这样的哀婉情绪其寿不永，很快就在新现实的痛击之下遭到压制。除了那些种族战争肆虐的地区之外，东欧和前苏联的大部分地方都跟中国一样，普遍见证了社会的商业化趋势，以及流行文化和消费主义的崛起。与全球化一同到来的私有化浪潮，对经济结构和民众生活造成了巨大的冲击。\n\n然而，中国的后冷战社会变迁与其他国家大不相同，这不光是因为深刻的文化差异，还因为一个独一无二的重要因素：一九八九年的革命以失败告终，共产党继续留在台上，掌控着变革的进程。\n\n我们必须把握这个关键事实，否则就难以理解当前中国的局势，难以理解它独特的复杂性和讽刺。这个事实衍生了一种半生不熟、缩手缩脚、色厉内荏、玩世不恭、遮遮掩掩、偷偷摸摸，往往显得滑稽可笑的氛围。中国的改革便在这样的氛围中曲折前行。东欧和俄罗斯欢天喜地地目睹了旧政权的戏剧性圳丹塌，而我们在中国看到的景象，却是旧有结构缓慢、柔和、烂泥一般的消融过程。依照我的突发奇想，我们不妨称之为「巨无霸效应」：在当下的中国，不管是文化、政治、社会观念还是意识形态，几乎所有的生活层面都具有这种驳杂不纯、稀里胡涂的大杂烩特征，其间没有浪漫，也没有适于拍摄的如画风景。它太过模糊，太过油滑，往往粗俗到无耻的地步。天安门事件之后，哥伦比亚广播公司（CBS）、美国广播公司（ABC）和全国广播公司（NBC）并没有急急忙忙地奔回中国，岂不是情有可原？有些人觉得，拍摄天安门之后的中国，无异于拍摄一场屠场废墟上的诡异欢宴。\n\n一方面，天安门之后的中国没有给我们提供温暖人心、涤荡灵魂的净化体验，那是取得了成功的自由民主抗争才能提供的东西，另一方面——这让某些预言家感到难堪——它也没有呈现那种高压与萧条久久持续的漆黑图景，尽管那是残酷镇压之后的常有情形。头顶着政治上名誉扫地的阴云，中国即刻踏上了谋求经济繁荣的喧闹征程，再次敲响了「中国特色社会主义」的老套鼓点。在东欧和俄罗斯，人们体验到的是一种新时代曙光乍现的澎湃心情，无论天气冷暖，眼前总归是一个「全新的早晨」，历史总归翻开了全新的一页。而在中国，到了要跟过去划清界限的时候，人们可没有这样的运气。\n\n中国一直在变，遵照的是它自身的古怪逻辑。政府一方面一再无视国际社会谴责它侵犯人权的声音，千篇一律地强调国情独特，拒绝「屈服于外部压力」，一方面又确确实实「屈服于」内部压力，做出了一些让许多人大跌眼镜、性质难以界定的事情。不用说，党并未允许民主在中国立足，与此同时，几乎所有人如今都会同意，中国人向来对西式民主不怎么感冒，更何况，再怎么说，没有哪个中国人——包括天安门广场上的那些学生——真正懂得民主的涵义。党固然不打算给民众更多的政治自由，但却已经给了他们更多的经济自由，所有人又都知道，经济自由不可能止步于经济层面。谈到天安门事件的时候，我的一位华人律师朋友说：「如果有上百万人走上了街头，动因就不可能只是某个抽象理念，必然与他们的自身利益有关。不是吗，这事情跟民主不相干，真正的问题是通货膨胀和社会不公！物价飞涨，人们愤怒是因为他们得不到挣更多钱的公平机会，跟那些高干子女没法比。」北京的一个资深记者帮我做了个这样的总结：「天安门事件已经把党逼得走投无路，要么改善民生，要么就得下台。」对于政府的强硬说辞，他表示不屑一顾：「党当然要说这种很话。它就像只鸭子，煮熟了照样嘴硬。你永远也别指望它公开承认任何错误——掉面子掉到那个份儿上，它还怎么统治呢？其实呢，老邓心里明白，经济才是关键。他已经开放了经济，这一来，中国取得了不小的进步，比我们在天安门广场上要求的还要大。」\n\n很多中国人都有同样的感觉，就连一些最狂热的八九反抗者，似乎也吸取了一点儿教训。有个媒体记者积极地参与了天安门的抗议运动，到了一九九三年的春天，他却一边喝着啤酒，一边向我坦承：「这就跟你爹狠狠抽了你一记耳光一样。你一时很难接受，只能一点儿一点儿地明白过来，他终归是你参。你没有别的办法，只能慢慢来，一点儿一点儿地挖社会主义的墙角呗。」\n\n狂热消退之后，八九运动中另一些令人不安的因素渐渐浮出了水面。举例来说，越来越多的人注意到，学生中那个极度激进的派别如何以容不得任何妥协的言事辞谈论鲜血与牺牲，一步步取得了天安门广场的主导权，他们那种一目了然的极端倾向又如何使党内的元老惊慌失措。主宰最终对决的不是理性与克制，而是狂热与蛮力。讽刺的是，在屠杀之后的审判当中，获刑最重的恰恰是那些更为克制、更为成熟的异见领袖。这还不算，经历了一场如此高调的运动，整整一代人的民主奋斗却蒙受了惨重的损失。整整十年的时间里，脆弱却生机勃发的中国版公民社会（推动民主的半独立出版物和团体）一直在官方架构的内部或是边缘悄悄发展，建起了一个又一个的根据地，天安门事件之后，这些根据地大多遭到了封杀或清洗。面对诸如此类的事实，许多中国人渐渐把天安门事件看成了十年民主运动的一个孽子，一个害得母亲死于难产的死胎。这之后，人们听说了流亡者在海外的所作所为，由是收到了又一条使人清醒的讯息。流亡的学生和知识分子领袖内讧不断、贪污公款，致使留在国内的中国人越来越反感这些昔日的同志：倘若异见分子在一九八九年取得胜利，掌握了中国的命运，今天的情况肯定会糟糕得多。说不定，归根结底，反抗者自己也是共产主义的产物，学生们自己也是毛泽东的儿女，他们为新的理念抗争，方法却只能是老一套，离不了群众集会、高呼口号、派系斗争和腐败风气。区区一个浪漫季节，扫除不了几十年的积习，它多半会谬种流传，在几代人的血脉中继续存在。\n\n在我看来，中国人之所以普遍觉得直接的政治行动徒劳无益，既是因为政府的严厉管制，也是因为对过往事件的此类清醒重估。更何况，随着「市场化春风」吸遍全国，其他的紧迫事务纷纷开始向人们招手，人们也就各有各忙，干别的事情去了。\n\n至少是就现状而言，那个老皇帝似乎跟他治下的老百姓达成了一种默契：我统治，你发财，别的都不用管。\n\n种种迹象表明，今天的中国民众确实在按照这条规矩办事。迄今为止，邓小平应该会对结果感到满意：党依然统治看国家，国家正在走向繁荣，繁荣则正在抹去民众对以往悲剧的记忆。看样子，除了流亡者和少数孤立个体之外，没有人操心记忆消逝的问题。\n\n这一天，我和母亲去八宝山为父亲扫墓。八宝山是中国最为炙手可热的墓园，因为这里埋葬看许多共产党高干。人们为八宝山的墓地你争我抢，依我看，大概是渴望享有跟伟人做阴世邻居的殊荣。我父亲是个无神论者，生前说他对这种事情看得再淡不过，可他最终还是葬在了这里，就因为他不高不低的级别。\n\n去八宝山非常折腾，那里交通不便——先得坐很长时间的巴士和地铁去北京郊区，然后还得在土路上走很长的一段距离——而且总是拥挤不堪。今天是四月五号，中国人祭扫祖墓的年度节日，所以人格外地多。我和母亲在地铁上挤了一路，到了墓园之后，发现那里简直跟游乐场一样热闹。人们推推搡搡，脚底踉踉跄跄，因为墓园里到处都是高高低低的石头。高音喇叭正在大声播报墓园的规矩：不要推操，不要大声说话，没事不要围观闲逛。随便你走到哪里，眼前都有这样的高音喇叭，一遍又一遍地重复着这些规矩，震得你脑袋嗡嗡作响，叫你无处可逃。我赶紧警了一眼父亲的遗像：他也是挤在满墙墓砖当中，那里的空间如此狭小，连我带给他的一枝白色百合都没地方放。\n\n我俩勿勿离去。母亲气冲冲地说，「不长进的警察国家！死人都不得安宁。」我心里一片茫然。坐地铁回家的路上，我一直沉浸在一段突然涌上心头的回忆里，想起了我眼泪汪汪跟父亲吵架的情景。那是在一九七九年、我刚满二十岁，中国经历了第一个「北京之春」，也就是政治解冻，中国版的「布拉格之春」。在此期间，魏京生被官方判处十五年徒刑，他是当时最著名的异见人士，从轰轰烈烈的「民主墙运动」当中脱颖而出。政府指控魏京生向外国人泄露中国的军事机密，但大家都知道，什么才是他真正的「罪行」：他把邓小平称为独裁者，还要求言论自由。可我父亲相信政府的指控。我俩以前从来没吵得那么厉害，两个人都用出了刀子一样伤人的言语。我记得，后来我独自坐在一把破竹椅上，忍不住哭了起来。那是我与父亲隔阂的开端。父亲本来是我的偶像，对我疼爱有加，只可惜代沟一年一年地越变越深，伤口始终无法愈合。\n\n我最后一次跟父亲吵架，正是在天安门抗议运动期间。那时候，我们两个都是天天出门，各自去「了解形势」。吃晚饭的时候，一家人难免会谈到这件事情。我母亲和弟弟支持学生的行动，父亲则认为，政府和学生都昏了头。那时我正头脑发热，根本听不得他这种说法。我们的争论迅速变得火星四溅，最后还是弟弟平静地指出，父亲的推断和我的混乱宣言都存在一些逻辑上的漏洞，这才让大家冷静下来。看到父亲依然高高兴兴地做他漫长的早课，天天去附近的公园锻炼跳舞，不像我这样痴迷于「那个伟大的历史时刻」，我心里也觉得失望至极。那时我忿忿不平地想，一个老共产党员，自己也曾经领导学生反抗当时的反动政府，现在却是这种态度，讽刺啊！有一天，一个年轻的学者拿来了一封声援学生的公开信，请我父亲在上面签名。信上已经有了许多著名学者的签名，我父亲却不肯签。看着那个年轻学者失望地离去，我忍不住说了一句，「爸爸。你没看见信上有胡绳的签名吗？」我父亲当时是社科院研究员，胡绳则是社科院院长。听了我的话，父亲看着我，简单地回了一句，「看见了，可我不赞成信里的说法。」之后的一天深夜，我和父亲在客厅里相对而坐。记不得是什么由头，父亲不无尴尬地说，这些日子，我和他的分歧实在是太大了。当时我对他的感情已经降到了冰点，于是便头也不抬地回了一句，「是啊，无所谓吧。」他把一张报纸扔到了我的脸上；我看见他的脸色一片煞白。几天之后，我离开了中国。那是我和父亲的最后一面。\n\n去世之前，我父亲访问了苏联，还有四个东欧国家：柏林墙倒下的时候，他在柏林；瓦茨拉夫·哈维尔就任总统的时候，他在布拉格。访问莫斯科、列宁格勒和基辅的时候，他意识到，共产主义搞得确实不怎么样。访问回国之后，他对我母亲说：「要我说，我跟咱们女儿的分歧不外乎这么一点：她认为文化能救中国，我认为经济才行。」他的语气，包含着和解的意思。他给我写了一封信，信里全是他这次访问的有趣观感。我觉得很有意思，于是就回了信，称赞他的观感很有见地。我母亲后来告诉我，读到我少有的认同话语，父亲真是高兴极了。这次通信之后不过几个星期，父亲就离开了人世。\n\n从某些方面来说，我和父亲之间的关系，与天安门学生和政府之间的关系不无相似。大多数时间里，我和他都能够求同存呈，保持亲睦的感情。即使我跟他意见相左，只要能采取有礼有节的表达方式，他通常都会认真听取，至少不会觉得受了冒犯。有些时候，他甚至会部分地赞同我的观点。可要是起了冲突，情形便大不相同：受了自尊心和激动情绪的裹挟，我俩都会变得眼光狭隘，都会一口咬定自己オ是正确的一方，还曾又跳又叫，像两只比特犬一样相互撕咬，势不两立。到最后，我总是落得精神崩溃，因为父亲一旦觉得自己的权威受到了无理冒犯，便再也不会有丝毫容让。另一方面，从一个十分重要的角度来看，我父亲和中国政权毫无共同之处。终其一生，我父亲一直集理想主义者和理性主义者于一身；令他无比自豪的不光是他的马克思主义信仰，还有他的分析能力。他理性判断的最后一次严重失误，正是出现在一九八九年。当时他心里坚信，嘴上也坚持认为，中国共产党的军队绝不会向自己的人民开枪，因为这完全背离党的理想。六月四日，他惊得哑口无言。\n\n记忆。中国人的国民记忆，真的是维持不了多久吗？一九九一年的春天，一个风和日丽的日子，我骑着自行车，慢悠悠地经过天安门广场。当我把目光投向那片空阔的地面，投向广场南端那些冷森森的纪念建筑，投向人民英雄纪念碑，投向毛泽东的陵墓，前面的这个问题，一直在我脑子里盘旋。\n\n以面积衡量，天安门是世界上最大的广场。它线条量笔直，没有弧度，没有树木，视野中也没有哪怕一张坐椅、一片荫凉。它毫无幽默感，并且毫不遮掩，从它那里看不见一丝人性的慰籍、温暖或是欢悦，尽管这些因素似乎是城市中心广场的「天然属性」。归根结底，这个广场本来就没打算提供这类无聊的乐趣，因为它仅仅是游行集会的人流汇聚中心，是民众朝拜政权的场所。政权则通常化身为一个唯我独尊的伟大领袖，也就是现代版的中国皇帝。从某种意义上说，一九八九年的春天，这里呈现给全世界的景象颇有点儿不合逻辑：广场遭到占领，遭到篡夺，转而服务于一个与它原有使命截然相反的目的。那时的广场变成了民主抗争与个性狂欢的阵地，要是从中国政府的角度来看，则变成了颠覆活动的大本营。既是如此，政府必须夺回广场，必须证明自己是个强大的政权，有能力收复失地。那段「反常」岁月如今只剩下一丝痕迹，那便是广场周边那些全副武装的人民解放军警卫。秩序已然恢复，巴士、自行车和路人从广场旁边勿勿掠过，不曾放慢脚步。没有人在广场上流连，甚至没有人往广场的方向瞥上一眼。他们又何必流连？秩序刚刚恢复的那一刻，广场上便已空无一人。\n\n难道说，记忆也是这样吗？难道说，八九年那段欢欣鼓舞的日子，人们真的已经忘得一干二净？学生们在天安门广场和平抗争的时候，整座城市都受了理想主义精神的感染，欣然漂浮在一片善意与慷慨的海洋。一夜之间，社会风气发生了神奇的变化：人们不再推推搡搡，大喊大叫；街头偶遇的陌生人会用灿烂的微笑相互致意，比划 V 字手势，或是客客气气地讨论各种社会问题。出租司机免费接送学生，小店老板也纷纷向绝食抗议者捐款。我记得，当时有传言说，就连小偷都受了高尚情怀和团结精神的触动，停止了盗窃行为。再往后，政府调遣士兵来加强戒严的时候，成千上万的普通北京市民挺身而出，在枪口下劝阻那些士兵，不让他们执行命令。我曾经亲眼看见，白发苍苍的老太太躺倒在大街上，栏住了政府的装甲运兵车。\n\n八九之后，我第一次回国是在一九九一年初。那时候，北京人在公开场合都显得无精打采，满怀戒心。每次参加社交应酬，我一直都能感觉到那种潜藏的紧张气氛：很多人讲话小心翼翼，只要一提到「六四」，有些人就噪音发颤、强忍眼泪。我到现在还记得，在一个朋友家里吃晚饭的时候，席间的话题偶然转到了当时风传的一个谣言，说北京马上会有大地震。有个人开玩笑说，那好歹得把震中安排在李鹏的脚下吧。李鹏是当时北京最招人痛恨的人物，大家都认为他是六四屠夫。另一个人却说，就算有这样的大地震，肯定也会有直升机把李鹏提前接走，那些高干都有这种特权。前一个人苦笑起来，垂头丧气地说，「那看来还真没办法弄死他了！」听了这话，屋子里一片寂静，许久无人开口。\n\n从一九九二年开始，社会氛围发生了戏剧性的变化。邓小平在那一年的年初发表南巡讲话，给范围更广、速度更快、尺度更大的市场化改革开了绿灯，于是乎，人们似乎从一段漫长压抑的冬眠之中瞿然醒觉，看到了一个充满机遇的广阔世界。有的人大惑不解，也有人惊慌失措，更多的人却忙不迭地行动起来。商业化的大潮席卷北京，冲垮旧有的结构，打破旧有的习惯与依凭，抹去旧有的幻梦与浪漫情怀。这城市又一次热闹起来。港台的影响迅速扩大，贸易和商业揽住了大众的想像。「下海！」成为了新时代的口号，要下的则是生意与买卖之间的「海」。浮现前方的景物，对那些年轻勇敢的游泳健将来说是一道激动人心的全新地平线，对于另一些人来说，则只是全新的惊吓和恐怖。这城市变成了一口热气腾腾的巨型汤锅，所有人都在你推我搡，都想从里面分一杯羹。热火朝天的光景已经回归，到处是漫溢的精力、希望和梦想。然而，这种光景与一九八九年貌同实异，从某种根本意义上说，北京人的面貌和内心感受从未如此孤单。人与人之间的友情今非昔比，以至于松子有一次问我：「要是你把一个点子讲给朋友听，朋友却拿看你的点子去挣了大钱，遇上这种事情，美国人会怎么做呢？他会向这个朋友开价要钱吗？」\n\n许多人都对我那个编辑转行炒股专家的朋友艳羡不已，视他为快速成功的时代先锋：其他人刚刚起步，可他已经盆满钵满，生意兴旺。有一天晚上，我俩从一个共同的朋友家里出来，我已经错过了末班公交车，他便骑自行车送我回家。路过一条幽静小巷的时候，他提醒我，一九八九年的时候，我俩曾经沿着同一条路线一起骑车。接下来，他突然向我倾诉，说他十分怀念那段日子，每隔一段时间，怀旧情绪就会涌上他的心头。「通常是在夜里，往事会一下子闪回来：那些同人杂志，那些沙龙聚会，还有那些通宵不眠的讨论，全都是那么地激动人心。那时我们有一个群体、一种归属感，大家同心协力地做事情。我们当时不觉得，可那是我们这辈子最好的时光。」\n\n「我可没时间址这些闲篇儿，」北京的一个二十出头的影像艺术家告诉我，「这年月，时间就是金钱，行动胜于语言。只有那些思想守旧的人，才会坐在那里闲聊旧日的事情。」\n\n有个四十出头的作家写过一些关于文革的短篇小说，在八十年代名噪一时。有一次，他跟我聊起了复杂而微妙的中国古代星相学，然后便若有所思，轻声说道，「这个国家有很多不散的阴魂。你只要望一望气，看一看天，就明白了。周围飘荡着那么多屈死的冤魂，必须得想出办法来安抚他们，要不然，总有一天，他们会把我们所有人一起拖进地府。」\n\n记忆是有代沟的。我这代中国人出生在五六十年代，被人们视为红色的子嗣。当时流行着两句豪言壮语，一句是「生在红旗下，长在红旗下」，一句是「祖国的花朵」，用来概括我们这代人的无比幸运。文化大革命是我们的成年礼，成年体验则是铺天盖地的政治狂热——狂呼乱叫的群众集会、对于伟大舵手毛主席的疯狂迷信，以及假充教育的洗脑宣传。一方面是对领袖的迷信盲从，一方面又是社会的彻底无序，这便是我们青春时代的主食。我们都被塞进了一列疯狂飞奔的红色火车，一头冲向重创身心的幻灭。\n\n我们这代人，兴许注定要背负十分沉重的记忆，不光有甚于我们的弟弟妹妹，多半还有甚于我们的父亲母亲。父母那一代的许多人，入土之时依然保有他们的信仰，还有随之而来的荣耀，我们这代人呢，还没有步入中年，就已经失去了自己的信仰与荣耀。我们是天之骄子，只可惜误入歧途，是美好的期许，只可惜化为泡影，是一群小天使，只可惜莫名其妙地头上长角。我们从历史当中得到的教训是，绝不能容许历史重演。这确实是一个值得铭记的重要教训——可是，我们有什么理由要求其他人为我们的过去背负同样的担子、产生同样的感受呢？说到底，我们自己不也对念念不忘自身历史的父辈十分反感吗？我们的弟弟妹妹并没有多少关于文革的记忆，我们的儿子女儿也不会记得天安门。他们也许会从历史书上读到这些事情，从电影里看到这些事情，从饭桌上听到相关的故事——但愿如此。然而，他们多半不会对这些事情产生同样强烈的感觉。相较于难得轻松的我们，他们会有一种轻松的生活态度——但愿如此。\n\n话是这么说，关于中国人集体记忆的那个问题还是在我的脑子里萦回，啃噬着我的心。\n\n这是个没有人忏悔罪孽的国家。社会遭受大规模的破坏，滔天恶行肆虐人间，千百万人死于饥馑与迫害，子女揭发父母，丈夫批判妻子，党支书点个头就可以使人出卖朋友——这一切都是铁板钉钉的事实，但却从来没有人愿意挺身而出，公开承认自己对他人行下的不义。备受推崇的「自我批评」，只有在个人向党组织认错的时候才会见诸实践：你可以承认你对不起组织，哪怕你心里并不这么想。与此同时，社会既不鼓励也不要求其他形式的忏悔或自我反省。事实上，心理问题很难用中文进行探讨，汉语缺乏适当的词汇储备，不方便人们剖析内心的痼疾。人们对待心病的态度，通常是避而不谈。\n\n过去就让它过去，我们要向前看，这不光是党炮制的愚民格言，也被许多人视为中国民众的当务之急。每个人的柜子里都藏着冤鬼，打开一个柜子，事情就没个完。也许有人只好上吊，要么是再一次相互揭短。随之而来的可能是一场铺天盖地、捕风捉影的盘查，葬送掉所有的一切。过去可能会接管现在和未来，国家也可能再次变成一个巨大的坟场和战场。你可以指望中国人逆来顺受地承当苦难，却不能指望他们在有机会爆发的时候保持克制。这是个古老的民族，可他们的情感年龄估计还停留在幼儿阶段。有个著名的中国电影导演曾经向我哀叹，「中国的国民心理实在太幼稚！所以中国人至今需要一个高高在上的明君。」\n\n有鉴于此，尽管出于一己私利，党这种捂紧嘎盖子、迫使国民只顾眼前的政策的确包含着些许务实的智慧。看看波斯尼亚的情形，再看看前苏联的状况，难道说它们还不能提供足够的教训，还不能提醒人们，过去不能记得太牢、老账不能算得太清、历史不能推倒重写吗？那样干的话，结局无非是血流成河，天下大乱。中国人可比他们聪明。让我们团结一致，让我们继续前行。\n\n当然，如果前方没有束西可看，「向前看」的政策就行不通。事实证明，前方的这个「东西」，不过是一个巨大的「￥」。由此而来的是一句举国流行的双关语，「向前看」变成了「向钱看」。说来也巧，这两句话的中文读音刚好是一模一样。比这个例子更能揭示真相的故意混淆，实在是不太好找。\n\n赤裸裸的金钱欲望，不加掩饰的自私自利，彻头彻尾的不顾廉耻，环境破坏，虚无主义，庸俗市侩，腐败成风，社会不公：我们不断听到这类关于中国新现实的抱怨和针砭，精英文化评论家是这么说，普通市民也这么说，那些没享受到经济繁荣新成果的人更是这么说。这类控诉一针见血地点出了后天安门时代中国发展的黑暗一面，有时也难免失于偏颇，沦为一种道德说教，光盯着这块巨型画布上的黑斑，忽略了它五彩缤纷、变幻不停的纹理。今天的中国正在经历史无前例的混乱变迁，到处都是对未来影响复杂甚或无法预计的现象。倘若控诉者用高高在上的道德立场来掩盖控诉的真正源头，也就是新现实带给他们的不适与困窘，这类控诉便更加值得商椎。\n\n徐先生是我一个北京密友的父亲，他就对中国在邓小平治下的变化深恶痛绝。徐先生是个新近退休的中上层管理干部，离职的时候满怀自豪，因为他履历清白，党待他也不薄，给了他不错的社会地位和物质待遇。然而，这年月物价飞涨，社会上又突然涌现了一批暴发户，相形之下，徐先生的社会地位和收入水平便发生了急剧的下降。他牢骚满腹，叫苦连天，成天都在不胜其烦的妻儿面前控诉腐败，控诉社会不公，控诉戕害中国社会的种种邪恶。他抱怨的许多事情都是真实的存在。只不过，同样真实的是，他这种观念背后还有一个简单的深层次原因。我这个朋友告诉我，「七十年代，我老爸天天晚上都喝酒，还配上几碟小菜，其中至少有一碟荤菜。那时候，没几个人有能力享受这样的奢侈。现在他还是天天晚上喝酒，小菜却通常只有一碟，有时候只是花生米或者腌萝卜。有钱的年轻人大摇大摆地出入那些新开的豪华饭店，可他却去不起。你说说，他能不觉得失落吗？」\n\n我认识许多这样的人，他们都对今天的中国很不适应，产生了强烈的失落感。举例来说，我那些长辈亲戚、叔叔阿姨们就觉得，自个儿的处境跟徐先生多有相似。我高中时代的一些伙伴则困在了国营工厂的低技能岗位上，这些工厂已经奄奄一息，发不出适当的加薪和奖金，致使他们无力应付越来越高的生活成本和生活水平。我那些知识分子和艺术家朋友也是如此，他们都在自个儿的专业领域经受了猛烈的文化冲击，不得不努力寻找方向，努力适应政治和文化狂暴紊乱的商业化进程。我听过他们谈论失落，也听过他们谈论收获与希望。\n\n也许，正是因为后天安门时代的中国包含着这么多难以界定的因素，令人如此爱恨交织，我们才应该格外谨慎，绝不能率意评判，草草论定。\n\n对于中国民族主义的恐惧是一个值得探讨的话题。中国一方面步入了经济增长的「亚洲模式」，一方面又实施着严厉的政治控制和思想控制，有鉴于此，中国会不会兴起西式的普世主义，会的话又在何时，可说是一个见仁见智的问题。事实上，由于共产主义意识形态日益变成一个空壳，中国官方正在日益频繁地乞灵于民族主义，靠它来把国家拢在一起。由于中国有过一段摆脱西方宰制争取独立的历史，民族主义在中国确实很有市场。面对中国雄心勃勃的军备建设，许多西方人都对中国高涨的民族主义情绪产生了警惕。这样的情绪若是受到奸恶政客的利用，可能会对未来的世界和平造成灾难性的影响。\n\n中国的国内局势，则是以经济的野蛮生长为特征。发展不平衡兴许是高增长时期必然会有的副产品，但却导致了普遍蔓延的社会不满情绪，以及中央控制的进一步削弱。中国人害怕动乱的心理根深蒂固，从领袖到普通民众概莫能外。既是如此，我们不难想象，一旦出现危机，民族主义修辞的号召力完全可能成为暴君的工具，成为暴力的辩词。\n\n另一方面，我们也不能忽视一些反制民族主义的因素。以我之见，那种会导致仇外情绪和战争的民族主义，通常要在民族自尊受损、民族意识高涨、民众强烈渴望集体归属的时候才能大行其道。然而，中国正在经历的或许是这样一个历史时刻：经济重构和重商主义已经衍生并固化了太多的自身利益和地区间相互依赖，已经在个人、集体和国家之间撑开了太多的裂缝，以至于民族主义话语正在慢慢丧失它的号召力。要想兜售民族主义的宏大叙事，要求个人或群体为之支付高昂的代价，已经是一件越来越难的事情。\n\n中国申办2000年奥运会的过程，就是一个很好的例子。那时候，许多西方人看到了中国公众对政府宣传活动的表面支持，便把它当作民族主义情绪飙升的征兆，很少有人留意到表层之下的暗流。中国申办失利之前及之后，我刚好身在北京和上海，其间我虽然听到了一些支持政府的爱国言论——奇怪的是，这类言论大多出自知识分子之口——同时也听到了许多反对申办的声音。一九九三年，上海市政府奉中央政府之命主办所费不赀的东亚运动会，为此不得不自筹资金，要求所有的普通市民捐款。国际奥委会主席出席了东亚运动会的开幕式，上海民众据此认为，东亚运动会不过是中央政府的一场申奥表演，意在证明中国举办奥运会的经济实力和组织能力。我在上海见到的人无一例外地反对东亚运动会，不光是公开嘲笑这件事情，私底下还对政府怨声载道。尽管如此，你在公开场合看到的却是这样一幅场景：城市打扫得干干净净，来自邻省的穷苦民工统统被赶出上海，为期一周的运动会结束之后才可返回，当地媒体也尽职尽责，高声发表着全心全意的支持言论和宣传口号。\n\n口是心非的支持，在北京也是一目了然。整整一年的时间里，首都到处都是支持申奥的口号、布告牌和媒体宣传。但到了私人场合，在家里面、饭桌上或是筵席间，许多北京人都说，申奥「主要是政府的面子工程」。各种段子通过北京的小道消息网到处流传，挖苦那些官方安排的群众申奥表演，以及官方向来来访的奥委会代表秘密行贿的勾常。许多人忧心忡忡，怕的是万一中国申办成功，政府就会为意在炫耀的大型体育场馆和高速公路疯狂花钱，不把钱用于这个城市真正需要的居民住宅和商业场所。西方媒体纷纷报导，奥运主办城市即将宣布的时候，大批的中国人聚集在了天安门广场，焦急地等待着庆祝中国申办成功。可等到结果宣布之后，许多北京人都告诉我，奥运主办权给了悉尼，他们只觉得如释重负，还觉得「他们比我们更有条件办奥运」。\n\n重商主义和私营企业的繁荣确实给中国造成了新的问题，但也帮着化解了一些旧有的怒火与郁闷。随着生活日益轻松，钱包日益充实，人们也许会自信增加，怨气减少。不光如此，他们还可能对意识形态宣传更加警杨，更不会轻易追随极端主义的潮流。此外，过去一百年的战争和官方政策频繁打出民族主义的旗号，结果却只是巨大的破坏，因此我们当可期望，中国人已经从中吸取了重要的教训。\n\n中国固然可能呈现民族主义驱动的扩张势头，但也可能陷入另一种局面，那便是「乱」，后者同样是人们普遍恐惧的变局。原因何在，想想中国政府或社会崩溃之后的难民潮就明白了，整个世界都会被它淹没！更别说，像中国这么巨大的市场一旦崩盘，必然会产生重大的经济和政治后果。\n\n然而，「乱」也是一把壁刃剑，它一方面十分危险，特定条件下甚至可能导致文革一般的国家瓦解或极度无序，一方面又可能催生翻天覆地的积极变革。毋庸置疑，中国目前的混乱状况有助于松开旧结构、旧等级和旧观念的五花大绑，有助于激发新的建设活力与创新动力。经济变革的初期往往缺少明晰的规则、秩序和法律，为许多冒险家——其中有中国人也有外国人，有地方政府，也有文化产业从业人员——提供了可乘之机。私营企业大量成立，身上只披了一层公有制或集体所有制的薄薄外衣，香港、台湾和美国的资本家和投资商也纷纷借由合资企业进军中国。为数众多的地方政府，尤其是富庶南方的地方政府，一直在跟中央政府玩经济和政治的猫鼠游戏，不露痕迹地把地方经济和社会生活推向一个更加开放、更加自由、更加国际化的未来。作为本书探讨的重点，中国的文化景观也已变得更加多元。生长于新与旧、官方与民间、精英与商业、本土与国际的夹缝之中，后天安门时代的许多文艺作品，往往呈现出杂糅的特征，而这些作品引发的众声喧哗的讨论，也已经变得更加开放。这些持续变化的文艺品味，还有日常生活重于政治的新观念，既是源自中国社会的内生需求，也是港台美国外来影响和引进模式的产物。经济层面和文化层面的杂交进程发挥了重要的作用，有助于消解旧有的意识形态一元专制，同时也有助于培养一代新型的中国人，他们更关注生活方式，对革命无甚兴趣。\n\n经历了整整一个世纪的战乱与革命，付出了十分惨重的人道代价，中国似乎最终走上了「和平演变」的道路。在她迈向现代化的漫长跋涉当中，这是个意义深远的重大转变。在那些较为乐观的渐进改良派看来，天安门事件体现的也许是激进革命派改变中国的悲剧性最后一博。当前的道路同样会有人道的代价，并且意味着大量的妥协与拖延，然而，许多人依然相信，长远看来，这样的变革之路可以用较小的人道牺牲换来较大的收获。\n\n就目前而言，从「中国特色共产主义」向「社会主义市场经济」的缓慢转变仍然显得变量丛生，前途莫测。很长的一段时间里，中国多半会继续呈现一种非驴非马、不伦不类的「四不像」状态。中国的转变进程极其复杂，常含讽刺，本书的各位主角，便是这一进程不可或缺的组成部分。但愿他们的故事，能够让读者略窥中国生气蓬勃、斑娴多彩的时代风貌。"
		},
		{
			"post_id": 18,
			"title": "《巨婴国》读书笔记",
			"date_published": 1495712769.846,
			"body": "读的很慢， 说是笔记也很勉强， 毕竟不是边读边写的。\n\n知道这本书， 是因为看到有新闻提到书被真理部下架了， 真理部认证的一般都是好书吧， 所以找了电子档来看。\n\n---\n\n好吧, 对于论述类的书籍, 看起来有些费劲, 虽然大多数的观点都比较赞同, 但感觉啰嗦得没完没了, 已经失去耐心. 到现在(2017-7-24)为止也还没看完. 呵呵."
		},
		{
			"post_id": 17,
			"title": "关于大陆对台部署的导弹",
			"date_published": 1489025863.966,
			"body": "这两天与人提到台湾的独立问题，对方说到台湾没有能力独立， 其民意也不支持独立。\n\n第一个问题， 我的回答是台湾现在是事实独立的，而且也没有听过哪个地区有没有能力独立的说法， 如果说这个能力是指应对反对其独立的力量的话， 那倒也说得过去。 但通常意义上对能力的理解，我以为他的意思是在于其独立经营那片地方的能力， 南太平洋上有些很小的孤岛上也居住着一些原始部落， 他们也是独立存在的。 如果说是前者， 台湾明天宣布独立的话， 它会以什么国号呢？ 中华民国还是台湾共和国。 大陆会不会真的发动战争呢？\n\n关于独立的民意调查， 台湾大概每年都有的吧， 确实， 最大比例是支持维持现状的， 希望很快宣布独立的比例都不算大。 我提到大陆部署在东南沿海的对着台湾的导弹， 会否影响民意呢？ 台湾政客媒体都有公开提到这些导弹， 而且也从来没有听到过大陆官方的否认， 所以我认为这些导弹部署是事实存在的， 但是不是对准台湾倒是值得商榷， 因为大陆军方也绝不会公开宣称说这些导弹是为台湾准备的。 从维基百科找到一篇文章： [https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9C%8B%E4%BA%BA%E6%B0%91%E8%A7%A3%E6%94%BE%E8%BB%8D%E5%B0%8D%E8%87%BA%E7%81%A3%E9%A3%9B%E5%BD%88](https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9C%8B%E4%BA%BA%E6%B0%91%E8%A7%A3%E6%94%BE%E8%BB%8D%E5%B0%8D%E8%87%BA%E7%81%A3%E9%A3%9B%E5%BD%88) （中国人民解放军对台湾导弹）， 有比较详细的部署情况和类别说明以及部署变化情况， 有些数据据说是来自美国军方， 从这些资料大概可以确定导弹确实存在， 基本是公开的秘密。 那么， 这样的情况， 对于民意肯定是有影响的， 但具体有多大程度的影响， 期望台湾下次的民调能加上一个选项： 不公开宣布独立是因为导弹。\n\n后来说， 台湾有蛋就独立试试。 我说谁也不敢拿几千万人的性命开玩笑， 谁也不能保证大陆的导弹不会打向台湾， 再说大陆是一个人说了算。 话题又被转移了， 大陆是不是一个说了算呢？ 包子即使现在还不到这个程度， 也是在向这个方向前进的路上， 现在说这个还是早了点。 那至少有一点是确定的： 是否发射导弹的决策系统是个黑箱子。 面对这个黑箱子， 台美是不敢以实际行动来尝试的。"
		},
		{
			"post_id": 15,
			"title": "川南老家的宴席文化",
			"date_published": 1476755315.539,
			"body": "这些年回老家， 一般都停留很短时间， 虽然离家不远， 但依然显得疏离。 个人性格比较孤僻， 所以一般朋友也不多， 在老家的同学啥的极少联系， 朋友就几乎没有了， 亲戚们也差不多好些年都没有走动了。 所以我可以算比较绝情断根的人了。\n\n偶然的今年清明回家， 3天时间碰巧遇到了两次宴请， 碍于情面都参加了。 其实回头想想有些许尴尬， 但我一般后知后觉也管不了那么多。 乡亲们熟悉的见面微笑打招呼， 其实我心里还是差不多认为是路人而已。\n\n---\n\n ** 大概总结了下特点： **\n\n1. 有生日或者红白事， 参加的人不是邀请的， 而都是主动参加的， 范围不止是亲戚， 还有乡邻\n2. 主动参加的， 很多情况下也不会预先通知， 所以主办者不能预先精确了解有多少人会来\n3. 对宴席的评价角度： 客人人数（多少桌）； 宴席丰盛程度（鸡鸭鱼王八虾蟹啥的最好都有）； 绝对不能有菜肴被吃完的情况， 会被传扬好久好远， 所以感觉是剩的越多主人越有面子\n4. 收的礼金数额， 宴席举办地的入口会有一个专门的接待点， 登记客人的礼金， 一般是根据与主人家的亲疏或远近来定标准， 各人的礼金登记表似乎也没有保密一说， 所以给礼金的数额则是对客人面子的衡量标准\n5. 回礼的档次， 客人给了礼金，主人给回馈的礼品就是回礼了。 客人一般也没有送物品做礼物的了， 基本都是现金， 但回礼则是以实物为主的， 偶尔有夹带小额现金的回礼， 礼品的种类相当有限， 一般就只有这么几种： 毛巾 碗 面盆， 也有收到过小瓶酒的，因为这个亲戚家的事业是在贵州经营酒厂。 早些年有回糍粑的（一个大圆饼上切下的一小块，硬的）， 近年基本没有了。\n6. 早几年比较热衷请乡村表演队来进行歌舞表演， 随着出场费的快速上涨（人工越来越贵，何况这还是特殊技能的人工）， 似乎现在少了很多。 这些乡村表演队，估计也是受当地宣传部门的管理， 必定会有至少一个节目是歌颂类型的。\n7. 逢10 的生日， 属于大寿， 会额外隆重得多， 但一般非10 的生日也不会摆宴席\n\n 乡村的人们， 一般平时生活还都是很节俭的， 但对于参加宴席这样的活动始终不敢拒绝， 虽然对于礼金的负担多有怨言。 母亲的解释是： 大家都要去，你咋个能不去呢？"
		},
		{
			"post_id": 14,
			"title": "同学聚会上一则关于MH370传言的分析",
			"date_published": 1474853979.474,
			"body": " 同学聚会上， 有人讲了一个言之凿凿的传言： 当年的马来西亚马航MH370客机失踪事件，其实是美国所为， 原因是航班上有一位中国间谍携带了美国军方重量级的情报。我当然是觉得这个传言非常荒谬， 有几个人符和说美国什么事做不出来。 当然对于我还有一个问题就是脑子慢， 一时没有想出合适的理由来否定这样的说法， 诚然这么多人认为美国是一个流氓国家这样的思维， 是官方常年努力的结果， 我如果试图改变他们的想法一定会徒劳，况且我也没有那样的辩才。 要是早几年，我即使拿不出什么合理的判断来否定，但也绝对会力争： 美国觉不会做这种事情。 当时没有再说什么，我甚至有些疑惑这个是不是还真有点可能性。 当然， 一贯的事后诸葛， 这个传言怎么破， 还是需要想想的。 似乎对于传言的可信度分析， 有一个比较容易的方向是从哪里来， 假设传言是真的，那它唯一可能的来源就是中国的情报机构， 情报机构向公众释放这样的信息有多大的可能性存疑。 而且接着推理， 如果中国掌握了美国袭击客机的证据， 根据中美长期以来公开互相谴责人权纪录的情况看， 中国怎么可能放弃这个搞臭来美的机会？ 一定会召开全球范围的记者会发布公开这些证据， 甚至向国际法庭提交这些证据。 这些事情都没有发生， 唯一的可能是他们并没有任何证据， 顶多是情报机构的猜测。 既然是一个猜测，那可信度就要打折扣了， 这样再反过来看看， 航班上有中方间谍的可能性又有多大呢？ 情报机构又是通过什么渠道来发布这样的猜测呢？\n\n 另一段的传言是失踪客机的搜寻， 多个国家都派出了舰船到失事海域去搜索， 并且逐渐扩大搜寻范围。 传言的内容是其实中美对于客机的坠落点心知肚明， 但就是假装不知道， 派出的搜救舰船的主要任务其实是收集这一海域的地理数据，甚至把某某港口也都扫了一遍。 如果前面的部分可信度不高， 那这部分的可信度是会受到牵连的。首先， 如果中美对于MH370的失踪位置心知肚明， 这样的消息从哪里来？ 中国军方和美国军方？ 军方怎会愿意释放这样的情报出来？ 这个唯一可能的来源是某位民间人士的阴谋论猜测， 既然是猜测， 听了笑笑就好。 这些海域应该基本是公海， 要收集地理数据什么时候都可以来， 没必要找个这样的借口。 而且搜寻范围也不太可能靠近军港的区域， 军港一定是有雷达系统的， 你有什么理由把雷达常规性覆盖的区域要再搜索一遍呢？\n\n 把这点浅陋的分析记录在这里， 只是想要提醒自己， 保持独立思考。 虽然有很多专业人士有更靠谱更专业的分析， 但传言依然如此盛行， 我们这帮40岁上下的人中也还有这么多容易轻信传言的， 我是不是应该觉得即使到了50岁也都还不敢乐观呢， 呵呵"
		},
		{
			"post_id": 13,
			"title": "历史的必然性",
			"date_published": 1474258254.764,
			"body": "很长时间以来， 都认为历史有一定的发展轨迹， 以为民主自由必然会到来。 可是历史上的每一个关键转折点， 似乎又都是偶然的， 怎么解释这些偶然事件一起来构成了一条必然的路线呢？ 量子力学？\n\n老毛到国共内战开始的时候， 也顶多能奢望与国民党划江而治； 日本关东军1904年就已经驻扎在东北了， 而且是应了大清朝的请求来打老毛子的。"
		},
		{
			"post_id": 12,
			"title": "关于家务的分担",
			"date_published": 1465693066.593,
			"body": " 这是一篇婆婆妈妈的文章， 写出来大概也没什么人有兴趣， 但这两天一个场景反复在脑中出现， 不写出来有些不吐不快的感觉。\n\n---\n \n 一个朋友， 关系很近也住在邻近， 他父母住在大概几公里远的地方， 前两年会偶尔接受他的邀请去他父母家蹭饭， 他父亲是很能干很会做菜， 每次去都很丰盛。 去年朋友出国一年， 这一年中我就几乎没去他父母家， 中间可能出现了什么误会，反正我对人际关系相当大条， 在朋友回来后也很长时间没再去过， 偶尔会在接送小孩的路上与老爷子碰上， 也都会笑着聊聊。\n\n 前段时间接到邀请， 因为当时感觉时间上有些突兀，就推托了。 这个假期再次邀请，于是欣然接受，买了盆植物作为礼物，在朋友父母家玩了一个下午， 他们家在城中荒地里开辟了一点菜地，种了不少菜， 带着小孩去参观过， 中间还是其乐融融。\n\n 当然， 这些都不是令我耿耿于怀的事情， 我对于老爷子一家是很敬重的， 对于丰盛的饭菜则是感激， 只是可能不善于表达和不知如何回报。 事情只是其中的一点细节： 饭后收拾完饭桌后， 除了他父母外都坐在客厅了， 厨房了一大堆碗筷留给他母亲在洗， 看饭菜的丰盛度推测他父母二人是从昨天就在准备了， 整个上午肯定都在忙活， 洗碗这个事情依然袖手于心不安。 于是我（又）尝试去厨房里帮忙洗碗， 却被朋友和父亲联手架了出来， 他父亲还是那句话： 你这样做我儿子都要不好意思了。 这意思已经很明确了， 我也顺着话对朋友说那你来吧， 结果我出来后，朋友还是依然在客厅坐下了。 \n\n 当然作为客人不能评判对方家里的情况， 反正这个事情这两天始终令我不安， 朋友大度的邀请我去他父母家里， 但准备饭菜的全部活他都不帮手， 甚至也不让我帮手（虽然帮不了啥）， 反复思虑中， 也许这种不安是我中间这么长时间内不愿意再去的原因之一。\n\n 昨天在电梯里和另一朋友就洗碗这类事情简单的说了几句， 他很有分寸的只是说他在岳父母家的话， 肯定会帮手的， 女婿和媳妇都会帮手， 反而是岳父母的两个孩子完全不会插手， 他这个意思是针对媳妇了， 当然这话不好说出来， 家长里短不是我们的风格， 明白就行了。 自己儿女不插手应该是从小在家的习惯， 似乎小孩只要学习其它的可以完全不管。 这个问题需要反思下自己小孩的情况， 女儿几乎从来不会主动帮忙，即使有时反复召唤也都听而不闻。\n\n 家务分担应该是个基本常识， 同是家人， 一些人在客厅安坐如素， 另一些人在忙活， 小孩子可以不说， 但成年人怎么也会有些许不安吧。 但对于父母， 很多人都会差异对待， 是家庭教育的问题么？ 还是逆反期即使到成年后仍然要延续？"
		},
		{
			"post_id": 11,
			"title": "中国大陆的政治社会转型，是否可借助宗教的力量",
			"date_published": 1463624048.499,
			"body": " 这个标题非常大， 但实际上我没有能力对这样一个问题做全方位的思考， 只能从中国大陆现实的角度来看， 是否有可能借助宗教而产生些许改变， 令社会向更文明的方向发展。\n\n 在思考这个问题前， 得先厘清这个题目中所说的宗教的力量， 具体指的是什么： 基督教 犹太教 伊斯兰 还是佛教？ 当然， 宗教始终是个敏感的话题， 我也没有做过任何深入的宗教知识的研究， 所了解的各类宗教的情况也就是科普级别的程度， 而且似乎以这样的了解深度就来展开相关问题的思考， 有点妄议的嫌疑， 不过我倒是不需要有这样的压力。 这里我只是对我所说的宗教进行一个粗略的范围概括： **可以与其它宗教 世俗社会 世俗政治权力和平共处， 不拥有世俗政治权力**。\n\n---\n\n 首先， 对于在共产党统治下数十年的中国国民来说， 绝大多数的学校教育都是无神论的， 而这样教育体系下的国民比例， 仍然在持续的增加过程中， 在这些人群中推广宗教， 阻力会非常大。 但另外一方面， 如果放任党国教育体系的狼奶荼毒，民族主义情绪蔓延的话，一旦政府控制力减弱的时候， 社会将充满暴戾之气。 "
		},
		{
			"post_id": 10,
			"title": "关于江苏高考减招抗议事件",
			"date_published": 1463473434.123,
			"body": " 我从另一个角度来看下这场抗议， 阴谋论下， 我觉得， 在现在中国的城市里， 想要组织一场有效的抗议， 难度确实大了点： 首先， 通讯平台都是很容易监控的， 满大街的警察 协警 大妈， 稍微有点风吹草动， 整车整车的警察分分钟就到跟前了， 封路 摄像， 那架势一般人得尿裤子。 如果现场已经聚集了一些人， 警察就用人墙圈起来， 只出不进， 最后剩下的不肯出来的直接抓进警车就走了。 所以像江苏这样规模的抗议， 我觉得是奇迹。\n\n **但是， 奇迹是不存在的。**\n\n---\n\n 从现在的社会现状来说， 大城市里的规模化抗议， 除了当地政府默许的情况下， 应该没什么机会能组织得起来， 我记得前年， 有一次因为彭州石化的项目， 网上有人号召到成都九眼桥散步， 到时件去那里一看， 尼玛满大街都是警察， 过街天桥上站满了警察还不允许行人上去， 街道两边的人行道上几步路的距离就有一组警察， 那个架势， 谁要是敢拿出个标语横幅啥的， 可以想象会是啥样子： 估计也就只有时间喊出几个字而已， 之后就别想有自主行动的机会了。\n\n但江浙一带似乎不同， 社会控制的严密程度与四川这样的地方不可同日而语， google了下“px 抗议”， 开头几项就全都是江浙一带近几年的关于px项目的抗议事件: 2011年大连， 2014年茂名， 2007年厦门， 2015年上海金山 。。。 四川前些年还出现过一次什邡的抗议铜矿事件， 不是大城市。 我很长时间来都是这样想的， 四川的严密社会控制， 与西边存在藏区以及市区内也有藏族人聚居地相关， 政府对于西藏的高压政策， 四川本地政府是担负了一部分工作的， 这个事情会影响其它事情上的处理手法， 于是就继续高压， 也或者是怕藏区人民会趁乱做点什么事情， 把局面搞得更复杂， 所以宁愿维持高强度的压力。 另外还有一个原因， 是当地人的思维模式和权利意识问题， 经济发达地区（北京不在此列）的人们普遍的权利意识要更强一些。 我以一个西部人的思维去分析东部人们的行为， 难免走偏， 所以上面的阴谋论也可能不成立， 我只是假设了当地的稳控力度如西部有同样的力度， 如果这个假设不成立， 就自然另当别论了。"
		},
		{
			"post_id": 9,
			"title": "南海争端的后续发展可能性",
			"date_published": 1463454557.029,
			"body": " 首先， 对于仲裁法庭的判决结果， 几乎可以肯定是有利于菲律宾的， 但具体细节还要等出来后才能知道。 我在这个假设的前提下来思考后续的发展。\n\n---\n\n 一种可能， 也是最大的可能， 仲裁法庭既然没有办法强制执行， 中共肯定就希望以强硬手段占据现有的岛礁， 甚至会进一步占据更多， 但菲律宾无可奈何， 僵持的情况下， 需要看美国人的决心， 但做这个决定很艰难， 如果一旦决定要帮助菲律宾夺下岛礁， 摧毁中共的军事部署， 就一定会发生武装冲突， 怎么确保事件不升级很重要， 现阶段中美都不可能有全面战争的准备。 所以这个可能的发展， 就是会有局部的武装冲突， 但双方都闷头整， 尽量低调。 最后结果是美军把中共人造岛上的设施摧毁， 中共撤出这一区域。\n\n 另一种可能， 就是不发生武装冲突， 僵持下去， 中共继续填海， 美国把航母群常规性的部署在这一区域， 双方互相瞪着。\n\n## 2016-5-18 的最新进展\n 根据BBC报道， 美国防部周3表示，两架中国战机以“不安全”方式，在南海国际空域拦截一架正在飞行的美国侦察机。\n\n _根据这样的情况来看， 中共显然是在试探美国维护南中国海的航行自由方面， 到底有多大的决心， 这对于任期不久的奥巴马总统是一个极大的考验。 当前唯一可以确定的事情是： 如果美国继续以现有的模式开展南中国海的行动， 中国方面必然会有更加激进的行动。 _"
		},
		{
			"post_id": 8,
			"title": "人类的后天行为， 会改变自己的基因吗？",
			"date_published": 1463147048.805,
			"body": "  如果说人类基因从幼年到衰老，始终保持不变，那我觉得这解释不了人为什么会衰老。\n 似乎看到有文章把衰老的过程理解为基因片段的流失或者损坏，导致复制的细胞品质越来越不好，甚至开始癌变。 现在的基因科学已经可以提取生物的基因序列了，但并没有发现有这方面的科学数据来证实这个假设。 如果变化是细微到并没有影响序列的程度，那我是不是可以说至少这个假设还没有被证伪，那是不是仍然可以在这个假设的基础上讨论一些问题呢： 基因是可以自然改变的，也并非指繁殖过程中的变异， 也排除如抽烟行为增加癌变机会的这一类行为,  我指的是比如学习/训练一类的行为。\n\n---\n\n请允许我发散一下思维， 先讨论一些相关性不那么强的内容。\n\n 在历史上，一些文人世家和官宦世家是比较常见的，像曹操的几个儿子 像徐志摩金庸貌似是姑表亲 布什父子，这些例子中，后代的成就，并非只是建基于父辈遗留的外部资源，很大程度上是优秀基因的遗传，反面的例子则有李鹏的两个子女。 这样的遗传，是基因遗传中大部分保持未变的结果，记得有位英国科学家说过，人类的基因序列，与猩猩的相似度超过99%，那么父母子女之间的相似度，就不知道有多少个9了。那么，在这些优秀人物的基因中，大概只有及其细微的一些片段决定着他们的这些才华的基础，而且能正好遗传下去，貌似这不是小概率事件，那么，这个片段最初是怎么来的呢？ 只是繁殖过程中的一次偶然机会产生的么？  遗传中到底好的与不好的基因特征， 哪一类有更大的概率呢？ 如果说好的有更大的概率（我倾向于相信这个假设，因为认为从大范围的情况来看，一代比一代优秀似乎比较明显）， 那么， 是什么力量在推动这样的筛选？\n\n  苏格拉底假设人类眼中的世界是另一个理型世界的投影， “理型” 这个词我理解为理想模型， 我们的世界并不完美， 但世界中的每一个物种， 都有一个理型世界中对应的完美模型， 每个个体都是这些理型的不完美投射。 柏拉图则假设这些理型并不是在另一理型世界的空间里， 而是在每一个物体内部。 每个个体都有一个完美形态的模型， 但现实世界的各种限制令他不能成为完美的个体。 这个假设在我看来就非常接近于现代科学中的基因理论了。基因总是趋向于复制完美一致的副本出来， 但环境的不理想总是在影响着这个过程， 导致结果总是不完美的。\n\n 话题扯回来， 我想到这个假设： 人类的后天行为可能改变了基因并且种改变可以遗传给后代， 是基于这样一种现象： 书香门第 官宦世家。 有天分的政治家， 即使非常有天分， 如果没有机会从政，没有机会学习政治相关的理论， 那其实是没有机会发挥这个天分的， 那外界也无从得知其有此天分。 现代社会的复杂度比较高， 分析起来各种因素太多， 不妨来看一个原始部落的一个模型， 分析这个部落产生第一个领导者的可能过程， 也许能更容易理解在自然状态中怎么发挥出领导才能， 然后在带领大家的过程中逐渐强化他的领导能力。 假设这个部落是以捕猎为生的， 开始在没有首领的情况下， 无人组织的捕猎活动，肯定效率并不高， 其中一个捕猎技巧高且经验丰富的人， 开始思考， 在某种捕猎情况下， 如果有另一个人协助的话， 猎物就不至于跑掉， 于是他去找另一个人， 来实验他的想法， 经过多次的尝试后成功了， 然后他们之后就总是联合起来捕猎， 发现猎获增加不少， 于是他继续发挥这种想法， 以前一个人打不过的大型动物，肉肯定要多很多， 更多人一起是不是就可以搞定呢？ 渐渐的他组织了更多的人一起来协作捕猎， 这些与他协作的人， 因为这些协作获得了更多的食物， 当然愿意继续听从他的调遣， 这种调遣， 逐渐也转移到了非捕猎行为上， 那么， 部落首领就逐渐成型了。 首领的领导能力也许在领导过程中会逐步提高， 但其最初展现的才能， 并不是经过训练得来的， 而是天生的， 也就是基因里的。 当然， 你也许会这样说， 他的最初才能， 难道不能说是通过狩猎过程的训练产生的么？ 这个好解释， 大家同样都会狩猎， 但就只有他开始使用了不同的方法， 这个就应该是跟基因有关。 \n\n  有了最初的才能展示后， 有了机会继续训练这个天分， 他的领导能力就会有所提升， 需要关注的是： 提升的仅仅是技巧呢， 还是真的会提升天分（基因）， 要想证明这个事情， 需要做这样的试验： 有同样天分的两个人， 一个有机会发挥天分， 一个没有机会， 那么看他们的后代的差异， 是否能发现有机会发挥的人的后代的天分有了明显的提升。 但这样的试验注定是没法做的， 现代的生物工程技术应该没有能通过基因分析获知一个人有什么样的天分的能力， 即使有了这样的能力， 因为遗传的随机性问题， 即使结果满足假设似乎也很难证明什么， 除非还要能够做足够多次的试验来重现这种结果。\n\n  所以这注定是一个不会有结论的想法。\n\n  倒是想到了一个反面论证的可能： 一个有政治家天分的人，从政后所获得积累的资源， 让后代（如果遗传了这一天分的话）有更好的机会继续发挥天分， 所以带来了这样的观感： 有效发挥了天分的人， 他的后代似乎有了更好的这一天分， 以为这是发挥过程强化了天分而遗传下来了。 大概只是一种错觉吧。\n\n 开头挖了好大的一个坑： 人为什么会衰老？ 这个坑我永远也没可能填平， 有兴趣的自由发挥吧。"
		},
		{
			"post_id": 6,
			"title": "人类的进化是否比其它生物更快？",
			"date_published": 1462882718.705,
			"body": " 在前往哈尔滨的飞机上，闲得无聊，看着自己的腿，虽然印象里两腿张开坐着似有不雅之像，但想要强行合拢，不久即会自行张开，合着感觉并不舒服甚至难受。why？ 观察旁边的女士，则腿基本一直是合拢的，如果她也会觉得不舒服的话，我认为也会在无意识间张开，但似乎并没有这个情况。 那坐下的时候腿的形态似乎就是男女有别，貌似是个有趣的问题。 我有个答案：man have ball, and ball need cold. 哈哈。 当然，这个现象根本没有统计学上的支持，也许只是旁边这位女士的修养比较好，能够克服那点不舒服。\n\n---\n\n 昨晚写下的一段文字，认为哺乳动物是通过精子的数量及超高的淘汰率，来实现更高速度的进化（依据达尔文的进化论）， 那人类与其它哺乳动物也是有较大区别的，在哺乳中，似乎也只有人类会把性作为娱乐活动，这导致了更高比例的变化与淘汰，虽然很多精子并没有参与到繁衍的竞争中（比如手上 嘴里 墙上 和套套里），但维持高的生产率仍然是很重要的，比如成年男子长时间的无性生活，其精子的活性就会大大降低，更长时间甚至可能导致勃起障碍，所以以此为娱乐的人类，通过远超其它物种的生产淘汰率，从而实现了更高速度的进化。 这个有点像宇宙的加速扩张，生物的进化也是越来越快， 在更高级的生物中，会逐渐产生更高效的进化方法。\n\n 衍生的一个问题， 人类以精子来实现进化，这个假设如果成立的话，那么，人类进化的主要任务是由男性完成的，先祖们是不是冥冥之中知道这样的情况而决定了历史上男女地位的不平等？ 当然，最初的人类社会是有母系社会的，但谁又能说发展总是一帆风顺的呢？ 貌似柏拉图有一个观点是认为对于两性的关系，男人是播种的，而女性则提供了土壤。\n\n 突然觉得，像这样随时记录下自己的想法，不管有没有与人分享，都是一种乐趣，从思考中寻得快乐，会不会是快乐最纯粹的形式？\n\n 虽然我不能说人类是地球生物中唯一会思考的一个物种，但肯定是思维能力最发达的生物，如果地球上还有其它生物比人类有更高智商的话，他们会不会如此甘于寂寞而放纵人类如此嚣张？ 也许有吧，神。他们不屑于与人类争夺生存资源，或者他们的食谱根本就不是我们能想象的。\n\n 先天的知识，这个大概就是指本能了。动物获得自然界的知识，主要的途径是通过自身的经验，但人类有了语言和文字，有了此种无限无界的学习途径，人类所能获得的知识的量，则是其它生物难以望其项背的。\n"
		},
		{
			"post_id": 5,
			"title": "关于人的进化，变异+淘汰",
			"date_published": 1462791220.306,
			"body": " &nbsp; &nbsp; &nbsp; 达尔文的进化论里， 进化的两个关键主因， 一个是个体变异， 另一个是淘汰。 之前对于这个理论应用于人身上有些困惑。 变异自然不说了， 儿女与父母还没有听说有一模一样的， 但对于淘汰， 如果说近现代以前的人类历史里充满了战乱与疾病， 高的死亡率满足淘汰这一理论要素的话， 但进入现代医学如此发达以及长久和平的情况下， 淘汰这一要素是否已经失去了？ 那人类的进化是否在减速呢？\n\n---\n\n &nbsp; &nbsp; &nbsp; 但实际情况显然不是这样的： 人类的整体寿命也好， 身体机能也好， 智力水平等， 都没有表现出进化减速的迹象， 而是在加速（这个只能臆断了， 我没有什么数据可以支撑这个观点， 只是从科技水平的加速发展的情况来推论）， 那么是否可以说：人类进化已经脱离了达尔文的进化论规则？\n\n &nbsp; &nbsp; &nbsp; 有一天我突然想到了一件事情： 精子。 爬行动物/鱼类通过大量繁殖，通过大量的幼体但极少数存活下来这样一个 变异-淘汰来进行着进化过程， 但哺乳动物却采用了更高效的方式： 极大量精子的变异-淘汰 来实现进化， 假设可以以变异个体数量以及淘汰的个体数量比例来衡量进化速度的话， 那么哺乳动物的进化速度与爬行动物比起来， 真的是数量级上的差异。 这个也能解释为什么爬行动物经过了如此漫长的进化时期但变化不大， 但人类从类人猿进化到现代人也不过数万年。\n\n有一个前几天想到的话题。 老婆给女儿买的绘本里她推荐两本犹太人宗教故事的给我看看， 因为最近我对宗教的话题比较感兴趣。 一本是光明节的故事：  一个犹太人村子在山顶的教堂被妖精占据了，妖精禁止人们过光明节，路过的主角以智慧战胜了妖精并让光明节重回村子。 令一本是泥巴人： 城市里的犹太族群长期受着其它族裔的诬陷与歧视， 危机关头拉比召唤了泥巴人来保护犹太人， 在破除谎言以及抵挡了一次大规模攻击后， 国王答应保护犹太人的安全后拉比把不情愿的泥巴人送回到土了。  因为正好在想人类进化的淘汰的问题， 犹太人里有如此多的天才， 如爱因斯坦 佛洛伊德， 我说： 是不是因为犹太人在历史上***长期受着迫害， 淘汰率很高***，因此进化速度更快？"
		},
		{
			"post_id": 4,
			"title": "杂谈一篇",
			"date_published": 1462599479.425,
			"body": "我理解的Blog的发布方法，就是写了新文章后，在控制面板中 sign & publish, 不知道这个有什么问题没， 昨天写了一点但更新失败， 从代理也看不到文章的更新， 希望有知道的大婶告知下什么情况。\n\n因为才看过《苏菲的世界》这本入门级的哲学史， 以前对于这样一门学科是完全陌生的， 看过之后感觉所受启发良多， 有点欲罢不能， 于是继续在wikipedia上找一些书中介绍到的哲学家的资料来看， 之前尝试用佛洛伊德的潜意识理论（其实也就只是直到个基本概念而已）来解释宗教的一些现象， 用康德的说法来解释为什么即使证实不了神的存在也需要坚持宗教。 然后今天看了下康德的wikipedia里的哲学理论体系介绍， 发现基本上要看懂这些介绍都有些困难， 才明白自己有多浅薄。 在哲学的森林里摘了一个小枝条就妄想用这个枝条来建造一个屋子。\n\n---\n\n但是思考本身并没有对错， 自己只是一介凡夫，没有哲学家那样深邃的洞察力和严密的思维能力，也没有指望自己能达到哲学家那样的理论高度， 但我可以开始学习已有的理论， 开始思考以前不曾思考的问题， 这对于自己来说， 纵向比较下也算有了些微的进步， 这就是值得嘉许的地方。 又想起 《3 idiots》里的经典台词\" All is well\"\n\n我将自己的思考以文字记录下来， 发布在这里， 相当粗浅简陋， 所以有路过的看到了，指出我的愚蠢也好， 反对我的观点也好， 甚至有些许赞誉， 都非常感谢。 所以如果有留言， 什么话我都接受， 我都感谢。\n \n在康德的维基词条中， 有讲到康德的一生以1770年为标志分为前后期， 前期研究自然科学， 后期则致力于研究哲学， 他生于1724年， 46岁开始转而研究哲学。 这让我想到牛顿， 也是在晚年改为研究神学。 这部分我是读出来给老婆和小孩听的， 老婆说上了年纪就开始细考哲学问题， 哈哈。 又让我想起了我的初中物理老师， 他在讲到牛顿晚年改神学的时候， 大概意思是年老糊涂了，这似乎表现出老师的认知也相当有限。 老婆说以老师当时能接受到的知识体系来说， 这样的说法并没有错。 我： 可是，老师他怎么能认为自己的思想能够超越牛顿这样的伟大物理学家呢？   现在我再回忆这句应答时，才觉得自己的浅薄真是挺深刻的。 虽然我认为谦卑是美德， 但不我能要求别人必须具有这个美德， 每个人都有选择是否谦卑的自由。 另外一点就是如黑格尔的一个观点： 理性如一条河流， 在不同的位置不同的时间来观察， 都是不同的。 即使10年前的我自己， 不也一样认为宗教都是挺扯淡的么？\n\n也许， 上了年纪， 才会开始思考一些不同的问题。\n\n\n\n"
		},
		{
			"post_id": 3,
			"title": "理性与道德，是与生俱来的么？",
			"date_published": 1462413615.965,
			"body": "这样的标题很有些装逼， 但我真的不是装， 我是真的在思考这个问题。\n\n前一篇文章我写了一些关于生物本性的东西， 我是认为最根本的本能是繁衍， 人性也是逃不开这个本性的， 但如果完全以本性来作为一切行动的准则， 似乎连动物界都不答应。 比如一头狮子争得狮王地位后， 其他的雄狮就会远离狮群， 如果这些雄狮要完全遵循繁衍的本能，就会一直不顾性命的要跟狮王争个你死我活。 但事实显然不是这样， 落败的雄狮会离开后积攒力量和寻找机会。 我没有做过研究它会不会去别的狮群碰碰运气或者做点别的什么事情（比如偷偷找个狮群里的相好母狮交配啥的）， 但它放弃死缠烂打对于整个狮群来说是有利的， 那我认为这是落败雄狮的理性。\n\n---\n\n繁衍， 并非只是生物个体的使命， 同样也是一个物种群落的使命。\n\n我这样来定义理性： 如果个体的繁衍本能与所在群落的繁衍使命相冲突的时候， 会选择让位于群落使命的行为。\n\n在人类行为中， 大多数寻求交配机会（抱歉使用这样的称谓）的方式是“谈恋爱”和“结婚”， 而不是选择强奸， 强奸行为所顾忌的是社会的干涉力量（会被判很严重的罪刑）， 如果抛开这样的外在干涉， 那么选择强奸的情况肯定会更多， 个人认为依然是少数。 那可以考虑下为什么大多数人没有选择这种简单粗暴的方式而要改为复杂的行为。 繁衍不只是交配而已， 还有哺育后代。 大多数的生物没有这一过程， 但对于高级别的生物， 如人类 狮子， 其发育成长为成熟个体的时间要比其他生物长， 特别是人类这样要10几年时间的。 如果通过强奸达成的交配， 难以对后续漫长的哺育过程有任何保障， 如果哺育失败， 那其实交配仍然是失败的。\n\n为了更长远的利益而放弃当前暂时的利益， 可以认为就是理性。 生物界， 也并非只有人类才会有理性。 当然， 暂时我认为只有高级动物才有理性， 其它生物我不能否定其存在理性，但我觉得难以理解其理性行为表现， 就暂时不讨论了。\n\n说到道德，其实我并没有很明确的理解，虽然第一次看到康德定义的“道德原则” 的时候，惊为天人，但回头仔细想想，依然有漏洞， 他的原则出发点是换位思考。 我想给道德一个宽泛的定义： 由理性衍生出来的一种行为原则， 将把群落的整体繁衍利益总是至于个人繁衍利益之上。 虽然貌似可以认为道德是理性的升华或者更高形式， 但它们的适用范围其实是不同的， 道德主要是在群体中发挥作用， 而理性则在群体和个体的时候都要发挥作用， 因此我只认为道德是理性的衍生。 所以讨论理性与道德的来源问题上， 我想只需要理清理性的来源就大概可以了。\n\n讨论理性是否与生俱来， 如果只看生物幼体时候的表现， 似乎是不够的， 因为从人类个体的发展过程来看， 从幼体到成年， 其理性应该也是逐步发展的。 这个过程中理性逐渐形成并发展， 它的诱发因素更多的可能是外在环境的影响， 比如父母 教育 朋友。 这些因素都太过复杂和交错， 难以分析究竟哪些造成了影响， 需要找一些比较极端的例子来看， 比如偏远地区比较封闭的原始村落里的个人，他们接触的外界环境相对简单得多， 然后把他们与同样年龄段的城市人进行对比， 在一般意义上评估哪一类情况的人具有更多的理性。 当然， 我暂时没有机会去进行真实的实验， 如果有机会能做这个事情我觉得应该会比较有意思， 因为这涉及了更复杂的一个问题： 怎么来度量一个人的理性？ 所以我只能给出一个我想象的结果： 城市人应该会有更多的理性。 （这只是一个我的假设结论。）\n\n如果说接触更复杂的社会环境之后， 人类会具有更多的理性， 那我们来反推理性的来源： 是所处的环境令生物体产生理性。 所以理性并非与生俱来的， 与生俱来的是繁衍的本能， 理性则是因为环境的局限使生物体产生的妥协的结果。"
		},
		{
			"post_id": 2,
			"title": "关于人性 世界的思考",
			"date_published": 1462323343.687,
			"body": "关于地球生物的起源， 现在的科学界应该基本已经有了定论： 生命起源于海洋，宇宙射线令海水中逐渐产生出巨分子，然后演化为单细胞生物， 到多细胞生物， 然后有了海洋里的早期植物动物，逐渐产生的氧气使大气中的氧气比例逐渐升高， 然后在大气层的外层形成了臭氧层， 臭氧层的出现大幅削减了宇宙射线达到地球的强度， 于是海洋生物有了上岸的机会。 植物动物都分别向着更高形式的生命进化着。 这是达尔文的生物起源学说， 进化论则是关于变化和淘汰的： 生物的繁衍过程中持续产生着变化，虽然每一次的变化都极其细微，但漫长的岁月中这些细微的变化都累积下来了，这些变化的个体，对于环境的适应性有着不同的能力，部分更适应环境的个体有了更多繁衍的机会，于是其后代逐渐强大， 但对于不那么适应的个体，繁衍机会就会减少，于是其后代就会逐渐式微最终可能淘汰。\n\n---\n\n以上的内容是在中学课本里学的，但对于人类和自然界的各种事实的起源， 历史上人类进行过浩繁的思考，最初是以神话故事来解释，之后发展出宗教，哲学， 再之后是科学。 我理解的宗教对于世界和人类的解释是： 基督教 犹太教 伊斯兰教认为一切都是上帝创造的， 东方的佛教则认同转世轮回，世界及生物都是生生不息轮回的，并没有起源。  哲学则开始思考为什么自然界只有人类会思考有理性思维， 世界是否是更小的物质组成的。 \n\n从物种起源进化的角度来看， 一切生物的最根本目的是繁衍： 寻求生产子孙的条件； 寻求子孙成长的条件。 即使到了人类这样自以为万物之灵的生物，其实从种种行为中一样把这些原始本能表现得淋漓尽致。 但是人是否应该完全顺应自己的这些本能呢？ 这是个值得思考的问题。\n\n如果按照这样的本能来解释人类的行为， 那其实就没有什么罪恶可言了： 发动战争是为了争夺生存繁衍的资源， 屠杀种族灭绝也是为本种族开拓更多的繁衍资源。 即使有一天有外星人要毁灭地球，他们也可以以地球的存在威胁了他们自己的繁衍为借口。 极权政府限制公民的言论自由， 这可以看作是为统治集团的人在争取更优质的繁衍资源的行为。 这些在我们看来确实是罪恶的行为，从生物本能来说都不是罪恶。\n\n那是不是可以说人性本恶呢？ 如果繁衍是恶的话。\n\n可是我们明明知道有些行为是恶的，有些则是不恶的，还有一些是善的。 应该从什么样的角度来区分善恶？ 康德提出了一个道德原则： 如果我在某种情况下所做的行为，是我希望其他人在同样情况下也做同样的行为， 那这个行为就是符合道德原则的。 虽然这个原则看起来无懈可击， 但假设我是一个强者，我对自己的霸凌行为并不会后悔，我认为如果有别的强者也如此霸凌并没有什么不对。 难道这样的霸凌也是符合道德原则的么？\n"
		},
		{
			"post_id": 1,
			"title": "第一篇文章，關於宗教的祈禱儀式",
			"date_published": 1433033779.604,
			"body": "對於宗教， 曾有過諸多的看法， 經歷了很多次的轉變。 一般可能會以爲是從學生時代被無神論的教育影響開始， 但實際上， 最初的關於宗教的印象， 應該是從母親在家庭生活中的一些行爲開始的， 有對於祖先的祭祀活動，以及一些農曆節氣的各種神佛的祭拜活動，這些童年的時光其實始終留存在記憶中。\n\n之後才是學校中的無神論教育， 對於宗教信仰一概趕盡殺絕， 卻又要我們信仰共產主義， 這個就不多說了。 有很多次母親要去寺廟燒香拜佛，要帶我去，我從來都是嚴辭拒絕的。\n\n---\n\n這樣對於宗教的不屑一顧的態度持續了很長時間， 直到08年後開始習慣於翻牆上網，之後接觸到到的信息對於宗教的話題不再是一層不變的了， 有了多種視角來重新看待宗教的問題。\n\n看了一些非大陸官方的歷史類的書籍， 不多，因爲看書的速度實在很慚愧，但也逐漸瞭解到宗教對於整個人類社會的歷史進程有着如此深刻的影響，這是絕對不能忽視或者一言概之的話題。\n\n上週末去一座寺院裏閒逛， 先申明下把寺院當作公園來逛是我的不對， 表達下歉意。 看到的一場法事讓我想起宗教的本意是對生命 世界等終極問題的思考而演化來的， 宗教不是應該啓發信徒們進一步思考這些問題麼？ 可現實的情況是宗教的祈禱意識其實是相當空洞乏味且令人昏昏欲睡的，佛教的這個行走法事， 信衆們繞着場地一遍遍的走，嘴裏只有一句“南無阿彌陀佛”， 一直反覆的誦唸， 這不是在自我催眠麼？ 這不利於思考生命世界這些問題啊。 lp給了我啓發， 宗教並不是希望信徒重新思考這些終極問題， 而是宗教提供了這些問題的答案， 並提供了解決的方法，宗教對信徒的要求just follow me而已。\n\n上週的一天晚上與一朋友聊天的時候他說在英國的時候， 有信教的朋友在講述他們的宗教相關的事情時多人都提到了曾在祈禱的時候接受到了神的指引等類似的神蹟， 而且這些朋友也都是很嚴肅的講這些事情， 絕不是開玩笑的樣子。\n\n看《蘇菲的世界》這個哲學簡史的進度也正好講到了佛洛伊德的潛意識理論， 說人的過往經歷有些以爲已經遺忘的東西，其實都深藏在自己的潛意識中， 而且會不時的暗中影響着行爲和思考。人的夢境其實是一種潛意識的想法在發揮作用的具體表現， 但夢中的自己其實也還是在僞裝着自己。 人的思維中其實總是處在一種衝突狀態， 因爲從人的本性來說， 從生物進化的歷程的角度來看， 任何生物最根本的本能就是繁衍， 那具體到人則是性，人的思維中對於性的關注程度和比例遠比我們想象的要大，但現實的感受則是對性的罪惡感讓人有意識的壓制這些意識， 這是一個人腦中最重要的一個衝突， 另外一些其實都可以大概總結爲人生理心理的本能需求與現實環境或者社會道德約束等之間的衝突。 這些衝突從表面上很難看出有多嚴重， 但在潛意識裏這些衝突卻要表現的激烈得多， 因此人的大腦中其實一直處於這樣的衝突狀態， 這影響這人的快樂以及加劇現實的煩惱。 佛洛伊德是一個心理醫生， 他發展了一種精神溯源的精神療法， 就是在催眠狀態下讓病人追溯其過往經歷，找到對其產生巨大壓力的衝突的事件， 釋放這樣的壓力。 這裏提到了催眠。\n\n上面這3個方面的內容我想到了一些相關性： 部分宗教儀式其實產生了自我催眠作用， 在這樣放鬆的精神狀態下其實是一個令內心裏潛意識中的各種衝突得到舒緩的過程； 而這個過程的又有些類似與夢境， 潛意識裏通過宗教學習已進入潛意識的神蹟故事， 在夢境中再現了。 這大概可以解釋宗教儀式的作用。"
		}
	]
}