{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1623178920,
			"title": "Maybe systematically the problem isn't the FBI but the DoJ...",
			"body": "I don't say there aren't corrupt and treasonous agents at the top of the FBI, specially those in relation with the political bureau of the DoJ...\n\nOkay there is mueller, comey, page, stroke... etc.\n\nbut if I get things right, and maybe I am wrong, but who decide what is going on in the FBI?\n\nI mean it's the DoJ or the FBI itself\n\nthe case of flynn is interesting... who decided?\nthe arrest or roger is interesting... who decided?\nthe case of pedogate... who decided to not interview nobody?\n\nI mean there is a problem there... \n\nthe question, is that it seems there is no constitutional way out? if I get it right it could be the congress who should investigate, but if the congress is blackmailed by the FBI... \n\nit's a closed inextricable loop... \n\nbut again the DoJ fells out of the loop...\n\nand I have remark that the more something is out of the loop the more relevant it is in reality...\n\nI find specially interesting how AG Barr... the one who was in charge of pedogate after the cover up of the obama years... his daughter, accosta....\n\nthe only way out, is to defeat the DoD, conquer america, and capture all those involved to get at the bottom of those stories...\n\nnot that impossible... \n\nif you have other ideas?\n\nbtw in regards to pedogate, hitlary emails, are quite ridicule... okay she had her pay to play system... \n\nbut I bet heavily that \"bill\" was considered way too dumb to be even remotely involved...\n\nyeah...\n\nno one should be above the law...\n\nand first training kids (after having selected them) to then rape them... martial court...\n\nand fundamentally it's my biggest disappointment in the uniformed armed forces of the usa (from death squads cover ups to regular main grunts)... can't do.\n\nwhat?\n\nso weak... \n\nand in my sorrow, I still have one advice for you \"americans\", don't even seek to fight the \"rage of the dragon\"... \n\nread the \"boxers resistance attempt\"... some said hopeless... for me its the real start of the People Liberation Army of the People Republic of China...\n\nthose lives of involved in an hyptothetical pedogate in china would have been like a hand full of rice grain, turn and dropped...\n\ndevastating this lack of faith, courage, perseverance and endurance.\n\nit makes me think to the episode in the BlackList with redmington... what the fuck, nail this \"senator\" girl cartel style... and see what's getting out... \n\nanyway, what can I do...",
			"added": 1623178919
		},
		{
			"topic_id": 1623210982,
			"title": "Why the FBI doesn't investigate \"Ivermectin\" > then should the DoD regime change PERU?",
			"body": "Apparently Ivermectin is the real shit to fight and destroy covid viruses... okay... it worked in india and other places massively... however corrupt gov receive money from the drug traffickers, to make Ivermectin illegal and not used in covid backed by the WHO... \n\n so it's a binary event... Ivermectin works against covid or doesn't\n\nif it works which seems proven\n\ntime to death squad those govs... by putting bullet in the little heads of their kiddies with them behind...\n\nthat's what we want FBIers... not some gay shit\n\nany medias organization having bashed Ivermectin\n\ndeath squad...\n\nyou understand me? or not?\n\nyou are gay or not?\n\nhow you will be judged?",
			"added": 1623210980
		},
		{
			"topic_id": 1623215363,
			"title": "Why A Judge Has Georgia Vote Fraud On His Mind: \"Pristine\" Biden Ballots That Looked Xerox'd",
			"body": "https://www.zerohedge.com/political/why-judge-has-georgia-vote-fraud-his-mind-pristine-biden-ballots-looked-xeroxd\n\nyou see dear fbiers, you protect the drug traffickers, and those who conducted the regime change... happily state level investigation on election fraud aren't on your jurisdiction... and as you pretend to \"play by the book\" I am sure you have your dark teams already in motion to stop AZ or Georgia or Pensylvania or Wisconsin investigation...\n\nthat's how I see you... as criminals that will put down, aka executed for treason.",
			"added": 1623215360
		},
		{
			"topic_id": 1623215401,
			"title": "What Is The FBI Hiding About The DC Pipe Bomb Suspect?",
			"body": "https://www.zerohedge.com/political/what-fbi-hiding-about-dc-pipe-bomb-suspect\n\nwe ask.",
			"added": 1623215397
		},
		{
			"topic_id": 1623215470,
			"title": "yeaahhh execute : Dr. Soumya Swaminathan",
			"body": "she will get fragged !!! find her, data extract and then KILL HER !!! treason... how big is the indian army? ahahha... \n\nhttps://www.zerohedge.com/covid-19/who-chief-scientist-served-legal-notice-india-allegedly-suppressing-data-drug-treat-covid\n\n“Dr. Soumya Swaminathan has ignored these studies/reports and has deliberately suppressed the data regarding effectiveness of the drug Ivermectin, with an intent to dissuade the people of India from using Ivermectin,” the plaintiff said in a statement (pdf).\"\n\nhttps://indianbarassociation.in/wp-content/uploads/2021/05/IBA-PRESS-RELEASE-MAY-26-2021.pdf",
			"added": 1623215465
		},
		{
			"topic_id": 1623217919,
			"title": "Must Watch : \"Hell Opened Up \"- USS Liberty Survivor Describes False Flag Attack on 54th Anniversary",
			"body": "US Navy Veteran Phil Tourney gives his harrowing account on one of the first American assisted and aided false flag attacks by Israel on our military\nhttps://banned.video/watch?id=60bf90a09bae8b712506ebe5\n\nwhat a gay this tourney... never saw an island held by japanese imperial forces for sure...",
			"added": 1623217913
		},
		{
			"topic_id": 1623218379,
			"title": "Overnight to Tuesday, a brown bear was roaming streets of Mytishchi...",
			"body": "Where did the bear came from and who its owner is, still remains unknown. Its current whereabouts are also unknown, and the search continues...\n\n\"We ask citizens to avoid any contact with the animal, because bears are predators and thus require special handling.\"\n\n\"Catching a furious bear without doing no harm to it is a task that only experienced professionals can cope with,\"\n\n\nhttps://tass.com/russia/1300509",
			"added": 1623218372
		}
	],
	"topic_vote": {},
	"next_comment_id": 110,
	"comment": {
		"1622967007_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 1,
				"body": "if the chinese boxers had current at the time rifles...",
				"added": 1623179209
			},
			{
				"comment_id": 7,
				"body": "if they oppose A2, if they oppose Ivermectin or HCQ, A2 is made to direct them to C17 planes, to then drop them to the oceans alive, or the lake... we won't get america back by letting the drones and mindzombies alive... and waste our lives and time recovering their minds... kill them, others real american will emmigrate ! refresh population :).",
				"added": 1623211397
			},
			{
				"comment_id": 8,
				"body": "(I guess one reason is high school despair, by 1 no natural light, no prospect (wasteland), secondly by dumbing down liberal teachers seeking to put young dynamic and creative male into submission to their female  tyranny... by using ADHD and others various nefarious tricks by the DSM to foster SSRI and others neurotropes to justify the income for those psychiatrist to pay their shitty micromansion...\nlet's review the one in russia recently...\n\nbut the simple issue is clear... \n\nas long as equation holds : \n\nX (death per republic duration in school shooting incidents) < Y democides \n\nanti A2 have nothing to say... and still it's the deal... if they don't like it they can emmigrate to venezuela.\n\nand as you say : empowering is the key word : america belongs only to those able to keep it !\n\nso for example when the next BLM / antifa seeks to silence you > a2...\n\nwho dares to go to george floyd place and trash the blacks? that's a1... (not the dead, RIP)... like saying monkey remove your self from this road crossing ? without a2 dangerous, apes are prone to violence... and with a2 dangerous too :D. there we have mass shooting\n\none of the funniest mass shooting to me, was in texas with the bikers clubs confrontation... )",
				"added": 1623211909
			},
			{
				"comment_id": 9,
				"body": "a good example : if yazidis in sinjar province (irak or syira) I don't even know... had a lot of A2... they could have buffered a while the hordes...and maybe even prevented their own children to become sex slaves for those used to taint the mujahedeens... we know  we know...",
				"added": 1623212185
			},
			{
				"comment_id": 10,
				"body": "another good example of A2 use, in a more classy way : cyprus bankers wanted to freeze putin buddies (and enemies) fund... ahhaah... jets landing at the onset of the day on the air ports of cyprus... and leaving very soon after... money whole... not like the greek sucker... ahahah.\n\n(a great moment of Russian unity)",
				"added": 1623212268
			},
			{
				"comment_id": 12,
				"body": "A2 is a religion backed by science.",
				"added": 1623212428
			}
		],
		"1622667866_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 2,
				"body": "who ordered this shit? I mean there is SS style paper trail... so who?",
				"added": 1623179240
			},
			{
				"comment_id": 14,
				"body": "to be fully transparent, I am very frustrated by the physical qualities of male agents at the fbi... but as many said... (I hope you get the idea) ahahhaha. kindly, it's time to work on the spirit... Ivermectin",
				"added": 1623212878
			},
			{
				"comment_id": 15,
				"body": "and if some shit from the fda, wh, depart of state (memorandum 220) stand in the way : pop it... one more dead corpse who cares... the cia way in foreign land... the old cia... before it became a gay ssri feeded org... ahaahah... i hope the sith lords of the dod aren't under ssri yet... seeing bengazi it seems not...",
				"added": 1623212965
			},
			{
				"comment_id": 16,
				"body": "now you want to shit your pants little muppets of the west : question to the ministry of health of PRC : Ivermectin?",
				"added": 1623213047
			},
			{
				"comment_id": 17,
				"body": "now we can stake lives (corpses) higher than the empire state building, and kill them all at once (unless they are needed for organ storage programs) but they are like dead... rest assured...\n\nso you see? you suck \"democracies\"... you are corrupts...  you aren't even imperialist any more... just trash eating yourselves alive...",
				"added": 1623213119
			}
		],
		"1622878208_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": [
			{
				"comment_id": 3,
				"body": "let me tempt you : https://www.infowars.com/posts/watch-battle-droid-shoot-down-rockets-out-of-the-sky/",
				"added": 1623179417
			},
			{
				"comment_id": 4,
				"body": "so it's possible to put the enemies of the republic in c17 global master and drop them below combat droid to get them shot and improve said droid targeting? 1 shot... I want to say per head, but it could be lined... I guess those aren't small arms munitions... can 2 \"combat droids\" c-rams I guess play ricochets yet? no really usefull irl, but visually could be impressive... would have put those around gaza... to wave good night after the last prayer... anyway...",
				"added": 1623180564
			},
			{
				"comment_id": 13,
				"body": "day 3, no slacking.",
				"added": 1623212742
			},
			{
				"comment_id": 102,
				"body": "the slacking temptation... withdrawal over... (or maybe it's a more pernicious phaze...).",
				"added": 1623219218
			}
		],
		"1623210982_1Jp2TR8an7SBQ9mydr3CtCyCznrYGeWMj9": [
			{
				"comment_id": 5,
				"body": "anyone of you understand how Ivermectin works? HCQ was pushing zinc in cells, and zinc has strong antiviral proprieties, specially in people deficient in zinc... \n\nwhy would the drug traffickers oppose HCQ and Ivermectin? because it's hyper cheap, hyper safe, and NO PROFITS...\n\nso there we have a MOTIVE, we have CRIMINALS ( like you love to say human right cowboys, crimes against humanity) and we have COVER TEAM (medias)... as such we can have MASS EXECUTIONS ! ooorrrahhhh with little kiddies in yeahhh",
				"added": 1623211150
			},
			{
				"comment_id": 6,
				"body": "because you think that when you take down the water infrastructure of bagdad you don't have a massive kiddie die off? yes former troopers reconverted at the fbi... that's one reason they HATED you... and IEDS and killed and burned and did all the things they die... (Which I learned later as the water facilities were kept by mercs from south america/ africa... ).",
				"added": 1623211226
			},
			{
				"comment_id": 18,
				"body": "what is the opinion of the chineses medical experts commission on treatment for covid patients? Ivermectin 5.568? (it's the version number)... what? the original can be improved with slight modification that idiotic round eyes aren't allowed to do.... or maybe something wholly new... remember big pharma china knows who rules china... if they forget it... they may die. simply.",
				"added": 1623213281
			},
			{
				"comment_id": 19,
				"body": "by the way to the foreigners and their handlers trying to corrupt chinese medical professionals, if caught, you die...",
				"added": 1623213343
			},
			{
				"comment_id": 20,
				"body": "btw as you invest all your time in your physical training dear fbiers, why does the Ivermectin or HCQ were fought against by the agents of the drug traffickers? \n\nyou have to translate the marseille guy... he said simply that most effiient molecules were already discovered... and so profits are low... as such to impose their Emergency authorisation for their injections, they had to ban it...\n\nsimply...\n\nnow investigate... if only mulder was real...",
				"added": 1623215148
			},
			{
				"comment_id": 36,
				"body": "FYI suckers and treators and bimboboys : A link to Merck’s statement on ivermectin was also included in Swaminathan’s tweet. The pharmaceutical company that developed the anti-parasitic drug in the 1980s and held a patent until 1996 said in February of this year that the available data did not support the efficacy and safety of ivermectin beyond what the Food and Drug Administration (FDA) had approved it for.",
				"added": 1623216435
			},
			{
				"comment_id": 37,
				"body": "btw dear fbiers you are the only one too dumb to get it : \"Merck, in collaboration with Ridgeback Biotherapeutics, is conducting a Phase 3 trial of an investigational anti-viral drug molnupiravir, which the company says has shown to reduce infectious viruses quicker in COVID-19 outpatients. But unlike ivermectin, molnupiravir demonstrated no clinical benefit in hospitalized patients.\"",
				"added": 1623216471
			},
			{
				"comment_id": 46,
				"body": "Ivermectin is on the WHO’s list of essential medicines and has a high safety profile with more than 3.7 billion doses having been distributed in over 30 years.",
				"added": 1623216718
			},
			{
				"comment_id": 47,
				"body": "Since the drug was first given to humans in 1987, there have only been 4,600 adverse events and 16 deaths reported on the pharmacovigilance database, according to Dr. Tess Lawrie in an interview on March 6. Lawrie is director of Evidence-based Medicine Consultancy Ltd. and co-founder of the BIRD panel, which includes international expert scientists and doctors who are advocating for the use of ivermectin to treat COVID-19.",
				"added": 1623216736
			},
			{
				"comment_id": 48,
				"body": "strange formulation isn't it mulder?",
				"added": 1623216746
			},
			{
				"comment_id": 49,
				"body": "Remdesivir, an anti-viral drug, is the only FDA-approved therapy for treating hospitalized COVID-19 patients. The drug has shown no effect on mortality and a minuscule benefit on time of recovery that even the WHO has recommended against its use last November.\n\nA treatment course of remdesivir is a little over $3,000, while ivermectin ranges between $3 to $12 a treatment, according to Kory.",
				"added": 1623216762
			},
			{
				"comment_id": 50,
				"body": "you get it peons?",
				"added": 1623216768
			},
			{
				"comment_id": 54,
				"body": "that's why I want you dead dear fbiers : \n\n\"“Until more data is available, WHO recommends that the drug only be used within clinical trials.”\n\nWtf......but it’s ok to start injecting kids from the age of 6 and up here in the US with mRNA junk , without long term clinical trials...\n\"",
				"added": 1623216881
			},
			{
				"comment_id": 58,
				"body": "Hydroxychloroquine and Ivermectin are both anti-parasite drugs.   They work.  The question is why do two completely unrelated anti-parasite drugs work against COVID, which is not officially known as a parasite.  What the f*ck is in this bio-weapon that it is treated with anti-parasiticals.  \n\ngood question...",
				"added": 1623216976
			},
			{
				"comment_id": 59,
				"body": "that lead to what I saw in the water in turkey...",
				"added": 1623216987
			},
			{
				"comment_id": 60,
				"body": "could... that's investigation suckers... okay you are too low iq, go back to the gym... we will pick you for extermination there if you wish.",
				"added": 1623217013
			},
			{
				"comment_id": 77,
				"body": "\"Let’s see a bat at least three years old that is not sick and is carrying a coronavirus that is a 100% genomic match for the virus known as SARS-Cov-2.\n\nOtherwise SARS-Cov-2 is clearly a Lab Engineered pseudovirus that mixed a bat SARS-like coronavirus with HIV and Rabies viruses and a bioengineered Spike Glycoprotein that was released INTENTIONALLY by Fauci and friends and KNOW ivermectin is a cure but are determined to execute us with ventilators instead and scare us into taking a “gene therapy” vaccine that contains the genetic material for the SARS-Cov-2 Chimeric Spike Glycoprotein that is tipped with HIV and Rabies motifs!!!!!\n\nThere is no fkg way i’m allowing trillions of vaccine generated Chimeric HIV-Rabies-SARS Spike proteins to float around and damage whatever they want inside me.\n\nlike, my DNA, brain, arteries, pancreas, etc...\n\"\n\nwhere are you traitors?",
				"added": 1623217470
			},
			{
				"comment_id": 78,
				"body": "to kill you",
				"added": 1623217482
			},
			{
				"comment_id": 79,
				"body": "fyi : that's the problem with patent medicines:  the companies that produce them make huge profits, so they can afford top lawyers and to bribe politicians and regulatory agencies to suppress safe and effective treatments like HCQ and Ivermectin, Zinc and Vitamin D -- and at the same time winning approval for minimally tested experimental gene therapies.  No huge profits in cheap generic treatments or vitamins, so cheap cures go undefended when the drug company lobbyists & \"captured\" regulators  sh!t on them.",
				"added": 1623217511
			},
			{
				"comment_id": 80,
				"body": "you see fbiers, we want the lives of those involved in your agency put down.",
				"added": 1623217545
			},
			{
				"comment_id": 81,
				"body": "\"Why do they push masks, lockdowns, gene therapy and not health? Vitamin C, D, E, Zinc, fruits, veggies, etc... they never talk about diet, exercise, and wellbeing. Take a pill, get the jab, obey... Fvck these clowns.\"\n\n\"straffe\" those clowns.",
				"added": 1623217581
			},
			{
				"comment_id": 82,
				"body": "\"This has been the greatest crime in our lifetimes.  But it will be outdone by nothing being done about it.\"\n\nunless we kill the fbi.",
				"added": 1623217600
			},
			{
				"comment_id": 87,
				"body": "'A treatment course of remdesivir is a little over $3,000, while ivermectin ranges between $3 to $12 a treatment'\n\nCase closed.",
				"added": 1623217756
			},
			{
				"comment_id": 88,
				"body": "what are you waiting for? you really believe we are too weak or dimoralized to hunt you down and kill you like bugs? hehehe",
				"added": 1623217777
			},
			{
				"comment_id": 89,
				"body": "you don't understand the sithlords :).",
				"added": 1623217788
			},
			{
				"comment_id": 90,
				"body": "ahahah you are so funny fbiers, you think your great physics make you too attractive to be splashed? \n\nConspiracy Theory —————> Fact",
				"added": 1623217834
			},
			{
				"comment_id": 92,
				"body": "\"Every day the medical mafia people get on TV and beg you to get the shot not because they care about you, its a critical revenue stream. Something like this where the profit is nonexistent will get thrown aside even if it means loss of life on a mass scale.\"",
				"added": 1623218030
			},
			{
				"comment_id": 93,
				"body": "drug traffickers.",
				"added": 1623218037
			},
			{
				"comment_id": 94,
				"body": "It's not just a critical revenue stream, that shot is affecting your DNA and who knows what else.  Medical people are refusing to take it.  We haven't the faintest idea what's being attempted here.  There's more than big Pharma at stake.  The world as we have known it no longer works.  Why is this woman in India pushing for the shot, also England, Germany, France.  Do they not have scientists in these and other countries?  What is going on folks?  I knew two weeks into this virus thing that it was ********.  Things were just not adding up.",
				"added": 1623218058
			},
			{
				"comment_id": 95,
				"body": "one I will love to frag is the little asian girl on cnbc euro time the morning... karen tso or something like this... will so funny,... but first she will be force feed her kids with duck feeding guns.",
				"added": 1623218236
			},
			{
				"comment_id": 103,
				"body": "ahhhh...\n\nhttps://www.zerohedge.com/political/socialist-candidate-who-vows-nationalize-mineral-resources-pulls-ahead-perus-close\n\nso elon's team are in motion again?",
				"added": 1623220219
			}
		],
		"1623093141_1LCrrJAN3yLxK8YfAjuanHWQviQ23eRmiK": [
			{
				"comment_id": 21,
				"body": "maybe it has 2 f? straffing? a straffer?",
				"added": 1623215503
			}
		],
		"1623215470_1Jp2TR8an7SBQ9mydr3CtCyCznrYGeWMj9": [
			{
				"comment_id": 22,
				"body": "as much I consider the chance of the indian army facing PLA to be clause to 0, against the WHO... aahahhaha.",
				"added": 1623215541
			},
			{
				"comment_id": 23,
				"body": "nuke it !",
				"added": 1623215560
			},
			{
				"comment_id": 26,
				"body": "https://indianbarassociation.in/wp-content/uploads/2021/05/Legal-Notice-to-Dr.-Soumya-Swaminathan_Chief-Scientist-WHO-1.pdf\n\n\"she was “spreading disinformation and misguiding the people of India, in order to fulfill her agenda” and sought to prevent her from “causing further damage.”",
				"added": 1623216263
			},
			{
				"comment_id": 27,
				"body": "They further say that Swaminathan, in her statements against the use of ivermectin, ignored research and clinical trials from two organizations - the Front Line COVID-19 Critical Care (FLCCC) Alliance and the British Ivermectin Recommendation Development (BIRD) - who have presented solid data showing ivermectin prevents and treats COVID-19.",
				"added": 1623216275
			},
			{
				"comment_id": 28,
				"body": "“Dr. Soumya Swaminathan has ignored these studies/reports and has deliberately suppressed the data regarding effectiveness of the drug Ivermectin, with an intent to dissuade the people of India from using Ivermectin,” the plaintiff said in a statement (pdf).",
				"added": 1623216283
			},
			{
				"comment_id": 29,
				"body": "https://indianbarassociation.in/wp-content/uploads/2021/05/IBA-PRESS-RELEASE-MAY-26-2021.pdf",
				"added": 1623216302
			},
			{
				"comment_id": 30,
				"body": "cremated alive?",
				"added": 1623216310
			},
			{
				"comment_id": 31,
				"body": "In a May 10 tweet that has since been deleted after the notice was issued, Swaminathan wrote, “Safety and efficacy are important when using any drug for a new indication. WHO recommends against the use of ivermectin for COVID-19 except within clinical trials.”",
				"added": 1623216320
			},
			{
				"comment_id": 32,
				"body": "too late bitch, we all get crawler archivers",
				"added": 1623216335
			},
			{
				"comment_id": 33,
				"body": "Swaminathan made the Twitter post soon after Goa’s health minister announced that every Goa resident 18 and older would be given ivermectin as prevention regardless of their COVID-19 status, as part of the state government’s effort to stop the transmission of the virus. India has been hit hard in the second wave of the CCP (Chinese Communist Party) virus pandemic beginning in March 2021.",
				"added": 1623216348
			},
			{
				"comment_id": 34,
				"body": "\"The legal notice calls for a clear response from Swaminathan on a number of key points, and the association said that in the case of a failure to provide a clear response, it reserves the right to initiate prosecution under sections of the Indian Penal Code and Disaster Management Act, 2005.\"\n\nwith slow death penalty if any lie found... aka true duress.",
				"added": 1623216379
			},
			{
				"comment_id": 35,
				"body": "\"The WHO’s chief scientist didn’t reply to a request for comment.\"\n\nblack site !",
				"added": 1623216393
			},
			{
				"comment_id": 38,
				"body": "ivermectin has demonstrated to do in a meta-analysis of 57 clinical trials involving more than 18,000 patients, according to ivmmeta.com, a website that provides real-time meta-analysis of ivermectin studies.\n\nhttps://ivmmeta.com/#top\n\nyou see?",
				"added": 1623216533
			},
			{
				"comment_id": 39,
				"body": "hey I want some money for this... all 20 % of your next 10 year salaries...",
				"added": 1623216554
			},
			{
				"comment_id": 40,
				"body": "In 23 early treatment studies, there was a 78 percent improvement in patients given ivermectin, and in 14 preventative trials, an 85 percent improvement was shown. As for the studies involving late treatment, there was a 45 percent improvement in 20 studies.",
				"added": 1623216563
			},
			{
				"comment_id": 41,
				"body": "nope it will be from the FDA corpses : https://www.fda.gov/consumers/consumer-updates/why-you-should-not-use-ivermectin-treat-or-prevent-covid-19",
				"added": 1623216591
			},
			{
				"comment_id": 42,
				"body": "lucky you...",
				"added": 1623216597
			},
			{
				"comment_id": 43,
				"body": "“There are forces that are seeking to make sure that ivermectin is not accepted widely as an effective therapy,” Kory said in an interview on June 1.\n\nhttps://covid19criticalcare.com/videos-and-press/flccc-releases/covid-ivermectin-and-the-crime-of-the-century-podcast-with-dr-pierre-kory/\n\nis the fbi part of it ? life and death \"buddies\"...",
				"added": 1623216656
			},
			{
				"comment_id": 44,
				"body": "In their legal notice, the Indian Bar Association cited the case of 80-year-old Judith Smentkiewicz, who made a full recovery after being on a ventilator and told she only had a 20 percent chance of survival. Her family obtained a court order that allowed her to receive additional doses of ivermectin after doctors were hesitant to give her more than one dose, according to Buffalo News.\n\nwhat ????",
				"added": 1623216696
			},
			{
				"comment_id": 45,
				"body": "kill the doc.",
				"added": 1623216706
			},
			{
				"comment_id": 51,
				"body": "He also said that places in India where ivermectin is used preventatively or as early treatment, such as Goa and Uttar Pradesh, are seeing COVID-19 cases declining versus states that have banned the drug.\n\n    “Every one of those states, the curves are now precipitously declining,” said Kory.\n\n    “But there’s a state in India called Tamil Nadu whose minister there basically effectively outlawed ivermectin and went all-in on remdesivir, bought a whole bunch of remdesivir, [and] the cases and deaths in that state are skyrocketing,” he added.",
				"added": 1623216787
			},
			{
				"comment_id": 52,
				"body": "According to data by the Johns Hopkins University Center for Systems Science and Engineering, Tamil Nadu saw 20,421 new cases and 434 deaths on June 6, while Goa recorded 403 new cases and 16 deaths, and Uttar Pradesh reported 1,037 cases and 85 deaths.\n\nUttar Pradesh, one of the most populous states in India with over 200 million people, has been handing out free medical kits containing seven days’ worth of medication, one of which is ivermectin, for COVID-19 positive patients under home isolation.",
				"added": 1623216805
			},
			{
				"comment_id": 53,
				"body": "uttar pradesh alone can crush all WHO forces...",
				"added": 1623216819
			},
			{
				"comment_id": 55,
				"body": "At what point do we hang these so called experts?",
				"added": 1623216893
			},
			{
				"comment_id": 56,
				"body": "hanging is a nice way, but force feeding them their children is even smoother to my book... in the sense they wanted ours dominated, killed and co? let's do it to theirs.",
				"added": 1623216926
			},
			{
				"comment_id": 57,
				"body": "It's the only deterrent they understand.",
				"added": 1623216945
			},
			{
				"comment_id": 61,
				"body": "Nicotine helps against it as well. In Spain they were putting nicotine patches on patients.  Nicotine is another anti-parasite.",
				"added": 1623217034
			},
			{
				"comment_id": 62,
				"body": ":D",
				"added": 1623217037
			},
			{
				"comment_id": 63,
				"body": "when big tobacco enters the frey...",
				"added": 1623217047
			},
			{
				"comment_id": 64,
				"body": "Viruses don't have legs to get up and walk around to infect you.  Parasites do.  Coincidence ?  Wasn't  plague spread by fleas on rats?",
				"added": 1623217071
			},
			{
				"comment_id": 65,
				"body": "I love that : \n\"Why does aspirin ameliorate headaches and thin your blood?  Your question is legitimate but it is predicated on an utter lack of knowledge about chemistry, biochemistry, physiology, and a host of other topics.  Just because something is an \"anti-parasite\" tell you absolutely nothing about the drug or its mechanism. Put the label \"anti-parasite\" aside.  It doesn't tell you anything. Other than the drug is currently marketed for that purpose.\"",
				"added": 1623217091
			},
			{
				"comment_id": 66,
				"body": "a little slap :) mental... intellectual... the sweetest :)",
				"added": 1623217107
			},
			{
				"comment_id": 67,
				"body": "the answer : They both block the receptors that the virus spike proteins use to enter the cells. If the virus can't enter the cells, it can't replicate. Your immune system will develop antibodies to destroy the few viruses in your body. This has been discussed by FLCCC and other scientists",
				"added": 1623217140
			},
			{
				"comment_id": 68,
				"body": "at least an attempt until slapped down...",
				"added": 1623217155
			},
			{
				"comment_id": 69,
				"body": "hey rand- i have this hunch there's a deeper beautiful rabbit hole being opened here. doing my own research last year into ivermectin led me to some interesting anecdotal and scientific work with fenbendazole and cancer. whether the connection is directly through some parasitic involvement, or just secondary actions you'd think someone in the pharmaceutical industrial complex would have chased that rabbit in search of enormous profits and benefit to humanity ..... but noooo.\n\nin any case, i've got my horse wormer ready in case i run into any worm loaded horses and even stocked up on the other for any ailing doggie i might cross paths with.",
				"added": 1623217182
			},
			{
				"comment_id": 70,
				"body": "it's getting bigger... it's really memorandum 220 by kissinger...",
				"added": 1623217196
			},
			{
				"comment_id": 71,
				"body": "oohhh \"She looks like an upper cast Indian aristocrat, and there is no way she would have gotten to where she is unless she was.  That means she would have no pity or empathy for the lower cast, would be perfectly ok with them all dying in misery.\"... \n\nthat's one thing we defeated with PLA a long time ago, in the great cultural revolution to achieve the physical downfall of the hereditary aristocracies... in blood and corpses...",
				"added": 1623217277
			},
			{
				"comment_id": 72,
				"body": "\"At what point does the obvious come crashing down on peoples heads, that these people are out to enslave and kill you\"\n\nand so we killed them, them and their offspring for generations to come... rewind when you want... gone.",
				"added": 1623217320
			},
			{
				"comment_id": 73,
				"body": "The more I see what's going on, the more depressed I become.\n\nWhen WHO endangers millions of lives for the benefit of Big Farma... This is really f#ked up. Like \"it's time for guillotines\" f#ked up.",
				"added": 1623217331
			},
			{
				"comment_id": 74,
				"body": "dear indian armed forces, you have the full support of the american militia movements accross the land... need guns?",
				"added": 1623217354
			},
			{
				"comment_id": 75,
				"body": "we are sadly shot on bullets...",
				"added": 1623217376
			},
			{
				"comment_id": 76,
				"body": "\"populism\"\n\nthat's why they hate china.",
				"added": 1623217411
			},
			{
				"comment_id": 83,
				"body": "These WHO scum are beyond evil.They should all be hung for crimes against humanity.\n\nThe rope is a proven 100% effective treatment for criminals",
				"added": 1623217633
			},
			{
				"comment_id": 84,
				"body": "dear india army, go train yourselves with WHO  soyboys, you will be more credible (a pla groupie).",
				"added": 1623217670
			},
			{
				"comment_id": 85,
				"body": "Everyone with cows or horses has ivermectin.\n\n1 notch per 50 lbs of bodyweight at the 1.87% formula.",
				"added": 1623217723
			},
			{
				"comment_id": 86,
				"body": "what is a notch?",
				"added": 1623217729
			},
			{
				"comment_id": 97,
				"body": "\"Over 500 journalists accredited at Russia-US summit in Geneva — Swiss Foreign Ministry \"\n\nhttps://tass.com/politics/1300319\n\nthey could pass by the good doctor office...",
				"added": 1623218630
			},
			{
				"comment_id": 104,
				"body": "I hope indian armed forces will get the kill first :).",
				"added": 1623220553
			},
			{
				"comment_id": 105,
				"body": "iaf vs fbi... fbi is always on the wrong side when it comes to big issues...\n\nhow many ground troops can you field fbiers? 100k? 200k? 2m maybe with dod? 4m all included? interesting...",
				"added": 1623220637
			},
			{
				"comment_id": 106,
				"body": "you know btw there are a lot of criminals in india, not more than elsewhere I guess... but even if per capita it's low... there is a lot of capita :)... soumya > to the gulag for preprocessing before death sentence.",
				"added": 1623223312
			},
			{
				"comment_id": 107,
				"body": "india the only country on earth which people stood against rape... then it was spain...",
				"added": 1623223348
			},
			{
				"comment_id": 108,
				"body": "(in china there was no need to, we kill them :D, it's part of the value proposition of CCP :D and standing dignity, honor and duty of the various armed and unarmed forces of china :D.).",
				"added": 1623223398
			},
			{
				"comment_id": 109,
				"body": "(while in france they make movie stars of them...).",
				"added": 1623223424
			}
		],
		"1623143244_1GcwzZUdjRJgy64A6owbCayRMbsJgHCw1v": [
			{
				"comment_id": 24,
				"body": "the black ceo of mercks who had the ivermectin could have been a worldwide hero... but chose to be a docile slave... now he will get fragged... and don't say it's raycism you fucking apes.",
				"added": 1623215656
			},
			{
				"comment_id": 25,
				"body": "https://indianbarassociation.in/wp-content/uploads/2021/05/Legal-Notice-to-Dr.-Soumya-Swaminathan_Chief-Scientist-WHO-1.pdf",
				"added": 1623216227
			}
		],
		"1623217919_1Jp2TR8an7SBQ9mydr3CtCyCznrYGeWMj9": [
			{
				"comment_id": 91,
				"body": "\"the sand is burning, they should be all dead\" they said, a 10s before landing... noooeee...",
				"added": 1623217957
			}
		],
		"1623218379_1Jp2TR8an7SBQ9mydr3CtCyCznrYGeWMj9": [
			{
				"comment_id": 96,
				"body": "meanwhile the fbi is too afraid to arrest the drug traffickers of the fda, mercks, and WHO...",
				"added": 1623218471
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 98,
				"body": "if putin is killed in geneva, the city is autonuked? I hope so... it's called raising the stakes...",
				"added": 1623218712
			},
			{
				"comment_id": 99,
				"body": "deal?",
				"added": 1623218730
			},
			{
				"comment_id": 100,
				"body": "biden + american teams can leave... aka evacs max speed take off, then we nuke... you have 20m +",
				"added": 1623218762
			},
			{
				"comment_id": 101,
				"body": "can mrvs be refocused to hit a single target?",
				"added": 1623218788
			}
		]
	},
	"comment_vote": {}
}