{
	"message": [
		{
			"body": "Il aurait dû choisir I2P",
			"date_added": 1459972788121
		},
		{
			"body": "Tor est pas fait pour ce genre d'usage. Alors que I2P aurait anonymisé toutes les connections",
			"date_added": 1459972819972
		},
		{
			"body": "Pourquoi ?",
			"date_added": 1459973374740
		},
		{
			"body": "Ça me fait pas envie. Ça réinvente une peu Freenet mais en pire",
			"date_added": 1459973401563
		},
		{
			"body": "T'as le choix d'héberger le contenu que tu veux mais tu peux quand même pas trop choisir. Si tu visites un site ton instance ZN télécharges toutes les modifications de ce site. Donc il pourrait y avoir n'importe quel type de contenu",
			"date_added": 1459973663713
		},
		{
			"body": "Freenet, contrairement à Zeronet, est vraiment incensurable. ",
			"date_added": 1459973701427
		},
		{
			"body": "Pourquoi pas I2P ? C'est vachement cool",
			"date_added": 1459973722009
		},
		{
			"body": "Malheureusement oui. Mais le principe est quand meme génial. Et en faisant attention il est pas trop compliqué d'éviter les pages illégales. Et si tout le monde les évites elles disparaissent.",
			"date_added": 1459973848012
		},
		{
			"body": "Si les proprios de Play décident de tout supprimer, de faire un siteSign et un sitePublish il y aura beau avoir 20 000 seeders Play n'existera plus en quelques minutes",
			"date_added": 1459973899909
		},
		{
			"body": "Si j'insère un fichier sur Freenet il ne disparaitra que si tout les nœuds cessent de le seeder. C'est un peu différent avec les sites statiques.",
			"date_added": 1459974097111
		},
		{
			"body": "Je vois toujours pas pourquoi Zeronet pourrait pas être entièrement inclu dans le réseau I2P",
			"date_added": 1459974124450
		},
		{
			"body": "Ça ajouterai uniquement un peu de latence pour télécharger les sites",
			"date_added": 1459974139029
		},
		{
			"body": "Tor c'est fait pour un autre usage, contourner la censure sur le web (et tou ce qui est TCP)",
			"date_added": 1459974292836
		},
		{
			"body": "^^",
			"date_added": 1459975548622
		},
		{
			"body": "Oui, j'aime bien le côté Git",
			"date_added": 1459975967336
		},
		{
			"body": "12345678901 : Il est aussi possible de supprimer ses messagages. Je ne parle pas tout⋅e seul⋅e ^_^",
			"date_added": 1460418655830
		},
		{
			"body": "12345678901 : Pour trouver des stes français, fait le tour des pages d'accueil des proxies et des moteurs de recherches",
			"date_added": 1460419399633
		},
		{
			"body": "polygone : Précise.",
			"date_added": 1462562804284
		},
		{
			"body": "dabidadou17 : Lol.",
			"date_added": 1462562826431
		},
		{
			"body": "rw : Il suffit de créer un Zerosite avec un torrent dedans. Il n'y a pas de restriction sur le type de contenu.",
			"date_added": 1462562859910
		}
	]
}