{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1573157871,
			"title": "Fuck economic growth",
			"body": "The filthy rich get even more rich, the horribly poor stay horribly poor, and the middle class is ceasing to exist. With all of that, the climate is getting destroyed and in 20-30 years we will murder each other for a glass of water. What the fuck must happen for governments and corporations to realize that when they trade in everything for money, they will find out that money cannot be eaten or breathed?",
			"added": 1573157869
		},
		{
			"topic_id": 1573303435,
			"title": "Suicide method",
			"body": "What's the best one that is accessible, quick and painless? Gun would be best, but I live in Europe where gun ownership is extremely restricted. And I tried hanging, but it just won't work on a stupid small hook on the wall.",
			"added": 1573303432
		},
		{
			"topic_id": 1573424516,
			"title": "Zite data backup strategy???",
			"body": "Despite being only about 500 MB in size, my zite data has about 70,000 files in it, making incremental hardlink-based backup with rsync extremely slow, and even removing such backup with rm -rf is also slow as hell. Creating archive is slow too. I currently have a script to just copy everything to external drive every time, because just copying is much faster than incremental rsync. But this doesn't solve rm -rf'ing old backups.\n\nI mean, come on: incremental hardlink-based backup of ALL my data sans zeronet is many times faster than simply backing up zeronet. Fuck this shit.",
			"added": 1573424512
		}
	],
	"topic_vote": {
		"1573157871_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"1573159148_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": 1,
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1
	},
	"next_comment_id": 81,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "test",
				"added": 1571853866
			}
		],
		"1571905302_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 2,
				"body": "> [filips](#comment_267_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Do you know why? Because in Firefox 72, proxy settings are still there, so I guess it is decision by Tor team.\n\nTor team boasted in their update news that they integrated their services more into the browser to make it feel built-in and not an addon (Tor button and Tor proxy settings)\nhttps://blog.torproject.org/new-release-tor-browser-90",
				"added": 1571933704
			}
		],
		"1571930824_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi": [
			{
				"comment_id": 3,
				"body": "Are sheeple finally waking up? That's awesome and surprising at the same time.\n\nToo bad the site looks like shit without JS.",
				"added": 1571933846
			},
			{
				"comment_id": 6,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_891_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i don't have tv.\n\nme too and proud of it!\nbut this is a website. most people get news from websites and only old hags depend on tv for news.",
				"added": 1571937778
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_1151_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It looks okay on mobile devices.\n\nUsing Tor on mobile doesn't protect from fingerprinting. But if only access to the website matters for those who have it censored by ISPs, then it's fine.",
				"added": 1572076749
			}
		],
		"1571919405_1BJWebg6mR9UsDFpJnVvxfoAuymxq4m598": [
			{
				"comment_id": 4,
				"body": "Use the test thread please and just reply and not make a new thread. If every new account test-posted a thread the whole ZeroTalk would look like a garbage dump.",
				"added": 1571933981
			},
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_890_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"a garbage dump\" i thought it was already a little bit like that.\n\nif you suddenly legalized guns in a country with very strict gun policies (so for example most of Europe) crimes with guns would probably skyrocket, but then once people get used to their new freedom and responsibility coming from it, it would die down to sane rates. I think same thing happens on Zeronet - people are not used to such freedom of speech, so they shitpost about niggers and such.",
				"added": 1571937617
			}
		],
		"1571933044_1NBJJWgAdvQkApP8jnD69NiQ5HPNBpmyqU": [
			{
				"comment_id": 8,
				"body": "> [manguz2000](#comment_1_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi): cp?\n\n~~Google~~ DDG don't hurt.\nhttps://www.urbandictionary.com/define.php?term=cp",
				"added": 1571937923
			}
		],
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 9,
				"body": "i don't really care too much. All services send plaintext mail anyway and at least you gain not being profiled by the private-oriented mail service if you choose one. For actual talk just use Signal or talk in person.\n\nIf you seriously need encrypted mail, self-hosting is very painful but the only viable way.",
				"added": 1571938196
			}
		],
		"1572170817_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 11,
				"body": "It started recovering again, I have 14 trackers now. But this is very worrying, if Zeronet can stop working soeasily then what's the point?",
				"added": 1572171042
			}
		],
		"1571272586_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 12,
				"body": "Just because you have perceived anonymity on ZeroNet doesn't mean you should shitpost low-effort insults. Grow up.",
				"added": 1572203270
			}
		],
		"1570756155_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 13,
				"body": "When I was a kid I already doubted that there is some invisible Jesus that really hears or cares about our weekly prayers. Then when I started researching and learning science, it only strengthened my disbelief.\nBut it seems evolution hardwired susceptibility to religion in us for some reason, probably because it helps unite huge masses without even ever meeting most of its members. But today it only benefits the liars by exploiting the stupid and uneducated.\n\nEven if I would want to believe, for example of fear of Hell, I just can't. You can't force believing into something which you HAVE to take on faith and find improbable. That's why Pascal's wager is bullshit and punishment of Hell for atheists is unjust.",
				"added": 1572284548
			}
		],
		"1572299410_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 14,
				"body": "> [laracroft](#comment_6_1LvCmKVRHi59Sa5wfK4yyjR4hijrabpbm5): The military stopped using it, it's slow and insecure, didn't help Dread Pirate Roberts, did it?\n\nRoss Ulbricht commited horrible mistakes like posting on his real Linkedin profile about his shady actions, ordering lots of fake ID cards to his actual home address, and stepping away from a running laptop while logged into Silkroad. It had nothing to do with Tor being bad.",
				"added": 1572370013
			},
			{
				"comment_id": 17,
				"body": "> [elinor2](#comment_13_14TR5Msgnb1MBKGayKiDB7j3aFdGrFUqdf): learn from the guy who created it all, https://www.onion-router.net/forgo tor's marketing bullshit, they're nothing more than 3 vpns strung together at this point\n\nAt least there is no single point of failure which the NSA can tap into. VPNs are centralized and that's huge drawback which Tor doesn't have. And even if Tor's bad, do we actually have any better alternative?\n",
				"added": 1572557683
			}
		],
		"1571500913_1KoioT6zYAXhg2NvChNtZvSU7fx5FhRW1w": [
			{
				"comment_id": 15,
				"body": "I wonder why pedophilia is considered a mental disorder while LGBT is not. Isn't that basically the same thing?  Attraction to something other than similarly-aged members of opposite sex?\n\nSeriously though, you should probably go for psychological treatment unless you feel it would humiliate you and infringe your privacy - then just try to restrain yourself, or risk going to jail. Don't download CP - let's not build demand for it!",
				"added": 1572370374
			}
		],
		"1572704351_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 18,
				"body": "Isn't elinks better than Lynx?",
				"added": 1572724719
			}
		],
		"1572705629_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 19,
				"body": "From what I remember, TPB banned .torrent files in favor of magnet links because they were sued about uploading \"illegal\" files. Magnets are just legally safer because you don't have to upload any file to the torrent site, but that's about it, the torrent downloading is the same as normal.",
				"added": 1572787916
			}
		],
		"1572801227_14cpMzjiF3xnbZNdhBrxjyvJLcJSYkXkSA": [
			{
				"comment_id": 20,
				"body": "cmon just because you have anonymity on zeronet doesn't mean you should shitpost pointless insults",
				"added": 1572807573
			}
		],
		"1572807733_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 21,
				"body": "https://www.reddit.com/r/Roms/comments/ba1gkm/rom_links_megathread_v2_romcenter/",
				"added": 1572807667
			}
		],
		"1573145923_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 22,
				"body": "If you want to use that to torrent over Tor, then no. Torrenting over Tor is very slow and steals traffic from people who actually need it, like freedom activists.",
				"added": 1573151310
			}
		],
		"1572987956_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": [
			{
				"comment_id": 23,
				"body": "How do I know its not a honeypot",
				"added": 1573151360
			},
			{
				"comment_id": 25,
				"body": "> [anonymouslogin](#comment_89_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Why the fuck would you contribute to a cause you know nothing about? Giving money away isn't illegal...honeypot for what?\n\nI mean, how do I know this is really for charity and not for the OP to just get richer",
				"added": 1573158262
			}
		],
		"1572640590_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 24,
				"body": "https://unblocked.ltda/",
				"added": 1573157921
			},
			{
				"comment_id": 27,
				"body": "> [1bfqutudhtexlka](#comment_26_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): the pirate bay is still onhttp://uj3wazyk5u4hnvtk.onion/i think we should mirror it here on ZN\n\nThis is a good idea, a mirror of TPB on Zeronet. It's struggling very much in clearnet and probably won't remain for much too long\nThis .onion link loads extremely slowly for me",
				"added": 1573231998
			}
		],
		"1573231068_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 26,
				"body": "Tor: always mode, through Tor Browser, on Debian, with a script autostarted when logged into the system. This way Zeronet is always ready and updating in the background.",
				"added": 1573231885
			}
		],
		"1570755737_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 28,
				"body": "I'm a foot fetishist, I can fap to nice feet even in non-sexual appearances",
				"added": 1573235103
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 29,
				"body": "> [clearnet15bad](#comment_12_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7): Story time?\n\n^",
				"added": 1573303189
			},
			{
				"comment_id": 43,
				"body": "I'm guessing he tried buying a gun or drugs and they caught him and jailed",
				"added": 1573340557
			},
			{
				"comment_id": 55,
				"body": "> [pineapples](#comment_119_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): should suicide be a human right? should it be illegal to talk people out of it?\n\nYes, it should be a right. It's my life and mine only.\nIt's mostly due to religious fucktards that block your rights to it.",
				"added": 1573588828
			},
			{
				"comment_id": 59,
				"body": "> [pineapples](#comment_121_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): since it should be a right, should we develop an easy, effective, and accessible  method by which to commit suicide so that more people can exercise this right?\n\nThey would probably make a shitton of requirements like no mental illnesses ever experienced, full family consent, serious disability, a month waiting period to \"change your mind maybe\" etc. Never gonna happen.",
				"added": 1573761311
			},
			{
				"comment_id": 65,
				"body": "> [xuanxuan](#comment_2_1MLe5Yb9CcXQadvpC5obuwnVUQZpFJHq6y): commit suicide is  stupid thing  .   do not it\n\ni is stupit, i commit ded, byebye",
				"added": 1573839326
			}
		],
		"1573267199_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 30,
				"body": "Not nuked, just niggers exterminated. Then the continent can remain as a \"green lungs\" of the Earth",
				"added": 1573303297
			}
		],
		"1573303435_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 31,
				"body": "> [dogo](#comment_13_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d): Jump from a high building.\n\nIf I happen to fall onto grass, car, human etc. I will probably survive, become paralyzed and forced to live like this forever",
				"added": 1573304969
			},
			{
				"comment_id": 32,
				"body": "> [anonymouslogin](#comment_103_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Have you tried talking to a professional without telling them that you're suicidal (just depressed) first?  Sometimes a different perspective on life can change your mind.\n\nI have been on a therapy for a few years. I still think suicide is the best answer for me. I'm just too tired of trying to live a normal live, and have no motivation. And the world is just not worth living, with its unequality, climate apocalypse, shit jobs, and much more suffering than pleasures.\n\nI suspect suicidal-ity was never even an illness for me, but a genuine world outlook.",
				"added": 1573305888
			},
			{
				"comment_id": 33,
				"body": "> [dogo](#comment_14_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d): False propaganda from antis. Physics don't lie. If it is high enough for your weight, you die.\n\nI once read about a guy who fell from 9 floor onto grass and the grass saved him (but he became wheelchaired). And another one who fell onto the roof of building entrance, also from 8 floor or something, and survived relatively undamaged!",
				"added": 1573306746
			},
			{
				"comment_id": 35,
				"body": "> [clearnet15bad](#comment_22_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7): I made a mirror of lostallhope.com, the site I posted below, here on zeronet. There you can find help if you are unsure if you really want to do it. It also includes statistics on the best methods.http://127.0.0.1:43110/1FfA8CzMxxmxCqrsMh39CNZbT1qWWaXRrB/\n\nThanks. Weirdly, I may be able to purchase cyanide, but opinions on whether it is instant/painless are mixed. If it was so unreliable, why do spies use them in suicide pills?",
				"added": 1573326931
			},
			{
				"comment_id": 40,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1010_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i think it's movie based.\n\nRly? Wikipedia lists it as true and even provides actual examples of usage.\nhttps://en.wikipedia.org/wiki/Suicide_pill",
				"added": 1573330568
			},
			{
				"comment_id": 41,
				"body": "> [clearnet15bad](#comment_23_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7): According to the site cyanide is almost as good as shotgun to the head, which surprisingly doesn't have 100% efficiency.  [...]\n\nNothing is perfect, and people make mistakes. It's impossible to have a 100% success rate in anything ever",
				"added": 1573335075
			},
			{
				"comment_id": 45,
				"body": "> [quantumkitty](#comment_254_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): What exactly is the reason you wanna die?\n\nBecause there is much more suffering in my life than pleasure, and if I can just have none in death, it's a win scenario.",
				"added": 1573400568
			},
			{
				"comment_id": 47,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1019_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lol it's because you are looking for a constant pleasure that your life is a misery. you reverse things: the natural way of life:boring as hell. but you want infinite pleasure. as it's not possible, you turn in an intellectual loop: giving you misery.\n\nI want at least 40% joy and not 5% or so... otherwise, isn't it logical to just die?",
				"added": 1573406183
			},
			{
				"comment_id": 48,
				"body": "> [quantumkitty](#comment_257_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): No because you can't predict the future. Things can get a lot better. Also, make sure you have: [...]\n\nI only have #2. So yeah, I'm depressed as fuck",
				"added": 1573423822
			},
			{
				"comment_id": 50,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1034_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): it's logical. you're exhausted as i explained you before. until you want something different for your life, you will be miserable and exhaust your physical resources, particularly nervous.\n\nYou know what would solve everything? A few million dollars in cash. I wouldn't have to struggle at work, I could buy some comfortable digs, I could afford developing a hobby, I could even move out to a better country, I could pay for a cook to prepare healthy meals for me every day, I would have private medical care... I think it's the same for many many people",
				"added": 1573425037
			},
			{
				"comment_id": 58,
				"body": "> [ver](#comment_1_19W516GmBf6dbFUBYDAcUCUPZ6FgoqwDvd): situations change. Tomorow will be better.\n\nclimate apocalypse? facebook-google regime? governments spying on our very thoughts? muslims invading europe? you call that 'better'?",
				"added": 1573761185
			},
			{
				"comment_id": 72,
				"body": "> [goodafternoon](#comment_24_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): climate apocalypse? Two things will happen not in our lifetime, Humans learn to be efficient or how to survive on another planet. facebook-google regime?? I just upset my peers by telling them about google ripping up peoples accounts, they all agree its wrong. I suggested to setup thunderbird or hotmail accounts and backing up photos locally to steer away from the cloud. Governments spying on our thoughts? Close but its big companies that use that as a source of income. Again, If the centralized internet was perfect we wouldn't be on this platform evading all of thus said. Things snap back like a spring, When we say \"It will get better\" we are serious. Its the conservation of energy really, nothing is permanent.\n\nSmog is so bad where i live that weather guys recommend not going outside unless really needed (I guess they don't realize people MUST go to work every day?). Scientists think it will drastically reduce our lifespan and it damages children physical development. I don't wanna live in such world.\n\nPractically, Facebook and Google work for governments because they are permanently tapped into their servers and siphon out everything they can so that they can control citizens as much as possible. It all started with 9/11 which was an inside job to justify spying in the name of fighting with terrorism, whatever the hell terrorism actually is. More than 50% people still use windows and chrome as their daily drivers. If it goes down to 10%, I MAY restore some faith for humanity, but currently it's so bad I'd rather a meteorite to wipe out this sorry civilization.\n\nAnd fucking niggers and muslims are already a MAJORITY at german schools, for example. This is a total collapse of white-man civilization. It's very bad also in france, sweden, UK... and many more. Also, I don't want to live in such world.",
				"added": 1573989856
			}
		],
		"1573319686_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 34,
				"body": "Maybe just use Qubes OS? It's the best thing there is for both security and privacy but requires a beast hardware, which will most likely be backdoored (IME/PSP, no coreboot compatibility)",
				"added": 1573326749
			}
		],
		"1573159148_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": [
			{
				"comment_id": 37,
				"body": "Yeah, it downloads only updates after initial site download, so you can even browse a last known version offline. It doesn't waste resources like clearnet.",
				"added": 1573327152
			}
		],
		"1573329847_1KENfNjTE2PPsRsUSNKr5fNNuFxSx7F3cT": [
			{
				"comment_id": 38,
				"body": "For me it works fine.\nhttp://127.0.0.1:43110/0play.bit",
				"added": 1573330441
			},
			{
				"comment_id": 42,
				"body": "> [tacticaltechjay](#comment_1_1KENfNjTE2PPsRsUSNKr5fNNuFxSx7F3cT): Strange. It just seems like it wasn't listed. Thanks for the link btw. I probably wouldn't have found it\n\nThere is a zite with a list of popular zites\nhttp://127.0.0.1:43110/Sites.ZeroNetwork.bit/",
				"added": 1573338835
			}
		],
		"1573322616_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 39,
				"body": "thx",
				"added": 1573330487
			}
		],
		"1573157871_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 44,
				"body": "> [fucktheusa](#comment_2_1BLEbkg58oLBXLeyb1fJZX6GNYRp8y7Y1i): Hear hear. Lets bomb the rich already!\n\nThat's the problem - we cannot afford and have no access to bombs, guns etc. while the rich can have all they want",
				"added": 1573386847
			}
		],
		"1573291463_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 46,
				"body": "Don't use any binary blobs on your daily Linux setup, just don't. Buy a console or a separate Windows PC and use it ONLY for gaming.",
				"added": 1573401383
			},
			{
				"comment_id": 52,
				"body": "> [randomshits](#comment_258_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Why not dual boot your system? You can even dual boot from two HDDs. [...]\n\nYeah, this works too. Just make sure you have separate bootloaders on separate physical drives. This way OSes will be 100% independent from each other, and also Windows is known to fuck up another OS installed on the same physical drive.\n\nAnd make sure to encrypt your Linux installation so that Windows can't see into it.",
				"added": 1573489923
			}
		],
		"1573418495_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 49,
				"body": "> [tomasz21](#comment_91_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): It's easy; it's about taking control of the whole. And a quiet takeover.\n\nOh yeah, NSA stealing ownership of zeronet is totally what we need",
				"added": 1573424824
			}
		],
		"1573412254_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 51,
				"body": "You know why islam is \"religion of peace\"? Because they believe there will be peace once all \"non-believers\" are eradicated. But I think, even then they would start killing each other to saturate their bloodlust.",
				"added": 1573476210
			}
		],
		"1573477450_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 53,
				"body": "ZeroNet works with Tor Browser with linux, you only have to uncomment two lines in tor's config file. It's all in the docs. Separate browser would be overkill and a hazard to privacy (since Tor Browser depends on many people with the same fingerprint using it, so if a new browser is made, we will stand out a lot)",
				"added": 1573490130
			},
			{
				"comment_id": 57,
				"body": "> [filips](#comment_308_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): @h3bhkj5gqz4n3pjm Can you explain how this specific features harm privacy: [...]\n\nURL autofill can be very harmful to privacy if you use it for search engine suggestions, because it sends every letter you type to Google/DDG/whatever even if you just wanted to enter a URL directly and not search for anything.\n\nAs for the other things, they probably don't harm privacy but introduce too much bloat for the software, making it slower and more prone to undiscovered 0-days. The more the code, the more chance there is something to be exploited in it.\n\nAlthough I especially hate that Mozilla integrated Pocket into Firefox. It's total nonsense (you can just use Firefox Sync), it wants you to pay for premium, and its privacy is dubious at best. Fortunately, you can easily disable it with one config change (extensions.pocket.enabled = false). I also don't get why Google is still the default search engine for Firefox - maybe not to scare normies migrating from chrome?",
				"added": 1573589334
			}
		],
		"1573531510_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 54,
				"body": "If google bans you for any reason, you lose yours emails, calendar, photos, drive files, youtube playlists, tasks and even ability to use your android phone. Even if you use E2E cloud, never rely on it, you don't own cloud data.",
				"added": 1573551567
			}
		],
		"1573424516_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 56,
				"body": "> [mg0](#comment_164_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I think you'd better use a different file system for zeronet, one that can deal with so many tiny files.\n\nWhich? Can Linux operate on anything other than ext* and ntfs?",
				"added": 1573589038
			}
		],
		"1573734530_17Tr1vdXC29zwecUt2pyPNMcHsqpJt8Xfj": [
			{
				"comment_id": 60,
				"body": "Because zeronet is built on BitTorrent protocol, which is not anonymous and private. You need extra measures like Tor (better) or VPN (worse) to really hide your IP and traffic from ISP",
				"added": 1573761426
			},
			{
				"comment_id": 63,
				"body": "> [rex4539@kxoid.bit](#comment_3_18F1Ga3hcY5ZSPoD5jeFow6w7uHyRtocdf): You do not NEED to use tor but using it gives you greater anonymity, if that's what you're looking for. And using Tor Browser enhances that anonymity even further. Any other browser can be fingerprinted and leak metadata.\n\nIs it actually possible for anyone to fingerprint and track you when using Zites if you for example change your default window size? Of course, the greatest benefit is that if zite makes a connection to clearnet, or you click a link to clearnet, Tor Browser will protect you from being compromised.",
				"added": 1573839130
			}
		],
		"1573754537_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 61,
				"body": "fuck off",
				"added": 1573761973
			}
		],
		"1573764857_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 62,
				"body": "They don't understand Tor is not only about changing your IP address. They don't know about fingerprinting, which Tor Browser is the only thing that currently reasonably protects from. They think just by changing their IP, they are untrackable.",
				"added": 1573765819
			},
			{
				"comment_id": 73,
				"body": "omg stop picking out each other's faults and just shut up if you have nothing valuable to say.",
				"added": 1573993504
			}
		],
		"1573172203_17LTVhar6FUm7BRaj8FFcoVDVkTr1Y6QcY": [
			{
				"comment_id": 64,
				"body": "Come to think about it, Linux desktops are so secure because so few people use it that it's not benefitable for anyone to target malware at them. But then again,  are we not annoyed at fucktards using Windows and Chrome as their daily drivers, or employers forcing us to use Whatsapp? It's not that simple.",
				"added": 1573839259
			}
		],
		"1573766528_16uViBCUYHEXEZr8EeGk8SBdHHnHqouqjs": [
			{
				"comment_id": 66,
				"body": "Maybe 0chan?\nhttp://127.0.0.1:43110/0chan.bit/",
				"added": 1573841353
			}
		],
		"1573239989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 67,
				"body": "What we need is decentralized power. But HOW?",
				"added": 1573841454
			}
		],
		"1573845173_1MqNGUHk63CGdv7KMZ9br6NvCUcDC5dezp": [
			{
				"comment_id": 68,
				"body": "> [goodafternoon](#comment_28_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): Here is my unpopular opinion, the people. Hear me out, each branch might have its own interests but the imperfect system is made by imperfect people. While it can be argued to be inefficient, I am very glad decisions are not made with haste. In the end, they are just trying their best (50/50) to utilize tax money. Maybe its because I live in a good community where we talk to officers like they are our friends and they do the same. I had a talk with the firemen and they gave me a tour of how the fire truck works, it was really cool and they where glad to show me around. Our neighborhood also paid for an American flag grill that looks really cool on the truck too. They worked themselves hard when Harvey hit our area too setting up camp in our local grocery store. I guess its a small town thing so you get my small town answer. How about you Sully?\n\nBest utilize tax money? Maybe best for THEM. In my country, politicians live like kings because they steal most of MY tax money. We taxpayers however, are in majority very poor with shit jobs.",
				"added": 1573847705
			},
			{
				"comment_id": 70,
				"body": "> [goodafternoon](#comment_29_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): I did say 50/50, using probably around %50 for actual work and the rest for anything OTHER than that.\n\nYeah I can kinda agree. They really DO make some nice things for the people. But I think it's rarely their main motivation. Where money and power kicks in, the worst side of human nature takes control, and this is almost always true for everything.",
				"added": 1573848646
			}
		],
		"1573773567_14WtAM4JZ6xzfVV3b31VNu2a3YoUnpdGcx": [
			{
				"comment_id": 69,
				"body": "> [1bfqutudhtexlka](#comment_37_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): then what is the difference from normal net ?isn't that \"censoring\" with extra steps ?\n\nI believe ZeroNet is made with resistance to censorship on a different layer. Government can't censor or force a zite to shut down, but a zite CAN censor users' content on zite, provided it's done by someone who has admin rights on it.",
				"added": 1573848502
			}
		],
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 74,
				"body": "not only niggers. arab muslims are like this too, and theoretically they are WHITE race...",
				"added": 1573993684
			},
			{
				"comment_id": 76,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1133_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're the culprit of stupidity\n\nwhy? They believe some bullshit ancient book and use it to guide their whole lives and civilization, from beginning to end. They practice some bullshit fasting month where they not drink or eat anything from sunrise to sunset, even forcing it on children. They came up with prayer 5x a day by hitting their faces on the floor to some stupid god that supposedly loves them. They have no democracy, only regimes. Is this not subhuman as well?",
				"added": 1573994637
			},
			{
				"comment_id": 77,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1134_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): democracy you're really a fucking idiot\n\nfuck you then cunt",
				"added": 1574002222
			},
			{
				"comment_id": 78,
				"body": "> [buddahdirypig](#comment_2_1AsCp4pwm5QuZPbZtfHDm3dAyqRWAD2ogF): GET A GUN, GET LOCKED AND PRAY TO BUDDAH\n\nyou don't pray to Buddha, he is not a god, and buddhism is godless. It's obvious you're a cheat",
				"added": 1574105783
			}
		],
		"1573794798_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 75,
				"body": "> [goodafternoon](#comment_26_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): I did some quick research on Lokinet. my conclusion, whats wrong with Zeronet? There is a community here already and seeding is free range and not forced with coin. I would check out apps but I think it wont be long before they are drug over here.\n\nBecause we need diversity. If there was only one VPN provider for example, it would eventually corrupt and we would have nowhere else to run. Take a look also at Startpage.com - it was a really good search engine that has recently been sold to an ad company. If there were no other private search engines like DDG, searx or ecosia, we would be utterly fucked. If Ubuntu was the only Linux there is, we would be at mercy of Canonical corporation and their Amazon spyware bullshit when it was active, with nothing else to turn to. But fortunately, there is Debian, Arch, SUSE, and even BSD to choose from. Don't like GNOME and systemd monopoly? Use Devuan which comes with Xfce and sysvinit by default. Don't like Mozilla's shady practices? Use Tor browser, Waterfox or Palemoon. Do you not really trust Protonmail team? Use Tutanota, Posteo, Disroot, or even GPG encryption with any provider. Or even use different providers at the same time for different things, with no single point of failure. Simple as that.\n\nWhat if zeronet dev goes state's?",
				"added": 1573993929
			}
		],
		"1574093554_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 79,
				"body": "niggers, muslims, brazils, jews, russians, ... so many cultures to hate and none to love :(",
				"added": 1574105904
			}
		],
		"1574091172_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 80,
				"body": "nevermind h3bhkj5gqz4n3pjm, he just insults everyone in every thread...",
				"added": 1574106030
			}
		]
	},
	"comment_vote": {
		"9_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"12_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"9_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"13_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"14_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"15_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"410_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"17_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"5_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": 1,
		"13_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"88_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"22_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"1_1LHXWgiFAN5D88F111t6xRHpHRQryf5WB1": 1,
		"91_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"309_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"61_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"62_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1
	}
}