{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Zemmour connait pas la frankfurter school? c'est ca leur truc...",
			"body": "je me souviens pas exactement des termes mais du genre la gauche identitaire...\n\nen gros tu fais des petits block avec des minorités opprimés...\n\nensuite tu les aggreges sans qu'ils comprenent\n\ndans le sens tu dis a des pds capitalistes qu'ils doivent embrasser le bolshevism sinon ils sont contre la \"liberation\"\n\net ensuite tu installes ton petit regime ethnic bolshevick...\n\nc est juste la manière d' une tribu d'israel de prendre le pouvoir...\n\nd autres mette tout leur argent dans une personne qui va gagner la confiance du regnant pour ensuite bouger les autres pour installer des licenses (ventes d'alcohol) et prendre ensuite le pouvoir, souvant en utilisant un petit epouvantail (les windsors)...\n\nen gros ils construisent une coalition pour renverser les natifs pour ensuite pour eux occuper les palaces... et installer bien sur leurs camps de viols d enfant...\n\n",
			"added": 1601194886
		},
		{
			"topic_id": 2,
			"title": "le fils de joe bidden...",
			"body": "les petits pds et les petites putes des medias veulent pas en parler...\n\nc'est marrant... on suce bidden... \n\npourquoi?\n\nahahaha\n\nleeches...\n\ndonc le boy. il prend du crack... autant la coke, je dis pas, mais la, je crois que ca devient violent... mais bon....\n\nalors comme son dady il est vip dans l'aristocracy americaine, le boy, il va pas 50 au gulag comme les blacks...\n\nnormal...\n\nensuite le boy, il se retrouve dans le board (le conseil d administration) de burisma, energy company en UKRAINE... quand dady il est VP... LoL pour 30k par moi... sympa...\n\nalors que le boy, il sait que prendre de la coke, et se faire des putes...\n\naprès tu te dis que la cia ou le fbi ils vont voir... faire leur travail... niet.\n\nla les services chinois ce disent qu un poisson comme ca c est pas possible., il faut voir si c est la total disrray chez les americains ou alors what the fuck....\n\nils filent au boffon, 1,2 milliards de dollars pour son \"hedge fund\"... alors que le mec comme dit il sait que se faire des putes et prendre du crack... genre mega lol\n\net la, again... les services americans, rien... pire chelou...\n\nensuite il semble que la veuve de l ex maire de moskow lui vire 3.5 millions de dollars et pire encore qu'il soit impliquer dans le viol d'enfant et le trafffic d etre humain en europe de l est...\n\net c est ca le probleme avec les epstein, weinstein et polanski... c est la propagation...\n\net pourquoi en chine on les executent...\n\nil doit y avoir une sacrée displine au niveau des operations etrangere chez les chineses...\n\non peut aussi prendre sheldon adeslon, le petit juif, il a essayé de corrompre des offficiels chinois avec ces casino a macau... heureusement, le system de defense chinois a AGIT et defendu la chine !\n\npas comme en france, ou ils ont proteger POLANSKI...\n\nqui? guigontine? meme a la retraite? je trouve que c est les meilleurs a tué...\n\nmoins juteux mais plus dur sur la lame...\n\nsling.\n",
			"added": 1601195275
		},
		{
			"topic_id": 3,
			"title": "Connaissez-vous Macron?",
			"body": "C'est quoi son plat favori? sa bouteille (maintenant qu'il peut siffler la cave de l'élysée... c'est pas comme chez rotschild ou il etait un untermensch ahahahaha).\n\nallez faites peter les scoops... ou les rumeurs infondées (encore meilleures).",
			"added": 1601220475
		},
		{
			"topic_id": 4,
			"title": "Demain, bouillabesse au port?",
			"body": "ahahah :).",
			"added": 1601224882
		}
	],
	"topic_vote": {
		"4_12Kp1EgVRD8d9URYbCXBxESmqC3UXy4TBS": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1_1Lm7quPgcqy7kHXqXqA4wx3ddWecEjn7MD": [
			{
				"comment_id": 1,
				"body": "Clairement, pour moi le probleme vient de la LICRA, le truc contre le soi disant racisme et l'antisemitisme...\n\npour faire court, il est soi disant \"illegal\" de dire sale pd de juif, alors que polanski peut legalement violer une americaine de 13 ans.\n\nc'est tout dit\n\nfaut lire certains truc... barbara spectre lerner en premier, c'est une bolshevick juive comme ruth ginsburg ou simone veile dont le but est de detruire \"edom\", c'est comme ca qu'elles appellent l'occident...\n\ndans une espece de super revanche contre la destruction total en 77 par Titus de leur merde de jerusalem et a la suite des differents gethos a travers les 100 pays et royaumes dont ce peuple a été ejecté au cours des siecles...\n\nles termes que tu dois comprendre c'est le genocide blanc et remplacement de la population... l' idee c'est le mongroloide qu'il essaie de créer... un espece de nouvelles esclaves sans ethnie, ni origine, maleable a souhait afin pour eux de devenir une nouvelle classe de pharaon pour prépaper l'avenement de leur messie...\n\nmais quand je te dis que c'est un truc de malade... tu tombes par terre  car forcement tu peux pas comprendre car jamais on t a informé de ce qui se passe...\n\nmoi perso ca a commencé sur hardware.fr... censurer... puis j'ai vus la pensée unique sur les commentaires du genre liberation / figaro... alors j'ai bougé chez les yankee... sous GWB ca allait tres bien !\n\ntotal liberté d expression, pas de souci, si tu fais le nigga antiwar t etais juste appellé antipatriotique mais t etais pas censuré...\n\npuis sous arriver les agregeurs... les twitters facefuck et autres merdes du genre paypal et tout, qui essaient de tout centraliser... pour nous domestiquer...\n\nheureusement y a WEIBO :)\n\nou le p2p decentralizé open source crypté ip maské et autre\n\nmais apres t as la steno...\n\nstenographie c est quand tu regardes le style d ecriture pour faire des fichiers pour essayer a nouveaux d imposer une ideologie subversive dans le but d'asservir les peuples a une ideologie protegant une aristocratie etablie...\n\ny a pas a dire y a plus de \"gangsters\" en amerique qu'ici... parles parles parles... ecrit... fout pas le bordel.\n\nalors qu'en france y a des nazis qui disent que soutenir que certaines molecules biochimique du cannabis ont des vertus medicales prouvé est un crime... c'est tellement con\n\net les meme merdes vont pour servir les bolshevicks juifs soutenir les merdes charlies merde.\n\ntu vois la logique ou t es trop con ou comme disent les yankees ton sale job depend du fait que tu ne comprennes \"pas\"....\n\ntu vois?\n\nnon hein...\n\npffff....\n\nmoving on.",
				"added": 1601193935
			}
		],
		"3_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 2,
				"body": "greed is good :)\n\nil semble michael soit pas avec les violeurs d'enfant... comme goerge clooney d'ailleurs...",
				"added": 1601193979
			}
		],
		"1_1MYphGidpbF2Yw1BPeTEsmgcwkV14RctxX": [
			{
				"comment_id": 3,
				"body": "fais pas le pd vient sur bitmessage",
				"added": 1601193994
			}
		],
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 4,
				"body": "ahhh on s'amuse toujours bien avec les grandes opérations contre les plantes de la création?\n\nun petit point suplementaire, et c est important aussi...\n\navec la fin de la prohibition tu as plus de chance de restorer une certaine collaboration des autochtone avec les forces de l'ordre de la république...\n\npar example au colorado, avant, le petit fumeur de joint avec ses potes dans le parc, quand il voyait de la merde, il allait pas appeller la police... bah oui... il etait dans l' illegalité comme le violeur...\n\nalors que maintenant il s enfout... il peut aller avec son joint quasiement jusque devant le poste de police, ou carrement faire le viligante ala malboro...\n\nc'est trop bouffon.\n\nmais bon...\n\ntu crois, t'as de la merde dans la tete ou des microbes mageurs de cerveaux.... ahahahah...\n\net on en a pas parlé mais les taxes...\n\net puis les grands chateaux cannabis francais devront travailler dur contre les maitres marroccains...\n\ntu vois c'est un vrai plan de relance...\n\net te trompes pas.... fumer... quoi que ce soit, sauf et encore de la vapeur d'eau c'est pas malin...\n\nmais bon... dans tout les cas tu meurs... pas d'echapatoir... \n\napres faut voir les petits veneres dans le monde juridique qui protegent et ont protéger des generations de polanski, historiquement lié au prerogative des warlords post rome qui violaient a gogo...\n\ndonc moi je te dis tout ton bullshit tu te le mets dans le cul bien profond.\n\nc'est comme les pds au final, j'en ai rien a peter ce qu'il se foutent dans le cul. c'est pas mon business si quand ils ont 50 ans ils doivent mettre 4 pampers... \n\non a d autre probleme....\n\net attends qu'une ou plusieurs jolies centrales nucleaire explosent... et la tu vas voir... ca commence...\n\ndonc on nettoie la merde et les idées recus des generations de gatekeeper et mentalframers (les petits lords de la penséee unique essayant d imposer leur construction narrative sur tes chemin neuronaux) pour avoir une meilleures resilence au moment des big shock...\n\npenses au Trex... skyfall....\n\net oui quand le ciel te tombes sur la tete tu veux le maximum que les chosé soit carré... la loi, réglé... pas des fictions par des petits corrumpus cherchant a assoir leur fictions pour extraire des vies merdique en esclavant d'autres...\n\na nouveau pas assez d'iq ici.",
				"added": 1601194563
			},
			{
				"comment_id": 6,
				"body": "non aux désunions artificielles (genre des plantes, ce que les gens se mettent dans le cul, etc) oui à l'unité réel dans le respect, la liberté et la sécurité... en pratique polanski viole une fille de 13 ans et est une star... pendant ce temps rachid et compagnie se font emmerder par les mêmes connards qui protégent polanski... vous voyez pas le probleme... pas de souci... a nuremberg non plus.",
				"added": 1601220220
			}
		],
		"4_18QJHpnhj9ZPt6Un23MaZH8MGmzbt9ffaw": [
			{
				"comment_id": 5,
				"body": "maintenant, je pourrais même t'en vomir dessus... mais tu n'en ai même pas digne :).",
				"added": 1601220099
			},
			{
				"comment_id": 9,
				"body": "selon d'ornelas, il y a 40 à 50 milles \"mineurs\" non accomapgnés (envahisseurs), coutant chacun 50'000 euros par en ans pour un total de 2 millars d'euros... il y en avait \"seulement\" 8000 il y a 4 ans:).\n\n> [foxtrot](#comment_4_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc): Ca te coûte la moitié de ton salaire ^^Et rassure toi, les étrangers ont le droit à plein de choses que tu n'auras jamais en travaillant :D\n\nwhite genocide + population replacement... c'est trop choquant ! encore, tu vois le francais en ruine, alcoholique ou je sais pas quoi, je peux comprendre d'être solidaire, peut-être que son arrière grand père il s'est sacrifié pour la france (ww1) ou un de ces ancetres a fait le hero pour le roi de france...\n\nmais la ces mecs qui arrivent, tranquilles, posent leurs sacs, et boom pris en charge... encore ca pourrait passer, mais en plus ils sont violents, violent (rapes) et foutent la merde avec je ne sais quelle connerie...\n\nmoi j'aime les frontières... c'est la fin d'un ordre jurdique et le début d'un autre.\n\nen plus ces envahisseurs détruisent les salaires et contribuent à la ruine general du pays.\n\ncomme ils disaient et redisent depuis trump en amerique : des illegal aliens... pas des \"migrants\" ou des mineurs, ou je ne sais pas quel news speak que les crétins veulent imposer...",
				"added": 1601223222
			}
		],
		"3_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc": [
			{
				"comment_id": 7,
				"body": "ségo elle veut mettre des gens en prison pour des plantes, mais pas ces enfants c'est juste? En plus j'imagine que c'est pas elle qui mene la lutte contre la DDDDRRROOOGGGUUUEEE... (à dire avec un ton bien sérieux avant de s'envoyer une petite bouteille ahahaha). bouffons.\n\nhier j'ai vus un truc bien violent, des petits poissons du mekong... un gars s'est fait chopper dernière le genou et est mort vider de son sang sur la berge... violent... pour des petits poissons... et je te dis pas les tortues de la mort, mais elles sont quasiment extincte...\n\nautre chose?\n\nque fait polanski?",
				"added": 1601220391
			}
		],
		"3_12Kp1EgVRD8d9URYbCXBxESmqC3UXy4TBS": [
			{
				"comment_id": 8,
				"body": "allez j'en fais péter d'autre sur le \"nanny-graber\"...\n\nil fait du sport le mac? (pas nocture donc ... ahahhaha)\nmusic? il est jazz? (aucune idée)\nil va la messe / culte / moskay / au temple ou dans des trucs chelou?\nsa voiture de sport préféré? lambo? ferrari? proschay? ou il est du genre cayenne ou limousine avec chauffeur?\n3 piece ou 2 piece le suit? de l'allemand?\nc'est quoi ces 2 bagues? un truc a la obama de trahison?\n\nc'est deja pas mal... \n\noui sa bande dessinée préféré? film? club dorothée?\n\nallez, je lance la derniere... \n\nla fille a brigitte, quid ? nanahhahahahha\n",
				"added": 1601220832
			}
		]
	},
	"comment_vote": {}
}