{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1580442199_17uMkozrmaPnE3mqaGZoHjWaN8tqRPimUF": 1,
		"1565103595_15N5Ekv4R4ikiM8YTboS3LgwjuUfrKB5QQ": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1554850854_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": [
			{
				"comment_id": 1,
				"body": "UwU - now you heard it",
				"added": 1615845395
			}
		],
		"1580442199_17uMkozrmaPnE3mqaGZoHjWaN8tqRPimUF": [
			{
				"comment_id": 2,
				"body": "I have 349GiB (322GiB after deduplication (318GiB after BTRFS's transparent compression)) on furry images. Unfortunately, my system only has 4.5TB in total storage across 4 disks and I lost some files due to unexpected power interruptions.\n\nI use a custom-coded script that is in a cron job that checks some subreddits and then downloads stuff using gallery-dl -- I used my own scrapers before, but it was easier to rely on someone else's work instead of writing dozens of scrapers myself.\n\nMy goal is to build a model that suggests words for any arbirtrary input image, and that, optionally, brings some images that the model describes similarly to that (cossine similarity index on the vector of features). I'd like to use Linear and Epsilon-Support Vector Regressors because I can understand them, and not Deep Neural Networks because I wouldn't understand what it does under the hood.\n\nSometimes I remember that people got mad with the creator of \"This Fursona Does Not Exist dotCom\" and that makes me afraid from making it happen and people getting mad at me for \"stealing\" \"their\" metadata or for both downloading and batch-processing their images without their permission (something that Google does every single day and no one seems to truly care).",
				"added": 1615850193
			}
		],
		"1565408003_1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP": [
			{
				"comment_id": 3,
				"body": "I'm a green furred dragon :3",
				"added": 1615851143
			}
		],
		"1514070653_167TLF5GGnpqGyiJDAaWidDD2VHo41BcFY": [
			{
				"comment_id": 4,
				"body": "There are two furry ([1](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1BM5oK5F2jpmoq2ZuKx912ZavrmmLPbuxP:furry:0)) ([2](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1Q6pAnQYPadX97RZXSFb17CWyFaXktUqhF:furry:0)) and a yiff ([1](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/13cSovQF7oJTARGAKxrdyHNa84ELoZZkq4:y:0)) board on MillChan.\nThe unfortunate part is that finding seeders is hard sometimes.",
				"added": 1615853219
			}
		],
		"1510624744_1KsguJRo4WBC2mtudEj83cTCpxVuCox5h7": [
			{
				"comment_id": 5,
				"body": "I'd request updating the board code to the newer one that supports dark theme.",
				"added": 1615853541
			}
		],
		"1565103595_15N5Ekv4R4ikiM8YTboS3LgwjuUfrKB5QQ": [
			{
				"comment_id": 6,
				"body": "> [pigpog](#comment_6_1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP): i feel like a furry zite could easily be destroyed by trolls\n\nYes, even this one, but why would they do so if they might end up ignored, we won't panic and react as bad as they want and they wouldn't laugh as hard as if they invested their time trolling furry spaces in normal internet?",
				"added": 1615858340
			},
			{
				"comment_id": 7,
				"body": "ZeroNet has less users than clearnet: there will be more furs there.\n\nOther zites offer interaction experiences other than the already explored to exhaustion forum board experience: there will be more furs there.\n\nI've seen furries setting up Mastodon and other instances instead of a zite or a furry-centric ZeroMe hub. I think that being able to filter who reads your \"personal\" stuff is an attractive idea that pushes people towards setting up a server, even if that can be defeated by creating an account with a throw-away email - a false sense of \"true privacy\", which ZeroNet doesn't bring.",
				"added": 1615861249
			}
		]
	},
	"comment_vote": {
		"1_1KAfaybmXBh916cDwXjd4gaE7ScnwfiYcR": 1,
		"6_1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP": 1,
		"4_1NVpW6BGgWn3oPYAjvsVjyHoBqApQpsJaP": 1,
		"1_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1
	}
}