{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1538314307,
			"title": "Does ZeroNet support TLS params in p2p connections?",
			"body": "I've gathered from pcaps that ZeroNet uses TLSv1.0 encryption on its p2p connections. Can I limit the cipher suite that ZeroNet uses in establishing those connections, or require the use of TLSv1.2, or modify the CA store used?",
			"added": 1538314306
		}
	],
	"topic_vote": {
		"1533871684_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1536955600_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"1536324263_14WGRwSbM55c5DuiSCME94BTj6GozZ48op": 1,
		"1537592624_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": 1,
		"1538009272_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": 1,
		"1534889280_19XhqfSemghmQf4m6SZVkw78qW6WKT4Gpx": 1,
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": 1,
		"1538339080_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1538339081_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566550712_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad": 1,
		"1566200523_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1536177988_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Literally nobody has ever heard of you, calm down.",
				"added": 1536704948
			}
		],
		"1536758231_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": [
			{
				"comment_id": 2,
				"body": "This is what you get for empowering bureaucrats to decide what you can/can't do. I have no sympathy for those who encouraged the creation of this coercive monstrosity (EU) but whom only claim credit when it does things they support.\n\"Concentrated power is not rendered harmless by the good intentions of those who created it\" - Milton Friedman",
				"added": 1536761291
			}
		],
		"1536786377_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU": [
			{
				"comment_id": 3,
				"body": "> [pdelic](#comment_9_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU): So, while reddit is shooting itself in their own foot, how's everyone doing?\n\nPretty darn good, wbu?",
				"added": 1536788168
			}
		],
		"1536836748_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 4,
				"body": "Google has somewhere in the region of 130T pages indexed, but how many of those ever get queried? The extent to which you would need to match that is only that you cannot order the search results by relevance, which is dynamically adjusted by the number of subsequent click-throughs anyway, and is ultimately limited by the fact that most people now will refine their search terms rather than scroll back through more than 3-5 pages.\nThere are a range of techniques such as ageing entries out and sharding the dataset across multiple DHTs you could employ to make indexing that number of individual pages indexable within zite constraints.",
				"added": 1536848301
			}
		],
		"1536955600_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": [
			{
				"comment_id": 5,
				"body": "This, coupled with the presence of underage material on some zites could really bite you in the ass",
				"added": 1536957591
			},
			{
				"comment_id": 6,
				"body": "> [skwerlman](#comment_80_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X): another idea would be different colors for clearnet links vs 0net ones\nThis would be very useful",
				"added": 1538041698
			}
		],
		"1538188815_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": [
			{
				"comment_id": 7,
				"body": "Jesus I sure hope not",
				"added": 1538219167
			}
		],
		"1538339080_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 8,
				"body": "For those using the cli you can update with 'python update.py' from within the zeronet dir.",
				"added": 1538338240
			}
		],
		"1538505571_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 9,
				"body": "Has this been merged into the master ZN github?\n\nIf you're going to do this ensure you A) have an ISP that supports IPv6 routing and B) that you are using your global unicast address cause I can forsee a wave of posts about how link-local addresses \"work for me but noone else\". If you don't understand IPv6 don't use it until you've read up on how it works.",
				"added": 1538571550
			},
			{
				"comment_id": 10,
				"body": "> [wulf](#comment_9_1AdgRmF4CQZRJVUf7t7GWmETZc2fq6PuBy): zero\n\nActually, having read the CJDNS spec it seems to be trying to accomplish things that're already in the IPv6 spec such as IPSec and Cryptographically Generated Addresses.",
				"added": 1538571868
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_169_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Will I absolutely need CJDNS if I already have2600:1:9190:2d3e:42e1:b2c6:6edb:6560as my IPv6 address? [...]\n\nIt doesnt look like CJDNS actually leverages IPv6 for transport as much as it uses IPv6 styled addressing, none of the addresses it generates are routable via IPv6.",
				"added": 1538584533
			},
			{
				"comment_id": 12,
				"body": "> [krixano](#comment_579_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): CJDNS replaces TCP/IP and implements its own TCP/IP on top, so of course it's going to follow the same spec. The addresses are routable... On CJDNS.\n\nThen, by definition, it's not IPv6 (as described in the RFCs).",
				"added": 1538586773
			},
			{
				"comment_id": 13,
				"body": "> [krixano](#comment_582_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): http://[2001:4860:0:2001::68]/\n\nUm no. Calling it ZN over IPv6 is inaccurate and misleading.\nYou can't claim you've setup an IPv6 tracker if your tracker isn't accessible via IPv6. It's not \"playing with words\". It's being accurate. What this actually does is setup an overlay network on top of IPv4 that uses addresses in the same format as an IPv6 address, but it's not using IPv6 as its transport mechanism. And it's none of the official IPv6 transition technologies such as 6in4, it's whatever the CJDNS project has arbitrarily decided its overlay network uses for addressing.",
				"added": 1538668854
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_171_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've run an HTTP server on IPv6. In the address bar, it looks like [...]\n\nThe post is super (and possibly intentionally) misleading, CJDNS isn't using IPv6 for transport and none of the addresses it generates are routable via IPv6. So calling it ZN over IPv6 is technically false. What it does appear to do is setup an overlay network which happens to have its own addressing schema look similar in formatting to the IPv6 standards.",
				"added": 1538668989
			},
			{
				"comment_id": 15,
				"body": "> [krixano](#comment_595_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Well, I never said anything about cjdns using IPv6 for transport. I said it implements it's own IPv6 on top of the cjdns protocol. Additionally, I never said anything about this being ZN on IPv6, but rather ZN on cjdns' IPv6. Notice how in this topic I've always said cjdns ipv6 - because it's cjdns specific. Also notice what I said here: [...]\n\nThis article is entitled 'How to enable IPv6...' and then goes on to discuss the implementation of an entirely separate technology, namely 'how to enable CJDNS for ZN'. You don't need CJDNS to run ZN over IPv6, and you're not going to make your ZN node accessible over IPv6 using CJDNS (hint: because CJDNS isn't actually using IPv6 addresses, it's just using hex based addressing and ripping off the name), and that's what the post implied.\n\nThe CJDNS project might not care it is misleading people by using the term IPv6 to describe something entirely unrelated, but I care whether what I tell people is factually correct. \n\nOh, and a tomato is a berry, which makes it a fruit. Like your argument.",
				"added": 1538693569
			},
			{
				"comment_id": 16,
				"body": "> [freeperson](#comment_19_1QJVjdwjqjGfFp6CtxzWTu19HRusPi9ds6): If one reads the white paper the fact that is not centralized is important in preventing denial of service attacks. The white paper notes that ISPs may remove sites that are frequently attacked by DDoS attacks. Not having ISPs in control of the address space prevents them from doing this.\n\nThere's nothing to stop someone from DDoS'ing the IPv4 public IP of your ISP internet connection and cutting you off from the CJDNS network. And if anything the p2p nature of CJDNS routing probably makes it easier to coopt multiple CJDNS nodes to flood a single node with traffic and actually amplify a DoS.\n\nAlso ISPs don't control, or care about what internal addressing you use on your DMVPN, they care about what public addressing your VPN tunnel is actually using because that's what they actually have to route. And they absolutely are in control of that. The reason that VPNs use private addressing is to stop traffic leaking out over the clearnet when the tunnel drops.",
				"added": 1538821871
			},
			{
				"comment_id": 17,
				"body": "> [kaffie](#comment_717_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The fact that it's centralized and you have to go through a centralized authority. Traffic currently isn't encrypted by default. [...]\n\n\nYour node isn't reachable to participate in the overlay network if you're not already reachable via the clearnet, that's how VPNs work. So you are entirely still reliant on your ISP and an address allocation. \n\nActual IPv6 actually simplifies what CJDNS has attempted to do by having IPSec and Cryptographically Generated Addresses natively supported by all major OS' without additional software. So beyond the DHT for distributed service discovery CJDNS isn't adding much that doesn't already exist in a simpler, more secure, and ubiquitous form.",
				"added": 1538822063
			},
			{
				"comment_id": 18,
				"body": "> [daniell](#comment_110_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): Basically: [...]\n\n\nThis isn't correct. CJDNS isn't faster than other types of VPN or distributed routing platforms. And its still entirely dependent on your ISP.",
				"added": 1538822130
			},
			{
				"comment_id": 19,
				"body": "I will say, for clarity that I was incorrect about CJDNS not using IPv6. It is using Unique Local Addressing (private IPv6 addressing) for the CJDNS node addresses. These however are not routable over the public internet in the same way and for the same reason as IPv4 RFC1918 private addresses.",
				"added": 1538822236
			},
			{
				"comment_id": 20,
				"body": "> [daniell](#comment_111_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): You didn't understand the point of CJDNS\n\nI'd be happy to be educated. Because it sounds like you and several others don't understand basic networking.",
				"added": 1538834583
			},
			{
				"comment_id": 21,
				"body": "> [daniell](#comment_113_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): CJDNS is faster than any other IPv4 or similar mesh network software.It depends on ISP because we make it depend on ISP (no enough CJDNS to connect directly on local networks)\n\nI would love to have like a google hangout (or whatever) with you and some the other people in this thread about this. Not least because I don't think this is the most efficient medium for this discussion. \n\nThere is a massive conflation, and I don't know whether its intentional or not, going on here between the stated aim of ZeroNet; to distribute web content without relying on central servers, and the facile argument being made in favour of mesh networks that ISP == \"centralised\" == bad.",
				"added": 1538835383
			},
			{
				"comment_id": 22,
				"body": "> [daniell](#comment_114_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): I think I'm only of a few here that wouldn't use a mask on google hangoutLooking if other users wants to participate on this and upload to KopyKate\n\n\nI'm happy to use whatever chat service people are comfortable with. I have my own zoom bridge we can use if people are concerned about google hangout or twitch or youtube, etc.",
				"added": 1538836409
			},
			{
				"comment_id": 23,
				"body": "> [kaffie](#comment_720_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Right? He's clearly a shill trying to stop decentralization from happening. [...]\n\nSo if I disagree that your baseless and totally ignorant opinion on ISPs I'm shilling for authoritarian centralisation. That sounds like a mature and well informed counterpoint. I don't have to get paid to recognise and point out shitty excuses for your shilling of CJDNS as the solution to a problem you still won't define or describe.\n\n> [kaffie](#comment_720_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Lmao ahahahahahahahaha. This is too funny. Are you really that stupid to think that supporters of zeronet wouldn't support decentralization of network infrastructure? ISP shill for sure.\n\nDid you think twisting my point was the right way to address it? I didn't say supporters of ZN wouldn't aspire to p2p mesh networks, some might, I dunno I'm not a mind reader, I did say that's not the stated aim of ZN on the website. And as for being a shill you've still to explain A) how ISPs existence equates to centralisation, and B) how I was 'shilling' that even if it did.\n\n> [kaffie](#comment_720_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): My discord server is always open for these kinds of discussions.\n\nYour discord (an ironic choice given its privacy policy) is largely dead by the looks of it. And browsing through the older posts there are such gems as \"ISPs haven't added IPv6 support because IPv4 makes more money\", such statements reveal an ignorance about (amongst other things) the basic economics of operating an ISP, IPv6 transition/rollout challenges, and an extremely naive view of why internet infrastructure is architected/built/operated the way it is.\n\nIf you want to be taken seriously, and I expect that you do because despite your ignorant statements and immature ad hominem attacks I genuinely think there's a common interest here in divesting the trust model of the clearnet to empower its users, you need to spend less time shamelessly touting Alex Jones style conspiracy theories about \"ISP centralisation\" and shilling pet projects and more time objectively discussing the actual flaws in the current internet technologies/trust-model and the real dis/advantages of the tools and technologies (like ZN, CJDNS, Tor, et al) we can use to address them. \n\nI'm interested in fixing the real issues with the clearnet, and there are many, but we have to first be honest and objective in identifying them. I believe the future is p2p but it isn't a panacea and not all clearnet problems are fixable by adding another layer of p2p or distribution. That's not a denial that p2p is preferable than c2s, or that distribution is preferable to centralisation, or that we should aspire to a zero-trust model for the internet. Misrepresenting that view as \"you only disagree because you're a paid shill of BigISP(tm)\" is childish and an obvious attempt to discredit legitimate criticism that doesn't support your preferred pet projects.\n \nI'll say it again, if you, @daniell, and anyone else is interested in having a constructive and adult dialogue about these issues and technologies I'm right here.",
				"added": 1538910532
			}
		]
	},
	"comment_vote": {
		"2_1MaNnFswuYYyEP3B1BU8fctPX6puHzhsBg": 1,
		"25_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"88_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_17Um4CKDDz6HV2NQy6aJB34PPPAkB1ubD9": 1,
		"2_1Ap8wHPueMwX3Bcazwgbbpuu5C6ssSRSA": 1,
		"151_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"360_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"690_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"11_1BTTUVH4J6ehmGUeK7XgkJ7mShAEx4hVL": 1,
		"80_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X": 1,
		"245_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"2_1EDaUQeKHEfXBXUFAuUwvWDSp7VZwAxN8b": 1,
		"17_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": 1,
		"169_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"107_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"75_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"76_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1
	}
}