{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 1,
				"body": "Most businesses in Canada are fighting back via Common Law.  It seems to be working for a lot of businesses.  If you claim you're a living man or woman and you say \"I don't stand under your authority\" then the bylaw officers can't do a thing to you.  Then you send 3 notices of trespass and liability to the bylaw officers and mayors.  Under common law the third letter that you send to them makes it a valid contract under their system.  In the end it could mean $100K fine for anyone coming in including the mayor.   It has stopped the harrassment by bylaw officers of many businesses.  So I guess that's the start to end this.",
				"added": 1610576514
			},
			{
				"comment_id": 2,
				"body": "> [whotoldyouthat](#comment_8_1AeFu4C63ou5WLJuMboxp9Ni2z45eT5XmN): Pretty comprehensive list, my dude. I would just add that becoming self-sufficient can be a method of alternative currency, lessening dependency on, and support of, the central banking cartel. There's an excellent video out there called something like \"Seeds are the Currency of the Future\" or something like that by Matt Powers.\n\nI think if people started pricing goods in bitcoin that would freak the establishment out.  But that is what we need to do.",
				"added": 1610589952
			},
			{
				"comment_id": 3,
				"body": "> [radiator](#comment_33_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): can you provide articles showing this? I don't see them leaving you alone just because you tell them too. I would LIKE to believe it, though.\n\nGo to https://awarriorcalls.com/a-warrior-calls-landing-page/    Anyone who lives in the States or any commonwealth nation can do this.   You can also go to www.commonlawcourt.com and register your birth certificate there.  Once you have that then get the deed to your fictional name.  Ie. The birth certificate your parents registered you for when you were born.  \n\nWe are living under maritime law (contract law) Common law is law of the land.  Everything to the state is based on contracts..  A good video to start is what is meet your strawman.  https://youtu.be/ME7K6P7hlko",
				"added": 1610809742
			},
			{
				"comment_id": 4,
				"body": "Most of his videos are on bitchute now.  He hasn't had much time to update his website so he still has youtube links up there.   https://www.bitchute.com/video/biiifPQy71jb/  This one is about a guy (Tim) who owns a water store in Burlington Ontario.  He basically uses common law to keep bylaw officers out of his place.. To date he is still open and doesn't require customers to wear masks.    Right now in Ontario, businesses that aren't deemed essential are being harrassed by both police and bylaw officers.   Also we have stay at home orders which most of the population is ignoring since our premier was seen at his cottage over the past weekend.",
				"added": 1610989809
			}
		]
	},
	"comment_vote": {}
}