{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1633141962,
			"title": "我偶尔也会这样",
			"body": "看到这个ID请让他滚去学习，谢谢\n带您背单词:\n[四级]ridge/ridʒ/n.脊；岭，山脉；垄",
			"added": 1633141961,
			"parent_topic_uri": "1571187322_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1633142644,
			"title": "信息密度",
			"body": "信息密度(information density)指一份信息所能提供的相关信息量的相对指标。仅仅考虑系统的信息，是不够的，因为这仅仅考虑了系统的联系，忽略了系统的差异和相互作用。如果我们综合考虑联系、差异和相互作用，就不仅要考虑系统的信息，而且要考虑系统的惯性，由此就需要引出一个叫做信息密度的概念。\n\n文字，方便检索\n图文\n视频，不方便检索\n\n是啊 碎片化信息持续不断的以微弱的强度刺激着我们的大脑 久而久之我们就不喜欢也不习惯于深度的持久的思考同一件事了",
			"added": 1633142642,
			"parent_topic_uri": "1571187322_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1633142718,
			"title": "绝大部分社区都是内容产品？信息密度是关键！",
			"body": "绝大部分社区，都是披着社交的内容产品；比如微博，并不算社交产品，绝大部分用户都是内容消费者。这类产品应该明晰自己的定位，以提升内容密度和质量、培养平台自身大V是关键，而不是增加社交互动。\n\n报纸/杂志、门户网站、论坛、新闻客户端，今日头条抖音这样算法推荐的产品，都代表了各个阶段内容产品的演进。\n\n实际上：微博这样的综合社区，雪球知乎这样的垂直社区，本质上都是内容型产品，并不是社交产品。\n\n随着技术的不断更新，内容产品形态不断迭代，但始终都遵循着相同的规律——沿着不断提高信息密度的方式进行。\n\n信息密度（信息浓度）：指站在用户角度，在单位时间内，看完同等量的内容，用户认为获得有价值信息的量。\n\n信息过载，永远都看不完，信息总量变得不重要，信息的精确匹配变得重要，用户会不断的打开信息效率高的内容产品。\n\n报纸/杂志、门户网站、新闻客户端这样的产品，千人一面；每一个页面中都有大量别人感兴趣，而用户不感兴趣的内容，这些产品最终都逐渐没落。\n\n解决办法现在有两个——算法和关注关系，建立每一个用户唯一的内容推送，尽量精准匹配提高信息密度。\n一、内容产品和社交产品的区别\n\n微信、QQ算典型的社交产品。\n\n此外，绝大部分社区，都是披着社交的内容产品；比如微博，并不算社交产品，绝大部分用户都是内容消费者。\n\n腾讯旗下自选股，以及腾讯投资的富途证券，两款股票类的互联网产品。因为腾讯背景，两款产品都希望做股票社交，但均失败。\n\n两款产品没有搞清楚内容产品和社交产品，你来我往互相探讨是社交，看人聊天吹股票是股票UGC内容产品；股票的世界，没有社交产品，只有UGC内容产品。\n\n内容产品要成功，只有一个办法，尽量让用户的手机屏打开后，充满屏幕的是用户感兴趣的内容。哪怕少一些，也要尽量提高信息密度。\n\n自选股、富途证券产品生于移动互联网时代，把大量的精力投入到了移动端的开发当中，忽略了在PC段的开发，这是一个重大错误。股票社区是一个内容产品，需要优质的内容去灌溉，相当一部分优质的内容是长文/图片，超过几百字，PC端输入编辑仍然占据绝对优势。\n\n两款产品在PC端的忽略，用户没有在PC端使用两款产品的习惯，导致没有优秀的长文内容。\n\nPC端输入的优质内容，对于用户的内容消费体验异常重要，否则无法完成对用户时间的占有和用户阅读习惯的培养，平台自身也无法UGC内容生产为其他用户服务以及向外扩散，社交网络的滚雪球效应无法完成。\n\n雪球、知乎、豆瓣本质属于UGC资讯内产品，最初都起于PC端，并且都保留了PC端不错的用户体验。没有好的PC端体验和用户时长，成功的UGC资讯类产品，还没有。\n\n要区分内容平台和社交平台，FB、微信属于典型的社交平台，鼓励用户实名，并且建立社交关系。微博、雪球、知乎等产品，属于典型的内容平台，用户是来看内容的，不是来交朋友的，尽量不要实名。\n\n腾讯还在尝试把微信的好友关系，倒入到自选股中。这个选择很自然，见效快，但却是万劫不复。很多产品，都鼓励用户上传通讯录，鼓励好友之间加关注。这是错的。\n\n一个新的基于关注关系的内容产品，每一个新用户使用时，本质上是加关注，去重建自己的手机屏幕内容。平台要做的，是尽量让他的屏幕充满了他感兴趣的内容。\n\n按照这个逻辑，推荐已经知名人物、和已经被证明的大V是比较靠谱的。而普通人大部分的通讯录好友，并不具备内容生产能力，这些关注只会稀释屏幕的信息密度。\n\n更大的危害在于：熟人网络之间的关注，会大大抑制普通用户的创作欲望，这一点下文有更详细的说明。\n二、自身培养大V，是UGC平台的关键\n\n对社区早期而言，大部分的运营方式就是拉站外平台大V，这是很通常的做法。但，社区平台成功，没有依靠外部大V为主的，培养自己的大V用户，构建信任的关注关系是关键。\n\n早期大V，能为平台早期带来流量以及增信，头部大V能带来长尾普通用户。普通用户长时间使用一些平台，其中一些转变为大V用户，是社区发生质变的关键。\n\n平台早期优质内容少，平台可以通过运营一些自己掌控的大号，或者编辑手段，将全平台所有的优质内容，都推送到用户的timeline。确保用户的屏幕，一直有优质的内容存在，延长用户的在线时间。\n\n瞎几把扯是人的天性，只要有在线时长，普通用户们就一定会产生内容。对于优质内容，充分编辑、美化、包装和传播，让内容被更多人评价，生产者被更多人关注，形成激励。\n\n对于生产内容的用户，除非个人主动表达了诉求，尽量不要做实名。对绝大部分普通用户，在初期对于平台没有任何的诉求。平台只是一个匿名的记事本，或者树洞，匿名广场。\n\n几乎所有的社交平台，都鼓励上传通讯录的，让亲朋好友关注你的功能。作为一个内容平台，这个方式是不对的，这种行为阻碍了普通用户生产跨出生产内容的第一步。\n\n大部分普通用户在生产内容的时候，都是情绪化的，无功利性的。为炫耀、为吐槽，为在广场吼一嗓子听听别人的意见；但最重要的是，不想负责任。普通用户没有成长为大V的初期，信心不足，匿名能保护用户的表达欲。\n\n金字塔尖的用户的发言内容，能吸引金字塔底的用户；反之，则不行。所有的UGC内容平台，都是从上往下运营的。对于普通用户，确保他们的timeline上塞满了数量足够多、信息密度足够的内容即可。\n\n许多社区内的产品，喜欢出一些功能，去验证用户的信用。比如股票类社区，喜欢去验证用户的投资业绩究竟如何，这种行为是错误的。\n\n这个世界上，声音传播速度多少，万艾可的分子结构，是已经知道并且可以被验证真伪的信息，已经被PGC了。UGC的内容发言，大部分围绕苹果股票是否会涨、周星驰演技好在哪里，如何看待新一轮加息，大部分情况是不可验证的。\n\n平台没有能力去帮助用户找到标准答案，平台能做的，帮助用户找到用户认为正确的答案，以提供足够多丰富内容和角度为要。并且通过关注关系、推荐关系进行内容分发。\n\n只要事实清楚逻辑清晰，就是好内容。同样的内容，不同用户的出两个相反的结论，亦无不可。平台既无能力也无责任去验证，提供标准答案。\n\n相反，验证用户的行为会杀死所有的大V的信用，摧毁平台。\n\n“友善”是平台最应该倡导的，正常的、有逻辑的辩论值得鼓励。要严格管控不友善的言论，尽量让内容生产者，能得到更正面的反馈。\n三、少就是多，提高信息密度时内容产品的成功关键\n\n内容的分发是平台的核心。\n\n平台把用户关注人的发言，按照时间顺序进行排列，是最通常的方式；但这个方式还有很大改进空间。\n\n这个方式，只考虑到了发布内容的“新鲜度”，但是不同的内容有不同权重，同样的内容对不同的人也有不同的权重。一个用户关注100个大V，但对用户只会对少数大V有更深的信任，同一个大V，发言有重要的和聊天吹水的。同样的内容，也有被很多人讨论和无人讨论的。\n\n这些权重，都应该不一样。\n\n也就是说：两个不同的用户，关注同样的大V，各自的timeline页面都应该是不同的。大部分用户，并无精力浏览自己所有关注内容，应该让用户优先看到高权重的内容。应该有算法，去提高用户在浏览时候的信息密度。\n\n少就是多，精准比数量更重要。微信朋友圈已经是国内最大，最成功的内容平台，其运营的思路非常值得借鉴。\n\n微信是比较严格执行少就是多的平台。\n\n公众号每天只能发一次，迫使内容生产者精心编辑，把最好的内容发出来，减少垃圾信息的发布，增加信息密度。最新的微信公众号改版，公众号只露出前两条，也体现了这样一个思路。\n\n公众号的内容量，已经足够丰富，从数量上早已经超过用户能消费的量，微信在继续压缩，迫使生产者去做头部内容。最新一次改版，微信大幅度的提高了用户取消关注的便利程度，也在压缩“流量号”，扶植把内容做精的品牌号。\n\n不仅如此，微信朋友圈的管理规则中也处处体现了 “少就是多”的思路。\n\n在朋友圈管理中，微信在试图不断在降低非有效内容的传播，减少出现在用户timeline里信息的总量。微信大幅度的压缩微商、压缩“个人测试”爆款的东西、压缩朋友圈点赞，包括同一个文章被超大量的转发，压缩诱导分享。\n\n这些内容会严重稀释正常内容，降低正常用户在朋友圈获取有效、有价值信息的效率。\n\n有一些个人测试和活动，短期提高用户的参与度，但这些都不是用户浏览朋友圈的目的。这些行为降低了朋友圈信息到达效率，长期来看是有害的。所有降低用户信息获取效率，长期来看，都会使得用户远离这个产品。\n\n为什么微博会允许王思聪的转发抽奖？\n\n这是错误的行为。\n\n这导致有数百万上千万人，在无效信息上多花了5秒时间；或许微博认为，他们用户的时间是不值钱的吧。",
			"added": 1633142715,
			"parent_topic_uri": "1571187322_1MvkYQf2rLUspQvPSo18pdJsujt2aXbXB9"
		},
		{
			"topic_id": 1633144939,
			"title": "initrd生成器",
			"body": "initramfs\nmkinitrd\ndracut\n\ngenfstab一步到位",
			"added": 1633145023,
			"parent_topic_uri": "1631265873_17eygZWLfGupqABZe2GxmHnq6WWaMGQtWi"
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}