{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "[идея] Шлюз для работы с одним сайтом",
			"body": "ZeroNet уже хорошо подходит для некоторых вещей, например всяких статических сайтов или бложиков. Однако, многие, даже используя ZN предпочитают вести бложики в других местах, по причине малой аудитории. Обычные шлюзы, которые представляют собой запушенный клиент с Multiuser плагином, не очень удобны и медлены. Хорошо бы иметь возможность шлюза, который бы позволял настроить работу с конкретным сайтом, предоставляя его в режиме только для чтения, например. Без фрейма, боковой панели и прочего.\n\nА при заходе через шлюз приписка: \"Добавление комментариев возможно через ZeroNet\"; и ссылка на ZeroBundle.",
			"added": 1481015291
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "Они сломали ZeroNet! Почему опциональные файлы начали удаляться, когда установлена их загрузка и хранение? Где это настраивается?",
				"added": 1479634075
			},
			{
				"comment_id": 2,
				"body": "Так даже хорошо, оно теперь хоть не заполнит все свободное место и не упадет.",
				"added": 1479669461
			},
			{
				"comment_id": 7,
				"body": "> [neochapay](#comment_1_1KtyBo6c2vsNGywtnu8kR8o94F6EdxTNSf): А где он лежит ?\n\n`./data/users.json`",
				"added": 1480406132
			},
			{
				"comment_id": 8,
				"body": "> [jtprogru](#comment_3_1AaNB6c2GVPzwF4mgjFJUHDZ727Sh7vrad): А если у меня поднят докер-контейнер для ZeroNet? То я так понимаю надо забэкапить полностью сам контейнер вместе с тем датастором (конкретный фолдер) который к нему подмотан?\n\nтоже достаточно только файла.",
				"added": 1480407611
			}
		],
		"2_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 3,
				"body": "Перевод это хорошо, но кириллические шрифты отвратные. Если касается ZeroHello.",
				"added": 1480086160
			}
		],
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 4,
				"body": "[Antilibrary](http://127.0.0.1:43110/antilibrary.bit)\n\nКнижечки.",
				"added": 1480274547
			}
		],
		"1_177fyXLBGuYQLA6CnAjvVCmp5PPAZb5RbD": [
			{
				"comment_id": 5,
				"body": "`./data/users.json`",
				"added": 1480359870
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 6,
				"body": "> [pztrn](#comment_1_1PChmSemiXAoFbhxQDUAivb4G5Qi7jUbUz): дратути\n\nКак там friendica/redmatrix?",
				"added": 1480359994
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 9,
				"body": "> [oo7o6y](#comment_2_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr): интересно, написал здесь, видел что опубликовано а теперь исчезло, и здесь цензура?\n\nГлобально в зеронете цензуры нет. На отдельных сайтах впрочем её никто не запрещает делать. Хотя в итоге нормальных средств модерации пока нет.",
				"added": 1480454710
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 10,
				"body": "> [ebanator](#comment_3_1B4mGfgJm7xyFCRyaUbLSUwBKxKZRiyb6Q): Нет, ну сколь же охуенная платформа. Вангую https://webtorrent.io/ вместо магнетов\n\n[ZeroTube](http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/)",
				"added": 1480467953
			},
			{
				"comment_id": 11,
				"body": "> [mech](#comment_1_18f1UYi8CjGZLhpnjSr4LTDEAUbeiuwHuQ): А так-же адресов EMC?\n\nС адресами другая тема. Здесь адреса сделаны в формате биткоин адресов, но на этом все. Предполагается что можно отправлять пожертвования на эти адреса, но на самом деле так почти никто не делает, так как неудобно. Вводить другой формат адреса особого смысла нет. Никакой блокчейн не использутеся.\n\nВот с именами есть кое-что. Тут помимо адресов сайтов есть ещё имена, идентификаторы пользователей. Сейчас это сделано централизованно и многим не нравится.",
				"added": 1480981285
			}
		]
	},
	"comment_vote": {
		"18_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1
	}
}