{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1610152196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610162257_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1,
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610509513_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": 1,
		"1610627966_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": [
			{
				"comment_id": 1,
				"body": "feelsgoodman, the lefties are right about one thing - they should have purged us earlier and we should have decentralized ages ago.",
				"added": 1610183825
			}
		],
		"1610169002_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "> [quantumkitty](#comment_519_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): This isn't calls to violence though. [...]\n\nseems like it. decentralization is long overdue and creating separate echo chambers isn't helping anyone, but I am far from \"guise both sides equally bad\". I've never heard leftists advocate against righties being censored, but have heard many calls against censorship the other way around.",
				"added": 1610185727
			}
		],
		"1610152196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "Trump's biggest mistake was not blasting alt tech ads from day one. He should have helped decentralize, instead of propping up big tech with his accounts as they continued to censor. I didn't expect this to happen while he still was in office though, that's a ballsy move and it shows that they are confident in their power, scared or both.",
				"added": 1610188587
			}
		],
		"1609979400_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "If the internet became more decentralized instead of just a couple of relevant main platforms, nobody has to care about censorship, because then you just move somewhere else and evade the authoritarians. The problem is, a couple of main platforms have a monopoly on attention and act like a cartel, and so getting banned from one of the platforms often means a ban on all of them, and that makes it almost impossible to reach the same level of following. The solution is to open the market as wide as possible and spread out.",
				"added": 1610190728
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 5,
				"body": "Covid exists, but it has been effectively used to gain authoritarian power across the globe. The virus itself isn't a scam, the response to it absolutely is. It has exposed how many people go along with literal retardation (mask mandates outside with no one even remotely nearby) just because the government tells them to do so. Telling us that we can control viruses is also a scam, all over the globe we see that the measures short of total police state lockdown at best postpone the problem (and even then I do not believe you can actually achieve 0 cases, seems ridiculous and false numbers seem to be a better explanation).",
				"added": 1610191239
			},
			{
				"comment_id": 6,
				"body": "> the goal isn't to reach 0 cases its to slow down the spread as a cure or vaccine can be developed and distributed\nI've seen people advocate for total lockdowns to be covid free. I am talking in response to those people. If you are in favour of \"slow down the spread\", please present a concrete end condition and maximum damage you are willing to inflict on things like the economy or social relationships to achieve it. As far as I am concerned, we're far past the point of the cure being worse than the disease, with countries going authoritarian which will take years of time and blood to undo, small businesses closed permanently, people thrown into paranoia about simply meeting their family.\n\n> governments aren't saying that masks and lockdowns prevent the spread health and scientific authorities are.\nI am fairly certain the WHO's current position is that lockdowns are not effective, and yet governments keep doing them anyway - you will get different opinions from different authorities. Mask mandates and lockdowns are not just a medical question, because health is not the only issue in society, and especially lockdowns affect far more than just health. I am against both being forced onto people on principle. If you feel scared and want to close your business or you don't want to go to shops and would rather buy online, it is your choice and I respect it. Let me make mine.\n\nHell, I would've even been okay with a lockdown at the start of the whole ordeal, as long as the rules would be clear, exit conditions specified and taxes suspended. As it stands today, it has been government overreach after overreach, confusing rules, incredible waste of public money and a lot of unlawful rules being enforced anyway. I understand health concerns, but I ask the other side of the issue to consider my position too.",
				"added": 1610193319
			},
			{
				"comment_id": 7,
				"body": "> their current stance is that they're effective just not as a primary strategy to halt spread.\nfair enough, I accept.\n\n> I'm ok with measures like that being forced as long as they're temporary and reasonable\nI could compromise on temporary lockdowns, as I said. We're on month 8 or more, depending on where you are, and there is no end in sight, with deadlines being pushed further over and over again. I would love to get an answer to \n> please present a concrete end condition and maximum damage you are willing to inflict on things like the economy or social relationships to achieve it\nI've never seen conditions put forward, it's always either lock down for as long as \"the experts\" tell us to, or from the other side \"never close anything\".\n\nInstead of respecting people as responsible adults through transparency - by setting predictable, clear rules and concrete declarations, instead of saying \"we're sorry, we need to do this for this time for this reason\", we've been treated to confusing messaging, constantly shifting standards, endless bait and switches of \"we'll allow you to open in a month\" changing to \"sorry, you can't open\" after people already invested their money. On top of that, time and time again the politicians and media personalities were caught breaking the rules they set or promoted, with little to no consequence for doing so.\n\nWe also have not seen any public debate weighing the pros and cons of the preventative measures taken. Lockdowns lead to higher suicide and abuse rates, deteriorating mental health, destruction of small businesses, not to mention economical damage and further debt. Those are all matters of human life, lockdowns do not happen in a vacuum and while potentially delaying covid, they have adverse effects that were never discussed properly. Again, I would love transparency, with politicians coming out to say \"we can handle this much economic damage\", \"we have to do this even though there will be those consequences\", but we had none of that, instead, lockdowns were presented as a moral good and objectors called morons, censored or deplatformed.\n\nDefinitely went on a bit of a rant here, this has been boiling in me for a very long time. I think there was a way to get through this peacefully while maintaining trust, and I think the way this was handled was an absolute disgrace. At this point, I want either transparency and clear exit conditions, or immediate end of all lockdowns, I very much am done with my government locking me in my house with the reason being \"just trust me bro\". I am aware neither will happen, unfortunately.",
				"added": 1610202980
			},
			{
				"comment_id": 8,
				"body": "> [goodusername](#comment_9_112NAM5jhYWH4egafracJEF92oyeUY3F3T): I don't know about yours but in my country they're are public debates about the pros and cons of preventative measures. [...]\nThanks a lot for the conversation, I'm very glad to talk to someone reasonable after feeling like the world is going insane for a long time. I suppose it comes down to country differences, I envy your situation and would definitely have far less of a problem with lockdowns had it been the same here.",
				"added": 1610211921
			}
		],
		"1610219039_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": [
			{
				"comment_id": 9,
				"body": "there is an android app for sure, I don't know how well it works, but it is there.",
				"added": 1610219009
			},
			{
				"comment_id": 10,
				"body": "> [g0dless](#comment_2_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM): cool. do you know the name? Or better yet, do you have a link to download it?\n\nyea, if you look up \"zeronet\" on your phone and hit the first link, it takes you to zeronet.io, on which there is a \"Download Android package (experimental)\" button, you hit that, download the .apk, click it to install. You might need to allow app installs from unknown sources if prompted.",
				"added": 1610219441
			}
		],
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "based",
				"added": 1610230527
			}
		],
		"1610228061_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 12,
				"body": "Transparency is the key. I am generally against lockdowns and mask mandates on principle, but I can agree to restrictions if there are clear rules, there is a solid deadline and a maximum shift for that deadline, and I am informed about government decisions and the reasoning behind them. As it stands now, I have no more trust for the government nor media in my country, because the rules are constantly changing, there are no deadlines I can trust and many rules are flat out nonsensical.\n\nMask wearing is also a similar issue, if I am to be honest, I have to say wearing one disgusts me after \"wear your mask\" essentially became a cult that you are not allowed to question. We still have a mandate forcing us to wear masks outside regardless of circumstances, which is utter nonsense, and it is not the first nor the only nonsensical rule. There isn't any concern for disposal, nobody cares about what you use as long as it covers your face, making the whole ordeal look like an exercise in compliance over actual protection.\n\nAgain, I would accept it with transparency, like stated before, but at the moment we're not being treated as adults, instead of \"we're sorry, but for reason X we need to do Y for Z amount of time\", we're getting \"shut up and comply\".  I'd imagine (and have already been told by someone here) that if your government is more respectful, you'd have a different attitude.\n\nAs for compensation, it is only fair that the government suspends as many taxes as possible for the time of the lockdown, because if you are not allowed to earn money, you should not be forced to pay what you have saved. I'm mixed on stimulus, especially if the money for it is to be borrowed or printed and the amount is pitiful compared to months of expenses.\n\nIf you have a full lockdown and you manage to eradicate covid on your island, that's great. Is the plan to vaccinate as many people as possible and only then open the borders back up? I'd imagine you'd risk another outbreak if you started allowing flights again, even with testing.",
				"added": 1610231854
			}
		],
		"1610255135_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 13,
				"body": "It is a disgusting display of force, but it'll hopefully force people right of Mao to build their own infrastructure. It's a bit late for that, but better late than never. I don't know how much of it has to be built, because the current tech systems seem to be rotten to the core, including payment processors and hosting services. We're seeing what's happening to Parler at the moment. There is no hope for at least the US government stepping in against the big tech cartel, unless Trump somehow pulls something out of his ass, which he's running out of time to do and has given no real indication of doing. We're moving onto information guerilla warfare, I suppose.",
				"added": 1610263592
			}
		],
		"1609818090_16GjpPqXFJ8Vv9bXgBPCNswucvtTeDU4C5": [
			{
				"comment_id": 14,
				"body": "hello",
				"added": 1610287220
			}
		]
	},
	"comment_vote": {
		"4_18Ag7V81FS6MBiGvgzT3uxRoFJaEoFc9tr": 1,
		"1_1KkgEcvzK3mbVZGBTFLgkwy7WDjdfVSURj": 1,
		"6_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"2_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp": 1,
		"5_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp": 1,
		"6_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"4_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"56_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"2_1AeFu4C63ou5WLJuMboxp9Ni2z45eT5XmN": 1,
		"3_1AeFu4C63ou5WLJuMboxp9Ni2z45eT5XmN": 1,
		"1242_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"12_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"2_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"32_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"1_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"15_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1
	}
}