{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": 1,
		"1620343496_1P1rwS5wiQ32NDHRPFLjFLJMZZaa2sLGKA": 1,
		"1620449256_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1621568781_1PSeiYvqdseW3aoqEV5gddDRr7gCHSJPHB": 1,
		"1621555984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 1,
				"body": "I'm from UK and in the same boat. Looks like I will need one to continue working but I am dead set against it. A lot of tough choices to be made. If I see anything like what you are looking for when I am searching I will be sure to let you know friend. I hope more people start using zeronet now as censorship on normal web is at unbelievable levels lately.",
				"added": 1620701673
			},
			{
				"comment_id": 11,
				"body": "> [bigchungus](#comment_2_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2): i see you and people like you as part of the solution - let the herd cull itself.  [...]\n\nI have spent the last year trying to convince those around me not to believe the government hype, but one by one the all got the vaxx. I am now of the opinion also that this is a self correcting problem. \nSomeone dies within 28 days of a positive covid test and they died of Covid no matter the other circumstances (some I can remember are gunshots and motorcycle accidents ffs). If you die with a vaxx needle in your arm then it is just a coincidence??? Now people have started dying of the vaxx all of a sudden the way that the figures get counted changes. Surely you vaxxers can see the creation of a trillion dollar industry whilst sticking to the eugenics doctrine of old.",
				"added": 1620959307
			}
		],
		"1620449256_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "<p align=justify>Today I learned how to justify paragraphs on my zeronet zite, not that this comment will be long enough to show this off lol</p>",
				"added": 1620701856
			},
			{
				"comment_id": 7,
				"body": "> [deuxzaron](#comment_145_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): But can you justify posting it?\n\nVote that one up, did actually put a smile on my face. Thankyou.",
				"added": 1620711113
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 3,
				"body": "Today I found out the highest law of the land in the United Kingdom is Talmudic law. No real surprise there but I was shocked to see it mentioned on Youtube.\n\n[The Occult Art of Law](https://www.youtube.com/watch?v=xvUzrC6x-bw)",
				"added": 1620702471
			},
			{
				"comment_id": 6,
				"body": "Getting asked to choose between 2 evils hehe. I really don't fancy Sharia law and seen as I already live under Talmudic law, well. Don't make me say it lol. \nI am a strong advocate of no victim... no crime.",
				"added": 1620711017
			}
		],
		"1620446786_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Was this comment made for the guy that made the fake covid app??? If so this is my new username. Didn't know what I was doing at first but now figured out how to sign sites over to my new username. If this message wasn't meant for me then sorry, but i think i remember your username from a few days ago.",
				"added": 1620703795
			},
			{
				"comment_id": 5,
				"body": "> [stoke](#comment_4_139GxzZpmsFVAWStAGMgwWwgpSKC3qkAAG): Was this comment made for the guy that made the fake covid app??? If so this is my new username. Didn't know what I was doing at first but now figured out how to sign sites over to my new username. If this message wasn't meant for me then sorry, but i think i remember your username from a few days ago.\n\nMy old username: 1ax4equbfsxvswy2",
				"added": 1620704271
			}
		],
		"1620343496_1P1rwS5wiQ32NDHRPFLjFLJMZZaa2sLGKA": [
			{
				"comment_id": 8,
				"body": "This is my new ID.\n@styromaniac I will be sure and check that out, thanks. Still getting used to it around here but liking most of what I see.",
				"added": 1620711334
			},
			{
				"comment_id": 9,
				"body": "UPDATE: I forgot to add to the description above that to enter full-screen you just tap the \"Cancel this check-in\" button after you have entered the venue name.\n\n;D thanks styromaniac for bringing this to my attention.",
				"added": 1620711530
			}
		],
		"1620567834_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 10,
				"body": "> [scotcyguy2](#comment_90_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): ARRR\n\nARRR is what I am using as my longterm holdings, as well as WOW and XMR. Secrecy is the future once BTC starts getting taxed.",
				"added": 1620913690
			}
		]
	},
	"comment_vote": {
		"145_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"9_139GxzZpmsFVAWStAGMgwWwgpSKC3qkAAG": 1,
		"90_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"7_139GxzZpmsFVAWStAGMgwWwgpSKC3qkAAG": 1,
		"2_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2": 1,
		"35_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": 1,
		"8_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP": 1,
		"2_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"7_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP": 1,
		"5_1N5YTyNeraRGksf76WNQiJ3ZB2ZMMa4pnf": 1,
		"4_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1
	}
}