{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Данные с камер распознования лиц в Москве продаются на чёрном рынке",
			"body": "https://invidio.us/watch?v=gbxqjrPqKJA (open-source frontend of youtube)\nhttps://www.youtube.com/watch?v=gbxqjrPqKJA",
			"added": 1575744843
		}
	],
	"topic_vote": {
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"1_1EzNhcaq8eqsamfqobDECK6cEV52k5hF54": 1,
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1
	},
	"next_comment_id": 5,
	"comment": {
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 1,
				"body": "https://yggdrasil-network.github.io/\nЧто делать? Способствовать развитию mesh-сетей, делиться информацией, популяризировать их, чем больше народу в Mesh - тем лучше. Самая песпективная сейчас технология это yggdrasil, и там уже более 700 узлов (кстати zeronet поддерживает его, чтобы включить его, нужно в конфиге fileserver ip поставить на ip из yggdrasil, и тогда можно будет обмениваться трафиком в ZeroNet через yggdrasil)\nТакже рассказывать об RetroShare, i2p, ZeroNet, IPFS и др.",
				"added": 1575069031
			},
			{
				"comment_id": 2,
				"body": "> [if0](#comment_269_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): И кто же, позвольте узнать, этот загадочный \"определитель перспективности сетевых технологий\"? лол\n\nХорошо, я неправильно выразился, Вы меня немного не так поняли. Это самая популярная, наиболее развитая, лёгкая для установки, по сравнению с другими, mesh-сеть. Этим я и определил её перспективность, и именно по сравнению с другими технологиями mesh-сетей, а не сетевых технологий в целом.\nЯ предлагаю mesh-сети именно из-за их способности пробиться через изоляцию к внешнему миру и сложного регулирования со стороны властей (в плане блокировки контента)",
				"added": 1575313031
			}
		],
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": [
			{
				"comment_id": 3,
				"body": "Если кто-то не может нормально скачивать/раздавать, то советую воспользоваться VPN. Провайдер может блокировать zeronet-трекеры и порты",
				"added": 1575753105
			},
			{
				"comment_id": 4,
				"body": "> [lukashenko](#comment_11_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m): Ахахах, просто взял и удалил контент. И где хваленая распределённость зиронета? всё один фейк. И из телеграма удалил весь контент своих аудиокниг, так что не надо говорить, что проблема чисто техническая\n\nстало понятно, что проблема чисто техническая. зайт снова работает",
				"added": 1578357245
			}
		]
	},
	"comment_vote": {
		"74_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"76_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"2_12ytyx8zmYMn58UavemioxPnMwaDNND3Ww": 1,
		"3_12ytyx8zmYMn58UavemioxPnMwaDNND3Ww": 1,
		"81_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"80_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1
	}
}