{
	"title": "Sargantaneta's Blog",
	"description": "Un pequeño lugar donde compartir",
	"links": "*   [Source code](https://github.com/HelloZeroNet)\n*   [About Me](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/19RpRPxZRcw6AvSLb4RuxqP5zgLjAzWC56/sargantaneta@zeroid.bit)\n*   [My Repo](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?1CrYUTetMBRFAonJ7cJEryz3zMiWravUyd)\n\n",
	"next_post_id": 4,
	"demo": false,
	"modified": 1567067351,
	"post": [
		{
			"post_id": 3,
			"title": "Ramsonware dirigido a NAS",
			"date_published": 1567064207,
			"body": "![threat_icon.png (445x356)](data/img/post_3_threat_icon.png)\n\nDesde la aparición de los Ramsonware (Chriptolocker, wanacry y sus diferentes variaciones) por el año 2013, hemos ido viendo una sucesión de software cada vez más elaborado que imitaba el comportamiento y nos obligaba a pagar un rescate por recuperar la información.\n\nCon el tiempo, aparecieron algunos troyanos/gusanos que aprovechándose de vulnerabilidades de los sistemas operativos (tanto windows como linux o macos) se usaban de \"downloader\" para instalar diferentes ramsonwares.\n\nDe hecho las últimas versiones que afectaban directamente a linux, explotaban vulnerabilidades de apache server o ssh para conseguir ejecutar código y \"colar el ramsonware\".\n\nAnte todo este despliegue, una de las grandes apuestas de las empresas han sido las copias de seguridad, muy efectivas para las grandes empresas con recursos, pero que ahora se han quedado cojas en el entorno doméstico y de las pequeñas empresas. La razón es que una empresa con pocos recursos suele recurrir a sistemas de NAS como QNAP, Synology o Terra Master que son muy asequibles y permiten gestionar las copias de seguridad.\n\nEsto, evidentemente, no ha pasado desapercibido a los hackers y han modificado los gusanos para atacar estos aparatos.\n\nPor ejemplo, podemos encontrar **eCh0raix** diseñado para atacar los NAS de QNAP por fuerza bruta (probablemente una de las maneras más ineficientes de ataque) pero que parece haber sido tristemente útil. [Más info ...](https://www.redeszone.net/2019/07/11/ech0raix-ransomware-nas/)\n\nLos modelos afectados son:\n\n*   QNAP TS-251\n*   QNAP TS-451\n*   QNAP TS-459 Pro II\n*   QNAP TS 253B\n\n**Synolocker**, por ejemplo, apareció a mediados de 2014 y era capaz de cerrar el acceso por SSH y web al NAS exigiendo una recompensa por recuperar los datos. A diferencia de otros, no encripta los datos si no que los codifica siguiendo una serie de algoritmos matemáticos, por lo que se pueden recuperar aplicando ingeniería inversa. Synolocker si explotaba una vulnerabilidad del firmware para acceder al sistema, lo que lo hace bastante más peligroso. A día de hoy, sigue estando activo y se ha detectado alguna variación reciente pero que sigue explotando la misma vulnerabilidad, por lo que actualizando el firmware, debería evitarse el problema. [Más info ...](https://www.knowbe4.com/synolocker)\n\nHay que tener en cuenta que estos no serán los únicos casos y con el tiempo vamos a ir viendo aparecer más ramsonware similares, enfocados a dispositivos y/o marcas concretos, de la misma manera que aparecerán tarde o temprano para dispositivos móviles. Esta es quizás una baza muy lucrativa que apenas se ha explotado."
		},
		{
			"post_id": 2,
			"title": "Un paso adelante del enemigo",
			"date_published": 1567056300,
			"body": "![ereresad.png (274x388)](data/img/post_2_ereresad.png)\n\nLibro manual, un paso adelante del enemigo\nCultura seguridad hacktivista y consejos\n\n[Click aquí para descargar](http://127.0.0.1:43110/18AdqXKgfC3gnxPQ2KjbCFTKCkZHmc1bAk/downloads/unpasoadelante.pdf)"
		},
		{
			"post_id": 1,
			"title": "Cyber Guerrilla",
			"date_published": 1566925200,
			"body": "## ![28407284.jpg (317x391)](data/img/post_1_28407284.jpg)\n\nLibro sobre Hacktivismo.\n​​​​​​​[Click aquí para descargar](http://127.0.0.1:43110/18AdqXKgfC3gnxPQ2KjbCFTKCkZHmc1bAk/downloads/CyberGuerilla.pdf)"
		}
	]
}