{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1558542225,
			"title": "I2P+",
			"body": "I2P, enhanced",
			"added": 1558542224
		},
		{
			"topic_id": 1565230737,
			"title": "Orchid+ plugin for I2P & I2P+",
			"body": "Now available, an updated Orchid Tor client plugin for I2P and I2P+, featuring a extensive overhaul of the front end. To download, add the following hash to I2PSnark: 4D7E45B5C3CEC159898098FE5C9F1B7EF26D6582\nNote: You will need to uninstall the existing Orchid plugin if present, and copy the .crt file included with the torrent to i2p/certificates/plugins before installation.\nThe patches have been submitted upstream, and may be available in a new official Orchid version before the release of I2P 0.9.42.\nWork in progress screenshot: http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/Orchid.png or http://skank.i2p/static/Orchid.png",
			"added": 1565230735
		}
	],
	"topic_vote": {
		"1565230737_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1558542225_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": [
			{
				"comment_id": 1,
				"body": "Announcing I2P+, an enhanced version of I2P with greater emphasis on usability and presentation.\nMore information: http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/ or http://skank.i2p/static/i2p+.html\n\nChangelog:  http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/changelog.txt",
				"added": 1558542579
			},
			{
				"comment_id": 2,
				"body": "Not a beta, no. I2P+ has been available for over a year now. No less stable than upstream I2P, and more often than not, better performing on the network!",
				"added": 1558571090
			},
			{
				"comment_id": 3,
				"body": "If your browser is indicating that the proxy is refusing connections, and you have configured the browser to use I2P's HTTP proxy on 127.0.0.1 port 4444, check that the HTTP Proxy is indicated as running on the router console sidebar.. there should be a green star displayed. It usually takes a minute or 2 after the router starts for the http proxy to become available.",
				"added": 1558827459
			}
		],
		"1565230737_1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN": [
			{
				"comment_id": 5,
				"body": "> [qspitzer](#comment_43_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): I'm a bit confused with what this plugin does. Does it route all i2p traffic through Tor?\n\nThe plugin serves as an alternative outproxy option for http and socks client tunnels, enabling all non-I2P traffic to route over Tor. It also provides a socks port on 9250, enabling any application with socks support to route traffic over Tor via the plugin. Internal I2P traffic isn't affected by the plugin.\nTo enable the plugin for outproxy use, tick the box marked \"use plugin instead of listed proxies if available\" in your http (or socks if configured) client tunnel settings in the tunnel manager.",
				"added": 1565298770
			},
			{
				"comment_id": 6,
				"body": "If you've installed the Orchid+ plugin, the changes have now landed upstream, so it's recommended to uninstall the Orchid+ version and then install from http://stats.i2p/i2p/plugins/\nNote that you'll need to create a SOCKS client tunnel in the Tunnel Manager and enable the outproxy plugin option if you wish to continue using Orchid as a SOCKS proxy.",
				"added": 1566400611
			}
		],
		"1569646825_13XX2EM4osC54ANFPGGgzXdWjD4zm5PNmH": [
			{
				"comment_id": 7,
				"body": "In brief, you need to create an HTTP or Standard server tunnel and use something like Privoxy or Squid on the backend to handle the traffic.",
				"added": 1569702755
			}
		],
		"1571610384_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 8,
				"body": "From the I2P+ help section:\n\nIn order to access websites hosted on I2P, and optionally use the default outproxy to connect to websites on clearnet, you will need to configure your browser to use the I2P HTTP proxy, by default running on 127.0.0.1 port 4444. Most browsers offer an option to configure your proxy; in this mini-tutorial we'll focus on Firefox.\n\n    1. Open the Preferences page in Firefox and scroll to the bottom of the General section.\n    2. In the Network Settings sub-section, hit the Settings button.\n    3. Under Configure Proxy Access to Internet select the Manual proxy configuration option.\n    4. Enter 127.0.0.1 in the HTTP Proxy field, and 4444 in the Port field.\n    5. Tick the box marked Use this proxy server for all protocols to avoid requests escaping the proxy.\n    6. In the box marked No Proxy for add the line 127.0.0.1,localhost to ensure the I2P console and other locally hosted websites are still available.\n    7. Tick the box market Proxy DNS when using SOCKS v5 to prevent DNS leaks.\n    8. Hit the OK button and test the proxy is working by visiting planet.i2p and www.myip.com. \n\nNote: To enhance your security when browsing .i2p sites, you may wish to consider installing an addon to prevent Javascript from running in the browser such as NoScript, though it's recommended to whitelist the address I2P+ is running on to enable various router console enhancements. In addition, an addon that prevents requests to offsite resources is also recommended, for example uMatrix.\n\nFor a more extensive guide to configuration for various browsers, see: https://geti2p.net/en/about/browser-config\n--\nI2P+ | http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/ | http://skank.i2p/static/i2p+.html",
				"added": 1571757698
			},
			{
				"comment_id": 9,
				"body": "> [cactusdragon](#comment_60_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): Too find more peers, to be better integrated into the network. I can't even load the tincan 3 times without being banned for downloading to much?! (Then you have to try it 30 minutes later)I2P is just too damn slow\n\nI2P+ is coded specifically to address the integration problem. It's quicker to find new peers, and has a lower churn rate for known peers, making the network more responsive, especially for routers that are behind a firewall or not running 24/7. There are additionally documented  configuration options to increase the rate of new peer acquisition.\n\nRegarding being blocked on websites, unfortunately the default throttling for the webserver tunnel is far too restrictive and can often result in temporary bans. To mitigate the issue, be sure to only load one page at a time and wait at least 30 seconds between page requests. And where there are contact details for the web admin, tell him he needs to dial down the tunnel throttling!\n--\nI2P+ | http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/ | http://skank.i2p/static/i2p+.html",
				"added": 1571760903
			},
			{
				"comment_id": 10,
				"body": "You'll often find that a website won't load on first attempt.. it may take several attempts to successfully load the site, assuming it's up. That's why I2P+ has an automatic retry mechanism which results in a much more fluid experience; you attempt to visit a site, and if it doesn't load on first try, it will keep trying until it does or you close the page.\n\nThe other thing to mention is the Known peers count in the sidebar.. generally a good indication of your router's integration in the network. Over 2000 known peers normally gives you a much more responsive router. \n\nIf you want to verify that a site is actually up, http://identiguy.i2p/ and http://isitup.i2p/ are useful services.\n\nI2P+ | http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/ | http://skank.i2p/static/i2p+.html\n\n\n",
				"added": 1572368444
			},
			{
				"comment_id": 11,
				"body": "> [kusoneko](#comment_103_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): I had similar problems and uninstalled it, if your decentralized darknet is this unusable, it's not worth me supporting it with my PC.\nI recommend trying I2P+, which should make the network much more responsive and less frustrating, not least on account of automatic retry for unresponsive websites. A new installation will also pull a heavily trimmed addressbook subscription which minimizes dead sites.\nI2P+ | http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/ | http://skank.i2p/static/i2p+.html",
				"added": 1572656885
			}
		],
		"1587888954_1EsynzasFzW2SVpMKwWaxag5u2DXcL5W1Y": [
			{
				"comment_id": 12,
				"body": "Try I2P+ instead of i2pd if you're new to I2P! You'll find it much easier to configure, and it comes with a help section to kickstart your knowledge.\nZeronet: http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/\nI2P: http://skank.i2p/\nTor .onion: http://fhiqjkax7s6cs2shcozpnnq6v64txoovuczw62lpj4jfbiisrkzw5vid.onion/\nClearnet: https://i2pplus.com/",
				"added": 1588086849
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 13,
				"body": "> [nxm9c2wjbjlhjsrc](#comment_6_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt): Interestingly enough, I discovered ZeroNet through I2P, as there is an I2P -> ZeroNet bridge. [...]\n\nA couple of things.. firstly, I don't know which outproxy you're currently using, but purokishi.i2p, for the most part, routes traffic directly and mostly uses Tor for torrent sites. It also blocks ads, trackers, cryptomining sites, telemetry hosts and a whole lot more, almost 5 million blocked hosts!\n\nAs for modern design, perhaps you've yet to discover I2P+, which is cross-compatible with I2P (you can upgrade from either version to the other without losing settings etc), and provides alternative themes, additional features, and improved performance in most contexts.\n\nMore information: \n* Zeronet: http://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/\n* I2P: http://skank.i2p/\n* Tor: http://fhiqjkax7s6cs2shcozpnnq6v64txoovuczw62lpj4jfbiisrkzw5vid.onion/\n* Clearnet: https://i2pplus.com/",
				"added": 1607520739
			}
		],
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "Recent updates to I2P+ are targeting overall router performance including latency when loading .i2p sites and sites using the outproxy (purokishi.i2p). If you've found I2P to be less than stellar in terms of performance, you really should be looking at I2P+ to get a better idea of what the network's capable of! For the best possible experience \"out of the box\", it's recommended to use the full installer and ensure any existing i2p data/config directory is either moved or deleted. \n--\nhttp://skank.i2p/\nhttps://i2pplus.com/\nhttp://127.0.0.1:43110/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh/",
				"added": 1609629163
			},
			{
				"comment_id": 15,
				"body": "Note: The latest development build of the I2P+ update can now be downloaded from: https://gitlab.com/i2pplus/I2P.Plus/-/jobs/artifacts/master/raw/i2pupdate.zip?job=Java8 (this will always return the latest CI-built i2pupdate.zip)",
				"added": 1609652450
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_2838_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You guys working on an Android version of I2P+?\nNot currently, though one of the developers did manage to get native I2P+ running on his Samsung phone. The Android port uses a different codebase, so it would be a ton of work to port I2P+. If there's a developer out there that likes a challenge...",
				"added": 1609898697
			}
		]
	},
	"comment_vote": {}
}