{
	"next_post_id": 7,
	"next_comment_id": 2,
	"next_follow_id": 1,
	"avatar": "png",
	"user_name": "Minnow",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "TweetMe User",
	"post": [
		{
			"post_id": 1,
			"date_added": 1541040755,
			"body": "Yo Yo TweetMe! I'm here !"
		},
		{
			"post_id": 1541041073,
			"body": "https://www.dash.org/",
			"date_added": 1541041071,
			"meta": "{\"img\":\"900,264,fffeff9ce8cebdecdf6bedef7ceade,012345567007323882900074944710\"}"
		},
		{
			"post_id": 1541388143,
			"body": "Dash - Digital Cash - Ad highlighting use as a method of remittance. http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1540349162_1cUu3PvBbSyaegjuUo5yQry7AWdaSTrPD",
			"date_added": 1541388140
		},
		{
			"post_id": 1541715149,
			"body": "#The future of Crypto: Breaking new ground in emerging markets\n\nDash is breaking new ground in terms of widespread cryptocurrency adoption by providing unbanked and underbanked people with more financial options and better economic solutions. In this talk, Dash Core Group CEO Ryan Taylor explores some of the unique challenges of money systems with Anne Gaviola around the world and explains how cryptocurrencies can lubricate commerce and facilitate daily transactions.\n\nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1541715066_1cUu3PvBbSyaegjuUo5yQry7AWdaSTrPD",
			"date_added": 1541715145,
			"meta": "{\"img\":\"900,506,88999bbbdccdaabbab666cde989789334445667567223556,01223014545226577325523881411042906ABBBA10ACDEABBA1CEDFEAFBA\"}"
		},
		{
			"post_id": 1541799077,
			"body": "#Analysts: Crypto Set to Take Off, But Not Because of Bitcoin\n*Posted by Justin Szilard | Nov 9, 2018*\n\nCryptocurrency has been caught in a bear market for a few months, but many [predict](https://www.independent.co.uk/life-style/gadgets-and-tech/news/bitcoin-cryptocurrency-market-price-prediction-2018-latest-ethereum-stellar-a8624266.html) adoption and price appreciation to soon take off due to a multitude of reason.\n\nRecently, Patrick Byrne, CEO of Overstock and cryptocurrency advocate, was [interviewed](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1541797210_1cUu3PvBbSyaegjuUo5yQry7AWdaSTrPD) by Naomi Brockwell at Porcfest to discuss Bitcoin and it’s future growth.\n\n>“When people start getting into it Bitcoin, is when their own financial systems collapses. Whether bitcoin is the one, whether bitcoin has solved its speed problem, or it’s another cryptocurrency, only time will tell.”\n\nMild confidence is seen in the sector by 10 analysts for November’s Finder Cryptocurrency Predictions Survey, which concluded that Bitcoin “will experience steady growth over the next year, though the upcoming months remain uncertain”. Uncertainty is added when different experts are consulted about different coins, such as Blockchain CEO Peter Smith speaking highly of Stellar, while technology expert Ian McLeod of Thomas Crown Art said Ethereum is close to a “monumental, defining global breakout”.\n\nSome major upcoming factors include the SEC’s (US Securities Exchange Commission) ruling on another potential Bitcoin ETF along with the CFTC (US Commodities and Futures Trading Commission) decision on whether or not to accept ICE-backed cryptocurrency exchange, Bakkt. Both decisions are expected before December 1st of this year and could have potentially big impacts on the cryptocurrency market.\n\n###Diversity in the cryptocurrency space\n\nAccording to [coinmarketcap](https://coinmarketcap.com/) there are currently over 2,000 coins across more than 15,700 markets, which illustrates a very diverse ecosystem. However, a previous [report](https://www.dashforcenews.com/report-decentralized-cryptocurrencies-losing-market-share-to-centralized-cryptoassets/) by CryptoCompare did a detailed taxonomy of the sector and discovered that decentralized cryptocurrencies are losing market share to centralized coins. Bitcoin was originally founded to be a decentralized, peer-to-peer, digital currency to improve the lives of individuals suffering from the structure of the current monetary and financial system. Other coins soon started to emerge and issuance rapidly increased in the last couple years. Each coin is attempting to bring their own unique solutions to the table, but while some are trying to improve upon Bitcoin, others are simply security or utility tokens through ICOs.\n\nEconomic theory says that increased competition will provide better products and services for consumers. This became necessary when Bitcoin’s fees and confirmation times increased relatively dramatically last year and the solution still has not been completely solved. This leaves room for other coins to gain adoption, especially since Bitcoin’s market share has [decreased](https://coinmarketcap.com/charts/#dominance-percentage) from over 80% in early 2017 to just above 50%, currently. Thus, the cryptocurrencies that stand the best chance of adoption, based on economic theories, are the ones that provide the best combination of services for consumers in terms of technology, ease of use, understanding, stability, reliability, privacy, speed, usability, overall awareness, confidence, and more.\n\n###Dash focuses on the consumer\n\nDash has grown significantly from its creation in 2014 to now serving consumers at over 4,000 [merchants](https://www.dashforcenews.com/dash-passes-4000-merchants-hashrate-reaches-new-high-as-us-debt-balloons/), worldwide, with speed, savings, and security. Dash has achieved this success in such a short period of time thanks to its focus on consumer user experience and user interface so consumers not only have sound money, but also sound money that is easy to use and understand. Ryan Taylor, CEO of Dash Core Group, recently discussed this in a [talk at Web Summit](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1541715066_1cUu3PvBbSyaegjuUo5yQry7AWdaSTrPD).\n\nRyan touched on how over 2,200 Dash-accepting merchants are currently in Venezuela, which is growing around a rate of 200 merchants a week. He also mentioned Dash’s partnership with [Kripto Mobile](https://www.dashforcenews.com/dash-partners-with-kripto-mobile-to-launch-phones-pre-loaded-with-dash-entire-dash-ecosystem/) to launch a new line of cryptocurrency-enabled mobile phones in Venezuela. Ryan added how the problems that Venezuelans are facing go beyond direct hyperinflation, such as POS systems running out screen space to display zeros, families spending all their cash during a dinner night out, banks withholding cash, and more. Ryan highlighted how Dash is leading the market in these developing nations because Dash “has a great product, because it works at the point-of-sale, and it’s instant”.\n\n>“When you solve actual, practical uses for people and make their lives better in some way, that’s when they will change behavior and adopt something new”.\n\nOf the many cryptocurrencies that exist today, Dash has a favorable probability of seeing greater adoption because it has already demonstrated its value proposition, is seeing adoption, and is constantly [improving](https://www.dashforcenews.com/dash-core-group-renames-upcoming-versions-to-properly-reflect-major-updates/) on its [features](https://www.dashforcenews.com/dash-plans-major-privacy-overhaul-in-upcoming-12-4-update/). As adoption and demand increases, exchange price will follow based on economic laws.\n\n...\n\n###About The Author\n\n**Justin Szilard** is a writer with a formal background in economics and research from the London School of Economics. He is a fan of cryptocurrency, the potential it holds to help bring about a better economy and society.",
			"date_added": 1541799072,
			"meta": "{\"img\":\"900,529,0120130250240370480360470590ac079058035,000112310000312456100027899A30022B888C1001C32431100122222210\"}"
		},
		{
			"post_id": 1544843816,
			"body": "Dash Podcast 82 - Feat. Ryan Taylor Dash Core Group CEO\n\nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1544843472_1cUu3PvBbSyaegjuUo5yQry7AWdaSTrPD",
			"date_added": 1544843810,
			"meta": "{\"img\":\"900,505,29d39dfffddd888ccc18daaa9996666bd5adbbb555333222,01111234526606023772660602388266660258970AAABCDEFE661119FFFF\"}"
		}
	],
	"post_like": {
		"1AtZRXEYqPxrprXiSK9Ncd4cSfFACFZWvL_1541013347": 1541125916,
		"1cUu3PvBbSyaegjuUo5yQry7AWdaSTrPD_1": 1541391287,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1544633485": 1545014472
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@leftside: Perhaps something like Second Life ( https://secondlife.com ) ? Not quite my interest, and it's hard to call it a game, but it is very open in what you can do and design.",
			"post_uri": "17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH_1541760728",
			"date_added": 1541788189
		}
	],
	"follow": []
}