{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1550934783,
			"title": "News (Beta test.)",
			"body": "http://127.0.0.1:43110/1DUcHcUT6g8XTyewfXtiX2pCFPcTrYt5bg/\nA News beta test site.",
			"added": 1550934782
		},
		{
			"topic_id": 1552168853,
			"title": "Over 400 Links Google Doesn’t Want You To Visit",
			"body": "https://thomasdishaw.com/bookmark-this-over-400-links-google-doesnt-want-you-to-visit/",
			"added": 1552168851
		},
		{
			"topic_id": 1557151578,
			"title": "News",
			"body": "http://127.0.0.1:43110/1DUcHcUT6g8XTyewfXtiX2pCFPcTrYt5bg/",
			"added": 1557151575
		}
	],
	"topic_vote": {
		"1558255412_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": 1
	},
	"next_comment_id": 47,
	"comment": {
		"1_1FbLtVVGfpLXGi2cZZN4U3RD2C9X5Arof": [
			{
				"comment_id": 1,
				"body": "Site is not loading.. We are doomed to an un-encrypted web!!! Jesus Save Us!!!",
				"added": 1543530930
			}
		],
		"1_1NnLEbZgqNo9QfGuopF2Co7Dy152rp3Pim": [
			{
				"comment_id": 2,
				"body": "Cool a LibTard Masturbation site!\nCant get enough Trump!",
				"added": 1543531067
			},
			{
				"comment_id": 23,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You need to stop making your username the same as your password. Its very insecure.",
				"added": 1556741955
			},
			{
				"comment_id": 24,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_2_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Apparently your understanding of a joke is about as good as your understanding of Hitler.",
				"added": 1556746195
			},
			{
				"comment_id": 28,
				"body": "Hitler was totally insane. The only thing that I want to know about is where his body is buried in south America. I guess we cant find that one out since the CIA is still protecting that secret because of the money trail that is still being used right now to overthrow the United States. The southern poverty law center comes to mind.",
				"added": 1557022168
			}
		],
		"1544035176_1GtwWtJ66M2wm3raW2ZvUByneLefcsscBf": [
			{
				"comment_id": 3,
				"body": "> [medow](#comment_1_14XR9KNwgJhCv1RiuqKxjBDkCRETjT9R3v): How much it cost?\n\nOnly .99 cents.  They are from China.",
				"added": 1550921484
			}
		],
		"1550871167_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": [
			{
				"comment_id": 4,
				"body": "> [mg0](#comment_1_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): This is a mirror of www.rexresearch.com which contains a huge lot of info about alternative energy, medicine and other fields of knowledge. Many invention patents and discussions are stored on the site. This is my first zite and I'll be trying to make it up-to-date periodically. Also, I'd appreciation opinions on how to handle the big size of the site in an approach fit for zeronet. [...]\n\nIt wont load. Says it has 2 peers and then times out. You need to leave Zeronet running to get the info on to other sites. This isn't the regular internet. This is torrent based. And if you alredy knew this I just wasted my time writing this.",
				"added": 1550921988
			},
			{
				"comment_id": 5,
				"body": "> [mg0](#comment_3_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Yeah, I already knew that. Thing is I was trying to set it up and running on a raspberry pi before going home but it was becoming slower and slower so I thought the site was just too big or not properly set as a Zite yet. Sorry for not commenting on that at time. Are there some resources about how to deal with such a big site? [...]\n\nYou can shrink it down further. I am not an expert at this. I am basing my information from what I have seen other sites do. The pyrotechnics site is very large (700mb) and it does allot.",
				"added": 1550934321
			},
			{
				"comment_id": 6,
				"body": "> [mg0](#comment_4_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I'll be tweaking with the zite to make it hopefully more snappy. quantumworld: I saw the pyro site and it works pretty well while being big, this one has still two orders of magnitude more files :/\n\nI just got your site to load. Looks good. You are missing a couple of pdf link's. Looks good for an exact mirror of the original site. Make sure you post it on the search engines. The information looks interesting as well. And if it is accurate info some one will try to take it down. Its a good idea to mirror a site like.",
				"added": 1550939387
			},
			{
				"comment_id": 7,
				"body": "I wish who ever created that site could organize it better. But making a backup on zeronet is a dam good idea. I have had a bunch of sites taken down. CNN has actually gone around the web and censoring sites by any means necessary. They think they are the moral authority on all information.",
				"added": 1551172936
			},
			{
				"comment_id": 8,
				"body": "Are you mirroring that site all the time? Or did you do a snapshot then re-code it. I just noticed that the site you are mirroring is different from the one on Zeronet.",
				"added": 1551485160
			},
			{
				"comment_id": 9,
				"body": "> [mg0](#comment_17_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa):  I just have to apply all the dark magic I did to get it ready for zeronet. [...]\n\nYou can use wget. That will auto convert files and it will mirror all of them. It works fairly well. There may be a better  out there.\n\nhttps://www.computerhope.com/unix/wget.htm",
				"added": 1551486659
			},
			{
				"comment_id": 10,
				"body": "> [mg0](#comment_18_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa):\n\nYou currently have 22 peers listed on my end. I am one of them. I have some down time from zeronet within the next 40 hours. You must have access to the server side of that site. I ran across a full download and mirror program that worked perfectly. I do not remember the name of it. It was a gui program, and a really odd name.",
				"added": 1551487800
			},
			{
				"comment_id": 11,
				"body": "> [mg0](#comment_19_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): If you made a mirror of the rexresearch.com then I'd like to know the file count and the total size of the site for comparison purposes. Also, as of now I'm seeing '42' peers for the site. Great! [...]\n\nThe updates of your site is automatic when you change it. All the modified files will be compared with your user login key and will be updated. You should not need to manually update it.",
				"added": 1551556862
			},
			{
				"comment_id": 12,
				"body": "There has to be a way you can directly mirror that site with a script file. Wget used to be really good.",
				"added": 1551926354
			},
			{
				"comment_id": 13,
				"body": "Update worked fine. I got it when I turned on Zeronet. I have been down from Zeronet doing system upgrades.",
				"added": 1552160835
			},
			{
				"comment_id": 14,
				"body": "I am impressed with Zeronets responsiveness to updates. I am not impressed with the amount of users using Zeronet. Its just not enough and something needs to be done about this. And the current user base seems uninterested in marketing Zeronet on the open web. That is the only down side to Zeronet.",
				"added": 1552166372
			},
			{
				"comment_id": 15,
				"body": "> [mg0](#comment_26_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): There's an ugly lot of people that may have what it takes to use and improve zeronet out on the wild, but as a darknet we have the short end of the stick: [...]\n\nThis is how I look at it. I don't care what you are into. Its free speech. End of argument. I believe in the U.S. constitution. Share what you want to share with others. I may not like it but its free speech. Freenode is about what the individual user wants to share with others.  That is what makes this place special from any other platform on the web that I have seen. People need to grow up and stop relying on some one else to censor what content they should view or not view. People have the block and ban option. Use it as you see fit. And I have no issues with anything being published. Call it modern day digital free press. If people don't value what the structure of Zeronet actually is as humanity they just don't get the design of it.  (I do have issues wit people who never post anything!) (You SILENT BASTARDS!!!!)  (Note: Some sarcasm was used in this comment.) (Reader Discretion is advised.)",
				"added": 1552168791
			},
			{
				"comment_id": 16,
				"body": "I am 100% Free Speech. And Zeronet.io is the best place for it. I love the News I get from China and other countries that you would never get anywhere else. Zeronet will pop one day and it will be bigger than Facebook when it takes off.",
				"added": 1552170337
			},
			{
				"comment_id": 26,
				"body": "I have noticed that there are allot of links that are not being seeded. Maybe you are off line.",
				"added": 1557012136
			},
			{
				"comment_id": 35,
				"body": "[mg0](#comment_1094_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): It should be the same problem on your end. Just go on zeronet and click your seeded site from zeronet. From the main page it will drop out at about 2 or 3 levels down. It could be the original site has bad links or that your mirror does. I have zites that are far more complex than yours and larger that all sync up just fine.",
				"added": 1557107653
			},
			{
				"comment_id": 36,
				"body": "mg0: It is the same update. This link is dead from the main page link.  \nhttp://127.0.0.1:43110/1D6QfsBSZHmYWbuCxKG5ya31BiTczoZiES/cannabis/cannabis.html",
				"added": 1557110069
			},
			{
				"comment_id": 37,
				"body": "mg0: Hopefully it can be fixed. That site needs to be put in an iso image file. It would save space. However bad idea for slow computers or low bandwidth connections. For local storage it may be a good idea for archiving.",
				"added": 1557110960
			},
			{
				"comment_id": 39,
				"body": "> [ssdifnskdjfnsdjk](#comment_62_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): It works for me and also for my proxy which is located in different country.\n\nStrange your link works fine. This one is not on my end. http://127.0.0.1:43110/1D6QfsBSZHmYWbuCxKG5ya31BiTczoZiES/cannabis/cannabis.html",
				"added": 1557169825
			},
			{
				"comment_id": 40,
				"body": "mg0: It is up to date. No change.  Odd..",
				"added": 1557173462
			},
			{
				"comment_id": 41,
				"body": "I just deleted the site and tried to re-download it and I am getting jason errors.",
				"added": 1557174426
			}
		],
		"1554690949_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": [
			{
				"comment_id": 17,
				"body": "That entire site needs to be put on an emacs org file. Or several ones. I don't know if any of that stuff works or not but it needs to be tested.",
				"added": 1555123325
			},
			{
				"comment_id": 19,
				"body": "> [mg0](#comment_1085_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I'm not versed on emacs so I can't really help.\n\nIt is insanely easy.  Just make it all a text file and change the .txt to .org and you are done. You have now created an org file for Emacs.  Org is the only reason I use Emacs. \n\nBtw: Emacs is not a text editor its an operating system posing off as a text editor. Silly puddy is the best way to describe Emacs. \n\nhttps://orgmode.org/",
				"added": 1555215502
			},
			{
				"comment_id": 20,
				"body": "Emacs org mode will separate the data when reading the file. It would be clunky but it will work. I bet Emacs can dump the entire site into a text file. lol",
				"added": 1555253435
			},
			{
				"comment_id": 21,
				"body": " mg0 I can do it since I have your site in some insane number file folder. That file will be huge. This is where vi kicks Emacs ass with large files. However Emacs is not a text editor its an O.S. that uses text and says it is text editor. Emacs is an enigma of code. It can be what you want it to be while in use. With lisp I should be able to easily separate things out fairly easily.",
				"added": 1555254228
			},
			{
				"comment_id": 22,
				"body": "> [mg0](#comment_1090_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): If you need a quick way for finding all the files [...]\n\nThanks.  I love the fact you are mirroring that site. I think that there is some valuable things that they have been researching. And it is worth an archive of it. We need more mirror sites on Zeronet. This censorship is out of control.\nNow all we need are more users using Zeronet.",
				"added": 1555296335
			}
		],
		"1552168853_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 18,
				"body": "Update Link\nhttps://thomasdishaw.com/bookmark-400-links-google-doesnt-want-visit/",
				"added": 1555124019
			}
		],
		"1557011853_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 25,
				"body": "No peers found..",
				"added": 1557011897
			},
			{
				"comment_id": 27,
				"body": "Fixed.  Would be nice to see that as a pdf file.",
				"added": 1557017889
			},
			{
				"comment_id": 29,
				"body": "To bad the site is a mining site\n.",
				"added": 1557065224
			}
		],
		"1541263546_1QCMg6ZqmUAFd1MGyc2g2j6NDep2GANfAC": [
			{
				"comment_id": 30,
				"body": "> [anonymouslogin](#comment_7_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): What reason do you have for believing in a deity? Do you have any evidence?\n\nMark Zukaberg",
				"added": 1557069917
			},
			{
				"comment_id": 31,
				"body": "The Creator or God is the worlds greatest comedian. Just look around you. And one day you will understand his mastery of comedy. And then you shall know the truth.",
				"added": 1557073044
			},
			{
				"comment_id": 32,
				"body": "h3bhkj5gqz4n3pjm Ok, technically we are in a living universe. And the creator wanted a good joke to tell the universe and he created earth, and humans. That's really all you need to know.. The rest of the stuff is just pointless bad jokes.",
				"added": 1557074956
			},
			{
				"comment_id": 42,
				"body": "It would be nice to see some New content on this site. People posting new content is what drives new traffic to your site. And if you lost your pw start a new one. And back up your Zeronet folder. Hard drives are cheap now days make one for just Zeronet if you want this platform to grow. And keep it running to build a better Zeronet.",
				"added": 1557255105
			},
			{
				"comment_id": 43,
				"body": "> [anonymouslogin](#comment_16_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Encrypt it too, you may not agree with censorship, but it is likely your government does.\n\nEncryption is a good idea. Just remember that on every storage device there is a bypass. If you want further information go look at the vault 7 leaks. If you know about computer science you will figure it out. The data spying is  BAD! Very Very BAD!",
				"added": 1557276400
			},
			{
				"comment_id": 44,
				"body": "> [anonymouslogin](#comment_17_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'll take a look. Data spying is power. Pure power, and access to nearly everyone on the planet. Likely people won't resist until they don't have enough food. By then it will be far too late to apply any remedy.\n\nWe have all been here before and it caused a major reset globally. I wont go into details because very few remember it. This spying at that level will cause the exact same thing to occur again. Many will not make it. The inventors of the technology will be heal accountable for there own creation like they were in the past. None of them are living. All accounts of what happened have been erased from memory. Only a very select few know, and it should scare the absolute shit out of them.",
				"added": 1557277067
			},
			{
				"comment_id": 46,
				"body": "It is all quantum physics. Its all in the numbers, usually and some times not.",
				"added": 1557620581
			}
		],
		"1557067454_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 33,
				"body": "> [robione](#comment_4_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): with an adblock blocker? ...really?\n\nLots of data goes somewhere when you click that link. Would love to learn more about why. And source code to what is causing all the traffic.",
				"added": 1557077667
			},
			{
				"comment_id": 34,
				"body": "> [robione](#comment_5_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): I deleted the site, but if you still have it, you have all the code on your machine.Take a peek\n\nI looked at it. And I blocked it/deleted it as well.",
				"added": 1557078327
			}
		],
		"1557078439_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 38,
				"body": "Data Mining site do not visit.",
				"added": 1557152029
			}
		],
		"1557395451_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 45,
				"body": "Welcome to Open Source P2P Websites. \nClone it, Fork it, And Move On.",
				"added": 1557424540
			}
		]
	},
	"comment_vote": {}
}