{
	"next_comment_id": 8,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [openuser](#comment_1_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): Sympa, merci pour cette découverte, je vais m'empresser de tester ça  ^_^\n> Ça me fait penser à Deepin OS, une des distributions Linux la plus \"user friendly\" que j'ai eu l'occasion de tester. ---> https://www.deepin.org/?language=en\n\nmerci pour ton commentaire, c'est effectivement une distribution intéressante, j'écrirais prochainement un article dessus =) .\n",
			"post_id": 3,
			"date_added": 1457988787
		},
		{
			"comment_id": 2,
			"body": "non ils ont voulu tout faire de zéro pour maîtriser l'expérience de bout en bout. Bien sûr ça a aussi des inconvénients dont notamment un nombre restreint de logiciels dans les dépôts pour le moment...",
			"post_id": 3,
			"date_added": 1458044346
		},
		{
			"comment_id": 3,
			"body": "> [nephos](#comment_1_15h7vjKVB8ZCV6vWwXjp8g5r6CXwJRjTG4): cinamon c'est ça ?\n> il a été traduit en francais ou pas ?\n\nBonjour, en fait c'est Budgie. Cinnamon est l'interface graphique de Linux Mint . Les deux sont disponibles en français (c'est la devise du blog : \"Tout en français\" ^^)",
			"post_id": 3,
			"date_added": 1458374104
		},
		{
			"comment_id": 4,
			"body": "> [openuser](#comment_2_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): Cool ton article :)Au fait, si tu fais un click droit sur la barre de lancement des apps, tu peux choisir entre:\"mode style = ressemble au doc de MacOS\" (Par défault)\"mode étendu = Ressemble à la barre de lancement Windows 10\"\"mode classic = Ressemble à la barre de lancement Windows XP\"\n> Il y a aussi une app qui s'appelle \"CrossOver\" une sorte de virtualisateur comme \"Wine\" qui permet de lancer des applications windows. J'ai installé Foobar2000 ça tourne niquel :)\n> C'est vrai que le site de Deepin est très lent par contre.^^En tout cas l'interface graphique et l'ergonomie de Deepin sont vraiment soignés c'est un régal pour les yeux.\n\nHa pas bête le coup du clic droit! On comprend que cette distribution soit 14 dans le classement distrowatch. Ce que j'apprécie particulièrement c'est la réactivité de l'interface : comme quoi on peut faire beau et rapide ^^ . Testé et approuvé avec office 2007 (disponible dans la section torrent)",
			"post_id": 10,
			"date_added": 1458503523
		},
		{
			"comment_id": 5,
			"body": "> [nazaki35](#comment_4_1Hqe3wJ9TbGJa9J47V8UZ71yoKdZxjmWLL): Dommage qu'ils n'aient pas fait une version linux car là si je veux utiliser ce soft il fut que je monte un windows en VM et ensuite faire la clé...\n\nen fait il existe aussi sous linux, ils ont même fait un tutoriel.",
			"post_id": 11,
			"date_added": 1459798879
		},
		{
			"comment_id": 6,
			"body": "Bonjour,\nJe découvre, merci pour le lien  =)\nA+\n",
			"post_id": 14,
			"date_added": 1512510211
		},
		{
			"comment_id": 7,
			"body": "> [wanditoast](#comment_1_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ): pure hasard! ce site a l'aire d'être mort depuis un bon bout de temps.\n\nLe temps file à une vitesse.. Je vais reprendre un rythme de mise à jour régulier.",
			"post_id": 7,
			"date_added": 1553635502
		}
	],
	"comment_vote": {},
	"post_vote": {}
}