{"next_paste_id":3,"next_comment_id":0,"paste":[{"paste_id":0,"description":"O partido de Lênin (bolchevique) era monolítico?","body":"BROUÉ, Pierre. História da Internacional Comunista (1919-1943). Trad. Fernando Ferrone. São Paulo: Sundermann, 2007 [1997]. 2v\nBROUÉ,  P. Comunistas  Contra  Stalin:  Masacre  de  una  Generación. Málaga:  Sepha,2007\nKRAUSZ, T. Reconstruindo Lênin: uma biografia intelectual. São Paulo: Boitempo, 2017.\nARENDT,  Hannah.  Origens  do Totalitarismo .  Trad.  Roberto Raposo. São Paulo: Companhia das Letras, 1989. \n____.  Entre o Passado e o Futuro . Trad. Mauro W. Barbosa de Almeida. São Paulo: Perspectiva, 1992.","language":"text/plain","encrypted":false,"added":1599357141},{"paste_id":1,"description":"STÁLIN: uma análise (des)equilibrada","body":"MARIE, Jean-Jacques. Stálin. São Paulo: Babel, 2011. \nTREPPER, Leopold. O Grande Jogo. Lisboa, Livros Horizonte, 1977. \nBROUÉ,  P. Comunistas  Contra  Stalin:  Masacre  de  una  Generación. Málaga:  Sepha,2007\n\nTeorias da conspiração:\nTopitsch, Ernst.Stalin ́s War: A Radical New Theory of the Origins of the Second World War.New York: St: Martin ́s Press, 1987. \nVictor Suvorov. Icebreaker: Who Started the Second World War?, \nHamish Hamilton, London 1990.\nMagenheimer, Heinz. ​Hitler's War​, London, 2002.\nAlbert L. Weeks. Stalin's Other War: Soviet Grand Strategy, 1939–41. (Lanham, MD: Rowman and Littlefield, 2002","language":"text/plain","encrypted":false,"added":1599357737},{"paste_id":2,"description":"","body":"[...] Acumular, acumular, acumular. É única lei que reconhece o capital.\n Sobretudo porque o capital é uma entidade social que se caracteriza pelo seu movimento continuo, pela reposição constante de seus pressupostos. O capital odeia o repouso. Os diversos capitais individuais apenas se ligam entre si na esfera da circulação, quando seu produto adquire forma social. Por esse motivo, qualquer acidente inesperado nesta esfera põe em desespero e crise todo processo de produção. A alma desesperada e frenética do capitalista individual reflete nada mais que a ausência de planejamento social na esfera da circulação. Tudo isso torna-se ainda mais crítico com a crise atual do capitalismo mundial. \n Não sem razão, governos como o de Bolsonaro, responsáveis por controlar aquilo que, na verdade, eles não tem controle algum, entram em uma crise de dupla personalidade. É preciso combater o coronavírus, dizem. Mas não podemos parar a economia, dizem logo em seguida. No entanto, para combater o coronavírus é necessário parar a economia. O que fazer? Resta tomar algumas medidas “possíveis”  e, ao fim e ao cabo, voltar a se curvar diante do único deus que o capitalismo reconhece: o mercado. “Perdoe os meus pecados, vamos compensar autorizando a flexibilização da jornada dos trabalhadores, os mecanismos de sua demissão e injetando recursos públicos nas empresas atingidas”, dizem! \n De nada adianta os avanços técnicos que a humanidade levou milênios para acumular, se esses não tem o potencial de produzir retornos no curto prazo. Já faz tempo que pesquisadores e a OMS alertam para essa possibilidade. Entre as listas de perigos em potencial era incluído, faz alguns anos, os coronavírus de morcegos.\n No fim das contas, o coronavírus não ameaça em absolutamente nada o capitalismo. Milhares poderão morrer pela ausência de atendimento, outros tantos pelo contágio que se alastra de forma desenfreada em um tipo de sociedade que não admite planejamento algum, exceto aquele imposto anarquicamente pelo mercado. Empresas sofrerão o impacto e poderão falir, outras irão emergir em seu lugar. Novas fatias de capital serão acumuladas sobre o túmulo da destruição provocada, como será certamente o caso com as vacinas. Países que sofreram primeiramente os surtos acumularão capital vendendo para aqueles que sofreram em seguida. E assim por diante. Em resumo, uma fatia minúscula da população irá se beneficiar e acumular fatias gigantescas de capital com todo esse processo. [...]","language":"text/plain","encrypted":false,"added":1599361844}],"comment":[]}