{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [quantumworld](#comment_1_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I would rather watch some one else do it than do it myself. I love to fly but I like a bit more of a structure around me. But it does look like allot of fun.\n\nThey used to have an additional emergency parachute when flying. :)",
			"post_id": 35,
			"date_added": 1545117575
		},
		{
			"comment_id": 2,
			"body": "I've also realized that time saving is more worth than fuel saving.",
			"post_id": 39,
			"date_added": 1555637103
		},
		{
			"comment_id": 3,
			"body": "Clever manufacturers smartly turn that feature off before releasing their products to the market. lol\nI see reverse cases of yours many times. 'This feature must have been here or could be enabled easily. Why there's none?' Yes, they're smart enough to kill that feature in advance.",
			"post_id": 41,
			"date_added": 1569292608
		},
		{
			"comment_id": 4,
			"body": "> [ulrichard](#comment_16_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ): @leftside: Screwing customers is the kind of smart that only works one time. There are instances where customers would not come back anyway, and there are an increasing amount of customers that don't mind of being screwed. But I still believe it is better to act in the interest of the customer.\n\nIt's almost impossible to find such a good manufacturer in this world. At a certain point every manufacturer or seller find out the way how to suck more money from the customers by cheating a little bit more and more. It's hard to deny demon's whispering especially when it looks like no one gets harmed.",
			"post_id": 41,
			"date_added": 1569327494
		},
		{
			"comment_id": 5,
			"body": "How does a parking brake come without mechanical way but electrical way??\nIn case of electric unicycle, while power-on, u can brake electrically, but if u press power-off button, the wheel comes to free run.",
			"post_id": 42,
			"date_added": 1570963594
		},
		{
			"comment_id": 6,
			"body": "@ulrichard Oh, thanks. That is normal. I thought there's something special with the Tesla electric parking brake system. His manual seems obsolete. :)",
			"post_id": 42,
			"date_added": 1571009408
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"28": 1,
		"39": 1,
		"41": 1
	}
}