{
	"title": "\n自由呼吸 ",
	"description": "I think, I doubt.\n",
	"links": "- [海盗湾种子站](http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/)\n- [Source code](https://github.com/HelloZeroNet)\n- [GFW Talk](http://127.0.0.1:43110/gfwtalk.bit/)\n- [编程随想的博客镜像](http://127.0.0.1:43110/15gfg6DUVkp7ApLSMQvC2ig5qy8j91jXeW/)\n- [The World of Codegass](http://127.0.0.1:43110/1HotJMoS9Z1v8UwDCmv3VDG3q88c5na8cZ/?Home)\n",
	"next_post_id": 10,
	"demo": false,
	"modified": 1462752329,
	"post": [
		{
			"post_id": 9,
			"title": "概念释疑：信仰",
			"date_published": 1462751844.903,
			"body": "**信仰**（英语：Faith）是指对一个人（同样的对他的能力）、事物、神、宗教的教条或教导、*没有经验证据的观点*（例如拥有强烈的政治信仰）抱有**信心和信任**。\n\n信仰是人对人生观、价值观和世界观等的**选择和持有**。信仰体现着人生价值、人生意义的**可靠落实**。**信仰与所信仰的对象是否客观存在没有必然联系**。**宗教并非信仰对象，而是信仰的表现形式，表现形式不可作为信仰对象**。\n\n---\n\n信仰一般往往被认为是由外在因素所形成、受到父母、社会、宗教和传统所影响。如果一个伊斯兰教家庭从一个基督教家庭收养一个刚出生的小孩，那小孩长大后变成一个伊斯兰教徒的可能性就会提高；反之也是如此。唯信仰过程必须是经过内在回应的，其中需透过个人的经历和对灵性的追寻，进而选择一种适合自己的宗教信仰。**信仰可以获得，可以被塑造，也可以被抛弃**。虽然有不少宗教对信徒的离开有严格限制，但根据联合国的《世界人权宣言》，人是有选择宗教、或选择不信仰宗教的自由。\n\n一些有信仰的人很多时会求神帮助我们改变一些事情的发生。但信仰不是单单要求神帮助我们改变外在环境发生的事情，**更重要的是信仰能帮助我们内心思想的改变，拥有面对逆境的能力**。\n\n来源：[维基百科](https://zh.wikipedia.org/wiki/%E4%BF%A1%E4%BB%B0)"
		},
		{
			"post_id": 8,
			"title": "党员有权就时政发表异见吗？——兼与贺卫方老师商榷",
			"date_published": 1462518974.735,
			"body": "党员有权就时政发表异见吗？——兼与贺卫方老师商榷\n \n张雪忠\n \n前段时间，我在网上读到贺卫方老师的“党员有权就时政发表异见”一文（该文以访谈形式发表），对文中的主旨观点有些不同看法。但由于当时贺老师正忙于与共青团干部们的辩论，我觉得不太适合在那个时候去批评他的观点。\n \n我个人一直敬重贺老师对公共事务的关注与热忱，但由于贺老师的文章涉及现代政治的基本常识和重大原则，我觉得现在有必要略加讨论一下。当然，这种诚恳的观点交换，丝毫不会减损我对贺老师一直以来的敬重。\n\n---\n \n若要厘清“党员是否有权就时政发表异见”的问题，我们有必要区分一个人可能同时具有的“公民”和“党员”身份。作为公民而言，除了受到法律极少的例外限制外（如不得诽谤他人），一个人可以享有充分的言论自由，特别是批评政府和政治人物的自由。\n \n政党是一群人基于共同的政治理念，为采取共同的政治行动而形成的团体。在政党内部，党员有可能要受到纪律约束，包括在发表政治观点时与所在政党保持一致。对党员作为公民的言论自由而言，这种纪律约束意味着公民权利的减损，但如果党员是自愿入党的，这种权利减损其实是党员对自身权利的自愿处置。\n \n以上的简要分析可表明，一名党员发表与政党理念或政策相违背的异见，政党可以对其加以纪律约束乃至纪律处分。但这种处分最严重的程度，也只能是将其逐出政党，而不能对其公民权利加以任何形式的侵害。如果一个政党利用政治权力，即利用以政治机制存在的暴力手段，去侵夺违纪党员的公民权利，那就与一个匪帮并无多大的不同了。\n \n对于政党的纪律处分，党员如若不服，可以遵循党内途径去申诉。如果申诉无果，他要么服从处理结果，要么退出政党。如果一个人既不认同政党的理念或不服从政党的纪律，又要坚持保留党员的身份，那我们就可以说，这个人甘愿在政治立场上处于一种自相矛盾的状态。\n \n有人可能会争辩说，在有些国家，某个政党可能垄断一切政治权力以及各种政治资源，人们入党并不一定是基于政治理念的认同，而是出于其它的现实考量。但这样的政党无疑是违反自由主义原则的政党。一个认同自由主义的人加入这样的政党，不管他是否有别的苦衷，我们仍可以说，他至少在政治立场上是自相矛盾的。\n \n贺老师在他的文章中称，他不认为自己有必要退出，因为他相信“中国共产党能逐渐地可以通过某种和平性的推动，通过意识形态的改造，能够走向民主，走向我们心目中希望的特别良好的社会秩序的建构”。我不知道贺老师是基于何种事实，相信他所在的政党一定会逐渐走向民主。但就他希望这个政党进行意识形态改造而言，我们满可以推测，他个人并不认同这个政党现有的意识形态。\n \n也就是说，贺老师一方面不认同一个政党的基本理念，同时却又是这个政党的成员。这个政党未来也许会进行意识形态改造，也许不会。但假如这个政党一直不进行意识形态的改造，不知道贺老师是否也要一直等下去？\n \n最后，我必须强调一下，对于包括贺老师在内的任何人的个人政治选择，我都予以完全和充分的尊重。只是由于贺老师将他个人政治选择的理据公之于众，这些理据作为独立于个人选择的公开观点而言，却是具有公共意义的，因而当然是可以公开辩论的。﻿"
		},
		{
			"post_id": 7,
			"title": "转帖：自由港iyouport",
			"date_published": 1461679046.859,
			"body": "英国《每日电讯报》报道，近期不少外资行纷纷向客户发出警告称，**中国本轮信贷拉动的经济繁荣已接近顶峰，预期增长势头在夏季末转向**。\n\n今年中国一季度新增贷款达到4.6万亿元，社会融资规模也同比例扩大，增量为6.59万亿元，比去年同期多1.93万亿元。报道引述摩根士丹利评论称，中国一季度创纪录的信贷增长将支持经济再继续增长一段时间，但为避免地产投机产生过多泡沫，中国政府已经在实施地产限购措施。随着政策刺激效果减弱，三至四个月之后，将看到中国经济增速放缓。\n\n资本经济公司的预测更为缓和一些。其指出，每次信贷激增通常能支撑六至九个月的经济增长。**暗示了经济回暖将在秋末告终**。\n\n---\n法国兴业银行经济学家Wei Yao指出，一季度地产市场信贷同比激增58%至7.5万亿元，还从未见过如此大的政策杠杆。她指出，这和2009年的四万亿刺激政策显示出惊人的相似性，“**这就是旧模式下的信贷支撑的投资拉动型经济。刺激的结果就是高通胀、资产泡沫和产能过剩。我们认为，此次经济复苏不会持续太久**。”\n\n3月数据显示，一线城市房价上涨势头不减，部分二线城市房价涨幅亦显惊人。海通证券首席经济学家李迅雷指出，房地产开发投资从去年1%的增速大幅反弹至6.2%，在固定资产投资总额中占比提高到20%。\n\n报道引述野村证券中国首席经济学家赵扬称，在断断续续的短期繁荣中，**地产投资变得更不稳定**。结构性问题和金融失衡持续恶化。我们认为债务支撑的经济增长不是可持续的。野村股票策略师Wendy Liu和Vicky Fung警告投资者小心，**市场将在2016年中达到分水岭**，我们建议投资者撤出部分资金。\n\n报道指出，令人担忧的是，**信贷激增的同时，还伴随信用市场违约频发**，信用风险爆发路径已从民企行至央企。在中铁物资成为首个债券申请暂停交易的央企公司后，截至4月12日，月初以来有至少共计178亿的18只债券取消发行。品种涵盖中票、短融、超短融债券。而上月448亿元的取消发债规模为去年同期3倍。\n\n朗伯德街研究公司的Michelle Lam称：“未来两个季度，决策者或放弃改革，转向继续求诸于投资刺激。但**决策者在债务积累上追求增速的路还能走多久呢？**”\n\n近期，索罗斯继1月之后再谈中国经济，与上次的“经济硬着陆”不同，这次索罗斯将重点放在中国的**高债务问题**上。\n\n他在纽约的亚洲协会活动上表示，中国正在发生的一些事情“非常类似于2007-08年通过大量信贷增长而推动经济增长的美国”，索罗斯指出，“**中国随后将进入一个拐点，这将超出所有人的预期**。”"
		},
		{
			"post_id": 6,
			"title": "转帖：你少交智商税，就是真的爱国",
			"date_published": 1461471865.577,
			"body": "[你少交智商税，就是真的爱国](http://www.gelonghui.com/p/59940.html)\n@格隆  发表于2016-04-23\n\n一、\n\n一个哥们昨晚近乎热泪盈眶地向格隆倾诉：我刚看完了贾布思的超级汽车、超级VR、超级手机、超级电视产品发布会，两个多小时，我被彻底感动了。他就是中国的埃隆·马斯克（Elon Musk），他会推动整个人类的进步，我必须买他的产品支持他。\n\n我无奈摇了摇头：**又一个主动缴“智商税”的人**。\n\n格隆完全相信，等埃隆·马斯克（Elon Musk）的火箭公司再搞个大新闻，乐shi的超级火箭肯定就要出PPT了（你妹听错，不是出产品，是出PPT。或许这次会是500页的PPT？），而如果A股再给一次讲故事圈钱融资的牛市机会，乐shi铁定会宣布和NASA合作研发乐视超级航天飞机、乐视时空穿梭机。**只要证监会不管，我觉得乐shi能把哆啦A梦里面的道具挨个“发明”一遍**。\n\n---\n\n这和你去买那个喝了虽不会死人，但铁定对你智商无任何帮助的“今年过节不收礼，收礼就收脑白金”的自来水产品，有何区别？\n\n就这种凭常识都能看清的局，仍有人前赴后继去买单，让格隆不得不相信两件事：\n\n**1、中国正在步入“低智商”社会；**\n\n**2、在这个浮华喧嚣的盛世里，总有一款“智商税”适合你！**\n\n二、\n\n人类之所以为人类，是因为我们远高于其他物种的智商。但这个事实在当下中国这个浮华喧嚣的盛世里迅速遭到挑战：P2P，炒石油，炒螺纹钢……到处都是被简单把戏蒙骗的人，不少人甚至被骗得倾家荡产。\n\n用一句俗语说：傻子太多，骗子完全不够用了。\n\n我相信你会经常与格隆有同样的疑惑：那么弱智的骗局，怎么还能上当呢？真为智商捉急。\n\n当然，你在骂其他人的时候，他人也很可能在用同样的话骂你，因为你肯定听过西方社会是怎么描述智商税的：**他口中含着一个灯泡。**\n\n在英国，灯泡的包装纸上都有警告--**do not put that object intoyour mouth.** 意思是不要把灯泡放进口中。\n\n哪有人会放这东西进口中？英国真白痴……\n\n有一天，我和一个印度朋友在家中看电视，我和他谈到这件事，他告诉我，他们小学的教科书也有说到，因灯泡放进口后便会卡住，无论如何都拿不出来，他十分肯定书上是那么说的。但我十分怀疑，我认为灯泡的表面是十分滑的，如果可以放得进口，证明口部足够大让其出入，理论上也可以拿出来。但这印度白痴只说书是那么说的，便一定是正确的。\n\n我被他这种不求甚解的态度弄火了，我说他笨，他说我不会英文不看书，我们便吵了起来。我一肚火回了家，拿起一个普通大小的灯泡在床上左想右想，始终认为我没有错，想到这印度朋友的无知，也本着科学家的精神——大胆假设，小心求证。我决定要证实给他看。当然，我也做了安全措施：买了一瓶菜油回家。若卡住了便放油，我就不信滑不出来！一切就绪，二话不说便把灯泡放进口中……\n\n不消1秒便滑入了口，倒也容易，照这样看要拿出来绝无问题。心想这印度白痴，看看我中国人的智慧和胆识吧！不像你这书呆子，心想印度还想着战胜中国，打从心里笑了出来，哈哈！于是我轻松地拉了灯泡一下……，好！我放多点力…… OK，我把口张大一些……不怕，我把口张得最大，用多一点力（要很小心，怕拉破灯）。\n\n妈的！真的卡住了……好在还有菜油……（30 分钟后）\n\n我倒了3/4瓶油，其中一半倒了进肚子，那灯泡还是动也不动。这时候，我只好打电话求救……拿起电话，按号码按到一半，我记起我口中塞了个灯泡，怎么说话？只好向邻居求助，我写了一张便条后便去找邻家那老妇。她一见我便大呼救命，我立即给她看我写的便条—— please call me a taxi and tell the driver to take me hospital. （请帮我叫一辆的士，还请告诉司机，送我到医院。）\n\n她看了大约1.75分钟后大声狂笑（如果我说得出话，我真想揍她。）15分钟后，的士来了。司机一见我，也笑了。在的士上，他不停的问我，怎么会这么做？（他妈的，我如何答他？）司机还不停说我的口太小，如果是他的口便没有问题……我看看他，他的口真是很大……但我好想告诉他，无论如何不要试，可惜我开不了口！\n\n在医院，我被护士骂了十多分钟，说我浪费她们时间。还要我排一条很长的龙……我在人群中待了2.5小时……2.5小时啊……那些痛楚万分的伤者，看见我都好像不痛了，人人都偷偷笑出来……。医生把棉花放进我口的两旁，然后把灯泡敲碎，一片片拿出来。我的口肿得很大，最后医生告诉我，下回不要试，并告诉别人我的经验。我告诉他我一定不会了。\n\n当我离开医院时，我在想这地球一定没有像我这么白痴的动物了。\n\n当我开门离开时，迎面来了一个人，是刚才那的士司机。\n\n**他口中含着一个灯泡。**\n\n![](http://glhsns.img-cn-hangzhou.aliyuncs.com/201604/p20160423201820629.jpg!wm)\n\n三、\n\n上周中国最流行的风景，可能不是广场舞，而是一大群大爷、大妈排队开商品期货账户。\n\n上周五（公元2016年4月21日），一轮疯狂的商品期货暴走行情。以有代表性的螺纹钢期货主力合约为例，该品种当日成交金额高达6056亿元，超过沪深两市的总成交额5421亿元。而中国一年生产12亿吨的钢材，其中2亿吨左右的螺纹钢，**一年产量都比不上当日一天这一个合约的交易量**。\n\n看到这样的数据，任何有常识的人都会知道接下来到来的一定是毁灭。\n\n下图是当前螺纹钢期货价格走势（红线）与2009年螺纹钢期货价格走势（白线），是不是似曾相识？2009年，也是一轮股市牛市结束，也是资金找不到去处，螺纹钢也是一通暴涨，但随后就是一通更迅速的猛烈暴跌（下图）。无数人的资产就在这种疯狂赌博中灰飞烟灭。\n\n![](http://glhsns.img-cn-hangzhou.aliyuncs.com/201604/p20160423191317234.!wm)\n\n这种明着请君入瓮的玩法，你自愿要跳，除了冠以“智商税”外，还有什么更好的词汇吗？！\n\n从去年的爆炒信用债，到股票，到今年年初的房子，到现如今的大宗商品，不到一年时间，我们把美林投资时钟转了个遍，**硬生生把一个十年周期的“美林时钟”，弄成了美林电风扇**。\n\n最关键的，在当今中国这个浮华喧嚣的盛世，这种智商硬伤的赤裸裸骗局式博弈，不是个案，而是遍地开花，而其中一定有一款是适合你的。\n\n宽泛点说：彩票（威廉·配第1662年的《赋税论》是这么定义彩票本质的：实际上就是对那些自我陶醉的倒霉穷傻瓜征收的一种赋税）、**地震向XXX会捐款、电视购物、电信诈骗、针灸减肥、花高价买非转基因食品，其他如“来都来了”税、“买个放心”税、“老人高兴就好”税、“梦想万一实现”税、“大人物崇拜”税、“先有国，后有家”税**等等，这些都是典型智商税。\n\n另外“仁波切”税大概是近两年最繁荣的税种，纳税途径为拜李一，王林们、养上师、供佛牌、买水晶等等。据说仅北京朝阳一个区，就有三千多名“仁波切”，而且，这些“仁波切”酷爱“双修”。\n\n当然，草民炒股也是当仁不让的“智商税”。这个里面的骗局，诸如改个名字，加个量子、智能、互联网+之类的名词就坐地起价，大都可以轻松辨别，但无数人还是乐此不彼飞蛾扑火，沉迷其中，哪怕夫妻反目，家庭破产。\n\n日本管理大师大前研一在其著作《低智商社会》里曾很刻薄地批评中国“集体交智商税”的现象，也触动了很多中国人的敏感神经。他在书中如是说：在中国旅行时发现，城市遍街都是按摩店，而书店却寥寥无几，中国人均每天读书不足15分钟，人均阅读量只有日本的几十分之一，中国是典型的“低智商国家”，未来毫无希望成为发达国家！\n\n听起来很刺耳，但会否一语成谶？\n\n\n四、\n\n如果去单独测智商，我相信，中国每个个体的智商都不会低。\n\n那么，在更加发达的今天，为什么会产生这种集体智商衰退的现象？为何中国会进入“低智商”社会？\n\n核心原因不外乎两条：\n\n**1、个体跨进校门后的教育、培育机制；**\n\n**2、个体跨出校门后的生存游戏规则；**\n\n中国的教育，是模式化的应试教育，与科举并无太本质的区别。这种机制下出来的个体，严重依赖外界的信息，不喜冒险，人云亦云，跟风追风，从众心态严重，缺乏独立思考精神和独立判断能力，“永远漫游在无意识的领地，会随时听命于一切暗示，表现出对理性的影响无动于衷的生物所特有的激情，他们失去了一切批判能力，除了极端轻信外再无别的可能”（法 勒庞《乌合之众》），以致13亿人口基数中国的创新能力甚至不如欧洲的瑞士、挪威、芬兰等小国，也不如印度。\n\n中国的创造性在世界上的影响力可以用“微不足道”来形容——整个20世纪，那些改变和推动人类进步的重大发明，经由中国的，屈指可数。\n\n格隆曾经有一个朋友，某天做了一个惊人之举：退出所有微信朋友圈。问缘由，答曰：实在不想让朋友圈拉低自己的智商。\n\n中国离开校门后的生存游戏规则，则是典型的**智商逆向淘汰机制**：无论是政界还是职场，你必须抛弃创造力与幻想，严格遵循既定的当前固有框架模式，否则，你极大可能会被淘汰出体制外，甚至沦落到无法养家糊口。\n\n中国历史上发生过很多这类集体愚昧，个体被裹挟的悲惨案例。崇祯三年（1630年）八月，北京城一派肃杀，凌迟袁崇焕的消息早就不胫而走。多次遭受后金军队骚扰的北京吏民无不欢呼雀跃，在他们看来，袁崇焕这个引狼入室的汉奸终于要遭到应有的惩罚了—袁崇焕是以勾结后金、阴谋叛逆的罪名被捕的。\n\n《明季北略》中记载了袁崇焕受凌迟的细节：袁崇焕被凌迟到“皮肉已尽”时，还没有断气，“心肺之间叫声不绝”，“**百姓将银一钱，买肉一块，如手指大，啖之。食时必骂一声，须臾，崇焕肉悉卖尽**”。\n\n![](http://glhsns.img-cn-hangzhou.aliyuncs.com/201604/p20160423191344817.!wm)\n\n《明史》是这样总结此事的：**崇焕死，边事益无人，明亡征决矣**。\n\n一个传神的“益”字，包含的另一层意思是：纵有崇焕，明亡征亦决矣——一个集体愚昧的国家，佛祖也保不了。\n\n**自秦孝公采用商鞅“愚民、弱民、辱民、贱民”之国策后，“百代皆行秦政制”，这，也许就是中国历史上有那么多轮回的原因？**\n\n\n\n五、\n\n纵观全球，一个能持续“高成长”，而不至于轮回的大国，一定是一个“高智商社会”：**拥有思维独立、成熟的规模化个体群、公共意识强烈、有创新的想法、对知识和真理的追求远大于对规则和权利的敬畏**。\n\n所以，现在最关键的问题变成了：**在“低智商社会”中，谁获益？或者说，谁乐于打造一个“低智商社会”？**\n\n**如果试图以伪科技和社会的伪发展为噱头，把人可供发掘的商业价值最大化为目的，那么，喜欢“无脑跟随”的低智商社会无疑是最佳的商业土壤**。没有什么比一群毫无独立辨识能力、走到哪儿都拿着移动电子广告板（手机，平板电脑），不停在公开场合透露自己的隐私（把自己躺在床上的照片发上网与把照片打印出来贴地铁站门口没有本质区别），或者把时间浪费在追网红的人群，更适合“make money”了。\n\n最新流行的一款智商税是：一个被某某蛮子称为“当代鲁迅”的网红的贴片广告，成交2200万！净收益将全数捐给一个富得流油的学校——中戏。\n\n这个其实都不用派律师去查，只用查查现金流就能知道这局设得有多拙劣——很多上市公司都这么干，公告签了无数业务，但就是没真实现金流。\n\n但还是有诸多人扑上去。一个长期做互联网投资的基金大佬这么教育格隆：**你知道中国有多少人没智商，却有用不完的无聊时间吗？你如果试图去改变他们的智商，你这商业模式注定是一条艰难的路。但如果你用更无聊的东西，去帮他们打发掉无聊的时间，你的商业模式就成功了一半。**\n\n当然，并不是所有人都如同这个投资家（也是商人）这么想。一个网友是这样在相关事件下留言的：她在很多视频中传递扭曲的价值观，比如女孩读什么博士啊，直接找个有钱的老公嫁了就得了。诸如此类的误导性观点还有很多，一个艺校出身，缺少文化底蕴、一心幻想靠扭曲的价值观走红的人，无论是内容还是形式都无聊、无趣、无意义，然而，却能受到当下无数青年的追捧和商人的资本追逐，我不知道这个社会到底怎么了？只能尽量远离这些低俗无聊、矫揉造作的泡沫，同时，尽量保持沉默。在扭曲的年代，尽量保持自己的坚持；在浮躁的年代，尽量保持内心的淡定；在名利的年代，尽量践行工匠精神，实实在在研发一点对自己和他人有益的东西。\n\n别提醒我，除了有资源的商人，更有人从“低智商社会”中获益。我不知道。\n\n \n\n六、\n\n不要口头高喊爱国，不要对美国航母进南海义愤填膺，更不要去打砸自己同胞买的日系车。\n\n**不愚民，不被愚，不让自己成为乌合之众，提高自己的智商，少交智商税，就是真正的爱国！**Blog post body"
		},
		{
			"post_id": 3,
			"title": "注册谷歌语音号码",
			"date_published": 1461416886.829,
			"body": "转帖：<a href=\"https://plus.google.com/u/0/+XieYuHuaok/posts/WMBzswP8s8w\"target=\"_blank\">请点击这里</a>\n\n一，手机端下载安装<a href=\"https://play.google.com/store/apps/details?id=com.pinger.ppa\"target=\"_blank\">text free pinger</a>（20160313更新），在提示界面注册后获得一个免费的美国号码；\n\n二，<a href=\"https://www.google.com/voice#inbox\"target=\"_blank\">去google voice验证</a>；\n\n三，验证通过后，在选号时，可能会有错误提示：“There was an error with your request. Please try again.”，不用担心，反复狂点下面的“继续”按钮，最好用键盘精灵，省事。\n\n确定可以获得GV号码，祝您好运！"
		}
	]
}