{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"category": "games",
			"title": "Portal 2 RUS [Update 30 + 2 DLC] (2013) РС | RePack от NSIS",
			"torrent_imdb": "",
			"body": "В Portal 2 вы откроете для себя инновационный геймплей, сюжет и музыку, которая помогла оригиналу заработать более 70 наград в игровой индустрии, а также создала целый культ имени самой себя.\n\nНа блюде с одиночной игрой Portal 2 вы сможете поживиться несколькими новыми персонажами, разнообразными неожиданными головоломками и еще большим количеством тестовых комнат. Игроки смогут познакомиться с неизвестными им частями лаборатории Aperture Science и снова объединятся с ГЛаДОС — порою издевательски злобной компьютером-компаньоншей, которая помогала главному герою пройти все испытания в первой части игры.\n\nИграя в кооперативном режиме, игроки откроют для себя абсолютно новую, независимую от оригинальной сюжетную линию с новыми тестовыми комнатами и двумя персонажами. Здесь каждому из вас придется проявить все то, что вы знаете о порталах. Чтобы добиться успеха, вы будете обязаны не просто играть вместе, но и думать сообща.",
			"magnet": "magnet:?xt=urn:btih:0af747df46911606bd2b0deeae95e49a737ccb87&dn=rutor.org_Portal+2+%5BUpdate+30+%2B+2+DLC%5D+%282013%29+%D0%A0%D0%A1+%7C+RePack+%D0%BE%D1%82+NSIS&tr=udp://bt.rutor.org:2710&tr=retracker.local/announce",
			"torrent_file": "data/users/1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss/3 (2).JPG",
			"added": 1457499214
		},
		{
			"topic_id": 2,
			"category": "games",
			"title": "Minecraft RUS [v1.8.3] (2011) PC | RePack",
			"torrent_imdb": "",
			"body": "Описание: Minecraft — это строительная игра жанра «песочница», вдохновлённая Infiniminer, Dwarf Fortress и Dungeon Keeper и созданная Маркусом Перссоном, основателем Mojang AB. Игра позволяет игрокам создавать и разрушать различные блоки и использовать предметы в трёхмерной окружающей среде. Игрок управляет персонажем, который может разрушать или устанавливать блоки, формируя фантастические структуры, создания и художественные работы в одиночку или коллективно с другими игроками на различных многопользовательских серверах в разных игровых режимах.",
			"magnet": "magnet:?xt=urn:btih:f249b49f5f80b43d1c7390683dbf9bd7cec7516f&dn=rutor.org_Minecraft+%5Bv1.8.3%5D+%282011%29+PC+%7C+RePack&tr=udp://bt.rutor.org:2710&tr=retracker.local/announce",
			"torrent_file": "data/users/1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss/",
			"added": 1457499602
		},
		{
			"topic_id": 3,
			"category": "games",
			"title": "Far Cry 3 RUS (2012) PC | RePack от R.G. Механики",
			"torrent_imdb": "",
			"body": "Главный герой, Джейсон Броуди, отправляется с друзьями в отпуск на необычайно красивый тропический остров. И тут же оказывается в заложниках у банды пиратов под предводительством безумного убийцы Вааса. Начиная с этого момента, ваша задача – выжить любой ценой. Джейсон будет втянут в кровопролитную войну между пиратами и местными повстанцами, в которой кровь, свинец и наркотики льются рекой. Одни психопаты сражаются с другими, и вскоре главный герой уже не в силах отличить опиумный сон от безумной яви. Сумасшедший остров сводит с ума всех, кто ступит на его берега и нужно быть психом, чтобы здесь остаться. А ты в своём уме?",
			"magnet": "magnet:?xt=urn:btih:74f57a0fd6e1b99879a8c4bf75309878b989cebc&dn=rutor.org_Far+Cry+3+%282012%29+PC+%7C+RePack+%D0%BE%D1%82+R.G.+%D0%9C%D0%B5%D1%85%D0%B0%D0%BD%D0%B8%D0%BA%D0%B8&tr=udp://bt.rutor.org:2710&tr=retracker.local/announce",
			"torrent_file": "data/users/1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss/",
			"added": 1457499680
		},
		{
			"topic_id": 4,
			"category": "games",
			"title": "Project CARS RUS [Update 1] (2015) PC | RePack от xatab",
			"torrent_imdb": "",
			"body": "Project CARS - это потрясающее гоночное путешествие! Игра Project CARS, протестированная и одобренная страстными поклонниками гонок и реальными гонщиками, принимавшими участие также и в ее создании, представляет собой гоночный симулятор нового поколения, который вобрал в себя невероятную комбинацию фанатской страсти и высокого профессионализма разработчиков. Вас ждет невероятное погружение в игровой мир, достижимое благодаря передовой графике и невероятно реалистичному управлению, которое позволяет отлично чувствовать дорогу. Создайте своего собственного гонщика и участвуйте в одном из множества соревнований, доступных в динамичном режиме карьеры. Вы также сможете стать новой легендой, состязаясь в напряженных сетевых поединках. Благодаря огромной подборке трасс, подобных которой не было ни в одной гоночной игре за последние годы, инновационном системам погоды и смены времени суток, глубокой настройке автомобилей и многофункциональным пунктам техобслуживания, доступным во время гонок, а также поддержке Oculus Rift и разрешения 12K Ultra HD resolution, Project CARS попросту оставляет всех возможных соперников далеко позади.",
			"magnet": "magnet:?xt=urn:btih:27453680bef87c79f601e66d8fd89fe9772d5807&dn=rutor.org_Project+CARS+%5BUpdate+1%5D+%282015%29+PC+%7C+RePack+%D0%BE%D1%82+xatab&tr=udp://bt.rutor.org:2710&tr=retracker.local/announce",
			"torrent_file": "data/users/1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss/",
			"added": 1457499848
		},
		{
			"topic_id": 5,
			"category": "games",
			"title": "Мафия / Mafia: The City of Lost Heaven (2002) PC | RePack от R.G. Element Arts",
			"torrent_imdb": "",
			"body": "1930-й год. Америка. Томми Анджело - простой водитель такси. Он занят любимым делом, и ничто в его жизни не предвещает беды. Однако случайное знакомство с двумя гангстерами, Поли и Сэмом, навсегда меняет его судьбу. В жизни Томми грядут большие перемены.\nПростому таксисту суждено стать мафиози. Теперь у него новая работа, более рискованная и опасная. Однако за нее хорошо платят. Со временем, став членом Семьи, Томми поручают все более сложные и ответственные задания. Ему предстоит испытать взлеты и падения, идя на поводу у жажды наживы и славы, стать свидетелем преступлений и лично принять участие в контрабандных операциях, бешеных погонях на автомобилях, покушениях и ограблениях.\nНачав свою карьеру в качестве простого исполнителя, Томми предстоит выполнить множество опасных поручений и добиться прочного положения в Семье, заслужив доверие Дона Сальери. Однако со временем Томми начинает понимать, насколько низко ценится дружба и человеческая жизнь среди людей, называющих себя \"друзьями\".\n\"Мафия\" - это не просто игра, это настоящая гангстерская сага, погружающая вас в атмосферу Америки 30-х годов. Действия разворачиваются в огромном виртуальном мире площадью более 16 квадратных километров с потрясающими пейзажами, живописными зданиями и грязными притонами, один вид которых наводит ужас. ",
			"magnet": "magnet:?xt=urn:btih:68bb5971f0252861341d874ae956651af3f144e6&dn=rutor.org_%D0%9C%D0%B0%D1%84%D0%B8%D1%8F+%2F+Mafia%3A+The+City+of+Lost+Heaven+%282002%29+PC+%7C+RePack+%D0%BE%D1%82+R.G.+Element+Arts&tr=udp://bt.rutor.org:2710&tr=retracker.local/announce",
			"torrent_file": "data/users/1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss/",
			"added": 1457499913
		}
	],
	"topic_vote": {
		"1_1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss": 1,
		"120_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"119_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"118_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"117_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"116_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"115_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"114_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"113_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"112_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"111_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"110_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"109_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"108_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"107_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"106_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"1_18WkRv5q15D3dn3ELTN3623CX3HSG38ZQV": 1,
		"2_1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss": 1,
		"3_1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss": 1,
		"4_1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss": 1,
		"5_1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss": 1,
		"121_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"122_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"123_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1,
		"124_1MaXyfVAZyyRfY2n8G81sVwRuUZhnzDLX": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}