{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Viva o livre mercado",
			"body": "https://m.youtube.com/watch?v=mLKLrFYl3fE",
			"added": 1586964790
		},
		{
			"topic_id": 2,
			"title": "Como sonegar",
			"body": "Agorismo.org\nNão seja um escravo - como sonegar renda #1\n\nSumário\n0. Ganhe dinheiro sem deixar rastros\n1. Transforme seu dinheiro em Bitcoins\n2. Transforme suas reservas em ouro\n3. Aproveite a vida!\n\nInfelizmente o brasileiro não tem noção do quanto paga em impostos. O que é natural, afinal, todo sistema tributário é feito para nos ENGANAR.\n\nSe você tem uma renda de $5.000, 27,5%(*) é roubado através do \"imposto de renda\", sobrará $3625. Depois disso você será roubado novamente através do \"impostos sobre consumo\", que para dar números bem conservadores, vamos de 40%, sobram $2175, esse é o seu \"poder de compra real\". Sabemos que, na real, é bem menos que isso, afinal, além de alguns produtos serem taxados acima de 70%(!), os impostos ainda têm um efeito \"multiplicador\" sobre toda cadeia de produção.\n\nDriblar o imposto sobre consumo não é tão fácil, mas sonegar renda pode ser mamão com açúcar, e muitos brasileiros já fazem (graças a Deus!), sem nem ao menos saber que estão sonegando! Aqui vamos explicar uma estratégia simples, que, exceto pela primeira fase, qualquer um pode adotar, usando bitcoin e ouro.\n--------------------------\n0. Essa é a parte mais difícil, dependendo da sua área de atuação. Você precisa receber dinheiro de forma não documentada/fiscal, todo ou parte do valor. Cada área profissional tem suas complicações e não daria para descrever todas aqui. Se você já sonega, compartilhe com a gente sua estratégia. Publicaremos de forma 100% anônima.\n\n1. Para transformar seu dinheiro em bitcoin (btc) você precisará de um intermediário, alguém que vá comprar seu dinheiro em reais em troca de bitcoins. Você precisa fazer essa transação da forma mais anônima possível, não use cartão de crédito, transferência bancária, etc. Prefira alternativas mais seguras como boleto, depósito no banco ou pagamento em espécie diretamente com o comprador.\nNesse vídeo, a Foxbit ensina como comprar bitcoins na sua plataforma: https://www.youtube.com/watch?v=2xRDkFDyYQY\n\nDepois de transformar seus reais em btcs, você pode adquirir um cartão de débito, como da XAPO (que recentemente fechou uma parceria com o Uber na Argentina), para comprar produtos ou sacar reais sempre que precisar.\nMais info: https://support.xapo.com/pt/o-que-e-o-cartao-de-debito-xapo-bitcoin-como-funciona\n\n2. Como o bitcoin tem uma volatilidade muito grande, você pode preferir transformar uma parte, ou tudo, em algum commoditiy, como OURO, que além de ter uma tendência de valorização forte nos próximos anos, ainda pode ser comprado anonimamente com bitcoins, em sites como da BitGold que também oferecem cartões de débito!\n\n3. Pronto, aproveite o fruto do seu trabalho!\n\n* A receita é um pesadelo kafikiano, com surpresas as vezes não tão perturbadoras assim, a alíquota efetiva para o exemplo citado seria de \"apenas\" 10%, ou seja, $500. - Contribuição de um leitor.",
			"added": 1586972677
		},
		{
			"topic_id": 3,
			"title": "A corrupção de 2011 vai se repetir",
			"body": "https://m.youtube.com/watch?v=54melP-oVUQ",
			"added": 1586987333
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}