{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "哪个大神能去这里帮帮他https://gitter.im/ZeroNet-zh/Lobby",
			"body": "哪个大神能去这里帮帮他https://gitter.im/ZeroNet-zh/Lobby\n或者这里?http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1528523924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu/How+to+build+an+ethical+ZeroNet+marketplace+voluntary+taxation+system\n下面是他的问题\n1 - Why didn't OpenBazaar set up on Zeronet?\n2 - In the same example (Creating a marketplace), is it necessary to implement the ZeroID authentication system to make the marketplace user accounts work or is there another equivalent solution?\n3 - Is a site system with a user account with a private message, publication of a message on a forum or to write a product notice, publication of an image on the forum or for the image of a product sold, publication of an article by users, management of their stock, creation and personalisation of their shop possible within the framework of a marketplace on ZERONET?\n4 - Should I use ZeroID to implement features like these before?\n5 - What ZeroID equivalent is used to create similar features?\n6 - Possibility of status data to some members as \"Moderator\" or \"Administrator\" as well as features like ban members, closed some shops that will not comply with the laws, deleted an item without closing the shop entirely, warning system? With ZeroID or equivalent? Why? Why?\n7 - To have the possibility of implanting other cryptomonnaie than the Bitcoin to leave to the sellers and buyers a broad choice of type of payment?\n8 - Possibility of implementing a so-called \"Escrow*\" system? Is there a function to deposit his money on the portfolio on the site or on the contrary, if the customer can use his own portfolio synchronized possibly to his ZeroID account?\n9 - For the creator of the site is it possible that it is a panel with changeable settings like commission percentage, to be able to add or remove product categories, to put a filter system to prevent putting an article online if there are certain non-compliant words?\n10 - Is a marketplace technically stable and feasible? If so, how to make a marketplace? What are the tools, modules or functions to use to create a marketplace site on ZERONET (ZeroID? ...)?\n11 - How does an escrow system work?\n12 - How to implement it in a zite?\n\nZeroNet Security :\n13 - Is it possible for a zite to be closed by the government?\n14 - It seems to me that the Chinese firewall had blocked the p2p client communication port, but according to the new ZeroNet update the port changes randomly (One of the solutions was to use a fixed port (15441) that the client listens on a random port (10000-40000)), but does this risk still have value?\n15 - Can a user account be hacked? Knowing that he uses cryptography similar to Bitcoin.\n16 - Are there big security holes that could occur on a Zeronet site (roughly if user accounts could be hacked, if spying is possible and data recovery, if one or more people could close the site) despite the p2p system.\n17 - Is there any point in doing zite updates? Because it's very secure with blockchain and file cryptography.\n18 - What happens when someone hosts malicious content?",
			"added": 1528527788,
			"parent_topic_uri": "8_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"1_1JPHfhXRgUeBRv52nN9FfsdJ5jHrrzSTdt": 1,
		"2_1CwbqLCD6TdkinNNNb4GneZxbsoJ6Mw6oE": 1
	},
	"next_comment_id": 16,
	"comment": {
		"15_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 1,
				"body": "字数太多,实在看不下去",
				"added": 1526544343
			}
		],
		"2_1G9zSma9ku5MpqT26vFf95BEidzudtoSTr": [
			{
				"comment_id": 2,
				"body": "哈哈,原来是回答我好久之前我发的帖子,早重新注册了,谢谢回复",
				"added": 1526559748
			}
		],
		"37_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 3,
				"body": "5.21. chrome上有个浏览器插件\n失效了,国外也封zeronet吗?",
				"added": 1527041327
			}
		],
		"1_14WGRwSbM55c5DuiSCME94BTj6GozZ48op": [
			{
				"comment_id": 4,
				"body": "反正我用tor meek就没成功连上tracker过,反而不用有时候能连上",
				"added": 1527232960
			}
		],
		"5_1Np58q7bCfW7hmHuXvoYux3ij6M4Qecfb3": [
			{
				"comment_id": 5,
				"body": "> [aac](#comment_30_1Np58q7bCfW7hmHuXvoYux3ij6M4Qecfb3): 我试了，第二处没有js/ZeroBlog.coffee这个文件啊\n\n需要从@ysc3839 给的地址复制",
				"added": 1527588207
			}
		],
		"2_1Kg5fmwhQUHXLtjUawBdT76RXxKpGanufa": [
			{
				"comment_id": 6,
				"body": "谢谢分享你的经验",
				"added": 1527652958
			}
		],
		"3_1DmGsXFPPexxcuTRgYZxDRHqGA7CbR3j14": [
			{
				"comment_id": 7,
				"body": "> [milord](#comment_2_177TDrrkjmrrdbhGetuAoHbL4A6yFZqZjf): milord\n\n第一次屏蔽人,看看效果",
				"added": 1528014994
			}
		],
		"2_159WoHVCiWnZNsoAoP5y7SxCnXgAd29ANC": [],
		"186_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 10,
				"body": "> [sophy](#comment_10_1Kt5qA93xTpqsFRKGzm9tLWGSdjXgpRkxg): 我觉得这是个伪命题，有一定的事实，但是并不完全准确。1.逻辑思维是人天生具备的能力，在成年期发育完善。包括分析，综合，抽象，推理的能力。如果没有这个能力，生活中大多数事情你都做不成。2.学习科学就是对自变量和因变量之间的因果关系的认识，是一种严密的逻辑思维，如果一个人受高等教育，那么必然会受到逻辑思维的训练，科技发展又是国家的战略需要。不论你是否喜欢统治者，促进科学发展都是任何一个现代的统治集团的战略目标，如果需要科学研究，那么必将普及科学教育，也就必将使人受到逻辑思维的训练。3.你所谓的“没有逻辑思维”，大概是指没有独立思考的意识，这是一种意识形态，属于社会科学的范畴，逻辑思维只是意识形态的基础，其本身与逻辑思维的关系并不大。至于为什么会这样，首先我认为这是由于中国传统文化中的宗族式经济关系和生活方式的残留以及阶级分化造成的，加上社科教育会主动选择有利于统治者的部分。传统的宗族式生活方式是一种家族统治，长辈尤其是长辈中的男性统治着晚辈，并且要求晚辈忠实于长辈。这一文化，正在被资本主义的经济关系逐渐取代，但是仍然有残留，并且在经济不发达地区较严重。阶级分化，（怕查水表，暂时不敢谈了），后一条，很好理解，任何统治者需要在人民心中树立一个统治的理由，抹杀了社科的一部分科学性。这点在任何国家都一样，如果你说美国没有洗脑教育那就太naive了。不过任何健康人都拥有批判精神的生物学基础，你可以一定程度地发挥你的主观能动性，用科学的，批判性的眼光看问题并不算难，当然这也与你所处的外部环境有关。by the way，我说这些意在分析你的观点是否属实，而非要为某统治集团洗地，对于目前的他们，我认为他们是帝国主义，是反动统治，而且对他们抱有悲观态度，我支持的政治经济关系是共产主义，但绝不是披着社会主义皮的官僚政治和垄断资本主义并且同时鼓吹民族主义垃圾的统治，共产主义社会中不会有国家，政府和政党。\n\n共产主义不存在的,看看\"华西村\"就知道了,",
				"added": 1528859682
			},
			{
				"comment_id": 11,
				"body": "> [icedwatermelon14](#comment_71_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb): 现在的中国政府践行的是“中国特色社会主义理论体系”，当然不是“共产主义”了\n\n什么是共产主义,能讲解一下吗?",
				"added": 1529217919
			},
			{
				"comment_id": 12,
				"body": "> [icedwatermelon14](#comment_72_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb): 关于社会主义和共产主义的关系 [...]\n\n谢谢,辛苦了,打那么多字,",
				"added": 1529227511
			}
		],
		"5_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4": [
			{
				"comment_id": 13,
				"body": "> [zeroalpha](#comment_2_19g1RG1qjs55k9su9tKNx2UXFap4r5xihR): http://127.0.0.1:43110/Config  显示找不到页面\n\n需要更新到最新版",
				"added": 1532226655
			},
			{
				"comment_id": 14,
				"body": "看来zeronet离自动询问已知客户有没有需要的站点已经不远了",
				"added": 1532238345
			}
		],
		"1_1JPHfhXRgUeBRv52nN9FfsdJ5jHrrzSTdt": [
			{
				"comment_id": 15,
				"body": "@blurhy 来试试看啊?",
				"added": 1533717428
			}
		]
	},
	"comment_vote": {
		"91_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"38_1GmNNiSSZDvq7pd9ebng4EM9fnrkZxnHpt": 1,
		"23_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1
	}
}