{
	"title": "PowerOlive's Blog",
	"description": "PowerOlive's Own ZeroBlog.",
	"links": "- [Opennet Website](http://powerolive.tk)",
	"next_post_id": 16,
	"demo": false,
	"modified": 1504321527,
	"post": [
		{
			"post_id": 15,
			"title": "To prevent ask for trouble\nCleaning",
			"date_published": 1504321492.959,
			"body": "Blog post body"
		},
		{
			"post_id": 14,
			"title": "New blog post",
			"date_published": 1504321492.145,
			"body": "Blog post body"
		},
		{
			"post_id": 13,
			"title": "New blog post",
			"date_published": 1504321491.429,
			"body": "Blog post body"
		},
		{
			"post_id": 12,
			"title": "New blog post",
			"date_published": 1504321490.667,
			"body": "Blog post body"
		},
		{
			"post_id": 11,
			"title": "New blog post",
			"date_published": 1504321489.749,
			"body": "Blog post body"
		},
		{
			"post_id": 10,
			"title": "lxb",
			"date_published": 1501072686.689,
			"body": "[http://www.rfa.org/cantonese/liuxiaobo?encoding=simplified](http://www.rfa.org/cantonese/liuxiaobo?encoding=simplified)\n\n> yes\n> \n> lxb"
		},
		{
			"post_id": 9,
			"title": "a special man",
			"date_published": 1501072484,
			"body": "# [作家树 | 刺客贾敬龙](http://127.0.0.1:43110/mydf.bit/?Post:111:+%E4%BD%9C%E5%AE%B6%E6%A0%91+|+%E5%88%BA%E5%AE%A2%E8%B4%BE%E6%95%AC%E9%BE%99)\n\non Nov 15, 2016 · 15 分钟读完 \n\n> 河北没什么有趣的东西。“三年大变样”后，它也是一个庸俗的物质之城。它与河南山东贵州没什么区别，城市之梦终结在市中心的高价房上，那些闪闪发光的万达广场是蛮族的胜利。河北真正有意思的是“燕赵多慷慨之士”，出于或死于燕赵之地的勇士如星光点亮了历史。\n\n我在石家庄建华大街十字的汉庭酒店里见到贾敬龙的姐姐。和她坐在一起，有一种奇怪的感觉，就是这个时刻特别平淡，真的是特别平淡。闪亮的热水壶上面有环境的映象，一切都有井井有条。什么灾难都无法撼动日常生活的庸常。\n\n贾敬龙的姐姐穿着黑色的套头衫和运动鞋，两脚交叠在一起，一直都没有分开过。她学习成绩不错，考上了大学，学的是工商管理。他确实就像每个班里都会有的那种最安静顺从的女孩，说话声音细小。和两周前网络上的照片比较起来，她的脸颊和下巴像锥子一样连成一体，体重掉了很多。话音一落，她就扶一下眼镜，低下头体验着这种时刻的价值，这是走向死亡的时间。\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-1.jpg)\n\n贾敬龙像二姐一样，是一个害羞的孩子。甚至在家里，他的话都不多。有些事他会和二姐聊聊，但他的世界还是通过动物、植物、器物表现出来的。\n\n他养了一百多盆花。其中多数是彩色的仙人球、仙人掌、生石花、蟹爪兰这些多肉植物，也有数量不多的海棠等娇嫩贵气的花卉。这样的搭配，使照顾一百多盆花卉，不是一件承受不起的负担。周期性地照料不同性格的花卉，是养花人的乐趣。这在北高营村不是一件大事，却可以让人们为此记得他。到家里串门的村民们，看到这些漂亮的小东西，多少有点感动。他们为这个男孩的生活情趣所鼓舞，常常要带走一盆两盆。\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-2.jpg)\n\n这在中国家庭里并不少见。一个沉默的男孩，往往是家里最深情的那个孩子，营造着自己独特的世界。贾敬媛上大学后问贾敬龙：“你考不考大学？”\n\n“不考。家里哪有钱啊？”\n\n“那你自己想不想上？”\n\n“也不想，没意思。花了钱又花时间，出来还是找不到工作。不如早点出去打工，有点经验不见得比上大学差。”\n\n或许是年龄相近，他们两的看法往往一致。“我都后悔上学了。”\n\n父母那一套社会经验和空头说教，他们两都听不进去。90后、80后、70后的代际差异都难以调和。过去有用的，现在都没有用了。过去的坏事，现在也都成了好事。北高营村有些穷了几辈子的农民，现在都开始开奔驰了。但努力是没有用的，发财都不是努力干来的。过去有用的，现在一点用都没了。\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-3.jpg)\n\n“我打算趁年轻，干些最苦最累的活。只有这样才能存点钱。”贾敬龙在他拥有的选项里，选了一条适合自己的路。那时家里的房子还没拆，他把打工攒下的积蓄，在二楼做些装修、在屋顶修个阳光花园，他可以在他的世界里生活。\n\n某种程度上，全家人的感受是一致的，未来干什么都不清楚。他们是最后一代农民。但他们还不知道如何在城里生存。过去他们拥有土地，依靠土地生活。现在他们就待在房子里，依靠房子生活。土地上可以种庄稼，现在他们发现房子就是一种庄稼，他们站在庄稼上。\n\n现在很多农民觉得可以做这个，也可以做那个。到处都是干着奇怪行当的人：民间贷款、迁坟的、埋垃圾的、拉美风情园、新西兰教育体系。但贾敬龙和二姐却觉得什么也干不了。姐姐失业了。贾敬龙在院子里养了一地的花。父母有时候会说，现在比过去好多了。可他们感觉明天没了。他们没搭茬，他们不愿意和父母说这些。\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-4.jpg)\n\n上初中的时候，贾敬龙在市场了买了6只鸽子。鸽子下蛋后，他仔细照料，逐渐成了二十多只的鸽群。每天打开铁丝笼，这些鸽子就冲向天空，享受华北浩渺的天地中的自由，它们一直飞到滹沱河上，有时还沿着京珠高速公路，往鼎坚市场方向飞。太阳落山前，它们齐刷刷地回来，收好翅膀，点点头。家里的每个人都跟他提过啥时候吃鸽子肉啊？鸽子蛋也行啊？\n\n贾敬龙伸出食指放在两人中间说，“打住。”\n\n“鸽子蛋没事吧？”有时候二姐在饭桌上逗他。\n\n“你想吃你自己下吧。”\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-5.jpg)\n\n有一天，一只鸽子没回来。贾敬龙站在院子里搜寻着天空。二姐问他：“可能出现了什么情况？”\n\n“也许是被人打了。”\n\n“不会是飞丢了？”\n\n“不会。”\n\n两个人等了一会儿，然后再也没说什么。他们怀疑鸽子被别人打了。现在卖鸽子肉蛮赚钱。\n\n过了两天，这只鸽子飞回来了，它在屋顶上绕着圈，就是不下来。贾敬龙赶紧叫二姐来看，他们跟鸽子招着手：“来，来。”鸽子还是没下来。贾敬龙看到天空中还有另一只鸽子，他高兴地说：“你看，它谈恋爱了，那是它的爱人。”\n\n“那它还会回来吗？”\n\n“可能不会了。”\n\n这只鸽子和它的爱人间隔两天就回来一次，但两个星期后，终于还是消失了。\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-6.jpg)\n\n贾敬龙16岁就开始工作了。20岁在附近的药厂里当工人。上班时骑着一辆自行车，去南高营的华曙制药厂打工。这家企业日趋衰败，效益大幅下滑。实际上，它曾是河北最强的乡镇企业，是全球土霉素碱产量最大的药企。但这会儿，它已经濒临破产。原因是多方面的，与企业管理、医药市场、国际贸易、金融风暴都有关系。但更明显的原因是房地产价格暴涨。做什么项目都不如房地产开发赚得多。因此这个企业被南高营村委会持掌后，改组了领导班子，一门心思盼着企业倒闭，把地皮腾出来搞房地产开发。贾敬龙赶在这个时候上班，并不知道自己所在的地方有多不牢靠，他不知道掌控自己命运的努力有没有效果。\n\n有一天，上班路上，他的车胎爆了。他把自行车扔到路边的锁在一棵树上，打了一辆出租车，在厂门口下车时，恰好撞见了车间领导。领导特意跟工人们表扬了二十岁的贾敬龙：这小伙子可以，我看到的是一种精神，小伙子有一种轻物质利益，重原则的一种态度。可以。\n\n为了赚钱，贾敬龙选择最累的计件工资干，多劳多得，一天干10个小时，一个月能拿2000元。两年下来，他的手粗糙不堪，和七八十岁的老头差不多。二姐说：你哪能这么糟蹋自己啊？\n\n年轻就是资本啥意思？就是这意思。我的手还能长回来。现在把年轻这个资本多投点，老年的我就是年轻的我的资本家。\n\n这件事他做过头了，手一直都没长回来。当他成资本家时，他的手伸出来，会吓人一跳。\n\n在同龄人中，他的形象老气横秋。在他寥寥可数的几张照片上，他穿着打扮像个七十年代的人，老成、过时、没有个性。这是个认知偏差。在他自己看来，这可能是个优点：古典。在这个观念非常混乱的时代，古典是个真正特殊的性质。\n\n他养花、养鸽子、吃苦、尊重原则。和同龄人去爬山时，他不会讲段子、厌恶网络语、也没穿戴一套棒球帽和慢跑鞋。他没有一张自拍照。在那几张寥寥可数的照片上，他站的笔直，挺胸昂首，双手拄着棍子或背手而立，像是一个人被内在的纪律所要求，要表达自己要成为的人。看起来，那就是一个侠客。\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-7.jpg)\n\n二姐贾敬媛说，他看书不多，他写东西也不多，她都不知道他写诗。他的日记或诗作，已经在第二次拆迁中毁为废墟，当作工业垃圾被填埋在某处了。没有人知道他写了什么诗，或喜欢那种诗人，但他留下来了一首，曾贴在北高营村的回迁房的单元门上，将会令人震惊、令人羞愧：\n\n人生一世草一秋，卑躬屈膝男儿羞。既有舍身取义志，何惧此刻命将休。\n\n只剩下些再也无法接触贾敬龙的日子，我就在北高营村里蹓跶，感受他生活过的环境。后来我走进了鼎坚市场，找到了贾敬龙购买射钉枪的那家商铺。那里叫“钉子世界”，是一个幽幽暗暗的，充满机油、盒饭和底层社会气息的世界，掌柜和伙计话不多，任由我手里玩弄着一把射钉枪。他们这种冷冷的态度，好像能够与外面危险的世界划清界限。\n\n这是一把红色的一尺半长的射钉枪，在建筑装修行业里不足为奇，它以发射空包弹的火药作为动力，将射钉打入建筑体。击发时，应将射钉枪垂直压紧压在工作面上，才能工作。但网络上到处是改装射钉枪的图文教程，有些还加了消音器、折叠后托和固管套筒，直接让人联想到Ak47。这个工具在手里，你感觉就像是一个士兵而不是民工，说明书介绍说，射钉在飞离钉管时具有每秒500 米的动能。\n\n这个多少钱？\n\n130。\n\n春节那天贾敬龙把两把射钉枪放在六个核桃的包装盒里，混在人群中，心潮起伏。\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-8.jpg)\n\n我想这是一个错误，没人注意到贾敬龙是一个诗人。他父母当然不知道，他二姐也不知道，就连他的女朋友也不知道他是一个诗人。她只知道贾敬龙用一分钱纸币为新房叠了一块匾：我爱我家。她只知道贾敬龙用粗糙的双手陪她一起织十字绣。她只知道他对仙人球、鸽子、屋子有独特的感情，但大多数人们都不关心这个，也不看重情感这种人性了，人们干得是奇奇怪怪的事。\n\n贾敬龙打着方向盘逃离人群时，同时打了一个电话给前女友，他简短地告诉她：告诉你爸妈，我把何建华打死了，我去派出所自首。女友已经嫁了人，并且有了孩子。贾敬龙说完，就把电话扔掉了。他所说的意思，再清楚地表达一下是：世界上有因果，世界上有一些看不见的真理。\n\n这是一个安慰。\n\n他的另一个手机上，有一条未能成功发出的短信，每个字都像火一样灼烧着：我以颤抖激忿的心潮按下群发，以热泪感馈关心我之短信对方；狂野在报仇何建华的自首之路，心絮沸腾的坦然；在此紧仅的分秒钟，想对你的有且只能深鞠一个真挚的谢！斯是此生，愧报淡雅；蒙恩为酬，来世相馈。\n\n这是他的孤独。\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-9.jpg)\n\n一辆车撞上了他的车头，把他的红旗车挤在路边，他打开车门下来，走在北高营村的大地上，那是个新年，鞭炮声在萧瑟的平原上回响着，北高营的门楼上红旗飘飘，天空蓝的可爱。村民们拎着钢管，砸断了他的大腿。\n\n河北没什么有趣的东西。即便“三年大变样”后，它也是一个庸俗的物质之城。它与河南、山东、河北、贵州没什么区别，城市之梦终结在市中心的高价房上，那些闪闪发光的万达广场和其中的奢侈品，也许是蛮族的胜利。河北真正有意思的是“燕赵多慷慨之士”，赵云、张飞、在《史记刺客列传》里，两刺赵襄子的豫让，刺赵相累侠的聂政，刺赢政的荆轲，继荆轲之后，刺赢政的高渐离，都是出于或死于燕赵之地。\n\n这些勇士如星光点亮了历史，贾敬龙在计划刺杀的两年里，不可能不想到他的前辈们，尽管这个时代已经抛弃了勇士的价值。但“他们”正是他两年来住在一个没有花、没有狗、没有亲人的砖头垒成的床上，感受到的唯一温暖。\n\n河北今天是什么样子，以后就是什么样子，没什么真正的“大变样”，日常生活是机械无情的，人人都做着自己该做的事。\n\n贾敬龙做了他该做的，\n\n贾敬媛做了她该做的，\n\n律师和媒体做了他们该做的，\n\n看新闻的人做了他们该做的，\n\n删新闻的人也做了他们该做的，\n\n法院终于也做了他们该做的，\n\n今天，有一位朋友，把一颗子弹打到贾敬龙的脑袋里。\n\n这位朋友也做了他该做的事。\n\n这是一个普通的日子，\n\n除非我们看出了这一点。\n\n贾敬龙的第二首诗，是和这个普通生活告别的诗，这首诗如此精彩，以至于我们能够确认在他短短的生命里，热爱过诗歌，的确像诗人一样生活过：\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-10.jpg)\n\n```\n 今当刑离，半梦消断，一往无前。\n\n 纵万般洒脱，玉石莹莹，清白颠覆，自有堪堪。\n\n 绛河澄澈，皓月婵娟，思凝眸。\n\n 哀空残月，待憔悴，或余日无多，肝胆涅槃。\n\n 世间何其涟滟，常愁余放风倚阑看，念香花幽草，犹忆偏爱，蛐鸣蝶舞，览尽风姿。\n\n 一任孤掷，贾在高营，惟是泯仇愧泽酬。但已矣，恨有幸人来，泪与君别。\n```\n\n![](http://127.0.0.1:43110/mydf.bit/img/0-12.jpg)​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "mmm",
			"date_published": 1501070342.752,
			"body": "# [Contact](http://127.0.0.1:43110/domains4free.bit/?Post:5:Contact)\n\non May 28, 2016 [3](http://127.0.0.1:43110/domains4free.bit/#Like \"Like this post\")\n\nI'm switching from [ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/) to [Bitmessage](https://bitmessage.org/).\n\nZeroMail is a good solution for simple messaging, but if you need something more feature-rich, [Bitmessage](https://bitmessage.org/) is the way to go at the moment.\n\nSo, if you want to [register a bit domain for free](http://127.0.0.1:43110/domains4free.bit/?Post:2:Free+.bit+Domains+for+ZeroNet+Sites), request some free namecoins, or contact me for another reason, please send a [Bitmessage](https://bitmessage.org/) to:`BM-2cVddUzqe4DWCGorpXUXAUh2SwyD5S9ByU`\n\n# [Free Bit Domains](http://127.0.0.1:43110/domains4free.bit/?Post:2:Free+Bit+Domains)\n\non Apr 19, 2016 [· ](http://127.0.0.1:43110/domains4free.bit/?Post:2:Free+Bit+Domains#Comments)[ 55 comments](http://127.0.0.1:43110/domains4free.bit/?Post:2:Free+Bit+Domains#Comments) [27](http://127.0.0.1:43110/domains4free.bit/#Like \"Like this post\")\n\nRegistering a bit domain costs only around 0.02 namecoin ($0.008), so if you are to lazy or don't know how to register one for yourself, I will hook you up.\n\nJust send me a [Bitmessage](https://bitmessage.org/) with the following informations to: `BM-2cVddUzqe4DWCGorpXUXAUh2SwyD5S9ByU`\n\n*   Desired .bit domain (check [here](https://namecha.in/name/d/example) or [here](https://dotbit.me/) if it's available)\n    _Example: 0list.bit_\n\n*   Address of your ZeroNet site\n    _Example: 1Ajp75FXAxdTzRiRTpdBgd4exvbo4gMW12_\n\n*   Namecoin receive address (optional)\n    _If you want to be in full control over your bit domain, you need to generate a namecoin receive address with the [Namecoin client](https://www.namecoin.org/download), so I can transfer the domain to you. Please note: to manage, update, modify or renew your domain, you will need namecoins. I can send you some for free. Just let me know your receive address._\n\nIf you want to know how to register a domain by yourself, here are some links:\n\n*   [How can I register a .bit domain?](https://zeronet.readthedocs.org/en/latest/faq/#how-can-i-register-a-bit-domain)\n*   [Help for .bit domain support for zeronet](https://www.reddit.com/r/zeronet/comments/40bx87/help_for_bit_domain_support_for_zeronet/)\n\n--"
		},
		{
			"post_id": 7,
			"title": "zzz",
			"date_published": 1501070335.695,
			"body": "### 孙政才，从中共“明日之星”到政治牺牲品\n\n###### 储百亮 2017年7月24日\n\n![重庆市委书记孙政才突遭解职，可能正在接受调查。](https://static01.nyt.com/images/2017/07/22/world/22CHINA-Xi/22CHINA-Xi-articleLarge.jpg)\n\nWu Hong/European Pressphoto Agency\n\n重庆市委书记孙政才突遭解职，可能正在接受调查。\n\n*   [打印](https://cn.nytimes.com/china/20170724/china-xi-jinping-sun-zhengcai-chongqing-/print/)\n*   [转发](https://cn.nytimes.com/china/20170724/china-xi-jinping-sun-zhengcai-chongqing-/?utm_source=mostviewed-daily&utm_medium=cpc&utm_campaign=mostviewed#)\n*   [寄信给编辑](https://cn.nytimes.com/china/20170724/china-xi-jinping-sun-zhengcai-chongqing-/?utm_source=mostviewed-daily&utm_medium=cpc&utm_campaign=mostviewed#)\n*   [字号](https://cn.nytimes.com/china/20170724/china-xi-jinping-sun-zhengcai-chongqing-/?utm_source=mostviewed-daily&utm_medium=cpc&utm_campaign=mostviewed#)\n\n北京——所有的政治迹象似乎都表明，在中国共产党今年秋天召开的大会上，孙政才会晋升到国家最高级别的职位上去。\n\n他近期最为高调的职位是重庆市委书记，在[一起腐败和谋杀丑闻](http://www.nytimes.com/2012/05/07/world/asia/in-rise-and-fall-of-chinas-bo-xilai-a-ruthless-arc.html)之后，他被派往这个有3000多万人口的大型城市去清理当地的政府。去年，国家主席习近平曾在公开场合与他握手，并对他管辖下的重庆予以表扬。\n\n#### 相关文章\n\n*   [王岐山或超龄留任，为习近平铺路](https://cn.nytimes.com/china/20170303/xi-jinping-china-retirement-rules/ \"王岐山有望打破“七上八下”留任，为习近平铺路\")\n*   [习近平重提制定民法典](https://cn.nytimes.com/china/20170316/xi-jinping-legal-overhaul/ \"习近平重提制定民法典，欲重塑中国司法制度\")\n*   [习近平或推迟挑选继任者](https://cn.nytimes.com/china/20161008/china-president-xi-jinping-successor/ \"习近平或推迟挑选继任者，挑战中共集体领导规则\")\n*   [中纪委权力升级：“政治体检”](https://cn.nytimes.com/china/20161024/china-discipline-commission-political-loyalty/ \"中纪委权力升级：除了反腐，还有“政治体检”\")\n*   [中共十九大面临的四大挑战](https://cn.nytimes.com/opinion/20170607/deng-yuwen-19th-pc/ \"中共十九大面临的四大挑战  \")\n\n然而在今年的7月15日，他突然消失了。\n\n就在孙政才公开[誓言绝对效忠](http://cpc.people.com.cn/GB/http:/cpc.people.com.cn/n1/2017/0711/c64094-29397489.html \"Link: http://cpc.people.com.cn/GB/http:/cpc.people.com.cn/n1/2017/0711/c64094-29397489.html\")习近平、颂扬了习近平“高超的政治智慧”的五天内，孙政才被解除了职位，并接受调查，那以后便没有了音信，他的职业生涯终结在了称赞他的人手中。\n\n孙政才的突然倒台被认为是一种警告，表明习近平将用自己残酷无情的规则来进行领导人换届的政治游戏。\n\n“孙政才是个牺牲品，这是向全党发出的信息，”时事评论作家、曾在北京的清华大学担任政治学讲师的吴强说。“习近平已发出信号，他不被上一代领导人制定的晋升次序所约束。”\n\n中共发布的简短[公告](http://news.xinhuanet.com/renshi/2017-07/15/c_1121323538.htm)只是说，53岁的孙政才不再担任重庆市委书记。公告对解职未做任何解释，而且不祥的是，公告只字未提他的未来。自从被解除职位后，他的名字在中国官方媒体上一直没有出现过。\n\n接替他人是此前担任邻省贵州省委书记的[陈敏尔](http://www.chinavitae.com/biography/Chen_Miner%7C4309)，陈敏尔是习近平提拔起来的人，十多年前，他曾于浙江省在习近平手下工作。\n\n孙政才“只不过是错误的人出现在了在错误的地方”，在波士顿大学研究中国政党政治的教授傅士卓([Joseph Fewsmith](http://www.bu.edu/polisci/people/faculty/fewsmith/))说。“陈敏尔看来是习近平指望的那种能干事的人之一。”\n\n孙政才的倒台也展示了[中共巡视调查小组](http://cn.nytimes.com/china/20161024/china-discipline-commission-political-loyalty/)的权力，习近平一直在通过这种巡视调查来要求官员忠诚和遵守纪律。\n\n三位接近高级官员的人士表示，孙政才在被解职之前，已经在党内接受调查。这三位人中的两位表示，党内对孙政才被解职的解释没有明确给出具体的指控，只是说，调查人员发现他有“违纪行为”，这是一个含糊不清说法，可能意味着政治违规或腐败。由于担心讨论党内事务会让他们受到惩罚，这三人要求不具名。《华尔街日报》[率先报道了](https://www.wsj.com/articles/possible-successor-to-chinas-xi-jinping-is-dismissed-from-party-post-1500131243)孙政才接受调查的消息。\n\n据一份党报的编辑发给该报采编人员的内部备忘录，重庆的新闻媒体被告知停止使用孙政才主导该地区发展时用的口号。\n\n孙政才被解职似乎破坏了习近平的前任、特别是前总书记胡锦涛建立起来的精英层提拔的等级顺序。孙政才的晋升从来都不是一成不变的事情，但是，在胡锦涛退休前建立起来的等级顺序中，孙政才似乎准备好了在今年得到提升。\n\n加利福尼亚大学圣地亚哥分校21世纪中国研究中心主任谢淑丽([Susan L. Shirk](https://gps.ucsd.edu/faculty-directory/susan-shirk.html))说，“如果孙政才不但不被提升，反而实际上被打倒、被清除，这真的是一个表明不成文的领导人换届规则或规范没有得到遵守的迹象。”\n\n谢淑丽将此举视为在不受党内其他精英成员挑战的情况下，习近平“尽可能把权力集中到自己手里”的一种努力。\n\n“以前也有人被清除，腐败也一直是清除他们的借口，”她说。“但在习近平领导下，这种事情似乎更多了。”\n\n习近平还没有在公开场合提到这些做法，但他似乎正在采取措施，以确保政治局及其全权的常委会由对自己忠实的人主导。\n\n在今年秋天的党代会上，政治局的25名成员中至少有11人必须退休，除非不成文的退休年龄被放宽。这11人中包括政治局七名常委中的五人，政治局常委会是最核心的权力机构。\n\n拿掉孙政才促进了陈敏尔上升的仕途，陈敏尔长期以来一直与习近平关系密切，分析人士说。目前来看，虽然孙政才仍然是政治局委员，但陈敏尔很可能会在十九大上取代孙政才进入政治局。\n\n如果对孙政才的调查导致刑事指控的话，他会受到惩罚，如果他能设法捱过调查，他可能会得到一个不太重要的职位，或安静地退休。\n\n今年5月，习近平还把在浙江与自己有过密切工作关系的官员蔡奇安排为[北京市委书记](http://news.xinhuanet.com/politics/2017-05/27/c_1121047932.htm)，这份工作可能会让蔡奇进入政治局。习近平也换掉了上海的市委书记，这也是政治局层次的职位，研究中国高层政治的专家薄智跃说，他在新西兰惠灵顿经营一家咨询公司。\n\n“在十九大召开之前，习近平希望确保他在政治局这个级别上占有尽可能多的席位，”薄智跃说。“习近平的人级别都还太低，所以他正在把他们放到能进入政治局的合适职位上。”\n\n习近平也许会进一步改变不成文的年龄规定，让负责党内反腐和纪律工作的盟友王岐山超过目前的退休年龄上限继续留任，[一些党内知情者说](http://cn.nytimes.com/china/20170303/xi-jinping-china-retirement-rules/)，通常在党的代表大会召开时，年龄达到或超过68岁的领导干部会被要求退休。王岐山现已69岁。\n\n还有人猜测，习近平希望在2023年后继续掌权，届时他需要从已经当了两任的国家主席职位上退下来。没有任何正式文件限制党的总书记能担任多久。任何有关这方面的决定似乎仍很遥远。但是，习近平可能会通过[推迟指定自己继任者](http://cn.nytimes.com/china/20161008/china-president-xi-jinping-successor/)的方式来保留自己的各种选择。\n\n虽然尚不清楚孙政才倒台的具体原因，但党内调查人员曾在今年早些时候对他的政治可信度表示怀疑。\n\n孙政才是2012年底被派往重庆的。那年，重庆市前任党委书记薄熙来落马，相关腐败、谋杀和刑讯逼供等丑闻的曝光震惊了重庆。调查人员发现，薄熙来的妻子谷开来[谋杀了一名英国商人](https://cn.nytimes.com/china/20151215/c15gukailai/)，之后，盛气凌人的政客薄熙来被解除职位并被逮捕。薄熙来因腐败和滥用权力罪被判处无期徒刑。\n\n但是，虽然薄熙来的倒台给孙政才带来一个巨大的政治机遇，但那似乎也是孙政才失败的一个重要部分。党的巡查人员今年2月份发布的关于重庆的措辞严厉的报告说，在孙政才领导下，重庆还未采取足够措施来消除薄熙来及其前警察局长王立军的影响。该报告的提交者是习近平在浙江期间曾在其手下工作的[徐令义](http://www.china.com.cn/policy/txt/2008-10/31/content_16695443.htm)。\n\n据[中央纪律检查委员会的报告](http://www.ccdi.gov.cn/yw/201702/t20170213_93903.html \"Link: http://www.ccdi.gov.cn/yw/201702/t20170213_93903.html\")，徐令义对孙政才说，重庆有“党的领导弱化”的问题。徐令义还列举了重庆在其他方面的不足，包括对习近平的很多讲话学习得不够。“清除‘薄、王’思想遗毒不彻底。”\n\n任何政客在消除重庆对薄熙来的怀旧感上都会遇到困难。薄熙来仍深受许多民众的欢迎，他们喜欢他对犯罪活动的大力打击。但孙政才表示了懊悔。\n\n他在今年2月份[对重庆的官员](http://news.sina.com.cn/c/nd/2017-02-13/doc-ifyameqr7479001.shtml \"Link: http://news.sina.com.cn/c/nd/2017-02-13/doc-ifyameqr7479001.shtml\")说，“（巡视组）为我们敲响了警钟。”\n\n储百亮(Chris Buckley)是《纽约时报》驻京记者。\nAdam Wu对本文有研究贡献。\n翻译：Cindy Hao\n[点击查看本文英文版。](https://www.nytimes.com/2017/07/22/world/asia/china-xi-jinping-sun-zhengcai-chongqing-.html)\n\n本文内容版权归纽约时报公司所有，任何单位及个人未经许可，不得擅自转载或翻译。"
		},
		{
			"post_id": 6,
			"title": "yyy",
			"date_published": 1501070031.444,
			"body": "![ ](http://www.rfa.org/cantonese/commentaries/hsj/com0714-07142017105112.html/com-0714.png/@@images/26fc2be4-c109-4ae3-9690-4f87ca909cec.png \" \")\n\n[![](http://www.rfa.org/rfa_resources/graphics/icon-zoom.png)](http://www.rfa.org/cantonese/commentaries/hsj/com0714-07142017105112.html/com-0714.png?encoding=simplified \" \")\n\nMissing [flash player](http://get.adobe.com/flashplayer/) plugin. [Download audio file](http://www.rfa.org/cantonese/commentaries/hsj/com0714-07142017105112.html/COM.mp3).\n\n[![收听节目](http://www.rfa.org/rfa_resources/graphics/icon-listen.png \"收听节目\") ](http://www.rfa.org/cantonese/commentaries/hsj/com0714-07142017105112.html/COM.mp3?encoding=simplified)[![声音下载](http://www.rfa.org/rfa_resources/graphics/icon-download.png \"声音下载\")](http://www.rfa.org/cantonese/commentaries/hsj/com0714-07142017105112.html/COM.mp3/download.html?encoding=simplified)\n\n刘晓波先生昨天在中国警察的严密监视下驾鹤西去。刘先生是一位智者和勇士，是引领中国人民争取现代政治权利的先驱。在中国历史上，他是一位人格高尚的巍峨丰碑。那些迫害他、诋毁他的政客和帮凶，只不过是他脚下一撮撮肮脏的粪土。刘先生生前有许多成就，这些成就的绝大部分在他获得诺贝尔和平奖的时候已经体现在颁奖词中了，不用我在这里重复。今天我想说的是，刘先生在生命的最后一刻，仍然在用他的牺牲为这个世界做出最后的贡献。\n\n首先，刘先生用他生前最后的遭遇让世人知道当今的中国政府的本质。虽然中国官方的消息说，他没有死在监狱中，而是死在“保外就医”的医院中，但是我们都知道，直到生命的最后一刻，刘先生都没有得到自由；就连他提出的出国治病的要求也被残忍拒绝。刘先生是第二个死在不自由中的诺贝尔和平奖得主。德国卡尔·冯·奥西茨基(Carl von Ossietzky)在上个世纪三十年代被希特勒的纳粹党关押致死；而刘先生则在八十年之后被统治中国的共产党的关押致死。 \n\n同时，刘先生的逝去也告诉我们，中国政府、中国的执政党及其领袖是如何的怯弱。中国的经济体量已经名列世界第二，但是在经济变强的同时却有著一个色厉内荏的政府和执政党。他们的怯弱不仅表现在对已经病入膏肓的刘先生的严密防范，同时也表现在在刘先生逝世之后，进一步加大了对中国人权活动者们的监视和干扰。这种怯弱来自统治者在道德和正义力量面前的猥琐，对强大的人心和人性力量的恐惧。\n\n刘先生被关押至死的遭遇也再一次提醒世人中国人民的基本人权仍然被剥夺的基本事实。刘晓波为了争取这些权利多次被统治者投入监狱，而最后一次的牢狱之灾是因为他和国内其他的人权活动者们一道起草和签署了《零八宪章》。这个宪章所要求的权利仅仅是现代文明社会的公民应该享有的基本人权，而且中国现在的执政者也曾经在取得政权之前做过同样的承诺。执政者翻手为云覆手为雨，刘先生却为此付出了生命的代价。\n\n刘先生生命的最后岁月也再次展现了中国执政者的虚伪。任何了解中国政治规则的人都知道，关押刘先生直至死亡，这绝对是、也只能是中国最高层的决定。但是中国领导人却在国际社会的谴责面前佯装无辜，托词需要了解情况；明明是至死不让刘晓波获得自由，却强迫失去自由的家人向世界宣传中国政府的“善行”。这个世界上还有比这更加虚伪的吗？他们的虚伪源于邪恶，因为他们从一开始就知道他们的恶行是见不得人的，却顽固地“向恶而行”。 \n\n刘先生也用自己的生命告诫世人，要丢掉对丧失灵魂的精英和权贵们的幻想。在刘晓波深陷囹圄的这些年里，中国知识精英的主流一直保持著“聪明的沉默”，他们与统治者结成联盟，诋毁刘先生和他的人权事业；西方的政治经济势力也采取著“精明的策略”，继续与中国权贵眉来眼去，争相在中国的发展中分走一杯带血的汤羹；而关押刘晓波的凶手照样四处招摇，在世界各地被奉为上宾。刘晓波在病榻上苍白的病容与他们颟顸的粉面形成了令人痛心的对比。\n\n刘先生用自己的生命故事告诉中国的知识分子和中国人民，人民的事情需要靠人民解决，无法寄希望于将灵魂出卖给权力断了脊梁的那些精致利己的社会精英；中国的事情需要靠中国人来解决，不要指望西方的政客包打天下。对待蛮横的中国执政者，唯一的出路是集体的、持续的、多种形式的抗争。他们可以把一个刘先生抓进监狱，关押至死，但是中国的监狱最终将无法关住所有有良知的知识分子和强烈渴望自由的人民大众。"
		},
		{
			"post_id": 5,
			"title": "http://127.0.0.1:43110/bber.bit/",
			"date_published": 1501062345.322,
			"body": "[breakwall](http://127.0.0.1:43110/bber.bit/)"
		},
		{
			"post_id": 4,
			"title": "xxx",
			"date_published": 1501061840.064,
			"body": "# [一位高三学生观看《人民的名义》 写的影评](http://127.0.0.1:43110/1Fs7WUCJNJbQ6WELvbgk82DZ79fF9BeP14/a.html)\n\non Apr 23, 2017 · 10 分钟读完 [5](http://127.0.0.1:43110/mydf.bit/?Post:123#Like \"Like this post\")\n\n​​李元杉/文\n\n为什么我对《人民的名义》里的反派恨不起来呢？答案很简单——他们所犯的过错，并不全是个人的过错。如果换一个人处于他们的位置，很可能殊途同归。\n\n第二集里，现金堆满一座别墅的贪官，人赃俱获以后涕泪俱下说，自己从来不敢花受贿得来的钱。他的钱和别墅对改善生活水平没有丝毫帮助，反而给他带来极大的精神压力，每天惶惶不可终日。那我们不禁要问，一个拿了钱也不敢花的人，拿钱的目的是什么？\n\n与此形成对比的是，剧中的正派对于导致腐败的原因显得缺少深入的理解。\n\n抓到贪官以后，自带主角光环的反贪局长大义凛然：“中国农民那么倒霉，有你这么个坏儿子？！”这话说得的确解气。但仔细一想，中国出了那么多贪官，难道他们的父母都碰巧走了霉运？\n\n局长的强力后援——省委书记沙瑞金同志深入反思了工厂拆迁酿成群体事件的原因——干部腐败。然而腐败的原因是什么呢？这个问题沙书记不想回答，也不敢回答。\n\n这里，我们可以理解为电视剧要想播出，必须符合一定的尺度。但另一种解读是，这里的保留既展示了正派的局限性，也暗示了头痛医头、脚痛医脚的运动式反腐是无法治本的。导致腐败的本质原因是政治制度。在这个制度下，权力高度集中且不受监督。在政治上，权力决定谁可以晋升，谁不能晋升。在经济上，权力决定土地、资本和资源如何分配。这些现象在《人民的名义》中都有深入展现。易学习二十多年不能晋升，新来的省委书记去趟他家，立刻成了市长；土地拍卖由政府主持、权贵操纵；国企可以从国有银行贷款，而民企只能从城市银行和农村信用社贷款……\n\n这里，批判腐败的人自己就是绝对权力的拥有者。由这些“正面人物”来点出自身的症结，显然并不合理。而指望这些人来“刮骨疗毒”、“壮士断腕”，恐怕跟寄希望于出来个易学习当交通局长、吕州市长一样，属于一种多半落空的妄想。\n\n为什么反腐者反而不如贪官能够得到观众的同情？因为事实上，反腐者与腐败分子，同属拥有权力的特权阶层。据说这个阶层存在的目的是“为人民服务”，但人民对他们普遍感到畏惧、不信任，甚至鄙视。剧中以清正廉洁形象示人的反腐者不是出身权贵家庭，就是领导的秘书，要么就是得到了当权者的背书，这进一步增加了人民与他们的距离感。\n\n反观剧中的几个出身朴素的反派：赵德汉、祁同伟、高小琴，都是一些无权无势又追求升官、发财，想要“胜天半子”逆流而上的人。平心而论，他们的动机，恰好是大多数人民群众自己的动机。而反贪的动机，从实际层面讲是要避免“亡党亡国”，从理论高度说是要“从人民中来，到人民中去”，这些都离人民自己的想法相去甚远。\n\n腐败者来自于人民，而反腐者凌驾于人民。这就是《人民的名义》的现实之处，也是现实的荒诞之处。\n\n腐败的根源在于创租（Rent-creation）和寻租(Rent-seeking)。创租就是通过人为创造垄断地位，创造垄断利益。寻租就是为了获取这种垄断利益作出的努力。政府创造寻租的空间，而寻租者竞相争夺利益。这两者的关系来源于制度，不因制度中人的变化而改变。道理很简单：只要政府拥有着资源的分配权力，有能力赋予某个商人、某家企业垄断特权，一定会有若干商人和企业付出努力来争夺特权。只要上级决定着下级的升迁之路，一定会有若干官员付出努力来讨好上司。\n\n螳螂捕蝉，黄雀在后。制度的安排一日不变，权力的分配一日不变，打倒了明目张胆收钱的腐败分子，地位更高、权力更大的反腐者将以更隐蔽、更合法的方式落入创租–寻租循环。在这一过程中，人民并不一定能够得到切实的好处。“人民的名义”只是一面用来反腐的大旗，一个有名无实的名义。今天打起这面旗帜的人，可能正是明天的腐败者。对此，《人民的名义》仍有展现：警察分局局长程度为了维护自己的表弟滥用职权，被警局上司祁同伟以人民的名义斥责：\n\n而祁同伟自己勾结商人，大肆敛财，还涉嫌命案，眼看着要被反腐者以“人民的名义”绳之以法。类比地来看，如果不是某事件，很难想象“唱红打黑”的发起者，其实自己最黑。过去借用人民名义的人已经被证明背叛了人民，有理由相信今天身居高位的反腐者真的代表着人民吗？\n\n《人民的名义》除了拍政治斗争，还用了很多时间来拍大风厂工人的故事。据编剧说这是为了展现腐败对人民实际生活的影响，然而这一段剧情却再一次揭示了，对人民的福利来说，腐败者与反腐者都是一丘之貉。\n\n在腐败分子丁义珍当政期间，工厂股权未经持股工人同意就被收受好处的法官错判给了有后台的企业——山水集团。为此工人占领厂房，与拆迁队形成对峙。丁义诊逃跑，工厂对峙酿成大火，“人民的好公仆”——最近颇走红的李达康书记马上指示：用政府的钱赔偿工人，法院重审股权所有权问题。\n\n乍一看，出了一个青天大老爷给工人做主。但实际上这么做的唯一原因是，工厂工会主席碰巧有一个朋友是抗日老兵、退休的省检察长，而老检察长碰巧认识新上任的省委书记、李达康的顶头上司。如果没有老检察长一句话，李达康准备做的事是对工人来一个釜底抽薪，趁着工人放人进厂灭火，把工厂拆个干净。\n\n这件事的结局是，工厂没拆掉，政府花了一大笔钱，李达康同志派了一位孙区长来擦屁股。他自己成了老检察长和省委书记的政治盟友。孙区长既无能力也无意愿来找回花掉的四千五百万，更没有办法实现李达康许下的空头承诺：另找土地给工人重新建厂。于是工人的处境极其尴尬，只能翻窗户上下班，还有人走到了绑架勒索的违法行为边缘，最后还是因为惊动了省委书记沙瑞金，在高阶权力的驱动下，问题才得以缓解。\n\n表面上李达康是一个好官，但实际上除了不贪不腐（也有可能是贪腐尚未暴露），他的行为跟为所欲为的官员没有太大区别。未经民主集中，他就花掉政府四千五百万。二十年前为了集资修路逼死了一个人，没有受到任何处分，反而是队友替他背了黑锅。在吕州跟领导高育良不合，结果不但没被整，自己反而官升一级被调走成了市委书记。联想到他以前是时任省委书记的秘书，如果未来有一天他在政治斗争中落败，这些全都是达康同志大搞特权、独断专行的证据。\n\n说了这么多，我们发现：尽管所有人嘴里都说着“人民的名义”，《人民的名义》里其实没有一个官员是代表人民利益的。但是，这并不是什么坏事，反而体现了实际世界中的情况。宪法规定，“中华人民共和国一切权力属于人民”。然而代替人民实施这些权力的是政府，而政府是由人组成的。这些人的个人利益，必然在很多时候会与人民的利益产生冲突。\n\n腐败与人民利益的冲突，是所谓“委托-代理问题”(Principle-agent Problem)的一种体现。人民将权力委托给若干代理人实施，而代理人却并非完全为委托人的利益行事。有时候，他们完全是为了自己的利益行事。\n\n在“委托–代理问题”中，代理人权力越大，可能给委托人带来的损失就越大。而中国的高速发展，正得益于权力的高度集中，和所谓“国家能力”的强势。这使得中国政府能够“集中力量办大事”，并且以此为豪。然而赋予代理人强力的代价是，代理人利益与委托人利益的更大差别，以及委托人利益的更大损失。\n\n解决经济层面的“委托-代理问题”，有诸多方案。譬如建立对代理人的绩效考核制度；通过赋予代理人股权，将代理人与委托人的利益捆绑在一起；迫使代理人将自己的行为公开；建立官僚制度（Bureaucracy），规范代理人的行为等等。这些解决方案不可避免涉及到制度更迭：舆论监督、问责制、法治、民主……\n\n但如今的反腐者，并不愿意接受制度更迭，反而高喊“制度自信”。对此问题，他们的解答是，把腐败的代理人清除出去，留下“为人民服务”的代理人来垄断权力。这些人是“特殊材料”制成的，能够抵挡腐败的诱惑。这属于罔顾人性的空想。执政党将近一亿党员，有几个是“特殊材料”制成的？\n\n人民并不需要成天高喊“人民的名义”的干部。真正为人民利益行事的人始终是少数，何况他们有时也无法真正判断什么是符合人民利益的举动。人民需要的是干部必须依法行事、依规行事，而人民自己必须参与到法规的制定当中。因为能够为人民服务的，只有人民自己。\n\n（本文作者李元杉为某高三学生，墙内原文已被删）"
		},
		{
			"post_id": 3,
			"title": "Hello,PowerOlive(Oliver@zeroid)is back!!!!",
			"date_published": 1501061149.287,
			"body": "Hello\n\n> yes you are right! I am back!!\n> \n> >>>>>>>>>>>>>>>>>>>>>\n\n![none.png (0x0)](data/img/post_3_none.png)"
		},
		{
			"post_id": 2,
			"title": "PowerOlive",
			"date_published": 1485840093.826,
			"body": "PowerOlive's Blog Post Body."
		}
	]
}