{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1598827107,
			"title": "Research of ZeroNet",
			"body": "Hello, i need some reference articles to understand ZeroNet work Flow. for academic researches.",
			"added": 1598827106
		},
		{
			"topic_id": 1598912261,
			"title": "Some security questions",
			"body": "Hello, i have some questions.\n1. Is it possible to send invalid data? For example, can i submit date of  new topic at zeroNet to any time before implementation of zeroNet platform?, if i change source code of zero net or zerotalk? Why, If can not?\n2. Related to last question, can i use random function? Can i validate generated random number at other nodes? For example i have an random coin generator at a game and dont wanna they change coins manually. I know its not client-server, but i need a way. \nAt other example: imagine you have a random movement at a game and your clinet should be move base on this random movement.\n3. Can i make websocket connection between peers? Can i have peers ip by ZeroFrame.js?\n\nSry for my English and thank you.",
			"added": 1598912259
		},
		{
			"topic_id": 1598965770,
			"title": "hello, i got some errors on my zite",
			"body": "can you help me? im using unity game engine.\n1BkyaBHKaAkc9pNSFGQrTaubj6eH5ADHod",
			"added": 1598965767
		}
	],
	"topic_vote": {
		"1598827107_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": 1,
		"1598702443_1MHMCwf9oFtpghySVkhgaDi2ixhTgykSsF": 1,
		"1598893256_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a": 1,
		"1598912261_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": 1,
		"1599431538_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": 1,
		"1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1598827107_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 1,
				"body": "> [peppefail](#comment_56_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): zeromepro \n\n@zeromepro question is better than me. i need know how things work on zeroNet core?",
				"added": 1598866111
			}
		],
		"1598912261_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 2,
				"body": "> [anshorei](#comment_154_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): The only thing that is validated is ownership of data using bitcoin cryptography (i.e. did bitcoin address 1AddRESs sign this data? y/n) [...]\n\nthank you for the awesome answer.\nso, there is not any validation at ZeroTalk and i can send a new topic, before the ZeroTalk Creation. attention to the \"new\" topic word. im talking about new data with new address, not changing data. new data has new address and i am submitting invalid date Time. then i have new address and valid bit address. at this example. im not changing other people data.",
				"added": 1598951036
			},
			{
				"comment_id": 3,
				"body": "> [driud](#comment_115_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Interesting question?Interesting answer.Can it be damaged, harmed, or modified badly?For the user.And the user won't notice it?.Ciekawe pytanie ?Ciekawa odpowiedź.Czy można To uszkodzić, zaszkodzić, źle zmodyfikować?Dla użytkownika.I użytkownik tego nie zauważy?\n\naround my researches about ZeroNet.\ni think it is possible, if developer of zite not attention to validating data that are coming from other people and you should block that zite. in other side, bad access to data and your resources (like mining or writing Trojan) not allowed from ZeroNet Core. you should use ZeroNet from main source to protect your self from bad changes on core.\nim not sure about Trojans :/\nit is my question too. but i am developer and i want know about protecting zite and users.\nhackers discovering new ways, every days.",
				"added": 1598951798
			}
		],
		"1598965770_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 4,
				"body": "> [anshorei](#comment_158_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): wasm \n\nthe code is build of unity engine and i am only edited index.html base on https://github.com/HelloZeroNet/ZeroNet/issues/1237",
				"added": 1598980733
			},
			{
				"comment_id": 5,
				"body": "> [kapec](#comment_46_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I'll try to seed it as soon as I'm able to connect.\n\nthank you",
				"added": 1599046213
			},
			{
				"comment_id": 6,
				"body": "> [kapec](#comment_48_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Here are some zites that got \"unity webgl\" to work.Maybe this would help [...]\n\nthey are old projects on old versions of unity. i have not UnityLoader.js and ... at this build .",
				"added": 1599144054
			}
		],
		"1599385493_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [],
		"1599431538_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 8,
				"body": "I can create a blog to help about styles, if you want.",
				"added": 1599431795
			},
			{
				"comment_id": 9,
				"body": "Thank you, now it is clloneable.",
				"added": 1599491127
			},
			{
				"comment_id": 10,
				"body": "> [lavaphox](#comment_41_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): not bad yeah, buut i guess theres way too many different elements like: gradient, rounded corners, big shadows, transparency that doesnt fit together, that animation i like at bottom buut for long time use i guess its gonna take reading focus away. all and all its good to see something different :)\n\nThank you",
				"added": 1600013660
			}
		],
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [
			{
				"comment_id": 11,
				"body": "How can i start learning concepts of and app development on IPFS. Is it development platform and libraries?",
				"added": 1600015167
			}
		],
		"1600031682_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 12,
				"body": "> [swashbuckler](#comment_41_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): What do you mean by 'most zites are closed'? Probably there are no trackers available?\n\nNo when i am open target zite. I see \"this zite closed\" message.",
				"added": 1600033758
			},
			{
				"comment_id": 13,
				"body": "> [swashbuckler](#comment_42_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Can you give example links?\n\nOk i deleted them, i will mention you here if i found them again",
				"added": 1600034376
			}
		],
		"1600158515_1JSiiS2nVVHx65snyUci3MJhnB2e1jPVZy": [],
		"1600200644_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [],
		"1600417633_14DD49E4i7XTVfi8WqSuV47Nuo1T66etmP": [],
		"1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 20,
				"body": "> [claude](#comment_11_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): \"ZeroNet should censor content I personally don't like by default\" [...]\n\nYes this is big problem, and governments not supporting ZeroNet. \nIdea 1: this blacklist or filter list can be work by votes from peaple, peaple know about what is bad for child's and in other side, website owners has biggest vote. But the problem is security of the list. \nidea 2 : ZeroNet owners can handle this list because they are controlling current blacklist plugin. And they are only checking websites that peaple voting.\nIdea 3 : each ZeroNet client can define content controller service before Hello page. for example we have government content controller service, ZeroNet Content Controller service and peaple made controller service. So, the user can choose one of them to continue browsing zites.\nThere is many other ways.  They can fix problem if they talk about that. ZeroNet is free to use in any way, but should be controlled on default settings. Like some websites that asking peaple are you +18 and how old are you, for example.",
				"added": 1600470994
			},
			{
				"comment_id": 22,
				"body": "> [nekololi](#comment_490_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): can the child, if they choose to do so, disable this plugin of yours and proceed to browse zeronet without its protection?\n\nA child can open por. websites at internet. But they should not open. the problem is showing that Content at main page of ZeroSites.",
				"added": 1600498814
			},
			{
				"comment_id": 23,
				"body": "> [xcape2net](#comment_789_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): You shouldn't be inviting kids onto ZeroNet.  It was not designed to protect them.  It was designed to be a free speech platform.  You're asking for a censorship plugin for a free speech platform .  It doesn't make sense. You may as well be asking for a screen door for your submarine.\n\nYes , im not invite them. Never. But i dont know, who's i am speaking with them. Forums not safe but a forum that made for childs can help to protect new users of ZeroNet. I dont know what happen if a child disable protection plugin. But i know this protection not for you. Any one can speak free.",
				"added": 1600499147
			},
			{
				"comment_id": 24,
				"body": "> [kaffie](#comment_1156_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Letting the internet parent your child is a bad idea. There's NO way to lock someone out, if they have physical access to the computer. With enough time, knowledge, and patience you can get through any security measure you might want to put in place. [...]\n\n🤔👍Then childs should not never join ZeroNet or any P2P network.",
				"added": 1600499758
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 21,
				"body": "Please attention to this topic http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S/How+to+request+a+plugin",
				"added": 1600471105
			}
		]
	},
	"comment_vote": {
		"323_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"47_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"154_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"115_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"156_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"46_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1137_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"41_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"8_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1
	}
}