{
	"title": "ekaterina@blog",
	"description": "My blog about ZeroNet development",
	"links": "[Personal blog](/15YnwLhTxf5yTxXfF2KV2QS9cGjoyfLgbC)\n\n[ekaterina@ZeroMe](/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD/ekaterina@zeroid.bit)\n\n# My projects\n- [ZeroQuotes](/1NJyPoPpL8At17T6G7A1qHVQdqZDBmXcLT)\n- [ZeroTodos](/1B8LmXYHzMGZzcRWoidAQb5SmKSyfjN63f)\n- [ZeroPolls](/ZeroPolls.bit)\n\n---\n\n# Like what I do?\n\nDonate with Bitcoin\n\n`1BNAMsLPjvXFLzaFNfXorcVtsnNqbS7baM`\n\n![QR](data/img/bitcoin-qr.png)",
	"next_post_id": 30,
	"demo": false,
	"modified": 1508314250,
	"post": [
		{
			"post_id": 29,
			"title": "The first ZeroNet website created with ZeroDart!",
			"date_published": 1508313561.6,
			"body": "I haven’t finished implementing all of ZeroNet’s API yet, but enough to show off the first AngularDart ZeroNet website written in the Dart programming language using ZeroDart: [http://127.0.0.1:43110/1MmNzppieddSqYd5cmk7kVKcYKYBxF2wQ](http://127.0.0.1:43110/1MmNzppieddSqYd5cmk7kVKcYKYBxF2wQ)\n\n![angular_example_release.png (611x366)](data/img/post_29_angular_example_release.png)\n\n(If the site doesn’t load for you, try again later, there might be no compatible peers yet who can serve the site to you)\n\nYou can login with your @zeroid.bit ID, add tasks to your todo list, and save the list to ZeroNet (encrypted of course, using ZeroNet’s elliptic curve encryption). Saving is manual, the save button will get enabled when you make changes and are logged in, but loading tasks is automatic when you open the site.\n\n**This is just an example app, so don’t rely on it**, there are probably bugs galore and data you enter might get deleted at any time when I change stuff. If you want a fully featured ZeroNet Todo list that you can actually use, check out my [ZeroTodos](http://127.0.0.1:43110/1B8LmXYHzMGZzcRWoidAQb5SmKSyfjN63f/) project.\n\nAnd here is how it all works (warning, this is where it gets very technical, boring for anyone who isn’t interested in using ZeroDart). This might still change as I learn more and improve things, but so far it works really well:\n\n* * *\n\n![fourlayers.png (232x232)](data/img/post_29_fourlayers.png)\n\nThere are basically four layers of abstraction to make ZeroDart as easy as possible to use for someone who wants to use it for their own ZeroNet sites.\n\nThe first layer is ZeroFrame.js, which is ZeroNet’s official helper class to communicate with the ZeroNet API from JavaScript. It should be replaceable with a newer version when nofish releases one without having to change any of the Dart code. One caveat though, you have to run the new version through BabelJS to make it compatible with ES5 since Dart doesn’t seem to support ES6 classes yet. Not a big deal though, you can do it directly on the Babel website, no need to even install anything and you probably will never update the file anyhow.\n\nOn top of that is the second layer, ZeroFrameExtension.js. Dart’s JavaScript interop cannot subclass JavaScript classes right now (Google said they’ll add that feature if there is enough demand), so I’m subclassing ZeroFrame in JavaScript instead and just register callbacks for the methods you are supposed to override in your own site’s class, which are then turned back into methods you can override in Dart.\n\nThe next layer is zeroframe.dart. It takes care of all the complex Dart to JavaScript interop so you don’t have to touch any of that stuff yourself. It also documents the whole ZeroNet API. At some point, I’m not done with that yet of course but I have started and I can tell you it’s awesome to see all the relevant information right in your IDE so you never need to ask yourself what something does, you can just see it right there when you hover with your mouse cursor over it.\n\nThe last layer is zerodart.dart, which exposes the ZeroDart class. This is the layer and the class you actually work with, all of the prior layers are just implementation details you don’t need to care about. It works like ZeroFrame + JavaScript works normally, you just subclass it and override `onRequest()`. `onOpenWebsocket()` and `onCloseWebsocket()` to handle all of the messages the ZeroNet API sends you and then add your own methods to your subclass to do everything else your site needs to do.\n\nTo send messages to ZeroNet yourself, you use the `cmd()` method of ZeroDart (which works just like the original ZeroFrame.js cmd method), but you will rarely have to because I’ve added convenience methods that will make everything a bit easier and also adds documentation for all the API commands. But you can still use it if my convenience methods don’t cover your particular use case yet, or if a new API call was just released by nofish and you want to use it right away.\n\nThe example application bundled with ZeroDart is the ToDo list app from the beginning of this blog post. While it doesn’t fit ZeroNet perfectly, a chat like ZeroNet’s official tutorial might be better there, it’s what AngularDart developers will be most familiar with to base their own sites on since it is the official AngularDart template (minus the ZeroNet specific features of course).\n\nSo I’m just going to write tutorials on how to change the ToDo list app into a chat or a blog for example :) It’s probably an easier progression this way too, since the ToDo app doesn’t need to use the SQL database, but the chat does. Since everything is in components, this should work great. You can just delete the TodoListComponent but keep for example the LoginComponent, which handles login/change user/logout for ZeroNet so you don’t have to rewrite that code. I’m going to add more components like that over time which let you easily add common ZeroNet functionality to your site, without you having to reinvent the wheel.\n\nYou don’t have to use AngularDart with ZeroDart, you can use any (or no) framework with it, but I chose AngularDart because it is the recommended one to use since it was specifically made for Dart. But I wrote ZeroDart without Angular and only built Angular on top of it once it was working, so it doesn’t depend on it at all.\n\nIn the ToDo app, the way it works is that I use ZeroDart as the superclass of a ZeroNetService class, which gets instantiated in the Angular bootstrap call as an Angular service so that it is available in all components and services but is only instantiated once. You could also just use the top level AppComponent class and make it subclass ZeroDart, but Google recommends to use services for anything non-trivial and for this template I did of course want to use best practices.\n\nThe resulting app, which includes the Dart programming language, Angular with Material Design, over 900 Material Design icons in 6 different formats to support all browsers, is a whopping 1.7 Mb. ZeroNet sites work offline so it doesn’t really matter that much, it doesn’t impact latency like it does on the clearnet, but I still wanted to do better so I used ZeroNet’s new (at least new to me) [compressed sites feature](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:105:New+version+0.5.3). Basically, all you need to do is Zip your site. Done. No need to change any code! Nofish programming level: Godlike. And this gets the size down from 1.7 Mb to…. 543 Kb! Less than one third of the original size. So the compressed site feature is really neat for AngularDart sites :)\n\nAs for ZeroDart itself, still no ETA for the release yet. But as you can see it works, so it won’t be too long now. I’ll add the rest of ZeroNet’s API, clean everything up and then it’ll be ready for the first release. I thought it might be better to write a real app with it first to make sure the design is sound and everything works fine, but realistically it won’t anyhow, I’m still learning Dart after all, so fuck it, we’ll do it live!"
		},
		{
			"post_id": 28,
			"title": "ZeroNet API support for Dart is taking shape!",
			"date_published": 1507903888.3,
			"body": "As you might have seen on ZeroMe, I've been working on ZeroNet support for Google's Dart programming language (I call it... ZeroDart! I'm soooo creative) for a few days now while I learn Dart and get familiar again with ZeroNet's API (I thought why not do both, so I did).\n\nGot it working with the more comfortable to use **await / async futures** now instead of the callbacks ZeroFrame.js uses, but it still uses the normal ZeroFrame.js behind the scenes, so if there is a new version of that it can just be replaced without having to modify the Dart code.\n\n![zerodart.png (633x494)](data/img/post_28_zerodart.png)\n\nI've started adding convenience methods like siteInfo() and fileWrite() so you don't have to call `cmd(\"siteInfo\", {}, callback)` yourself (JSON and Base64 encoding is also done automatically where appropriate), which also means the commands now have documentation inside of the IDE, so you won't really need to read the ZeroNet API docs anymore in most cases and can just learn by doing.\n\nOnce I got everything working, no ETA yet, I plan to just publish a ZeroNet site with the AngularDart template. It's a ToDo list example app using material design components that make it easy to create sites that work well on both desktop and mobile (see screenshot below) and added ZeroNet functionality, like logging in and saving and loading to and from ZeroNet. Then anyone can just clone and modify the site to start super easily with developing ZeroNet sites with Dart and Angular.\n\n![angulardart.png (652x377)](data/img/post_28_angulardart.png)\n\nThere are probably not many people interested in Dart right now, but it's the future of mobile development for Google devices, so it'll get popular eventually :) It's supposedly already a better way to develop for Android (still alpha though) since it not only works on both Android and iOS but also compiles to native code, it doesn't go through a VM like Java/Kotlin does on Android so it's faster in some cases, and it'll be the main language of Google's next operating system, FuchsiaOS.\n\nBefore anyone asks, I don't know yet if I'll \"switch\" to Dart and Angular and convert all my old sites from CoffeeScript+Vue.js to AngularDart, right now I'm just trying it out and see how it compares. If it's a lot better then sure, I'll switch."
		},
		{
			"post_id": 27,
			"title": "It’s been a loooong time…",
			"date_published": 1507197262.8,
			"body": "Obligatory Portal 2 reference: https://www.youtube.com/watch?v=tax4e4hBBZc\n\nTo the people who knew me before I went AWOL for a year:\n\nFirst of all, sorry for suddenly vanishing without a word. Anxiety got the better of me, so instead of doing the right thing and saying I’ll be gone for a while I vanished like a coward. So I’ll just say it outright: I royally fucked up, no excuses. Feel free to call me names for it, I won’t hold it against anyone since it is well deserved. I just ask for the names to at least be creative so that other people reading them can have some fun too.\n\nSaying something wouldn’t have changed much however, health problems made it impossible for me to continue working on my ZeroNet projects, or anything really, for a long time. My condition effects my brain, I can’t think straight for days until I can again for a few days, like being completely drunk for days on end, so the time I can spend productively is limited as you can imagine. Had to move back in with my parents, I live in a different city now, but at least the internet is better here. My condition hasn’t really gotten better, just different, despite dozens of visits to doctors, but I’m starting to get back on track despite the situation.\n\nI still love ZeroNet and still strongly believe fighting censorship is a fight worth fighting at almost all costs and decentralization is the way to do it, especially now where censorship is on the rise again all around the world, so here I am again.\n\nI’m not going to go into too much detail of what exactly happened, because as you know if you’ve followed me before on ZeroNet, I’m here anonymously and want to remain that way as long as I can.\n\nI won’t be able to be as active as I was before, and I’ll likely need some time to get reacquainted with the source code of my ZeroNet sites, especially the SQL parts which I still hate passionately, and there are probably lots of new ZeroNet features I need to learn, but once I’ve managed to do that there’ll be new updates to my current projects and new projects for sure.\n\nAnd please don’t see this post as me fishing for sympathy due to my medical situation, I’m not and I don’t want it, if it were up to me I’d say this is the first and the last time it is even mentioned, I just feel I owe it to people to try to explain at least a little bit of why I was away for so long, as much as I can without risking my anonymity, and why going forward I might be unavailable for a few days every now and then when my condition kicks in again too hard.\n\nAlso, a big thanks to whoever paid the fee to keep the ZeroPolls namecoin domain running in my absence. I said before I so rudely vanished that’s why I don’t like the idea of using domains, and instead prefer using just the hashes. If someone hadn’t kept the domain registered, all of the ZeroPolls.bit links people shared would have stopped working in my absence, while the hashes just keep working forever, so they are way better in my opinion.\n\nAlright, I think that’s it for now. Oh, one more thing… You won’t believe how sad I am that I missed the launch of ZeroMe. I was looking forward to that so much T_T.\n\nPS: I posted this to both of my blogs just so people see I’m back, just so you aren’t confused if you follow both blogs, if anyone still is."
		},
		{
			"post_id": 26,
			"title": "ZeroPolls - A bunch of small improvements",
			"date_published": 1459417488.5,
			"body": "My todo list oracle told me to work on a bunch of small improvements instead of one big feature for this update, to get my ZeroPolls todo list down from 19 to \"just\" 14 tasks ;)\n\n- Raised the default data limit to 100kb, comments and quoting comments use up a lot of data!\n- New checkbox to follow comments on polls you created in your newsfeed\n- Statistics now also show the number of users (this is the actual number of users, not the number of peers, who have voted, commented or created a poll)\n- [Bugfix] Links in comments didn't turn into clickable links\n- [Bugfix] When opening ZeroPolls for the first time, no polls were displayed\n- [Bugfix] When not logged in, no new polls were loaded in real time "
		},
		{
			"post_id": 25,
			"title": "ZeroPolls - 102%? It's a scam!",
			"date_published": 1459277287.8,
			"body": "Looks like people finally found out that sometimes the percentages shown in ZeroPolls add up to 101, 102 and sometimes even 103%!\n\n[ZeroPolls: Have you noticed that the percentages often add up to 101% or 102%?](/ZeroPolls.bit/?Poll:2-1KkMG9dp4HYwhmjGZJYgUcKS3aV1AmfxYq)\n\nIf you look back at the first blog post announcing ZeroPolls, that was actually a known issue, I just didn't know how to best solve it. It's not that these values are incorrect, they are just inaccurate due to rounding the numbers. That's how mathematicians say \"It's a feature, not a bug!\" I believe. Although to me math is something that would only happen to people in a dark alley. Not that I don't like math, it just doesn't like me. And I'm no stalker so I just leave it alone.\n\nAnyhow, after seeing this poll I Googled the issue and found out that there is a very common method to solve this problem (I should have Googled it before). It's called the [Largest Remainder Method](http://stackoverflow.com/a/13483710) and is used for political votes on TV and stuff like that. I've now implemented this method and use it for ZeroPolls in this new update. So from now on, all the percentages should add up to exactly 100% (and my tests show that this is the case).\n\nIt's still not 100% accurate of course, the only way to do that would be by showing an infinite amount of numbers after the decimal point ;) But this is the best that can be done I believe and now it doesn't look so wrong anymore.\n\nIf you want to use my CoffeeScript implementation of this method for your own projects (or want to see if I made some horrible mistake), here it is:\n\n---\n\n```\n# Largest Remainder Method for percentages\n# Takes an array of numbers and returns an array of percentages\nlrmPercentages = (values) ->\n    total = values.reduce (a, b) -> a + b\n    rounded_values = []\n    for val in values\n        rounded_values.push Math.floor(percentage(val, total))\n    remainder = 100 - rounded_values.reduce (a, b) -> a + b\n    values_map = rounded_values.map (val, i) ->\n        {index: i, value: val, remainder: percentage(values[i], total) - val}\n\n    # sort by highest remainder value\n    values_map.sort (a, b) -> b.remainder - a.remainder\n\n    # distribute remainder onto values\n    for i in [0...remainder]\n        values_map[i].value += 1\n\n    # sort by original order\n    values_map.sort (a, b) -> a.index - b.index\n\n    # remove object index\n    values_map.map (val) -> val.value\n```"
		},
		{
			"post_id": 24,
			"title": "ZeroPolls - Replies and Quotes",
			"date_published": 1459022680.8,
			"body": "Since you can now be notified of username mentions, I made it easier to mention users. You can now click on usernames in comments to reply without having to type the username yourself.\n\nI tried to make it a bit intelligent (yes this is basically Skynet, RUN!). If you already started writing a comment and click on a username, @username is appended to your comment. If you click on the latest comment's username, @username: is inserted as your comment so you can start writing your comment after the colon (doesn't make sense to quote the latest comment as it appears right below your new comment).\n\nIf you click on any other than the latest comment's username and you haven't written anything in the comment box yet, the comment is quoted. Works and looks pretty much like quoting on ZeroTalk, with clickable usernames to jump directly to the comment that was quoted, and with quotes inside quotes removed so there is no quoteception.\n\nIt probably sounds a lot more complicated than it is, just try it out. Basically the idea is that you don't even have to think about this, just click on a username of a comment and ZeroPolls does the right thing for you in any situation. Even your cursor/caret moves into the right position so you can start typing right away ;)\n\nAs always, if you notice any problems comment here and I'll fix it ;)"
		},
		{
			"post_id": 23,
			"title": "ZeroPolls - Follow in Newsfeed",
			"date_published": 1458939956.1,
			"body": "Can't get enough of polls? Did you ever want to be able to see new polls show up in your Newsfeed? No? Well, now you can do it anyhow!\n\nAnd also, probably going to be much more popular, follow username mentions!\n\n![ZeroPolls Follow](data/img/zeropolls_follow.png)\n\nYou can choose what to follow on the main [ZeroPolls](/ZeroPolls.bit) page at the top, it's not shown on poll pages.\n\nFeel free to try out mentioning usernames in this hidden poll where I already did my own testing of the new feature ;) You can mention your own username with @username to try it out, that's what I did. [ZeroPolls: Trying out following polls](/ZeroPolls.bit/?Poll:30-1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD)"
		},
		{
			"post_id": 22,
			"title": "ZeroPolls - Infinite Scrolling",
			"date_published": 1458810416.7,
			"body": "Coffee goes in, update comes out. You can't explain that!\n\nThe main thing in this update is infinite scrolling, since we're closing in on 100 polls now it was needed. Now only 25 polls will be loaded when you open the site (and only one when you open a poll directly of course). Scrolling down loads 25 more when you scroll near the bottom of the site. This should make everything a bit faster. In Chrome the site is already as fast as it can probably be, but Firefox/Tor Browser for some reason is at least 10 times slower, so there you will see the most speed gain. When a new vote from another user comes in you still see the site getting locked up for a second or two, that isn't faster now at all, which leads me to believe it is actually ZeroNet recreating the SQLite database that is taking so long, have to investigate further.\n\nAlso:\n\n- Clicking on \"3 comments\" on a poll now brings you to the comments\n- The poll question now has a tooltip showing you how long ago it was created\n- You can now also see how many comments were submitted on the site overall\n- Small design fix, the grey bar at the bottom of polls is now always the same height\n\nAdding infinite scrolling meant making a lot of changes, I've tested everything thoroughly but if you notice something doesn't work anymore, just scream at me in the comments (and also state what browser you are using, including the version number) and I will fix it ;)\n\nIf you're using Apple's Safari and something doesn't work you're sadly out of luck for now, I don't have a Mac and Apple seems to have discontinued Safari on Windows so I can't test my sites on Safari. I do plan to buy a cheap (for a Mac, by [insert deity of your choice] it is not cheap) Mac Mini or Macbook Air in a few months though, already laid aside about €600, feel free to donate some money if you can't bear to wait any longer ;) And yes, yes, PCs are much cheaper and faster, PC Master Race and all that, but for web development it makes sense to buy a Mac since then I can install Linux, Windows and OS X and test everything everywhere. And I'm going nowhere near a hackintosh, I'm way too paranoid for that. Apple will surely lock me up and force me to say Android is a cheap knockoff."
		},
		{
			"post_id": 21,
			"title": "A new blog because why not they're free",
			"date_published": 1458086867.3,
			"body": "I started a second blog for my personal thoughts. Feel free to follow it or not, that's why it's a second blog, to give you a choice by keeping my blog posts about my ZeroNet sites separate ;)\n\n[My personal blog](/15YnwLhTxf5yTxXfF2KV2QS9cGjoyfLgbC/?Post:2:A+new+blog+because+why+not+they%27re+free)\n\nIf the link doesn't work for you, give it some time until it has a few more peers, the link is also in the sidebar."
		},
		{
			"post_id": 20,
			"title": "ZeroPolls - Comments",
			"date_published": 1457839817.5,
			"body": "I've just added comments to polls, with Markdown support which you are probably familiar with by now from ZeroTalk and ZeroBlog. HTML is disabled and so are embedded images, for security reasons. Other than that, go nuts.\n\nYou can't reply to people yet or follow comments/replies in your newsfeed like you can do on ZeroTalk, I will probably add that in a later update once I've figured out how that works.\n\nI've also added a new sorting button that lets you sort the list of polls by most comments. The number of comments on a poll is only shown if there actually is a comment yet, I thought it looked better this way, less cluttered, and lets you easier see if there are comments or not.\n\nThe only comments right now (at the time of this writing) are here if you want to check out how it looks: [ZeroPolls: Best Back to the Future movie](/ZeroPolls.bit/?Poll:25-1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD)\n\nAs always, please report any potential bugs you find here or send me a ZeroMail."
		},
		{
			"post_id": 19,
			"title": "ZeroPolls - Hiding polls",
			"date_published": 1457776577.6,
			"body": "Just released a small update which lets you quickly and temporarily hide polls you already voted on to find more polls to vote on. The polls you voted on in this session are still displayed so that you can see the results after voting. Your session ends once you reload the site or click on a link.\n\nWhen you create a poll you can now also check a new checkbox to hide the poll from the recent / popular polls list. Only you can see it there (try logging out to see how it vanishes from the list), other than that people will only see it when you give them the direct link to the poll.\n\nThe poll can still be seen in the site's data.json files and in the SQLite database of course, so this doesn't make the polls private. Instead, this is meant for when you want to ask just a specific set of people a question, for example everyone in a specific ZeroTalk thread or some people you send the link to in a ZeroMail.\n\nHere is one of these hidden polls to test: [ZeroPolls: If you think this poll is just here to test a new feature, you are...](/ZeroPolls.bit/?Poll:24-1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD)\n\nI will also start working on adding comments to polls later today. Not sure yet how long it will take, so that might come today, tomorrow, or later."
		},
		{
			"post_id": 18,
			"title": "SQL 0 : Ekaterina 1",
			"date_published": 1457697432.5,
			"body": "Just gave ZeroPolls a little update that took me all of the 7 days I've worked on ZeroPolls to make. You won't actually notice any difference, it works exactly the same as it did before. But now, I was finally able to create the monster of a SQL query necessary to get all polls with all answers with all votes for those answers. Before, as I had mentioned in another blog post, I had to do some cheating and prepare some of the data using JavaScript. That would not have scaled well as soon as the site has hundreds of polls, because I needed to download all votes ever created or use one SQL query per poll displayed on the site. And by the way, we are at 1706 votes in 65 polls now, that data is something I added in the update that you can see :)\n\nBut I digress, the cool thing about having this all in one SQL query now is that I can now just add the line \"LIMIT 50\" to the query and I will only get the first 50 polls out of the database, so it will always be fast even if there are thousands of polls. So I can now begin to add infinite scrolling, where more polls are loaded as needed while you scroll down the list.\n\nOh and here is this monster of a SQL query, there are probably more efficient ways to do this but I am just learning SQL which is also why I hate it right now, but people don't seem to be agreeing with me on that :P\n\n![ZeroPolls](data/img/zeropolls_poll_sql.png)\n\n---\n\n```\nSELECT\n\tpoll.*,\n\tanswer_votes,\n\tvotes,\n\tkeyvalue.value AS cert_user_id,\n\tcontent_json.directory AS user_address,\n\tpoll.poll_id || '-' || content_json.directory AS poll_uri\nFROM poll\nLEFT JOIN json AS data_json USING (json_id)\nLEFT JOIN json AS content_json ON (\n            data_json.directory = content_json.directory\nAND content_json.file_name = 'content.json')\nLEFT JOIN keyvalue\nON (keyvalue.key = 'cert_user_id'\nAND keyvalue.json_id = content_json.json_id)\nLEFT JOIN\n(SELECT\n\tpolljoin.poll_uri,\n\tpolljoin.*,\n\t(SELECT COUNT(*)\n\t\tFROM poll_vote\n\t\tWHERE poll_vote.poll_uri = polljoin.poll_uri) AS votes,\n\t\tgroup_concat(concat) AS answer_votes\nFROM (\n\tSELECT\n\t\tpoll_uri,\n\t\tvote || '-' || COUNT(*) AS concat\n\tFROM poll_vote\n\tGROUP BY poll_uri, vote\n) AS polljoin\nGROUP BY polljoin.poll_uri) AS countselect\nON (countselect.poll_uri = poll.poll_id || '-' || content_json.directory)\n```"
		},
		{
			"post_id": 16,
			"title": "ZeroPolls - 4 days in",
			"date_published": 1457650209,
			"body": "It's been 4 days since I released ZeroPolls into the wild, there have been quite a few updates already fixing bugs, adding features and making improvements to the design based on community feedback (through ZeroPolls itself). I wanted to give a little update on where ZeroPolls has gone so far, because I think it is really awesome how well it has done with the community.\n\n### After just 4 days, people have voted 1606 times in 61 polls.\n\nHow cool is that? I would not have thought it would be so popular in such a short time, a big thank you to the ZeroNet community from me, you guys and gals are awesome!\n\nSome questions that were asked also paint a really cool picture about ZeroNet's future:\n\n---\n\nMost people on ZeroNet are programmers,\n\n![ZeroPolls](data/img/zeropolls_poll_1.png)\n\nwho believe ZeroNet is the future of the decentralized internet,\n\n![ZeroPolls](data/img/zeropolls_poll_2.png)\n\nand have already created a ZeroNet site themselves.\n\n![ZeroPolls](data/img/zeropolls_poll_3.png)\n\nThat is awesome. To grow, to gain mainstream appeal, to really become the future, ZeroNet needs content, it needs sites, and to create sites we need programmers and it looks like we've got that more than covered. The future is looking bright for ZeroNet! Can't wait to see what cool sites we will see in the coming weeks and months.\n\nWhich brings me to a related topic. So far ZeroNet sites are free of advertising (which is great), but to keep it that way we should all think about donating to the developers who work on sites we like and of course [donating to ZeroNet](https://zeronet.readthedocs.org/en/latest/help_zeronet/donate/) itself, because if ZeroNet's single developer suddenly looses interest we are all in trouble :)\n\nThat is why I've now added donation info to this ZeroBlog's sidebar to accept Bitcoin donations for my work on ZeroNet sites and I encourage other devs who have not done that yet to do the same. It is probably way too early for that and nobody will make any real money any time soon with ZeroNet, but any dollar helps and I think both devs and users should start to get in the habit of donating and receiving donations, even if it's just a dollar, if they want more ZeroNet sites and want them to stay advertisement free and of high quality in the long term. Hard work should be rewarded and I believe there are better ways than advertising to do that, better for both users and devs, who are after all themselves users of other sites."
		},
		{
			"post_id": 15,
			"title": "ZeroPolls - New warning is bigger, better and uncut",
			"date_published": 1457546230.2,
			"body": "South Park reference aside, due to popular demand I made the warning at the top of the website (Votes are tied to your ZeroID) much more visible and hard to ignore while hopefully not so obtrusive that it is annoying and makes the site look bad. Most people seem to have seen it just fine before, but a sizable portion of people did not.\n\nI also made the `Select user / Logout` link look like a button to make it more visible.\n\nInterestingly, there do seem to be quite a few people who do not want to vote at all because the votes are tied to your ZeroID. That is unfortunate. Hopefully we will soon be able to easily create and use different ZeroIDs so that people can make one they don't care about and can use for voting on ZeroPolls, commenting on porn, the kind of stuff they don't want tied to their main identity. Reddit calls it throwaway accounts, we need throwaway ZeroIDs."
		},
		{
			"post_id": 14,
			"title": "ZeroPolls - Markdown links",
			"date_published": 1457526816,
			"body": "The pages for polls now show Markdown code you can copy and paste into ZeroTalk or ZeroBlog, to make the link look nice.\n\nCode looks like this:\n\n    [ZeroPolls: Do you like ZeroNet?](/ZeroPolls.bit/?Poll:5-1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD)\n\nAnd turns into this: [ZeroPolls: Do you like ZeroNet?](/ZeroPolls.bit/?Poll:5-1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD)"
		},
		{
			"post_id": 13,
			"title": "ZeroPolls - Small update",
			"date_published": 1457521537.6,
			"body": "Hovering over percentages now shows you a tooltip with the number of votes an answer received.\n\nI also changed the way loading votes works, instead of `n` SQL queries where `n` is the number of polls, it now only uses a single SQL query but loads all votes that exist. Still not optimal, but has to do for now until I find a better solution, and votes are small so they shouldn't use that much RAM.\n\nIn theory this should make the site load a bit faster, I haven't noticed that much of a difference but your mileage might vary. Since this is all done locally with ZeroNet and doesn't depend on the speed of your internet connection, it should depend on the speed of your hard drive and CPU how much of a difference you will see.\n\nThere was also a small bug with adding more answers when creating a new poll, would not work unless you entered some text in the answers before adding more, I sneakily fixed that last night but told nobody! :P"
		},
		{
			"post_id": 12,
			"title": "ZeroPolls - Link to polls directly ",
			"date_published": 1457435869.7,
			"body": "You can now link to polls directly, for example:\n\nhttp://127.0.0.1:43110/ZeroPolls.bit/?Poll:16-1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD\n\nJust right click on any poll's question and copy the link. Next update is also going to add comments on these poll pages. You can click on ZeroPolls in the top left corner to go back to viewing all polls.\n\nAnd as you can see, the new ZeroPolls.bit domain works now ;)"
		},
		{
			"post_id": 11,
			"title": "ZeroPolls - Bugfix update",
			"date_published": 1457398541.5,
			"body": "The annoying flickering when polls get updated with new votes in real time is now gone (yay!).\n\nI also added a few vendor-prefixes to the CSS to hopefully make the site work better in Safari (got no Mac, have to do this blind).\n\nI also began the long, long process of registering a .bit domain for ZeroPolls. Should start working some time tomorrow if I did everything right, then you can visit http://127.0.0.1:43110:ZeroPolls.bit\n\nI generally don't like the idea of domains for ZeroNet, the default hash link has many advantages to a domain, but for ZeroPolls it will be nice to have a shorter link when I add the ability to link directly to a poll in the next update."
		},
		{
			"post_id": 10,
			"title": "ZeroPolls",
			"date_published": 1457382034,
			"body": "What is this? My third ZeroNet site? I must be crazy! :)\n\nI hereby present to you, [ZeroPolls](/1K28kQFMquNzto2iQf4GGjr6oFUbC1NddE)!\n\n![ZeroPolls](data/img/zeropolls.png)\n\nI thought with the huge influx of new users it might be nice to be able to find something out about ZeroNet users, so I created ZeroPolls, which lets you create and vote on small polls, as you can do on the StrawPolls website or on Twitter. They are of course updated in real-time, so when you created a new poll (and this site is sufficiently popular), keep an eye on it to see the votes from other users coming in.\n\nThis is by far the most complicated ZeroNet site I have created, I am 100% sure there will be some bugs, here be dragons. Maybe it doesn't work at all for you, maybe the percentage calculation is off (math is something that I usually shoot first and never ask questions), you get the idea. So don't worry, if you notice something is wrong, that is totally expected, just comment here and I'll figure it out.\n\nNext update I will add pages for polls so you can link to them to share them on ZeroTalk, ZeroBoard, etc. I will also add comments for the polls so that there can be a bit discussion and rude remarks about the user's preferred answer not being a choice on the poll :)\n\n### Technical details\n\n---\n\nThe problem I ran into is that every poll has a number of answers and every answer has a number of votes. I could not figure out a decent way of doing this with SQL on ZeroNet, so I had to cheat. Problem is, the way I'm doing it now won't scale to thousands of polls, it will get slow. For now it will have to be enough, but if someone figures out a better way to do this, please do comment here."
		},
		{
			"post_id": 9,
			"title": "ZeroTodos - Reordering todos",
			"date_published": 1456617150.7,
			"body": "You can now drag todo lists and tasks around to reorder them. Nothing is saved until you click \"Save\" as usual, so if you messed everything up you can just reload the site to get back to where you started.\n\nI've tested this out in both Chrome and Firefox/TorBrowser so everything should work fine, but if you notice any problems I have overlooked, feel free to comment here or send me a ZeroMail."
		},
		{
			"post_id": 8,
			"title": "Displaying data usage",
			"date_published": 1456054762.4,
			"body": "I've added the display of user data usage to ZeroQuotes and ZeroTodos. All ZeroNet sites have a limit on how big a user's data can be, for ZeroTodos that is your todos and for ZeroQuotes that is the quotes you submitted and voted on. On ZeroTalk you can see it below the box to write a post, and there it's your posts, comments and votes that take up space.\n\n![Data usage](data/img/datausage.png)\n\nI've also increased the limit from 10 kb per user to 30 kb per user (if you still see the old limit, it should update once your data changes by voting, submitting quotes, or saving in ZeroTodos). That should be enough for everyone, at least for ZeroTodos. For ZeroQuotes I might need to up it for specific users who post a lot of quotes. If you run into the limit, just send me a ZeroMail and I'll raise your limit, or if it happens to a lot of people, I'll raise the default limit.\n\nSome statistics from my own use:\n\nOn ZeroTodos I'm using 2.8kb (as you can see in the screenshot) with 18 tasks in 3 todo lists.\n\nOn ZeroQuotes, I'm using 3.1kb with 7 quotes submitted and 18 quotes voted on."
		},
		{
			"post_id": 7,
			"title": "ZeroTodos",
			"date_published": 1455923966.3,
			"body": "I needed a simple todo list to keep track of all the features I want to add to ZeroQuotes, and a ZeroNet user I've been talking to recommended me this cool web development framework called Vue.js. So I thought, why not combine my need for a todo list with learning something new and created my second ZeroNet site, [ZeroTodos](/1B8LmXYHzMGZzcRWoidAQb5SmKSyfjN63f)!\n\n![ZeroTodos screenshot](data/img/zerotodos.png)\n\nYou can create multiple todo lists, I've got one for ZeroQuotes and one for ZeroTodos itself for example. The site is fully responsive so should work fine on mobile, but you can't switch between the list of todo lists and the list of tasks yet on mobile, have to add a button for that.\n\nChanges you make get only saved once you press the Save button, while it would be nicer if this was automatic, it also gives you more control, but most importantly it means you won't spam other ZeroNet users with too many little edits like checking off a bunch of tasks.\n\nTodos get saved fully encrypted using ECIES (Elliptic Curve Integrated Encryption Scheme) provided by the ZeroNet API. By doing that, other users host your todos and you host theirs, so you can access them from everywhere since your data is saved in the decentralized \"cloud\", but the encryption prevents you from reading other users' todos. Pretty much like ZeroMail works.\n\nKeep in mind though that nothing is 100% secure and to err is human, so use your own judgement on what data to add, I make no guarantees about the safety of your data, use on your own risk. Probably not the best idea to add credit card numbers, passwords and world domination plans, but it's your decision.\n\nI've also added this as a warning for new users at the top of the site, because I want to be transparent and upfront about this. I take privacy serious and that includes informing users about the potential risks and certainly not omitting that completely or hiding it in the fine print.\n\nHave fun with it, and as always, if there are any problems or questions you have, feel free to send me a [ZeroMail](/Mail.ZeroNetwork.bit/?to=ekaterina) or comment on this blog."
		},
		{
			"post_id": 6,
			"title": "ZeroQuotes - User pages",
			"date_published": 1455450764.856,
			"body": "You can now click on a username to see all quotes he submitted or all quotes he voted for. Try clicking on your own username to see a collection of all your favorite quotes that you have collected over time :)\n\nRight now, your username displayed at the top of the site is used for login / logout, I will probably change that in the next update so that you can click it to see your user page with all your quotes without having to browse through the list of all quotes first to find your username to click on. I would have done that in this update but it already took me way to long, I think I need a break and it's valentine's day :)\n\nI'd love to hear if someone does not want his votes displayed like this for everyone to see, I could add an option (I want to add options sometime anyway) to not show your votes to other users. Keep in mind though that all votes on ZeroNet, including votes on sites like ZeroTalk and ReactionGIFs are public, they have to be due to the sites being decentralized. You can just look at the data/users folder of a ZeroNet site in the data.json file of a user to see all his votes. So this would only make it a bit \"harder\" to see what someone voted for, it does not give you real privacy. But still, if people want it, I'll add it.\n\nSo long and happy valentine's day!"
		},
		{
			"post_id": 5,
			"title": "ZeroQuotes - Order by date or votes",
			"date_published": 1455229887.225,
			"body": "Very small but useful update, you can now order quotes by date (like it used to work) or by the number of votes.\n\n![ZeroQuotes Image](data/img/zeroquotes_orderby.png)"
		},
		{
			"post_id": 4,
			"title": "ZeroQuotes - You can now vote on quotes",
			"date_published": 1455161373.464,
			"body": "You can now vote on quotes on ZeroQuotes. Quotes you added yourself automatically have one vote that you cannot remove, so no need to vote for your own quotes ;)\n\nNext update will add optional sorting by number of votes, and then (or both at the same time, we'll see) I'll add user pages where you can see all of a user's quotes or see a list of your own quotes, which means you can vote on quotes to start a collection of your favorite quotes.\n\nIt is completely possible that I messed up somewhere and ZeroQuotes now crashes and burns for you, adding the votes was quite an ordeal. If that happens, don't worry, just comment here or sent me a ZeroMail and I'll look into it :)\n\nThe design is temporary, priority is to make sure everything works fine first before I make things looks nice.\n\n### Now for the technical details, for those who are interested\n\n---\n\nAdding votes took way more time than I thought it would. It's actually rather easy to do, in hindsight, but it took me so much time to figure it out (which I wrote about in the last dev update blog) just to realize today that I was halfway wrong, so it took me another few hours to figure out how to actually do it.\n\nZeroQuotes now uses the same technique for voting that ZeroTalk uses for votes on comments. I made the mistake of only looking at some of the source code for ZeroTalk and some of the source code for ZeroBlog to figure out how to add votes. I would recommend to read all of the ZeroTalk source if you want to add votes to your site. It's very easy to understand (safe for the SQL, SQL is a nightmare, burn it, burn it with fire!). Doing that finally made me understand exactly how votes work. I think I'll write a tutorial here for that at some point, might help other people who don't want to go through all of the source, although I'd still recommend doing that since you learn so much and it's less code than you'd think."
		},
		{
			"post_id": 3,
			"title": "ZeroQuotes dev update",
			"date_published": 1455024525.653,
			"body": "I started to work on adding votes to ZeroQuotes. You will soon be able to optionally order quotes by number of votes and click on usernames (including your own) to see a list of all quotes submitted by that user. This also lets you collect your favorite quotes by just voting for them and then look at your collection whenever you like.\n\n### Here comes the technical stuff, for those who are interested in that:\n\n---\n\nTo add votes, I needed quotes to have an id, so that I can have a list of all votes and each vote consists of the id of the quote it belongs to. Of course, quotes did not have ids in the initial ZeroQuotes release. Next time I will add one even if I don't plan on doing anything with it yet. To add the id after the fact, I had to manually edit all user's data.json files to add an id to each quote, hoping nobody submitted a new quote while I was doing that, then I used the ZeroNet sidebar to sign each of the user's data files (the site owner seems to have admin rights, he can change and sign all user files not just his own, otherwise this would not have worked).\n\nThere weren't a huge number of users and quotes yet, so it only took 5 minutes, but it was still work I could have prevented if I had added the id before. The way the ids work is interesting, since ZeroNet is decentralized you can't just have a number on the server that gets increased by 1 every time a user posts something, since there is no one server. Instead, after looking at some of the ZeroNet sample sites (ZeroBlog, ZeroTalk, etc.), the way to do it seems to be: Give each user a next_quote_id value, initially set to 1. Increase by 1 whenever he creates a new quote and use this value as the id for the new quote.\n\nNow, these ids are only unique for this one particular user, so it needs to be combined with another id to make it globally unique for all users. That's where the json_id comes in. That id is given to each content.json and data.json file by ZeroNet. I have no idea how it works, I tried looking at the ZeroNet source code but wasn't able to figure it out, but if you combine this json_id which points to a specific user's data file and then add to that his quote id, you have a unique id that points to that exact quote among all users.\n\nI don't actually do anything with the ids yet, they are just stored in the data files and in the database (in case you don't know, the data.json files are the authorative source of data in ZeroNet, where data gets read and written. The database is just used to make reading data easier and I assume faster, by allowing you to only read a specific portion of data instead of all data for example).\n\nThe database was another interesting thing, you can force the database to be recreated by increasing the schema_changed value in the dbschema.json file. However, you don't have any control over when that happens. After I made my changes, I tried looking at ZeroQuotes from a web proxy to see if everything works fine. Turns out, the proxy downloaded only half of the changed user data files, then recreated the database before downloading the rest, so it doesn't actually show the new quote ids for all quotes. It's not really a problem since I don't use the quote ids yet and the database will be corrected the next time someone submits a new quote, but it's still something to keep in mind.\n\nIn theory this should all work, but we'll see. If someone should submit a quote before he downloaded the new version of ZeroQuotes I'll have to fix his data file for example, since that would then have deleted all the quote ids I manually added. As I said before, ZeroQuotes is a learning experience for me, I actually want to run into these kinds of problems so I know how to deal with them for bigger, more serious ZeroNet sites (and there are absolutely going to be some big projects by me, I really love ZeroNet, I've wanted something like this for a long time). And I'll keep this blog updated with my findings, so maybe someone else can learn from my mistakes too ;)"
		},
		{
			"post_id": 2,
			"title": "ZeroQuotes",
			"date_published": 1454717950.054,
			"body": "To try out the ZeroNet API, I just started developing a ZeroNet site that lets you submit quotes from famous (or fictional) people and read quotes submitted by other users. It's very basic right now, I just followed along with the ZeroNet API [tutorial](/Blog.ZeroNetwork.bit/?Post:43:ZeroNet+site+development+tutorial+1) and made little modifications. It's really just meant to teach me creating ZeroNet sides, but instead of creating yet another chat I thought why not create something a little bit different, so it's at least somewhat useful. But maybe I'll keep working on it, we'll see :)\n\nThe main reason though is really just to figure out how to develop sites, run into problems, fix those problems, and then create a real, more elaborate site while already knowing how to prevent all of those problems I ran into while making ZeroQuotes.\n\n![ZeroQuotes Image](data/img/zeroquotes_1.png)\n\nYou can check out the site [here](http://127.0.0.1:43110/1NJyPoPpL8At17T6G7A1qHVQdqZDBmXcLT).\n\nPlanned features:\n- Voting for quotes (possibly comments too)\n- Categories to make browsing quotes easier (people, movies, books, etc.)\n- Full text search so that maybe you can at some point use the site to look up a quote you don't fully remember"
		}
	]
}