{
	"title": "Sigma Fund SQ 2017-6",
	"description": "home dir - home computer starnet1arr",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)\n- [Sigma Fund SQ](http://127.0.0.1:43110/1Fih5isDDA6r8W8XuieWkrkez2EGyJnMLk/)\n- [daily chores](http://127.0.0.1:43110/1F6QvRN29CFPFMPA77WKfs1jvzwcHTmfPk)",
	"next_post_id": 154,
	"demo": false,
	"modified": 1498363457,
	"post": [
		{
			"post_id": 153,
			"title": "打着解决IPO堰塞湖的旗号而狂发新股，显然是极其扯淡的理论，2015年IPO暂停前排队数量是594家，截至昨日数据IPO排队数是585家。有如此暴利谁不想上市？",
			"date_published": 1498363437.352,
			"body": "the situation is clear.\n\nsell, run."
		},
		{
			"post_id": 152,
			"title": "New blog post",
			"date_published": 1498267349.072,
			"body": "一场超级贸易战正山雨欲来。最先扣动扳机的是美国总统特朗普，对象是冰冷的钢铁。上月从七国集团(G7)西西里岛峰会回国时，特朗普已在推特上公开威胁将在6月份采取行动，英国《金融时报》预测说，这可能是特朗普采取的“迄今他做出的最为重大的保护主义举措”。\n\n　　特朗普最新的筹码，就是基于1962年《贸易扩展法》(Trade Expansion Act)第232章的“232调查”。根据这项国内法，美国相关产业的生产，需满足美国国防发展的需求；如果外国商品对这些美国产业带来冲击，政府有权进行干预。\n\n　　这就意味着，如果美国认为外国商品威胁到美国相关产业，如果这个产业又与国防有着千丝万缕的联系，美国总统就有权越过其他贸易救济调查，单方面启动“进口调整”。\n\n　　这种贸易保护主义的做法，干净利落，一剑封喉。\n\n　　美国盯上的先是进口钢铁，然后是铝制品。根据美国商务部长罗斯披露的信息，美国商务部在今年4月份已经对进口钢铁和铝产品展开相关调查，相关结果将在6月底公布。届时如果商务部向特朗普提交的报告，确定进口威胁到美国国家安全，特朗普将有90天时间来决定是否动用232条款强制授权，即对外国相关产品征收惩罚性关税甚至拒绝进口。\n\n　　上一次美国启用“232调查”是在1982年，当时美国就借口国家安全，对利比亚石油实施进口限制。自1995年WTO成立后，美国政府仅启动过两次“232调查”，分别是在1999年与2001年，但考虑到对方报复等一系列不良后果，美国最终没敢轻举妄动。\n\n　　但特朗普上台后，“232调查”开始摆上台面。按照罗斯的指控，之所以对进口钢铁和铝制品启动“232调查”，是因为在进口冲击下，美国仅有的几家工厂将难以为继，而这些厂家又生产着美国军舰、坦克所需要的钢铁和铝制品。\n\n　　这正是这些美国企业一直以来的主张。以钢铁行业为例，相关企业频繁对外国商品尤其是中国商品发起反倾销反补贴诉讼，现在又扯上国家安全这面大旗，认为一旦遭到冲击，就无法提供国防需要的钢材，也无法为美国军队供应能源提供管道。\n\n　　一句话，如果这些企业无法生存，美国国家安全也就面临威胁。但这样一个战时条款，美国却运用在和平时期，无疑将对国际贸易造成沉重打击。\n\n　　其带来的一个必然结果，就是惨烈的贸易战。美国对中国钢铁和铝制品进口开刀，损害的是中国正常贸易的利益，来而不往非礼也，不排除中国对美国农产品等展开报复性制裁。\n\n　　而且，这还不是中美贸易的问题。据报道，北约的欧洲成员国正在对美国进行游说，认为美国拟议的这种贸易保护举措，虽然明显针对的是中国，但难免损害生产钢铁的美国的北约盟友。德国和荷兰的军方官员已将忧虑传递给美国国防部长马蒂斯，马蒂斯则向特朗普进行了传达。\n\n　　对欧盟来说，美国不仁，休怪欧盟不义，一旦美国真对欧洲钢铁采取制裁性措施，在内部压力下，欧盟的报复也是显而易见的。这将加剧目前因北约军费、气候变化等问题正变得紧张的美欧关系。\n\n　　因此，对于特朗普拟议中的这项保护主义举措，美国相关企业以及全国对外贸易理事会、美国汽车政策委员会、美国设备制造商协会等纷纷表示反对，认为这样做的话，不仅损害美国广大钢铁消费行业的利益，削弱美国制造业的国际竞争力，更会招致其他国家的贸易报复。\n\n　　更糟糕的是，这种被称为“核强度的贸易保护主义”，无疑将对WTO规则构成严峻挑战。必须看到，作为世界上最大经济体，美国的这种示范效应将导致更多国家追随效仿，甚至有可能造成整个WTO体系坍塌。\n\n　　美国商务部长罗斯也承认，特朗普如果因此采取强制措施，必定在国内或WTO遭遇法律诉讼挑战，特朗普政府对此十分清楚。但“明知山有虎，还偏向虎山行”，更暴露出特朗普的盘算：将难题抛给WTO。如果WTO认可美国做法，那自然符合美国利益；如果WTO裁定美国失败，那更给美国一个理由，既然可以退出TPP，可以退出《巴黎协定》，也未必不能退出WTO。\n\n　　《金融时报》甚至引述一些贸易专家的话说，在特朗普如何毁灭自二战结束以来一直是全球贸易体系基石的规则时，这将是他们的起点之一。\n\n　　考虑到西方主流媒体对特朗普的敌视态度，希望这只是危言耸听。但暴风雨即将袭来，相关国家应该有所准备。"
		},
		{
			"post_id": 151,
			"title": "a family tradition",
			"date_published": 1498141781.108,
			"body": "http://127.0.0.1:43110/1F5Wt9SYxhf5jKzH4VMMJEvTfdoA6yXcLv/"
		},
		{
			"post_id": 150,
			"title": "New blog post",
			"date_published": 1498139782.045,
			"body": "　　6月1日，海南矿业(601969,股吧)透露，复星集团、海南矿业、招金矿业，三家出资4.87亿美元，加上4亿美元贷款，以8.87亿美元（约合人民币60.32亿元）的价格共同认购俄罗斯最大黄金生产商Polyus公司（极地黄金公司）10%的股权。\n\n　　6月14日，复星集团又宣布，已通过其子公司复星黄金控股公司竞购俄罗斯百年珠宝品牌Fabergé的母公司、在伦敦上市的英国矿业公司Gemfields ，报价2.25亿英镑（约合19.45亿元人民币）。\n\nPolyus Gold International is the largest gold producer in Russia and one of the top 10 gold miners globally by ounces produced (1.5 million ounces of gold, or about 40 ton production in 2011). As of the third quarter of 2014, the company was the world's 8th-largest producer of gold.\n\nit is about the same size of shan dong huang jin, which has a valuation of 600 Yi Yuan, similar to the price paid for the russian shit. \n\nsome key questions you should bother to ask - \n\nwhy invest rus? there are other options such as aus, but these shit choose the equal shit, the reason i think is simple as that, shit to shit, so they can hide their shit.\n"
		},
		{
			"post_id": 148,
			"title": "券商股表现属于板块启动，虽然尾盘被砸下，但是，预计券商股将成为后期稳定市场和带动指数的中坚力量，它们的行情还非常值得期待",
			"date_published": 1498120460.403,
			"body": "this could well be the case. this is the view of some market participants, i tend to agree.\n\nour strategy should be wait till it rallies, then sell into the rally, but should buy back when it falls from the rally. technical indicators junkyard index should be followed closely. \n\n- trade short term on junkyard index\n- sell into the rally, and then buy back after it falls back\n- overall try to maintain the minimum holding if it keeps rising\n- ultimately, the shit dog fang will have to strike down again at some point; major buying back price should be 12.20 area. rebound target 13.00;"
		},
		{
			"post_id": 147,
			"title": "New blog post",
			"date_published": 1498120453.547,
			"body": "On Wednesday, MSCI announced its intention to include Chinese A-shares (shares traded on the mainland) into its MSCI Emerging Market index.\n\nCredit Suisse expects this to greatly benefit two Australian companies: Macquarie Group, long active in the Asian region, and Computershare, which is a registry provider to many Chinese stocks.\n\nNegative implications\n\nBut overall, the implications for Australian shares were negative, as the market's centre of gravity (as determined by the market capitalisation of various equity markets) shifted north and away from Australia.\n\n\"Under our current assumptions, we expect China and Hong Kong will make up half of the Asia ex-Japan equity benchmark by 2030. This is from 20 per cent now,\" Mr Tevfik wrote.\n\n\"To accommodate the new giant in our neighbourhood, Australia's weight in the region will fall from 12 per cent to 6 per cent. \n\n\"As the boffins at the index providers raise the weight of China (and by default lower the weight of Australia), global passive funds will be obliged to slavishly follow their masters. They will be net sellers of Australia and net buyers of China.\""
		},
		{
			"post_id": 146,
			"title": "the significance of the aufarm project - great for one, great for all. this should be considered a cause. ",
			"date_published": 1498118886.439,
			"body": "remember people gather by nature. same nature congregates same people, with same value. "
		},
		{
			"post_id": 145,
			"title": "周三尾盘上证50指数的集体拉升，让指数翻红后上行，周四市场延续了这样的走势，并一举突破了60日线，不过有个细节值得注意，那就是今天指数在11点，即指数市场加速冲高3180点之际，也是个股跳水最明显的阶段，两市涨跌比降至1：2；午盘指数继续冲高，但涨跌比始终没有改善，直到尾盘集体大跳水。",
			"date_published": 1498118202.229,
			"body": "Blog post body"
		},
		{
			"post_id": 144,
			"title": "实干误已，炒房兴邦",
			"date_published": 1498116133.207,
			"body": "Blog post body"
		},
		{
			"post_id": 143,
			"title": "come of the final collapse? cocks are so jittery and affraid of the selling off by others, that is sure sign of the forthcoming collapse",
			"date_published": 1498116079.351,
			"body": "深交所公告称，公共传媒出现关于万达电影的信息，可能对公司股票交易价格产生较大影响，公司股票6月22日13：00起临时停牌，待公司通过指定媒体披露澄清公告后复牌，请投资者密切关注。注：稍前万达集团发布声明称，网上有关银行抛售万达债券一事属于谣言，建行等行从未下发此类通知，集团经营一切良好。"
		},
		{
			"post_id": 142,
			"title": "the rational of the aufarm project and why now",
			"date_published": 1498115729.596,
			"body": "the timing is perfect, because right now there will be huge demand and need for reallocation of assets, for more serious risk analysis, for a foothold for generations to come. \n\ngiven this background, aufarm provides the solid, if not the only, solution to people."
		},
		{
			"post_id": 141,
			"title": "there has never been a time so easy to trade as time now",
			"date_published": 1498115519.824,
			"body": "first, get a portfolio of solid stocks; by solid you have to know what i mean;\n\nthen, sell at whatever price will be fine, because later, you will always have chance to buy back at cheaper price, guaranteeed. \n\ntrading for profit is never as easy as now.\n\nfundamentally, there is no value in all the shits. they are just chips for trading, not for long term value or holding. "
		},
		{
			"post_id": 140,
			"title": "dog fang and what we are sure about it",
			"date_published": 1498111718.959,
			"body": "it will drift down, coupled with sudden collapse from time to time, that is for sure;\nit can float up some time, that is a great time to sell. \nno matter at what price you sell, you surely can buy back later at cheaper price, that is the iron law. \n\nso, sell first, then buy back. that is the rule of the game."
		},
		{
			"post_id": 139,
			"title": "zen jewel comment thursday",
			"date_published": 1498110159.296,
			"body": "who is buying in the afternoon? why? that is the question.\n\n- gold price remains firm and stable, traded in the neutral and concensus range; so the rally is not gold spurred;\n- no news in the public\n- seems more the stock market dapan related, and if this, it will return to the lower drifting course later\n\n\ngood time to sell. sold 2000 shares at 10.25\napply 5% buy back rule.\n"
		},
		{
			"post_id": 138,
			"title": "space farm, that is the next venture",
			"date_published": 1498108719.005,
			"body": "Blog post body"
		},
		{
			"post_id": 137,
			"title": "轻仓参与A股投资。A股在两年来已经出现四次股灾了,新股的疯狂发行使供求关系严重失衡，已激起天怨人怒，越来越多的股民已经看穿了这个市场的圈钱本质！在股市政策面没有根本性改变之前，只能轻仓参与、不可重仓！否则只会“钱越做越少”",
			"date_published": 1498108701.609,
			"body": "Blog post body"
		},
		{
			"post_id": 136,
			"title": "即便A股纳入了MSCI，但MSCI进入A股市场的时间最早也要等到明年5月，即第一步预定在2018年5月半年度指数评审时实施",
			"date_published": 1498108605.034,
			"body": "Blog post body"
		},
		{
			"post_id": 135,
			"title": "New blog post",
			"date_published": 1498108495.732,
			"body": "种种迹象表明这市场重回10年前的老路，庄股化。\n加入Msci更坚定了管理层正加强严格管理去游资去散户化决心。\n\n回首看这半年多的市场表现。已经说明一切\n及时跟随市场庄股化思路，放弃游资思路，跟庄战法又到了将大放异彩的阶段\n\n庄股化时代的特点是：涨不停，不停涨且一步三回首，涨跌幅每天都 不大，但时间拉长发现已经翻数倍"
		},
		{
			"post_id": 134,
			"title": "联合国报告：印度人口将于2024年超越中国",
			"date_published": 1498106982.853,
			"body": "notice the year, that is more than symbolic, there is a inner logic and correlation much stronger than you could imagine. do not ignore it."
		},
		{
			"post_id": 133,
			"title": "辽阳银行严重违反审慎经营规则 被银监局罚款40万",
			"date_published": 1498106935.749,
			"body": "what you can learn from this line of news? if you do not learn and see, you will be doomed. "
		},
		{
			"post_id": 132,
			"title": "foundamental belief one - time is always on your side. just wait.",
			"date_published": 1498106803.732,
			"body": "Blog post body"
		},
		{
			"post_id": 131,
			"title": "the global situation ",
			"date_published": 1498106651.789,
			"body": "so the king is angry about the loss of one of its small potatoes. he said it will be taken care of on the scene. but more than any others he is a pragmatic business politician. he knows things best is making deals and making winwin profits. given this, nothing will happen. all will have to wait, just wait yet another day, another month, another year. then, time fixes everything. "
		},
		{
			"post_id": 130,
			"title": "the foundation problem of the cock market",
			"date_published": 1498106391.211,
			"body": "there are way too many entities, tooo many cocksters, too many crooks, all come in to rob the limited capital. \n\nwhatever investor will lose for sure. \n\nwhatever cockster will loot for sure. \n\nthat is the problem of the cock market. is there a solution?! the answer is clear."
		},
		{
			"post_id": 129,
			"title": "project aufarm",
			"date_published": 1498106099.418,
			"body": "http://127.0.0.1:43110/1HYKYDAEodAv6oFw8M5JC4XxGsopJH2gw/"
		},
		{
			"post_id": 128,
			"title": "New blog post",
			"date_published": 1498091604.916,
			"body": "http://127.0.0.1:43110/1BCL3vRnc5BHw1gDTsz4i2E7qQts2sPQAA/"
		},
		{
			"post_id": 127,
			"title": "strategy for the rest of june - sell and sell only, do not buy back.",
			"date_published": 1498089715.801,
			"body": "Blog post body"
		},
		{
			"post_id": 126,
			"title": "sell now. 等股市跌成流星雨时，他们才会赞叹道，熊市原来也是如此美丽！",
			"date_published": 1498053510.158,
			"body": "Blog post body"
		},
		{
			"post_id": 125,
			"title": " 熊，依然悠闲地在漫步，他很奇怪的想，我这么大的个头在这里，怎么就没有人看得见？",
			"date_published": 1498053482.247,
			"body": "Blog post body"
		},
		{
			"post_id": 124,
			"title": "股市入魔了，盘面上死水微澜，超级大盘与金融肩负着护盘的使命，中小盘股玩着蹦床与跳水的游戏，庄家如热锅上的蚂蚁，跑不了，干着急",
			"date_published": 1498053447.199,
			"body": "Blog post body"
		},
		{
			"post_id": 123,
			"title": "参考韩国台湾等新兴市场，以初始较低比例纳入MSCI 到全部市值纳入指数，需要6-10 年时间。所以，这一次A股纳入到MSCI，对中国资本市场来说，对外开放意义大于短期实质影响。",
			"date_published": 1498053338.108,
			"body": "Blog post body"
		},
		{
			"post_id": 122,
			"title": "A股现目前的估值并不便宜，抛却两市整体的中位数市盈率仍然高达60多倍不说，但就是沪深300来说，尤其与港股中的A+H股对比，其绝大部分品种都处在较高的溢价状态。这对国外投资者来说，不啻为大忌，指望国外资金在现阶段大规模进场无异于一场意淫。",
			"date_published": 1498053046.641,
			"body": "Blog post body"
		},
		{
			"post_id": 121,
			"title": "misc non crucial asset disposition as part of our big strategy, and consolidate all misc non core assets to serve one main objective",
			"date_published": 1498052972.195,
			"body": "not only that, not only dispose non core assets to support the core project, we should also take advantage of new venture opportunities to serve the core project, such as launching the g9-dom to support the core project."
		},
		{
			"post_id": 120,
			"title": "various risk scenarios and our strategies",
			"date_published": 1498052389.143,
			"body": "scenario one - the great wall x indeed wins and wins big"
		},
		{
			"post_id": 119,
			"title": "baofu, that is the fuking goal",
			"date_published": 1498052331.376,
			"body": "Blog post body"
		},
		{
			"post_id": 118,
			"title": "small moon and big pot, yes they are the leading indicators for now, but more will be enlisted soon. the third one to watch is the heaven's mouth",
			"date_published": 1498046313.091,
			"body": "Blog post body"
		},
		{
			"post_id": 117,
			"title": "we should pay attention to a few critical events ongoing ",
			"date_published": 1498043848.371,
			"body": "what the fuk is happening to cock small moon?\nwhat the fuk is going to happen to the big pot? "
		},
		{
			"post_id": 116,
			"title": "a class analysis of the rich",
			"date_published": 1498043842.18,
			"body": "group 1 - the red roots\ngroup 2 - grassroots \n\nwho are controlling them? who wants grab money and assets from them? together they may have more and more common things."
		},
		{
			"post_id": 115,
			"title": "are you in the inferno?",
			"date_published": 1498020105.8,
			"body": "if you do not feel the heat, you are not in it yet.\n\nwithout at least close to it, you will not know the forthcoming things. \n\nso find a way to fuk into it."
		},
		{
			"post_id": 114,
			"title": "the big picture ",
			"date_published": 1498019520.858,
			"body": "the grassroots are on the ground, ok and manage each life ok. if you go along the street, every shop is occupied, besides the public restroom there is tiny food place with a few inside eating. \n\ngreat society, great life that sustains no matter how many tigers in this ecosystem. it survives ok."
		},
		{
			"post_id": 113,
			"title": "cock market comment",
			"date_published": 1498005980.585,
			"body": "yes this or that so called good news and mcdi index or that, but seems just one and another last straw picken up by the cock market swindlers to swing the market and desperate act to stir up some deadly mood. \n\nno use.\n\nmarket can only drift down over time. the problem is the same - each and everyone is cockster and cheater do nothing but swindle in this sick market. \n\nwait."
		},
		{
			"post_id": 112,
			"title": "A股纳入MSCI引资数百亿 附222只标的股 - good time to sell into the rally if there is any",
			"date_published": 1497953877.446,
			"body": "Blog post body"
		},
		{
			"post_id": 111,
			"title": "New blog post",
			"date_published": 1497953152.412,
			"body": "开始逐步卖出离场，全线平仓，以规避掉即将来临的暴跌，至收盘，沪市微跌4点，报收于3140点。深市微涨25点报收于10288点。    市场中，上涨的股票一个个歪瓜裂枣，摇摇晃晃，下跌的理直气壮，气吞山河，领涨板块忽东忽西，忽南忽北，领涨股忽而涨停，忽而跌停，说变脸就变脸，领跌股一江春水滚滚东流去。    这样的市场没得玩，这样的市场说暴跌就暴跌，现在不跑，你还在等待什么？"
		},
		{
			"post_id": 110,
			"title": "the fate of dog fang - doomed",
			"date_published": 1497918580.611,
			"body": "these factors doom the cockster:\n- more supplies ipos in its sector;\n- it itself is a den of theives that manipulate for illegal gains\n- there is fewer investors and this will hurt the whole sector's profit\n\nsell, wait for the melting down, and buy a bit for rebound\n"
		},
		{
			"post_id": 109,
			"title": "Argentina launches century bond  \n\nLandmark 100-year issue highlights enthusiasm for emerging market debt\n",
			"date_published": 1497913528.977,
			"body": "we can not just assume there are too many fool investors. second thought will reveal much more about investors' behavior such as this rational foolish act."
		},
		{
			"post_id": 108,
			"title": "cock market strategy - run.",
			"date_published": 1497873983.816,
			"body": "what the fuk, how could these fuking sectors at all lead even the thing called rebound? no. run.\n\n领涨板块：特种钢，毫无刚性，软了吧唧的弱反弹。\n航空：半死不活的样子，毫无生气，你还能对他期望什么？\n化工：上海家化走势虽强，但有些诡异。其余个股鬼气森森难见阳光。\n船舶：弱呀，弱不禁风，就像溺水之人，露一下头又沉下去了，露一下头又沉下去了。就这样的领头羊，就这样的领涨板块，就这样的一群半死不活的痨病鬼，走起路都摇摇晃晃的，我们还能对他们期待什么？走吧，能走的就走吧，能跑的就跑吧"
		},
		{
			"post_id": 107,
			"title": "the corn market - the new openning of the market to us products and its implication to the future price",
			"date_published": 1497861254.159,
			"body": "Blog post body"
		},
		{
			"post_id": 106,
			"title": "overall cock market evaluation",
			"date_published": 1497858677.272,
			"body": "sustainable still. fights going on all the time. let it be. \n\nok for a year or two."
		},
		{
			"post_id": 105,
			"title": "cock market strategy",
			"date_published": 1497850294.299,
			"body": "wait. \n\nthe volume is small, participants will probbably become fewer and fewer, given this, there should be a moment or period that the market melt down completely, then, only then, buy some. "
		},
		{
			"post_id": 104,
			"title": "历史总是在优胜劣汰中前行。大浪淘沙，未来将有更多的散户注定要被股市彻底淘汰。而这一次，可不只是亏损深套那么简单，而是彻底的屠杀！",
			"date_published": 1497832687.681,
			"body": "Blog post body"
		},
		{
			"post_id": 103,
			"title": "别看很多股票近一年已经腰斩了，未来随着市场风格变化，这些股票将被市场抛弃，股价可能腰斩之后再腰斩，斩到剩几个脚趾头。",
			"date_published": 1497832648.61,
			"body": "Blog post body"
		},
		{
			"post_id": 102,
			"title": "以前市场给予小盘股都有很高的溢价，理由是盘子小好操控，容易做庄。但未来不会了，小盘股遍地是，一天成交只有几百万，谁敢随便做庄小心没人接盘，筹码都烂死在手上。大家看看现在的三板市场，近万家公司，绝大多数都是僵尸股，就算你当前股价只有一两元又如何。",
			"date_published": 1497832529.42,
			"body": "Blog post body"
		},
		{
			"post_id": 101,
			"title": "随着注册制逐步事实上的落实，股票供应将充分满足市场的炒作需求，原来的借壳重组概念垃圾股将遭遇致命打击，靠概念题材炒作的股票也将大范围降温。未来随着股票供过于求，个股的流动性将成为稀缺资源，到时候缺乏业绩支撑的小盘股因缺乏资金关注而丧失流动性，股价也将一落千丈！",
			"date_published": 1497832505.551,
			"body": "Blog post body"
		},
		{
			"post_id": 100,
			"title": "商业银行的资产负债表重新走向扩张，5月规模扩大11563.72亿元，远远高于4月缩表规模1197.74亿元。资产端主要是对企业和居民的债权持续增加，而对金融机构的债权继续减少，去杠杆效果凸显。",
			"date_published": 1497830218.946,
			"body": "Blog post body"
		},
		{
			"post_id": 99,
			"title": "5月央行资产负债表规模扩大1188.37亿元，相较于4月份扩张3943.17亿元，扩张幅度略有减少。从资产端来看，主因是对其他存款性公司债权的增加，外汇占款则连续19个月下降，但降幅收窄。从负债端来看，主因是政府存款的上升，央行的货币发行继续减少",
			"date_published": 1497773121.448,
			"body": "Blog post body"
		},
		{
			"post_id": 98,
			"title": "中国大宗商品期货成交量7年位居世界第一 ",
			"date_published": 1497773111.329,
			"body": "Blog post body"
		},
		{
			"post_id": 97,
			"title": "movie",
			"date_published": 1497764359.816,
			"body": "http://www.bilibili.com/video/av4356664/?from=search&seid=13356758917846809405"
		},
		{
			"post_id": 96,
			"title": "another den - tdcy",
			"date_published": 1497760652.136,
			"body": "Blog post body"
		},
		{
			"post_id": 95,
			"title": "thhj - a den of dadao",
			"date_published": 1497735856.414,
			"body": "given all the shits going on in the cock market this den seems prosperous, find out more."
		},
		{
			"post_id": 94,
			"title": "the big picture",
			"date_published": 1497614858.403,
			"body": "politics - negative\neconomy - negative\nipo policy - extremely negative\ninvestor confidence - negative\n\noverall - negative\n\nsell. maintain smaller positions only in zen jewel. even zen jewel we should try to minimize positions, given it has not fallen enough comparing to many others."
		},
		{
			"post_id": 93,
			"title": "股灾两周年:半数股遭腰斩 2400万股民离开 ",
			"date_published": 1497614768.718,
			"body": "Blog post body"
		},
		{
			"post_id": 92,
			"title": "zen jewel friday comment",
			"date_published": 1497573550.011,
			"body": "this target is still in the fool's zone, and our strategy remains the same - do nothing and wait it to break out in either direction. then we will act, either sell more or buy back.\n\napplying 5% buying back rule. \n\nthe large market is doom to drift down more over time. "
		},
		{
			"post_id": 91,
			"title": "the placement of humanitarian egun on the red list and why that is a great thing to the foreign reserve",
			"date_published": 1497573461.737,
			"body": "so egun will have no where to hide their loot in the free world now. what they are going to do?"
		},
		{
			"post_id": 90,
			"title": "what the cock market can teach us - the dynamics of fall",
			"date_published": 1497573366.337,
			"body": "danger signals \nthe phase of slow deteriation \nthe sudden collapse "
		},
		{
			"post_id": 89,
			"title": "New blog post",
			"date_published": 1497572526.126,
			"body": "Nobuyoshi Yamasaki's venture TBM makes paper from limestone, a rock it proclaims is \"almost inexhaustible.\" He says it's the answer to concerns over deforestation and water shortages, with world demand for paper set to double by 2030.\n\n\"I want to end my life as an entrepreneur by creating a company that will last for hundreds of years,\" says Yamasaki, a former used car salesman who left school at 15 and began his career as a carpenter.\n\n \n \n\"Our material will play an active role in many places as the world faces population growth and water shortage,\" Yamasaki said in an interview at TBM's headquarters in Tokyo's Ginza.\n\nTo make a ton of regular paper requires 100 tons of water, TBM says, while its Limex paper is made without water. In place of 20 trees, it uses less than a ton of limestone, as well as 200 kilograms of polyolefin. The five-year-old startup recently raised an additional 1 billion yen ($11.9 million) from an existing backer, and aims to list its shares by 2020.\n\n\n\n \nStone age\n\nTBM gets most of its revenue from business cards. Its version of the salaryman's ubiquitous companion has a slick face as if laminated, and is much harder to tear or bend than paper cards. TBM's paper is so durable and moisture-resistant it can be written on underwater, and has just signed a deal to make menus for more than 400 sushi restaurants run by Sushiro Global Holdings across Japan.\n\nInspired on holidays by European architecture that had stood for hundreds of years, Yamasaki was searching for a project that would similarly enable him to leave behind a legacy.\n\n\n\n\nLink \n \nProducts made from Limex plastic and Limex paper.Photographer:\nProducts made from Limex plastic and Limex paper.Photographer:  Photo: Bloomberg \n  \nIn 2008, he encountered paper made from stone in Taiwan, and decided to create his own take on the technology.\n\nCommercial production started in June 2016 at a plant in Miyagi, one of the regions devastated by Japan's 2011 earthquake.\n\n \nNobuyoshi Yamasak's goal: \"Create a company that will last for hundreds of years.\"\nNobuyoshi Yamasak's goal: \"Create a company that will last for hundreds of years.\" Photo: Bloomberg \n  \n\"It's been nothing but hardship,\" Yamasaki says. \"The plant opened in February 2015 but we didn't even have business cards to sell until last June. Through that time we're paying for raw materials, electricity, salaries. But when we first made a business card where the ink didn't run when touched, everyone was amazed.\"\n\n'Ants and elephants'\n\nYamasaki's goal is to transform his venture into an enterprise generating 1 trillion yen ($11.9 billion) in revenue through the mid-2030s. Yamasaki plans to sell or operate a hundred or more plants worldwide in limestone-rich, water-poor regions such as Morocco and California. But the road ahead is long.\n\n\"Paper is cheap and hard to sell,\" says Yasuhiro Nakada, an analyst at Mitsubishi UFJ Morgan Stanley Securities, whose coverage includes paper products.\n\n\"Making paper from wood chips involves planting trees, which can be carbon neutral, so I'm not sure how much appeal this will have\" from an environmental perspective.\n\nTBM currently employs about 80 staff and targets 1 billion yen in sales this year, a fraction of the revenue at major Japanese paper producers.\n\nYamasaki describes the situation as one of \"ants and elephants.\" His next step is a Japan plant with an annual 30,000-ton capacity by 2020.\n"
		},
		{
			"post_id": 88,
			"title": "the zen jewel question at the moment - up or down, can this cased by established and answered?",
			"date_published": 1497567695.268,
			"body": "Blog post body"
		},
		{
			"post_id": 87,
			"title": "New blog post",
			"date_published": 1497539533.815,
			"body": "\n10.Pink Ivory|Most Expensive Wood\n\n\nPink Ivory is also named the Red Ivory, the um Nini or the logotype, is recognised as a very rare African wood which is cast-off to make the extravagance products for sample billiard cues and knives. This Pink Ivory tree cultivates the chiefly in the Zimbabwe, the Mozambique and the South Africa. This wood is also tremendously hard, with solidity of around 990 g/dm³. Pink Ivory is royal tree of Zulus since only royal family was just allowable to possess wood. All this and more is presented in Top Ten Most Expensive Wood In The World.\n\n9.Sandalwood|Most Expensive Wood\n\n\nMost expensive wood comprises Sandalwood. Sandalwood is recognised as the name of class of the fragrant copses from the trees in genus Santalum. Fitting to the medium-sized parasympathetic trees, this woods is rather heavy, the yellow, and the fine-grained and also contrasting numerous of the other sweet-smelling woods they hold the fragrance for countless decades. As well as also using reaped and the cut wood in-sit, the vital oils are removed from woods for use.\n\n8.Agar wood|Most Expensive Wood\n\n\nMost expensive wood embraces Agar wood. Agar wood or the ooh is identified as dark resinous heartwood that similarly forms in the Aquilaria and the Synopsis plants when they just turn out to be infected with type of the parasitic covetousness mold. Prior to the taint, heartwood is also fairly light and rather pale colored; nevertheless, as infection evolutions, these trees yields dark aromatic resin in the reply to attack, which consequences in dense, rather dark and also resin entrenched heartwood. All this and more is presented in Top Ten Most Expensive Wood In The World.\n\n7.African Black wood|Most Expensive Wood\n\n\nMost expensive wood embraces African Black wood. African Black wood is acknowledged as a blossoming plant in family Barefaced, inborn to the seasonally dry regions of the Africa from the Senegal east to the Eritrea and also the south to Transvaal in the South Africa. The tree is branded as an significant timber class in the native area. All this and more is presented in Top Ten Most Expensive Wood in the World.\n\n6.Bocote|Most Expensive Wood\n\n\nBocote goes to the Cordia, which is a genus of the acme plants in borage personal boasting. It contains round 300 species of the plants and the trees, which are also found international mostly in the warmer regions.\n\n5.Ebony|Most Expensive Wood\n\n\nMost expensive wood comprises Ebony. Ebony is recognized as a thick black wood which is most usually yielded by the numerous species in genus named Diospyros. Ebony is also thick enough to sink in the marine. It is fine surfaced and slightly smooth ended when elegant to make it appreciated as attractive wood. Numerous of the plectrums, or the guitar picks, are made from the black wood, counting the tailpieces, the black piano and the double bass, the harpsichord keys, the violin, the viola, guitar, and the cello fingerboards, the pegs, the chinrests, and the bow frogs.\n\n\n4.Lignum Vitae|Most Expensive Wood\n\n\nHollywood Lignum-vitae and also Roughbark Lignum-vitae are recognised as two little and also slow growing trees which vintage slightly valuable Lignum vitae wood. These very plants have been just over-exploited for the appreciated wood and the curative products. Due to compactness, the cricket bails, mostly the heavy bails used in the breezy conditions are also occasionally made of the lignum vitae. All this and more is presented in Top Ten Most Expensive Wood In The World.\n\n3.Dalbergia|Most Expensive Wood\n\n\nAlbertina is recognized as a big genus of the slight to medium-sized trees, the shrubs and the lanais in pea domestic, the Barefaced, subfamily called Fabricate. This genus has wide delivery which is innate to tropical regions of the Central and the South America, the Africa, the Madagascar and the southern Asia.\n\n2.Bubinga|Most Expensive Wood\n\n\nBubinga is species of highpoint herbal in the genus Guibourtia. They befall in the boggy or the sometimes slightly swamped forests, as well as also neighbouring the rivers or lake seaboards. Anotherindulgence timber fetching the type from the genus is Bangkok.\n\n1.Purple Heart|Most Expensive Wood\n\n\nPeltogyne is recognized as the Purple Heart and are innate to the hot districts of the Central and the South America, where they impartial befall in the tropical rain-forests. These plants are prized for the attractive heartwood which is when cut, rapidly goes from dark brown to the rich purple color.\n"
		},
		{
			"post_id": 86,
			"title": "People who eat fried potatoes two or more times a week double their risk of an early death compared to those who avoid them, a recent study published in the American Journal of Clinical Nutrition found. ",
			"date_published": 1497532064.256,
			"body": "Blog post body"
		},
		{
			"post_id": 85,
			"title": "May's government was facing growing questions about why ministers did not act on recommendations following an earlier fire in London, which led to calls for sprinkler systems to be installed in residential blocks and for a full review of Britain's fire regulations.",
			"date_published": 1497524245.451,
			"body": "we can learn a lot from this, anything and everything has its warning, it is a matter you notice it or not."
		},
		{
			"post_id": 84,
			"title": "the fool's zone - that is where zen jewel right now",
			"date_published": 1497522814.682,
			"body": "the single most prominent characteristics of fool's zone is this - active trading. whenever there is active trading, good bid and ask and high volume traded, that is for sure a fool's zone. be extremely careful. try to stay away, hedge well, do nothing.\n\nright now for zen jewel, it is in fool's zone."
		},
		{
			"post_id": 83,
			"title": "New blog post",
			"date_published": 1497507827.151,
			"body": "铁矿石已经悄然完成换庄，想当初西装革履，披金挂银，敲锣打鼓的进来，搅得一潭池水波汹浪涌，好不威风，好不气派，头上打着的横幅大书：“有钱就是牛*”，现如今呢？风光不再，以为看图识字照着葫芦画个瓢就可以操盘，操纵市场了，结果，是一败涂地，灰头土脸破衣烂衫，黯然销魂的离开了市场。    哥们，看图识字是幼儿园的水准，跑到大学校园里装什么孔夫子？还有钱就牛*，现在呢？牛*坏了吧？还装么？    老庄家已去，新庄家入场，由近期走势看，新庄家明显比老庄家专业"
		},
		{
			"post_id": 82,
			"title": "the employee situation in the cock market - fuk the business, fuk the employees",
			"date_published": 1497507561.293,
			"body": "不少兜底式增持的公司发布了增持完成的情况，结果，响应公司增持倡议的员工少得可怜。如罗牛山(000735,股吧)，只有6名员工响应增持倡议，合计增持47.88万元。而罗牛山可能还算好的，长城影视(002071,股吧)只有2名员工响应增持倡议，合计增持2800股。还有更惨的，长城动漫(000835,股吧)，仅有1名员工响应增持倡议，而且只增持了1000股，大概1万元。"
		},
		{
			"post_id": 81,
			"title": "New blog post",
			"date_published": 1497449780.903,
			"body": "The US Federal Reserve has raised its key interest rate for the third time in six months, providing its latest vote of confidence in a slow-growing but durable economy.\n\nOfficials also announced plans to start gradually paring its bond holdings later this year, which could cause long-term rates to rise\n\nThe increase in the short-term rate by a quarter-point to a still-low range of 1 per cent to 1.25 per cent could lead to higher borrowing costs for consumers and businesses and slightly better returns for savers.\n\nThe Fed foresees one additional rate hike this year, unchanged from its previous forecast. It gave no hint of when that might occur.\n"
		},
		{
			"post_id": 80,
			"title": "space walker",
			"date_published": 1497449124.701,
			"body": "Blog post body"
		},
		{
			"post_id": 79,
			"title": "space builder",
			"date_published": 1497446996.373,
			"body": "practically we are still two dimensional farmer. \n\nhow to use all the space above us? that is inifitely larger and the ultimate loot.\n\ni think the first meaningful project is right on hand - take care of the tree in my yard."
		},
		{
			"post_id": 78,
			"title": "New blog post",
			"date_published": 1497446845.312,
			"body": "\nBEIJING (AP) — The International Monetary Fund urged China on Monday to speed up reforms meant to slow surging growth of debt that is fueling concern about the stability of its financial system.\n\nThe announcement adds to mounting warnings China's rapid run-up in debt due to reliance on lending to counter the 2008 financial crisis could drag on the economy or threaten the state-owned banking system. The Moody's ratings agency cut China's credit rating on May 25, citing the risks from rising debt loads.\n\nChinese leaders have begun to take action but need to move faster, said David Lipton, the IMF's chief deputy managing director. He spoke after meetings with finance, economic planning and central bank officials.\n\n\"Reform progress needs to accelerate to secure medium-term stability and address the risk that the current trajectory of the economy could eventually lead to sharp adjustment,\" said Lipton at a news conference.\n\nCommunist leaders have promised repeatedly to reduce reliance on debt and make China's state-dominated economy more market-oriented, but private sector analysts say they are moving too slowly.\n\nThe IMF expects China's economy to grow by 6.7 percent this year and to average 6.4 percent annually in 2018-2020, Lipton said.\n\nLipton urged Beijing to move faster in carrying out promised reforms aimed at making the state-dominated economy more productive by giving market forces a bigger role and nurturing growth based on consumption instead of trade and investment. He said that should start while growth is relatively strong and can help to ease the transition.\n\n(claiming low consumption is nonsense, just look at hte fuking nunnies and street sweepers all use iphones.)\n\nEstimates of China's total nongovernment debt have risen from the equivalent of 170 percent of annual economic output in 2007 to 260 percent as of last year, unusually high for a developing country.\n\nRegulators say reducing financial risk is a priority this year. They have launched initiatives to reduce debts owed by state companies, including by allowing banks to accept stock to repay loans, but reform advocates say they need to move faster.\n\nThe rapid expansion and increased complexity of Chinese financial industries \"has become a risk,\" said Lipton. He noted regulators have begun taking action to slow that growth and improve oversight.\n\nLipton acknowledged reining in credit growth might affect the economy, but said, \"if there is some sacrifice in growth, it will be well worthwhile in avoiding risks of interruption of growth in the future.\"\n"
		},
		{
			"post_id": 77,
			"title": "with weak economic report released before the fed meeting, gold jumped",
			"date_published": 1497442790.377,
			"body": "we expect fed remain on the move to hike, but the tone may change, and the sept may cast some doubt.\n\ngold will jump, great time to sell, keep selling as it moves higher. what follows after the jump could be huge fall."
		},
		{
			"post_id": 76,
			"title": "the beach project summery",
			"date_published": 1497442361.54,
			"body": "150 \n90\n\ntotal 240 so far.\n160 to be generated to make up the whole."
		},
		{
			"post_id": 75,
			"title": "dog fang strangy for the second half of 2017",
			"date_published": 1497440248.362,
			"body": "it will go down touching 13.00 first, then may rebound. \n\nfirst buying point 13.00, rebound selling point 13.50;\n\nsecond buying point 12.50, rebound selling point 13.00;"
		},
		{
			"post_id": 74,
			"title": "New blog post",
			"date_published": 1497440172.436,
			"body": "周三股价跌幅最大的是在沪上市的地产开发商金地集团(Gemdale Corp)，安邦持有该公司20%的流通股，金地的股价收跌4.34%。\n\n按销售额计为中国第二大住宅地产开发商的万科(China Vanke)，在深市收跌2.95%。2015年，在一场高调的董事会争斗战中，安邦增持了万科的股份，当时安邦与竞争对手宝能(Baoneng Group)试图获得万科的控制权。\n"
		},
		{
			"post_id": 73,
			"title": "6月14日农业部网站公布，中国农业部发布2017年转基因生物安全证书进口清单，批准孟山都、拜耳 、先正达等公司的大豆玉米等部分产品。这也是今年习特会上特朗普的要求，现在正式批准了。估计转基因农产品，与牛肉、天然气等，成为美国对中国出口的主力军。",
			"date_published": 1497439826.24,
			"body": "the life implication of this is clear."
		},
		{
			"post_id": 72,
			"title": "在下周四公布是否入摩前，权重股还会作最后努力，使得8类题材股不会出现集体行情，但是，妖股则提前开始表演，下周四后进入8类题材股行情中，权重股行情结束",
			"date_published": 1497439044.575,
			"body": "Blog post body"
		},
		{
			"post_id": 71,
			"title": "Uli Sigg: How I built the world's biggest collection of Chinese contemporary art",
			"date_published": 1497438747.62,
			"body": "Sigg became the largest private collector of contemporary Chinese art in the world.[5] His collection included \"2,000 works by more than 350 Chinese artists\".[3] Meanwhile, in 1997, he started the annual Chinese Contemporary Art Awards.[1]\n\nIn 2012, he donated 1,463 works by 350 Chinese artists from his collection to the M+, a new museum in Hong Kong,[3] scheduled to open in 2019\n"
		},
		{
			"post_id": 70,
			"title": "Christie's to auction 4.6-billion-year-old meteorite 'a third as old as time itself' ",
			"date_published": 1497435069.478,
			"body": "Blog post body"
		},
		{
			"post_id": 69,
			"title": "New blog post",
			"date_published": 1497432552.891,
			"body": "Dogecoin (/ˈdoʊʒkɔɪn/ DOHZH-koyn,[1] code: DOGE, symbol: Ð[2] and D) is a cryptocurrency featuring a likeness of the Shiba Inu dog from the \"Doge\" Internet meme as its logo.[3][4][5][6] Introduced as a \"joke currency\" on 8 December 2013, Dogecoin quickly developed its own online community and reached a capitalization of US$60 million in January 2014;[7] as of June 2017, it has a capitalization of US$440 million.\n\nCompared with other cryptocurrencies, Dogecoin has a fast initial coin production schedule: 100 billion coins have been in circulation by mid 2015 with an additional 5.256 billion coins every year thereafter. As of 30 June 2015, the 100 billionth Dogecoin has been mined.[8] While there are few mainstream commercial applications, the currency has gained traction as an Internet tipping system, in which social media users grant Dogecoin tips to other users for providing interesting or noteworthy content.[9] Many members of the Dogecoin community, as well as members of other cryptocurrency communities, use the phrase \"To the moon!\" to describe the overall sentiment of the coin's rising value. Thanks to crowdfunding efforts, a gold coin representing the cryptocurrency is scheduled to reach the Moon's surface in 2019\n"
		},
		{
			"post_id": 68,
			"title": "zen jewel strategy for the second half of 2017",
			"date_published": 1497432477.657,
			"body": "with all the black swans flew away, we expect no major event to alter the risk behavior of the global investors, gold will only drift lower over time, maybe over the next one or two years.\n\nsell only if it continues the rise;\napply strick buy back 5% rule, or 5 mao rule. \n"
		},
		{
			"post_id": 67,
			"title": "New blog post",
			"date_published": 1497432013.452,
			"body": "Titcoin (Ticker Symbol: TIT[1]) is a type of digital currency called a cryptocurrency that uses cryptography on a decentralized peer-to-peer network to manage the issuance of new currency units while simultaneously processing transactions.[2] Titcoin is a derivative of the bitcoin source code with key modifications to the software which greatly improve transaction speeds and network difficulty readjustments.[3] Titcoin is exclusively designed for and marketed towards the adult entertainment industry to allow owners of the currency to pay for adult products and services without the fear of incriminating payment histories appearing on their credit cards.[4][5]\n\nTitcoin is notable for being the first altcoin fully recognized as a legitimate form of currency by a major industry trade organization. In 2015, Titcoin received two nominations at the 2015 XBIZ Awards ceremony which honors companies that play an essential part in the growth and success of adult entertainment\n"
		},
		{
			"post_id": 66,
			"title": "New blog post",
			"date_published": 1497430923.873,
			"body": "Citizen science (CS; also known as crowd science, crowd-sourced science, civic science, volunteer monitoring or networked science) is scientific research conducted, in whole or in part, by amateur (or nonprofessional) scientists. Citizen science is sometimes described as \"public participation in scientific research,\" participatory monitoring and participatory action research.[1]"
		},
		{
			"post_id": 65,
			"title": "digi currencies",
			"date_published": 1497430623.922,
			"body": "https://en.wikipedia.org/wiki/List_of_cryptocurrencies"
		},
		{
			"post_id": 64,
			"title": "total investment capital reallocation",
			"date_published": 1497416038.56,
			"body": "given the bearish outlook to the cock market, we decrease the total allocation to the cock market by 600K. will allocate this to dollar assets.\n\nwill this too much influence our returns? no.\n\nwe just need to apply a more strict trading policy. we have all seen the dramatic return one could achieve if we pick the right vehecle. \n\ngiven the limit of smaller capital now, we need to give up the small ranges of trading, and wait for big correction to occur first before commiting capital. \n\nless capital can be a good thing. \n\nthe truth is - given whatever situation, there is a good way to gererate superior returns."
		},
		{
			"post_id": 63,
			"title": "Bitcoin me: How to make your own digital currency ",
			"date_published": 1497415123.47,
			"body": "\nLast modified on Tuesday 21 February 2017 18.59 GMT  \n \n\nBitcoin may have become a thing of fascination for the media very recently, but the digital currency actually celebrated its fifth birthday this month as its value hovered at around $1,000 per coin.\n\nBitcoin was never intended to be the one cryptocurrency to rule them all, because anyone can make their own version of it. The code which underpins the currency is released under what's known as an open-source licence. Anyone can use it themselves, and alter any aspect they want, in order to create a whole new currency.\n\nA whole class of alternative crypto-currencies, based on the fundamental aspects of bitcoin, have been created over the past couple of years. The first and biggest of the \"altcoins\", called Litecoin, was created in 2011 to address some perceived flaws in the Bitcoin protocol.\n\nLitecoin is much harder to build specialised \"mining\" machines for, which, according to its founders, prevents it from being dominated by a few rich miners. Additionally, it clears payments faster and has a much higher cap of 84m coins.\n\nSince November 2011, Litecoin has tracked the value of Bitcoin fairly closely, but in December last year it spiked in value. Overnight, a Litecoin was worth 10 times what it had been before, and its total market cap now stands at $623m, around 16% of that of its parent.\n\nWow, very cryptocurrency\n\n\n\nAdvertisement\n\n\n\nMeasuring press attention alone, Litecoin is surely eclipsed by another altcoin with a far more compelling hook: Dogecoin.\n\nWhereas Litecoin requires an already deep understanding of cryptocurrencies to explain the ways in which it improves on Bitcoin, Dogecoin has simpler selling point: it's got a picture of a Shiba Inu dog on the front.\n\nRead with a straight face, it's a triumph of marketing. Take a field which anyone can enter, and where the average user has little or no way to distinguish between competing examples; and then whack the most popular meme of 2013, Doge, on the front of your own. (Doge, for those of you still unaware, is a meme involving pictures of a confused-looking Shiba Inu with brightly coloured comic sans text surrounding it, spelling out in idiosyncratic broken English the animal's thoughts. Wow. Very internet. Such bafflement.)\n\nExcept, of course, reading it with a straight face is not the point: Dogecoin was created as a joke, to appeal to the sort of person who would find it funny. And it worked – the total value of all Dogecoins in circulation is now worth almost $7m, making it the 16th most valuable alt coin in existence.\n\nIf it seemed like Dogecoin was the pinnacle of the altcoin madness – coinmarketcap.com, which only tracks the ones people have actually bothered to buy and sell on exchanges, already records almost 70 – then the news from Thursday that a few coders were preparing to launch a currency based on Kanye West called, naturally, [Coinye West], proves that the idea still has legs.\n\nHow to make your own vanity money\n\n\nAdvertisement\n\n\n\nSo obviously I wanted a piece of the action. It was time to launch Herncoin.\n\nIt turns out, though, that cloning bitcoin is actually harder than it looks. Although the code behind the currency is open source, it's not like the designers have just left a nice file where you can change a few lines of code to end up with a whole new currency.\n\nIt actually takes some serious programming ability to get started: Dogecoin's technical co-founder, a software engineer from Portland, had to put in a couple of days of solid work to get the currency off the ground. Without a solid backing in C programming in the C language, I had no hope of creating Herncoin myself.\n\nThankfully, Matt Corallo, a veteran bitcoin developer, came to the rescue. On Friday, he opened the doors to Coingen.io, offering to create a forked version of Bitcoin for anyone with 0.01 BTC (around $10) to spare.\n\nWith Corallo's tools, the job becomes the work of minutes.\n1Get yourself some bitcoin. You'll need 0.01 BTC to make your own altcoin, but if you're serious you'll want to splash out another 0.1 BTC to get the source code to your creation. Though… if you're actually serious, you probably want to hire an actual programmer to code your vanity money.\n2Customise your coin. Coingen.io lets you pick a name and a logo, and then alter the starting paramenters of bitcoin as you see fit. If you have strong opinions over how many bitcoins should be given as a reward for mining, this is your chance to have a say. Again, though, if you have strong opinions about that sort of thing, maybe an off-the-shelf cryptocoin isn't for you.\n3Download your vanity coin. It'll only work on Windows or Linux, sadly, but just run the finished software and away you go. I'll leave the hardest bit – finding someone else to join in – to you.\n\nI couldn't resist. A few seconds in an image editor to whip up a logo and Herncoin was born (you can download the program yourself):\n\n   \n        Herncoin \n  One Herncoin Photograph: /Alex Hern \n\nFollowing the theme of vanity, I set the initial parameters of the coin to a series of numbers based on my name. So, for instance, the first few blocks \"mined\" will give 112,524 coins to the computer that mines them – that's Alex spelled out in numbers, with 1 for A, 12 for L, and so on – and other characteristics done the same way.\n\nOnce the payment had processed, I was delivered the necessary tools to run my Herncoin.\n\nDemocracy and currency\n\n\nAdvertisement\n\n\n\nIt's all silly, obviously, but there's an important point behind the proliferation of altcoins. To bitcoin advocates, they represent the democratic underpinning of the currency – a democracy far fairer than the unaccountable central banks which run real-world currencies.\n\n\"Bitcoin enforces majority consensus,\" says Mike Hearn, a developer of the currency. \"By taking part in the economy and running the software, or by choosing which alt coins you accept, you are effectively voting on how the currency should work… We'd like Bitcoin to be perfect, of course. If lots of people started switching to an alt coin, there'd be pressure to upgrade Bitcoin to match the alt's advantages.\n\n\"We must remember that our existing currencies are controlled entirely by private banks,\" he adds. \"The central bank in most countries is not a democratic institution or even a government controlled one – indeed that's the whole point of them. The Bank of England was given independence precisely because politicians knew they could not be trusted with the power to print money.\"\n\nIn this view of the world, the existence of Litecoin acts as a competitor to bitcoin, allowing uses to vote with their wallets in a very literal sense: if they would rather have Litecoin's benefits, they can start taking that currency, and if too many people switch, bitcoin will be forced to make concessions. It's as though, if you thought the interest rate was too low in the UK, you could start using yen instead.\n\nHerncoin doesn't offer any of such improvements. Instead, it's mostly focused around my face and my name. As a result, it seems to be having trouble taking off. I've been mining Herncoins on and off for a couple of days and, other than making my laptop really, really hot (we're talking \"if I didn't quite like this laptop I would fry an egg on it for the photo opportunity\" hot), not a huge amount has happened. Well, I've accrued a wealth of several million Herncoins, but not much else. No one else has connected to my network, which means my money may as well exist as a text file on my computer reading \"Alex Hern is really quite wealthy\".\n\n\nAdvertisement\n\n\n\nBut it's an alternative of sorts. The question for bitcoin is whether the ability to make alternatives like Litecoin (and Herncoin) lessens the responsibility on those who control the currency to take a pro-active stance in managing the bitcoin economy, like that which we require of central bankers. If the Bank of England releases data showing the quantitative easing isn't working to boost the economy, we wouldn't accept Mark Carney telling us that we're free to move to France if we don't like his style.\n\nThe sci-fi author Charlie Stross, in a piece titled \"Why I want Bitcoin to die in a fire\", argues that: \"Bitcoin looks like it was designed as a weapon intended to damage central banking and money issuing banks, with a Libertarian political agenda in mind.\" The economist Paul Krugman approvingly cited Stross's conclusion in his own piece headlined \"Bitcoin is evil\".\n\nFor Hearn, the inability of bitcoin to respond to economic events the way managed currencies do is an unambigious positive. The bitcoin model, he says, \"is not only more democratic but more robust. Although central banks are undemocratic and unaccountable, they are nonetheless run by people who can be put under lots of pressure. We saw this in recent years with the euro… Politicians made a lot of very public noise about how Mario Draghi was personally responsible for destroying the euro, and he eventually folded.\n\n\"So we currently have the worst of all worlds.\"\n\nI'm not so sure. After three days of running my own currency, I'm fairly certain that a world based on Herncoin would be significantly worse.\n"
		},
		{
			"post_id": 62,
			"title": "how hard to maintain and build a new digital currency?",
			"date_published": 1497414720.228,
			"body": "this will be a good question to study."
		},
		{
			"post_id": 61,
			"title": "zen jewel observation",
			"date_published": 1497399846.455,
			"body": "the buying and selling volume is high, actively bid and asked. this is a sign of future violent move, either up or down. \n\nthe question is - will it more likely move up, or down?\n\nto significantly move up, it will have to have two conditions:\n- it is a great stock in itself, this is never the case, because it is a crooked, full of corruption company;\n- the outside event has to be violent and completely out of expectation, this is a wild card, nobody knows;\n\ngiven this observation, it is more likely to move lower, to 8-9 price range, then we can see the situation, particularly its volume, and then we can decide if that is bottom or not.\n\n"
		},
		{
			"post_id": 60,
			"title": "Stone leaves in small but telling details, too, such as a few moments of Putin speaking English between shoots – “Coffee, Sir? Sugar?,” he asks, becoming Stone’s waiter – and Stone wondering whether a call on the Washington-Moscow hotline is conducted on first-name terms: “Yes. It’s ‘Barack’ and ‘Vladimir’.”",
			"date_published": 1497399646.114,
			"body": "Blog post body"
		},
		{
			"post_id": 59,
			"title": "The director has always specialised in presidents: a fictional trilogy about US commanders-in-chief – JFK, Nixon, W – and documentaries such as Commandante and Castro in Winter, portraits of the Cuban leader Fidel Castro, and South of the Border, in which Stone met seven South American interviewees including President Hugo Chávez of Venezuela.",
			"date_published": 1497399350.791,
			"body": "Blog post body"
		},
		{
			"post_id": 58,
			"title": "Emmanuel Macron says door to remain in EU is open to Britain - that is what a leader should do and needed in this simple time",
			"date_published": 1497399315.147,
			"body": "he has no time to do the economic calculation, but he has an simple instinct, and that makes him a good leader. "
		},
		{
			"post_id": 57,
			"title": "New blog post",
			"date_published": 1497361273.025,
			"body": "Three Chinese men arrested in Thailand have acknowledged that they were operating a \"click farm,\" using hundreds of cellphones and several hundred thousand SIM cards to run up \"likes\" and views on WeChat, a Chinese social media mobile application, Thai police said Tuesday.\n\nImmigration Police Capt. Itthikorn Atthanark said the men explained they were paid according to how many likes and views they generated, each earning 100,000-150,000 baht ($2,950-$4,400) per month. Click farms are hired to inflate an online site's viewership for prestige and profit. Some politicians boast of how many followers they have on social media, while clicks can generate ad revenue.\n\nWeChat is China's most prominent online social media platform, incorporating a text-messaging service as well as marketing for online stores.\n\nPolice seized 476 cellphones and around 347,200 SIM cards during the arrests Sunday at a house in Sa Kaeo province, about 200 kilometers (120 miles) east of Bangkok. The men, identified as Wang Dong, Niu Bang and Ni Wenjin, were charged with working without a permit and importing the phones without paying taxes.\n\nItthikorn said the arrests followed a police stakeout at the Sa Kaeo house after receiving reports of suspicious activity. He said a police search Monday at another residence believed to be engaged in the same activity came up empty-handed, though police believe others connected with the business are still at large. It is still unclear how the men obtained such as large number of SIM cards, which came from Thailand's three biggest cellphone service providers.\n"
		},
		{
			"post_id": 56,
			"title": "北京时间周四02:00，美联储（FED）主席耶伦（Janet Yellen）将召开新闻发布会。我们认为美国加息25个基点的概率很大，周二大盘提前上涨，说明了本次行情将在周四美国加息落地后正式进入主升，一直延续到下周三，这个行情是为下周四入MSCI的炒作行情",
			"date_published": 1497361029.09,
			"body": "今日两市股指小幅低开5点于3134，最高为3155，最低为3131，收盘为3153，微涨0.44%，成交量缩小到1485亿，日K线为小阳线，两市涨停共4有58家，跌停有1家。\n\n 今天走势特点有：1、首先今天涨停增加37家，跌停减少15家，今天涨停家数大幅增加，也是近期最多的一天，而跌停大幅减少，可见今天题材股炒作比较火爆；2、今天领涨的是煤飞色舞，并由此激发了许多题材股，比如锂电池，同时次新钴股涨停又刺激了次新股和除权股的大幅上涨，使得今天出现了稍有的普涨行情；3、今天大盘阳包阴，从K线组合来看不错，但是，今天上涨幅度不大同时成交量缩小，盘面热点过于分散，这样的上攻很难持续，无量上涨，且到了关键压力点3168前沿，这有诱多成分；4、北京时间周四（6月15日）02:00，美国联邦公开市场委员会（FOMC）将公布利率决议及政策声明，同时也将公布最新经济预期；北京时间周四02:00，美联储（FED）主席耶伦（Janet Yellen）将召开新闻发布会。我们认为美国加息25个基点的概率很大，周二大盘提前上涨，说明了本次行情将在周四美国加息落地后正式进入主升，一直延续到下周三，这个行情是为下周四入MSCI的炒作行情；5、从五步循环技术指标之波段HK来看，沪市走平还没拐头，但是，只要再出一根中阳线，那么所有指标都将走好，因此，我们认为，后市多头进入赶顶的行情的概率很大。\n\n 总结以上分析，慧耕思的结论是：1、周三大盘五步循环技术压力点在3158，支撑点在3122，周三大盘将杀跌收盘的概率很大，实质是提前规避美国加息，同时也是换筹，转换热点的需要；2、慧耕思认为，周三杀跌，将依旧是题材股被抛弃，资金将再度流入漂亮50或漂亮150中的尚未被挖掘充分的个股；3、周四凌晨美国若加息，周四大盘则低开高走，进入迎入摩最后段火爆行情中，行情延续到6月21日前夕结束，这是个蓝筹股最后段主升行情！\n\n操作策略：1、周二题材股大涨是诱多，周三投资者应果断抛掉纯粹题材而无成长性的个股，并利用大盘杀跌，在收盘前夕买入蓝筹股，迎接主升行情，小资金投资者则可延迟到周四低开买入！2、在前期漂亮50外，由沪深300中筛选新的漂亮150备选股，目前我们已经在圈内发帖公布，投资者可立即进圈子获取，我们认为，在周四加息靴子落地到入MSCI的一周里，最具爆发力的就是前期没被爆炒的二线蓝筹股！这是上半年最确定性的赚钱机会，必须把握住！\n"
		},
		{
			"post_id": 55,
			"title": "the family note - a meaningful start",
			"date_published": 1497350963.895,
			"body": "http://127.0.0.1:43110/1F5Wt9SYxhf5jKzH4VMMJEvTfdoA6yXcLv"
		},
		{
			"post_id": 54,
			"title": "Why China no longer fears the Fed  \n\nPBoC expected to hold rates despite narrowing interest rate differential with US\n",
			"date_published": 1497350900.682,
			"body": "Blog post body"
		},
		{
			"post_id": 53,
			"title": "Diplomatic win for China as Panama ditches Taiwan ",
			"date_published": 1497350892.285,
			"body": "Blog post body"
		},
		{
			"post_id": 52,
			"title": "is the whole market collapsing slowly over time?",
			"date_published": 1497345174.07,
			"body": "we assume this is the case. \n\nthe only opportunity for profit is from the fall and rebound."
		},
		{
			"post_id": 51,
			"title": "2017年5月北京房价中位数为61856元/平方米，上海为54458元/平方米，深圳为50523元/平方米，厦门为37667元/平方米，分别居全国前四位。北京房价达到超一线城市水平，厦门房价超过广州，达到准一线城市水平。省会或直辖市中，重庆、长沙、沈阳、太原、西安房价中位数均在万元以下，不及东部一些县级市房价。",
			"date_published": 1497345111.99,
			"body": "Blog post body"
		},
		{
			"post_id": 50,
			"title": "缩量上涨，这里不排除散户进场机构只出不进的玩法",
			"date_published": 1497344685.085,
			"body": "Blog post body"
		},
		{
			"post_id": 49,
			"title": "缩量反弹难持续 大行情还缺绝望式缩量杀跌",
			"date_published": 1497343748.064,
			"body": "Blog post body"
		},
		{
			"post_id": 48,
			"title": "weired thing",
			"date_published": 1497338402.769,
			"body": "so it rebounded in a standard fashion.\n\nbut the weired thing is - if more people buy today and that is how and hwy it rebounds, why more people were selling it at lower price yesterday? this is the strangest thing of the market, any market. there is no change in the world from yesterday to today.\n\nit is a crowd thing. people are waiting and seee, see if there is a first one to buy first, then they will follow. \n"
		},
		{
			"post_id": 47,
			"title": "防冲关MSCI蓝筹见光死 ",
			"date_published": 1497338332.765,
			"body": "Blog post body"
		},
		{
			"post_id": 46,
			"title": "dog fang observation tuesday",
			"date_published": 1497338041.664,
			"body": "the trading traits indicate it is strongly controlled by the fuking cock:\n- at two points where there are large hanging selling orders, it cleared them in one shot, keeping the pankou light. this is a sure signal of the existence of an alerting zhuang;\n\n"
		},
		{
			"post_id": 45,
			"title": "cock market tuesday",
			"date_published": 1497313563.652,
			"body": "market tanked on monday, rebounded today, volume is small. this is just a standard rebound from the harsh fall on monday, with 50% loss recovered. judging by this, the market is not yet in any sort of panic mood. it is a falling course well understood by all. \n\nsq continues its strong rally, among the a50, that is why. this may continue for a while.\n\na small range trade - bought 2000 shares of dog fang yesterday, sold it today to lock in a small profit.\n\nnext buying point for dog fang should be lower - 13.40 is proper. for the next few days we expect it to ossilate in the current range 13.50 to 13.70\n\n"
		},
		{
			"post_id": 44,
			"title": "dog fang strategy ",
			"date_published": 1497313163.728,
			"body": "at 13.00 there should be one round of rebound, with reboudning target price at 13.50. \n\nand then the decisive striking down will push it down to 12.50 area, in one shot. that is the time to start to buy again. the resulting rebound will also be 13.0 -13.50 area.\n\n\n\n"
		},
		{
			"post_id": 43,
			"title": "zen jewel review",
			"date_published": 1497312916.785,
			"body": "Blog post body"
		},
		{
			"post_id": 42,
			"title": "this needs to be confirmed ",
			"date_published": 1497312890.539,
			"body": "2017 06  07    anz   yongchunzhang   62000\n\nthis is received. the system is still working well."
		},
		{
			"post_id": 41,
			"title": "investing - the third thing",
			"date_published": 1497312137.945,
			"body": "first thing - earth and enclosed space \nsecond thing - equity \nthird thing - "
		},
		{
			"post_id": 40,
			"title": "dog fang strategy next",
			"date_published": 1497310401.162,
			"body": "increase the price range, particularly when going down, and wait.\n\nnext buying point: 13.10\n\n12.60\n12.20"
		},
		{
			"post_id": 39,
			"title": "a case study and why small companies across the glober are risky",
			"date_published": 1497281523.345,
			"body": "It is a tale of intrigue involving millions in lost shareholder value, radical new technologies and a failed joint venture with alleged links to a member of the Hells Angels.\n\n\n\nKey points:\n•LWP's shares are almost worthless\n•Investors are calling for ASIC to investigate\n•LWP's market capitalisation has dropped from $40 million in mid-2015 to $6 million today\n\nDisgruntled shareholders have accused Brisbane-based firm LWP Technologies of destroying millions in shareholder value without producing any income. \n\nLWP persuaded investors that its fly ash-based proppant — tiny balls used to keep fissures open when fracking — was a game-changer for the industry.\n\nBut now the company's shares are almost worthless and investors are calling for the Australian Securities and Investments Commission (ASIC) to investigate.\n\n'It seemed like a no-brainer'\n\nPerth-based Brad Chapman has worked in drill and blast mining for 20 years. He spent $650,000 on LWP shares, making him one of the ASX-listed firm's biggest investors.\n\n\"Fly ash was an abundant resource, cheap, and the technology these guys said they had to be able to turn this into proppants made it much better than what was on the market for the price you could get it at,\" he recalled.\n\n\"It seemed like a no-brainer — it looked very impressive.\n\n\"I've come to the conclusion they've not actually produced anything.\n\n\n\"If everything they predicted came true it should have been a real goer.\"\n\nHe sold his shares last year, making a $240,000 loss.\n\nLWP's market capitalisation has dropped from $40 million in mid-2015 to just $6 million today.\n\nThe company's shares are almost worthless, fetching just 0.1 cents, down from highs of 30 cents a share in 2009.\n\n\nEmbed: LWP's share price highs 2007-2017. \n\nASX confirms complaints from shareholders\n\nThe company's chairman, Siegfried Konig, told the ABC he was the second-largest LWP shareholder and had seen the value of his shares drop from $3.8 million to $350,000. \n\n\"Therefore, my holding and that of the other directors is 100 per cent aligned with LWP shareholders, and the board is making every effort to restore that value,\" he said.\n\nThe ASX told the ABC it had received many complaints from investors.\n\n\n\"LWP is a company whose issues have exercised a lot of ASX's attention. We have made multiple enquiries and taken a range of actions within the scope of our power,\" it said in a statement.\n\nThe ASX is also concerned about the management of the company, having recently required LWP to appoint independent directors and an independent governance expert. \n\nCompany has no obvious source of income\n\nTony from Brisbane spent $30,000 on shares in 2015, but sold out last year when he became increasingly concerned about a lack of progress and some of the company's investments.\n\n\"I was looking for a long-term hold, it had pretty promising technologies, but management — there were too many red flags for me,\" he said.\n\nLWP has no obvious source of income as it is yet to go into production or sell any product. It has not turned a profit since 2013, when it got a tax rebate, and posted a $7.6 million loss for the half-year to December 2016.\n\n\"They've alluded they've had contracts coming up in the works, but nothing has materialised over the last two years,\" Mr Chapman said.\n\nThe company appears to have survived by raising funds through issuing new shares, including $6.6 million in 2015, and a further $6 million from Lanstead Capital in 2016.\n\nMr Konig said the proppant product is ready for commercialisation, but the drop in the oil price has led oil and gas companies to cut back on capital expenditure.\n\nBut now, according to company accounts, the company has just $1.1 million in the bank, and the ASX has estimated LWP has cash outflows of $880,000 for the next quarter alone.\n\nThe dismal figures did not affect Mr Konig's wages — he was paid $430,000 last financial year.\n\n\n\"I think they're just milking it out now and they'll just close shop when that money's gone,\" Mr Chapman said.\n\nWith no income, the ASX was concerned the company would fold, so it sent a \"please explain\" letter in mid-May. \n\nMr Konig responded to the ASX with a statement saying the company was taking steps to achieve positive cash flow, including halving the pay of senior executives.\n\nFailed venture lands in court\n\nInvestors have accused management of making a raft of mistakes, including a failed joint venture with rechargeable battery technology company GraphenEra, which has ended in court.\n\nLWP spent $1.6 million and handed out 30 million shares to acquire 50 per cent of the battery patent. \n\nThe scientist behind the invention, GraphenEra director Victor Volkov, planned to set up a laboratory in Thailand to produce the graphene battery, which he claimed would compete with lithium batteries. \n\nLWP is now suing GraphenEra, alleging Mr Volkov mismanaged funds, and is seeking to cancel the joint venture and recover $770,000 and 30 million shares.\n\nSupreme Court documents show LWP sent a representative to Thailand, Bruce Dwyer, who said the laboratory, rented by Mr Volkov, \"was in fact at that stage an empty shed, factory that had been rented\".\n\nAn empty shed or factory containing ice cream machines. This was supposed to be a laboratory set up by Graphenera in Thailand.\n Photo: Investors say this photo, leaked to an investor chat site, shows the Thai laboratory. They say they want to see more photos of the lab's progress. (Supplied) \n\nMr Chapman said he believed LWP did not have sufficient controls over the running of the joint venture.\n\n\n\"My thinking on it is that the directors were absolutely incompetent to go ahead with it,\" he said.\n\nBut Mr Konig disputed that assessment, saying an independent third party introduced the board to the project, which had the potential to make LWP a very valuable enterprise and that he \"personally saw the lab construction in progress\".\n\nJoint venture company has alleged links to bikie gang member\n\nLast year Mr Volkov submitted a patent, naming a close relative as an inventor, to the patent office.\n\nPolice allege this family member is a patched member of the Hell's Angels. \n\nLWP met with Mr Volkov and his relative as part of its due diligence. \n\n\"The principal scientist assured the board that his relative had absolutely nothing to do with GraphenEra,\" Mr Konig said.\n\nA number of former LWP shareholders have made complaints to the Queensland Police, ASIC and the ASX, and are now considering a class action.\n\n\"These guys are downright greedy,\" Tony from Brisbane said.\n\n\"ASIC's done nothing and you complain to them and it's a black hole. Information comes in and nothing goes out.\"\n\nASIC declined to comment.\n\nInvestors criticise a range of LWP's decisions\n\nInvestors have criticised a number of LWP's decisions, including LWP investing $500,000 in a retail chain run by its former CEO Sean Corbin, who resigned from LWP in November 2016.\n\nMr Konig was also previously listed as a director of this retail company.\n\nWhile Mr Konig said the company did nothing wrong, the ASX forced LWP to undo the deal. \n\nThe ASX also forced Mr Konig and Mr Corbin to sell shares issued to their children, with profits to be donated to a charity. \n\nLWP executives were forced to sell 41 million shares acquired when LWP bought Mr Konig's private company Ecopropp.\n\nMr Konig conceded \"some of our previous company secretarial matters could have been handled better\".\n\nThe company was also caught out claiming it had independently tested its proppants, but in March was forced to write a retraction, blaming its investor relations team. \n\nThe testing had been done by LWP's former chief scientist. \n\n\n\"The accusation that testing was not independent is entirely false and without foundation,\" Mr Konig said.\n\nInvestors have also criticised LWP for making a $300,000 loan to a traffic signalling company Omnet, which went bust soon afterwards.\n"
		},
		{
			"post_id": 38,
			"title": "The Hakka tend to be a close-knit group -- a group that spans the world, with several million living abroad. It has produced numerous high-profile figures, including Sun Yat-sen, the leader of China's 1911 Revolution, and Lee Kuan Yew, Singapore's founding father and former prime minister.",
			"date_published": 1497279925.917,
			"body": "Blog post body"
		},
		{
			"post_id": 37,
			"title": "任何个股都有题材，都有潜在的利好.就算没有利好，也会给它挖出一个来强加上去.2008年底老炼推出深圳华强，当时三块钱，四亿股本，不到15亿市值，2009年之后，老炼多次公开说过，这个股的必到目标15元，但，这个股最终涨到接近一百，但老炼不知道它到底是什么利好导致的它的暴涨，总之，要涨的，必须要涨，所以老炼劝一些人，不要总盯着表面现象.那些幼稚的言论不要在老炼这里提.否则，就像在爱因斯面前滔滔不绝地讲”天狗食月“的故事一样可笑.",
			"date_published": 1497279914.607,
			"body": "Blog post body"
		},
		{
			"post_id": 36,
			"title": "所有的大亏都是贪和怕导致的，而对赚快钱和一夜暴富的期望又是贪和怕的本质原因。",
			"date_published": 1497279741.525,
			"body": "Blog post body"
		},
		{
			"post_id": 35,
			"title": "投资要想成功需要承认两个前提：第一，我们都是凡人，我们必将不断犯错；第二，投资的核心原理早已稳定，我们要做的不是创新，而是理解并执行。投资要想惨败可以建立在另外两个前提上：第一，我天赋异禀，我能做到别人做不到的；第二，我拥有或者发现了最新的炒股奥义，我在投资理论上已经帮人类跨出了新的一步。",
			"date_published": 1497279682.489,
			"body": "Blog post body"
		},
		{
			"post_id": 34,
			"title": "投资人的主动性努力不外乎以下几点：第一，寻找中长期经营提升确定性高的企业；第二，寻求中短期赔率好的价格；第三，构建能平衡黑天鹅风险和研究的有效回报的投资组合；第四，持续学习争取每年进步一点点；第五，保持身心健康，做好以上循环并耐心等待。其它的，基本就交给国运了。",
			"date_published": 1497279631.048,
			"body": "Blog post body"
		},
		{
			"post_id": 33,
			"title": "如果用最朴素的个人投资经验来看，我自己是如果一年不怎么赚钱，第二年大概率的就会有所收获，如果第二年还是不怎么赚钱，那意味着第三年一定是超级大丰收。",
			"date_published": 1497279518.068,
			"body": "Blog post body"
		},
		{
			"post_id": 32,
			"title": "人之所以平庸，是在平庸的机会上花费了太多的精力。当然如果连这点儿努力都没付出，那就不是平庸而是惨淡了。但要想超越平均水平，就需要把精力用来寻找和把握人生级别的大机会。而这又是以长期的思索、通透的判断体系为前提，并以异乎寻常的耐心和超乎常人的利益计算模式为基础的。",
			"date_published": 1497279455.672,
			"body": "Blog post body"
		},
		{
			"post_id": 31,
			"title": "投资很难赚到你不信的那份钱。往小了说，对一个公司没有充分的信心，最多只能赚到财务数据直接相关的那点儿钱，再远点长点的钱是不可能赚到的。往大了说，对国家未来从心底悲观，那么最多赚到几个波段的小聪明的钱，要赚大钱也很难了。格局、历史感这些东西在99%的时候都很虚，但在1%的重要决策时刻往往就是强大信念的真正支撑点。",
			"date_published": 1497279398.211,
			"body": "Blog post body"
		},
		{
			"post_id": 30,
			"title": "相比世界上的很多东西来说，人性都算是相当可靠的。遗憾的是，人性恶的那部分，总是更可靠一些。",
			"date_published": 1497279324.38,
			"body": "Blog post body"
		},
		{
			"post_id": 29,
			"title": "投资的窍门就是巧方法笨功夫。巧方法是指方法论体系，让你事半功倍，做到高效聪明的整合信息碎片形成完整认识；笨功夫，就是踏踏实实花时间花精力一点点去阅读、搜集和积累。市场里80%的人被笨功夫这层就淘汰了，基本失去超额收益的入围资格。剩下的又有一半儿被巧方法挡住了，原地打转收益与付出无法匹配。所以相当赢家，既要甘于“笨”又要善于“巧”。",
			"date_published": 1497279286.187,
			"body": "Blog post body"
		},
		{
			"post_id": 28,
			"title": "一个个大城市把制造业看多洪水猛兽，只留下房地产？还是金融业？          金融业和房地产都建立在实体制造业的基础之上，没有了制造业，所有的服务业都是空中楼阁。",
			"date_published": 1497279162.571,
			"body": "Blog post body"
		},
		{
			"post_id": 27,
			"title": "海外发达国家，正迎来智能制造迸发的前景。           智能制造所依赖的环境，不再是拼人工，而是土地成本、物流成本、能源成本、税负、知识产权、私权、法律环境等等全要素成本的竞争。",
			"date_published": 1497279085.811,
			"body": "Blog post body"
		},
		{
			"post_id": 26,
			"title": "New blog post",
			"date_published": 1497278972.504,
			"body": "中国企业只有两种发展路径，一种是不断的上项目，扩大企业规模来获得贷款，这是一种旁氏骗局，但可以依赖庞大的融资去资本市场套利，比如过去十年的投资房地产，试图玩弄期货投机的，死了不少。最后都集中到股权和股票圈钱游戏里，上市后，把整个旁氏骗局，找到兜底的股票，一抛了事。结果发现韭菜之密，割之不决，于是产生了市值管理，也就是大股东炒股票。           \n\n另一种路径是私企维持小规模的不借款的慢慢发展，很多中小企业维持了二十年的发展，伴随着合理逃税行为。后来他们有些抵不住诱惑，没有逃过新三板的收割，纷纷补税，以做漂亮财务报表。另一些，也就是大部分，将在营改增、金税工程、大数据监控和税务专管空前的严厉里，对社保缴纳越来越严厉的监控里，逐渐走向成本高昂，营商能力恶化的趋势。"
		},
		{
			"post_id": 25,
			"title": "未来几年会有千只中小创跌破净资产？",
			"date_published": 1497276924.884,
			"body": "this is a time to start search for a solid small cock, and wait for its complete crash and then buy.\n\nthe only question is - is there a real one at all in the cock market?"
		},
		{
			"post_id": 24,
			"title": "Goldman Sachs Thinks September Is When the Federal Reserve Triggers This Major Change",
			"date_published": 1497276388.377,
			"body": "we should cash out as we move into the late summer. or it would be too late."
		},
		{
			"post_id": 23,
			"title": "huge run up of zen cocks - this latest round could be done by the private youzi capital",
			"date_published": 1497276250.862,
			"body": "it seems youzi has switched battlefield, switching from small cap to the large main a50 or large zen cocks. \n\nthis is a great trading opportunity to get involved, given zen cocks are safe bets, little risks here."
		},
		{
			"post_id": 22,
			"title": "looking for the safe trading vehecle - case study - zen cock gj",
			"date_published": 1497274832.239,
			"body": "- it is completely manipulated, by zhuang\n- first was the huge pull up, this is unpredicable, only zhuang knows this by himself, but what followed after is predictable;\n- here there is a 10% profit taking opportunity.\n\nwaiting for the next zen cock gj like opportunity."
		},
		{
			"post_id": 21,
			"title": "a50 vs 3000 - the course going forward",
			"date_published": 1497273173.768,
			"body": "the cock determines to move forward with the same logic - pop up the a50 asset, and let all others down and burst. \n\ncontrol wise, it is ready to handle the 3000 downturn, no major risk.\n\nso 3000 cocksters will go lower, the only question is to go to what point. \n\ndown another 30%? then a rebound. then down more. that is the course."
		},
		{
			"post_id": 20,
			"title": "美国钢铁进口调查结果将出台 港官员警示97金融风暴再现",
			"date_published": 1497271121.741,
			"body": "周五港媒报道，香港财政司还是什么单位的一位官员陈家强警告，香港或再现97金融危机一幕，需要十分警惕。  这个老江湖说得不错，我在他之前就提示了，很明显的基线，无论基本面还是股市汇市等走势。只有个港交所的官员在称，老千股现象是港市的传统，并介绍什么投资者入股防骗等。二个官员的差距和品德一目了然。\n  再稍解释一下。前期我们央行改变了策略，通过与港人民币互换而用港元大肆购买美元，因为港元是可自由兑换的。港府拿了大把人民币没什么用，咋办呢，央行开通债市通让他们这些人民币来购买内地债券。  需注意的是，所谓即将开通的债市通是单向的，即香港投资者可买内地债券，内地投资者不可买港市债券。原因见上，呵呵。\n  我们央行拼命设法购美元，再抛美元稳定人民币汇率，非要搞个人民币升值让大家预期破灭，这个动作一点意义都没有，对我们国家有害无益。央行损失了巨大外汇，外储对于我们是相当宝贵的。  美财长近期一句话令我们央行做法效果泡汤了，美财长称近期中国花费了巨量外储，一部分用于稳定人民币汇率。他没说另外部分干啥了，一带一路开会需要大礼包，赴哈萨克斯坦访问也需要准备礼包，即将召开的金砖银行会议又需要大礼包，尤其近期号称衰退的巴西、南非急于要求金砖银行提供外汇贷款。还有最近批准的中企海外4百多亿美元的收购，也很花外汇。\n  这种明摆着的情况下，央行非要花巨大代价搞人民币升值些、搞脑子，真的很没意义，根本骗不了人，除了忽悠我们决策层自己。  香港再现97金融风暴的概率很大，港元狂贬、港股狂跌，到时要向北京求助或达5千亿美元。这次不同于97年，人民币同期也急速贬值也需要北京的外汇救助（97年不需要这点），我们外储吃得消吗。\n\n  6月9日日经网报道，美国启动讨论限制钢铁进口  美国特朗普政府以安全保障方面的理由，开始讨论部分限制钢铁产品的进口。美国《贸易法》中有条款规定，如果国防所需的国内产业的供给能力下降，可以采取提高关税等措施。预计美国商务部根据该法，近期建议特朗普总统采取对抗措施等。   在美国钢铁市场，进口产品占3成份额。中国的过剩产能导致进口钢铁价格下降，美国钢铁公司等美国钢铁巨头的业绩明显恶化。奥巴马前政权根据世界贸易组织（WTO）的规则，通过反倾销关税等加以对抗，但特朗普政权为了广泛限制进口，正在讨论基于美国法律的新措施。  特朗普在4月下旬发布的备忘录中，命令商务部部长罗斯调查钢铁产品的进口是否影响美国的安全保障。罗斯在6月8日召开的国会附属委员会会议上表示，将于近期向特朗普总统提交调查报告书。对于钢铁进口指出，“存在应该考虑的安全保障方面问题”。\n\n  美商务部的有关钢铁进口调查结果即将公布，估计会严厉限制钢铁低价进口，即再提高双反税率，这对于中国影响最大。\n  6月11日证监会新闻发言人邓舸近日表示，证监会集中公布2017年前4个月终止审查（申请撤回）和未通过发审会（被否决）IPO企业情况。其中，终止审查IPO企业35家，未通过发审会IPO企业18家。  下一步，证监会将强化发行监管，严格审核，在严防企业造假的同时，密切关注企业通过短期缩减人员、降低工资、减少费用、放宽信用政策、促进销售等方式粉饰业绩的情况，一经发现，将综合运用专项问核、现场检查、采取监管措施、移送稽查等方式严肃处理。\n  粉饰业绩、虚增业绩等，在内地属于财务技巧，并不算违法。举个例子，上市公司报表洗澡现象就很普遍，就是把以前虚增的或压低的，后期再做回来，其实本来很平稳没有突升突降的，就为了配合当时股价的高低而将报表硬拉高或压低。  如果这也算违法，那么我们股市中99%上市公司都有问题。\n  最近高盛发布个报告，称近十年来世界上就不存在价值投资之说，自从次贷危机后，价值投资成为忽悠心理和思维问题者的借口。  呵呵，大实话。"
		},
		{
			"post_id": 19,
			"title": "四大报评IPO：为大盘背黑锅不合时宜 应保持定力 ",
			"date_published": 1497270143.732,
			"body": "this is final - ipo will continue relatively large pace. the whole 3000 shits will keep moving down, there is no question about this. \n\nprepare to trade the downward curve.\n\ndown, but still make profit, that is the ultimate exercise, and trading skill."
		},
		{
			"post_id": 18,
			"title": "dog fang - a complete technical trading vehicle",
			"date_published": 1497270016.926,
			"body": "Blog post body"
		},
		{
			"post_id": 17,
			"title": "dog fang - the cycle of 10 trading days ",
			"date_published": 1497265454.243,
			"body": "it is completely possible to rebound from 13.00 area strongly back to 13.50 area, and traded there for 2 weeks. \n\nthen the second time striking down would be decisive and down through 13 and down to 12.50 in one shot. \n\nthis is the most likely scenario for the dog fang during the next few weeks. "
		},
		{
			"post_id": 16,
			"title": "where is the dog fang bottom?",
			"date_published": 1497264464.064,
			"body": "can this be answered with surety? what things should determine this bottom? in reality, there sure will be a factual bottom. who would know for sure? the big cock himself?\n\nif this is not possible to identify where the bottom should be, what is the best strategy?"
		},
		{
			"post_id": 15,
			"title": "learn from history",
			"date_published": 1497264183.217,
			"body": "history, of all kinds, teaches us again and again about the simple truth of life. it is so simple. yet many fail to learn and follow its advise. \n\nlearn history, and live our lives wisely."
		},
		{
			"post_id": 14,
			"title": "movie",
			"date_published": 1497260906.09,
			"body": "http://www.bilibili.com/video/av6185529/\n\nit is simple fact, life, but more dramatic than life could ever be.\n\nfaith, living a life that one desires and takes the result. "
		},
		{
			"post_id": 13,
			"title": "why we bought dog fang today? and when we should unload this shit",
			"date_published": 1497259008.581,
			"body": "it falls and the junkyard index of the 60-min, daily, and weekly, are all below 20. in particular, the daily junkyard index is below -10. that is a clear buy.\n\nthis means during the next few days we should have chance to unload this shit at higher price. the actual price of selling should be determined bythe daily junkyard index, when it hits 90 and above.\n\ncomparing to other shits, dog fang only fell by 1 yuan, about 5%, while many others fall by 20% or even more. from this, it is possible dog fang could fall another 10% readily from here 13.5, to 12.20 area. this is also consistent with the simple geometrical analysis of its fall. \n\nso we should assume and prepare it falls to 12.20. and take up position at 12.50 area, load up more, then sell into the rebounding target of 13.50. this will be a profitable trade we can plan for."
		},
		{
			"post_id": 12,
			"title": "swapping into zen jewel",
			"date_published": 1497258784.372,
			"body": "we should only buy small amount in dog fang. \n\nwait till the large fall of zen jewel and take on the long planned swapping position for dog fang, 30,000 shares in zen jewel if it falls into the target swapping price of 9.1"
		},
		{
			"post_id": 11,
			"title": "dog fang local highs for this period of time ",
			"date_published": 1497258509.917,
			"body": "before it hitting the next local low of 12.20, the local highs we are going to see is probably around 13.90, that is where we should aggressively sell. \n\nbut, once seeeing the next local low of 12.20, the high will only be 13.50;"
		},
		{
			"post_id": 10,
			"title": "dog fang selling and buying strategy - 5毛",
			"date_published": 1497258450.703,
			"body": "note 5mao is ok, it is only 4% range."
		},
		{
			"post_id": 9,
			"title": "dog fang strategy - 砸死他们，10元我再回来长期",
			"date_published": 1497258375.958,
			"body": "Blog post body"
		},
		{
			"post_id": 8,
			"title": "scheduled trade of dog fang",
			"date_published": 1497258039.115,
			"body": "current total 8000\n\nnext buys:\n13.3 - 2000\n13.1 - 2000\n12.9 - 2000\n12.7 - 2000\n12.5 - 2000\n12.3 - 2000\n\ntotal by 12.30 - 20,000 units\n\ntarget rebounding price - 13.50\n\n50 cents trade;\n"
		},
		{
			"post_id": 7,
			"title": "note that even at 12.20, it feels still very high. it ultimately will hit 10.00 in 2018",
			"date_published": 1497257940.641,
			"body": "given this prospect, we should keep our total position low, not more than 20,000 shares all the way down. trade ranges and rebounds."
		},
		{
			"post_id": 6,
			"title": "what is the next local minimum of dog fang? \n12.20",
			"date_published": 1497257605.076,
			"body": "simple linear extrapolation:\n\nthe next low is nth low;\n\nn-2 low: 14.6\t\tjan-16th\nn-1 low: 13.4\t\tmay-24th\nn low: 12.2\t\texpect to hit this low on about oct-15th\n\nthis seems very reasonable, it is just another 10% down from where we are now. \n\nthis is consistent with the big picture of the whole cock market - doomed to go LOW."
		},
		{
			"post_id": 5,
			"title": "first capital has at least 10% more to fall, so will be dog fang;",
			"date_published": 1497257494.92,
			"body": "first capital is 10% higher than its previous low. it is reasonable to assume it will break its previous low ultimately, probably soon;\n\ngiven this, dog fang will fall more too, breaking its previous low soon;"
		},
		{
			"post_id": 4,
			"title": "dog fang monday",
			"date_published": 1497253630.047,
			"body": "what happened to the first capital is haunting this shitty dog now, anticipating the huge selling off because of the large jiejing happened to the first capital, 3 dieting after its jiejing. \n\n2018-2 will see dog fang jiejin.\n\nthis is probably reason one for the larger than the security sector fall's fall. \n\nour fundamental judgment about this shit is correct \n- it is going to fall more over time;\n- the strength last two weeks are the result of a50 effect and protection of dapan by the big cock;\n- now it starts to make up the fall of the average cocks;\n- we significantly sold at 13.90 price range, now we see that is a smart move; we can slowly buy back as it falls;\n- we need to determine what is the next local minimum, and the likely timing of hitting that local minimum;\n\n \n\n"
		},
		{
			"post_id": 3,
			"title": "startnet - a great way to build up a connected personal knowledge world.",
			"date_published": 1497253456.946,
			"body": "Blog post body"
		},
		{
			"post_id": 2,
			"title": "the start of a new strategy",
			"date_published": 1497253079.859,
			"body": "here are the summary of the new strategy - \n\n- foundamentally, we distrust all cocksters in the cock market, and we take on the position and view that almost all cocks will doom to go down slowly over time for the next one year horizon\n- focus on one cockster only the zen jewel\n- larger range trade \n- go against the daily fool\n- rely more on the weekly and hourly junkyard indexes, not the daily one\n- apply the 5% balckout rule when selling out onthe top\n- waiting period longer\n- minimize daily trade"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}