{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1547153094_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd": 1
	},
	"next_comment_id": 4,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Cool!",
				"added": 1547065928
			}
		],
		"1547237644_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 2,
				"body": "I'm just going to throw this out there guys but the best way to get ZeroNet into the mainstream is: \n\nTo actually develop platforms and services that people want to use, and have a use for (and for purposes that aren't Immoral, IE CP)\n\nThe only way we're going to get every day ClearNet users on ZeroNet is to legitimize it. And we do that by making things.\n\nI agree with james007, spamming people to get on here, without any real products or services worth using on a daily basis, isn't really all that compelling of a proposition.",
				"added": 1547242591
			},
			{
				"comment_id": 3,
				"body": "> [quantumworld](#comment_139_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): We have allot of stuff here. And lots of piracy sites as well.\n\nIt's not the quantity but the quality. With the exception of a few zites, they do not compare to the quality that you see on the clearnet. My point is only, there is still room to grow and still things to be done as a community.\n\nWhat you are saying may be true, but it makes it all the more important that we get News (editorial and user generated), Day to Day Information (Weather), Reference Information (Including Survival Information, Maps, etc), and  a usable chat application that is E2E Encrypted and doesn't get bogged down with message history after the first 20k messages.\n\nWe need to give users a legitimate use for the service, beyond just piracy, if we're going to be a replacement for ClearNet sites.",
				"added": 1547250807
			}
		]
	},
	"comment_vote": {
		"1_1LcFu8h6fQA5SzmVgps4zoJBzicyU8Vxan": 1,
		"202_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"204_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"3_13ZQ4cvnb8eBBkFzRQeZGKtkCQPJZPc2GD": 1
	}
}