{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565702979,
			"title": "ZeroTalk clone/Forum software/chan clones",
			"body": "Hello team,\n\nI'm interested in starting a text-only forum akin to ZeroTalk, preferably anonymous and organized into categories/boards like a traditional forum or chan. Where should I start?\n\nThank you for your help.",
			"added": 1565702978
		}
	],
	"topic_vote": {
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"1565702979_1AbcdjqfVPUHJsKbvTjzCJJ5isjs7wRZxk": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 1,
				"body": "> [theosis](#comment_6_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): text\nNone of the \"just delete everything\" solutions are acceptable and thus far they seem the only way. I agree that text-only places are way of the future. I'm interested in illgal opinions, not illegal graphics. Does anyone know of any text-only platforms/forum that can be hosted on ZN? I'm interested in creating such a place. What I'm worried is that even though you won't host images, you can still host LINKS to illegal graphics, which is just as bad. Is hosting illegal content an inherent problem in the system?",
				"added": 1565202119
			},
			{
				"comment_id": 2,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_594_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Is hosting illegal content an inherent problem in the system?\"try to think:what you just said makes no sense.\n\nMaybe I didn't phrase it well. Is inadvertently downloading and seeding illegal content an inherent problem of the system. Makes perfect sense.\n\n> [styromaniac](#comment_881_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Maybe disable hyperlinks with CSS. That way nobody can blame you if they reach illegal content, because they would have to make a very conscious effort and couldn't claim their poor mouse cursor tripped over a hyperlink and broke its femur.\n\nTrue. You can still say \"go to enchanted forest dot com for some fun time\".  I'm starting to believe that the laws are very antiquated and definitely not up to date with technology.\n\n> [theosis](#comment_16_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): Links to illegal shit is not as bad as actually downloading said illegal shit on your machine because you visit an imageboard thread with a thumbnail.  [...]\n\nI don't want to be involved in the legal battle of finding out though. \n\nIn general, I'm looking at the Section 230 of the Communications Decency Act that reads \"No provider or user of an interactive computer service shall be treated as the publisher or speaker of any information provided by another information content provider.\"\n\nWe should be protected by the same act, as we, even though we are seeders of other opinion, we are not the authors.",
				"added": 1565203436
			}
		]
	},
	"comment_vote": {
		"378_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"18_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"3_12sqywVGbwufXxaZEHhiNATtJP5pipQ2XB": 1
	}
}