{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "In safari/osx the polls don't wrap the site correctly, and they veer off into the far right, making it really unusable. Fix soon?",
			"post_id": 10,
			"date_added": 1457396588
		},
		{
			"comment_id": 2,
			"body": "> [ekaterina](#comment_21_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): Weird, in Chrome it works fine and they both use WebKit. I don't have a Mac so I can't try it out myself, but I'll add a few vendor prefixes in the CSS, maybe Safari is a bit lagging behind Chrome and Firefox and still needs those.\n> If possible a screenshot would be great so I can better see what the problem is. And you do mean the whole poll, not the text or anything like that but the whole white box a poll is in veers off to the right without wrapping?\n\nClearnet link for a screenshot of what's happening: http://i.imgur.com/nbO9Aud.png\n\nAlso, I went ahead and checked with chrome, it indeed works there. So I guess it's just a safari issue.",
			"post_id": 10,
			"date_added": 1457397988
		},
		{
			"comment_id": 3,
			"body": "> [ekaterina](#comment_22_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): Might have to clear the cache to get the new css to display (Hold shift and click the reload button in Safari, according to Wikipedia that ignores the cache when reloading a site).\n\nHmmm... It's still doing it. I tried shift+reload, reloading, incognito/private mode, etc. Doesn't work.",
			"post_id": 10,
			"date_added": 1457399772
		},
		{
			"comment_id": 4,
			"body": "> [ekaterina](#comment_23_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): Then I either haven't added all the necessary vendor prefixes yet or your version of Safari is too old. Is it at least version 6.1? That one does in theory support all the features I make use of, as long as the right vendor prefixes are used.\n> I'll try to look over it again tomorrow, maybe I forgot to add a prefix somewhere or made a typo.\n\n\"Version 9.0.2 (11601.3.9)\" from the about section. Perhaps the cache hasn't caught up yet? I've had similar problems when working on Kaffiene. Where the site won't update in the cache for a while...",
			"post_id": 10,
			"date_added": 1457400953
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}