{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1
	},
	"next_comment_id": 14,
	"comment": {
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 1,
				"body": "#To Aru Majutsu No Index Dublado\nSituado em uma cidade de estudantes sobre-humanos cientificamente avançados, mas em um mundo onde a magia também é real. A mão direita de Kamijou Touma, a Imagine Breaker, vai negar todos os poderes mágicos, psíquicos, ou divino, mas não a sua própria má sorte. Um dia ele encontra uma jovem garota pendurada em sua varanda corrimão. Ela acaba por ser uma freira da Igreja da Inglaterra, e sua mente foi implantado com o Index-Librorum Prohibitorum-- todos os textos mágicos da Igreja retiradas de circulação.\n\n\n- https://www.superanimes.site/anime/to-aru-majutsu-no-index-dublado",
				"added": 1547230530
			},
			{
				"comment_id": 2,
				"body": "#Blue Dragon\nComo a vila de Shu estava sendo atacado por um inimigo desconhecido, ele e seus amigos, Jiro e Kluke decidem defender a sua casa. Eles logo encontram guerreiro Zola e recebem os poderes da Sombra, uma habilidade que nos deixa-los a transformar a sua sombra em um poderoso monstro. Shu recebe um dos monstros mais poderosos, Blue Dragon, e todos eles estabelecidos para derrotar seu inimigo.\n\n\n- https://www.superanimes.site/anime/blue-dragon",
				"added": 1547230555
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 3,
				"body": "Dizei ao justo que bem lhe irá; porque comerão do fruto das suas obras.\nAi do ímpio! Mal lhe irá; porque se lhe fará o que as suas mãos fizeram.\n\n- Isaías 3:10,11",
				"added": 1547230729
			},
			{
				"comment_id": 6,
				"body": "#Parábola do Fariseu e do Publicano\n\nPara algumas pessoas que confiavam em sua própria justiça e menosprezavam os outros, Jesus contou ainda esta parábola: “Dois homens subiram ao templo para orar; um era fariseu e o outro, publicano. O fariseu, em pé, orava em seu íntimo: ‘Deus, eu te agradeço porque não sou como os outros homens: roubadores, corruptos, adúlteros; nem mesmo como este cobrador de impostos. Jejuo duas vezes por semana e dou o dízimo de tudo quanto ganho’. Entretanto, o publicano ficou à distância. Ele sequer ousava olhar para o céu, mas batendo no peito, confessava: ‘Ó Deus, sê benevolente para comigo, pois sou pecador’. Eu vos asseguro que este homem, e não o outro, foi para sua casa justificado diante de Deus. Porquanto todo aquele que se vangloriar será desprezado, mas o que se humilhar será exaltado!” (Lucas 18:9-14).\n\n- Vídeo: https://mega.nz/#!frAnTK7Y!fNEE9T-NG9-ckrSrhl-oiCzVyB3WV1kA0Vce04wzO1E",
				"added": 1547241869
			},
			{
				"comment_id": 7,
				"body": "> [nanonano](#comment_6_17KvnHUDitqK2fURKEM85tbL18yJVbM6Aq): Parábola do Fariseu e do Publicano\n> Para algumas pessoas que confiavam em sua própria justiça e menosprezavam os outros, Jesus contou ainda esta parábola: “Dois homens subiram ao templo para orar; um era fariseu e o outro, publicano. O fariseu, em pé, orava em seu íntimo: ‘Deus, eu te agradeço porque não sou como os outros homens: roubadores, corruptos, adúlteros; nem mesmo como este cobrador de impostos. Jejuo duas vezes por semana e dou o dízimo de tudo quanto ganho’. Entretanto, o publicano ficou à distância. Ele sequer ousava olhar para o céu, mas batendo no peito, confessava: ‘Ó Deus, sê benevolente para comigo, pois sou pecador’. Eu vos asseguro que este homem, e não o outro, foi para sua casa justificado diante de Deus. Porquanto todo aquele que se vangloriar será desprezado, mas o que se humilhar será exaltado!” (Lucas 18:9-14).\n> \n> Vídeo: https://mega.nz/#!frAnTK7Y!fNEE9T-NG9-ckrSrhl-oiCzVyB3WV1kA0Vce04wzO1E\n\n#Lições da Parábola do Fariseu e o Publicano\nPodemos refletir sobre algumas lições práticas importantes que a Parábola do Fariseu e o Publicano nos ensina. Vejamos:\n\nEm primeiro lugar, a Parábola do Fariseu e o Publicano ensina que Deus perdoa erros e não justificativa. Em si mesmo, o fariseu considerava que não tinha do que se arrepender. Logo, ele também não tinha do que ser perdoado. Quando alguém não consegue reconhecer seu próprio pecado, isso pode ser o sinal de algo muito mais grave do que simplesmente o orgulho; isso pode até significar a ausência da genuína regeneração (cf. 1 João 1:8-10).\n\nEm segundo lugar, a Parábola do Fariseu e o Publicano ensina que não se pode impressionar a Deus. O fariseu tentou impressionar a Deus; ele fez isso se comparando à outras pessoas e mostrando o quanto era superior a elas. Ele se julgava diferente e acima de todos! O publicano, por sua vez, também se comparou às outras pessoas, mas ele se julgou inferior a todas elas. Ele classificou-se a si mesmo como “o pecador”. O apóstolo Paulo também fez o mesmo quando escreveu: “Cristo Jesus veio ao mundo para salvar pecadores, dos quais eu sou o principal” (1 Timóteo 1:15).\n\nEm terceiro lugar, a Parábola do Fariseu e o Publicano ensina que a glória pertence somente a Deus. A oração do publicano expressa uma verdade presente em toda a Bíblia, declarando que a salvação, do início ao fim, pertence a Deus e é atribuída à sua misericórdia e graça (cf. Salmo 51:1; Lucas 18:13; Efésios 2:8; Tito 3:5). O homem é incapaz de justificar-se a si mesmo. A oração do fariseu aparentemente parecia ser uma oração de gratidão. Aos olhos humanos, tal oração poderia realmente representar as palavras de alguém justo e distinto por sua religiosidade. Porém, aos olhos de Deus, tal oração era uma afronta, uma ofensa, pois na verdade ela atacava a glória de Deus, e tentava prover complementos humanos a perfeita obra da redenção.\n\nEm quarto lugar, a Parábola do Fariseu e o Publicano ensina que elogio humano pode ser perverso e enganoso. Quando o fariseu começou a se auto-congratular, ele disse que não era um ladrão, um desonesto e um adúltero. William Hendriksen, em seu comentário do Evangelho de Lucas, faz uma observação muito apropriada sobre isso. Ele percebe que tudo o que o fariseu dizia não ser, na verdade, ele era. O fariseu era o ladrão que naquele exato momento roubava a glória de Deus nas palavras de sua oração. Ele era o homem desonesto que defraudava a si mesmo. Por último, ele era o adúltero culpado do pior de todos os adultérios, ao apostatar do verdadeiro Deus (cf. Oseias 1:2; 5:3).\n\nA Parábola do Fariseu e o Publicano nos convida a fazer um importante auto-exame. Devemos olhar para nossas vidas e avaliar nossa conduta diante da Palavra de Deus, afinal, fariseus e publicanos continuam espalhados por todos os lugares. Que possamos apontar nossos olhos somente para Cristo; que possamos reconhecer que apenas por seus méritos somos justificados diante de Deus. É em Cristo que encontramos descanso para nossa alma.\n\n#Aqui algumas perguntas devem ser feitas: No dia de hoje, você se parece com o homem que foi para casa justificado ou com aquele que não alcançou perdão? Quando você olha para sua própria vida através do espelho das Escrituras quem você vê: o fariseu ou o publicano?\n\nCertamente todos nós podemos nos ver de alguma forma através das palavras de Jesus na Parábola do Fariseu e o Publicano.\n\n- Fonte: https://estiloadoracao.com/",
				"added": 1547242207
			},
			{
				"comment_id": 8,
				"body": "Se dissermos que não temos pecado, enganamo-nos a nós mesmos, e não há verdade em nós.\nSe confessarmos os nossos pecados, ele é fiel e justo para nos perdoar os pecados, e nos purificar de toda a injustiça.\nSe dissermos que não pecamos, fazemo-lo mentiroso, e a sua palavra não está em nós.\n\n- 1 João 1:8-10",
				"added": 1547242338
			},
			{
				"comment_id": 9,
				"body": "Esta é uma palavra fiel, e digna de toda a aceitação, que Cristo Jesus veio ao mundo, para salvar os pecadores, dos quais eu sou o principal.\n\n- 1 Timóteo 1:15",
				"added": 1547242414
			},
			{
				"comment_id": 10,
				"body": "Tem misericórdia de mim, ó Deus, segundo a tua benignidade; apaga as minhas transgressões, segundo a multidão das tuas misericórdias.\n\n- Salmos 51:1",
				"added": 1547242451
			},
			{
				"comment_id": 11,
				"body": "Porque pela graça sois salvos, por meio da fé; e isto não vem de vós, é dom de Deus.\n\n- Efésios 2:8",
				"added": 1547242514
			},
			{
				"comment_id": 12,
				"body": "Não pelas obras de justiça que houvéssemos feito, mas segundo a sua misericórdia, nos salvou pela lavagem da regeneração e da renovação do Espírito Santo,\n\n- Tito 3:5",
				"added": 1547242551
			},
			{
				"comment_id": 13,
				"body": "Deus não é homem, para que minta; nem filho do homem, para que se arrependa; porventura diria ele, e não o faria? Ou falaria, e não o confirmaria?\n\n- Números 23:19",
				"added": 1547252724
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 4,
				"body": "#Cérebro humano pode armazenar 4,7 mil milhões de livros\nCaso o cérebro fosse usado na sua máxima capacidade, o que não acontece, poderia acomodar um petabyte de informação, ou seja, cerca de um milhão de gigas. Este cálculo tem por base a medição das sinapses, que são as ligações cerebrais que estão associadas ao armazenamento de memórias. Em média, cada uma consegue armazenar 4,7 bits de informação.\n\n- https://sci-hub.tw/10.7554/eLife.10778",
				"added": 1547238034
			},
			{
				"comment_id": 5,
				"body": "#Proteína que fortalece conexão entre neurônios pode ajudar contra Alzheimer\n\nA pesquisa, publicada no jornal científico Cell Reports, conta que os cientistas já sabiam que a netrina é essencial para o desenvolvimento do cérbero embrionário e infantil por fazer essas conexões entre neurônios. Porém, só com a nova análise foi possível revelar que a proteína também fortalece as sinapses no hipocampo do cérebro adulto, uma área que está envolvida na memória e aprendizado.\n\n- https://sci-hub.tw/10.1016/j.celrep.2018.09.028",
				"added": 1547239403
			}
		]
	},
	"comment_vote": {
		"4_17KvnHUDitqK2fURKEM85tbL18yJVbM6Aq": 1,
		"2_17KvnHUDitqK2fURKEM85tbL18yJVbM6Aq": 1
	}
}