{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 1,
				"body": "In fact, most Chinese believe that COVID-19 was manufactured by the US military, based on the following facts:\n1. After the victory of World War II, the US military took over all the research results of Japanese Unit 731 (in return, it pardoned the crime of the unit);\n2. The US military used bacterial weapons on the Korean battlefield (relevant evidence is on display in the Chinese Military Museum). It is also a historical fact that American predecessors used smallpox as a weapon to destroy the Indians. In other words, the Americans have a history of using biological weapons. Americans' love for biological weapons is melted in the blood;\n3. The SARS outbreak in Guangzhou, China in 2003 is widely suspected to be a biological weapon released by the US military because the virus exhibits strong ethnic selectivity. After the epidemic ended in May of that year, SARS never appeared again. This is not in line with the general law of natural viruses. Moreover, the SARS epidemic occurred at the same time as the US attack on Iraq, which is suspected to be a means of the US military to contain China (to prevent China from liberating Taiwan);\n4. After the COVID-19 outbreak, thanks to the epidemic reporting system established by China after the SARS epidemic, China discovered the disease in the first place and was able to take decisive measures to prevent its spread.\n5. China has invited WHO experts to inspect the Wuhan Institute of Virology, which is generally suspected by the international community, and has proven its innocence to countries around the world through them. The Chinese are now expecting the United States to open their Fort Detrick Biolabs, but the United States firmly refused. The American media even deliberately did not mention the place name Fort Detrick at all.\n6. After reading more than 400 papers by Professor Baric, Zhao Shengye, who concluded that \"the probability of artificial chimeric virus is greater than 99.9%\", suffered a bizarre car accident not long ago (was being rear-ended by a BMW at high speed while waiting for a red light. , The driver did not drink alcohol, did not take drugs, and had been stepping on the accelerator. Fortunately, the red light had turned to green when the impact occurred, and the driver in front of the vehicle released the brake).\nWho do you think is more suspect?",
				"added": 1613736759
			},
			{
				"comment_id": 2,
				"body": "> [mateusrm](#comment_3_15qVru57g2Gpumhby7UkDWuS3qKnmGSqG8): \"to prevent China from liberating Taiwan\"\n\nYes, there is no problem with this sentence. Even the United States recognizes that Taiwan is part of China.\nFor China, Taiwan is now a rebellious province, and China needs to defeat the rebels through a war and unify Taiwan.\nThe US government regards Taiwan as its sphere of influence. Although the US government recognized Taiwan as part of China in the communiqué on the establishment of diplomatic relations with the Chinese mainland government, the US government has never given up its support for the Taiwan government.",
				"added": 1613827919
			}
		]
	},
	"comment_vote": {}
}