{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 1,
				"body": "> [removeboomer](#comment_1_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): Qboomers think they are part of some spy movie. Don't fret normalfags, 8chan ain't nearly that gay overall.\n\n+1\n\n> [nickwa](#comment_218_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I just think 8chan users [...]\n\nA bit harsh to pull all users of 8chan into one category. Honestly there are plenty of alright people on the site, if look past the screaming all right people on there. There is much that is pushed into the shadow of /pol/ and related boards frantically trying to make the long dead nazi meme a reality.\nIt's important not to forget the thousands of other people on the site. Many niche and productive communities were lost.",
				"added": 1565166188
			},
			{
				"comment_id": 2,
				"body": "> [nickwa](#comment_223_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Well im talking about the ones that I saw getting tons of traction on the internet. I always knew that 8chan and the like had some history of CP(that of course is taken down), that I knew will be a mess on ZeroNet. I guess the take down of 8chan attracted those types? I am sorry if I bunched all you guys together.\n\nPedos aren't even that bad, the ones I've seen here(and most I've came in contact with in general) seem to be pretty alright guys. \nHonestly, I would let my daughter go out with 10 pedos before I would even consider letting one of those retards anywhere within a 100 foot radius of her. Because even the most vile pedo in this universe wouldn't be able to make her as fucked as these guys would!",
				"added": 1565167341
			},
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_868_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Look at the name, either a pedo or someone into related topics. \n\nLoli =/= pedo \n2D =/= 3D\nfiction =/= reality\ndrawing =/= photo\n\nWhy is this so difficult?\n>I still wouldn't let a kid near them though.\n\nYou'd rather let your kid go anywhere near those retards?\n\n> [removeboomer](#comment_2_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): Weirdest virtue signal I've seen yet\n\n> [zeronetanon4](#comment_8_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): Sometimes I wonder if posts like this are serious, or meant to generate a reaction.\n\nWell obviously I wouldn't get my kid nowhere near both of them, but I'd sleep **much** sounder knowing my daughter is with a pedophile, than knowing she's with a manipulative idiot, that spends his time brainwashing people on the internet.\n  \nI live by this rule of thumb: Keep yourself and your kids as far away from someone as that someone is from reality.",
				"added": 1565170493
			},
			{
				"comment_id": 4,
				"body": "> [bigbadbob](#comment_21_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): well hopefully she can date someone less extreme than said options:)\n\n+1",
				"added": 1565173055
			},
			{
				"comment_id": 5,
				"body": "> [kaffie](#comment_870_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): And most people into loli generally have the pedo bug.\n\nThen why did you jump straight to pedo?\n- I have loli in my name.\n- You know what lolicons are.\n- You know that some lolicons are actual pedophiles, while some are not.\n\nWhy, instead of being 100% correct in saying that I'm a lolicon, do you go to the much more discrediting, possibly incorrect, not to mention insulting '**Yup, that's a pedo**       or he's something related'?  \n'Look at the name, either a lolicon or someone into related topics.' Would've carried the exact same meaning, but much less discrediting/insulting.  \n  \nI want to make it crystal clear: __I am **not** a pedophile!__ \n\n>Nope. I'd avoid both.\n\nExactly.  \n  \n  ---  \nOn a side note:\n>And most people into loli generally have the pedo bug.\n\nAnd most people into loli would disagree with that.",
				"added": 1565180738
			},
			{
				"comment_id": 6,
				"body": "> [bober](#comment_13_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): loli = pedo. don't kid yourself, you dumb faggot\n\nyou = mindless. don't think yourself, you obedient slave",
				"added": 1565186630
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "Mom, look I'm on the news. (well kind of anyway)",
				"added": 1565288865
			},
			{
				"comment_id": 8,
				"body": "> [mfs](#comment_9_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Congratulations! The author appears to have gotten all her information from ZeroTalk.\n\nNah, some of those where from threads on 08chan.",
				"added": 1565288995
			},
			{
				"comment_id": 9,
				"body": "> [everybody](#comment_27_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW): Hello Kelly, feel free to ask any questions.Not everyone here is MEAN.I can promise that.\n\n+1",
				"added": 1565298464
			}
		]
	},
	"comment_vote": {
		"21_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"27_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1
	}
}