{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "127.0.0.1:43110/NewGFWTalk.bit的站长p2p删了我发的全部帖子，我只是在他论坛里发了几篇武装反共的话题！p2p可能是当局派进来引导舆论的，给你们提个醒，大家小心就是了，尽量别再去他的论坛发言",
			"post_id": 13,
			"date_added": 1490107859
		},
		{
			"comment_id": 2,
			"body": "我同意博主的观点，郭以前就是与大陆国安系统有关联的人，他被迫出逃，揭发中共高官黑幕，或许真心的，但也只是共匪内部派系权斗的结果，郭已经被中共抛弃了，但也不是什么好角色，他肯定还与共匪内部其他权利人士有着联系。至于博讯，目前没有发现什么问题，博讯是中共线人基本不太可能，那都是中共黑博讯的谣言。还有博主你提到了一个温云超，温与中共国安系统有联系，他曾经举报过反共人士，温是比较可疑的。",
			"post_id": 13,
			"date_added": 1490108283
		},
		{
			"comment_id": 3,
			"body": "身份已暴露對武裝反共是一個缺陷，但不是不可彌補的。毛澤東和周恩來在當年武裝組黨反政府時都暴露了身份，但國民政府還不是拿他們沒辦法？可見，身份是否暴露不是能否革命的必要條件，博主人在海外，就沒有問題，共匪就不能把他怎麽樣，相反，已經跟共匪撕破臉了，那還不如甩開膀子，大干一場！所以，暴露了身份，從某方面來説，反而是有利的事。衹要同志們遵守了武裝反共組織的安全策略，那身份是否已暴露，對自身安全來説都不是問題。比方說，誰知道博主是否在搞武裝反共呢？以前身份的暴露，不代表以後身份也暴露。進一步的討論可以到革命論壇http://x.80529.x6.nabble.com 來，mrc也歡迎你加入武裝革命陣營。",
			"post_id": 13,
			"date_added": 1490272172
		},
		{
			"comment_id": 4,
			"body": "談到安全，我衹能說，比Zeronet安全，舉兩例，1.革命前夜沒有時間關聯，但零網是有的，零網發帖可見“xx hours ago”，時間關聯攻擊可以用來分析發帖者的活動和作息習慣。2.零網所有人發的帖子都一覽無余，沒有隱私，而革命前夜有複雜的目錄嵌套結構，可以設定不同權限，攻擊者很難一下摸清門路。用零網自己硬盤會緩存其他人的内容，但表網不會，加上用代理IP訪問，那麽就比零網安全。",
			"post_id": 13,
			"date_added": 1490316295
		},
		{
			"comment_id": 5,
			"body": "回hrchrc：零網發言時間可以隨便改，但有多少人改了？你在這裏回帖的時間改了嗎？事後去修改，衹是一種彌補手段，反而讓人知道在故意造假。我談到的防範時間攻擊，是一種自然防範，在發言者自身無意識的情況下，自然避免了被攻擊。而且，零網的發言時間修改起來恐怕也不容易吧，它是編碼的，一般用戶誰懂？零網的修改時間，實踐上極爲不方便，它沒有主動避免時間關聯攻擊，所以我們談的是兩個層次的安全問題，不在一個層面上。\n********\n零網内容是明的，大家知道如何隱藏自己，那在革命網站大家反而就不知道如何隱藏自己了？你說話自相矛盾的地方很多，搞地下工作，不能讓人知道底細才是正常的。你一定需要知道對方的底細才能信任對方嗎？在零網，你又知道多少人的底細？任何網站都可以被黑客破解？黑客在攻剋網站方面是無敵的嗎?你是否了解革命網站的安全架構？支共有錢就能收買任何人嗎？零網不少開放人員在支那，是否更容易被支共監看或收買？你認爲革命網站不可信任，有沒有什麽證據？還是自己憑空想象的？\n*********\n零網開通到現在，略數安全事故，就已出現過：1，被人刷屏攻擊，導致舊站點被放棄，被克隆（有人會說被刷屏是因爲站長xiaolan不來，隱匿了，但他爲什麽要隱？就是因爲人家知道零網存在安全漏洞!  xiaolan這方面比你們高明）。爲什麽容易被刷屏？匿名注冊容易造成的。這裏，匿名反而變成漏洞了。2，用戶莫名奇妙帖子丟失。3，站點被支共滲透、搞言論審查。穩定性方面，零網并不十分穩定，有時節點打不開，推測可能被滲透者在做破壞試驗。革命站的存在時間比零網稍久一點，但至今還沒出過任何安全事故，雖然零網的安全事故未造成用戶安全損失，但要比較兩個站哪個更安全?事實是明擺着的。\n",
			"post_id": 13,
			"date_added": 1490455017
		},
		{
			"comment_id": 6,
			"body": "大家在網上素不相識，沒有任何過節，不明白你爲什麽說我的網站“不知底細”？你也沒有任何證據，就信口雌黃，難道你們的網站就知底細嗎？不管在表網也好，零網，博客開到哪，就在哪要求捐款，別人上網是娛樂，你們是乞討來了，發幾篇狗屁維權文章就能伸手要錢了？一撥騙子，走到哪騙到哪",
			"post_id": 13,
			"date_added": 1490821407
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}