{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"5_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": 1,
		"6_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": 1,
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1
	},
	"next_comment_id": 19,
	"comment": {
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 1,
				"body": "> [freemurzik](#comment_8_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Назовите хоть одну?\n\nСаудовская Аравия,  Российская Империя до 1905-го года,  Австрийская Империя в начале 19-го века",
				"added": 1566839801
			},
			{
				"comment_id": 6,
				"body": "> [freemurzik](#comment_10_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Типичная большевистская пропаганда.\n\nМесье может найти законадательные акты ограничивающие власть императора в России или Австрии до революции 1905-го года и до 1849-го года в Австрии?",
				"added": 1566891103
			},
			{
				"comment_id": 7,
				"body": "> [freemurzik](#comment_11_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Для этого надо иметь доступ к архивам.\n\nУчебник истории, страноведческий справочник или энциклопедия не подходят.  Сразу нужны архивы?\n\nЧто про Саудовское королевство ответишь - тоже к архивам направишь?\n\nwikipedia.org - не пойдёт для начала?",
				"added": 1566982327
			},
			{
				"comment_id": 8,
				"body": "> [freemurzik](#comment_13_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Австрия меня не интересует.\n\nСтоп стоп стоп!\n\nВы сказали :  ...Назовите хоть одну... \n\nВ ответ на моё сообщение:\n\n....месье возможно следует изучить политическую историю. Существуют и конечно же существовали страны в которых письменной конституции не было и нет....\n\nЯ вам привёл целых три примера.\n\nТеперь вы увиливаете!\n\n\n>У вас странное мышление. Если мы говорим об ограничении власти императора - так должен быть именно \"акт ограничения\"? Мне кажется, что должны существовать акты переназначения отдельных полномочий парламенту. \n\nВо всех трёх странах в условиях абсолютной монархии не было парламента\n\n> Если просто \"ограничить власть\" по каким-то вопросам а не переназначить, то эти вопросы тогда вообще никак решаться не будут - а это неправильно. Очень похоже на административную диверсию.\n\nЕсть устоявшаяся терминология - вы сейчас пытаетесь играть словами и некорректно использовать термин \"ограничение власти\"",
				"added": 1566997340
			},
			{
				"comment_id": 10,
				"body": "> [freemurzik](#comment_14_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Неужели после стольких лет войны и страданий вы все еще слепо копируете все с запада.Вы, пожалуйста, не забывайте, что марксизм, который мы слепо скопировали у немцев, комунизм построить не мог. Оригинальный комунизм французского разлива состоял всего из нескольких постулатов.Самоуправление и республиканская форма правления. Самоуправление нации как-раз на основе конституции и выполняется, и другого способа самоуправления не существует. Вы еще скажите, что в австрии не существовал свод законов. Что бы власть короля, или кто там еще был, была законной должны существовать законы, не так-ли? А подводить меня к нацистской риторике времен аншлюса 38-года меня не следует.\n\nПричём тут коммунизм?\n\nВы \"пойманы\" на нарушении формальной логики.   А сейчас вообще куда то в степь понеслись. Во дворе бузина а в Киеве мамин брат живёт",
				"added": 1567073209
			}
		],
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 2,
				"body": "> [swashbuckler](#comment_13_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Наверное потому, что пока что (акцент на \"пока что\") выгоднее содержать людей, выплачивая им копейки, чтобы они окончательно не \"раскачали лодку\". \n\nСредняя компания перевозчик не занимается политикой.  В России такие компании недостаточно велики для такой деятельности\n\n> Куда ж девать такую толпу гастарбайтеров? \n\nПокупать их труд за копейки. Если они будут дешевле машин значит покупать будут именно их\n\n> Вот о чём я, на примере Китая: https://invidio.us/watch?v=OmkFDWYsyHA (в клирнете можете поискать перевод от Vert Dider - видео называется \"Робототехника: Быстрее, сильнее и дешевле\". YouTube его удалил вместе со старым каналом, но в соц. сетях типа ОК и ВК наверняка что-то осталось).\n\nРекламные ролики всё же не следует путать с коммерчески успешными проектами. Но проблема даже не в этом - для серьёзного внедрения беспроводных автомобильных перевозок требуются капиталовложения на которые российские банки не факт что смогут пойти\n\n> А вот касательно \"ни одной подобной машины\": https://invidio.us/watch?v=vMXivgUGVn8\n\nпока это всё же прототипы и опять же в США - стране где концентрация капитала на порядки превосходит Россию и где соответственно возможны гораздо большие капиталовложения",
				"added": 1566840162
			},
			{
				"comment_id": 4,
				"body": "Крановщики Казани добились выполенения своих требований в ходе забастовки\n\n\nВ начале этой неделе крановщики Казани отчитались об итогах «забастовки», которую они провели в конце июля. И итоги эти заставляют гордиться участниками протеста.\n\nВо-первых, крановщикам удалось добиться того, что некоторые фирмы в Татарстане перешли на 8-и часовой рабочий день и начали оплачивать сверхурочные часы. Хотя на дворе вообще-то 21 век, и трудовой кодекс РФ предусматривал такие условия.\n\nВо-вторых, у них в договорах появилась страховка.\n\nВ-третьих, протесты привлекли внимание надзорных органов, которые начали проверки в компаниях. Да, формальные, но все-таки проверки. И они повлекли за собой единичные позитивные перемены для крановщиков.\n\nА на одном из предприятий крановщику повысили оплату труда на 10 рублей в час. Таким образом, его месячная зарплата вырастет на 1760 рублей.\n\n«Мы доказали всем, что рабочий, крановщик не раб. В наших рабочих руках колоссальная сила, и правильно используя эту силу, мы можем многое поменять и сделать нашу жизнь достойнее», — сообщили участники акции изданию Казанферст.\n\nЧто тут добавить? Ребята молодцы! Вопреки собственным страхам потерять работу, попасть под суд и не найти сочувствия у других представителей рабочего класса они решились отстаивать свои интересы. Создали новый боевой российский профсоюз. Смогли сделать безопаснее условия труда для десятков людей в регионе.\n\nНо сами крановщики благодарят тех, кто выразил солидарность этой кампании. Тех, кто осознает, что рабочим в России нужно поддерживать друг друга, а еще лучше - объединяться для борьбы с людьми, затягивающими на их шее удавку бедности, пожизненного опасного и тяжелого труда.\n\nИ мы тоже благодарим тех из вас, кто поддерживал протестующих.\n\nПотому что считаем, что только сопротивление наемных работников своим угнетателям и в дальнейшем — победа над ними — обеспечат этим рабочим достойный уровень жизни и рациональные трудовые нормы.",
				"added": 1566840261
			},
			{
				"comment_id": 5,
				"body": "> [if0](#comment_216_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Заставили исполнять трудовой кодекс РФ... Может стоило подать в суд или просто натравить надзорные органы? \n\nУвы не работает.  Вернее работает редко и понемногу. На время проверки.\n\nДело не только в коррупции в судах,  просто работодатель имеет преимущество в плане допроса свидетелей.  Он можжет легко выставить свидетелями своих же руководящих работников. Почти все документы у него на руках.  \n\nРаботник наоборот вынужден приглашать как свидетелей своих же коллег - рабочих того же предприятия.  Понятно что он не особо рады идти против работодателя.\n\nЕщё важный момент в том что далеко не всё регулируется законом.  Например уровень зарплаты - если он выше или равен МРОТ значит всё законно.\n\nКрановщики часто работали по ГПХ договору.  Трудовой кодекс к ним в этом случае совсем не применим.\n\nВсё это в совокупности делает обращение в суд не  эффективным методом.\n\nС коррупцией в судах мы тоже встречались.",
				"added": 1566890951
			},
			{
				"comment_id": 9,
				"body": "https://habr.com/ru/post/465437/\n\n\nКогда я говорю об AWS, то стараюсь быть объективным. Если они сделали что-то хорошее, я рассказываю об этом — и люди мне верят, потому что я обязательно дам знать, когда они сотворят какую-то фигню.\n\nСегодня такой случай.\n\n26 июля 2019 года Amazon подала в суд на бывшего менеджера AWS за нарушение пункта о неконкуренции в трудовом соглашении. Вот этот судебный иск (pdf).\n\nПоскольку большинство из нас не любят читать юридические документы, позвольте резюмировать: «Филипп Мойер (простой менеджер по продажам) работал в AWS, продавал облачные сервисы. Он уволился и перешёл Google, чтобы продавать облачные сервисы уже там. Amazon взбесилась и подала иск в Верховный суд округа Кинг, требуя запрета на конкуренцию минимум 18 месяцев, а также выплаты компенсации».\n\nДля справки, все американские сотрудники Amazon, кроме Калифорнии (где права работников защищаются получше), подписывают пункт о неконкуренции в трудовом соглашении.\n\nСогласно исковому заявлению, этот пункт гласит:\n\n Запрет конкуренции. Во время работы и в течение 18 месяцев после увольнения сотрудник не будет прямо или косвенно, от своего имени или от имени любого другого субъекта (например, в качестве сотрудника, агента, партнёра или консультанта), участвовать или поддерживать разработку, производство, маркетинг или продажу любого продукта или услуги, которые конкурируют или предназначены для конкуренции с любым продуктом или услугой, продаваемым, предлагаемым или иным образом предоставляемым Amazon (или предназначенным для продажи, предложения или иным образом предоставляемым Amazon в будущем), над которым сотрудник работал или поддерживал, или о котором получил конфиденциальную информацию\n\n\nЭтот явно оскорбительные условия.\n\nОбратите внимание, что условие относится к Amazon, а не только к AWS. Если кто-то подпишет такое соглашение, на какую работу он может пойти после увольнения, чтобы не нарушить этот пункт? Я бы сказал «написание статей, высмеивающих AWS», но — чёрт побери — они и этим занимаются, запуская службы с названиями вроде System Manager Session Manager.\n\nХочу подчеркнуть несколько моментов:\n\nНаиболее распространённый аргумент в пользу такого широкого запрета на конкуренцию звучит примерно так: сотрудники знают очень конфиденциальную информацию, а новому работодатели нельзя давать простой инструмент для корпоративного шпионажа через найм этих людей. Конечно, этот аргумент игнорирует тот факт, что соглашения о конфиденциальности действуют во всех штатах США (независимо от того, относится ли информация к коммерческой тайне типа формулы «Кока-Колы») и эффективно препятствуют людям зарабатывать на жизнь. Когда компания решает использовать запрет на конкуренцию, речь идёт не о защите своей сверхсекретной стратегии — в случае AWS это «создать много вещей, которые нравятся клиентам, и продавать их как сервисы!» — речь идёт о контроле.\n    Amazon обратилась к новому работодателю этого бедняги для переговоров, над чем ему разрешат работать. Можете представить: вы устроились на новую работу, а затем долбаный Amazon звонит вашему новому боссу с угрозами?\n    Вполне очевидно, что AWS пытается предупредить GCP, что нельзя переманивать сотрудников. К сожалению, это предупреждение передаётся путём судебного иска к одному случайному менеджеру в Пенсильвании. Мойер представляет Google не больше, чем он представлял Amazon во время своего пребывания там.\n\n\nЯ довольно долго думал об этом, потому что в 2018 году именно из-за этого пункта отклонил довольно привлекательное предложение работать в AWS на должности, которая отлично мне подходит. Amazon оставалась непреклонной по этому пункту, а во время обсуждения несколько человек (как официально, так и неофициально) убеждали меня принять предложение, приводя несколько дурацких аргументов:\n\n«Этот пункт необходим для защиты бизнеса».\n\nОчаровательно. Как я уже говорил, эти положения не действуют в Калифорнии. И никогда не действовали с момента образования штата в 1850 году (что часто упоминают в качестве причины, почему вообще появилась Кремниевая долина). Не говоря о том, что у AWS много сотрудников в Калифорнии, также как у Google и почти всех остальных технологических компаний. Это никому не мешает. Более того, любой сотрудник, подписавший такое соглашение, после переезда в Калифорнию больше не связан обязательствами.\n\nЯ понимаю, что вы хотите «защитить свой бизнес». Но я хочу быть в состоянии прокормить свою семью, когда в конечном итоге уйду из компании.\n\n«Это никогда не соблюдается».\n\nТогда зачем его подписывать? У меня есть некое странное понятие, что нужно соблюдать подписанные соглашения. Если я не готов их соблюдать, я их не подписываю. Кроме того, по этому пункту явно были разбирательства здесь. И здесь. И здесь. И здесь тоже.\n\nКогда я писал статью, появился тред в твиттере на эту тему. Почитайте: там речь не о судебном иске, а о принуждении сотрудника подписать документ после того, как он уже переехал из Ирландии в Сиэтл по визе.\n\n    Some people are saying that these clauses are known upfront before joining. Well, that wasn't the case for me when I joined Amazon.\n\n    Let me tell you how Amazon squeezed non-competitive clauses into my contract about 2 years into my job in a very unethical manner:\n    — Daniel Vassallo (@dvassallo) August 3, 2019\n\n\n«Мы никогда не применим это против сотрудника на должности ниже вице-президента».\n\nТот бедняга-продажник, с которым они сейчас судятся, явно не вице-президент. Кроме того, см. ссылки выше.\n\n«Нет, мы не будем платить вам зарплату в течение срока запрета на конкуренцию. Это не зависит от того, подаём мы судебный иск или нет».\n\nИменно так работают эти нормы в некоторых европейских странах. Они бы громко посмеялись, если бы я такое предложил на переговорах.\n\n«Мы применяли её только тогда, когда человек сжигает мосты перед увольнением».\n\nВы меня знаете? Мне пришлось сжечь все мосты, чтобы добиться собеседования в AWS! Какие гарантии, что я смогу спокойно уйти от работодателя, где я чем-то обидел хоть одного вице-президента? Насколько мне известно, на момент написания этой статьи я сильно разозлил ровно трёх вице-президентов AWS, а ведь я даже там не работаю! (Кстати, если вы вице-президент AWS, ненавидите меня и не уверены, что я об этом знаю, пожалуйста, дайте знать, и я увеличу счётчик!)\n\n«Ну, почему бы просто не остаться в Калифорнии и не поработать в местном офисе?»\n\nЕсли вы единственный сотрудник на удалёнке, ваше влияние по сути ограничено. По своему опыту, либо вся команда работает дистанционно, либо удалённые сотрудники являются гражданами второго сорта. Таким образом, это можно сформулировать так: «Почему бы не повредить своей карьере ещё перед её началом?»\n\nТот факт, что я могу отказаться от предложения, — огромная привилегия. Не у всех она есть. Между кандидатом и компанией с капитализацией на триллион долларов даже близко нет баланса сил. Точка. Тем более, когда компания назло начинает судиться с бывшими сотрудниками.\n\nЯ знаю отличных, талантливых профессионалов, которые работают в AWS. Никто из них не заслуживает того, чтобы с ними случалось что-то подобное, когда придёт их очередь уходить.\n\nЛадно тебе, AWS.\n\nНе опускайся так.\n\nТы выше этого.",
				"added": 1567073127
			},
			{
				"comment_id": 12,
				"body": "> [anonanonanon](#comment_4_1Hb34bzZTeyXbfacTAYAgR1V99L9LfW5Yt): Любые профсоюзы, как и прочая левацкая дрянь, зло. Никого не должны касаться отношения работодателя и сотрудника, никаких сраных профсоюзов, никаких блядских леваков. Работодатель и сотрудник должны разбираться между собой сами и только сами, без вас, блядей-бездельников\n\nПрофсоюз и есть работники.\n\nЗло это персонажи вроде тебя получившие всё за счёт родителей, бесплатно учащиеся в построенных ещё в СССР школах и университетах, обращающиеся за бесплатным лечением к созданной в СССР бесплатной медицине и рассказывающие какие вы во всём этом не нуждаетесь\n\nНичего страшного - время работает на нас. Социальные блага отменяются,  в отличии от твоих родителей новую квартиру в Москве тебе не купить,  поголовье бесполезных офисных слизней работодатели сокращают.\n\nЕсть ещё полиция и росгвардия которые бьют по тупым башкам \"сверхчеловеков \"дубинами.\n\nТак что у тебя ещё всё в передив  плане прихода к идеям демократии и социализма.\n\nПочитай Джека Лондона  \"Как я стал социалистом\" - там как раз про тебя",
				"added": 1567425647
			},
			{
				"comment_id": 15,
				"body": "Почему ИТ работникам нужен профсоюз:\n\nhttps://habr.com/ru/post/465437/\n\n\nКогда я говорю об AWS, то стараюсь быть объективным. Если они сделали что-то хорошее, я рассказываю об этом — и люди мне верят, потому что я обязательно дам знать, когда они сотворят какую-то фигню.\n\nСегодня такой случай.\n\n26 июля 2019 года Amazon подала в суд на бывшего менеджера AWS за нарушение пункта о неконкуренции в трудовом соглашении. Вот этот судебный иск (pdf).\n\nПоскольку большинство из нас не любят читать юридические документы, позвольте резюмировать: «Филипп Мойер (простой менеджер по продажам) работал в AWS, продавал облачные сервисы. Он уволился и перешёл в Google, чтобы продавать облачные сервисы уже там. Amazon взбесилась и подала иск в Верховный суд округа Кинг, требуя запрета на конкуренцию минимум 18 месяцев, а также выплаты компенсации».\n\nДля справки, все американские сотрудники Amazon, кроме Калифорнии (где права работников защищаются получше), подписывают пункт о неконкуренции в трудовом соглашении.\n\nСогласно исковому заявлению, этот пункт гласит:\n\n Запрет конкуренции. Во время работы и в течение 18 месяцев после увольнения сотрудник не будет прямо или косвенно, от своего имени или от имени любого другого субъекта (например, в качестве сотрудника, агента, партнёра или консультанта), участвовать или поддерживать разработку, производство, маркетинг или продажу любого продукта или услуги, которые конкурируют или предназначены для конкуренции с любым продуктом или услугой, продаваемым, предлагаемым или иным образом предоставляемым Amazon (или предназначенным для продажи, предложения или иным образом предоставляемым Amazon в будущем), над которым сотрудник работал или поддерживал, или о котором получил конфиденциальную информацию\n\n\nЭто явно оскорбительные условия.\n\nОбратите внимание, что условие относится к Amazon, а не только к AWS. Если кто-то подпишет такое соглашение, на какую работу он может пойти после увольнения, чтобы не нарушить этот пункт? Я бы сказал «написание статей, высмеивающих AWS», но — чёрт побери — они и этим занимаются, запуская службы с названиями вроде System Manager Session Manager.\n\nХочу подчеркнуть несколько моментов:\n\nНаиболее распространённый аргумент в пользу такого широкого запрета на конкуренцию звучит примерно так: сотрудники знают очень конфиденциальную информацию, а новому работодателю нельзя давать простой инструмент для корпоративного шпионажа через найм этих людей. Конечно, этот аргумент игнорирует тот факт, что соглашения о конфиденциальности действуют во всех штатах США (независимо от того, относится ли информация к коммерческой тайне типа формулы «Кока-Колы») и эффективно препятствуют людям зарабатывать на жизнь. Когда компания решает использовать запрет на конкуренцию, речь идёт не о защите своей сверхсекретной стратегии — в случае AWS это «создать много вещей, которые нравятся клиентам, и продавать их как сервисы!» — речь идёт о контроле.\nAmazon обратилась к новому работодателю этого бедняги для переговоров, над чем ему разрешат работать. Можете представить: вы устроились на новую работу, а затем долбаный Amazon звонит вашему новому боссу с угрозами?\nВполне очевидно, что AWS пытается предупредить GCP, что нельзя переманивать сотрудников. К сожалению, это предупреждение передаётся путём судебного иска к одному случайному менеджеру в Пенсильвании. Мойер представляет Google не больше, чем он представлял Amazon во время своего пребывания там.\n\n\nЯ довольно долго думал об этом, потому что в 2018 году именно из-за этого пункта отклонил довольно привлекательное предложение работать в AWS на должности, которая отлично мне подходит. Amazon оставалась непреклонной по этому пункту, а во время обсуждения несколько человек (как официально, так и неофициально) убеждали меня принять предложение, приводя несколько дурацких аргументов:\n\nЭтот пункт необходим для защиты бизнеса\n\nОчаровательно. Как я уже говорил, эти положения не действуют в Калифорнии. И никогда не действовали с момента образования штата в 1850 году (что часто упоминают в качестве причины, почему вообще появилась Кремниевая долина). Не говоря о том, что у AWS много сотрудников в Калифорнии, также как у Google и почти всех остальных технологических компаний. Это никому не мешает. Более того, любой сотрудник, подписавший такое соглашение, после переезда в Калифорнию больше не связан обязательствами.\n\nЯ понимаю, что вы хотите «защитить свой бизнес». Но я хочу быть в состоянии прокормить свою семью, когда в конечном итоге уйду из компании.\n\nЭто никогда не соблюдается\n\nТогда зачем его подписывать? У меня есть некое странное понятие, что нужно соблюдать подписанные соглашения. Если я не готов их соблюдать, я их не подписываю. Кроме того, по этому пункту явно были разбирательства здесь. И здесь. И здесь. И здесь тоже.\n\nКогда я писал статью, появился тред в твиттере на эту тему. Почитайте: там речь не о судебном иске, а о принуждении сотрудника подписать документ после того, как он уже переехал из Ирландии в Сиэтл по визе.\n\n\nSome people are saying that these clauses are known upfront before joining. Well, that wasn't the case for me when I joined Amazon.\n\nLet me tell you how Amazon squeezed non-competitive clauses into my contract about 2 years into my job in a very unethical manner:\nDaniel Vassallo (@dvassallo) August 3, 2019\n\n\n«Мы никогда не применим это против сотрудника на должности ниже вице-президента»\n\nТот бедняга-продажник, с которым они сейчас судятся, явно не вице-президент. Кроме того, см. ссылки выше.\n\nНет, мы не будем платить вам зарплату в течение срока запрета на конкуренцию. Это не зависит от того, подаём мы судебный иск или нет.\n\nИменно так работают эти нормы в некоторых европейских странах. Они бы громко посмеялись, если бы я такое предложил на переговорах.\n\nМы применяли её только тогда, когда человек сжигает мосты перед увольнением\n\nВы меня знаете? Мне пришлось сжечь все мосты, чтобы добиться собеседования в AWS! Какие гарантии, что я смогу спокойно уйти от работодателя, где я чем-то обидел хоть одного вице-президента? Насколько мне известно, на момент написания этой статьи я сильно разозлил ровно трёх вице-президентов AWS, а ведь я даже там не работаю! (Кстати, если вы вице-президент AWS, ненавидите меня и не уверены, что я об этом знаю, пожалуйста, дайте знать, и я увеличу счётчик!)\n\nНу, почему бы просто не остаться в Калифорнии и не поработать в местном офисе?\n\nЕсли вы единственный сотрудник на удалёнке, ваше влияние по сути ограничено. По своему опыту, либо вся команда работает дистанционно, либо удалённые сотрудники являются гражданами второго сорта. Таким образом, это можно сформулировать так: «Почему бы не повредить своей карьере ещё перед её началом?»\n\nТот факт, что я могу отказаться от предложения, — огромная привилегия. Не у всех она есть. Между кандидатом и компанией с капитализацией на триллион долларов даже близко нет баланса сил. Точка. Тем более, когда компания назло начинает судиться с бывшими сотрудниками.\n\nЯ знаю отличных, талантливых профессионалов, которые работают в AWS. Никто из них не заслуживает того, чтобы с ними случалось что-то подобное, когда придёт их очередь уходить.\n\nЛадно тебе, AWS.\n\nНе опускайся так.\n\nТы выше этого.",
				"added": 1567426724
			},
			{
				"comment_id": 16,
				"body": "> [anonanonanon](#comment_7_1Hb34bzZTeyXbfacTAYAgR1V99L9LfW5Yt): Малыш, ничего в совке не строилось бесплатно. Мои родители работали и на это строилось все в совке. А я платил налоги и на это ты учился в школе.Ничего бесплатного не бывает. Ты — паразит который выучился за мой, как налогоплательщика счет и ты хочешь паразитировать на других создав «профсоюз»\n\nПридурок, налоги в СССР были рудиментом а то что твои родители построили эксплоутарируется в том числе дегенератами вроде тебя",
				"added": 1567429934
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 3,
				"body": "А тем временем в Казани крановщики добились выполнения своих требований в ходе забастовки.",
				"added": 1566840224
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 11,
				"body": "> [anonanonanon](#comment_5_1Hb34bzZTeyXbfacTAYAgR1V99L9LfW5Yt): Кстати, а какие-то доказательства того, что он сдох были? Или его баба просто собрала деньги на якобы лечение, а потом скрылась в неизвестном направлении заявив, что его прикопают в Кёнигсберге, к которому этот субъект не имел никакого отношения?Я так понимаю что второе, да?То есть он с бабой просто собрал с лохов бабло «на лечение» и потом якобы помер.Красиво они с бабой лохов развели, молодцы.\n\nне \"сдох\" а умер, не \"баба\" а жена\n\nОн весьма известный человек с хорошей репутацией да и не собрать так много денег\n\nМне кажется очень странно подозревать кого-либо в таком мошенничестве",
				"added": 1567425262
			},
			{
				"comment_id": 17,
				"body": "> [anonanonanon](#comment_6_1Hb34bzZTeyXbfacTAYAgR1V99L9LfW5Yt): Его самка отказалась предоставлять информацию на какое именно лечение нужны были деньги, было заявлено, что набрали они на закрытие ипотеки, так что неплохо набрали.Никакого объяснения с чего бы его собрались «хоронить» в Кёнигсберге, к которому он не имел отношения не было и где его могила скрывается.Так что с вероятностью 99.99999% он и его баба просто развели людей на бабки и скрылисьУчитывая его людоедские политические взгляды это очень вероятно.\n> Просто помни, что  вероятностью 99.99999% чувак со своей самкой тебя наебал, собрал денег и свалил в закат\n\nсамка тут одна - ты\n\nПритом самка бесплодная. Потому что ты пидр",
				"added": 1567430670
			},
			{
				"comment_id": 18,
				"body": "> [anonanonanon](#comment_8_1Hb34bzZTeyXbfacTAYAgR1V99L9LfW5Yt): Хм. От правды подгорает жопа. KRoN73, это ты что ли? Страшно тебе стало, что твою аферку раскусили и людям про это рассказывают?\n\nя то тут при чём?  Или тебе KRoN73 везде мерещится?",
				"added": 1567446219
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 13,
				"body": "> [anonanonanon](#comment_1_1Hb34bzZTeyXbfacTAYAgR1V99L9LfW5Yt): Гугли «коктейль Молотова»\n> \n\nЗачем - чтобы вместо одного олигарха - Путина-Хуйла посадить другого олигарха?\n\n> А почему тебя волнует что в чужих странах? В соседних странах проходят выборы и граждане сами выбирают себе президентов, а кого они выбирают не твое сучье дело.\n\nДа тут все знают что ты йододефецитный майдаун\n\nПоменять одного олигарха на другого и назвать это \"революцией достоинства\" - это сильно!\n\nЧтобы твоей майдаунной голове было понятно - представь что американцы свергли власть английского короля а потом у них появился бы своей король который также как английский вводил бы налоги, ограничивал права - это было бы хорошо для жителей колоний?\n\nНо жители Новой Англии поумнее майдаунов были. Они не только английского короля свергли но заложили основы нового общества - США.\n\nПутин безусловной пидор,  но он активный а вот майдауны - пидоры пассивные, добровольные и старательные.\n\nДаже хуже - пидоры признают что они пидоры, а вас когда ебут вы говорите что с вами проводят медицинские процедуры и вообще чувак который вас ебёт не насильник а ваш добровольный выбор.\n\nСтокгольмский синдром однаком!",
				"added": 1567426103
			},
			{
				"comment_id": 14,
				"body": "«Раб, сознающий свое рабское положение и борющийся против него, есть револю­ционер. Раб, не сознающий своего рабства и прозябающий в молчаливой, бессознательной и бессловесной рабской жизни, есть просто раб. Раб, у которого слюнки текут, когда он самодовольно описывает прелести рабской жизни и восторгается добрым и хорошим господином, есть холоп, хам.»",
				"added": 1567426189
			}
		]
	},
	"comment_vote": {}
}