{
	"next_topic_id": 23,
	"topic": [
		{
			"topic_id": 1520610500,
			"title": "你听过管理者最无耻的一句话是什么？",
			"body": "",
			"added": 1520610499,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520610685,
			"title": "有哪些很 low 的公司文化？",
			"body": "",
			"added": 1520610683,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520610747,
			"title": "有哪些很 cool 的公司文化？",
			"body": "",
			"added": 1520610744,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520610805,
			"title": "女性经常和男性打闹、被人占便宜从来不生气，是什么样的心理状态和互动机制？",
			"body": "描述一个场景：公司大家都在工作，女的和男的开了一句玩笑，男的过来把她往墙角推，动手摸她，她嘴上反抗骂，但是并没有表现出很生气，最后被摸得蹲在地上，男的满意了，她起身打男的……就这样，等下就没事了，该聊天开玩笑还是那样。而且基本上公司男的都可以占她便宜，她平时也经常跟男的拉拉扯扯。我真的无法理解，那女的有男朋友，是我老乡。是什么样的成长经历让一个女的变成这样？难道她自己意识不到自己行为表现出很贱吗？",
			"added": 1520610801,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520610854,
			"title": "为什么海底捞没有被复制或模仿？",
			"body": "海底捞的服务还是被多数人认可的 那为什么至今在饮食业界还没有人试图要复制或模仿海底捞？ 其实海底捞其中的一些服务 还是很容易被借鉴的 例如等待区的一些免费服务和小吃 服务员的一些服务意识的培训等",
			"added": 1520610849,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520610904,
			"title": "如何看待面试官「如果你把睡觉的时间用在事业上，以后会有很多女人陪你睡」的观点？",
			"body": "",
			"added": 1520610898,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520610942,
			"title": "索尼为什么会成为一种信仰？",
			"body": "",
			"added": 1520610935,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520610981,
			"title": "老板开公司就是为了利益么？",
			"body": "",
			"added": 1520610973,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611009,
			"title": "如何评价罗永浩凌晨两点仍然坚持开会?",
			"body": "",
			"added": 1520611000,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611044,
			"title": "问一下，你们公司上班期间让上厕所吗？",
			"body": "是这样的，昨天肚子有点不舒服，早上去了2趟厕所，下午去了一趟，因为公司租的写字楼是两楼共用一个大的洗手间，我们得下一楼去使用，我平均去一趟十分钟左右，晚上加班时boss找我谈话让我注意下别老是去厕所，今早上又开了一个部门会议，说了一句“个人的事尽量在家里解决，公司花钱是花在你们的每一分钟，不要拿公司的时间去干你自己的事”让我感觉是不是在含沙射影说我哦。",
			"added": 1520611034,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611077,
			"title": "哪些细节能看出一个公司的人文关怀？",
			"body": "",
			"added": 1520611066,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611112,
			"title": "对国企有哪些误解？",
			"body": "",
			"added": 1520611100,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611170,
			"title": "如何看待很多企业让员工每天诵读弟子规？",
			"body": "现在有很多企业让员工早晚诵读《弟子规》，让大家早晚手捧弟子规集体诵读，诵读完后开始分享和忏悔，并三拜“大成至圣先师”孔子，让员工减少贪欲、学会服从、尊从礼教、孝敬父母、少欲少求、多说好话、改过忏悔、少杀生多吃素等。",
			"added": 1520611157,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611225,
			"title": "海豚浏览器这个公司企业文化和工作环境怎么样？适合毕业生加入么？",
			"body": "",
			"added": 1520611211,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611264,
			"title": "如何看待百度5月3号针对「魏则西事件」新的公关文：「从来没有仅以给钱的多少作为排位的标准」？",
			"body": "",
			"added": 1520611249,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611304,
			"title": "如何告知老板拒绝加班？",
			"body": "我是一个刚踏入职场得萌新，投递简历后面试进入了现在工作的这家公司，但是现在遇到了这样一个状况。\n         踏入公司和老板谈话时被告知，如果工作未完成需要加班，本来我认为这很正常，完成自己得工作本来就是份内的事。结果过几天老板问我，为什么不加班？  才知道她说工作没做完是指不仅要完成自己的工作，如果部门还有其他同事事情多没做完，也需要留下来加班帮他们，部门要一起上班一起加班如果不这样，就扣绩效，但是你帮他们做完了，也不会给你绩效奖励。并且这种情况的加班属于自主加班，没有工资，没有休假。\n           这件事让我觉得很不公平。首先，她没给我一个标准，什么样的情况是别人工作很多。其次，我认为我完成我份内得是，绩效满足标准之后，居然要因为别人的事没做完扣我绩效，但是别人的工作也不在我的绩效范围内。最后，我租的房子离公司特别远并且不好打车，其他人住在宿舍十几分钟就到了，但我如果错过班车以后，打车回去要五六十，坐公交也要两个多小时。\n           我想问一下大家，我老板要求的这种加班情况正常么？我该如何合理的拒绝这种加班呢？",
			"added": 1520611288,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611356,
			"title": "一个公司只强调感恩公司、对公司忠诚同时企业文化是基督圣经，这正常吗？",
			"body": "",
			"added": 1520611339,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611385,
			"title": "哪些企业文化让你深恶痛绝？",
			"body": "",
			"added": 1520611367,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611422,
			"title": "在公司养猫需要注意什么？",
			"body": "朝九晚六的上班族，如果公司养猫，有什么需要注意的么？有什么科学养猫的方法？有类似工作体验的人来说说呗~",
			"added": 1520611403,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611451,
			"title": "千古文章一大抄，个人认为腾讯在互联网产业业已证明了自己，还有很多人抓着原罪不放？",
			"body": "bat三家，百度跟甲骨文签了下java捆绑百度杀毒大保健套装的约定；阿里跟工商局叫嚣，小三叫骂原配；还是鹅厂好啊，买了五年NBA直播权(新浪哭了)，绿钻独家音乐版权(网易云呵呵了)，腾讯游戏也是第一，投资京东(比淘宝正品有保证吧？)，滴滴打车也比快的用的多(我亲身体验，快的定位不准)，这些金融投资比盛大各种卖好多了吧？",
			"added": 1520611431,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611501,
			"title": "企业文化到底是什么呢？",
			"body": "",
			"added": 1520611480,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1520611554,
			"title": "在一家有趣的公司上班是怎么样的一种体验？",
			"body": "最近在收集一些比较有趣公司的工作日常，做一些不一样的企业日常安排才会显得这家公司有趣，比如公司会在下班时候在办公室安排集体刷海鲜火锅；老板买了只XX品种犬，员工每天来公司可以轮流选择有1、2个小时不用上班，陪宠物狗玩耍，遛弯等等",
			"added": 1520611532,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517730511_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1
	},
	"next_comment_id": 33,
	"comment": {
		"1520478072_15Z5tW6xktzXnsa8nKRZM7QaW9XbeRBuYi": [
			{
				"comment_id": 1,
				"body": "npupt",
				"added": 1520610321
			}
		],
		"1520610500_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 2,
				"body": "医院属于事业单位，各项事业受政府管制，比如说编制，有编制的人哪怕不做事，单位也开除不了你。临床一线累的要死，而医院某些岗位的人员好玩的要死，比如抄水电表的人，据说一个月只上一天班。而临时工不一样，干活的命，随时可能被开除。\n\n    其实这种事在其他单位也是存在的，不做事的油腻的中年男到处都是，反正他们升迁无望，所以迟到早退，喝杯茶，看看报纸，做事的时候各种推诿塞责，这里不舒服啦，那里不舒服啦，这个不会，那个不会，各种推脱，但是邀功的也是他们，为了各种利益打破了头，头头们对他们也无可奈何；此外他们不光不做事，还对别人指手画脚，指责别人这里做的不好，那里不好。做事的、加班的永远是那些年轻的、没有背景和关系的老实人。别问我为什么知道，因为我身边很多都是公务员。\n\n    在医院行政、财务和后勤上班还是比较好，没有政府部门文山会海，没有那么多的勾心斗角，没有那么多各项的检查，没有那么多无休止的加班。因为医院的整体收入还算可以，所以很多医院的后勤、保障部门、职能部门、行政部门、信息部门，很多都是各级领导的亲属，很多人关系背景之深，让人咋舌，比如有个同事不久前从其他医院调入我们医院，后来调入我们科室，最近又调入供应室，供应商不用上晚夜班，上班时间固定，不用与外界各种没素质的人打交道，所以这事让每个人都非常震惊，深感她的能量之大。\n\n   所以，很多有背景的人，你得罪不起：\n\n   有一天送化验的人员把化验单送错了，我很平和的打电话给检验科，说把骨科的化验单送到我们科室来了，麻烦取一下。过了一会，那个送化验单的人怒气冲冲的骂我：就你们新生儿科事多！动不动就打电话！让我惊愕了半天，其实只是好心的提醒化验单送错了，为何那么大的反应。讲给同事听，同事说，她是某某领导的妻子。\n\n    我们每天忙的像打仗，所以都是下午探视的时候讲解病情，有个人问某某床的病情，我们说上午忙，下午来问情况。她问我们主任的号码，我们不给，后来她投诉我们说态度差，后来得知她是我们退休的副院长，那个病人有蛛网膜下腔出血，正因为有她的撑腰吧，医院后面赔了10多万，其实分娩时蛛网膜下腔出血很是常见，对孩子没啥影响，算不上事故。说真的，得罪小人是件非常容易的事，小人搞你的鬼，给你穿小鞋，也是分分钟的事。\n\n  以前我在大医院进修的时候，各个职能部门的人都很和善，和她们打交道，如沐春风，那些辅助科室的人态度好好，非常友善和有耐心。进修回来多年，我还是不适应现在的环境，比如，打电话给检验科询问结果，别人心情不好，会把你骂的狗血淋头。\n\n    临床一线的，就是这么被人看轻，你还不能得罪这些部门。毕竟你有求于别人。\n\n   当然，医院是做事的部门，所以大多数人还是勤勤恳恳的，兢兢业业的，而且他们的压力也很大，也容易得罪人，有时候也会被小人算计，比如我们院长曾经被人举报，同时有一张发票，这个肯定不是临床一线干的；又比如我们工会主席，深受大家爱戴和尊重，儿子结婚，没有发请帖，没有发短信，没有打电话，我们自己自愿去的，还没有办酒席，就被别人告到政府部门，后来又告到省里。隔壁那个医院院长最近心情不好，又被无聊的人给告了。\n\n   我们临床一线的人都是傻子，像猪一样蠢，思想单纯，只知道埋头做事，讲话直来直去，不用担心得罪人，哪怕和同事吵架，也不担心她为难我。所以这些小道消息传来，我们都感到不可思议，觉得行政这块太复杂了。如果我们坐办公室，分分钟被玩死。\n\n    所以，很多人提议我们为什么不去投诉。很简单，得罪别人很简单，万一后面被别人穿小鞋不好，在任何单位和公司，没地位的是具体做事的人嘛。\n\n 还有知友问医院停电的事情，表示不可思议。因为线路检修、恶劣天气等原因，停电蛮常见的。至于什么双相电，至于什么电力法和投诉，我们也是不懂的。停电了以后我们立即用柴油机发电。通常停电后，我们立马把小孩用包被把小孩包裹起来，非常呼吸困难的，把氧气筒搬过来，上呼吸机的病人，用复苏囊正压通气。其实也能理解供电部门的困难之处吧，我觉得他们基层施工人员很不容易。\n\n至于说为什么不告诉家长，让家长去投诉或者找麻烦。这种想法未免太天真了些。内部的事情内部处理，没必要闹得沸沸扬扬。如果让外人知道了，小孩有什么不好，家属都会归咎于停电。我以前没有来新生儿科前，有个30周的早产儿死于新生儿坏死性小肠结肠炎，家属闹事，据说把事情归咎于停电，后来政府出面赔了10万块。\n\n曾经有个小伙子因为从小被家暴，有一天被父亲打了一顿，耳朵都快被咬掉了，后来住院的时候，他把母亲支开，从杂物间的窗户一跃而下，当场死亡，父亲不去反思自己把孩子逼死了，反而把责任推给医院，其中一点理由是那个消防通道没有窗户。\n\n我说这个例子是，别人喜欢找茬。所以小事情，我们不会把事情闹大。\n\n接下来说投诉吧，我们最怕投诉了。一方面大家缺乏服务意识，另外一方面现在的人哪里不满，动辄就是投诉，我觉得不是很好，因为你眼见的未必是真实的。\n\n就拿我们科室来说吧，因为人员的缺乏，所以我们是住院部带着看门诊、每天还有很多产科会诊、产房监产、手术室监产。每天早上8点交班、然后查房新病人、危重病人、特殊病人，然后管床单独查房，开医嘱，办理出院，还要收新病人，10点多钟在医生办公室看门诊，有的门诊病人可能等了很久，怨声载道，争执不断。我们四个医生轮流上班，一个上夜班，一个下夜班，一个上白班，一个上中班+副班，假设我今天上中班+副班，就需要在在完成自己管理的病人的同时，还要看全天的门诊、会诊、负责全天的产科监产，中午还要负责病房里面的事情，还要负责收新病人，下午还要负责给各位家属讲解病情，假设我现在来了一个新病人，那么其他门诊病人需要等候，比如我正在收新病人，这时通知产科监产，那么我就要停下来，连忙去监产，一个人做几个人的事情。假设，我今天上夜班，也是负责所有的住院部病人，还要收新病人，还要看门诊、会诊、监产。\n\n很多家属都是吃完饭，给小孩洗完澡，到了中午到医院看门诊，又比如，大晚上没事可做，跑来测个黄疸。比如有个高中教师，带着刚满月的小孩看黄疸（可以白天看，晚上看各种非急诊的门诊病人，浪费了医生的大量时间和精力），因为我们晚上在监护室上班（监护室号码贴在显眼地方，也有门铃），她就破口大骂，各种威胁，还骂怎么外面一个医生都没有，怎么不给小孩查溶血全套，巴拉巴拉的。一点素质都没有。\n\n      很显然，很多门诊病人是不满意的，怒气冲冲的，不时会发生冲突，很多人威胁我们要投诉。要知道，我们被投诉了。几千块就没有了。\n\n那么事实的真相又是如何呢，是我们不做事，在闲聊？在打牌？脱离岗位？迟到早退？\n\n       事实的真相是中国的医生的短缺，尤其是儿科医生的奇缺无比。一来国家控制着编制，二来，国家对医院的严重投入不足，各项收费的低廉，使得医院养不起那么医务人员，每个医院只能靠冷酷无情的绩效方案压榨医务人员，所以医务人员没有节假日，周末，没有加班费，没有所谓过节的三倍工资，我们医院内科系统，每年只休息过年2天，364天都要上班。三来，现在的家属不可理喻，所以医生都不爱干儿科，我当初带了一个徒弟，死活不肯搞儿科，我的好基友，打死不搞儿科。\n\n 所以你你久等的背后的残酷事实是什么？是医生怠慢你吗，不是，你投诉代表正义和不满，可惜事实的真相不是如此。\n\n说到投诉，其实一年也会遇到一些：\n\n医生刺激宝宝的足底了解他的精神反应情况，家属觉得打了他的宝宝，于是把医生给投诉了。\n\n医生还在查房，家长不停催促出院，把主管医生投诉了，要知道她的孩子病情非常危重，医生把他医治好了，一点感激之情都没有，反而因为这事把人投诉，挺让人心寒的。\n\n前几天，一个人打电话问10086要我们科室的短码。他拨打该短码，别人说：我不是医生！就把电话挂断了。于是那个人投诉了我们。护士长调查当班的护士，护士说我们没有接到电话呀，经过一番调查，原来那个人不是我们医院的集团号，自然拨打的短码打不到我们科室，自然别人回答不是医生。正是个智障。\n\n其实整个社会舆论对医疗行业不利，加上每个人都很浮躁，处于一种焦灼不安的状态，动辄就是争执、发火、谩骂，服务他人，很难获得别人的尊重，你要问我在医院上班是什么感受：就是比上坟还沉重，疲惫不堪，忙于应对各种事情，小心翼翼，如履薄冰，深怕投诉和挨打。\n\n正因为感同身受吧，我通常比别人更能体谅他人，更能体会到别人的艰辛不易，对为我服务及提供帮助的人总是真诚的感谢，总是先释放善意，而不是敌对、仇恨、找茬、惹事的态度去办事，所以别人也能感受到我对她的尊重和善意。\n\n当然我的本意不是说，不准投诉，投诉就是无理。\n```\n\n\n\n  以下是原答案：\n\n我在新生儿重症监护室上班，新生儿每天需要洗澡，还要经常洗屁股，我们医护人员每天用流动水洗很多次手；很多新生儿需要输氧或者正在上呼吸机；监护室有几百台仪器设备同时在运行，包括暖箱、辐射台、输液泵、呼吸机以及其他医疗设备，所以，停水停电停氧对我们影响很大。\n\n   如果提前通知停水，我们用各种桶子储水，停水几天，我们只能用桶装水给宝宝配制奶粉，用桶装水或者灭菌用水洗手。如果跳闸了，通知水电人员处理，一般而言，如果停电太久，我们医院用发电机发电。\n\n  前段时间，停电时间太久，医院也没发电。我们打电话给总值班，希望总值班能够协调一下。总值班居然说：你再打电话，扣你们的分！\n\n   俗话说：分分分，学生的命根。同样，对于医生也是如此，每个医院施行严格的绩效方案，扣分和加分都会影响当月的收入。\n\n   总值班不去询问电厂什么时候来电，也不去督促电工发电，反而责怪我们多事。真是奇葩，反正在她眼中，你们没电关我什么事，设备不能运行管我什么事情。 \n\n   再打电话，扣你们的分，这是我听到院行政人员说的最无耻的一句话。",
				"added": 1520610521
			}
		],
		"1520610685_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 3,
				"body": "让员工在朋友圈转发公司的广告！\n\n我是技术人员，我把我18年所学习的知识，我的每一个谋杀睡意的清晨，每一个精力充沛的上午，每一餐狼吞虎咽的午饭，每一个疲惫不堪的下午，还有出门就是华灯起的夜晚都给了公司，然后领导在群里发了一条不知什么软件编辑的，掷地有声地向我25年精心培育的审美宣战的广告：\n\n“请大家转发到朋友圈”\n\n你们夺走了我的生活，还要夺走我的嘴巴！把我所剩不多的私人环境变成你的广告展板，让我彻头彻尾地活成了一个工作机器。\n\n知道什么叫做朋友圈吗？知道什么叫朋友吗？除了萌，老子没向我的朋友卖过任何东西！\n\n好吧，我可以忍受，拉个分组，出让我生活的一部分给你们，做你们自娱自乐的舞台。\n\n然后，你们让我改头像！改头像！\n\n连我的身份都要拿走！\n变成你的广告。\n\n好了，人要心怀感恩，我知道。\n\n所以感谢尚不发达的医学科技，还不能让我把脸换成公司的广告。\n\n嗯，我知道，我知道，你们心向往之，力不能及。",
				"added": 1520610697
			}
		],
		"1520610747_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 4,
				"body": "说一个之前在星巴克经历的。\n星巴克每个班次8个小时左右。\n中间有50分钟休息时间。\n（中班是一个半小时）\n\n有一次我休息去吃饭吃完回来休息。\n看到外面非常忙碌。\n就准备穿上围裙去帮忙。\n经理见到问我。\n你休息够50分钟了么。\n我说48差不多了。\n外面忙我来帮忙。\n经理直接告诉我。\n我不差你的两分钟回去休息够点再来。\n店里再忙都不需要你提前上班。  \n\n\n从此就对星巴克的制度好感倍增。\n\n在上班回头继续更\n\n--------------------\n先说明一下。上面说的事情是值班经理对我说的。\n这种事情店长都不出面的。\n下面这个事情也是。\n\n\n\n再更两个事。\n 第一是我在户外收拾桌子的时候。\n两位女士叫住我。\n说希望我帮忙倒两杯清水。\n因为觉得他们点的提拉米苏星冰乐有些腻\n感觉比以前喝的腻。\n说要两杯水缓一缓。\n我说好的\n然后回到店内告诉了值班经理\n值班经理说应该是制作的问题把糖加了两遍。\n让我去插队先出两杯正常的。\n再倒两杯水。\n出去看到他们喝了之后询问是否还是甜。\n如何还说甜。\n就回来再做两杯半糖的。\n直到她们满意为止。\n于是当我端着两杯新作的星冰乐过去时候\n明显能感觉到顾客真的超激动\n这时她们手上的饮料已经都喝了一半多了。\n喝完新的之后说这个味道就好了。\n然后我向她们道歉。\n前面的产品做的确实有问题\n这时候我才意识到星巴克的厉害。\n这样一个危机事件之后。\n这两个人按照当时激动的程度\n一定会变成星巴克的死忠粉\n而我汇报结果的时候\n值班经理只告诉我。\n以后这种事情不用过问他了\n自己去处理吧 \n\n\n\n第二件事是我愿意一直给周围人安利去星巴克上班的主要原因。\n当时我已经离职一年多了。\n突然接到店里的电话。\n电话告知我一年前卖月饼时候的分红下来了。\n一共一百多块。\n希我有时间能过去取一下。\n离职一年多了啊。\n工作都换了两个了。\n接到这样的电话。\n当我再次回到店里。\n零钱时候值班经理拿出一个小本子。\n里面全是各种离职人员的欠款\n最早都有五六年前的钱。\n因为员工出国了\n没有办法取走\n就一直在抽屉里放着。\n\n一个无论如何不会坑员工坑顾客的店。\n你说我为什么不去安利他。",
				"added": 1520610751
			}
		],
		"1520610805_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 5,
				"body": "题主你挺奇怪的，一群男人在工作场合把一个女人“往墙角推，摸她”，然后你的反应竟然不是“这帮男的性骚扰女同事，真无耻”，而是“这个女人什么心态，真贱”？？！！\n\n人家女的骂也骂了，打也打了，被摸的时候也蹲在地上躲避了，你还觉得她没反抗？？！！合着她没有哭着跑出去一绳子吊死都不算反抗是吧？！\n\n你为啥不问问人家女的骂的时候男人停手了没？蹲的时候你阻拦男人们了没？打的时候有人道歉没？\n\n这些在工作场合性骚扰女员工的男人是什么心态？面对性骚扰不但不敢阻止，还称受害者“贱”的题主又是什么心态？\n——————————\n集中回应部分评论：\n\n1）请学学什么叫“一面之辞”，凭借着对女同事有明显不满的题主的一面之辞认定女同事“就是贱”，“就是自己喜欢”，“我见过这种女的”的人，你们真棒。\n\n2）题主可以不制止，你们遇到同样的事情也可以不制止；但不制止反而认为女同事很贱，并且跑到知乎上来问“是什么历史导致她这样”，这个关注点很奇怪。\n同样，你们如果不制止骚扰，背过去却很带劲地嘀咕“被骚扰的一定很贱”，“要么怎么光骚扰她”，那你们也很奇怪。\n\n3）我整篇答案用的最重的一个词是“奇怪”，很多人觉得我骂了题主——同样这拨人，却不认为题主使用“贱”是辱骂了女同事。原来“奇怪”比“贱”严重得多，学习了。\n\n你们真是棒棒哒。",
				"added": 1520610817
			}
		],
		"1520610854_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 6,
				"body": "做为曾经海底捞的一员... 你知道吗?还有本书叫《海底捞能捞多久》-----------\n\n开头：\n\n什么时候忘记了 通过《看天下》知道了海底捞 知道了《海底捞你学不会》\n\n于是带着对海底捞的憧憬和好奇 寻找那本书 巧然 网上有电子书 于是下载到手机上 接下来的一段时间 上厕所看看 坐地铁看看 没事了看看 ......\n\n看到快一半的时候......实在看不下去了 \n\n感到这是本毫无养分的书（你可以试试） 就好像看无限极保健品或者某个非著名寺庙的宣传手册。\n\n但还是对海底捞仍然憧憬着 \n\n于是今年年初的时候选择 来到北京 加入海底捞 看看它到底多牛逼\n\n对《海底捞你学不会》的看法：\n\n也许《海底捞你学不会》描述的是早期还处于创业初期的海底捞吧\n\n现在的海底捞和书里面描述的 不敢说大相径庭 但相差甚远总有了\n\n就像《三国演义》和《三国志》的区别 就像《新闻联播》和...的区别\n\n你懂得\n\n一、大家都关注并好奇的问题：\n\n免单的问题\t\n\n先说送菜 这种情况不是因为客人有需要庆祝的特殊日子就是因为服务员犯错了要补偿你 例如过生日 会送你果盘并辅以三四个服务员一起唱生日歌；或者服务员给你服务时犯了些不大不小的错误 例如你都快吃完饭了 有一道菜还没上来 那就送你吧\n\n然后是免单 海底捞的服务员有权给任何一桌客人免单 ——这是理论上\n\n我经历过得一次免单情况：一桌客人吃饭吃一半 发现盘里有头发 然后点了根捞面 催了几遍才过来 来了之后甩断了三根 于是 客人发飙了......还好 那桌消费不到二百 于是免单了 \n\n送菜和免单大部分情况其实是弥补错误的一种方法 这就是危机公关 处理好了 你下次才还回来 并且会把这次补偿你的经历炫耀给你的亲戚朋友 于是...他们也跃跃欲试了 总之菜品不是随便送的 在服务你的过程中没出现失误 基本是不会送你的 毕竟这是买卖 不是慈善  话又说回来 这要是在其他地方 免单？你TM想吃白食啊？！ \n\n宿舍的问题\n\n海底捞住的宿舍确实不错 我住的是离店步行十分钟左右的公寓里（传说中北京有个店住四合院） 上下两层 据说一万多一个月 也确实有阿姨 有电脑 有WIFI 有洗衣机 工作服你下班了可以扔在店里更衣室的桶里 但第二天要是想找合身的 你还是早点去吧 还有在桶里的工作服定期会有人洗 。。。。。。至于你自己的衣服 还给你洗衣服 给你美的。   \n\n吃饭的问题\n\n接下来要说的就是 最搞笑的事 “吃饭也不在店里 是由阿姨做菜” 楼上那哥们你也太搞笑了 如果你是老板 还是开饭店的 你会不让员工在店里吃饭 让阿姨在充满男人味的宿舍里做饭吃？我怎么记得我那个宿舍厨房里是放鞋和放盆的地方呢？更何况四五个分散的宿舍就一个阿姨 火锅店里有现成的厨房不用？好了 确实有专门负责做饭的师傅 菜单也是固定的 贴在墙上 只不过 服务员吃饭的时候是在客人少的时候没开放的区域或者晚上在后厨走廊里吃 自己端着盘找地方吃  \n\n也许每个店不一样 当时我是白班 早上九点上班 晚上十点到十点半之间下班 晚上那顿饭是九点做好的 这样晚班九点上班就可以吃了 晚上的饭就是把白天配菜时剩下所有的下脚料都炖在一起加上火锅底料 貌似大部分火锅店都是这样的 重点是...我们是十点多下班才能吃饭...晚班吃饭的时候已经把荤菜全部扫荡了 到我们吃的时候 你可以想象一下 一份麻辣烫 里面装着竹笋（不喜欢的味道）、白萝卜、炖碎了的宽粉、腐竹、土豆。放在蒸米饭用的大铁盘里，已经在外面晾了一个多小时了 表面上略微漂浮一层凝固的油  有食欲吧  不吃...那晚上多饿啊\n\n嫁妆的问题\n\n至于“嫁妆”的事 当时我的下铺在海底捞也有一年多快两年了 他说：经理走给钱？好像听说过。大区经理走给店？那那个店的员工怎么办？送的那个店也叫海底捞？海底捞全是半成品 那配货怎么办？ 另一个：你见过干到大区经理走的么...\n\n二、海底捞身陷红海 该如何价值创新\n\n未完待续......",
				"added": 1520610880
			}
		],
		"1520610904_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 7,
				"body": "所谓「如果你把睡觉的时间用在事业上，以后自会有很多女人陪你睡」，可以用“ 流氓逻辑，嫖客思维 ”来概括：\n\n\n1.从这句话的词义规范看，这里面的两个“睡”字的含义完全不同，前者指的是进入休眠状态，后者指的是发生性行为。放在一起是故意混淆、偷换概念。\n\n\n2.从这句话的潜在逻辑看，“放弃睡眠” 和“异性青睐”之间并无直接因果关联。一来放弃睡眠并不必然导致事业进步，二来许多男性不用事业多成功也可以获得性交机会。能把这两者扯上因果关系的，都是典型的嫖客思维。\n\n\n3.从这句话的前后语境看，显然在是忽悠你入职后为公司卖力卖命，放弃正常的休息权利。这是拿你当零件易耗品使用的征兆，骨子里轻视你的健康，这种企业文化相当堪忧。\n\n\n4.从这句话的传播来源看，这是一段滥大街的成功学鸡汤的后半句。面试官很大可能是个没有独立思考能力的，被朋友圈转发或是三流激励培训坑过的可怜人。\n\n\n5.从这句话的隐含三观看，把女人是否愿意陪睡视为事业的应变量，这是非常露骨的物化女性，反应出引述者身上的嫖客英雄主义情结积重难返。而具有这样特征的上司通常性格狭隘固执，尤其喜欢强加自己意志予人，你若跟他干活会很憋屈。\n\n\n6.从这句话的语气姿态看，是高高在上，不够客气尊重的。试问他敢不敢和达官显贵说一样的话？但他敢和你说，已经透露了你这个职位在他们公司的真实地位。\n\n\n7.从这句话的政治正确看，这种法律和舆论风险极大的扯谈话居然能堂而皇之在台面上说出口，可见该企业缺乏谨慎意识。以我混迹江湖的经验，这种草莽气息浓烈的企业，有很大的概率将来会在劳动法合规上出点幺蛾子。\n\n\n综上，这个企业不去也罢。\n\n\n面试面试，既是他面你，也是你面他。",
				"added": 1520610912
			}
		],
		"1520610942_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 8,
				"body": "之所以你只对Sony有好感，是因为Sony离你太近了，你的知识面太少，接触的东西太少，只看到消费文化领域里的东西而已。你看不到微软在中小企业背后提供的支持，看不到IBM和Oracle为大型企业、基础行业提供的支持，看不到思科、华为为网络通信基础提供的支持，看不见飞利浦、欧普为照明基础建设提供的支持。现在各家科技公司之所以能存活到现在，都是有其独一无二的东西别家根本做不出来的。你之所以不感动，只不过是因为他们还不在你的视野里。\n\n你对微软没有好感，是因为你不知道在Windows平台上用Visual Studio开发软件是一件多令人愉快的事情。我们生产部门的前端控制系统都是基于Windows平台，远程调试不要太方便，即便跟中控的Linux通信，开发难度和时间都是非常低的。这方面Mac上的OS X以及Linux平台都没法比。甚至我在Xbox One上开发个游戏也要比Sony在PS4平台上成本低很多。\n\n你对Google没好感，是因为你不需要查找大量的资料，而且是精准的资料。这方面Google有无可比拟的优势。微软的Bing根本不知道我要找什么，更别说雅虎百度之类的搜索引擎了。只有Google能够在第一页给出我80%以上想要的结果。Android平台也是非常开放和自由的，我们很多近客户端平台软件在Android上部署非常舒适，多程序间的协作，包括更新以及开发难度都是Windows Phone平台以及iOS平台完全无法比的。\n\nSony的优势主要是在工业设计和HUI上，Sony的相机、MP3、电脑之类的很明显可以看得出在硬件接口上有经过深思熟虑，每个按键安排的位置都恰到好处，所以用起来有亲切感。\n\n但是……Sony在软件人机接口方面的设计真的感觉是像毫无经验的人，比如Sony相机的菜单系统，感觉不是人用的，想找个设置翻半天，跟佳能比操作速度马上慢一大截。你如果接触开发的话，会发现Sony开发SDK的人都是脑子进屎了，API设计反人类逻辑，完全不明白为什么要以这种方式设计。跟微软的SDK比比，简直一个天上一个地下。\n\n在GUI方面Apple是非常擅长的，Apple所有的软件的使用逻辑都非常直接和简单，这方面Google和Microsoft都很差劲，别人让我推荐编辑视频、照片的软件，我都只推荐Apple的软件。教我姥姥使用Android手机的操作逻辑，想想都让人头疼，还要让她杀毒，清理空间，简直要杀了我。买个iPad给她，她自己就能摸索出来，她连iMovie都会自己学着用，别的公司能比么？\n\n\n我会用Apple的Final Cut Pro X处理日常短片剪辑，对我来说它比Premiere Pro好用。但不代表Adobe就不是个好公司，我会用Adobe的Lightroom和Photoshop来处理照片和游戏素材。做特效还是要仰仗After Effects而不是Motion。我不会用Sony的Vegas来做短片，因为它没有我需要的功能，但是拍短片和照片我会带着Sony的微单，因为它们轻便，拯救了我用尼康而犯的手指关节炎。但是我打游戏还是用Xbox One，因为它可以和Windows 10紧密结合。做实验性项目还是Windows和Visual Studio平台最快，分分钟部署到Xbox One上看效果，这点Sony的PS4做不到，SDK难用还要买开发机。我大部分都是用Mac的，但是我做开发还是用Surface Pro，到现场调试项目都很方便。但是我不会用Windows Phone的手机，因为iOS在速度、性能、安全、美观以及软件体验上是其他移动操作系统都不可能达到的。但是我又有一个Android备机。因为它屏幕大，而且系统更开放，我用来看书以及分享，我可以出门只带Android机和OTG线就可以备份我相机SDK卡上的照片。我会用Google查资料，不会用Bing和Baidu，因为他们不知道我要什么。但是我会用百度网盘存我的云数据，因为百度云盘速度很快。\n\n这些公司对我来说都是很伟大的，因为他们帮我解决问题，让我生活的更便利。我会利用各家所长来最优化自己的生活，而不是个信仰某个品牌。\n\n信仰从某种程度上来说就是一种盲目，一种无知。",
				"added": 1520610955
			}
		],
		"1520610981_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 9,
				"body": "难不成为了江山社稷？",
				"added": 1520610982
			}
		],
		"1520611009_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 10,
				"body": "一般效率比较低的公司才会这样。",
				"added": 1520611007
			}
		],
		"1520611044_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 11,
				"body": "我有个兄弟，原先开挖掘机，挖露天煤矿，挖沙石，挖泥土，挖坑。\n\n监工蹲在棚里，时时刻刻盯着。夏天很热的，每天连续工作10小时，不停的挖，挖，挖。如果你从驾驶室里爬出来，去找瓶水喝，监工就给你记在小本本上，罚钱20元。如果去拉屎，罚钱20元。如果你不幸今天拉肚子，不停的拉，拉的脱了水，又需要不停地去喝水，那么很有可能你干完一天，要倒交给老板20元。所以，工人累倒在驾驶室里，病倒在岗位上，很常见的，有人不行了，老板就换一个工人。蓝翔的，不值钱。\n\n但是，如果挖掘机坏了，那个大勺子上的齿断了，液压杆漏油了，发动机冒烟了，需要维修，这时候挖掘机司机就可以合法得休息，喝水拉屎都不会扣钱的。\n\n挖掘机坏不坏，是不以工人的意志为转移的，除非挖掘机的大勺子往石头上硬砸或者爆冲。一般连续冲上两三分钟，那个齿齿就要断掉，这也不是以工人的意志为转移的。于是，就要检修一番，花费大概1000——3000不等。用时可能一两个小时吧，够去拉屎了。\n\n我那个兄弟说，他一年也就万把块钱的屎钱，已经很厚道了。他一次都没有往油箱里扔沙子。\n\n他说，工人拉屎不扣钱的老板，挖掘机几乎不怎么坏。\n\n小白领拉屎扣钱的公司，应该没有挖掘机吧？",
				"added": 1520611048
			}
		],
		"1520611077_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 12,
				"body": "当年一个同事，销售业绩全公司第一，山东的小伙子，人缘特好，人热情、实在，话不多却让人如沐春风。\n\n我们有过几次工作上的交流，是委托我照顾他在省城学习的客户，特别客气，我们还约好了年底公司年会见面好好喝酒叙叙。\n\n距离年会还有三个月的时候，他车祸，当时人就走了。那一天，他开车出差，手机里打的最后一个电话是给代理商的。\n\n当时公司老板带头捐款，自愿捐，每个同事都捐了，从3000-500不等，不要求，随个人意愿。还有公司赔偿的一笔不小的金额，他是因公去世，都一并交给他的家人。\n\n同事有保险，保险公司赔了一笔钱。但再多的钱也换不回生命，同事的父亲在听到消息的一瞬间就晕过去了，距离那一年的春节，不到一个月。没法想象那一年的除夕，他的家人是怎么过的。\n\n他的去世让大家难过了许久。26岁，孩子才4个月，他们一家人都是基督徒，非常虔诚。\n\n后来大区经理自发组织定期的募捐，我知道后也加入了，每个月代表100，主管和经理200元，这是10年前，大区经理把大家捐的钱每个月固定打给同事的遗孀，作为孩子的奶粉钱。不管够不够，这都是大家的心意，发自肺腑的。\n\n后来有一个天津的同事跳槽走了，他走前最后一个月，其实已经在那边新公司上班了，捐款名单里还有他，经理说你已经不在这个团队了，可以不捐了。他说，这个月我还是咱这个团队的弟兄，我只要在这里一天，我都要捐。他跟那个去世的同事几乎没有交集，更谈不上私交，是被身边的同事们感染，他自发参与。\n\n这个捐款持续了一年，后来因为上头大老板换人，骨干们都开始陆陆续续流失，才慢慢终止。\n\n过去10年了，特别怀念当时的那个氛围，那种同事们之间相濡以沫的纯真。什么是公司的人文关怀，是那种润物细无声的温暖，感染每一个人，去自发得向善，没有规章，也没有条例，自然而就。\n\n和当年的那批同事后来大家都陆续去了不同的公司，再见面，仍然温暖如初，不管联系与否，我都知道，他们，就在那里。\n\n想你们，祝福大家！",
				"added": 1520611078
			}
		],
		"1520611112_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 13,
				"body": "匿了吧。背景：央企，法务，非总部。\n\n\n误解1：工作很清闲哒，每天茶水报纸就好啦。\n\n实际情况：我特么加班到吐血了有木有！！\n好吧我承认很多时候我的工作强度没有什么投行、金融行业那么大，但是加班对于我来说就跟晚饭一样寻常。我11月17号出差一个月回来，到现在（12月24日）总共又出差四次，工作日在家吃晚饭次数不到5次，加班到凌晨4、5点回家洗个澡吃个饭回单位继续上班这种事儿不止一两次。顺带提一句，我们部门出差强度最大的一个哥们儿，一年250个工作日他出差184天，我正在逼近这个目标。\n前段时间谈判，每天早八点谈到凌晨四点，回去商量俩小时咪俩小时早上八点继续开始谈，利用小问题分散注意力拖延时间，把大问题留到底线时间来压对方，我正好负责用来拖延时间的小问题，连续四天这样的工作，真的是快死掉了！！\n\n\n误解2：工作很简单的啦，谁来都不会差。\n实际情况：我特么被逼死了好不好！！\n我学法律的，又是做商务、合同这类的工作，法律专业知识自然不必说；但是我们做的合同特别专业，我需要对整个行业都有所了解，于是我在入职后的第一年，下班时间基本全部用来看专业书籍了；由于跟国外打交道多，所以对英语要求各种高。\n想想下，一个刚考完英语六级的本科生，面对着十几本平均页数在150左右充满着专业名词的全英文合同，你是不是有一种跳楼去死的冲动？\n\n\n误解3：工资很高的啦，XX央企的工资出名的高啊。\n\n实际情况：谁特再说资高我跟谁急！！！别拿XX公司那个38万6说事儿好么！！！我一年辛辛苦苦下来到手钱刚刚超过最小的那个六位数的一半儿好么！！！\n\n\n误解4：工资低，福利好嘛。\n实际情况：我把我所有非工资收入摆出来吧：逢年过节的过节费发到购物卡里只能自己没法变现一年大概4K；每个月22个工作日每天30块钱饭补一共660还是打到饭卡里没法变现；每个月100块钱打车费报销（我特么最近经常出去办事儿每次出去办事儿打车费我都是自己掏一个月绝对不止100好么！！）；每个月发张100的电话卡。除此之外，没了。\n哦对有人说房补：房补发了不到一年吧，一个月1000。1000块钱能在北京租到什么样的房子大家都清楚吧！！我靠着这1000的房补多少年能买的起一平米房子！！【这部分钱我算在上面的工资收入里了】\n【2016Update：过节费没了、660饭补没了、每月100打车费没了、每月100电话卡没了、半年奖没了、优秀员工奖没了、年终奖有没有还不知道。级别上来了工资反而下去了，一年10W真的要活不下去了……】\n\n\n\n误解5：收入低点儿，以后级别升上去了就高了啊。\n实际情况：升你妹啊升！！升个P啊升！！举个例子吧：某大型央企130来万人，其中算是干部的有10万，其中科级干部有5万多，处级领导就不到1万人了，厅局级不到1000个。局级咱不指望了，100个人里面不到1个的处级领导，一年能有30-40万晚上睡觉都能笑醒了！！\n而且你以为公司里每个人的爹都是【】啊！！你觉得你比那另外的100多个人强在哪儿啊？凭啥就是你能当处长啊？？提级别？？别做梦了好么！！！\n\n\n\n误解6：哎呀，就算收入不咋地，至少稳定啊。\n实际情况：稳定？有编制的都是3年一签合同，合同期到了绩效不合格自己看着办！！！！还不是领导一句话说滚就滚了啊！！就算你死皮赖脸不走，领导一句话夏天把你扔到45摄氏度的沙漠里数上100天的沙子试试？台风季7级海况让你上一条几十吨的小船给几十海里外平台上的兄弟们送补给，你去不去？领导看你小伙子身体挺壮实，去疟疾霍乱艾滋埃博拉满地跑的非洲原始森林里帮人盖房子去不去？不去？那你就别在我们这儿待了。\n\n\n误解7：油水多的很啊，随便捞钱拉。\n实际情况：真的没有油水啊！！如果你们觉得从办公室里拿两根曲别针回家用算是油水多的话就当我没说吧！！大央企都是上市公司啊有木油！！！上市公司要审计的啊有木油！！！内审外审上级审国家审第三方审，我们敢捞钱么！！你以为那一串串的内控制度和审批流程是吃素的啊！！！大家都巴不得赶紧抓出来两个蛀虫挂起来看看呢好么！！\n\n\n误解8：其他人都是混日子的，有能力就能出头拉。\n实际情况：混毛啊混！！扯淡啊！！我一个211+985重点大学的本科生，跟我一年入职的几十个人里面，学历排到最后面啊！！！你以为红/官/权/富/煤/油/电二代都是混吃等死啊！！！神马北大本科清华硕士清华本科北大硕士的一抓一片好不好！！！神马德州农机加州理工也有好几个好不好！！偏偏他们干活儿一个比一个卖力有木油！！看看【】啊！！人家他爹是【】啊！！不是照样挑粪挖泥糊沼气池子么！！！有这种例子放在面前红/官/权/富/煤/油/电二代怎么可能都是混吃等死的主儿啊！！！你凭啥认为自己拼爹拼不过但是能力更强啊！！！\n\n\n误解9：分房、集体购房，多好的福利\n实际情况：扯XX蛋！！！为什么你们不在国企却说的一个个证据确凿！！我就在公司里咋一个都没听说呢！！！我咋只知道从【】年起就从来没在北京分房了呢！！好吧我听说过有在项目附近团购房子的，但是团购了房子就意味着你丫要一辈子呆在那鸟不拉屎的项目了好么！！！你丫愿意么！！！愿意的话咱俩换！！！\n\n\n还有好多误解，我都懒的辩解了。次奥。\n\n\n为啥不辞职？领导开明、同事关系好，没有太多的公司政治勾心斗角，干活干的开心；不会担心明天公司是不是倒闭了，只要按部就班勤劳工作、不出格不跳脱不用太担心自己的饭碗会被打翻，这样的工作还是不错吧？",
				"added": 1520611123
			}
		],
		"1520611225_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 14,
				"body": "我是海豚在职员工，对公司面对这个事情的处理方式实在是太不满意了，一定要说点真实情况出来。\n海豚是一家创业公司，没错，但是不管什么事都用“创业”这两个字当挡箭牌，这让很多员工欲哭无泪。\n\n首先，海豚没有什么“企业文化”，如果硬要说有，从我的角度看只有两个字“欺骗”！\n我是被海豚从上家单位挖来的，面试了两次之后接到HR电话，说就这几天给我发offer，当时挺高兴，\n毕竟觉得海豚浏览器这个产品还算不错，而且之前也谈妥了薪资，再加上已经不太愿意在上一家公司继续任职，于是就迅速办了离职手续\n\n但是拿到到offer的一瞬间我有点错愕，上面白纸黑字写着“经双方协商同意，保险和住房公积金按北京市最低基数缴纳”，我打电话给面试我的主管，主管告诉我“我们是创业公司，都这样的。”虽然很不爽，但已经从上家单位离职，后悔也没办法了。\n报到入职的时候HR拿了劳动合同和员工守则给我，上面没有任何一处写明薪水，我问HR，她说会按照之前跟你谈的数字发，不会有问题的。（果然，试用期结束转正时比当初谈的薪水少了几百块，数不多，但是跟吃老鼠屎似的，很恶心。）\n然后又看到员工守则上写“每周上6天班但是没有加班费和补贴”(原话忘了怎么样的)，我一下就发现我接触过的这公司的人没有一句实话。\n\n面试+电话，总共沟通超过3个小时，从来没有一个人告诉我每周6天班没有加班费，也没有人告诉我保险按最低基数缴纳，是想瞒着我还是忘了说？有没有人敢说我上面关于海豚的内容有假话？还是海豚又想说“我们是创业公司”？\n \n返过头我觉得我真的很失误，竟然用正常公司的状况推测奇葩的海豚浏览器，就算买个教训了。\n\n希望公司能有一些真正的改变，而不是注册很多知乎账号来发一些看似冠冕堂皇混淆是非的答案，事实是怎样大家都清楚。我们所有人都等着看公司的做法，媒体不是全都可以用公关费删负面新闻的。真心希望我们不是你杨永智和几个高管创业的垫脚石，不要再骗了不要再过分压榨了，把员工当伙伴和战友，好吗？\n\n我看了折叠的要件，这条答案没有任何违规。如果被折叠，我会认为知乎被“公关”了，希望知乎能够做一个客观干净堂堂正正的社区。",
				"added": 1520611227
			}
		],
		"1520611264_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 15,
				"body": "放毛片的判十年，买人血馒头的当委员",
				"added": 1520611257
			}
		],
		"1520611304_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 16,
				"body": "别费劲去想如何去拒绝，你越是想讲理，就会发现权力之下越是讲不清。\n\n既然你能够比别人更快完成任务，那工作能力肯定不差，赶紧找另一个不需要加班的工作才是正经的。",
				"added": 1520611325
			}
		],
		"1520611356_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 17,
				"body": "强调感恩的公司都不太正常。\n\n老子凭劳动换口饭钱，欠你公司啥了？凭什么还对你公司感恩戴德？\n怎么，你公司没剥夺我的剩余价值？\n不是员工该向老板感恩，而是老板该向员工感恩。\n我们不向你追究，你还倒打一耙了？\n\n劳工大众要积极用马克思主义武装自己的头脑。这才是保障劳工利益的武器。\n\n爱岗敬业是指尊重自己的劳动，尊重自己签订的契约，和感恩扯不上边。\n别拿感恩掩盖你剥削的嘴脸。",
				"added": 1520611350
			}
		],
		"1520611385_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 18,
				"body": "推崇加班，以加班作为员工是否尽责的重要标准。\n\n\n在正常上班时间内完成工作难道不是应该的么？\n\n\n===================5.10更新========================\n\n没想到随随便便吐槽的回答居然收到那么多赞，有评论说不是每一种工种都能够按时下班，我这里吐槽的是员工完成当日的工作还不能按时下班的企业。\n\n说一下我以前实习的经历吧。\n年初在深圳一家互联网初创公司实习，岗位是新媒体运营（我个人觉得更像是内容编辑），整个团队人数不到20人。我的上司会按照公司每个阶段的推广策略来安排我写文案。当时刚进公司，对公司还没完全了解，所以给我安排工作的时候我的上司都会跟我商量交稿时间（这点对当时的我来说还是挺仁慈的），我每天都自己做好工作计划所以一直都能够按时（甚至是提前）交稿。\n但是，由于我本人是不喜欢加班的（而且当时还打算下班回家写毕业论文），本来面试时说好朝九晚六，结果上班时才告诉我说是六点半下班，这让我很不爽，所以我基本上是上班时间就把工作做好，到点就下班。而其他如开发、数据运营、用户运营等的岗位的同事经常加班到七八点。\n一段时间之后我发现我的上司对我的态度变了，又经常在临下班的时候找我谈工作上的事情，尼玛这就是变相加班啊！！后来由于接受不了公司的氛围，在实习期还没结束的时候（估计熬到实习期结束我会发疯）以指导老师要求回校写毕业论文为由把工作辞了。\n\n哦，对了，我辞职时说好的工资还没发给我呢",
				"added": 1520611377
			}
		],
		"1520611451_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 19,
				"body": "抄袭，成功了，就不是罪恶了？\n\n黑道，洗白了，就是成功企业家了，就需要大众跪舔了？\n\n贪官，外逃了，守法了，就不能追捕了，审判了？\n\n纳粹，学习了，经商了，成功了，就不能清算了？\n\n\n再说了，腾讯真的收手了？没有抄袭了？没有扫描硬盘了？没有后台上传了？没有分析用户隐私了？\n\n\n-------------------------------------------------\n这种烂答案也被赞这么多，感觉十分荒谬。\n还是说一说为什么讨厌腾讯吧。\n\n2004--，挺喜欢QQ的，会给周围的人推荐、申请，惦念着挂级。讨厌QQ弹窗弹出来造成游戏失败，人物死亡。\n2005，发现了一个东西叫QQ千里眼，号挂到了15级，被盗，三周后在小号上看到之前的号信息被改，级别一个星星。用胖企鹅，忘了在哪里下载的，不过我有印象在http://im.qq.com里看到过胖企鹅。个性签名、昵称无法打出抗日，却可以打出钓鱼岛是日本的。开始很用心的玩QQ空间，养那个树，参加空间club内测。QQ仙境。当50QB一个月的论坛版主半月。\n2006，好用的网络硬盘，开会员、自定义头像、保存表情、追着更新版本，开黄钻，没有再用珊瑚虫。qqjia碧云轩，你好陈水扁。QQ空间出现一个转载别人日志的“病毒”，QQ空间树的等级由四部分构成，删除了那些垃圾之后，最关键那个，清零了。用该“病毒”的人，倒是无伤。\n2007，珊瑚虫、陈福寿、我也不似以前那么无忧无虑无知无畏。网络硬盘上传下载容易失败。QQ越来越卡。追的最后一个QQ版本是2007.07，这个版本比较特殊，其它版本在QQ面板标题栏位置都是年份，这个版本的标题栏是2007 07。穿越火线，在相当长的时间有着Bug、外挂、玩家人数的耀眼表现(现在的运营团队倒是不错)。魔域私服出现，全是QQ魔域的客户端。17173的水军，百度知道的QQ爱好者，还有琳琅天上。\n2008，彩虹。网络硬盘变成了什么网络收藏夹，是个渣。依然不能抗日(可以被日)、依然千里眼、依然弹窗。毒奶粉，小霸王服务器，遍地外挂(毒奶粉运营团队一直保持本色，可歌可泣)。买了第三方的空间主题，在当时，爆官方主题十条街无压力。看凤凰、新华网、南周、网易、乌有之乡，感觉腾讯的部分新闻脑残无比。政治QQ群屡屡被封，汉奸QQ群甚是逍遥。被安装了TT浏览器、QQ音乐，卸载之后网页文件与音乐文件失去程序关联，还是小白的我上不了网了，音乐打不开了。汶川，腾讯公益，腾讯名义。华夏变成了QQ华夏，年底开始卖经验。水军依旧，QQ爱好者依旧，QQ相关百度贴吧断楼严重。北京某公司网页用了QQ头像，腾讯索赔100万。coco的网址，被腾讯标记为木马病毒。第一次“圣战”，琳琅天上。\n2009，终于不能直接在本地打开聊天记录的文件了。开始发现QQ在上传东西。同学练毒奶粉小号新注册QQ，登录提示：帐号被封停。威震寰宇的TenProtect横空出世，水军依旧，QQ爱好者依旧，贴吧断楼依旧，还被50QB的版主恶心了几次，毒奶粉台服远征骂人团。QQ空间资料里有我的真实生日，可怜我填生日从来都填的1111。嗯，还有琳琅天上。\n2010，对门宿舍悦悦童鞋电脑连手机2G网络上QQ，惨被吸费93。毒奶粉帮忙扫描电脑《狗日的扣扣》，\"腾讯是娱乐公司，没有冲突\"，后台静默安装的某管家，\"上传用户数据\"，某保镖，\"艰难的决定\"，我用了ProcessMonitor。还有360一挑五，连10086都给我发短信说这，金山、腾讯、网易、搜狐、可牛，可牛就个凑数的，网易、搜狐可没惹这事，况且当时搜狐跟腾讯还在吵QQ拼音为毛能直接打出搜狗拼音开发组成员名字(这句是道听途说)。哦，不能少了琳琅天上。\n2011，腾讯开放。安装必带全家福，连游戏补丁都带全家福！某凡、某X国全图爆发，沉寂三年的魔兽hke脚本再次风行，某游戏来了，正统传承！发现外挂奖20万！QQ相关贴吧沦陷，网上少了很多帖子。不能少了琳琅天上。\n2012，我用了微信，我禁止它读取我电话本，可它读了还提示我加谁谁谁。同租的室友秒传了自己熬夜做出来的5M的PPT，给我说腾讯做得多牛X，可怜上行带宽才200K。某游戏发现外挂了，无CD，碉堡了，20万？什么20万。琳琅天上。\n2013，教父说，今年微信分成100亿，可惜未实现，微信开发倒是让一些人蛋疼着。旗下每经、和讯秀了几次下限。我又用了ProcessMonitor。\n2014，XXX说，今年微信分成30亿，未实现。我又用次了ProcessMonitor。微信视频服务器泄露视频。看了几个毒奶粉的玩家社区，毒奶粉运营团队坚持本色，毒奶粉帐号在不经过我密保手机的情况下被盗号者绑定QQ手机令牌。\n2015，希望腾讯……还是算了。\n\n凌乱了点。\n腾讯的软件基本都用过。\n开发过微信、腾讯微博、QQ空间的东西。\n玩过腾讯的部分游戏，腾讯代理的游戏呆过外服一些时间。\n跟水军对骂过，当过50QB的版主。\n用傻瓜软件检测过QQ扫描。\n泡过相当长时间的游戏论坛。\n\n以一个普通人的角度，我觉得我看到了腾讯展示出来的所有的面。\n腾讯的软件基本都不错，都在平均水准以上。\n但是游戏呢？媒体呢？广告呢？数据分析呢？\n再者，游戏是企业的，技术是企业的，服务是企业的，可是我自己的人际关系，是我自己的啊！\n\n\n个人觉得腾讯就是一个标准的商人，选择利润最大的选项，道德法律都参与计算。\n腾讯从未在乎过用户，只取最大收益。\n不追求改变，不追求美好，也不用追求极致，更不用去贡献。\n\n任你怎么说，腾讯无所谓，只要你一直用它，它保持无可替代就好。\n保持无可替代有两种方法，一种是持续努力远远甩开对手，一种是扼杀萌芽乃至未萌芽的对手。\n腾讯，两手抓两手硬。\n\n------------------------------------------------------------------------------\n这就是个烂回答。",
				"added": 1520611450
			}
		],
		"1520611501_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 20,
				"body": "觉得企业文化，就是思考和处理问题的首要标准。如果大家遇到事，首先想“老板怎么想”，那就是老板文化；首先想“客户怎么想”，那就是客户文化；首先想“对\n质量有什么影响”，那就是质量文化；如果想“怎么省事”，那就是偷懒文化；如果想“如何推脱责任”，那就是推卸文化呗。\n\n大多数公司，其实是偷懒类型的文化...\n\n至于公司的口号和标语...呵呵呵...重要的是观其行，标语之类常常是反着的。\n\n=====倒追关系学电子书免费下载=====\n\n* 情场：《单身女人，让男神倒追你》：关注公众号“倒追学堂\"获取\n\n* 职场：《求职者，让雇主倒追你》：关注公众号”让雇主倒追你“获取\n\n* 商场：《销售员，让客户倒追你》：关注公众号”让客户倒追你“获取",
				"added": 1520611493
			}
		],
		"1520611554_1LFPbviJPKwMp6qWwQMdbHdgJ7VHsx3Fpd": [
			{
				"comment_id": 21,
				"body": "我这个人一直以运气不好著称，从小到大吃饺子都吃不到硬币的那种人。\n\n去年失业失恋被骗进传销，人生简直凄凉。\n\n换了一家公司之后，我突然意识到，原来还tm有这种上班方式，上下班不打卡，不用再压制自己天马行空的想象力，每天刷微博刷段子看实事畅所欲言，中午午休大家围一圈打游戏或者下楼撸狗，少了很多站队和内斗，有事当面吵，吵完拉鸡巴倒继续干活。\n\n年会那天，100个人抽奖抽到二等了还没我，我基本已经陷入了绝望。\n\n一等奖是一台苹果笔记本，一个公司的销售小哥作为嘉宾上台抽奖，结果一把抽到了自己，小哥说，这奖我不要了，我要发个100块钱的红包，发十个人，谁抢的最少就给谁。\n\n于是我充分发挥了我的衰气，100块钱就抢了两块，一脸懵逼地赢了一台笔记本电脑。\n\n那是我来公司的第十天，我站在台上说中奖感言的时候，主持人问我，是不是有种明天就辞职的冲动。\n\n同事们让我讲讲以前的经历，我说我刚从传销跑出来，\n\nCEO在台下笑着看我说，其实我们也是。\n\n全场一阵爆笑。\n\n\n也可能是我容易知足，反正我觉得，好有趣啊。",
				"added": 1520611544
			}
		],
		"1520522872_19tgFrziAjprxcj5q4voqtnHVnt5kc1yG6": [
			{
				"comment_id": 22,
				"body": "赞",
				"added": 1520611579
			}
		],
		"1520439076_15Z5tW6xktzXnsa8nKRZM7QaW9XbeRBuYi": [
			{
				"comment_id": 23,
				"body": "光头",
				"added": 1520611607
			}
		],
		"1520343274_1H21qd6fqvcR2aspXZhvxs45mMahneH2E8": [
			{
				"comment_id": 24,
				"body": "对",
				"added": 1520611634
			}
		],
		"1520439133_15Z5tW6xktzXnsa8nKRZM7QaW9XbeRBuYi": [
			{
				"comment_id": 25,
				"body": "一起吃早餐",
				"added": 1520611666
			}
		],
		"1519030886_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 26,
				"body": "> [fudingyu](#comment_3_19GRAaLSeEgXthxYKSpGAe3BjZc2LXNWZJ): 你可以打开第二个吗？\n\n我也打不开第二个",
				"added": 1520611709
			}
		],
		"1520434354_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 27,
				"body": "可以集成到论坛中噻",
				"added": 1520611730
			}
		],
		"1521008095_1DkFKuzDHS3VdCsZTT7fm4F9knRmWnR91U": [
			{
				"comment_id": 28,
				"body": "> [hggd](#comment_2_13H9eyCxTHQEtY1Jsq2nVyFLghqGcJSmGM): 帮新网站做种需要有公网IP吧？\n\n并不需要的，这个脚本只是帮助实现自动点击功能而已。你也可以点击那些提交这个网站的新网站，从而人为给他们做种。",
				"added": 1521042365
			}
		],
		"1520477910_15Z5tW6xktzXnsa8nKRZM7QaW9XbeRBuYi": [
			{
				"comment_id": 29,
				"body": "[Gif Time](http://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/) 里面的NSFW就不错！",
				"added": 1521042468
			}
		],
		"1518658340_1Ddehzu7BzcL9bKYbNQX8TPcFqZHiid9GH": [
			{
				"comment_id": 30,
				"body": "你要干嘛，要犯法吗！\n零网的网站都是js代码的，你关闭时就不会执行了。\n且可以看到源码的，只有你不去下载一下exe文件到本地并允许它(比如一些网站，叫你下载这个exe文件去运行)，就没有问题。",
				"added": 1521042740
			}
		],
		"1517737654_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 31,
				"body": "零网使用了bittorrent的下载协议，将网页文件下载到本地，然后又在本地创建一个网络服务器从而打开网页，实现里面的js动态效果。",
				"added": 1521042887
			}
		],
		"1521189467_1DkFKuzDHS3VdCsZTT7fm4F9knRmWnR91U": [
			{
				"comment_id": 32,
				"body": "很简单，\n1.找到zeronet目录下的core文件夹----src文件夹---Config.py文件，\n2.用notepad++或者其他文本工具打开这个Config.py文件，\n3.找到这条语句`self.parser.add_argument('--homepage', help='Web interface Homepage', default='1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D', metavar='address')`, \n4.将里面的 `1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D`替换成你的网站就行了，\n\n这样每次登陆就会自动打开你的网站，并且点击0就会转到你的网站。",
				"added": 1521204431
			}
		]
	},
	"comment_vote": {
		"12_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1
	}
}