{
	"posts": [
		{
			"id": "037e0392-9fa3-4aaa-ac54-27c96ac15b78",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "2bf52b6a-87aa-41fa-b05f-ec01d65f8bc3",
			"body": "fuck you op im a muslim dont hate me for no reason",
			"time": 1570644558736,
			"files": "[]"
		},
		{
			"id": "0ce19c3e-6ba3-42b2-b832-e90f0b3251d3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "2bf52b6a-87aa-41fa-b05f-ec01d65f8bc3",
			"body": ">>a9e30db6-a169-4cb6-b496-b4f2ed9b327f\nsikhs have the turban, and big beard along with long hair. they arent  muslims, quite the opposite they were at war with the muslims for hundreds of years. \nalso my dude dont assume every single shitskin u see is a muslim, there may be alot of degenerate low iq genetic failures aboard this little ship called europe but that doesnt make them muslim.\nIts the same as me classifying a faggot the same as you cause  \"muh skin color\"",
			"time": 1570644680211,
			"files": "[]"
		},
		{
			"id": "c8a2ff38-0a18-4d78-9d2a-9d7b47a8b32a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "0ed30a81-85a1-4ce8-b5c4-de4457795aaa",
			"body": ">>0ed30a81-85a1-4ce8-b5c4-de4457795aaa\ncp is soft stuff, get him some hardcore gore, like the dude that got his balls knawed off",
			"time": 1570644760511,
			"files": "[]"
		},
		{
			"id": "d026c01f-a849-4dfd-9473-870f5397fb7c",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "05ff81c4-c907-45ee-86d2-660acf0d93ae",
			"body": ">>208a374a-9ad8-4d55-96c2-fd7b448b4618\nhttps://cpu.userbenchmark.com/Compare/Intel-Core-i7-9750H-vs-Intel-Core-i7-4940MX/m766364vsm9756\n\nthinkpad fags btfo by GAYMEN laptop",
			"time": 1570645187440,
			"files": "[]"
		},
		{
			"id": "d6365850-e584-4a04-bc02-03908019fe40",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "k",
			"thread": "a816fffd-be30-43cf-ac78-60945705a6ba",
			"body": ">>a816fffd-be30-43cf-ac78-60945705a6ba\nSince im ur yurop i wouldnt have guns, but i would have a whole arsenal full of knives, improvised weapons and actual tools combined to a weapon.\n\nSince i live dead middle of the town, i would harvest whatever power i can for phone, laptop ect. and shut down the electricity.\nOnce i feel  like im stocked up on food, and water i would grab my bicycle and follow a specific route i always follow, kind of a path no one goes to and then try to get a car or vehicle of some kind, for bartering i would use just money for the first week, then food and water. \n\nBest areas would be ofcourse far away from people, but the thing is people are gonna think the same. so you dont want 50 people holed up in one farmhouse, i'd find some serious firepower from my city gun range. break in and steal them, stab anything in my path. (gonna be hard since 100 other people would think the same)\n\nIf i somehow pull that off, i would fight my way out of the city dead in the night and travel as far as possible from western civilization. i would find a car (plenty to go around) and ride my way to eastern europe and leave the west. \nsounds super simple but ofc we all know id probably die in the first hour or so being shot by some random police guy wanting to go  bill williamson mode",
			"time": 1570648182900,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}