{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 1,
				"body": "All censorship is bad. It is always a backdoor that leads to further and further censorship until everything is a complete shithole just like the clearnet. Look at the clearnet these days. It's completely and totally disgusting. There is zero difference of opinion. I dislike spam and all, but it will always be taken over and used by others for nefarious purposes. \"Safety\" is an illusion and \"usability\" is a buzzword.",
				"added": 1597873358
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 2,
				"body": "The best way to post on cuckchan is to commit suicide immediately.",
				"added": 1597873432
			}
		],
		"1597577135_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 3,
				"body": "It would be a real shame if the goyim started just using whatever fucking currency they want.",
				"added": 1597873542
			}
		],
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 4,
				"body": ">putting it on jewtube\nImagine being this retarded.",
				"added": 1597873577
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 5,
				"body": "Oy gevalt, those hatechannahs are annuda shoah. I hope the filthy goyi--I mean, Fellow Users of this site, don't actually learn anything important or get redpilled on NatSoc ideology. I mean, it's just muh hate and muh extremism, and that's why it needs to be banned. What?",
				"added": 1597874276
			}
		],
		"1595502249_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": [
			{
				"comment_id": 6,
				"body": "> [zeronetbackups](#comment_6_1NnNkUjvgoqCmr2mFkUx8HWJ28Nx1CYP3E): It's a clown world, brother. Just enjoy the ride as this sick world collapses from the weight of all of this jewish bullshit.\nYup, it's the filthy chosenite scum behind it all. Imagine wanting a rottenchild bank to take over your country like literally every country except North Korea now.\n\n> [xcape2net](#comment_770_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Just for he fun of it, I'll take a stab at responding. [...]\nImagine missing the point of politicized redpills. No one from the danknet will ever make a statement or ask a question without there being a greater reason for it unless they are dumb unwashed cuckchanner filth. Speaking of which, you sound utterly brainwashed to perfection. There isn't even such a thing as \"gender,\" holy fuck, my dude.\n\nThe answer to OP is obviously to quote Anita I-Hate-My-Own-Nationality-Keesian: everything is rayciss, everything is sexiss, etc. That is why I sincerely believe that all governments worldwide should be replaced exclusively by shitposters who broke the law between the year 2000 and 2004. Also, lots of zyklon canisters. Because reasons. XD",
				"added": 1597874749
			}
		],
		"1595296311_14JNJcjJNfFc78fvfB4D3HExPZqDBnd7hj": [
			{
				"comment_id": 7,
				"body": "Based anons doing the work of the Gods.\nodinia.org",
				"added": 1597874813
			}
		],
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 8,
				"body": "weimerica is cancer now. It's the polar opposite of what it was when White men Founded it. But yes, I was born here.",
				"added": 1597875083
			}
		],
		"1594305760_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 9,
				"body": "Imagine being so bluepilled that you don't know about the Caucasian mummies from the people the Asians killed here thousands of years ago. Not that I mind that the legal agreements from the US are being honored--they should be. The problem is that every other race of people can be \"native\" and Whites are denied any equal rights to a home. Every group of people should be able to have a home.",
				"added": 1597875221
			},
			{
				"comment_id": 10,
				"body": "Also, I forgot the other bluepill shit. There is no such thing as a \"human\" and there is no common origin for the separate races. They look like different monkeys for fuck's sake.",
				"added": 1597875333
			}
		]
	},
	"comment_vote": {
		"6_1NnNkUjvgoqCmr2mFkUx8HWJ28Nx1CYP3E": 1
	}
}