{
	"next_topic_id": 15,
	"topic": [
		{
			"topic_id": 1577564971,
			"title": "Anyone having troube when trying to post on Nanochan?",
			"body": "Post seems to go through but then it doesn't appear in the thread.",
			"added": 1577564970
		},
		{
			"topic_id": 1577612746,
			"title": "If you only could visit one site for the following year, which one would it be?",
			"body": "So?",
			"added": 1577612744
		},
		{
			"topic_id": 1577724157,
			"title": "What is the estrogenic activity of shampoo?",
			"body": "Are we being secretly poisoned by the washing jew?",
			"added": 1577724154
		},
		{
			"topic_id": 1577756928,
			"title": "I'll just say the word",
			"body": "Su-Sussudio",
			"added": 1577756924
		},
		{
			"topic_id": 1577759606,
			"title": "She's an easy lover",
			"body": "Yes she is",
			"added": 1577759601
		},
		{
			"topic_id": 1577943220,
			"title": "Anyone else just jerk off to unwind?",
			"body": "Was all day with family, stressed up and hating it.\nThen slept for 2 hours, jerked off two times (first one just to thought and second one looking at pics of cuties), eat some tasty food and now I'm just as happy as I can be. Anyone else?",
			"added": 1577943214
		},
		{
			"topic_id": 1578007868,
			"title": "Neighbor put a security camera directly overwatching my backyard",
			"body": "Who's in the wrong here? Don't get me wrong, I'm not involved in anything shady, but you know... If somebody breaks in and I have to kill him I'd rather throw his body somewhere than have to face \"\"\"justice\"\"\" and probably go to jail for 20 years because I didn't wait for him to get inside my house or he only had a knife or whatever bullshit. Same for hiding stuff by burying it in my backyard, I'd rather have the option to do that...\nMaybe should use a pellet gun to take that fucker out when the power goes down?",
			"added": 1578007861
		},
		{
			"topic_id": 1578135775,
			"title": "The final redpill about software",
			"body": "Computer software should be kept as static as possible, both upstream and on your own computer. Changing things should only be the last resort, for instance to patch security holes, or if the old hardware becomes unattainable. Otherwise you should spend as much time as possible to familiarize yourself with the software and patch/work around bugs as needed to keep the system in working order.",
			"added": 1578135767
		},
		{
			"topic_id": 1578136139,
			"title": "What's your favorite 8-bit or 16-bit song?",
			"body": "For me it's this one right now\nhttps://www.youtube.com/watch?v=9ajqzYCyO2A",
			"added": 1578136130
		},
		{
			"topic_id": 1578267669,
			"title": "Why isn't Millchan Merger working for me?",
			"body": "It just shows the title but besides that it's just an empty page.",
			"added": 1578267659
		},
		{
			"topic_id": 1578303373,
			"title": "Give me some good sites without lamers",
			"body": "I'm not one myself I promise.",
			"added": 1578303362
		},
		{
			"topic_id": 1578471150,
			"title": "She's an easy lover",
			"body": "She'll get a hold of you, believe it",
			"added": 1578471138
		},
		{
			"topic_id": 1578519864,
			"title": "Paul Krugman tweets to the world his IP was used to upload kiddie porn",
			"body": "https://twitter.com/paulkrugman/status/1214991222009409536\nWhat the fuck was the boomer thinking?",
			"added": 1578519851
		},
		{
			"topic_id": 1578569304,
			"title": "Usenet",
			"body": "ᐳtfw your friends don't agree to message you on alt.cyberpunk with encrypted PGP messages using your public key\nWhy even live bros?",
			"added": 1578569290
		}
	],
	"topic_vote": {},
	"next_comment_id": 68,
	"comment": {
		"1577565290_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 1,
				"body": "Nice, I'll be right off to ebay to buy that one 1000 dollar phone from 2005 that's (barely) compatible with this thing.",
				"added": 1577565802
			}
		],
		"1577564971_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 2,
				"body": "Can I bump my own posts?",
				"added": 1577570896
			}
		],
		"1577612746_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 3,
				"body": "> [anaeru](#comment_3_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH): 127.0.0.1.\n\nsite doesn't equal domain",
				"added": 1577613705
			},
			{
				"comment_id": 4,
				"body": "> [anshorei](#comment_71_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): localhost [...]\n\nYou can but only a single site on localhost, unless they don't use networking and are 100% local, in which case they don't count as sites. So, if you set up ZeroNet you can only access, say, ZeroTalk but not any other site on ZeroNet. And for example you can't access ZeroTalk on one port and Freenet on the other.\n\n> [maho911](#comment_22_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3): After thinking about this for a while, it seems the best choice (after http://127.0.0.1:43110 and webproxy gateways) is actually some giant forum system [...]\nGood luck trying to get random people on the Internet to do weird complicated stuff for you like downloading and encoding random programs/books/movies as JPG and uploading them.",
				"added": 1577649531
			},
			{
				"comment_id": 6,
				"body": "> [xane](#comment_16_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7): If you're going to put random arbitrary restrictions on people's answers, you should have said so in the OP.\n\nNewsflash, everyone. Youtube and Wikipedia are the same site now because I installed a proxy on my machine that allows me to access both on http://127.0.0.1",
				"added": 1577654356
			},
			{
				"comment_id": 7,
				"body": "> [xane](#comment_17_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7): I'm talking about zeronet and the zites on it, idiot. Proxies aren't sites.\n\nWow, cool it down with the insults, bro.\nI'm talking about ZeroNet sites too. You can choose a ZeroNet site but only one. It doesn't matter that all of them are on the same domain (localhost). Got it?",
				"added": 1577681088
			}
		],
		"1577574820_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "> [quantumkitty](#comment_275_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I had to delete the original Mosque shooting video due to the fact that possession of it will instantly give you prison time if caught, and I live in New Zealand. I'd rather get done for copyright infringement than sharing some edgy murderer's ego trip anyway.\n\nThat's why you remain as anonymous as possible and use Tor. What's the point of linking everything to the same identity? Ego? If things you make are interesting enough people will find them individually.",
				"added": 1577649917
			}
		],
		"1569767202_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": ">I'm going to unfollow this thread, because I know a shitstorm will follow.\nWhy do you care to send a message to anonymous people on the Internet if you won't even read the response?\nIf you think our opinions on the whole aren't even worth reading then go post yours somewhere else, bro.\n>This is where I think natural selection is better than harming possibly all of today's generation of infants and children. Harming a whole group of the population to save a few lives is nonsensical to me.\nIt's a complex issue. We've been exposed to mosquitoes for thousands of years and still get pathogens, which suggests the rate of adaptiation with respect to that threat has slowed down or reached a plateau.  On the other hand, we've never been exposed to pyrethrins, so we might evolve to it fast and become immune to its effects (but unfortunately so might mosquitoes).\nFrom an utilitarian point of view, it might be worth it to cause some small harm to everyone to prevent a big harm to a few. It depends on the number and how bad you consider the harms.\nOverall I think it probably shouldn't be done.",
				"added": 1577724967
			}
		],
		"1577617777_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": [
			{
				"comment_id": 9,
				"body": "> [anonymouslogin](#comment_176_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Education should start early, over 50% of the children born in the US are unplanned...but I digress. This thread is all about crypto! Yay P2P transactions. Use a fungible cryptocurrency and smile as you pass by the centralized banks.\n\nYes, I agree. Children should be sent to school early on. Their parent's beliefs shouldn't be the main influence on their development and ideology.",
				"added": 1577725125
			},
			{
				"comment_id": 22,
				"body": "> [draugrdeathlord](#comment_96_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): there's only two sexes/genders\n\nbased",
				"added": 1577756262
			},
			{
				"comment_id": 33,
				"body": "> [anonymouslogin](#comment_178_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Not only are there more than two sexes, there have been various genders in any number of cultures through the entire written history of humanity and likely before. Often these multi-faceted people were elevated in social positions, sometimes perceived as gods.Evolution and mutation, or experimentation as you call it does produce culls, it also refines the surviving population and bolsters the reproductive and survival fitness of the organism. I agree that intelligence is not the defining factor for an evolutionary vector, fitness however is. Ants are incredibly diverse and versatile, literally products of evolutionary forces acting in a short time frame, but if you really want to be impressed take a look at the world of bacteria. Exponential growth rates, and natural selection happening before your eyes. Put a culture in an antibiotic, inside of a few hours depending on temperature, you will have a population resistant to the antibiotic. Homo sapiens sapiens is traveling the same curve over a much longer time frame. To the topic, financial markets are no different, and regulation by governments is not going to be effective at stemming the free communication between individuals the internet has brought us, ushering in a new era of bartering, and the storage and transfer of value at the individual level that cashless transactions will bring through this network. If you have ever tried to resist a government, then you know the first thing they do is go after your bank account. The centralized banks are the pawns in this fight for governance, and they are handsomely compensated for their services by the ruling elite. My humble opinions...\n\nkys trannie\ntldr didn't read btw",
				"added": 1578001885
			}
		],
		"1576403647_1NuYeSsttVbZHrWGpWVauTz25DikWyjWwr": [
			{
				"comment_id": 10,
				"body": "ZeroNet based Libgen backup when?",
				"added": 1577731409
			},
			{
				"comment_id": 16,
				"body": "> [randomshits](#comment_357_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): It would likely need to be based on some kind of merger site to portion out the documents as the latest TF article about it mentioned the total site was around 100TB. [...]\n\nYeah I was just joking. There already are Libgen torrents, no reason to duplicate everything. Maybe at most it could be some kind of proxy and then the files could be cached as optional files when they're delivered to the users.",
				"added": 1577733749
			}
		],
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "The day you'll get rid of \"bigotry\" will be when\n1. You somehow make people stop noticing correlations\n2. You scare people into not talking about these correlations with others\n3. You have genetic engineering or a super strict society to prevent those behaviors from developing",
				"added": 1577731909
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_1528_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Sure thing, bub. I'm a pro troll wrestler.\n\nDo you seriously believe \"bigots\" are just trolling and don't actually believe what they preach?",
				"added": 1577732123
			},
			{
				"comment_id": 13,
				"body": "> [styromaniac](#comment_1530_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Someone said they would troll. I responded to that. But, they do harass people here.\n\nI'm annoyed by the schizoposters and retards who show up anywhere that has lax moderation, but claiming to be harassed is going a little bit too far. Especially when you can just mute them.",
				"added": 1577732622
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_1531_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's still harassment. The ability to mute is nice though.\n\nProve it.",
				"added": 1577733039
			},
			{
				"comment_id": 15,
				"body": "> [randomshits](#comment_358_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): That's because imagine a troll waking up in the morning, cranking up their daily clearnet, only to visit their usual forum to discover that their online identity has been added to some network wide blocklist that auto hides their comments from potentially everyone. [...]\n\nI mean... If you used Reddit in the first place you kinda deserve it.",
				"added": 1577733351
			},
			{
				"comment_id": 17,
				"body": "> [randomshits](#comment_368_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Capitalism in a nutshell\n\nYou think Cuba, North Korea and the USSR back in the day don't have central banks?",
				"added": 1577750803
			},
			{
				"comment_id": 18,
				"body": "> [draugrdeathlord](#comment_89_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): The fed which is not federal is a private bank that enslaves the entire country with usury\n\nIt's a mix of public and private entities. But that doesn't matter. Completely public central banks in other countries work in exactly the same way the Fed does.",
				"added": 1577750905
			},
			{
				"comment_id": 20,
				"body": "> [duck0](#comment_167_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Lame b8 m8\n\nbased",
				"added": 1577756194
			},
			{
				"comment_id": 24,
				"body": "> [xane](#comment_19_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7): Then why did you reply? [...]\n\ncringe and bluepilled",
				"added": 1577759932
			},
			{
				"comment_id": 29,
				"body": "> [frosthammer](#comment_17_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC): muh fee fees\nJesus Christ calm your tits you fucking bitch.",
				"added": 1577941072
			}
		],
		"1576215313_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 19,
				"body": "ITT: OP tries talking to a cutie and spergs out",
				"added": 1577751104
			},
			{
				"comment_id": 21,
				"body": "> [frosthammer](#comment_9_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC): Morrakiu vs Hershel\n\nwat",
				"added": 1577756233
			}
		],
		"1577754529_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 23,
				"body": "ᐳbabby's first philosophy course",
				"added": 1577757017
			}
		],
		"1577775629_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 25,
				"body": "> [draugrdeathlord](#comment_123_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): the boot strapper is the main thing you should enable under plugins, it helps your client provide tracking n stuff.\n\nCan you explain exactly how it works? I'm afraid to enable something if I don't know what it is or what it does.",
				"added": 1577820623
			},
			{
				"comment_id": 26,
				"body": "> [draugrdeathlord](#comment_124_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): A torrent tracker takes announcement from peers when they want to find something from other peers. The tracker responds with a list of seeds that seeders told the tracker they are seeding. [...]\n\nThen why is it disabled by default?",
				"added": 1577832000
			}
		],
		"1577790149_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 27,
				"body": "same",
				"added": 1577857886
			}
		],
		"1577916638_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 28,
				"body": "> [edgelordofdecent](#comment_374_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): It's impossible to become that rich in a free society.\n\nThey don't have to. They already are rich. Get a video from Bob Murphy saying in his ideal society the money from the Rothschilds would be confiscated and I might just become a libertardian.",
				"added": 1577940527
			}
		],
		"1577943090_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 30,
				"body": "kill yourself lol\nmuted",
				"added": 1577943264
			},
			{
				"comment_id": 31,
				"body": "> [thetruth](#comment_40_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): one of the \"EXPOSED\" !\n\nyes I'm Illuminati mind control now what are you going to do about it bitch boi?",
				"added": 1577943445
			},
			{
				"comment_id": 38,
				"body": "> [randomshits](#comment_386_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Nope, that's the whole purpose of a darknetThe creation of sites are undocumented and random guessing them is practically impossible. [...]\n\nDon't spread misinformation. Tracker operators can know when every site is created unless you only access them with clients having custom trackers configured.",
				"added": 1578108492
			}
		],
		"1578001269_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 32,
				"body": "I'm pretty sure nobody has tested it so far.",
				"added": 1578001735
			},
			{
				"comment_id": 34,
				"body": "> [anshorei](#comment_74_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Corrupted downloads should not be a problem, ZeroNet verifies the hashes of file(part)s it receives from peers. So both inbound and outbound data will be trashed and redownloaded until the verification succeeds. [...]\n\nOne thing is theory and another one is practice. If the blocks always get corrupted before they have been completed you'll never finish downloading anything...",
				"added": 1578008036
			}
		],
		"1578007868_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 35,
				"body": "> [draugrdeathlord](#comment_163_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Point a microwave gun at it from outside it's field of view, the smoke that will bellow out of it will be a nice bonus. [...]\n\nIt's quite far from me, I doubt I can get enough EIRP to make any kind of damage. Plus it would be impossible to verify if I did manage to damage it at all. There are videos of people pointing the waveguide from oven magnetrons to the camera, it does distort the picture in a very peculiar way but doesn't cause damage unless you put it inside a closed cavity (such as inside the oven cavity itself and close the door).\n\n> [fke13](#comment_103_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): You may try to use paint bullets. The rest of Your argumentation is nonsense, but a paint ball bullet WITHOUT HURTING OR BREAKING ANYTHING is quite a nice response, provided that You do not \"get caught on camera\" doing it. So choose Your angle and do not walk with the paint bullet gun in front of the camera. Or better yet, use a self-made sling-shot to throw some ordinary children's paint at it. Another option is to use an ordinary laser pointer and place it firmly pointing directly to the camera. Test the pointer with Your cellphone camera first. The laser option is best, because it does not leave any traces for the Police to accuse You of and You may say that You were just working on a light show and all Your neighbor's talk is \"without any sound argumentation about Your wrongdoings\".\n\nThe light show argument won't fly with the police when the beam was obviously aimed towards the camera and nobody saw or heard people partying at my place, it's much easier to see a laser than a pellet gun projectile, and I wouldn't know how much damage I inflicted, if any.\nA paintball might work until they clean it up or finally get the message and take out/move the camera, but they're much less accurate than pellet guns so I'd have to get many more shots if I even manage to hit it at all, raising the chances of a neighbor seeing me, and they're much less common than pellet guns, raising the incrimination factor if they did raid my house and found it in my possession.",
				"added": 1578011829
			},
			{
				"comment_id": 36,
				"body": "> [fke13](#comment_105_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): It was NOT meant to inflict any damage to the camera, just render it useless by blinding it.\nSo I can get the cops at my door for absolutely no benefit? Wtf man.\n>It won't give perfect privacy, the images might be still processed to see the rest, but it certainly ruins the easy use of the footage.\nI guess. But at that point I'd put some shit over the walls so they can't see. Thing is I liked the view on that side of the backyard but you gotta do what you gotta do. And also the light thing would only work at night.\n>Besides, may be the camera is not even meant to film Your yard, it just accidentally films Your yard and they actually care only about their yard.\nSure. It's not them I'm concerned about. It's me getting in trouble with the cops and they requesting the footage from the neighbors to see stuff they might need to convict me. And also just the picture being sent to The Cloud and being seen by God knows who.\n>You also have an option to place 2 cameras looking at their yard and at some point they might want to remove their camera as an exchange move.\nThe problem is the property in the back is a farm, so they wouldn't give a shit if I put cameras overwatching them. As this is a residential area I think they're not supposed to raise animals here, but I don't want to snitch on them and bring attention to myself.\n>Have You discussed an option that they just self place a blinder in front of the camera so that only their own yard is visible? May be they'll even show You the image of the camera so that You can verify that at least temporarily the blinder works?\nI doubt that would work. And it would incriminate me if I later decide to disable the cameras.\n\n> [mg0](#comment_209_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I think you should get a big and aggressive breed of dog to guard your backyard, I'm not sure about the implications of it with law but a dog attacking an stranger that trespasses into your backyard sounds correct enough for me, shed some light on this please; you could have your own set of security cameras too, so you could record the way your domain is intruded and the way the intruder behaved that forced you shove lead down its throat (joking).\n\nMeh. I don't want to take care of a dog. And it doesn't remove the main concern, which is I don't want them to fucking record everything that goes on in my backyard. But yeah, I guess putting a nylon cover over the wall would be the only real option, even though I'd lose the only decent view I had.",
				"added": 1578015245
			},
			{
				"comment_id": 37,
				"body": "> [aspidochelone](#comment_303_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): @thetruth:  Bedroom monitored is called \"5G\".  The system is based on an _array of near-terahertz spy beams that pass through some objects and not others, so they're like X-rays.  Watch what positions people are screwing in, sure, but I'd bet money the spies already check the \"quality\" of the signal for vibrations, i.e. bug the room with it. [...]\n\nListening to vibrations might be theoretically possible even if very hard in practice.\nBut I think what you said is not possible. Different genes in the DNA wouldn't be enough to significantly change the resonant properties of the macromolecule.",
				"added": 1578107610
			},
			{
				"comment_id": 39,
				"body": "> [thetruth](#comment_48_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): This is a non-relevant thread (solution offered many times) being pushed by the gatekeepers/ controllers to its irrelevancy to disguise the relevant one (see the patterns?)\n\ntake your fucking meds\n\n> [1bfqutudhtexlka](#comment_143_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): why he is doing that , there must be a reason right ?\n\nI guess he's paranoid of people climbing over my fence to steal his animals. But now that he put it up there adding barbed wire won't make him take it out. And there are more cameras watching in other directions, so he'd probably want to watch that side of the field even if I had barbed wire.",
				"added": 1578135422
			},
			{
				"comment_id": 40,
				"body": "> [thetruth](#comment_48_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): This is a non-relevant thread (solution offered many times) being pushed by the gatekeepers/ controllers to its irrelevancy to disguise the relevant one (see the patterns?)\n\nmuted btw",
				"added": 1578135445
			}
		],
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 41,
				"body": "How about you stop being a faggot and refuse to let your parents tell you what to do?",
				"added": 1578135921
			}
		],
		"1578091204_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 42,
				"body": "> [xcape2net](#comment_645_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): ZeroTalk Tech works with \"zeroid.bit\", \"kxoid.bit\", \"08chan\", \"cryptoid.bit\", \"kaffie.bit\", \"zeroverse.bit\", and \"zv.znonymous\".  It won't work with any others.  Is KaffieID the same as kaffie.bit?  I tried to make ZeroTalk Tech work with \"millchan\", but that broke the whole zite for a few days before I noticed.  I have no idea if each of the ones I'm currently using is functional.  All I can say is that I haven't noticed any of them breaking the zite the way millchan did.\n\nYou're doing it wrong. Dunno about the others but 08chan is not a CA, so allowing it is useless. What you probably want is to enable is self-signed certificates.",
				"added": 1578136288
			},
			{
				"comment_id": 44,
				"body": "> [xcape2net](#comment_647_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): How do I enable a self-signed certificate?\n\nI don't remember. I think you need to add your own domain to the list of allowed CAs and possibly something else. Check out how Millchan does it in their own content.json.",
				"added": 1578191304
			}
		],
		"1578136145_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": [
			{
				"comment_id": 43,
				"body": "Your post is pretty confusing.",
				"added": 1578136409
			}
		],
		"1578266563_1EUN1RsCa7xATMJ76ecNX93ebVvxGY7sDz": [
			{
				"comment_id": 45,
				"body": "based pedo porn publisher",
				"added": 1578267578
			}
		],
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": [
			{
				"comment_id": 46,
				"body": "> [presstodigitate](#comment_3_1EUN1RsCa7xATMJ76ecNX93ebVvxGY7sDz): @quantumkitty  I agree, that's the first thing we're going to fix.\n\nlol\nare you the nigger who was LARPing as a rich businessman on here a couple months ago? or just a random pajeet trying to scam some retards?",
				"added": 1578272388
			}
		],
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 47,
				"body": "> [realiodine](#comment_10_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG): you fool. Now they are playing five-dimensional chess /s\n\nKeep that /s shit on reddit please.",
				"added": 1578275611
			}
		],
		"1578276840_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 48,
				"body": "what are you even talking about you stupid nigger",
				"added": 1578277108
			}
		],
		"1566600878_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 49,
				"body": "Agreed.",
				"added": 1578301403
			},
			{
				"comment_id": 50,
				"body": "> [funman](#comment_2_12nYWrJ4WfemBx1sC1w3wTUJsX7iSkTv4c): freenet is very good - bit slower than zero, but a totally closed system.  Lots of good people there, good discussion on FMS and Sone if you want to look it up     https://freenetproject.org\n\nMan, I regret not getting into Freenet back in the day when I was younger and had more patience for this stuff and it actually was cutting edge. Imagine the excitement when the first forum was implemented on it. Well, maybe not so much. After all we didn't really understand the importance of such communication systems, and the emphasis was on anonymity and file sharing rather than community.",
				"added": 1578301997
			}
		],
		"1578341356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 51,
				"body": "> [styromaniac](#comment_1603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): This comes back to a point that you made and it's more relevant here. Start your own site if you know how to moderate it.\n\nHow would others know I knew how to moderate it? How would others trust I couldn't be pressured into moderating it in a way that it shouldn't?\nAt this point you might begin saying \"just start your own decentralized network, bro\".",
				"added": 1578372208
			},
			{
				"comment_id": 53,
				"body": "> [quantumkitty](#comment_361_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): But the fact of the matter is there will always be rules.\nWhy?\n> because it has an overall laidback atmosphere unlike Reddit where everything you say gets caught in some spam filter until the mods approve it.\nOh, is that the reason Reddit sucks? Because you might post something and the mods will have to manually approve it? Nothing to say about the subreddits that get banned because they hurt people's feefees? Sounds like you are a dumb low IQ Reddit user and want to bring its censorship culture everywhere elsewhere.\n>Just that on ZeroNet there will be different rules compared to elsewhere on the web.. but rules nonetheless.\nWhat rules are there on ZeroNet, exactly?\n>If you don't like that there's always other shitholes to pick from.\nSuch as?",
				"added": 1578379489
			},
			{
				"comment_id": 56,
				"body": "> [ranshit](#comment_9_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): After giving a mute to barnstokkr and duck0  for their OT spam, here is my view on the matter. [...]\nIf the owner kept the code for the site encrypted, the site wouldn't work. I'll point out this is the kind of people who is encouraging censorship on a decentralized platform.\n> [styromaniac](#comment_1628_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That doesn't have every CP poster. At some point, an unmoderated site itself has to be blocked for user safety.\n\nUnless by \"moderated\" you mean the messages don't show up until the owner approves them (whitelisting), there's no reason to think site owners will be more vigilant of CP than blacklist providers.  And subscribable whitelists could be implemented in ZeroNet too, there's no inherent advantage to site owners doing the moderating as opposed to your favorite self chosen volunteer list provider.",
				"added": 1578506431
			},
			{
				"comment_id": 57,
				"body": "> [draugrdeathlord](#comment_267_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Is defending CP a hill you want to die on ?\nI don't want to die on any hill, or anywhere else for that matter.\nIf you mean whether I think pedophiles should be able to post their porn on here, then yeah, probably.",
				"added": 1578506684
			},
			{
				"comment_id": 58,
				"body": ">[barnstokkr](#comment_38_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w): [citation needed]\nI wasn't able to find a citation that specifically states what I stated, but you should be able to make the deductive step yourself by reading these referenced quotes:\n\n>A computer program is a collection of instructions that performs a specific task when executed by a computer. Most computer devices require programs to function properly.\nhttps://en.wikipedia.org/wiki/Computer_program\n\n>In cryptography, encryption is the process of encoding a message or information in such a way that only authorized parties can access it and those who are not authorized cannot.\nhttps://en.wikipedia.org/wiki/Encryption\n\nFrom these we know that the computer must be able to access the information (the computer code for the site) for the code (sequence of instructions) to be able to instruct the computer what tasks to perform.\n\nIt's fairly hard to make a computer able to access some piece of information, but not the owner who is in physical possession of such computer. The reason is that encryption is generally achieved using a \"key\":\n\n>In cryptography, a key is a piece of information (a parameter) that determines the functional output of a cryptographic algorithm. For encryption algorithms, a key specifies the transformation of plaintext into ciphertext, and vice versa for decryption algorithms. Keys also specify transformations in other cryptographic algorithms, such as digital signature schemes and message authentication codes.\nhttps://en.wikipedia.org/wiki/Key_(cryptography)\n\nThis key must be stored inside the computer for it to be able to access the encrypted information. If the key is stored inside the computer, then it can be retrieved by the owner of the computer through various means, such as analyzing the data on the computer's hard drive using a \"hex editor\":\n\n>A hex editor (or binary file editor or byte editor) is a computer program that allows for manipulation of the fundamental binary data that constitutes a computer file.\n>With a hex editor, a user can see or edit the raw and exact contents of a file, as opposed to the interpretation of the same content that other, higher level application software may associate with the file format. For example, this could be raw image data, in contrast to the way image editing software would interpret and show the same file.\nhttps://en.wikipedia.org/wiki/Hex_editor\n\nTherefore, long things short, it would be very hard for a site owner to encrypt his site and let the computer access it without the user being able to access it and manipulate it in various ways (including copying it).\n\n>what are you even talking about.\nI'm talking about multiple things.\n\n>Encrypted site content.\nYes, that's one of the things I'm talking about.\n\n>If the zite was encrypted you would not be able to view it in the first place, not even talking about copying it.\nCorrect.\n\n>All code is client side on Zeronet.\nCorrect.\n\n>You can clone anything.\nCorrect.\n\n>Even this zite.\nCorrect.\n\n>The only thing encrypted is the ZeroID signed posts.\nIncorrect. ZeroID signed posts aren't necessarily encrypted, they are authenticated. On the other hand, there are certain things that are almost always encrypted, such as your ZeroMail e-mail.\n\n>The moment you encrypt a zite, no one will be able to view it.\nCorrect.\n\n>If you can view it, you can clone it.\nCorrect.\n\n>Wow the astroturf is laid on thick here.\nI'm not aware of such matters.\n\n>Cope and seethe, you can't censor.\n(And that's a good thing)",
				"added": 1578508703
			},
			{
				"comment_id": 59,
				"body": "> [styromaniac](#comment_1629_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I guess that settles the discussion? We have our differences. If you want any kind of content allowed, then use a site that allows such a thing. Some of us administrators and users do not want the legal trouble.\n\nOk.",
				"added": 1578516901
			},
			{
				"comment_id": 60,
				"body": "> [ranshit](#comment_10_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): I have to disagree, if I develop a platform, it is my choice to release the code obfuscated (which distracts from alterations) or developed with multiple comments in the hopes of assisting alterations.\nYou have the choice to do it, but the choice is morally wrong, because you are denying your users the four software freedoms.\n\n>I do hope you realise that there are aspects of zeronet that are just as obfuscated such as the spam filter used by some board owners & ZeroID\nThat's still problematic, but a different issue, as the code for that functionality isn't running on the user's machine.",
				"added": 1578517078
			},
			{
				"comment_id": 61,
				"body": "> [filips](#comment_406_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): You have the rights to decide if you want to make it possible for others to (easily) view your code.\n\nIf you distribute your software without also distributing the source code, then you are doing them a disservice. The users should have the right to understand and modify the software, and by not providing the source code you are denying them those rights.",
				"added": 1578517242
			},
			{
				"comment_id": 64,
				"body": "> [styromaniac](#comment_1631_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): My last word on this is that Google serves CP as a result of being a search engine for porn. It's a heavy risk without a top notch lawyer.\n\nOnly if you're dumb enough to not use Tor and put your real name next to your username. And even then Tor developers and even nofish seem to do well enough even though their software is used to share CP. And that's why we need ZN sites to stop being sites and just become another piece of software. So the legal system can't pressure developers to censor anything.",
				"added": 1578520939
			}
		],
		"1578353643_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 52,
				"body": "Why don't they have UPS and Diesel generators?",
				"added": 1578372421
			}
		],
		"1578388821_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 54,
				"body": "> [styromaniac](#comment_1618_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You act like boomers are a diseased people. Becoming an old person does not make you a boomer at all.\n\nYou don't spend much time on the Internet, do you?",
				"added": 1578395896
			}
		],
		"1578471150_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 55,
				"body": "test",
				"added": 1578472996
			}
		],
		"1578036046_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 62,
				"body": "> [draugrdeathlord](#comment_271_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Dont just rely on TOR, if the authorities want your head bad enough they already have exposed identities through TOR\nWhat if the authorities don't want your head bad enough?  Then they haven't already exposed identities through Tor?\nThe fact is that, to this day, nobody has publicly been shown to have been arrested because of the government breaking Tor's anonymity, which isn't true for VPNs. I'm sure YOUR snowflake VPN hasn't sent people to jail yet, sure, but it also has been operating for a lot less years than Tor and serving a lot less users, so your sample size just isn't good enough for you to say it's better than using Tor.\nWhat do pedos wanting to share their kiddie porn on the Internet use? What do druggies and the narcs wanting to help them get their fix use? VPNs? No, they use Tor.\n>and there are compromised TOR relays for metadata analysis.\nIf you mean packet timings and outgoing data to the clearnet, sure, which hasn't lead to anyone being publicly de-anonymized.",
				"added": 1578519747
			},
			{
				"comment_id": 63,
				"body": "> [quantumkitty](#comment_384_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Remember also that places like Bitchute don't even allow copyrighted content. Hell even those guys have standards.\n\nYes, Bitchute is gay and fake, who knew.",
				"added": 1578519783
			}
		],
		"1578817237_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 65,
				"body": "How do you know the parasites come from pork and not from food or water contaminated with feces from someone infected by them? (who could've initially gotten it in another country, or from slaughtering and cooking their own animals)",
				"added": 1578831552
			}
		],
		"1578779457_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 66,
				"body": "Stop being an overly emotional person. If you don't want the stuff just sell it to somebody for cheap.\n> [fib](#comment_71_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): Get out while you still can. Rent is a lie and will inevitably lead to more trouble than it's worth. I'm speaking from experience and I can't wait to get out of the landlord business. [...]\nThey're his parents. Even if they are bad people, you should try to help people who are part of your family. The rulers in charge want to remove all bonds and obligations we have with each other so we all have to depend on the state and corporations.",
				"added": 1578832037
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 67,
				"body": "> [fib](#comment_79_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): You could contribute to bicycle surplus in your region and make the world less shitty instead of being racist online. [...]\n\nThis. You're probably a privileged white male and don't see you would've done the same if you were him and was born into this fucked up world where you are considered little more than trash if you aren't born with a particular skin color.\nFellow white people, we need to stop blaming other races for acts that we ourselves have driven them to commit.",
				"added": 1578941028
			}
		]
	},
	"comment_vote": {}
}