{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1565077480_1N86m5tuMjDQoXoocDpPVzY9dcRPC7MnuU": [
			{
				"comment_id": 1,
				"body": "It loads but there's nothing there, just the logo.",
				"added": 1565082885
			},
			{
				"comment_id": 2,
				"body": "> [bornagainst](#comment_4_1N86m5tuMjDQoXoocDpPVzY9dcRPC7MnuU): 8chan is back up if you direct link to it. Posting doesn't work yet, though.  [...]\n\nIt's something, thanks for the tip!",
				"added": 1565083572
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 3,
				"body": "You can expect that and much much more in an open platform like this. Deal with it.\nStupid jew nigger faggot kike.",
				"added": 1565184808
			}
		],
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 4,
				"body": "OY VERY, somebody should report this person!",
				"added": 1565246737
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 5,
				"body": "More like he's been suicided.",
				"added": 1565449644
			}
		],
		"1565689652_1NpBKuyaBfogcHY7Whe1YM59brNqLHmGBn": [
			{
				"comment_id": 6,
				"body": "Jeez, I hope not, I'm here specifically because I want to avoid normies who are \"right in the head\".",
				"added": 1565699894
			}
		],
		"1565770181_1FqEEdpNCYZJfnpyNWJqE4hgXtWNu5vgz5": [
			{
				"comment_id": 7,
				"body": "Never, it's too useful to authorities. They want you to post there so they can collect your IP address. Why do you think they banned most VPNs?\nAnd why do you think they hated 8chan so much? Because the owners are free speech absolutists, collaborated with authorities only when strictly necessary and allowed most VPNs and Torposting. That's a big no-no for glowies.",
				"added": 1565770598
			}
		],
		"1565874585_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 8,
				"body": "They make me feel better in comparison.",
				"added": 1565903602
			}
		],
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 9,
				"body": "Hi Shadman, nice to have you here!",
				"added": 1565914582
			}
		],
		"1565969602_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 10,
				"body": "> [kaffie](#comment_1037_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Unlike capitalism, people within communist societies aren't held at gunpoint and forced to work jobs they don't wish to work. \nYou have it the other way around. \n\nNot saying the Capitalism doesn't have its problems, of course, but under Capitalism at least you can still choose not to work if you don't want to, and, say,  become a bum, a beggar, a busker, a punk-anarchist squatter, a dumpster diver, a \"bohemienne\" or simply decide do go off the grid. In short, you can drop out. Under Communism you were expected to work, you were not allowed to \"drop out\" in any way, including becoming a small-scale farmer providing for your own needs, unless you had some sort of disability. Someone doing so would have been accused of social parasitism and punished severely.\n\nAgain, Capitalism is not perfect, and I definitely expect it to be replaced by something else more in tune with the needs and reality of a 21st century high-tech, highly-connected society, however currently it's the only system that gives people liberty, especially compared to the alternatives.\n\nOh, an by the way, prostitution was widespread in the USSR. Some women will always want to sell their bodies for money, let's deal with it.",
				"added": 1566005224
			},
			{
				"comment_id": 11,
				"body": "> [kaffie](#comment_1039_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Untrue. If you don't work under capitalism, you starve and are homeless. Unless you're saying the US isn't a capitalist country?\nNot necessarily. There's plenty of people who don't work but don't starve and aren't even technically homeless, and I'm not talking about the idle rich or the owning class.\n\n>It's illegal to be homeless.\nI'm not aware of any juridisdiction that considers being homeless illegal. At most you have city ordnances against loitering, vagrancy and the like, but not having a home is not illegal. It would be ridicolous if it were.\n\n>You seem confused. That's capitalism.\nIn America you can do all of the things I've mentioned. In the URSS you couldn't. I'm talking about personal liberty, not freedom from the consequences of your choices. In a capitalist society you're free not to work and suffer the consequences. In a capitalist society I'm free to build a cabin in the woods with some solar panels and survive off the land without participating in the system directly.  That's a choice that a communist society will never offer you. You will be forced to participate in the system, ie. to work. You were not free to become a self-sufficient farmer in the URSS. The only allowed farms were collective, state-owned ones. \nAlso you were not free to pursue your own interests and \"finding yourself\", in general. You were given certain choices, that's it.  As far as I'm concerned, any system that will force me to do anything is trash, regardless of any other consideration. I'd rather starve than being forced to work in a collective farm, and I'd rather live in America where I can at least have the opportunity to find my own path than in a communist country where I'll be given a handful of choices and I find don't like any them to the Gulag I go.\n\n>Women don't \"want\" to sell their bodies, they do it to survive under oppressive capitalist regimes. \nThat's absolutely false. In the URSS they sold their bodies to have more than the State allowed them to have, or to rise through the ranks of the party, directly or indirectly through association with a powerful figure. Something that women do, have always done and will always do in every system and every circumstance, from prehistoric times to the coming cyberpunk hyperconnected future 3.0. Denying that is delusional, it's like denying that the sun is hot after having been sunburned.\nIn Japan women sell their bodies directly or indirectly (porn) just to buy makeup and expensive purses. And plenty of women do the same thing in other capitalist countries. Think of the so-called \"e-girls\" or \"Thots\". They have already more than they need, certainly more than they would have had in the URSS, and yet they still do it. That's not \"survival\". \n\nThe problem with Communists is always the same: denial of human nature, or thinking that human beings are sort of blank slates and their behavior is 100% dependent on the system they're brought in, so that if you change the system, you will change human nature. That's obviously false.",
				"added": 1566094232
			}
		]
	},
	"comment_vote": {
		"8_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"972_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"51_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1
	}
}