{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Who's the Most Respectable Warrior in Russia?",
			"body": "Putin Fan's Club! \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT/Putin+Fan+s+Club \n\nIf you truly love Vladimir Putin, with a genuine love from your heart, **NOT of the fake type of love — like the modern eunuch** — the famous Chinese exile Miles Kwok (Guo Wen Gui), who said that he loved Emperor Xi Jin Ping very much, and even **praised Emperor Xi as a Great Emperor in A Thousand of Years**, while Mr Guo's many other family members are **suffering most brutal tortures by those barbarous henchmen** dispatched by Dictator Xi, then, \nyou should protect Vladimir Putin, and all of Putin's family members with a good system of Gun Rights protecting Human Rights. \nWhy? \nFor one simple reason, if without such system, the so-called universal value of democracy could be easily discarded by any politician with Hitler-style mentality, and tramped upon like a scrap of paper! \nRemember the most famous dictator Joseph Vissarionovich Stalin in Russia's history?  Despite all of his great achievements, and all of the massive massacre like The Gulag Archipelago that exhibited the full brutality and prowess of a vicious and cruel modern monarch, Stalin was eventually murdered by his most intimate colleague Lavrentiy Beria, with all of Stalin's family members living in great threat by the jungle dictatorship system.  \n\nIf you love Vladimir Putin, but dare not launch a system of Gun Rights protecting Human Rights to protect the Great Emperor of Putin, then that kind of love, or loyalty would be a fake one, just like Miles Kwok's eunuch style hypocritic loyalty, which will ultimately hurts yourself, and the Great Leader that you admire, besides all the family members of that Great Leader, just the real example of Stalin and Hitler. \n \nSome people said that there was democracy in Hitler-ruled Germany.  A system with political election can't be called as democracy, or at most as semi-democracy only.  Based on an effective system of Gun Rights protecting Human Rights to accompany the political election system and rule of law, then the vitality of a democratic republic can keep going for long time.\n\nSuch vitality will go into the eternity when the universal value of democracy is accompanied by the universal principle of Gun Rights protecting Human Rights on the planet.\n\nBased on the above logic, **the Most Respectable Warrior in Russia is Alexei Navalny or Vladimir Putin?**  It's a question that deserves deep thinking. So think of this question for a second or third time before a powerful conclusion is made finally.",
			"added": 1615605820
		},
		{
			"topic_id": 2,
			"title": "About Information Bubbles",
			"body": "As to the special word \"information bubbles\", it indeed applies to most of the topics and most of the themes on many sites, and on other traditional sites like Youtube, New York Times etc. \nBesides the \"information bubbles\", there're other problems such as **\"Rubbish Information\", \"Information Virus\", or \"Information Traps\"**. In spite of all the troubles, **there's always a certain percent of content that is focused on eternal glory of sustainable civilization, including **long term prosperity of Zeronet**, and other newly-emerged decentralized innovations like LBRY.com etc**.  \n\nSome people might prefer to enjoy porn content, or other special information, just like a 30-year-old man who thought the coronavirus was just a hoax and attended a “Covid party” on purpose, which killed him.\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2 \nAnyway, at the last moment of his secular journey of life, he did repent for his wrong mentality.  \n\n**People's attitudes on varieties of information may differ, even the same person's mind on a topic will become different at different times of history**. \n\n**When the varieties of information increase to a large level, the necessity to manage the information either by categorization or other means will be more and more imperative. ** ",
			"added": 1615609956
		},
		{
			"topic_id": 3,
			"title": "A Time for Choosing",
			"body": "1964年里根的经典演讲中有不少内容和当下的背景非常相似（也难怪很多人认为川普很像里根），这个演讲放到今天依然是经典，历史似乎又再次轮回。下面为中英双语的文字版（节选）：\nA Time for Choosing \nI have spent most of my life as a Democrat. I recently have seen fit to follow another course. I believe that the issues confronting us cross party lines. Now, one side in this campaign has been telling us that the issues of this election are the maintenance of peace and prosperity. The line has been used, \"We've never had it so good.\"\n我这辈子大部分时间都是民主党。最近，我才感到我比较适合另一套路子。我认为，我们面临的问题是跨党派的。如今，一边的阵营在告诉我们，本轮选举的议题是维护和平与繁荣。这话说的，“我们没法再好了。”\nBut I have an uncomfortable feeling that this prosperity isn't something on which we can base our hopes for the future. No nation in history has ever survived a tax burden that reached a third of its national income. Today, 37 cents out of every dollar earned in this country is the tax collector's share, and yet our government continues to spend 17 million dollars a day more than the government takes in. We haven't balanced our budget 28 out of the last 34 years. We've raised our debt limit three times in the last twelve months, and now our national debt is one and a half times bigger than all the combined debts of all the nations of the world. We have 15 billion dollars in gold in our treasury； we don't own an ounce. Foreign dollar claims are 27.3 billion dollars. And we've just had announced that the dollar of 1939 will now purchase 45 cents in its total value.\n但是，我觉得不妥。这个“繁荣”不是我们所希望的未来。历史上没有任何国家，在税负高到国民所得的三分之一，还可以活着的。如今，每赚一美元就有37美分要上交国库作为税收。而我们的政府每天超支1700万美元。过去34年，有28年预算没有平衡过。在过去的一年时间里，我们已经把债务上限提高了三倍。如今，我们国家的债务是全世界国家债务总和的1.5倍。我们的国库只有150亿元的黄金，但一盎司都不属于我们，外国货币占去了273亿。而我们刚刚说，现在一美元购买力总值只相当于1939年的4毛5分钱。\n……\nNot too long ago, two friends of mine were talking to a Cuban refugee, a businessman who had escaped from Castro, and in the midst of his story one of my friends turned to the other and said, \"We don't know how lucky we are.\" And the Cuban stopped and said, \"How lucky you are？ I had someplace to escape to.\"\n不久前，我两位朋友和一个古巴难民聊天，他是个生意人，从卡斯特罗那里逃出来的。在古巴人述说他遭遇的时候，其中一个朋友对另一个说，“我们不知道我们幸运什么。”古巴人停了下来，说：“你们还不幸运？我只要有个地方可以躲，就行了。”\nAnd in that sentence he told us the entire story. If we lose freedom here, there's no place to escape to. This is the last stand on earth.\n他的这句话说明了一切。如果我们这里也失去了自由，那全世界都无处可逃了。这是地球上最后的一站。\nAnd this idea that government is beholden to the people, that it has no other source of power except the sovereign people, is still the newest and the most unique idea in all the long history of man's relation to man.This is the issue of this election： Whether we believe in our capacity for self-government or whether we abandon the American revolution and confess that a little intellectual elite in a far-distant capitol can plan our lives for us better than we can plan them ourselves.\n政府理应为人民服务，因为权力是至高的人民所授予的，除此之外没有其他的来源。在人与人关系的历史长河中，这种理念仍然是最新，最独特的。本轮选举的主题是：我们要相信自我管理的能力，还是摒弃美国革命的理念，承认偏远的国会里有一小撮精英可以为我们的生活作计划，而且计划得比我们更好。　　\nYou and I are told increasingly we have to choose between a left or right. Well I'd like to suggest there is no such thing as a left or right. There's only an up or down —— [up] man's old —— old-aged dream, the ultimate in individual freedom consistent with law and order, or down to the ant heap of totalitarianism. And regardless of their sincerity, their humanitarian motives, those who would trade our freedom for security have embarked on this downward course.\n我和你一样，越来越多的人要你选左派，或右派。嗯，我想提议的是，别管什么左派右派的。这里只有向上派或向下派：向上，这是人古老的梦想，是个体自由的目标，它与法律和秩序是一致的。所谓向下，就是象蚁堆一样，甘愿自己被极权主义压在底层，不管真心诚意也好，或是出于人道主义也罢，他们都会以安全为由，出卖我们的自由，走上这条向下沉沦的道路。\n……\nSenator Fullbright has said at Stanford University that the Constitution is outmoded. He referred to the President as \"our moral teacher and our leader,\" and he says he is \"hobbled in his task by the restrictions of power imposed on him by this antiquated document.\" He must \"be freed,\" so that he \"can do for us\" what he knows \"is best.\" And Senator Clark of Pennsylvania, another articulate spokesman, defines liberalism as \"meeting the material needs of the masses through the full power of centralized government.\"\n参议员富布赖特在斯坦福大学说，宪法已经过时了。他说总统是“我们的道德导师，是我们的领袖”，他说，他的工作被这篇限制权力的‘古文’束缚了。”应该给他“自由”，让他‘尽心为我们做’他认为最好的事情。”。还有一位发言人，宾夕法尼亚州参议员克拉克，他直截了当把“自由主义”定义为“通过集权政府的所有权力来满足民众的物质需求。”\n\"the full power of centralized government\" —— this was the very thing the Founding Fathers sought to minimize. They knew that governments don't control things. A government can't control the economy without controlling people. And they know when a government sets out to do that, it must use force and coercion to achieve its purpose. They also knew, those Founding Fathers, that outside of its legitimate functions, government does nothing as well or as economically as the private sector of the economy.\n“集权政府的所有权力”这是建国先贤极力避免的东西。他们知道，政府无法控制事情。一个政府要控制经济，必然要压制人民。他们知道如果政府要这样做，它必须通过暴力和强制的手段来实现。那些建国先贤，他们当然知道，政府除立法职能之外，在经济上的作为，完全不如私有经济领域。\n……\nWe cannot buy our security, our freedom from the threat of the bomb by committing an immorality so great as saying to a billion human beings now enslaved behind the Iron Curtain, \"Give up your dreams of freedom because to save our own skins, we're willing to make a deal with your slave masters.\" Alexander Hamilton said, \"A nation which can prefer disgrace to danger is prepared for a master, and deserves one.\"\n我们不能为了自己的安全和自由不受炸弹的威胁而出卖良心地对铁幕下饱受奴役的10亿人说：“放弃你们的自由梦想吧，因为我们要明哲保身，我们要和你们的主子做交易。”亚历山大汉密尔顿说，“如果一个国家宁受屈辱也不愿意铤而走险，那么它在邀请一个主子，活该被它奴役。”\n……\nYou and I have the courage to say to our enemies, \"There is a price we will not pay.\" \"There is a point beyond which they must not advance.\" And this —— this is the meaning in the phrase of Barry Goldwater's \"peace through strength.\" Winston Churchill said, \"The destiny of man is not measured by material computations. When great forces are on the move in the world, we learn we're spirits —— not animals.\" And he said, \"There's something going on in time and space, and beyond time and space, which, whether we like it or not, spells duty.\"\n你和我鼓起勇气告诉我们的敌人，“我们不买这个账。”“有一点更为重要，就是他们必须停止扩张。” 戈德华特的那句话“和平要靠力量\"，就是这个意思。”温斯顿·丘吉尔说过：“人的命运不是以物质积累来衡量的，当伟大的力量推动历史前进时，我们意识到我们是有灵魂的人，而非动物”。他说，“不管我们喜欢还是不喜欢，在时空中一直存在着，甚至超越时空之外也依然存在着 — 一个独特的事物，那就是责任。”\n**You and I have a rendezvous with destiny.\nWe'll preserve for our children this, the last best hope of man on earth, or we'll sentence them to take the last step into a thousand years of darkness.\n命运让您和我走到一起。\n为了孩子们的未来，我们一定要保守住人类最后的希望，否则我们将会就让他们跌入千年的黑暗深渊。** \n\nhttps://criticalpolitics.wordpress.com/2009/04/07/reagan-we-can-have-peace-this-second-if-we-surrender/",
			"added": 1615721854
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"8_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 1,
				"body": "... \"You and I have a rendezvous with destiny. We will preserve for our children this — the last best hope of man on Earth, or we will sentence them to take the last step into a thousand years of darkness.\"",
				"added": 1615720723
			}
		]
	},
	"comment_vote": {}
}