{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "O puedes montar tu propio servicio de VPN, igual no creo que debamos desconfiar enteramente de los VPN comerciales, por ejemplo, un amigo tuyo puede tener un servicio y deseas comprarle y usarlo: Esa es la relación más cercana (si no, entonces ya valió verga internet y mejor no usarlo) y \"confiable\" (suponiendo que aquella empresa no se alimenta de capitales extraños) a la que se podría acceder. Además no todo mundo tiene el conocimiento por ejemplo para tener un cliente y un tracker onion a la vez... y la mula... bueno, está más focalizada en España y por eso mismo no es tan masiva :(",
			"post_id": 5,
			"date_added": 1457463703
		},
		{
			"comment_id": 2,
			"body": "He visto un video sobre zeronet y curiosamente los que hablan en este video desenfocan este blog como contenido pornográfico y/o ilegal https://www.youtube.com/watch?v=m__k4CShldM\n\nEs de lamentar tantos ataques a una red tan joven y a un blog como este, que está basado simplemente en la libertad de expresión.\n\nSaludos a todos.",
			"post_id": 114,
			"date_added": 1474824997
		},
		{
			"comment_id": 3,
			"body": "Pasa con cualquier proyecto alternativo: cientos de gringos (cualquier pelotudo conducido por mayorías no pensantes) entusiastas que intentan ver en las cosas nuevas las revelaciones del dios del dinero, terminan por rendirse e irse por falta de contenido viral y basura, como es siempre el estilo de ellos. Los demás, los que persistimos de algún modo tenemos la idea de que esta red tiene potencial y podría significar le \"revolución\" y transformación del Internet convencional (plagado de desigualdades y fraudes).\n\nPor otro lado, ahora que refieres freenet y los proyectos I2P, yo veo dos problemas fundamentales en tales redes, cosas que soluciona parcialmente zeronet: la interfaz y el conocimiento técnico para ejecutar y/o instalar. Así las cosas, con usuarios dummies, lo más probable es que terminen en este lugar, mucho más accesible que las antiguas iniciativas.",
			"post_id": 116,
			"date_added": 1475114692
		},
		{
			"comment_id": 4,
			"body": "Pues en vista de que existe la posibilidad de crear IDs diferentes a los centrales, no debería haber preocupación extrema acerca de la centralización. Puede que incluso el creador, a pesar de no querer difundir la forma de autenticación y distribuirla, se le salga de las manos su invento para formar parte de esta red, que según he visto, cada vez tiene más gente que la mire.",
			"post_id": 130,
			"date_added": 1476461745
		},
		{
			"comment_id": 5,
			"body": "He escuchado otra crítica en el sentido psíquico: un antisocial hacker con problemas mentales serios intenta salvar el mundo, pero como es loco y antisocial es muy inofensivo y su tarea filántropa es parte de su comportamiento alejado de la \"normalidad\".",
			"post_id": 131,
			"date_added": 1476461872
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"131": 1
	}
}