{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1525022938_1GhoZ4crcetFwVn26HQC44pT6Jeh6Hbank": 1,
		"1524997617_1CcoRvm8AhLxYLtYoXwwzobh74Kzc2UcBb": 1,
		"1525112946_1MTNhSVgCJpW8uBjFhnyA5NsgyKbKnvrLG": 1,
		"1522279439_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1525022938_1GhoZ4crcetFwVn26HQC44pT6Jeh6Hbank": [
			{
				"comment_id": 1,
				"body": "If you die like a villain, your life don't make sense. Anyone can do it, so your residency on Earth becomes meaningless, it's better to die as a hero, but here will be some signs of your life\n\nIf no one remembers you... Maybe, you never existed really?",
				"added": 1525028791
			}
		],
		"1524997617_1CcoRvm8AhLxYLtYoXwwzobh74Kzc2UcBb": [
			{
				"comment_id": 2,
				"body": "But what differs AI and our minds? We know very little about dreams, for example. \n\nIf you ask yourself: \"how my body saves energy due sleeping\" you, maybe, would answer: \"because it moves less\"\nIf you would dig deeper into problem, you would find out, what dreams - is a very complicated visualisation process with procedure (?) story-generation, running similar process on computer will cost a lot of energy, so what the benefit of dreams really?\n\nHere is two possible explanations:\n- our mind very efficient (millions times more, then a traditional PC)\n- theory of fundamental information was right, so we can access world of information via our brains to gather images of what we see in dreams\n\nSo, maybe, AI wouldn't be so good as we imagine, if they have missing parts",
				"added": 1525030425
			},
			{
				"comment_id": 3,
				"body": "> [shitchell](#comment_28_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Interesting example that you picked. Hebbian learning is postulated as a model used by our brains and used in neural networks for machine learning. We receive a bunch of input and we find patterns. In machine learning, a problem can arise, however, that looks like so: [...]\nI never thought about it, interesting version. It makes sense if you remember how your memory is restructured during sleep time, but it looks... simplified? \n\nDreams are non-linear and unpredictable at the same time, you can get same dream during whole week, so instead of unlearning, you will get fragments with a lot of weight. And the most rediculous, what these fragments aren't based on your real experience, so they affect on the way you think separately of input. \n\nHere is a bigger question. Our brain is self-regulated network, so it must have learning algorythm from the start, newborn knows how to learn, even if he grew up from single cell. I'm asking myself about it for long and at this moment I couldn't find answer, how neural network grows in our head, because if humanity finds way to generate same self-learning network, it would be a key to real AI. \nIf nature can grow this network from almost nothing (10^7bit of information in DNA isn't big amount of data and DNA stores a lot of another infomation), it is quite impressive.",
				"added": 1525107221
			}
		],
		"1525103196_12cr9FG4uRftWiAySp77w2CicWj3b6juuW": [
			{
				"comment_id": 4,
				"body": "https://vk.com/cirno_nb (progressive science news, a lot of great content here if you know russian language, it reminds me, what our world have a lot of undescovered magic)",
				"added": 1525121519
			}
		],
		"1522279439_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 5,
				"body": "Would it support .flac? I have almost everything in my library in .flac format, so it's kind of trouble for me :)\nOr this is browser's problem?",
				"added": 1526066022
			},
			{
				"comment_id": 7,
				"body": "> [lola](#comment_35_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): Could you try it and give us a feedback ? But I agree flac support would be cool for quality.\n\nI'm using Vivaldi browser and never updated Mozilla Firefox, so it doesn't show Mixtape's s(z)ite correctly. But Vivaldi (Chromium-based) can't play uploaded .flac files (opens it, showing some strange track length and nothing more)",
				"added": 1526236626
			},
			{
				"comment_id": 9,
				"body": "Mentioned bug: if you click one track more than one time, it starts playing many similar tracks simultaneously => distorts the sound",
				"added": 1526327175
			}
		],
		"1526166631_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": "Who would recommend Ubuntu, really? Linux Mint (Mate) forever. I installed Ubuntu once, interested in \"Why this system is so popular\", it was laggy pain, after Mint, which worked 3+ years without serious problems and reinstalling.",
				"added": 1526235498
			}
		],
		"1526322975_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": []
	},
	"comment_vote": {
		"28_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": 1,
		"38_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR": 1,
		"39_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR": 1,
		"97_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1
	}
}