{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1621023798,
			"title": "zerobiztalk",
			"body": "join the zerobiztalk (http://127.0.0.1:43110/1KpLYGMGkVSMyHjJzBhSFvN8qXK1xXExpN/)",
			"added": 1621023797
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1618547913_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 1,
				"body": "what a blessing ! it's in general a yuge success to not watch french tv ! however I made a YUUUGGGEE BIG LEE mistake... i believed that i24 french edition wasn't an enemy media... I guess, that the occupational spirit is too strong on them, and even if in israel, and specially if still in france, they are way too contaminated by the indoctrination they received... \n\ntry it is a blessing...",
				"added": 1621023692
			},
			{
				"comment_id": 2,
				"body": "and I intend to keep going, enemy media don't deserve my time.",
				"added": 1621023707
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 3,
				"body": "hero of all heroes, brave among the bravest... yes \"we are born to win\"... \n\nhowever, let's stay out of eretz affairs, I know the temptation to extract a fatal revenge blow against this perfid nation which changed it's tv news channel to foster the greatest divide in the history of russia (when they removed their previous propaganda outlet to morph it to a ukrainian propaganda system) may be tempting.\n\nHowever, let's remain above them. latakie... all good, bring s400 if you wish to those who beg on their knees for it, bring death to nuland world... all fine... \n\nbut yeah if they can get \"lod\" they can split... \n\nbut as always, I put my trust in the wiseness and intellignence of the Kremlin, and if it went bad, rest assured : we are born to win... \n\n<3 (seriously let's not waste time in this part of the world... what is going on in china, india, kazakstan, iran, gcc etc etc etc... the world is a bigger place than the ruins of the Roman Empire).",
				"added": 1621024446
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 4,
				"body": "who wouldn't want to take \"lod\"? I would... however you see the username? I hate this female... I would love to crucify her and let her dry, be eaten alive by birds, lezards and bugs... \n\nwhy are very often such vermins born of jewish mothers and refusing to follow the law?\n\nwhat is their problems? \n\nwhat did I do to her?\n\nso you have to fucking accept it, some jews are fucking bad and deserve to be hunted down and killed like dirty animals, and most of those who are females among them, are NEVER in their kitchen... \n\nso what is going? the revenge against EDOM? \n\nwhen do you think we will say : ENOUGH and go full \"hammer of God\" on your land? \n\nask yourself this question\n\nwith your micro army, you will last... 2 sec against PLA... 2... that's generous.\n\nwhat is going wrong in the mind of this woman? and on those of this i24 french channel to support pedos like polanski and then present her ? \n\nwhat the fuck is wrong with you?",
				"added": 1621024738
			},
			{
				"comment_id": 5,
				"body": "and so when we will executed her LEGALLY, you WILL come to her execution, do your little good bye, and watch her die. understood? no? you will rule my life like the palestinians... will see... my life you can, good luck with PLA and HF... it will be short.",
				"added": 1621024811
			},
			{
				"comment_id": 6,
				"body": "and I hope she has a big family... mother  / fahter everthing down... they all are executed.\n\nwe know that france is so close to be like your country... so close....",
				"added": 1621024876
			},
			{
				"comment_id": 7,
				"body": "an laurent fabius family? marked for extermination... yes... yes... another one.",
				"added": 1621024906
			},
			{
				"comment_id": 8,
				"body": "all those theories to destroy edom to get revenge from bolshevism to all the crap, it worked... now enjoy... 1.8 billion muslims? in china we are clear, do as you wish outside chinese borders, for the rest our LAWS.",
				"added": 1621024971
			},
			{
				"comment_id": 9,
				"body": "now to have fun, pre strike on your nuke capabilities with opening of the lebanese, syrian and egyptian front... jordan jump, ksa/gcc move... finished.",
				"added": 1621025029
			},
			{
				"comment_id": 10,
				"body": "and then we can massacre abnousse shalmani...",
				"added": 1621025053
			},
			{
				"comment_id": 11,
				"body": "so why? why did she do that? she hates israel? wants war? what? why?",
				"added": 1621025080
			},
			{
				"comment_id": 12,
				"body": "like the laura loomer... at least her just want to censor us from the internet to the latest news...\n\nnot like ben shapiro...",
				"added": 1621025111
			},
			{
				"comment_id": 13,
				"body": "you believe you can hate us more than we can you? you are wrong, we are more...",
				"added": 1621025135
			},
			{
				"comment_id": 14,
				"body": "and so you shit your pants with a few men who have nothing , jailed and trapped... you have no idea what your people are doing... the hate, the rage they generate against themselves and which relfects on you... you seem too dumb, arrogant and blind to understand it.",
				"added": 1621025189
			},
			{
				"comment_id": 15,
				"body": "\"but we know biden cheated and all what the american traitors did\"... ohhoo hoohh we are so smart... what is this attitude. anyway, as said, your whole army... don't think ever about challenging PLA... don't dream, don't plan, don't... \n\nyou believe your little people gig will work there? I prefer not to imagine the fall of Mankind.",
				"added": 1621025378
			},
			{
				"comment_id": 16,
				"body": "why didn't your arrest yourselves all those involved with epstein/weinstein/adeslon, you understand, they raped children... yeah yeah americans do nothing... okay, despicable, of your self, as a state, as the jewish nation state, you sponsored child rape... sturctured it, organized it, raped children for your state? what is that? but the abomonination!",
				"added": 1621025929
			}
		]
	},
	"comment_vote": {}
}