{
	"next_comment_id": 15,
	"user_name": "Pexo",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1533398284": 1533417411,
		"13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_1541604946": 1541620759,
		"1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1544894059": 1544904978,
		"1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1547874334": 1547917064,
		"13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_1553176056": 1553194683,
		"1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1553783957": 1553796309,
		"1FPvDncPuGtrES2Lo7zgcLibewr18arFU4_1554959714": 1555007427,
		"19bSBSXYD78h4xsjdDQ6mn5vFSeJ6pmDTt_1556468094": 1556475578,
		"1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde_1557506925": 1557509803,
		"1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1557921270": 1557945367,
		"1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1558847163": 1558896268,
		"1918pVFRmx7bsXYRdKKGqaXTNt9Spoo7bJ_1568061619": 1568138350,
		"1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_1575469431": 1575479450,
		"1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_1575818795": 1575826185,
		"1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ_1575663350": 1575826554
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Kaffie: Yes.",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1538736539",
			"date_added": 1538767815
		},
		{
			"comment_id": 2,
			"body": "@Nekololi: \n@ssdifnskdjfnsdjk@zeroid.bit: \nI'm fairly certain tor is only bundled on the windows version linux users (I think) still need to set up tor themselves (using apt or dnf).",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543767060
		},
		{
			"comment_id": 3,
			"body": "@Nekololi: Interesting. When was that? I remember back when I wrote the ZeroNet on Qubes guide, that Tor did not work out of the box.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543768566
		},
		{
			"comment_id": 4,
			"body": "@Nekololi: Oh, so you mean the `[...]/ZeroNet/src/Tor`-folder? Because that is not an packaged tor version. It is the code, that manages how connections to the tor network should be made.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543770753
		},
		{
			"comment_id": 5,
			"body": "@Quantumworld: \n@Nekololi: is right. Tor is packaged for windows users for exactly the reasons you mentioned. Nofish assumes(somewhat rightfully so), that linux users are the more technically experienced, with at least some degree of understanding on how things work and can manage Tor on their own(with help of the faq). Most people on windows don't know what 'binary' even means and so Tor is already included in the windows release to make it easy enough for people without any idea how a computer works to get ZeroNet over Tor to work.\n\nOn a side note: The official docs have moved to [zeronet.io](https://zeronet.io/docs)(Clearnet).",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1543729715",
			"date_added": 1543774616
		},
		{
			"comment_id": 6,
			"body": "(much like in reality,) activity comes in waves. This is normal, give it a few weeks and we'll be back to high activity.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1544896525",
			"date_added": 1544904790
		},
		{
			"comment_id": 7,
			"body": ">after I discovered a camera and microphone in it\nWhat?!\nWas that, like a feature or just straight up (literately) spyware?",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1547024475",
			"date_added": 1547055954
		},
		{
			"comment_id": 8,
			"body": "@Quantumworld: \n@PolarðŸ€â˜˜ï¸ðŸŒ¿ðŸŒ¾ðŸŒ´: \nHere:\n```\nZeroNet.sh dbQuery 1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH \"SELECT count(json_id) AS followers FROM follow WHERE auth_address IS '1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE'\"\n```\nor\n```\nZeroNet.sh dbQuery 1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH \"SELECT count(json_id) AS followers FROM follow WHERE user_name IS 'Quantumworld'\"\n```\nYou can run these in a terminal(or command prompt) inside your ZeroBundle folder. Both will(or rather are supposed to) give you the same result.\n\nFor everybody else: You can replace `1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE` with your auth address, which you can get from the url of your profile(right before your id), in the first command or `Quantumworld` in the second with your current username.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1549232190",
			"date_added": 1549302536
		},
		{
			"comment_id": 9,
			"body": "Can't remember where I saw it, but earlier this week nofish said it could be done within the week, so it's probably almost done.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1551569644",
			"date_added": 1551642468
		},
		{
			"comment_id": 10,
			"body": "Isn't it supposed to look like that?",
			"post_uri": "1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde_1552494873",
			"date_added": 1552495160
		},
		{
			"comment_id": 11,
			"body": "You mean it's opening the settings window of Manjaro?",
			"post_uri": "1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde_1552494873",
			"date_added": 1552495963
		},
		{
			"comment_id": 12,
			"body": "Quite the curious user name you have there ;)",
			"post_uri": "12RXpX8yGLTCTEhmdQ4utkFd2cvhGfsPkG_1",
			"date_added": 1553102781
		},
		{
			"comment_id": 13,
			"body": "@ssdifnskdjfnsdjk@zeroid.bit: \nME was kind of an PoC, there is currently (somewhat) active development of a new ME version with actual moderation, numerous bugfixes and lots of configuration options for board owners. You can take a look at the progress on the [gitgud repo](https://gitgud.io/millchan/Millchan)(clearnet) for millchan.\n\n>also you have to first visit the hub before you can see its content via merger site (Millchan Engine) which is quite big disadvantage\n\nFor now this was intended, but might be changed in the future(see [this](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:1b5f282e-6a57-4aa4-ae11-8b85dda51509#post-eae7cd05-ff80-40d4-942c-a3580a00c167) millchan post). A lot of people where (somehow) shocked to see, that uncensored also means that the boards they dislike are easily accessible.\n\n@Julia: \n>Millchan is basically doomed, isn't it?\n\nNot for now, but probably in the long run.\n\n@klu9@zeroid.bit: \n>How does one find boards on Millchan Engine? Is there a list anywhere?\n\nNot an official one, yet. But [Innocent childs index](/1J1epG5eMc4bsmh69UctBg4PHEe5B3kYHY/hubs.html) is pretty complete (and also uncensored).",
			"post_uri": "15XUsVeT1B89ai5J4b25wtZ1C6fi7n1Mm1_1555168078",
			"date_added": 1555262121
		},
		{
			"comment_id": 14,
			"body": "Funny, I've been kind of thinking about this the last couple of days. On one hand I want to be more active here and contribute more, but on the other hand that would require me to reveal more of what I know, which can be correlated with my general interests and be used to home in on myself. And that's assuming that I don't fuck up OPsec while doing so. The only way to somewhat mitigate that is to sprinkle in lies that defer from my real personality, but not only is this disingenuous to everyone else, but now I'm back where I started, lying all the time, to hide who I am(only the other way around), which I was trying to avoid in the first place(what I didn't want to have to do anymore when I was coming here)...\n\nAlso: Nice to see that you are still around.\n\n@caryoscelus: \n>one little slip can make you paranoid for days\n\n+1\n\nAlthough you don't even need to make a little slip to be paranoid for days, the 'great' thing about paranoia is, that you don't even need a solid reason. Sometimes not even fear of what could have been is required.\n>So i think the important thing is to make an informed decision, rather than necessarily trying to stay as anonymous as possible\n\nUnfortunately for some people there is no option to choose from.(Well there still is, but the choice between `Ending your current state of life forever into an unfavorable(and uncertain) future, likely loosing 80% of everything you hold dear(material or not, which includes family, friends, social status, probably your job), people looking over your shoulder on everything you do and (depending on where you live) constant fear of the people around you` and `you better do damn near perfect OPsec or shut up` is an easy one to make)\n@ssdifnskdjfnsdjk@zeroid.bit: Also don't forget to set trackers to tor as well.",
			"post_uri": "19bSBSXYD78h4xsjdDQ6mn5vFSeJ6pmDTt_1556468094",
			"date_added": 1556477429
		}
	]
}