{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1555245602,
			"title": "What the frick is going on right now.",
			"body": "Its about a few hours that nothin works, facebook, google and all kind of this stuff. Telegram is working (how always). Anyone knows further informations?",
			"added": 1555245601
		},
		{
			"topic_id": 1556212621,
			"title": "I really like the tecnology behinf zeronet but....",
			"body": "I think the technology behind ZeroNet is great, I mean a web that can go through bluetooth or even radio, in catastrophic like situation it would be great. I am also a big fan og how torrents work.\nZerNet is simply great and I like the fact that it is made so that it is impossible to censure and so on. I think it is doublefaced...... I think, how long does it take until here it will be all only about revenge porn and pedofilia. I think the git maintainers should made a COC or something like that. \nIn some years we will be in the media as the strange people that use ZeroNet. \nIt will be like in the country I live, where you have perfect acess to the internet and information but the police is  going school to school talking about \"what horrible place the depp web is and all is only drug and weapons\" (not saying that it isn't, but it's the concept that you are making fright).\nWhat do you think, how can we improve it, should we open a issue on github?",
			"added": 1556212619
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1555185007_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 1,
				"body": "Nice Post, there are actually ways to turn off intel ME, tal security remove HDD and use only tails from an USBbut you can destroy your PC. JUst use a thinkpad x200 with an intel core duo and you can libreboot. If you want to",
				"added": 1555187500
			},
			{
				"comment_id": 2,
				"body": "be 100% secure than use even an older PC with tails",
				"added": 1555187543
			}
		],
		"1555194783_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "I like very much ZreoNet but I thin it will be abused for revenge porn. SO if we won't to learn from our mistakes we have to add certain rules.",
				"added": 1555232647
			}
		],
		"1555245602_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 4,
				"body": "> [jeej](#comment_1_1KEXLrCcQYabnbLngN1Vh3VnG3yD2h21Uj): if you search for keyword \"facebook\" in your favorite search engine, you might get news about why it is down. [...]\n\ngoogle worsks now too for me (not that I use it... I use only duckduckgo.com/lite )",
				"added": 1555246804
			},
			{
				"comment_id": 5,
				"body": "> [jeej](#comment_2_1KEXLrCcQYabnbLngN1Vh3VnG3yD2h21Uj): Well, hopefully people start using it less and less everyday. Keep it up!\n\nWe hope, and that is for what we are fighting for!!!",
				"added": 1555249458
			},
			{
				"comment_id": 6,
				"body": "> [quantumworld](#comment_373_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Probably system upgrades and updates. This usually happens over the 24 hours of Saturday and Sunday. They usually will schedule these maintenance periods based on last years lowest connected users network activities.  [...]\n\nI heard that FB looses 24.00$ per miniìut down",
				"added": 1555337407
			},
			{
				"comment_id": 7,
				"body": "> [reitoei](#comment_18_1MTNhSVgCJpW8uBjFhnyA5NsgyKbKnvrLG): Been busy sorting a new VPN (went for expressvpn) so missed all the fuss. Don't use a lot of FB, Twitter etc. Even started moving away from Google for search. So no idea what is going on.\n\nIf you are here it is strange that yo still use goohgle",
				"added": 1555337432
			},
			{
				"comment_id": 8,
				"body": "> [franc](#comment_6_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4): I heard that FB looses 24.00$ per miniìut down\n\nsry type error 24.000$",
				"added": 1555337457
			}
		],
		"1555519409_1GPcQGyxZgHrA7mBwgPSGqSgBVRJmvRdi2": [
			{
				"comment_id": 9,
				"body": "is there anybody out there?",
				"added": 1556211854
			}
		],
		"1556212621_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 10,
				"body": "You are bringing up all argoments with them I agree, but I think globally pedofilia and revenge porn aren't ethic things",
				"added": 1556221109
			}
		],
		"1559069408_19aXxMN25h3rLrxTb3hjy7WJns13MpkyqY": [
			{
				"comment_id": 11,
				"body": "What about selfhosting? http://www.pivpn.io/",
				"added": 1559074724
			}
		]
	},
	"comment_vote": {}
}