{
	"next_topic_id": 47,
	"topic": [
		{
			"topic_id": 1518516153,
			"title": "Bezpečnost a anonymita na Zeronetu (rady jak na to)",
			"body": "Bezpečnost, šifrování, anonymita při používání ZeroNetu..\n\n**Pravidlo 1)**\nje vhodné používat VPN a nebo si zapnout Tor (Nahoře na stránce [zerohello](/) je tlačítko TOR)\n--> tím zajistíte, že\na) nebudete vystupovat pod skutečnou IP adresou (anonymita)\nb) datový tok bude šifrován a nebude čitelný například pro hackera na wifi nebo pro poskytovatele internetu a pod.\n\n**Pravido 2)**\nadresář zeronetu mějte na šifrovaném disku. Je možné použít například software VeraCrypt nebo Truecrypt.\n\nDůvody pro výše uvedená opatření:\n\n**1) anonymizace sdílení dat** - pokud surfujete po zeronetu, může se stát, že se vám do PC stáhne nelegální soubor nebo soubor chráněný copyrightem a vy ho budete distribuovat dalším lidem. určitě nechcete aby všichni kterým ho odesíláte znali vaší skutečnou Ip adresu podle které může policie nebo nějaká vlivná skupina nebo elitní hacker zjistit kdo je majitelem dané internetové přípojky.\n**2) znepřístupnění dat na svém PC** - pokud nepoužíváte VPN ani Tor a někdo zjistí kdo je majitelem vaší internetové přípojky (popsáno výše), tak třeba nebude moci dokázat že jste to vy kdo sdílel data, jelikož nenajde žádné čitlené informace (jsou šifrované) na disku. (pokud se obáváte že by se mohl skutečně někdo dostat fyzicky do vašeho PC, je vhodné PC neuspávat ale vypínat, viz [zde](/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1564767539_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Disk+encryption+key+can+be+found+in+RAM+in+case+of+computer+sleep+hibernation)).",
			"added": 1518516152
		},
		{
			"topic_id": 1518519651,
			"title": "České ZeroNet stránky",
			"body": "Znáte novou ZeroNet stránku v českém nebo slovenském jazyce pro české/slovenské publikum? Přidejte sem její adresu..\n\npodobné: [Jak vytvořit vlastní stránku na ZeroNetu](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1519057574_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Jak+vytvo+it+vlastn+str+nku+na+ZeroNetu)",
			"added": 1518519649
		},
		{
			"topic_id": 1519055820,
			"title": "Jak se vyznat na ZeroNetu",
			"body": "Pokud se potřebujete zorientovat na ZeroNetu, jsou zde různé adresáře nejpopulárnějších zeronetových stránek.\n\nNapříklad: [ZeroNet Links](http://127.0.0.1:43110/1Kt7xxVRcxHcK14Mt7YZdXfh8MzUJMkvpk/), [ZeroWiki zites list](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:list-of-zites)\n\nPříklady zajímavých zeronet stránek:\n\n[ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/) (soukromá korespondence v Zeronetu)\n[KopyKate](http://127.0.0.1:43110/big.kopykate.bit/) (sdílení/streamování videí)\n[ZeroTorrent](http://127.0.0.1:43110/ZeroTorrent.bit/) (adresář torrentů)\n[GitCenter](http://127.0.0.1:43110/1Jhb5snQN5z198ELyFoj2apeuuaRCM9Pqm/) (prostředí pro vývoj aplikací, alternativa GitHub)\n[ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/) (sociální síť, něco jako Twitter)\n\nDokumentace k zeronetu v angličtině: https://zeronet.readthedocs.io/en/latest/\n\nPro vyhledávání na stránkách, které jste navštívili, můžete využít vyhledávací pole v bílé části stránky [ZeroHello](/).",
			"added": 1519055816
		},
		{
			"topic_id": 1519057574,
			"title": "Jak vytvořit vlastní stránku na ZeroNetu",
			"body": "**Nejjednodušší způsob vytvoření vlastní stránky**\n\n**Vlastní BLOG a nebo diskuzní FÓRUM klonováním existující stránky**\nOtevřete si [blog](/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1535186853_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS) nebo [fórum](/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1548256806_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS) (jako je toto), následně běžte na [ZeroHello](/) najděte si vámi vybranou stránku v seznamu, klikněte na \"...\" vedle názvu stránky a zvolte \"Clone\".\n\n**Vytvoření prázdné stránky**\nNa stránce ZeroHello jsou vedle loga tři tečky, které otevírají menu, ve kterém je volba \"Create new, empty site\", toto vytvoří prázdnou stránku.\n\n**Kde najdu data své stránky**\nA po kliknutí na volbu \"Show data directory\" se zase otevře adresář kde jsou uložená data zeronetových stránek. Najdete zde i adresář mající stejné jméno jako je adresa vaší nové stránky. Uvnitř jsou všechna data vašeho webu. Nezapomeňte si tato data zálohovat, včetně celého zeronet (zejména users.json) na externí disk abyste je mohli obnovit a znovu získat přístup ke svému uživatelskému účtu a stránkám.\n\n**PHP, MySQL, Wordpress vs ZeroNet**\nMohu nahrát svůj redakční systém z běžného internetu a hostovat ho na ZeroNetu? PHP soubory, MySQL databáze a tak? Odpověď je NE. Zeronet nemůže být kompatibilní s PHP a MySQL protože tyto softwary nepodporují decentralizovaný způsob distribuce obsahu který používá Zeronet. Viz anglická [dokumentace](https://zeronet.readthedocs.io/en/latest/site_development/getting_started/) Podporuje ale dynamické stránky založené na Javaskriptu/CoffeeScriptu a speciální vestavěné SQL databázi. V opačném případě je možné použít statické stránky s HTML, obrázky a javaskriptovými prvky.",
			"added": 1519057569,
			"modified": 1630771394
		},
		{
			"topic_id": 1519115482,
			"title": "Jaké jsou výhody ZeroNetu",
			"body": "Ahoj, pojďme sestavit výhody Zeronetu\n\nZa mě vidím následující výhody:\n\n1) DOSTUPNOST STRÁNEK BEZ POPLATKŮ - u běžných internetových stránek se musíte spolehnout na nějakou firmu, že bude fungovat a bude udržovat vaší internetovou stránku v chodu. Pokud máte placený hosting, je zapotřebí jim pravidelně dávat peníze, jinak vaše stránka zmizí z internetu. Třetí problém běžného hostingu mimo zeronet je hardwarové selhání které zapříčiní nedostupnost internetové stránky.\n\nU Zeronetu můžete třeba i na mnoho let nechat vše být a pak najdete stránku dostupnou - díky dalším lidem/komunitě, kteří stránku navštívili, mají ji uloženou na svém PC a tím ji také odesílají dalším novým návštěvníkům. Je možné, že pokud vytvoříte užitečnou stránku, bude bezplatně fungovat a pomáhat ještě po tom, co vy sami existovat nebudete.\n\n2) BEZ CENZURY - není známo, že by policie ani vláda cenzurovala obsah zeronetové stránky. Stránku totiž pomáhá distribuovat celá řada lidí (v pravém horním rohu zde na stránce vidíte tlačítko, táhněte jím doleva a zobrazí se vám kolik lidí tuto stránku pomáhá distribuovat) a tito lide (peers) mohou být anonymní díky síťi Tor, kterou Zeronet používá. Cenzuru, mazání SPAMu může provádět pouze zakladatel stránky, potažmo ten, komu zakladatel důvěřuje natolik, že mu dá klíč. Zatím nevím o tom, že by někdo vytvořil redakční systém, který by komunitě umožňoval hlasovat pro smazání určitého příspěvku jiného uživatele a tento by byl na základě dostatečného počtu hlasů automaticky smazán.\n\n3) ANONYMITA, ZeroNet umožňuje komunikaci skrze anonymizační [síť Tor](https://cs.wikipedia.org/wiki/Tor) čímž jako uživatelé nevystupujeme pod skutečnou IP adresou ale pod IP adresou Tor serverů.\n\n4) ZDROJOVÝ KÓD je otevřený (open source) a je také utvářen komunitou,: https://github.com/HelloZeroNet/ZeroNet/",
			"added": 1519115476
		},
		{
			"topic_id": 1519997040,
			"title": "Jak sdílet/přestat sdílet (smazat) stránku, kterou jsem navštívil/a?",
			"body": "Když navštívíte zeronetovou stránku, stáhne se Vám do počítače to, co vidíte a další lidé pak mohou tato data stáhnout i od vás.\n\n**Pokud se vám nelíbí určitá stránka**, můžete ji smazat/pozastavit její sdílení ze stránky [ZeroHello](/) (vedle názvu stránky jsou tři tečky což je menu ve kterém se skrývá daná volba - Delete nebo Pause). Smazat stránku můžete ještě rychleji tak, že na stránce, kterou si přejete smazat a tím přestat sdílet najdete v pravém horním rohu ikonu ( 0 ) a zatáhnete za ni doleva. V objevivším se menu se posuňte dolů kolečkem myši a zvolte \"Delete\".\n\n**Pokud se vám stránka líbí a chcete jí podpořit**, můžete si stáhnout celou stránku včetně podstránek a další lidé pak budou mít možnost si ji od vás stahovat (budete-li mít zapnutý ZeroNet). Jak na to? Opět z menu ( 0 ) které najdete na každé zeronetové stránce v pravém horním rohu. Zatáhněte myší doleva za tlačítko ( 0 ). V menu pak se posuňte dolů (kolečkem myši) a daná volba se jmenuje \"Download and help distribute all files\".",
			"added": 1519997033
		},
		{
			"topic_id": 1520888790,
			"title": "Návod jak používat PC & internet anonymně",
			"body": "Pomocí tohoto návodu se naučíte:  \n1) jak si chránit svá data na PC aby k nim nikdo nezískal přístup  \n2) jak používat internet tak, abyste vystupovali pod cizí IP adresou a internetový poskytovatel ani nikdo jiný po cestě nemohl číst vaše data a zároveň zjistit jakou stránku navštěvujete. Zároveň stránka, kterou navštěvujete nebude moci zjistit jaká je IP adresa vašeho internetového připojení  \n3) jak po sobě zamést stopy na počítači  \n  \nProč to dělat? Má to význam asi pouze pokud jste paranoidní že někdo zneužije vaše data.  \n  \nŠIFROVANÁ DATA NA POČÍTAČI pomocí TrueCrypt  \n  \nNa Google.cz si najděte program \"[TrueCrypt](https://truecrypt.ch/)\" stáhněte, rozbalte. Dále si zástupce truecrypt.exe dejte do Aplikací po spuštění a nebo jako zástupce na plochu pro snadné spuštění. Tento program umožní vytvoření šifrovaného virtuálního pevného disku. Při vytváření disku (TrueCrypt, Volumes, Create New Volume, Create an encrypted file container) zvolíte vytvoření Skrytého disku (Hidden Truecrypt Volume, Normal Mode). Funguje to tak, že při tvorbě skrytého disku si zvolíte dvě hesla, jedno načte klasický disk, kde máte data, která nemusí být chráněna, druhé heslo načte skrytý disk, u kterého nikdo nemůže dokázat že skutečně tento disk existuje. DÁLE vyberete/vytvoříte (např. poznámkový blok) nový soubor, například C:\\\\Disk\\\\disktruecrypt.nemazat, který bude sloužit jako úložiště šifrovaných dat vámi tvořeného šifrovaného disku. Tento soubor můžete volně kopírovat, přesouvat a kdekoliv ho použít pro obnovení připojení šifrovaného disku. Truecrypt disk připojíte tlačítkem \"Select File\" vybráním souboru disku a následným stiskem tlačítka \"Mount\". Po ukončení všech běžících programů Truecrypt disku pak můžete odpojit tlačítkem \"Dismount\".\n  \nŠIFROVANÝ ANONYMNÍ PŘÍSTUP DO INTERNETU  \n  \nA)  \nPokud nepotřebujete být při surfování internetem anonymní permanentně, je nejjednodušší použíť síť Tor, ale není vhoné ji využít jako hlavního prostředníka pro surfování na internetu (jelikož je nebezpečí že v případě odesílání soukromých dat jako hesel přes nezabezpečené HTTP (ne HTTPS) mohou provozovatelé Tor serverů (exit node) tato data zachytit a pak zneužít. Tor tedy nepoužívat pro přístup do běžného internetu, pouze jednorázově a po zkontrolování že neodesílám citlivá data přes nešifrovaný HTTP ale že adresa stránky obsahuje HTTPs. Tor je tedy nebezpečný pro přístup do HTTP clearnetu ale v darknetu (.onion) adresy by měl poskytovat nejen anonymitu ale i bezpečnost přenášených dat (důvěřujete-li .onion stránce které poskytujete data (přihlašovací formuláře). Na Google.cz si můžete najít program \"[tor browser bundle](https://www.torproject.org/projects/torbrowser.html.en)\". Pokud do internetového prohlížeče Tor Browser budete ukládat záložky, hesla atd. tak je asi dobré ho umístit na šifrovaný Truecrypt disk.  \n  \nB)  \nPro permanentní zabezpečení surfování a anonymizaci je lepší pak použít privátní VPN nebo privátní [SSH SOCKS5 proxy server, který si sami nainstalujete](https://instantcpanelhosting.com/knowledgebase/50/Tutorial-on-how-to-get-own-encrypted-private-proxy.html). Mohu zajistit pokud by byl zájem. VPN zajistí šifrování datového toku a budete navenek v internetu vystupovat pod adresou daného proxy serveru a ne skutečnou českou IP kterou vám přiřadil poskytovatel internetu.  \n  \nANONYMNÍ E-MAIL  \nZaložení a připojování k e-mailové schránce přes Tor browser, případně použití pouze e-mailu od některého [darknet poskytovatele](http://internetlifeforum.com/internet/6612-tor-anonymous-e-mail-services-list/).  \n  \nBEZPEČNÉ MAZÁNÍ HISTORIE A DALŠÍCH ZBYTKOVÝCH DAT pomocí CCleaner  \n  \nNa Google.cz si najděte program \"[ccleaner portable](http://www.piriform.com/ccleaner/download/portable)\" nebo jen ccleaner. Stáhněte a nainstalujte. Portable/přenosnou verzi programu si přesuňte do šifrovaného TrueCrypt disku a zástupce programu na plochu pro snadné spouštění. Tento program umožní i automatizované mazání historie nejrůznějších aplikací jako prohlížeč internetu a různé historie. Je možné si nastavit mazání metodou přepisu souboru, takže smazaný soubor nelze obnovit. Options/Možnosti - Settings/Nastavení - Secure Deletion/Bezpečné Mazání - Simple overwrite 1 pass/1x přepsat mazaný soubor. Program umožňuje i čistit volné místo HDD/flash discích, takže smazané soubory již nelze obnovit speciálními obnovovacími programy. (CCleaner, Tools, Drive Wiper). Čestina v programu se nastaví v Options, Settings, language. Pro smazání historie atd. klikněte na tlačítko \"Run \"Cleaner\" a nebo jen \"Analyze\" pro zjištění co bude smazáno.  \n  \n===============  \n  \nPříklad bezpečné, anonymní práce na PC pomocí programů Truecrypt, Vidalia&Tor, CCleaner:  \n  \nSpustím PC, připojím šifrovaný disk Truecrypt, Otevřu spojení s proxy servrem nebo VPN bez kterého mi nejde internet jelikož ve Vlastnostech internetu, Síť je aktivován proxy server a ve vastnostech firewallu jsou zakázána všechna připojení, která nejdou přes síťové rozhraní/adaptér OpenVPN jejichž cílová IP není IP OpenVPN serveru nebo SSH Socks proxy serveru. Všechny programy s citlivými daty mám na šifrovaném disku a při jejich instalaci jsem se ujistil že tyto neukládají žádná data na nešifrovaný disk C:\\\\. Programy z šifrovaného disku spouštím pohodlně pomocí zástupců na pracovní Ploše PC. Po ukončení práce zavřu všechny programy, odpojím Truecrypt disk (dismount), smažu historii pomocí CCleaneru, Vypnu PC.  \n  \n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-  \nDoufám, že vám tento návod byl užitečný v tom, jak zabezpečit svá data a soukromí.  \n  \nPokud máte nějaké postřehy, zkušenosti a nebo doplnění se kterými se chcete podělit, prosím neváhejte komentovat.",
			"added": 1520888782
		},
		{
			"topic_id": 1520890460,
			"title": "Rady bezpečného používání internetu",
			"body": "Co byste poradili novému uživateli internetu aby jeho internetové brouzdání bylo bez problémů?\n\n-------------- nápady -----------\n\n1) nestahujte & nespouštějte počítačové programy z neznámých zdrojů (zejména pirátský software). Jako známé zdroje se bere třeba stahuj.cz, studna.cz, slunecnice.cz (pravděpodobně SW kontrolují antivirem před zařazením do databáze) Když už stáhnete program, zkontrolujte ho přes spuštěním antivirovým software jako je\n\nDo počítače se může dostat software, který si zapamatovává soukromé údaje jako hesla, čísla kreditní karty a odesílá je zloději. Dále škodlivý software (malware/badware) může využít počítač k provádění nezákonného útoku na cizí počítače a nebo může počítač zneužít k dalšímu šíření spamu a nebo sebe samého)\n\n2) Používat aktuální operační systém a aktualizovaný internetový prohlížeč. Pokud nechcete aktuální OS (máte starý), nainstalujte si rezidentní (neustále běžící) program, který zabraňuje škodlivému software aby infikoval počítač. (já používám [Spybot 1.6.2][1] a jeho modul TeaTimer, jednou za čas počítač Spybotem zkontroluji)\n\n3) nevěřte žádnému emailu který pochází od banky nebo emailu, který zmiňuje, že jste něco vyhráli. Před tím, než kliknete na odkaz (hyperlink) v takovém emailu, zkontrolujte si pečlivě, že vede na doménu, kterou např. vaše banka používá.  \nšpatně: http://mbank.net\nšpatně: http://mbenk.cz\nšpatně: http://bankovnictvi-mbank.onlinebanka.com\ndobře: http://mbank.cz\ndobře: http://www.mbank.cz\nZloději vytvářejí internetové stránky nerozeznatelné od originální s úmyslem ukrást citlivé údaje jako hesla, čísla kreditních karet.\n\n4) používejte hesla, která nelze uhádnout ani se neskládají pouze ze slov, která lze najít ve slovníku. Mějte více hesel. Jedna pro internetové bankovnictví a email, další pro ostatní internetové služby a třetí pro internetové služby, kterým příliš nedůvěřujete. Nikomu (ani bance) nesdělujte své heslo ani ho neukládejte v čitelné podobě v počítači ani na papír. Já tedy ukládám v programu KeePass který to šifruje. Před tím, než zadáte heslo do přihlašovacího formuláře na www stránce, tak se ujistěte, že se nacházíte na doméně dané www stránky, například banky, např. mbank.cz/\n\n5) data odesílaná internetem je možné šifrovat aby byla nečitelná případnými zloději mezi vaším počítačem a počítačem na kterým je www stránka, kterou navštěvujete. Pokud člověk nepoužívá beztrátové připojení asi není šifrování nezbytné pokud není člověk paranoidní že ho špehuje poskytovatel internetu / vláda. Pro šifrování je možné použít např. [VPN][2] nebo SSH socks proxy (Shadowsocks R)\n\n[1]: http://www.oldversion.com/windows/spybot-1-6-2\n[2]: https://www.proxpn.com/index.php#pricing",
			"added": 1520890451
		},
		{
			"topic_id": 1520892587,
			"title": "Jak mít vlastní doménu a hosting a přitom být 100% anonymní?",
			"body": "----------------------- Ve zkratce a v kostce, aktualizované info.: Anonymizace má dvě roviny:\n\n1\\. úroveň anonymizace (PLATBA): POSTUP: Nainstalovat Tor browser a použít ho k: A) založit pomocí Tor browseru e-mailovou schránku např. @mail2tor.com na  nebo bitmessage.ch a nebo lelantos.org na  a tuto schránku pak používat výhradně pro správu služeb souvisejících s hostingem www stránky.  \nB) založení prvního platebního účtu Bitcoin:  účet bude brán jako neanonymní/veřejný s osobní e-mail adresou  \nC) zavřít a otevřít tor browser nebo změnit identitu a založit druhý platební účet, anonymní, kontaktní email při založení použít mail2tor nebo jinou výše uvedenou službu  \nD) detaily účtů uložit na bezpečné místo šifrovaně. První peněženku a její adresu možno dát komukoliv aby [poslal Bitcoiny][1]. Peníze z první do druhé peněženky se nesmí poslat přímo ale pouze přes anonymizační službu (opět přistupovánu přes Tor): coinmixer.se, privcoin.io, cryptomixer.io, bitcoinmix.org, chipmixer.com (ověřit recenze před použitím)  \nnyní jsou na druhé peněžence k dispozici peníze jejichž původ je docela nemožné vysledovat zpět do česka. To znamená že stran platby se dá mluvit o 100% anonymitě. Platba za hosting a doménu se provede z druhé peněženky kde jsou anonymizované Bitcoiny. Platba/přístupy do peněženky se provedou opět pomocí Tor browseru.\n\n2\\. úroveň anonymizace (ZALOŽENÍ A SPRÁVA HOSTING SLUŽEB):  \nPak poskytovatel hostingu/registrátor domény pracuje pouze s klientskými údaji, jménem, které mu klient uvede. Většina poskytovatelů zakazuje nákup pomocí Tor browseru ale lze [najít výjimky][2]. Pokud člověk přistoupí do zmíněné struktury bez Tor browseru, tak může být zalogována jeho reálná IP adresa, což ještě nemusí znamenat katastrofu. Anonymitu je možné podpořit tak, že všechna běžná připojení do internetu půjdou ven přes šifrované spojení k [vlastnímu proxy serveru][3] (umístěném např. v jiném státě), který dále požadavky zpracuje a odešle zpět odpovědi. Pokud je zapotřebí kontaktovat poskytovatele hostingu / domény použít pouze anonymní kontaktní e-mail adresu (zmíněný mail2tor například)  \n\n-----------------------\n\nDalší povídání k tématu:\n\nKdyž si zakládáte hosting a registrujete doménu, obvykle uvádíte svou adresu. U domény většinou je vaše adresa volně přístupná a kdokoliv kdo chce si jí může z doménového jména zjistit (tzv. WHOIS)... pokud neuvedete falešné údaje, jejichž uvedení by vám znemožnilo si doménu nárokovat v případě ztráty kontroly nad doménou.\n\nAnonymita hostingu - Anonymní hosting  \n\\- Uvádíte vaše údaje při založení hostingu. Některé tzv. free hostingy (tedy hostingy zdarma) například  nevyžadují osobní údaje. Stále ale je zaznamenávána Vaše IP adresa z které se například registrujete, přihlašujete do kontrolního panelu hostingu a když přenášíte data přes FTP. Ten kdo má k tomu pravomoc může od poskytovatele internetu zjistit, kdy a kým byla tato IP adresa používána. Poskytovatel připojení k internetu má ze zákona povinnost archivovat tyto záznamy alespoň 1 rok (aktuální v roce 2009).\n\nJak obejít tu IP adresu?  \nKoupit si přístup na tzv. proxy server nebo VPN server přes který přistupujete k internetovým stránkám, FTP serverům a nebo i P2P sítím či torrentům. Proxy stojí třeba 40 Kč měsíčně). Další možnost je použít bezplatnou síť Tor. Více na [této stránce][4].\n\nProxy server je počítač na internetu ke kterému se připojíte a on zpracovává vaše požadavky na zobrazování těch a těch stránek. Přes něj se nahrávají vaše data a přes něj stahujete.\n\nVýsledek je ten, že stránky ke kterým se takto zprostředkovaně připojujete vidí IP adresu proxy serveru a ne vaší IP adresu.\n\nV tomto případě je ale nutné si zajistit nějakou [službu proxy serveru (VPN)][5] kde nelogují vaší IP. Někteří poskytovatelé zmiňují \"no logging\" (žádné logování). Pokud by někdo chtěl mohu zajistit privátní proxy server placený přes Bitcoin nebo PerfectMoney s americkou IP adresou ale u tohoto serveru nejde o 100% anonymitu, jelikož pokud by někdo z FBI získal přístup do datacentra v USA, mohl by vidět a číst co se na proxy serveru děje.\n\nV případě SSH proxy je komunikace mezi vaším PC a proxy počítačem šifrována, takže například nikdo mezi vaším PC a počítačem někde v Dallasu/USA by neměl vědět kam se člověk připojuje a co za data přenáší.\n\nAnonymita domény - Anonymní doména  \nU drtivé většiny registrátorů domén .CZ nebo .SK nejsou vaše údaje skryté a jsou vidět veřejně (na subreg.cz vidím u domény .sk adresu subregu, ne svou). Existují ale firmy které registrují domény na sebe a tak jsou u domény vidět ty firemní údaje místo vašich. Opět ale ke svému účtu u poskytovatele takovéto anonymizační služby musíte přistupovat přes dobrý proxy server aby nebyla zaznamenávána vaše pravá IP adresa. Anonymní vlastnictví domény zajišťuje například MediaOn.com, [Vindohosting.com][6] a nebo [yohost.org][7]. Registrují i domény .SK a .CZ ale to stojí asi 700Kč ročně to vlastnictví \"anonymní\" domény.\n\nZnáte nějaké anonymní free hostingy, nebo další služby pro anonymní vlastnictví domény?  \nDobrou službu proxy serveru?  \nMáte vlastní způsoby jak anonymně provozovat doménu a hosting na internetu?\n\n\n[1]: http://ceskeforum.com/viewtopic.php?f=106&t=5561\n[2]: http://instantcpanelhosting.com/cz\n[3]: http://instantcpanelhosting.com/knowledgebase/50/Tutorial-on-how-to-get-own-encrypted-private-proxy.html\n[4]: http://ceskeforum.com/viewtopic.php?f=8&t=4889\n[5]: https://internetlifeforum.com/showthread.php?t=8687&p=14583#post14583\n[6]: https://www.vindohosting.com/domainchecker.php\n[7]: http://www.yohost.org/anonymousdomain.html\n[8]: http://www.blueboard.cz/mailform.php?id=203043",
			"added": 1520892577
		},
		{
			"topic_id": 1520894284,
			"title": "Bitcoin a další kryptoměny",
			"body": "Diskuze na téma kryptoměn jako je Bitcoin.",
			"added": 1520894273
		},
		{
			"topic_id": 1538386622,
			"title": "GooglePlay aplikace mohou být i nebezpečné",
			"body": "\"Podle všeho využil neznámý pachatel k páchání trestné činnosti aplikaci pro operační systém Android s názvem „**QRecorder**“ nacházející se v oficiálním obchodě **Google Play**. Z běžně používané aplikace, která slouží k nahrávání telefonních hovorů, se po její aktualizaci ve druhé polovině měsíce září 2018 stala hrozba, neboť obsahovala malware typu trojský kůň, na základě kterého pachatel získal zejména přístupové údaje k internetovému bankovnictví a SMS zprávám uživatele. Po získání těchto přístupových údajů do internetového bankovnictví si pak neznámý pachatel minimálně v 5ti případech převedl z účtů poškozených částku bezmála 2 milióny korun na bankovní účty u ČSOB, a. s. a České spořitelny, a. s..\"\n\nhttp://www.policie.cz/docDetail.aspx?docid=22397204\nhttp://www.ceskatelevize.cz/hledani/?q=QRecorder",
			"added": 1538386610
		},
		{
			"topic_id": 1543144079,
			"title": "ČT sport a program fotbalových zápasů ?",
			"body": "Našli jste někde přehledný program jaké fotbalové a tenisové zápasy bude ČT sport kdy vysílat?\nNikde tot am nevidím na stránkách české televize :-/",
			"added": 1543144066
		},
		{
			"topic_id": 1545063530,
			"title": "Huawei a ZTE HW & SW může představovat bezpečnostní riziko",
			"body": "Národní úřad pro kybernetickou a informační bezpečnost (NÚKIB) vydal 17. 12. 2018 VAROVÁNÍ před používáním softwaru i hardwaru společností Huawei Technologies Co., Ltd., a ZTE Corporation. Používání těchto prostředků představuje bezpečnostní hrozbu.\n\n[Zdroj](https://www.govcert.cz/cs/informacni-servis/hrozby/2680-software-i-hardware-spolecnosti-huawei-a-zte-je-bezpecnostni-hrozbou/)",
			"added": 1545063516
		},
		{
			"topic_id": 1550302854,
			"title": "Základy toho, co je Active Directory",
			"body": "Zdroj:\nA) https://docplayer.cz/45866744-William-r-stanek-active-directory-kapesni-radce-administratora.html\nB) https://tracker.cztorrent.net/torrent/active-directory-kapesni-radce-administratora-2009-cz/419176\n\n**Active Directory je** rozšiřitelná adresářová služba, která umožňuje centralizovanou správu síťových prostředků. Umožní vám snadno přidávat, odebírat nebo přemisťovat \núčty pro uživatele, skupiny a počítače, stejně jako jiné typy prostředků. ... její návrh vám pomůže jasně identifikovat fyzické a logické součásti struktury vaší sítě.\n\nSlužba Active Directory je integrována do zabezpečení serveru Windows Server. Pomocí podrobné množiny oprávnění můžete řídit přístup k distribuovaným prostředkům v adresáři, podobně jako je tomu u souborů a složek. Také můžete řídit přístup k vlastnostem distribuovaných prostředků. Kromě toho, služba Active Directory nabízí skupiny zabezpečení pro správu na různých úrovních v celé rozlehlé síti.\n\n[b]Zásady zabezpečení[/b] ve službě Active Directory se používají k definování povolených akcí a nastavení pro uživatele a počítače. Administrace založená na zásadách zjednodušuje mnoho úloh správy.  Zásady skupiny lze použít mnoha různými způsoby. Jedním z nich je použít šablony zabezpečení ke konfiguraci počátečního zabezpečení počítače.\n\nVztah mezi počítači je vyjádřen pomocí [b]domén[/b]. Počítače, které jsou součástí stejné domény DNS, jsou blízce příbuzné. Klienti služby Active Directory používají službu DNS k nalezení prostředků. Služba DNS překládá snadno čitelné názvy hostitelů na číselné adresy protokolu IP (Internet Protocol). Každému počítači v doméně je přiřazen plně kvalifikovaný název domény (FQDN), například server34.microsoft .com. V tomto případě server34 je názvem jednotlivého počítače, microsoft vyjadřuje organizační doménu a com je doménou nejvyšší úrovně\n\nPři instalaci systému Windows Server na určitý počítač můžete tento počítač nakonfigurovat jako samostatný server, členský server nebo řadič domény. [b]Řadič domény[/b] (též DC) je počítač, na kterém je uložen adresář služby Active Directory.\n\nŘadiče domény řídí všechny aspekty uživatelské interakce s doménami služby Active Directory. Ověřují pokusy o přihlášení uživatelů, vyhledávají objekty a poskytují mnohé další služby.",
			"added": 1550302839,
			"parent_topic_uri": "1578848017_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS"
		},
		{
			"topic_id": 1551812992,
			"title": "Sdílení videotéky na Zeronetu",
			"body": "Si říkám že by bylo pěkné kdyby šel zeronet využít k pohodlnému sdílení filmů a seriálů. Nebylo by potřeba bát se že někdo zeronetovou stránku vypne jelikož v síti zeronet to může udělat jen sám majitel.\n\nVětšina filmů má příponu .avi a podle mě neumožňuje streamování přes internet (můžu se mýlit).\n\nVidea by se musela vše překonvertovat do formátu pro streamování. Dnes je nejpodporovanější .mp4 s kodekem x264 a zvukem ac3 nebo aac (nevím jestli oba). Druhým nejpodporovanějším formátem je .webm s \"kodekem\" VP8 a VP9 (ten umožňuje výrazně snížit velikost souboru bez ztráty kvality).\nV následujících několika letech by se mohly začít vyrábět počítače s procesorem podporujícím [AV1 formát](https://bitmovin.com/av1/) nabízející ještě výraznější snížení velikosti souborů. Oproti starému (a dnes nejpodporovanějšímu) streamovacímu formátu x264 jde o snížení velikosti souboru i o více než 60%!\n\nKonvertovat vše do mp4 ani .webm se mi zatím moc nechce, nevím, co myslíte?\n\nŠlo by naklonovat nějaký **existující zeronetový video portál** jako je:\nKopyKate: http://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/\nYoutube: http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/\nKxoVid - asi nepoužívá běžné ZeroId :-(: http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/\nMillchan Engine: http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/\nTy portály mají své mouchy. KopyKate neumožňuje hromadný a rychlý seed více souborů a je pomalá. Na Millchan Engine (které by se asi nemuselo klonovat) se mi líbí to, že lze docela jednoduše seedovat celý diskuzní hub. Například když někdo nahraje svou kolekci videí, tak lze udělat že kliknutím návštěvník zvolí že chce stáhnout všechna videa a pomoci je seedovat (sdílet s budoucími diváky). Nevýhodou je že Millchan zatím nemá vyhledávání což je velké mínus podle mě.\n\nDruhá a dost nepohodlná/nešikovná varianta je prostě **udělat statickou stránku která bude obsahovat index.html soubor se seznamem souborů a ty půjde stahovat**. Video soubory by se musely dát do složky která by byla [vyloučena z automatického stahování](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/content_json/#optional) (aby se při načtení stránky nezačla stahovat lidem celá kolekce filmů).\n\nPro anonymitu je asi vhodné používat anonymní proxy/VPN a nebo mít vynucený Tor (Tor: always) nahoře na stránce [ZeroHello](/)",
			"added": 1551812976
		},
		{
			"topic_id": 1552581959,
			"title": "Proč je dobré zdarma dávat?",
			"body": "\"darování je spíš o radosti a dobrém pocitu z darování, t.j. ze sebe. Obvykle jako přidanou hodnotu dostáváš dobrý pocit toho druhého, jeho radosti. Je to proces nebo chceš-li cesta.\"\n\nProč je dobré zdarma dávat podle vás?",
			"added": 1552581942,
			"parent_topic_uri": "1578843130_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS"
		},
		{
			"topic_id": 1553189887,
			"title": "Citáty",
			"body": "",
			"added": 1553189869,
			"parent_topic_uri": "1578843130_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS"
		},
		{
			"topic_id": 1560258680,
			"title": "Doprava, automobily",
			"body": "Diskuze na téma doprava, automobily apod.",
			"added": 1560258661
		},
		{
			"topic_id": 1561715170,
			"title": "Router pro SIM/USB modem + kabelové připojení (multi wan LTE router)",
			"body": "Dobrý den,\n\nhledám router do kterého bych zasunul:\n1. klasický síťový WAN kabel od mého poskytovatele wifi internetu (UTP, RJ45 konektor)\n2.\na) SIM kartu (LTE internet)\nb) USB modem v němž by byla SIM karta (vím že může být problém s kompatibilitou modemu s routerem, je potřeba zjistit co router podporuje)\nc) USB datový kabel ze smartphonu na němž by bylo zapnuté sdílení internetu\nd) koupit nějaký [modem na SIM karty jehož výstupem je RJ45](https://www.aliexpress.com/wholesale?ltype=wholesale&d=y&CatId=0&SearchText=usb+RJ45+4G&trafficChannel=main&SortType=price_asc&page=1&groupsort=1) - pak by stačil obyčejný dual wan router.\n\ntedy více připojení k internetu a router by tato připojení\n\n- spojil čímž by se zajistil vyšší přenos dat (balancing, bonding)\na také by měl možnost\n- používat jen jedno a v případě výpadku dočasně přepnul na záložní mobilní/SIM připojení (failover)\n\nKomplikace by mohlo být to, že podle mě některé routery balancují více poskytovatelů/připojení k netu tak, že určitý druh internetových požadavků jde jedním internetem a jiné druhým internetem, toto podle mě by nešlo v mém případě použít, jelikož mi na PC běží VPN klient a server mám mimo domácí síť (LAN) v internetu, takže routerem jde šifrovaný datový tok který podle mě by nemohl nějak dělit (mýlím se?) otázka je jak najít router, který by si s tím poradil. Nechci aby všechna zařízení v síti šla přes VPN, pouze jedno a nevím jestli existuje router, který umí poslat přes VPN jen přenos z některých LAN portů ne všech.\n\nProzatím jsem našel [tyto routery](https://www.google.com/search?client=firefox-b-ab&ei=sy8VXbqtI6iRggfB14eYCQ&q=%2BSBG3300+OR+%2BTL-R470T+OR+%2BTL-R480T+OR+%2BMR200+OR+%2BRT2600ac+OR+%2BRT1900ac+OR+%2BTL-ER6120+OR+%22Cisco+RV320%22+OR+%22DrayTek+Vigor+2925%22+OR+%2BRV340-K9-G5+OR+%2BLRT224+OR+%2BDWR-921+OR+%2BRV042G+K%C4%8D+prod%C3%A1m+nab%C3%ADz%C3%ADm+prodej+prodeji+bazar&oq=%2BSBG3300+OR+%2BTL-R470T+OR+%2BTL-R480T+OR+%2BMR200+OR+%2BRT2600ac+OR+%2BRT1900ac+OR+%2BTL-ER6120+OR+%22Cisco+RV320%22+OR+%22DrayTek+Vigor+2925%22+OR+%2BRV340-K9-G5+OR+%2BLRT224+OR+%2BDWR-921+OR+%2BRV042G+K%C4%8D+prod%C3%A1m+nab%C3%ADz%C3%ADm+prodej+prodeji+bazar&gs_l=psy-ab.3...0.0..45220139...0.0..0.0.0.......0......gws-wiz.6FrXSTRiuNw) které umí více internetových připojení. (čitelnější seznam routerů [zde na NetTalk](/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1527007067_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Dual+WAN+routers+for+internet+connectivity+load+balancing+failover))",
			"added": 1561715150
		},
		{
			"topic_id": 1564672087,
			"title": "MPO průzkum spokojeností s internetem v ČR, 2019",
			"body": "Vyplnění dotazníku by mělo mít vliv na rozhodování vlády při budování internetu po roce 2020\nhttps://grantthornton.eu/pruzkumint/",
			"added": 1564672066
		},
		{
			"topic_id": 1566897680,
			"title": "Vítejte na českém diskuzní fórum v ZeroNetu",
			"body": "Ahoj, vítejte na internetovém diskuzním fóru běžícím na síti ZeroNet. Na hostování tototo diskuzního fóra se podílíte Vy sami a tím, že máte zapnutý ZeroNet přispíváte k tomu že je dostupné dalším uživatelům. :)\n\nPokud chcete sledovat toto fórum, vraťte se na [hlavní stránku](http://127.0.0.1:43110/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t) a nahoře napravo klikněte na příslušné tlačítko. Po té se vám zobrazí upozornění na hlavní stránce Zeronetu ([ZeroHello](http://127.0.0.1:43110/)) jakmile bude na tomto fóru někým vytvořeno nové diskuzní vlákno.\n\nPokud si chcete dát tuto stránku do oblíbených, přejděte na [ZeroHello](http://127.0.0.1:43110/) a v seznamu stránek najdete tuto stránku a napravo vedle názvu si rozklikněte menu (3 tečky) a zvolte \"Favorite\".\n\nDoporučená diskuzní témata:\n[Bezpečnost a anonymita na Zeronetu (rady jak na to)](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1518516153_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Bezpe+nost+a+anonymita+na+Zeronetu+rady+jak+na+to)\n[Jaké jsou výhody ZeroNetu](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1519115482_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Jak+jsou+v+hody+ZeroNetu)\n[Jak se vyznat na ZeroNetu](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1519055820_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Jak+se+vyznat+na+ZeroNetu)\n[České ZeroNet stránky](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1518519651_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/+esk+ZeroNet+str+nky)\n[Jak vytvořit vlastní stránku na ZeroNetu](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1519057574_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Jak+vytvo+it+vlastn+str+nku+na+ZeroNetu)\n[Co je ZeroNet](https://ceskeforum.com/viewtopic.php?f=158&t=8010&p=18732#p18732) (clearnet)",
			"added": 1566897658
		},
		{
			"topic_id": 1567352095,
			"title": "Test obrázku a videa",
			"body": "Upgradoval jsem zeroTalk na [ZeroTalk plus](/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y)\na ten by měl umožnit vložit (linkovat) obrázek:\n\n![/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/merged-ZeroMe/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/data/users/1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/1549382930.jpg](http://127.0.0.1:43110/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/merged-ZeroMe/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/data/users/1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/1549382930.jpg)\n(pokud se obrázek nenačte, je zapotřebí nejdříve navštívit [Bluehub](/1BLueGvui1GdbtsjcKqCf4F67uKfritG49) a pak obnovit tuto stránku? (se vám hned načetl nebo až po načtení zerome?)\n\njak vložit obrázek:\n!\\[text\\](zeronet adresa obrazku)\n\nvideo (Mclaren F1 _ Mclaren F1 GTR At Le Mans):\n\n![Mclaren F1 _ Mclaren F1 GTR At Le Mans](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Mclaren%20F1%20_%20Mclaren%20F1%20GTR%20At%20Le%20Mans.mp4)\n\njak vložit video? stejně jako obrázek",
			"added": 1567352071
		},
		{
			"topic_id": 1567494005,
			"title": "Francouzská policie „unesla“ botnet a osvobodila 850 000 počítačů infikovaných malwarem",
			"body": "Francouzská policie „unesla“ a neutralizovala rozsáhlý botnet, zaměřený na těžbu kryptoměn. Síť ovládala téměř milion počítačů infikovaných malwarem Retadup. O úspěšném zásahu informuje server [TechCrunch](https://techcrunch.com/2019/09/01/police-botnet-takedown-infections/).\n\nPostižené stroje byly infikovány malwarem Retadup, který je hned po úspěšné infiltraci začal zneužívat k těžbě kryptoměn.\n\nBezpečnostní experti našli v kódu řídícího serveru chybu, která umožňovala odstranění malwaru z postižených počítačů. Škodlivý kód tedy bylo možné odstranit, aniž by bylo nutné na stroje instalovat jakékoli další aplikace.\n\nOperace probíhala tak, že odborníci ve spolupráci s provozovatelem hostingu nejprve pořídili „snapshot“ řídícího serveru.\n\nOperace probíhala tak, že odborníci ve spolupráci s provozovatelem hostingu nejprve pořídili „snapshot“ řídícího serveru.\n\n„V prvních vteřinách činnosti se k serveru připojilo několik tisíc botů, kteří chtěli načíst příkazy. Dezinfekční server na ně zareagoval a dezinfikoval je, čímž zneužil vadu v návrhu protokolu.“ Tímto způsobem se povedlo zastavit provoz malwaru a odstranit škodlivý kód na více než 850 000 infikovaných počítačích.\n\nzdroj: https://www.zive.cz/clanky/francouzska-policie-unesla-botnet-a-osvobodila-850-000-pocitacu-infikovanych-malwarem/sc-3-a-200040/default.aspx",
			"added": 1567493980
		},
		{
			"topic_id": 1567873649,
			"title": "Další kamion čekal až do něj narazí vlak, 35 milionů+ škoda",
			"body": "Další řidič kamionu čekal 2 minuty na přejezdu až do něj narazí vlak.\nŠkoda 35 milionů.\n\nhttps://www.ceskenoviny.cz/zpravy/policie-obvinila-ridice-auta-jenz-se-srazil-s-vlakem-v-uhrinevsi/1795132\n\nMá policie/soudy nějakou páku na to aby ty škody byly nahrazeny tím viníkem, nebo firmou pro kterou jezdí, nebo pojišťovnou (pojištění na blbost)?",
			"added": 1567873623
		},
		{
			"topic_id": 1567971833,
			"title": "Do čeho investovat peníze?",
			"body": "",
			"added": 1567971806
		},
		{
			"topic_id": 1571580123,
			"title": "Nový světový řád a Křesťanství",
			"body": "Máte povědomí o křesťanství, pojmu Nový světový řád (rozuměj jakási více-méně celosvětová vláda - možná diktatura kterou lidé vytvoří)\n\nV této souvislosti jsem narazil na zajímavý článek, který podle mě možná dost přesně podle Biblických proroctví popisuje lidskou versus Boží vládu:\n\n[Tento článek](http://www.jhvh.cz/main/t-b-from/Texty/Novinky/vlada_cloveka.html) říká: \"Velký Babylón, až se vynoří z propasti, bude potírat národní identitu a vytvoří nové světové náboženství, které v sobě bude mít prvky všech dosavadních náboženství. Velký Babylón bude chtít v  závěru pohltit úplně všechno, a kdo se mu nepodřídí, toho se bude snažit rozdrtit a vyhladit. Dnešní ideologie multikulturalismu, která z jedinečnosti národních tradic, zvyků i víry, dělá bezobsažnou a vše relativizující směs, potlačuje jedinečnost a význam křesťanských hodnot. Vyvolání a podpora velké migrační vlny do Evropy lidí cizích naprosto odlišných kultur a náboženského vyznání je vědomou snahou oslabit, co nejvíce křesťanské kořeny naší civilizace.\"\n\n\"Bůh neomezuje lidi v tom, aby se sami přesvědčili a získali zkušenost se životem nezávislým na něm. Lidské vlády se naopak snaží učinit lidstvo závisle na jejich vládě a omezuje postupně lidem prostor pro svobodné rozhodování a jednání ve všech ohledech. Moderní technologie dnešním vládcům umožňují získávat stále větší kontrolu nad každodenním životem všech lidí.\"\n\nV souvislosti s tou kontrolou mi to přijde pravdivé, když si uvědomíte jaký vliv mají celosvětové firmy jako Google, Facebook - oni defakto kontrolují internet - to, co lidé vidí a ovlivňují veřejné mínění. Podle mě budou jen dál pokračovat snahy politiků tyto firmy ovlivňovat a říkat jim co na internetu smí a nesmí být k nalezení. Ono ale asi nezůstane jen při internetu.\n\nDalší citace:\n\"Ježíš ukazuje Janovi, kam to povede ve Zjevení 13:16-18: ,,A působí, aby všem, malým i velkým, bohatým i chudým, svobodným i otrokům, byl dán cejch na pravou ruku nebo na čelo a aby nikdo nemohl kupovat ani prodávat, leda ten, kdo má cejch\"\n\nv souvislosti s tímto se mi vybavují různé sledovací technologie. V konspiračních teoriích s emluvilo o RFID čipech. Ale možná je tím cejchem myšleno i něco jiného, jako například chytrý mobilní telefon který dnes prostřednictví Googlu a internetových poskytovatelů sleduje vaší aktivitu, polohu, nákupy, navštěvované stránky atd) . Vezměte v potaz social score v Číně:\nhttps://www.abc.net.au/news/2018-09-18/china-social-credit-a-model-citizen-in-a-digital-dictatorship/10200278\n(Leave no dark corner)\nNebo český článek: https://www.lupa.cz/clanky/nekoupite-jizdenku-neporidite-byt-kamery-jsou-vsude-cina-testuje-dystopicke-socialni-skore/",
			"added": 1571580095,
			"parent_topic_uri": "1578843130_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS"
		},
		{
			"topic_id": 1576863840,
			"title": "Klimatická změna / Globální oteplování",
			"body": "https://faktaoklimatu.cz",
			"added": 1576863811
		},
		{
			"topic_id": 1578843130,
			"title": "Psychologie, rozvoj osobnosti, náboženství",
			"body": "",
			"added": 1578843099,
			"type": "group"
		},
		{
			"topic_id": 1578843387,
			"title": "Cíle a motivace",
			"body": "Diskuzní téma cíle/sny, motivace",
			"added": 1578843354,
			"parent_topic_uri": "1578843130_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS"
		},
		{
			"topic_id": 1578843609,
			"title": "Strach a podobné emoce",
			"body": "Diskuzní téma ohledně strachu, obav, nervozity - jak je překonávat.",
			"added": 1578843575,
			"parent_topic_uri": "1578843130_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS"
		},
		{
			"topic_id": 1578843653,
			"title": "Výchova dětí",
			"body": "diskuze na téma výchovy dětí",
			"added": 1578843618,
			"parent_topic_uri": "1578843130_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS"
		},
		{
			"topic_id": 1578848017,
			"title": "Software a hardware",
			"body": "Diskuzní sekce k počítačovému HW a SW. Přihlašte se k odběru nebo založe nové diskuzní téma.",
			"added": 1578847981,
			"type": "group"
		},
		{
			"topic_id": 1579601293,
			"title": "Životní prostředí",
			"body": "Diskuze k tomuto tématu. Sledujte pokud Vás zajímá.\n\nPodobné: [Klimatická změna / Globální oteplování](https://www.oliverwyman.com/our-expertise/insights/2020/jan/globalrisks2020.html)",
			"added": 1579601256
		},
		{
			"topic_id": 1581331545,
			"title": "co vás pobavilo",
			"body": "pobavilo vás něco?",
			"added": 1581331507
		},
		{
			"topic_id": 1581418894,
			"title": "Vytápění, topení - diskuze",
			"body": "Diskuze ohledně vytápění",
			"added": 1581418855
		},
		{
			"topic_id": 1585906419,
			"title": "Bydlení",
			"body": "...",
			"added": 1585906379
		},
		{
			"topic_id": 1599491498,
			"title": "Video stříhání a video koláž nejrychleji? - jaké programy pro editaci",
			"body": "Dobrý den,\n\nkdyž dívám na nějaký film, seriál a nějaká scéna mě tam zaujme, rád bych si ji nějak rychle vystřihl a následně ty scény z různých filmů pospojoval (filmové soubory mohou mít různý datový tok a rozměry..)\n\njak nejjednodušeji to udělat pokud možno zdarma, je nějaký postup?\n\n\nZajímavý SW by mohl být:\n**LosslessCut** - dokáže vystřihnout scény a bez rekodování je uložit na disk jako samostatná videa a nebo je spojit do jednoho videa. Takto získané fragmenty z více filmů, videí jde pak znovu spojit do jednoho (klik na menu Tools / Merge files). Nevýhodou je že takto střihané scény mohou být střižené o +/- několik sekund jinak, viz. [toto issue](https://github.com/mifi/lossless-cut/issues/126).\n**XMedia Recode** - nejdřív jsem tento zdánlivě složitý bezplatný SW ignoroval, ale zjistil jsem že je dost užitečný. Umí konverzi s nastavneím různých detailních parametrů, včetně změny poměru stran, ořezu stran a výřezu začátku a konce videa. Bohužel zatím nevím jestli umí vyříznout několik scén, spíše asi ne.\n**Freemake Video Converter** - tento freemium SW je celkem otravný a skoro nic neumí dokud nemáte licenční klíč, ten jde získat [pomocí keygenu](https://www.ecosia.org/search?q=38101fb11329368bccce24f5bc39e7474b27ca7b) (což není moc snadné, zejména pro anglicky nemluvícího), pak je to jednoduchý a pohodlný střihač s konverzí do různých video formátů. Nevýhodou oproti LosslessCut je že všechno rekoduje a tím žere zbytečně procesor a snižuje kvalitu videa.\n**Avidemux** - http://www.techsupportalert.com/content/best-free-software-cut-split-or-merge-video-files.htm#Avidemux2.5.6 - [download](http://avidemux.sourceforge.net/download.html) + [QTA](http://www.filehippo.com/download_quicktime_alternative/2615)\n**MPEG StreamClip** - http://ds106.us/handbook/tools/trimming-combining-mpegstreamclip/ - [download](http://www.squared5.com/svideo/mpeg-streamclip-win.html)",
			"added": 1599491457
		},
		{
			"topic_id": 1630594171,
			"title": "Jak sdílet a stahovat filmy, seriály, hudbu anonymně?",
			"body": "=== O čem je článek: === \nPokud Vám přijde škoda že k vaší knihovně filmů, seriálů hudby máte přístup pouze vy a vlastně sledujete jen zanedbatelnou část a zbytek leží ladem, možná budete hledat možnosti jak se o data podělit s druhými a jak sami získat nové filmy a seriály od druhých. Za účelem sdílení počítačových souborů byly vytvořeny video weby typu Youtube a také řada počítačových programů/sítí. V tomto článku si povíme o těch programech/sítích, které mají přívlastek P2P, což je zkratka anglického Peer To Peer, což v češtině znamená že data si posílají uživatelé (peeři) přímo mezi sebou a ne zprostředkovaně přes webové úložiště typu https://uloz.to , https://fastshare.cz. Tento článek popíše možnosti sdílení souborů pomocí zmíněných P2P sítí. Berte na vědomí, že tento článek rozhodně nevybízí nikoho k ilegálnímu sdílení dat, takovou činnost provádíte na vlastní riziko.\n\n=== Anonymita/VPN a bezpečnost === \nPočítačoví piráti, lidé kteří mají zájem o soukromí, anonymitu a ochranu jejich dat přenášených přes internet se k síti připojují přes počítač (tzv. proxy server nebo VPN), jde o pronajatou službu a nebo jimi na míru nastavený počítač pronajatý např. v cizině u firmy, která je známá že dbá o soukromý svých zákazníků, napadá mě například 1984.is, flokinet.is, prq.se, protonvpn.com, privacytools.io. Při použití takového proxy serveru se stane to, že datový provoz je zašifrován na Vašem počítači VPN aplikací a dále putuje internetem k proxy serveru, který data dešifruje a přepošle k cíli, např. k webové stránce a nebo jinému P2P uživateli. Znamená to, že:\n1. data jsou po cestě k/od serveru v cizině zabezpečena a poskytovatel internetu ani nikdo jiný v ČR neví o jaká data jde a co je jejich skutečný cíl (proxy server to není, ten je jen prostředníkem při komunikaci).\n2. internetové stránky a uživatelé se kterými probíhá datový provoz znají adresu proxy serveru, ne skutečnou adresu vaší internetové přípojky k internetu (určitá anonymizace)\n3. díky proxy serveru můžete obejít omezení vašeho routeru a zajistit si plně otevřené/přesměrované porty což je při P2P sdílení velká výhoda. Mnoho VPN služeb toto neumožňuje, je potřeba se zeptat, anglicky \"port forwarding\", např. [AirVPN to umí](https://airvpn.org/faq/port_forwarding/). V případě vlastního serveru funguje přesměrování vždy po tom, co si to sami nastavíte https://internetlifeforum.com/linux-forums/15410-installing-wireguard-linux/\nDále může být vhodné mít ještě druhý server v jiném místě a tento použít jako proxy (SOCKS5, https://internetlifeforum.com/linux-forums/16806-how-i-setup-v2ray-shadowsocks-proxy-linux-server-centos-client-manjaro-arch/ ) pro váš internetový prohlížeč a případně e-mailový klient. Tímto oddělíte aktivitu prohlížení webu a aktivitu ostatních aplikací včetně P2P.\nProvoz VPN serveru stojí přibližně 70-120 Kč měsíčně a pokud máte zájem o ještě lepší ochranu, můžete pro anonymizaci svého nákupu použít Tor browser (https://torproject.org) a zaplatit kryptoměnou získanou opět anonymně převodem přes coinjoin/coin mixing službu.\nPo zabezpečení internetové komunikace je vhodné i zabezpečit data na disku vašeho počítače, zejména systémový disk s dokumenty a podobně. Známý program který umí šifrování celého systémového disku je VeraCrypt.\nPokud máte zájem, aby vám někdo zařídil VPN včetně otevření portů, kontaktujte [url=https://instantcpanelhosting.com/]icph[/url], platba roční.\n\n===  Programy pro sdílení filmů,seriálů,hudby atd.: === \nPo výše uvedeném zabezpečení počítače i internetové komunikace je možné přistoupit k instalaci programů pro sdílení dat. Mezi nejznámější sítě pro P2P sdílení patří následující, řazeno subjektivně podle počtu sdílených souborů a českých uživatelů:\n\nBitTorrent\nMezi nejlepší SW/klienty sítě bittorrent patří https://qBittorrent.org který má otevřený kód (open source) a je vyvíjen dobrovolníky. Umí češtinu a vyhledávání dat na řadě anglických vyhledávačů.\nV česku máme několik bittorrent komunit z nichž největší jsou uvedené zde https://ceskeforum.com/viewtopic.php?f=6&t=6\n\nDirectConnect (DC)\nZnámými DC klienty s otevřeným kódem jsou EiskaltDC https://github.com/eiskaltdcpp/eiskaltdcpp/ , ApexDC, CZDC++. Po spuštění programu se připojíte k hubům - serverům které mají v evidenci i další uživatele a jimi sdílené soubory. Je zde vyhledávání souborů, stahování a chat.\nBližší informace k DC: https://ceskeforum.com/viewtopic.php?f=6&t=7654\n\neDonkey a Gnutella\nDalší velká síť P2P sdílení, známými klienty této sítě jsou programy s otevřeným kódem: Shareaza http://shareaza.sourceforge.net/ , aMule https://sourceforge.net/projects/amule/ , GTK-Gnutella https://sourceforge.net/projects/gtk-gnutella/\n\nSoulseek\nasi nejlepší P2P síť pro sdílení hudby, najdete tu prakticky vše, zejména ze světové tvorby. Klientem této sítě je Soulseek a Nicotine https://github.com/Nicotine-Plus/nicotine-plus\n\nMuWire\nVelmi malá síť s pomalým ale bezpečným a anonymním přenosem dat. U této sítě ani nemusíte mít proxy/VPN. Čechů, kteří jí používají bude asi méně jak 10. https://github.com/zlatinb/muwire/\n\nTribler\nJde o Bittorrent klient s vestavěnou anonymizací datových přenosů, opět by nemělo být potřeba používat vlastní proxy jelikož proxy jsou řešené interně - toto řešení opět snižuje datovou propustnost podobně jako u Muwire. Program je otevřený - vyvíjen univerzitou a dobrovolníky, nemá zatím tolik funkcí jako zmíněný qBittorrent (který ale nemá vestavěnou anonymizaci). https://www.tribler.org\n\n===  Pravidla P2P === :\n- sdílej minimálně tolik dat kolik si od ostatních dobrovolníků stáhneš (nebuď pijavice)\n\nNašli jste nepřesnosti a nebo vám tu něco chybí, máte nápad na vylepšení? Určitě okomentujte.",
			"added": 1630594129,
			"modified": 1630918468
		},
		{
			"topic_id": 1631015138,
			"title": "test",
			"body": "test",
			"added": 1631015094,
			"parent_topic_uri": "1631015101_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS"
		},
		{
			"topic_id": 1637703143,
			"title": "Konspirační teorie",
			"body": "Co to je konspirační teorie? Je to tvrzení, že za významnými a tragickými událostmi ve světě stojí vlivné a nebezpečné skupiny nebo spolky.\n\nProč jsou tyto teorie nebezpečné? Konspirační teorie můžou podkopávat důvěru v oficiální zdroje informací. Někteří lidé se pak na jejich základě odmítají řídit zdravotními a bezpečnostními doporučeními. Tyto teorie v lidech probouzí předsudky a nesnášenlivost vůči těm, kdo jsou údajně součástí spiknutí.\n\nUjistěte se, že obsah sdělení je aktuální a přesný. Dívejte se, kdy zpráva vyšla, jestli obsahuje ověřitelná fakta a jestli tvrzení v ní jsou dobře podložená. Buďte zvlášť opatrní, když se zdá, že složitý problém se podává až příliš jednoduše nebo když má zpráva vyvolat silné emoce.\n\nPřevzato z článku https://www.jw.org/cs/co-rika-bible/vnitrni-klid-stesti/konspiracni-teorie-dezinformace/",
			"added": 1637703098,
			"modified": 1637703201
		},
		{
			"topic_id": 1637750556,
			"title": "Vakcinace",
			"body": "\"Antivakcinační dogma je živené iracionalitou a absencí společenské zodpovědnosti, někdo méně diplomatický by možná použil slova tmářství a sobectví.\"\n\nŠtěpán Votoček, ředitel Nemocnice Slaný\n\nzdroj: https://www.seznamzpravy.cz/clanek/koronavirus-vanoce-co-to-je-lekari-a-sestry-uz-pro-pochopeni-neockovanych-nemaji-silu-181366",
			"added": 1637750510
		}
	],
	"topic_vote": {
		"1566752809_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"1567360086_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"1567677765_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"1568462342_1K4xSWqBipeYy6Ve3HzvXujKn34ZMtfXou": 1,
		"1570012969_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"1632645097_19TrKZA9ifR8bvPbL64AbNqttCDkWfErWF": 1
	},
	"next_comment_id": 92,
	"comment": {
		"1518516153_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "> [deafboy](#comment_1_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa): A aby sme trochu rozprúdili debatu, hneď prvý komentár je od slováka. 😎\n\nAhoj, mohl jsem to pojmenovat česko-slovenské, to mě nenapadlo :-S Samozřejmě toto fórum je pro všechny, kteří rozumí a píší česky a slovensky. Může sem psát úplně každý a cokoliv chce :)",
				"added": 1519112865
			},
			{
				"comment_id": 9,
				"body": "> [peerco](#comment_1_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): Ja jen slusne pozdravim a od kud jsem ponecham polovicni anonymite. Hlavne abych byl slusny.\n\nahoj, jsem rád že se tu po dlouhé době objevil další čech/slovák 😃. pokud máte nějaká témata k diskuzi, tak zakládejte 👍 mě to hodí upozornění na [ZeroHello](/), tak bych měl obvykle odpovědět během 24 hod. apod.",
				"added": 1566668053
			},
			{
				"comment_id": 11,
				"body": "@peerco jj no zeronet je dost necenzurovaný a člověk může těžko předejít tomu že bude mít na počítači texty a nebo obrázky/videa která jsou v česku nelegální.. také když sem někoho pozveš, tak holt může dojít k tomu, že se podívá třeba na ZeroMe a tam zrovna někdo dá nějaké porno nebo tak. Takže sranda. No lidé používají v zeronetu Tor, čímž anonymizují svou identitu, jak píšeš v [druhém svém tématu](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1566752809_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi). Výsledek je ten, ",
				"added": 1566767134
			},
			{
				"comment_id": 16,
				"body": "> pokud tu budeme komunikovat zaklicovane\n> ci si zaklicovane vymenovat urcita data spolu s beznymi daty\n> tak nikdo nezjisti co se vlastne za data vymenovali a nikdy nebudou mit duvod danou identitu zcenzurovat\njj ta šifrovaná komunikace aniž by někdo nepovolaný zjistil co je komunikováno to by mělo jít v podobě textu na [zeromail](/1MaiL5gfBM1cyb4a8e3iiL8L5gXmoAJu27/) stránce a na [0pastebin](/131DjP88RMUo5v5twZDkD39wECdWZxzLtm/) - je tam možnost jakéhosi šifrování. Jinak také jde vytvořit novou zeronet stránku a sdílet její adresu bezpečně (třeba přes zeromail) s jiným uživatelem a ostatní uživatelé nezjistí že tato adresa existuje a komunikace by měla probíhat jen mezi těmito 2 peery (je otázka zda se propojí, budou na sebe vidět). Pak jde obsah stránky včetně nasdílených souborů smazat.\nJinak mimochodem zeronet používá i pro komunikaci mezi peery TLS aby data nebyla v čitelné podobě. Je ale bezpečnější používat VPN pro šifrování datového přenosu aby nikdo nepovolaný nevěděl co je přenášeno. Nebo použít Tor který kromě šifrování i anonymizuje.\n\n> pres cenzuru te autorske userid\nto je zajímavý nápad jak by mohlo jít cenzurovat, nevím jak to přesně myslíš, jestli jako že vláda nebo internetový poskytovatel by cenzuroval a nebo jestli majitel dané zeronettové stránky (ten to může cenzurovat co je mu libo) ale snad jako jediný způsob jak by mohla třeba vláda cenzurovat díky tomu, jak funguje zeroid.bit mě nepadá kdyby šli za majitelem stránky zeroid.bit (je známo kdo to je) a donutili ho aby určitého uživatele vymazal z databáze. Nevím ale jestli to takto jde, je možné že ne. Nevím jak zeronet pracuje jestli je kontaktována zeroid databáze když chci postnout na libovolné zeronet stránce pomocí zeroid uživ. jména.",
				"added": 1566817208
			},
			{
				"comment_id": 18,
				"body": "> Moznost zjisteni ZeroMail adresy a taky zjisteni ZeroID.\n> Prave pro poskytovatele techto sluzeb je dana a tim padem i pro jeho vyderace.\nTohle jsi napsal dost ve zkratce, nevím co máš na mysli tím zjištěním, v jakých souvislostech. A poskytovatelem služeb máš na mysli majitele zeronet stránky?\n\n> To TLS mezi peery ale nemaskuje viditelne Metadata.\npak je vhodné použít VPN a nebo Tor (zapnout na zeronet stránce [ZeroHello](/)) a nebo kombinaci. Souhlasím, že uživatel by měl být upozorněn na vhodnost si Tor zapnout z důvodu anonymizace/šifrování..\n\n> Skupina se domluvi, ze na to odpovidat jiny clovek nez ten komu zprava byla urcena a bude to pouzivat on pro posilani jeho zpravy opet pro jeho protesek. ... Nevim jestli si me myslence a tomuto modelu puchopil.\n> nekdo vysle zpravu mailinglistu, ve kterem danou zpravu jenom jeden jediny clovek muze precist a ostatni ne. A tak ani nikdo v tom listu nevi, komu byla zprava urcena.\n\nmoc si nedokážu představit nějakou implementaci takového řešení, nejsem také programátor. Rozumím tomu tak, že někdo odešle nějakou šifru skupině lidí, ale jen jeden si s ní dokáže poradit, jelikož zná klíč. možná že to je podobné jako funkce zeromailu nebo ta šifrovací funkce u [0pastebin](/131DjP88RMUo5v5twZDkD39wECdWZxzLtm/)u - u toho zeromailu ale říkáš že to není tak bezpečné (sdílení dat i když jsou šifrovaná), jelikož majitel je znám (Tamas Cocsis - nynější vývojář ZN) a někdo ho může přinutit aby dal klíč.. (Nerozumím tomu natolik abych řekl jestli skutečně člověk s klíčem ke stránce zeromail může dešifrovat mailovou komunikaci.)\n\nPS: téma se vymklo kontrole (offtopic), tak jsem ho přejmenoval a dal 2 rady pro nováčky na zeronetu - pokud bys měl nějaké nápady k tomu tak sem s nimi 😃",
				"added": 1566897217
			},
			{
				"comment_id": 19,
				"body": "> bohuzel povinnost ... a sice mit vytvorenou identutu ZeroID protoze jen za pomoci teto identity,\nnení to povinnost. na zeronetu se používá vícero ID autorit některé jsou generovány přímo na stránce (např. anonymní ID [millchan](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/)).\nJe pravda, že stránky které vyrobil a vlastní vývojář zeronetu podporují obvykle jen jeho zeroid.bit. Jeho stárnky ale nejsou jediné (i když jsou jedny z nejnavštěvovanějších). Lidé mohou tvořit vlastní stránky a nebo jeho stránky klonovat a přidat do svých klonů [další ID autority](/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1517337097_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/How+to+add+new+login+ID+providers+into+ZeroTalk+clone)\n\n> donucen k zablokovani urcite ZeroID ... a tak znemoznit cokoliv co se na tuto ZeroID vaze\nTy si myslíš, že existující zeroid identity kontaktují zeroid.bit než je jim dovoleno vložit příspěvek na nějakou stránku? Já o tom trochu pochybuji. Ale toto co popisuješ není konečná, jelikož pokud uživatel zjistí, že mu nejde přidávat další obsah (starý zůstává, je pod kontrolou dané zeronetové stránky), tak si založí novou identitu (i když je to teď dost krkolomné pro nováčka) a může na určitých stránkách použít i jinou ID autoritu pokud to stránka dovolí.\n\n> to by vedlo k postupnemu zniceni dat vazanych na tuto identitu\n> protoze ZeroID urcuje co se s daty na tuto ZeroID vazanymi stane\nne, nemyslím si, že zeronet má naprogramovaný mechanismus, který by zajistil, že změnou (např. vymazáním identity) na zeroid.bit stránce (vynucenou třeba soudem) dojde k tomu, že\na) budou jakýmsi způsobem nalezeny všechny zeronetové stránky (nelze), které dostanou příkaz smazat všechna data tohoto uživatele\nb) peeři kteří se k zeroid.bit připojí dostanou odpověď: prohledej všechny zeronetové stránky které hostuješ a smaž z nich uživatele xy a jeho obsah.\nTakovou cenzorní věc by tam developer nedal. To by šlo proti jeho filozofii s kterou zeronet dělal. Nebo jsi v kódu takovou funkci našel?\n\n> neni mozne ze vsech techto duvodu danou ZeroID utajit\njá třeba nemám problém s tím když přidám nějaký komentář, tak lidi ví, že se váže k ssdifnskdjfnsdjk@zeroid.bit\n\n> I2P ... neexistuje zadna identita (WoT..\njak vlastně se tam brání proti SPAM, to nejde zablokovat uživatele (nemá žádný identifikátor, ID)?\nJak jsem psal, ZN podporuje anonymní self-signed ID (např. millchan) a u zeroid je potřeba si jí zaregistrovat asi přes [Tor browser](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/faq/#how-to-use-zeronet-with-the-tor-browser) - souhlasím, že identity by měly být decentralizované a tato není. Ale třeba Kaffie.bit je a Kxoid.bit jde (šel) tím směrem.",
				"added": 1566992998
			},
			{
				"comment_id": 20,
				"body": "@peerco\n> clovek je stale v ruouch treti strany, kterou ani nezna\nno tady si myslím, že to není závažný problém, kvůli tomu co jsem zmínil - že millchan ani zeroid nemá podle toho co jsem psal možnost ta moje data uložená na jiné zeronetové stránce (jejíž obsah je pod kontrolou někoho jiného) ovlivnit. Co se podle mě může stát je jen to, že majitel určité stránky se rozhodne že já nebo všichni uživatelé určité identity nebudou dále povoleni na té jeho stránce a tím ztratí možnost upravovat tam své příspěvky a přidávat nové. Samozřejmě majitel stránky (nebo ten komu dá klíč - private_key) má právo smazat jakýkoliv obsah ze své stránky.\n\n> ja ale chapu ale zrejme smysl proc tomu tu tak je\n> abe se clovek mohl okamzite branit pred jakoukoliv identitou at uz uzivatelskou a nebo strankovou\npodle mého pochopení je nějaké ID/identifikátor potřeba k tomu aby třeba admin stránky mohl pracovat s uživatelovým obsahem. Nějak si nedovedu představit jaký zmatek by byl kdyby pak přišel nějaký spamovací robot a nebylo by nějak možné spárovat jeho příspěvky a hromadně je smazat - tady ale asi fantazíruju a asi jsou možnosti jak se bránit spamu i v takovém případě.\n\n> tech kombinaci je strasne moc ktery by nekdo musel prozkouset aby na ty identity vubec prisel\nto mi připomíná zeronet stránky. Jelikož když vytvořím stránku a neřeknu ti její adresu, tak ty ani nikdo jiný nepřijde na to, že existuje (pokud asi nezvolím \"Sign and publish\" což by MOŽNÁ kontaktovalo tracker a tam už nevím která informace by mu byla odeslána a zda by to nešlo zjistit). Zeronet nemá žádný povinný registr všech stránek.\n\n> coz je ale rozdil oproti freenetu\n> protoze tu je kazdy tranzitovy bod zakodovanym ulozistem dat...\n> tak se do tranziru schova spousta zakodovanych dat a nikdo nemuze sjisti jaka a zaroven taky mezi kym\njj to vypadá lépe než zde",
				"added": 1567022674
			},
			{
				"comment_id": 28,
				"body": "> [peerco](#comment_44_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): Tu se daji nevedome sirit data jenom pokud se schovaji do neceho co se vedome siri. ... pokud si nekdo nacte jen zahladni stranku, tim padem jen zakladni adresar, neni automaticky siritelem i tech podadresaru\n\njj, jak píšeš, když majitel stránky nahraje někam do podadresářů své stránky třeba ilegální obrázky, a nenastaví tomu adresáři nebo těm konkrétním obrázkům atribut [optional_file v souboru content.json](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/content_json/#optional), tak návštěvníkovi se tyto soubory stáhnou (aniž by je musel vidět načtené někde na stránce) a začne je šířit :-/ bohužel, zatím nikdo nenaprogramoval/nevymyslel jak třeba vypnout sdílení souborů, které návtěvník neviděl apod. Proto je dobrý asi používat anonymizaci Tor (nahoře na stránce [ZeroHello](/), čímž člověk skryje skutečnou IP když zeronet nahrává soubory jiným lidem.",
				"added": 1567359001
			}
		],
		"1520894284_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "**Anonymizace Bitcoin platby**\n\nKdyž si zagooglíte, zjistíte, že Bitcoin platby nejsou anonymní. Lze v indexu plateb (blockchain) dohledávat tok peněz a někdy se \"prokecne\" komu která bitcoin peněženka patří. Neznám to tedy do detailu, ale někdo Bitcoin \"pere\" přes služby, které bitcoiny zamíchají aby nešlo zjistit odkud výstupní peníze pochází. Pokud chce člověk odeslat skutečně anonymně, je potřeba navíc mít založenou a přistupovanou bitcoin peněženku třeba přes Tor browser.\n\nZde jsou některé z bitcoin anonymizačních služeb (bitcoin mixery):\n\nhttps://coinmixer.se\nhttps://privcoin.io\nhttps://cryptomixer.io\nhttps://bitcoinmix.org\nhttps://chipmixer.com\n\npřed použitím si vygooglete recenze: review domena.tld\nněkteré mají i negativní recenze ale myslím, že to jsou fake protože na bitcointalk.org mají výše uvedené weby v době kdy toto píši (3/2018) recenze pozitivní.",
				"added": 1520894314
			},
			{
				"comment_id": 3,
				"body": "Já mám Bitcoiny na online peněžence https://blockchain.info\nDo ČR si je posílám přes peněženku https://Kraken.com\nPak mám ještě Monero a Ethereum. Počítám že Bitcoin snad nezanikne a jeho cena tedy bude spíše zvolna stoupat nad $10,000/BTC",
				"added": 1520894479
			},
			{
				"comment_id": 5,
				"body": "**Bitcoin, elektřina a ekologie**\n\nObjevují se zvěsti o tom jak je Bitcoin energeticky náročný a že to není ekologicky vhodné platidlo. Někdo ale tvrdí, že většina elektřiny kterou Bitcoin spotřebuje pochází z obnovitelných zdrojů, [info](/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ/1543613801) - \"we can then reasonably estimate that 43.2% of global Bitcoin mining is powered by renewables in Sichuan\"\n\n[Jinde vědci zjsitili](https://www.theguardian.com/global-development/2016/nov/14/hydroelectric-dams-emit-billion-tonnes-greenhouse-gas-methane-study-climate-change), že přehrady u hydro-elektráren produkují velké množství metanu (skleníkový plyn)",
				"added": 1543666765
			}
		],
		"1541781829_1JXEx2bUj15sKBpTnchEPMXQdKSy5LyPWW": [
			{
				"comment_id": 4,
				"body": "ano",
				"added": 1542923325
			}
		],
		"1545063530_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 6,
				"body": "mám dojem, že to souvisí s tím, že to může obsahovat takzvaná zadní vrátka která umožní sledování komunikace",
				"added": 1545063621
			}
		],
		"1553189887_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 7,
				"body": "Jestli v životě najdete cestu bez překážek, určitě nikam nevede. A.C.Clarke",
				"added": 1553189946
			},
			{
				"comment_id": 64,
				"body": "„Bojovník není o dokonalosti, nebo vítězství, nebo nedotknutelnosti, je o naprosté zranitelnosti, – to je jediná skutečná odvaha.“",
				"added": 1575483834
			}
		],
		"1560258680_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 8,
				"body": "\"Více než opice, ale méně než člověk. Tak vnímají řidiči aut cyklisty, zjistili vědci\" Více na: https://www.euro.cz/byznys/revoluce-u-pumpy-shell-veri-elektromobilum-1450849#topic-1930\n\\#LidskaBlbostNeznaMezi",
				"added": 1560258756
			}
		],
		"1566669069_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 10,
				"body": "to je zajímavý, škoda že to tedy nemůže fungovat decentralizovaně tento \"registrátor\" domén. Takže registrace závisí na nějakém clearnet serveru, který si pronajímá nějaký smrtelník? A když se server neprodlouží, tak přestanou fungovat i již existující domény? u .bit domény projdou po nějakém měsíci ale fungují i dál (dokud je někdo neregistruje a nepřesměruje na jinou zeronet adresu).. @peerco prosím piš v češtině/slovenštině tady na českém fóru pokud možno",
				"added": 1566674396
			}
		],
		"1566752809_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 12,
				"body": "Jj, na stránce [Zerohello](/) je nahoře tlačítko Tor kde se dá zapnout Tor for all connections. To znamená, že lidé, kteří ode mě získají nějaký obsah (třeba i ilegální, chráněný autorským právem), tak nevědí mojí skutečnou IP ale anonymní adresu .onion\n\n> [peerco](#comment_10_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): edit tu bohuzel neni\n\nkdyž najedeš myší na text svého příspěvku, tak by se měla nalevo na okraji textu zobrazit tužka (je hodně špatně vidět). Asi by to chtělo vylepšit. Já bych to i udělal, ale při upgrade stránky se to zase vymaže ta změna.. Vývoj ZeroTalk jde dost pomalu. https://github.com/HelloZeroNet/ZeroTalk/issues",
				"added": 1566767365
			},
			{
				"comment_id": 17,
				"body": "> Tor ... Spousta lidi si to ale nezapnout a taky slysivam, ze jim to nejde ani sprovoznit a tak pak jedou bez.\njo, bylo by pěkné kdyby třeba při prvním spuštění zeronetu se zobrazilo okno kde by byl člověk informován o tomto a měl v něm možnost zapnout Tor, vypnout sdílení mediálních souborů, nastavit limit zeronetového úložiště apod.\nMožná by bylo dobré takový nápad dát na github zeronetu, ale nevidím to jako pravděpodobné, že by to správce zeronetu naprogramoval, asi by to musel udělat někdo jiný..\n\n> Strasne se siri porno na beznych strankach\ntohle mi přijde jako přehánění. můžeš uvést adresu/y nepornografické stránky které evidentně takto skrývají porno? Já bych to dal případně do [blacklistu pornografie](/13CgSQeywg2ius5pjXVCk7dKUCRkz5xvW3/)\n\n> nahodna prohlidka\nNáhodné prohlídky (od policie) v ČR nejsou. To by museli mít soudní \"povolení\" a to si nemyslím že by získali jen tak. Na výslechu mi policista řekl něco ve smyslu, že soudní \"povolení\"(nevím jestli je to správné slovo) by získali pokud by šlo o vraždu, terorismus nebo podobnou závažnost.\n\n> a ten clovek dostane problem a ani nebude vedet jak k tomu problemu prisel\nto už jsem psal, že je vhodné disk mít šifrovaný a používat VPN + Tor. A souhlasím, že by asi měl být zeronet uživatel varován že je vhodné použít Tor (kvůli anonymizaci) a o dalších případných rizicích.\n\nJj o tom klíčování už jsem psal v [druhém tématu](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1518516153_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS)",
				"added": 1566822713
			}
		],
		"1566677697_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 13,
				"body": "@peerco\n> existence jakekoliv identity neni v ZeroNet utajena ale nachazi se v databance ZeroNet uzivatelu a tak je taky na narizeni ruznych statu cenzurovatelna\nTady si nejsem jistý jak to myslíš, ale já tomu rozumím tak, že pokud už má do zeronetu nějaký vhled, tak ví, že se mu na počítač stahují datové .json soubory, které zobrazují data o tom jaký text uživatelé na stránku přidali. To jsou tedy veřejné informace. Podobné je to na internetu (clearnet), kde tkaé člověk může dohledat příspěvky od určitého uživatele. Ale podle toho, co vím cenzura by neměla být možná. Cenzura je možná pouze pokud ji autorizuje sám majitel stránky a nebo ten komu majitel stránky svěřil tajný klíč ke stránce \"private_key\" (?) no ale jak může nějaká vláda nebo někdo vlivný zjistit jakou má IP adresu majitel stránky? To pokud vím ještě nikdo neprokázal že lze spárovat uživatel s IP adresou. Navíc lidé používají Tor, takže ani IP nemusí být vidět a znají jen anonymní .onion adresu..\n\n> Bezpecna souktoma sfera neznamych identit, to znamena identit o kterych nikdo v dane siti nevi\nano, toto zatím zeronet nepodporuje a nevím že by na githubu někdo něco takového tvořil.",
				"added": 1566768461
			},
			{
				"comment_id": 15,
				"body": "Chápu. Máš pravdu, že zeronetové stránky mohou ukrývat obsah, o kterém běžný návštěvní neví pokud opravdu neotevře adresář webu na svém PC a neprohledá ho.\n\n> protoze takova data s pornem prave s podobnych stranek dostanou na pocitac a to nezaklicovane\njj. možná by měl někdo vymyslet jak by měl zeronet uživatele upozornit na toto riziko a nabídnout třeba možnost nestahovat žádné obrázky, nebo vypnout kompletně odesílání dat a jen stahovat (režim pijavice - leech ;)\nuž tu byly takové nápady, ale správce zeronetu má moc práce:\nhttps://github.com/HelloZeroNet/ZeroNet/issues/2138\na není moc lidí, kteří by s vývojem pomáhali.\nJinak tenhle **problém o kterém píšeme jde alespoň trochu zmírnit** tak, že si člověk zapne na ZeroHello anonymizační síť Tor (nahoře na stránce ZeroHello je tlačítko Tor / Enable tor for all connections) -> pak i když nahraju policajtovi (v česku prý nemohou podle zákona aktivně hledat provinilce proti zákonu tak jako třeba v USA?) nějaký ilegální soubor, tak nezná mojí IP adresu (pomocí které by zjistili kdo jsem). Při zapnutém TORu peeři jen vidí anonymní .onion adresy ([/Stats](/Stats))\n\n> nezaklicovane\njj to je další věc, uživatel zeronetu by měl mít adresář zeronetu na šifrovaném disku. Já třeba používám VeraCrytpt, který funguje jak na Windows tak i na Linuxu.\n\nDalší úrovní [anonymizace](/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1517258702_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/What+is+the+good+setup+for+anonymous+secure+internet+usage) je používat [VPN](/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1548340010_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/How+to+setup+private+OpenVPN+on+a+Linux+server+and+Windows+Android+client) čímž člověk zajistí že i bez Toru nebudou ostatní znát jeho skutečnou IP.\n\n> ale musi byt pro vsechny ty pridavne prenasene informace zaklicovane\n> a jen prijemce pro ktere jsou takova data urcena si je muze odklicovat a precist\njo máš asi na mysli jestli chápu správně, že tu teď na ZN není možnost sdílet bezpečně (šifrovaně) data mezi 2 osobami bez toho aby si ta data mohli stáhnout jiní zeronet peeři? To by snad mělo být možno třeba v podobě textu na zeromail stránce a na [0pastebin](http://127.0.0.1:43110/131DjP88RMUo5v5twZDkD39wECdWZxzLtm/) - je tam možnost jakéhosi šifrování.",
				"added": 1566816313
			},
			{
				"comment_id": 50,
				"body": "je to zajímavé, nevěděl jsem že něco takového jde (ZN přes I2P/Freenet). Já bych to asi nevyužil, protože Toru docela věřím (že mně anonymizuje) a pokud jde spojení mimo Tor, tak stejnak jsem za [VPN serverem](/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1548340010_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/How+to+setup+private+OpenVPN+on+a+Linux+server+and+Windows+Android+client), kterému také věřím, protože to je mnou spravovaný Linux server v dobrém datovém centru mimo zemi kde žiju.",
				"added": 1568027329
			},
			{
				"comment_id": 53,
				"body": "> [peerco](#comment_109_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): To, ze je neco otevreny zdrojovy kod, kam se asi tezko dostane neco co by nikdo nespozoroval, jeste dlouho neznamena, ze nejsou schovane viceucelove techniky. \n\nChápu, že je možné do kódu zanést úmyslné chyby, které pak zapříčiní to, že třeba anonymita uživatelů je narušena. Ale zase si myslím, že toto může potkat více méně jakýkoliv software. No asi máš pravdu, že u toho Toru, který byl (a snad i ještě je) podporován vládou USA může být nejedna zájmová skupina snahu tam protlačit kód, který by anonymitu narušil. Stejnak ale když jedu přes nějaké důvěryhodné VPN (jak jsem psal o příspěvek níže), tak bych měl mít více méně pokoj mysli protože by zjistili akortát IP toho mýho VPN serveru, který jsem [anonymně zřídil](/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1517258702_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/What+is+the+good+setup+for+anonymous+secure+internet+usage). Vím, že pak jsou nějaké taktiky, které díky nedostatkům v prohlížeči mohou nějaké citlivé informace přenést, ale zase si říkám, že nedělám nic extrémně nelegálního abych se kvůli tomu obtěžoval s prohlížením Zeronetu přes Tor browser...\nKdyby náhodou někdo spároval mojí aktivitu s IP mýho VPN serveru, pak těžko říct zda by získal soudní příkaz k zabavení serveru a zjistil by z něho jakou mám skutečnou IP (logy se mi pravidelně mažou každou minutu, takže by tam možná vůbec nic nenašli pokud by server nesledovali běžící), pak by zjistili mou IP ale co když je ISP který tuto IP mě pronajímá v zemi, kam oni nemají přístup. jak by získali soudní povolení aby zjistili od ISP komu tuto IP pronajímá a povolení na domovní prohlídku? Těžko. Policie toto získává jen u zločinů jako vraždy, terorismus a podobná závažná kriminalita. Navíc můžou zjisti, že je na dané adrese více PC a ty mají šifrované disky ... podezřelý odmítá vypovídat což je jeho právo ... atd. :)",
				"added": 1568049012
			}
		],
		"1566770012_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 14,
				"body": "Zeronet a stávající wiki implementace na zeronetu podle mě ještě nejsou úplně propracované aby umožnily nějak lépe ochránit stránku před spamem a mazáním textu trolly. Je ale možné to udělat i tak, že majitel wiki stránky umožní editovat/přidávat obsah pouze sobě a několika dalším důvěryhodným lidem..(což samozřejmě není zdaleka ideální ale zajistí to, že žádný troll pracně napsaný obsah nesmaže)\nMimochodem je tu i další varianta wiki stránky: [kiwipedia](/1KiwiBCVBUcuypVm8FEmUW9YT6fJDXkN9r/?/wiki/en/home), není zdaleka perfektní a psal jí @Git Center",
				"added": 1566814911
			},
			{
				"comment_id": 22,
				"body": "> [peerco](#comment_27_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): Zatim je to dobre, tak jak ty clanky pises tu. Ale ted je jich jeste pomerne malo.\n> Dobre by bylo, kdyby si mohl udelat separatni a tebou a jen tebou editovatelny prehled v kterem by si organizoval linky na to zde uz tebou napsane.\n\njj, toto mi taky čas od času přijde na mysl. jak udělat aby byly různé užitečné informace na zeronet stránkách (jako zerome, zerotalk, nettalk..) dohledatelné v rostoucí kupě dat které mají malou nebo pomíjivou informační hodnotu...\nAle asi máš spíš na mysli wiki pro české zeronet uživatele. Možná by bylo dobré kdybych tu wiki založil, umožnil přispívání jen sobě a pro ostatní dal link na diskuzní fórum kde by všichni dávali nápady co a jak aktualizovat. Až natáhnu krovky, tak pak lidi budou moci dojít na to diskuzní fórum kde případně někdo dá link na novou, aktualizovanou wiki. Druhá možnost je že wiki by byla pro všechny otevřená a já nebo kdokoliv jiný by jí pravidelně zálohoval aby bylo možné data obnovit kdyby je nějaký troll smazal - tato varianta mi přijde lepší.",
				"added": 1567082882
			}
		],
		"1567068831_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 21,
				"body": "Ahoj, moc jsem nepochopil otázku.\nObecně z mobilu na zeronet se jde dostat přes appku (zastaralá), uživatel @Styromaniac mám dojem ji používá. je na ZeroMe. druhá možnost je jak jsi psal, mít zeronet na počítači (třeba i miniPC jako Rpi) a v internetovém prohlížeči mobilu otevřít jeho adresu, např. http://192.168.2.55 a browsuješ zeronet z mobilu ale skrze počítač, který slouží jako proxy:\nhttp://127.0.0.1:43110/16Go5kc2U9Ff4jeaY8kYiDEgpMYdgyboPY/?Topic:2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/How+to+Install+and+run+Zeronet+on+a+Raspberry+Pi",
				"added": 1567082197
			},
			{
				"comment_id": 25,
				"body": "@peerco:\n> na smazani tech dvou kopii nevidim nic\nnajeď na text svého příspěvku který chceš smazat. V levo se zobrazí tužka, na kterou klikneš a pak máš tlačítko pro smazání..\n> ZeroNet proxy je tam nejake prihlasovani\nZeronet má plugin s názvem UIPassword, nějak tak - [/Plugins](/Plugins)\nAle když jsem to před několika měsíci zkoušel, tak mi to nefungovalo aby se v UI požadovalo heslo. Pak jsem to nějak udělal že jsem povolil jen svojí fixní IP adresu v zeronet.conf a ostatní IP viděli na ZeroHello stránce zákaz vstupu. Na stránce http://127.0.0.1:43110/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1535022026_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS si najdi \"ui_restrict\"\njá myslím že jsem to měl nějak takhle:\nui_restrict =\n1.2.3.4\n5.6.7.8",
				"added": 1567345930
			},
			{
				"comment_id": 26,
				"body": "> [peerco](#comment_40_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): jo a kde se pak nastavuje to heslo?\n\nnení potřeba editovat nějaký soubor v adresáři plugins/UIpassword/ ? nebo zkusit spustit ( na linuxu: python zeronet.py --help) jestli se tam nepíše něco o definování hesla.\n\nJinak jestli nejde vypnout plugin přes web. rozhraní /Plugins, tak to je asi chyba která by se měla nahlásit na githubu",
				"added": 1567350711
			}
		],
		"1567341896_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 23,
				"body": "Na tenhle kodek jsem vůbec nenarazil, to jsem ještě do počítačů \"neviděl\". Těším se ale na AV1\n( [Which high efficiency video codecs are best supported in web browsers?](/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1518945446_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Which+high+efficiency+video+codecs+are+best+supported+in+web+browsers) )\n..kvůli úspoře prostoru na disku a úspoře datového přenosu. Bohužel zatím ještě nevyrábí čipy s jeho podporou. Teď jsou čipy s dekódováním H.265 (HEVC) a ty zdá se ještě ani neumí HW podporu enkodování (nevím jestli je to správný výraz v ČJ). Já právě čekám až bude podpora encodingu AV1 abych do toho mohl převést některá videa H264. Podpora v prohlížečích nic moc: https://caniuse.com/#feat=av1\n\n> ted to tu vidim 3x\njá tu nevidím žádnou duplicitu, ani na indexu stránky. po najetí na text Tvého příspěvku by se měla nalevo zobrazit tužka",
				"added": 1567344778
			}
		],
		"1519057574_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 24,
				"body": "jj, po vytvoření prázdné stránky (viz návod v úvodním příspěvku) se vygeneruje nová adresa a vytvoří se adresář s nějakými základními soubory content.json a index.html, to je asi to minimum co tam musí být..\nTen 10MB limit na stránku je definován zeronetem (a nebo uživatelem, který si ho ručně změní pro danou stránku nebo [všechny stránky](/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1535022026_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS))\n>  --size_limit limit    Default site size limit in MB (default: 10)\njakmile se návštěvníkovi stáhne dost dat a přiblíží se k tomu limitu, zobrazí se dotaz na zvýšení limitu\nUživatel @mg0 s těmi limity má zkušenosti. Mám dojem, že nedoporučuje content.json soubory větší než 10MB.",
				"added": 1567345587
			},
			{
				"comment_id": 29,
				"body": "> v adrese v tom kodu te adresy je pravdepodobne zakodovan i typ objektu (typ toho tmplate neboli typ stranky, jestli jednoduchy typ ci typ s nejakou specialni funkci databanky atd.)\n\nMožná se programátor zeronetu pokouší takto zajistit že se lidem nebude nevědomky stahovat příliš mnoho dat na navštívenou stránku. Ale moc mi to nedává smysl, spíše by bylo snad lepší dovolit všem adminům nastavit libovolný limit a pak by zeronet zobrazoval návštěvníkům dotazy na zvýšení..?\n\nJinak co jsem viděl stránky od top zeronet developerů tak v jejich content.json bylo v \"clonned_from\" uvedena adresa ZeroHello (možná tam není s limitem problém) a také když jsem v minulosti otevřel různé klony [Millchan merger](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:1b5f282e-6a57-4aa4-ae11-8b85dda51509) hubu [/13kifcv8J8noDEXdztXY4qkPPPKLK2PiAe](/13kifcv8J8noDEXdztXY4qkPPPKLK2PiAe/), tak mě překvapilo, že měly právě zvýšený limit snad 100MB jestli se dobře pamatuji. Tyto huby jsou stránky typu \"merger\": https://github.com/HelloZeroNet/ZeroNet/tree/py3/plugins/MergerSite",
				"added": 1567364586
			},
			{
				"comment_id": 31,
				"body": "> [peerco](#comment_45_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): kdyz si udelam z neceho nekolik klonu\n> pak vse pomazu, bude si to pamatovat ten vetsi limit\n\nnení to tím, že ty limity jsou uloženy mimo stránku v souboru zeronet/data/{users.json,sites.json}?\n\n> [peerco](#comment_45_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): vyhnout se limitu hlavniho adresare a schovat se do uzivatelskeho podadresare\n> napriklad v ShareTube ma jeden s uzivatelu pres 1 GB svuj podadresar\n\njá jsem bohužel netestoval co se stane pokud by měly povinné soubory v hlavním adresáři více jak 10MB. Možná to netestoval ani nofish, protože tolik prostoru v hlavním adresáři nepotřeboval. Možná (tady jen plácám) je v zeronetu nastaveno, že na rozdíl od hlavního adresáře stránky mohou mít adresáře data/users libovolnou velikost, kterou jim admin nadefinuje v data/users/content.json, pak je normální to, co jsi viděl, ž euživatel tam má 1GB dat ve své složce..\nProhledával jsem soubory v repu https://github.com/HelloZeroNet/ZeroNet na \"size limit\", \"site create\" ale při zběžné prohlídce (nejsem developer) jsem neviděl nic co by naznačovalo, že je do adresy stránky něco konkrétního zakódováno.",
				"added": 1567406234
			},
			{
				"comment_id": 32,
				"body": "> [peerco](#comment_51_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): jinak i u toho ZeroBlog je pocatecni limit na 10 MB. nasledne se muze ale zvetsovatale ... u standartniho typu stranky to pri prekroceni 10 MB zacina odmitat vyrovnavani informaci i datech s peery\n\na při překročení limitu 10MB u té výchozí nové stránky ti to tedy na stránce nebo na ZeroHello u stránky nezobrazí výzvu k navýšení limitu? Pokud ne, kde vidíš že zeronet selhal při publikaci ke všem peerům a začal \"odmitat vyrovnavani informaci\", nějaká konkrétní chybová hláška na GUI nebo v logu?\n\n> [peerco](#comment_52_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): ale pozor, ted mi to hlasilo pri tomto postingu, obsah nemohl byt zverejnen\n\n\"content publish failed\" se mi také občas zobrazí (spíše zřídka kdy a u stránek s málo peery, jako je třeba tato), třeba dnes když jsem probudil PC tak možná tím, než zeronet získal peery, nebo nějaký jiný síťový lag zeronetu, nevím.",
				"added": 1567408682
			},
			{
				"comment_id": 51,
				"body": "U proxy je zvýšení limitů obvykle zakázáno asi jako ochrana proti přeplňování disků. Peerování by nemělo souviset se size limitem.",
				"added": 1568027508
			}
		],
		"1567356889_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 27,
				"body": "👍 nějaký top uživatel zeronetu v minulosti psal něco v tomto smyslu, že by mělo stačit použít výchozí trackery a stačí když jich bude funkční i jen několik. ono by člověk počítal, že čím více trackerů, tím víc peerů.\nMožná, že zeronet announcuje (hlásí) trackeru peery o kterých ví (tedy i ty, které získal od jiných trackerů) a tím všechny trackery shromážní více méně kompletní seznam peerů? (možná)\nNavíc ZN má PeX (peer exchange) funkci a funkci pro výměnu trackerů P2P: http://127.0.0.1:43110/1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8/?Post:135:Changelog:+August+28,+2018",
				"added": 1567357991
			},
			{
				"comment_id": 35,
				"body": "> [portable](#comment_1_16WRTeWERzFgqyeprDZ9xRvG192UoUG6bk): tak a ted jsem uplne bez peeru :-)\n\nno tvojí zprávu čtu, tak se spojení zase navázalo :-)\ndokázal bys vysledovat důvod proč to to stávkuje?\nJestli máš v [/Config](/Config) zapnutý Tor nebo jiný proxy pro spojení s trackery, můžeš to zkusit vypnout a restartovat ZN jestli se to zlepší. A nebo vypnout zeronet a v zeronet.conf vypnout všechny věci související s Tor a zkusit jet bez něj abys zjistil zda je příčinou Tor.",
				"added": 1567492199
			},
			{
				"comment_id": 37,
				"body": "> [portable](#comment_6_16WRTeWERzFgqyeprDZ9xRvG192UoUG6bk): na peerco@zeroid prave trackers 10/14 ... a presto muj peer kazdy jiny odmita\ntady nevím jak to myslíš\n\n> diktat co peery mezi sebou smi a co ne\nmáš na mysli trackery že diktují?, většina jich nesouvisí se zeronetem. v zeronet kódu na tvém pc není určitě nic co by kontrolovalo data která odesíláš (jestli to je třeba teroristický obsah) a na základě kontroly zvolilo zda smí být odeslána nebo ne, to by byla pěkná blbost\n\n> trackery ... urcuji peerum s kterym peerem smi a s kterym nesmi komunikovat\nmožná některé trackery ano (každý může založit tracker), ale ne všechny. pokud bys dokázal vysledovat (nevím, možná pomocí Wireshark) které trackery takto jednají, bylo by vhodné to nahlásit zeronet developerovi na github aby vytvořil jakýsi blocklist trackerů, které nebudou v zeronetu použity.\n\n> vsechny masiny na tor only\nzkoušel jsi vypnout tor (nebo jiné proxy) pro trackery a pak tor úplně? jak jsem psal",
				"added": 1567498480
			},
			{
				"comment_id": 38,
				"body": "> [peerco](#comment_58_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): dostal jsem se do peerove blockace jak plne s torem ... jak v modu bez toru ale preci jen pres tor jako tor gateway jineho stroje ale s vypnutym tor modem\n\ntakže jsi v zeronet.conf nastavil tor_proxy a nebo jsi na PC vynutil všechna spojení skrze Tor? protože podle mě změna proxy v prohlížeči internetu nemá vliv na to jak se zeronet spojuje s internetem a vystupoval bys se standardní IP, ne přes Tor (asi).\n\n> nez nekdo zjisti z jaheko peeru ta identita jede uz je peer v blokaci\nnejednoznačné a velmi zjednodušené, takže nerozumím o co go\n\n> [peerco](#comment_61_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi):  cet dalsi vyjadreni ministerstva vnitra Rakouska jak se k te kriminalite stavi\n\ntady já nevím o co jde a jaké informace šíříš\n\n> [peerco](#comment_64_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): peery uz zacaly odmitat peerovani\n\njestli myslíš zeronet peery, tak to považuji za nesmysl aby zeronet měl v sobě nějaký mechanismus kde by si zeronet klienti stahovali z nějakého centrálního serveru koho mají peerovat a koho ne. A aby to byl jakýsi blok (spiknutí) na úrovni páteřní sítě internetu, to nevím, protože to by museli blokoval Tor relay servery, jelikož neví jaká komunikace mezi nimi probíhá (jaká data přenášíš), díky šifrování a absenci použití exit nodů (komunikace mezi 2 hidden services (.onion)).\n\n> [peerco](#comment_67_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): pred chvili publishing by 6/6 peers\n> ted uz jen by 3/3 peers\n> jeste neveris\n\nne to opravdu nic nedokazuje, protože tuto stránku používá ztěží 3 lidi já, ty, a možná ještě někdo jiný. Sice se tu peerů zobrazuje víc, ale myslím že jich je většina offline a možná občas někdo je up (to pak vidíš 6/6).\n\n> ted se ale nove dva peery pridali\nsuper\n\n> puvodne jsem si myslel, ze by to mohla byt blockace userid\nne, peerové neznají tvé userid, a neumí je spárovat se 100% jistotou s IP/tor onion adresou. Někdo už psal, že pokud by někdo monitoroval dlouhou dobu obsah urité ZN stránky a zároveň i peering a dával k tomu časové značky a pak to porovnával, tak by mohl získat určitou pravděpodobnost která IP/onion adresa bude asi která identita na dané zeronetové stránce (a když znáš ID/public key - což je veřejná informace na ZN stránkách, zobrazuje se moje i v adresním řádku na této stránce, tak v daném adresáři data/users/identia/content.json uvidíš i které zeroid.bit např to je). Ale obecně, podle mého pochopení, když kontaktuje peer peera kvůli update, tak nevíš jistě jestli je to odesílatel příspěvku a nebo řadový peer, který pomáhá distribuovat aktualizaci obahu.\n\n> kazdy peer ma svou unikatni identifikaci v cele siti\nnevím proč si to myslíš, ale když se podíváš na http://127.0.0.1:43110/Stats tak třeba vidíš že u peeru znáš jeho verzi zeronetu, počet stránek, možná, že díky tomuto je pak možné zjistit že jde o stejného člověka/zařízení i když změní IP.. Je otázka proč tato docela citlivá informace o počtu stránek je zjiš´tována, to by chtělo vyhledávat/zeptat na Githubu: https://github.com/HelloZeroNet/ZeroNet/issues/",
				"added": 1567578987
			},
			{
				"comment_id": 39,
				"body": "> [peerco](#comment_71_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): tu se brani peery komuniaci s urcitym peerem\nnevím jestli se brání (to už jsem psal v předchozím příspěvku, že tomu nevěřím) a nebo jestli jen je tam nějaký problém co se týče toho, že oba peeři nejsou zrovna (a nebo dlouhodobě) se schopni spojit. Ten problém s timeoutem připojení k peerovi to tu je a asi i bude, ale obvykle to není nad 50% všech peerů, pokud je to víc a nebo se nepřipojí k žádnému peerovi (když sleduji debug.log soubor zeronetu a mám zapnuté logování všeho v /Config), tak pak restartuji zeronet a tím to pomůže. Ale ty problémy s Trackers 0/xxx a s tím možná navazujícím problémem s připojení k peerům prakticky nemám, i když občas tam vidím třeba Trackers: 3/100 ale nějak se to vždy srovná a nebo využiju to k tomu že se podívám na update stránku a dám aktualizovat, čímž se ZN restartuje.\nPublished to 5/5 peers, prakticky okamžitě",
				"added": 1567580495
			}
		],
		"1567352095_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 30,
				"body": "@peerco\nta videa a audia od tebe mi zatím nezačala přehrávat:\n\nHTTP spojení skončilo s chybou 404. Nahrávání zdroje média http://127.0.0.1:43110/147RqkK3WP9FXJq4fXxSKjojYHw4Wrmy8A/temp789/koukam.mp4 skončilo chybou. 19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t\nHTTP spojení skončilo s chybou 404. Nahrávání zdroje média http://127.0.0.1:43110/147RqkK3WP9FXJq4fXxSKjojYHw4Wrmy8A/temp789/yes.mp4 skončilo chybou. 19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t\nHTTP spojení skončilo s chybou 404. Nahrávání zdroje média http://127.0.0.1:43110/147RqkK3WP9FXJq4fXxSKjojYHw4Wrmy8A/temp789/SampleAudio_0.4mb.mp3 skončilo chybou. 19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t\nHTTP spojení skončilo s chybou 404. Nahrávání zdroje média http://127.0.0.1:43110/147RqkK3WP9FXJq4fXxSKjojYHw4Wrmy8A/temp789/SampleAudio_0.7mb.mp3 skončilo chybou. 19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t\n\nKdyž si otevřu tvou stránku a její menu:\n Needs to be updated:\n\n    abc.mp4\n    Louis_CK_-_Wrong_Number.mkv\n    koukam.mp4\n    yes.mp4\n    SampleAudio_0.4mb.mp3\n    SampleAudio_0.7mb.mp3\n\nkliknu tam na tlačítko [update] a zbyde tam jen abc.mp4 k aktualizaci.\nPo tom co obnovím tento thread a zkusím znovu přehrát vše, tak se to tam znovu přidá do Needs to be updated. Jako kdybys to ani neměl v content.json zaregistrované tyto soubory (tím že dáš \"Sign and publish\" v menu stránky).",
				"added": 1567403801
			},
			{
				"comment_id": 33,
				"body": "> [peerco](#comment_50_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): proc tomu tak je nechapu\n\nno v hlavním content.json tvé stránky tyto soubory nemám, to znamená že buď\nA) je v tom souboru nemáš ani ty (nemáš podepsaný (signed) ten soubor content.json (čímž se podle mě prohledají pod-složky hlavního adresáře a nalezené soubory se do něho přidají)\nB) update se nedostal (zatím?) ke mě (to by bylo dost divné až nepravděpodobné - leda snad pokud by ti nefungoval Tor v zeronetu, na ZeroHello (TOR: ERROR) a měl jsi navíc PORT: CLOSED",
				"added": 1567409244
			},
			{
				"comment_id": 34,
				"body": "@peerco @portable\n\n> [peerco](#comment_54_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): na zerohello vidim, ze to tu vepsano ... asi rave pro trackers 0/10\npříspěvek se ti vepíše, ale pokud se to nepublikuje (nepošle peerům), tak to vidíš jen ty lokálně, dokud se neobnoví spojení a neprovedeš nějakou akci, která by publikovala tvůj content.json ... jo, trackers: 0/10 je důvod selhávající publikace.\n\n> [peerco](#comment_55_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): check files coz vynuti opetovne zverejnovani obsahove informace smerem na trackery dale smerek na peery\n> ale pokud peery v tomto momente samy informaci nevyzadaji tak se k nim v tomto momentu nedostane\nnejsem si jistý, jestli při \"check files\" nebo \"update\" dochází ke kontaktování trackerů vždy, on zeronet ukládá pro každou stránku několik peerů a ty pak kontaktuje.\n\n> mam zentralni blokaci ... muj masterkey je blokavan u vsech peeru\nto těžko, to bych neviděl tvůj příspěvek",
				"added": 1567491649
			},
			{
				"comment_id": 43,
				"body": "> [peerco](#comment_95_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): bez peeru a bez zverejneni\n\nTen druhý odkaz (*.mp3)  mi ukázal \"Not found\", ale druhý napsal že je stránka větší než 10MB:\n\"Site size: 51MB is larger than default allowed 10MB\n[Open site and set size limit to 100MB]\"\nPo odsouhlasení se stránka se seznamem mp3 načetla.\nBohužel dvě mp3 nejsou momentálně dostupné ke stažení - v sidebaru stránky je to ukazuje v sekci \"Needs to be updated:\n\n    the_crime_of_the_orchard_(01.08.2019).mp3\n    ZeroNet_(07.09.2019).mp3\n\n\" (5try - jako že se to pokusilo 5x je stáhnout ale nenašlo počítám peera, který by je měl) - stránka ukazuje že jsem se připojl k jednomu peerovi. Třeba se to později stáhne. Ostatní mp3 přehrávají.\n\n> to mi dela na jakemkoliv klonu\njj, to je normální když nová stránka nemá peery, obvykle nejlepší jak začít seedovat stránku, je mít nahoře na stránce Zerohello PORT: OPEN, Tor: available. Pokud máš třeba Tor: always nebo jen port closed a Tor: error, tak je zvýšená šance, že ten první, druhý peer třeba má opačnou konfiguraci tor/port status a díky tomu se k tobě nepřipojí. Ohledně získávání seedů, podívej na můj koment v [jiném diskuzním vlákně](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1567890378_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi/ziskavani+seedu#comment_44_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS).",
				"added": 1567929938
			},
			{
				"comment_id": 46,
				"body": "> [peerco](#comment_98_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): kdyz udelam jakykoliv klon bez dat\n> nejake 2-3 KB\n> stejne to na peery nedistribuje conetnt.json\n\njj nové stránky [nemají peery](/19Q64E6Gt67e96skgYSJejYjFRrJYyqP2t/?Topic:1567890378_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi/ziskavani+seedu#comment_44_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS), tak to obvykle ukazuje \"Content publish failed\"",
				"added": 1567973017
			}
		],
		"1567489873_16WRTeWERzFgqyeprDZ9xRvG192UoUG6bk": [
			{
				"comment_id": 36,
				"body": "@peerco @portable\n\n> ZeroID nadale plne\nto je zajímavý. Hlásí to nějakou chybu?\n\nZměna ID by neměla mít absolutně žádný vliv na networking. Přijdeš o upozornění na odpovědi v diskuzních tématech, která sleduješ (Pokud si to manuálně nepřekopíruješ v data/users.json) + možnost editovat posty tvé předchozí identity.\n\n>  pripada jako, ze nekdo pro celou ZeroNet sit rozhoduje pomoci spam filtru co ostatni smi a nesmi videt\nmůžeš o tom napsat nové diskuzní téma, nebo sem popsat co a jak? Protože si nemyslím že by to byla tak docela pravda. Podle mě jakmile máš registrovanou identitu, tak tě může cenzurovat jen majitel stránky na kterou postuješ nový obsah.\n\n> a vse jede jak ma ... vratim se na starou sesnu a nejse nic\n> s kym smi a skym nesmi peerovat rizeno pres trackery\nto, že ti stará session nefunguje nemusí být důkaz toho, co říkáš. záleží na tom jaké úkony jsi provedl při změně ID (session).\nTrackery samozřejmě mohou ovlivnit to, jestli určité IP adrese odmítnout službu. Používají se i zero:// trackery, což jsou interní trackery vytvořené zeronetem (Bootstrapper plugin).\n\n> odmitaji v LANu bez spoje do WANu spolu kominikovat\nhttp://127.0.0.1:43110/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1534145930_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm",
				"added": 1567492935
			}
		],
		"1567823948_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 40,
				"body": "měli by stačit 1-2 peery, kteří pak update rozdistribují dalším peerům",
				"added": 1567861792
			},
			{
				"comment_id": 41,
				"body": "příčina toho \"vážného problému\" je v málo peerech, viz. [zde](/1LUrvRXuPxH5ENgWeCbhrpUYfxCwnFYFDJ/?Topic:1567823880_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi#comment_5_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS)",
				"added": 1567861971
			}
		],
		"1567824053_15UvNUKxKYtJSKmi3JFESYyt5M6RKwFZUE": [
			{
				"comment_id": 42,
				"body": "Vysvětlení proč se to zveřejní třeba \"jen\" na 3 peery z 5 je [zde](/1LUrvRXuPxH5ENgWeCbhrpUYfxCwnFYFDJ/?Topic:1567823880_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi#comment_5_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS).\nI publikace na 1 peera by měla stačit. Pokd vám to nestačí, tak si například [nainstalujte zeronet VPS](/16Go5kc2U9Ff4jeaY8kYiDEgpMYdgyboPY/?Topic:2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/How+to+Install+and+run+Zeronet+on+a+Raspberry+Pi) v profi datacentru a nebo u sebe doma na nějaký mini PC, spusťte zeronet, otevřete v něm tuto stránku a máte +1 pera. I když jste oba online, tak není zaručeno že se propojíte, ale bude to třeba nepřímo přes jiného peera, který získá aktualizaci od třeba peerco a tuto pak pošle dalšímu peerovi, který bude třeba vendelinek (a nebo já když mám zrovna zapnutý PC)",
				"added": 1567862321
			},
			{
				"comment_id": 49,
				"body": "> [peerco](#comment_101_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): diky za vsechny rady\n\nnení zač, jsem rád že se objeví někdo kdo píše česky a koho zajímá decentralizovaný internet jako je tento",
				"added": 1568023758
			}
		],
		"1567890378_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 44,
				"body": "jo to je další stránka kde je možné nabrat peery, možná že má zeronet příliš málo uživatelů a proto to moc nepomáhá, další stránky kde získat peery:\n\n1. je dobrý načíst novou stránku v zeronet proxynách: http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies a\n2. pak ji dát třeba do [0list](/186THqMWuptrZxq1rxzpguAivK3Bs6z84o/) a \n3. [dalších seznamů zeronet stránek](/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1524949682_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/ZeroNet+sites+directories).\n4. Také pomůže [ZeroMe](/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/?Home). Ale po tom je potřeba třeba 30 minut (ideálně pár hodin?) být online než si pár peerů stránku stáhne.\n5. nainstalovat si zeronet na nějaké 24/7 běžící minipc a nebo virtuální server, [více info](/16Go5kc2U9Ff4jeaY8kYiDEgpMYdgyboPY/?Topic:2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/How+to+Install+and+run+Zeronet+on+a+Raspberry+Pi)",
				"added": 1567931259
			},
			{
				"comment_id": 47,
				"body": "\"Connected: 1\" (1 peer ke kterému mě to připojilo)\nKdyž se ale podívám do menu největší ZN stránky (Millchan) tak vidím \"Connected: 7\". Počítám, že ZN to zbytečně nepřehání a najde si jen rozumné množství peerů. Každý peer, který pak dostane moje update, tak také update rozešle dalším několika peerům a ti to samé, takže se aktualizace rozdistribuje v nějakém rozumném čase ke všem online peerům.",
				"added": 1567973258
			},
			{
				"comment_id": 48,
				"body": "> ja kdyz jsem si zkusmo naistaloval jinou instanci, tak jsem s temi samymi peery uz nemel problem\n> tak mi to vysvetli\n\nTo je normální že ne vždy se spojíš se všemi peery. S některými se spojíš a za chvíli už ne, pak se to pozněji znovu povede. Bohužel nejsem žádný síťový mág abych dokázal zjistit podrobnosti a důvody proč to které peer spojení nefunguje. Možná to ani nelze zjistit. Zkrátka je důležité aby měla stránka dost peerů. Pokud bys měl problém s publikací (publishing) na stránkách s hodně peery jako je millchan, zerotalk tak pak by byl problém nejspíš s trackery nebo nějakým omezením na tvém PC nebo poskytovatel internetu, nebo s Tor(em).",
				"added": 1568023686
			}
		],
		"1567971833_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 45,
				"body": "Zajímavý článek s datem Září 2019:\n[Kam dát peníze v době nervózní? Investice očima expertů](https://www.penize.cz/akcie-svet/409370-kam-dat-penize-v-dobe-nervozni-investice-ocima-expertu)\n\n- \"V momentálním období nejistot jsou drahé kovy rozhodně správnou volbou\"\n- \"Vhodnou volbou pro konzervativnější investory můžou být i akcie firem, které pravidelně vyplácejí dividendu.\"\n- \"Nakupujte to, co budou nakupovat centrální banky.\"\n- \"Pokles sazeb zato zatraktivňuje třeba zlato. To by mělo jít nahoru.\"\n- \"A co brexit? Nejlépe se vydělává na tom, od čeho se všichni odtahují. To je teď britská libra. Za sázku stát může, ostrovy jednou čekají lepší časy.\"",
				"added": 1567972075
			},
			{
				"comment_id": 80,
				"body": "Cenné papíry americké společnosti **Tesla** mají nyní nejvyšší cenu od založení. Ekonom Lukáš Kovanda o tom píše zajímavý komentář \"Proč Tesla letí? Šťastnější půlka Ameriky (48 % Američanů investice nemá) pochopila, o čem je tržní monetarismus: centrální banka nenechá trh padnout, vždy jej dofoukne novými penězi. Výsledky firem přestávají být důležité, stačí dát peníze do toho, o čem se zrovna hodně píše...\"",
				"added": 1594477376
			},
			{
				"comment_id": 85,
				"body": "Koupil jsem si [Solana](https://www.reddit.com/r/solana/comments/pf65oh/2021_newbie_to_solana_how_i_have_bought_it_and/) kryptoměnu, zaujalo mě že umí mnohem více a levnějších transakcí než tradiční kryptoměny a bylo na tom vytvořeno již 300 aplikací, roste docela rychle.",
				"added": 1630766920,
				"modified": 1630769040
			}
		],
		"1568029615_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 52,
				"body": "Na 32bit Windows nevím ale zkoušel jsem nějaký zeronet z roku 2018 a process explorer mi ukázal u toho .exe procesu 32, takže to bylo možná 32bit.\n\nARM [fungoval](/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1556558677_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/+6+mo+dedicated+Linux+server+with+2TB+HDD+250Mbit+s+unlimited) (Ubuntu Server Armhf 16.04 32bit, Debian 9 Armhf): https://github.com/HelloZeroNet/ZeroNet/issues/2002",
				"added": 1568032558
			}
		],
		"1568154163_1K4xSWqBipeYy6Ve3HzvXujKn34ZMtfXou": [
			{
				"comment_id": 54,
				"body": "> [kazisvet](#comment_6_1K4xSWqBipeYy6Ve3HzvXujKn34ZMtfXou): problem s tou autokorrekturou textu je ten, ze kdyz clovek text dostane mimo viditelnou cast displeje, clovek ani nevidi, ze ke zmene textu doslo a k jake\n\nobdivuju tě že s tím máš trpělivost :)",
				"added": 1568216796
			}
		],
		"1568271804_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 55,
				"body": "Rozdíl v zerotalk+ je že je tam méně stránek aby šlo rychleji najít stránky, které jsi přidal?",
				"added": 1568294251
			}
		],
		"1568370732_1BhPaLYVpu9TmN1pA7wTfXG8MYs29VNHdy": [
			{
				"comment_id": 56,
				"body": "Pod druhým odkazem vidím \"No posts yet Let's follow some users!\" - ale profil tam je.\n> \"User not found or muted\"\njestli to není tím, že zatím nemáš stažený zerome hub na kterém mám profil, jde o sunhub (jeho adresu vidíš v samotné adrese mého zerome profilu - první tvůj odkaz..) :-/",
				"added": 1568382784
			},
			{
				"comment_id": 57,
				"body": "Máš pravdu, tohle mě už nějakou dobu vadí, je to hodně zaostalé. Vývojář ZN to už ví, ale neví co má dělat dřív počítám.. https://github.com/HelloZeroNet/ZeroNet/issues/",
				"added": 1568391933
			}
		],
		"1568462342_1K4xSWqBipeYy6Ve3HzvXujKn34ZMtfXou": [
			{
				"comment_id": 58,
				"body": "nápodobně 🌻",
				"added": 1568464758
			}
		],
		"1570012969_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 59,
				"body": "> Proč nepoužívat Tor:\n- riziko že odešlu login údaje na HTTP:// ne-onion stránce (bez šifrování) a exit node tyto údaje zachytí a zneužije\n- mám dojem že google recaptcha nemá ráda tor IP adresy, takže dostat se na takto zabezpečený web je někdy dost nepříjemný zážitek\n- některé weby vám znemožní přístup jen proto, že používáte Tor\n\nJá tedy TB používám jen pro pár služeb, kde opravdu chci zůstat anonymní.",
				"added": 1570049454
			},
			{
				"comment_id": 60,
				"body": "@peerco je to složité se v tom vyznat, asi většina lidí do toho nevidí. Neví že může jejich data někdo přečíst a zneužít a nebo si třeba nainstalují do prohlížeče sledovací rozšíření, která sledují jejich aktivitu a data jsou pak zpracovávána a prodávána. Viz. seminář [Dark data](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/DEF%20CON%2025%20-%20Svea%20Eckert-%20Andreas%20Dewes%20-%20Dark%20Data.mp4). Nevím tedy co se učí na školách v informatice, ale několik hodin na téma bezpečnosti na internetu by mělo být povinností pro každého. Jinak asi ne každý má problém s tím kydyž firmy o něm zjišťují jeho zvyklosti/chování na netu.",
				"added": 1570136864
			}
		],
		"1571580123_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 61,
				"body": "Citace z článku https://www.info.cz/svet/evropa-opustila-svou-identitu-liberalum-se-durazem-na-krestany-protivime-rika-orbanuv-muz-43731.html\n\n\"Evropa opustila svou křesťanskou identitu ... být praktikující křesťan je menšinový fenomén i v Maďarsku ... Nikdy nebudeme skrývat nebo se stydět za to, že jsme tím, čím jsme dnes, díky židovství a křesťanství\"\n\n\"Setkali jsme se s tím u několika západoevropských vlád, v Bruselu a na mezinárodních fórech, že se jim nelíbilo, že mluvíme jmenovitě o pronásledování křesťanů. ... Připustit, že je tu násilí vedené vůči křesťanům, protože jsou křesťané, je něco, co vyvolává odpor.\"",
				"added": 1575054169
			},
			{
				"comment_id": 62,
				"body": "Tomáš Zdechovský: \"Je třeba přestat zavírat oči nad systematickým pronásledováním křesťanů ve světě. Každý rok jsou zavražděny nebo šikanovány desítky tisíc křesťanů ve 144 zemích světa pro svou víru a příslušnost k @CirkevCz\n Na to je třeba začít upozorňovat.\"\n-> [Proč se média také nezajímají o systematické vraždění křesťanů?](https://zdechovsky.blog.idnes.cz/blog.aspx?c=737242)\n\n**Čína**, 2019: \"Čínské úřady skenují obličeje věřících a odebírají od nich otisky prstů při vstupu do kostelů. Komunistický stát pokračuje v narůstajícím tlaku vůči náboženským menšinám v zemi.\" [zdroj](https://www.krestandnes.cz/cinske-urady-skenuji-obliceje-vericich-a-odebiraji-jim-otisky-prstu/)\n\n**Severní Korea**: \"we estimate that between 50,000 and 70,000 Christians are imprisoned in terrible labour camps – simply for choosing to follow Jesus. And yet, despite the risks, the church in North Korea is slowly but steadily growing. ... Christians are considered enemies of the state because they dare to believe in a higher authority than the Kim family.\" **(odhadujeme, že v Severní Korei je vězněno v pracovních táborech 50-70 tisíc Křesťanů - jen proto, že si zvolili následovat Ježíše Krista. _I přes rizika církev v Severní Korei pomalu ale stále roste_. ... Křesťané jsou považováni za nepřátele státu protože si dovolují věřit ve vyšší autoritu než je Kimova rodina.)** [zdroj](https://www.opendoorsuk.org/persecution/countries/north-korea/)\n\n[report on Christians oppressed for their Faith2017–19](https://acn-marketing-assets.s3.amazonaws.com/reports/acn-persecuted-and-forgotten-2019.pdf) britská charitativní organizace Aid to the church in need - ACN UK",
				"added": 1575369508
			}
		],
		"1576863840_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 65,
				"body": "\"přibývá lidí, kteří se obávají zhoršování životního prostředí. Nyní je to 19 procent, loni 11 procent a v roce 2016 pouhá dvě procenta.\" CVVM (Centrum pro výzkum veřejného mínění), 2019",
				"added": 1577105995
			},
			{
				"comment_id": 66,
				"body": "**Zemědělství**:\n\n\"Celková produkce potravin, do níž je zahrnuto nejen zemědělství, využívání půdy a její přeměna, ale i doprava, zpracování, skladování, balení, prodej, spotřeba a ztráty, přispívá ke globálním emisím skleníkových plynů až 37 %.\"\n\n**maso**\n\n\"Pro živočišnou výrobu se využívá 83 % zemědělské půdy a vyprodukuje 60 % skleníkových plynů z celého zemědělství. Chov zvířat má navíc na svědomí 80 % odlesňování, ať už kvůli pěstování krmiv – především sóji –, nebo kvůli vytváření nových pastvin.\"",
				"added": 1578175963
			},
			{
				"comment_id": 77,
				"body": "[Tropické lesy absorbují méně CO2 a behem desetiletí by mohly naopak ke globálnímu oteplování přispívat](https://www.theguardian.com/environment/2020/mar/04/tropical-forests-losing-their-ability-to-absorb-carbon-study-finds)",
				"added": 1583419862
			},
			{
				"comment_id": 79,
				"body": "> [ea0000ffff](#comment_2_1Cygc2KxzEY6Wcz6fMC95612z9br8ZfSL6): A kdo by se tomu divil, při součané mediální masáži.\n\npravda, v tomto směru je dobře že média plní svou funkci a na ten problém upozorňují. Kdyby to nedělali tak by si toho lidi nevšímali a pak by bylo pozdě ... no ono i tak je nejvyšší čas na změny, jelikož to klima má setrvačnost desítky let.",
				"added": 1586030799
			}
		],
		"1578839900_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [],
		"1578843387_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 70,
				"body": "Známý český odborník na psychologii a sportovní kouč Jaromíra Jágra Marian Jelínek mluví o **důležitosti rovnováhy toho, jaké máme cíle a jakou máme motivaci / vztah k cestě k němto cílům** (zda milujeme svou práci která k těm cílům vede). Mluví o racionálním myšlení, emočním i duševní oblasti. Syndrom vyhoření.\n1. https://www.youtube.com/watch?v=8WFeAthg-p4\n2. https://www.youtube.com/watch?v=a_YdutoCYPs",
				"added": 1578843381
			}
		],
		"1578843653_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 71,
				"body": "**Výchova dětí** a krize hodnot (hovoří odborník na psychologii) - https://youtu.be/a_YdutoCYPs?t=320",
				"added": 1578843644
			},
			{
				"comment_id": 73,
				"body": "Děti a sport: „Každé sté dítě, které začne s hokejem, se tím pak živí. Myslet si, že moje dítě je to sté a s tím do toho od začátku jít, je trochu na tenkém ledě... Důležitější je vytvořit emoční vazbu dítěte k pohybu a až potom řešit výsledky.\" řekl [Marian Jelínek v Hydepark civilizace](https://www.ceskatelevize.cz/porady/10441294653-hyde-park-civilizace/220411058090111/).",
				"added": 1578861182
			}
		],
		"1578843609_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 72,
				"body": "Pokud máte **strach** a nebo jste **rozrušeni** a chcete narušit negativní myšlenkový proud/emoční rozpoložení, může pomoci zhluboka dýchat: https://www.youtube.com/watch?v=iXzNohwdgMU\n\nJe důležité **vnímat své pocity**, jelikož pokud jsou negativní, můžeme si uvědomit, že je možná vhodně změnit myšlení: https://www.youtube.com/watch?v=8s-S-5ksa28",
				"added": 1578843680
			}
		],
		"1579601293_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 74,
				"body": "**Obaly/odpad/recyklace**\n\n\"veřejnost ... si ... o 800 % více stěžuje na přítomnost plastových obalů, ale v zásadě nijak neomezila své spotřební chování. \"\n\n\"Nahradit plast? Ale čím, aby to neškodilo víc\" ... \"pro výrobu papírového sáčku je třeba 4x více energie, než u plastového\" -> \"[Comparison of Environmental Impact of Plastic, Paper and Cloth Bags](http://www.niassembly.gov.uk/globalassets/documents/raise/publications/2011/environment/3611.pdf)\" (nejlepší je použít několikasetkrát bavlněnou tašku)\n\n\"když započteme faktory jako poškození ozónové vrstvy, lidskou a ekosystémovou ekotoxicitu, znečištění vody a ovzduší, bylo by zapotřebí papírový sáček použít 43x, aby byl „lepší“ než ten plastový. Ale hlavně - papír sice není plast, ale pořád je to odpad. Nikdo nevěnuje pozornost tomu, zda je sáček vůbec zapotřebí. Jen se jedna forma odpadu nahrazuje jinou. Že papír dokážeme recyklovat? Ale to přece plasty také! Podobně zcestné je například nahrazení plastových příborů v bistrech a bufetech jednorázovou dřevěnou variantou. Emise související s jejich výrobou jsou větší, než u plastu.\" -> [Ústup od plastových obalů v supermarketech dojíždí na nedomyšlené souvislosti](https://ekolist.cz/cz/zpravodajstvi/zpravy/ustup-od-plastovych-obalu-v-supermarketech-dojizdi-na-nedomyslene-souvislosti)",
				"added": 1579607998
			}
		],
		"1581331545_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 75,
				"body": "\"Neslyšící Američan žaluje Pornhub – kvůli chybějícím titulkům prý nechápe děj\" [zdroj](http://www.zive.cz/clanky/neslysici-american-zaluje-pornhub--kvuli-chybejicim-titulkum-pry-nechape-dej/sc-3-a-202151/default.aspx)",
				"added": 1581331562
			}
		],
		"1581418894_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 76,
				"body": "\"Snížení teploty v místnostech o 1 °C ušetří přibližně 6 % ročních nákladů na vytápění.\"\n\nzdroj: https://vytapeni.tzb-info.cz/vytapime-tuhymi-palivy/12373-smokemanovo-desatero-spravneho-topice",
				"added": 1581418924
			}
		],
		"1585906419_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 78,
				"body": "7 tipů pro zdravé bydlení:\n\n-    Často a intenzivně větrejte\n-    Nepřetápějte své interiéry (ideální je teplota 20-22 °C)\n-    Nekupujte nábytek a jiné vybavení, které by mohlo obsahovat formaldehyd (případně další toxické látky)\n-    Utěsněte okna a dveře kvůli hluku a unikání tepla\n-    odhlučněte svůj byt záclonami, koberci, tapetami, nebo vhodně rozmístěným nábytkem\n-    Sviťte přirozeným (plnospektrálním) světlem\n-    Pěstujte si vlastní bylinky nebo zeleninu)",
				"added": 1585906438
			}
		],
		"1568030035_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": [
			{
				"comment_id": 81,
				"body": "@lajci zakládej témata diskuzní. Já tu ale bohužel nejsem každý den, jelikož mi ZN žere moc paměti a přetěžuje PC, asi pořídím PC s více paměti, co se dá dělat",
				"added": 1599513356
			}
		],
		"1630600680_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": [],
		"1632645097_19TrKZA9ifR8bvPbL64AbNqttCDkWfErWF": [
			{
				"comment_id": 86,
				"body": "test post\n// added by editing\n// edit 2 '",
				"added": 1632853261,
				"modified": 1632853616
			},
			{
				"comment_id": 87,
				"body": "> [bats](#comment_1_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): A postAn edit\n\nthanks 👍, so only one person (@styromaniac: ) is unable to edit or anyone else?",
				"added": 1632954666
			}
		],
		"1630821458_1LpWbu62NgT4wzh1k1XVDCW9qwENC7AQi1": [
			{
				"comment_id": 89,
				"body": "Aeronet zveřejňuje polopravdy a manipuluje veřejným míněním, není vyvážený, cpou tam jen to, co se jim hodí.",
				"added": 1637597451
			}
		],
		"1637750556_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 90,
				"body": "> [petrkoval](#comment_3_1AMUtxW7pjg4XgawDbAk297M1FfHWvSdSz): ockuji jakekoliv problematicke lidi a jejich problematicke zdravotni stavy\n\nDobrý den, zdravím do Rakouska. Nečetl jsem o tom, že by mělo být povinné očkovat seniory bez ohledu na jejich zdravotní stav. To mi přijde jako nepravděpodobné, jelikož když jsem byl na očkování tak ze mě ta doktorka přímo tahala jestli mám nějaké problémy (zda mě můžou očkovat) a myslím si, že v případě seniorů bude  zjišťování anamnézy (nebo jak se tomu říká) spíše důkladnější než tomu bylo v mém případě.\n\nStavíme tu proti sobě možnou větší zátěž očkování na organismus seniora vs násobně vyšší riziko (při absenci očkování) těžkého nebo i fatálního průběhu kovidu u seniora. Vy jste četl o tom, že by nějaké výraznější procento seniorů mělo závažné negativní vedlejší účinky oproti ostatnímu obyvatelstvu? U průměrné populace střední věk a mladí je to více-méně zanedbatelné \"promile\". Ono také nejde jen o dopady vakcinace ale o dopady toho když na člověka bez protilátek (vakcinace) kovid udeří: https://www.mayoclinic.org/diseases-conditions/coronavirus/in-depth/coronavirus-long-term-effects/art-20490351",
				"added": 1637766995,
				"modified": 1637769472
			},
			{
				"comment_id": 91,
				"body": "> [petrkoval](#comment_4_1AMUtxW7pjg4XgawDbAk297M1FfHWvSdSz): psalo kdyby se to necenzurovalo. ... Neovoli jim ani zavolat detem ... To jsou takove hruzny\n\nuff, hmm o tomhle mi není nic známo, je to divné že by senioři nemohli zavolat dětem a cenzura je, ale myslím že se to nedá srovnávat s tím co je třeba v komunistické číně. Čekal bych že půjde hlavně o cenzuru vyložených lží na sítích jako FB, nebo možná jen o lživé reklamy.\nhttps://koronavirus.mzcr.cz/dezinformace-o-covid-19/",
				"added": 1637848052
			}
		]
	},
	"comment_vote": {
		"1_15UvNUKxKYtJSKmi3JFESYyt5M6RKwFZUE": 1,
		"5_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"26_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"41_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"42_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"93_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"101_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"120_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1,
		"11_1BhPaLYVpu9TmN1pA7wTfXG8MYs29VNHdy": 1,
		"66_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"2_17aH99r4uZuYe56UChepqJjZWEG3fcTgaQ": 1,
		"3_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}