{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 2,
			"title": "Правообладатели отключили серверы видеобалансера Moonwalk",
			"body": "Печальные новости...\n‎‎‎　\nВ обед 18 октября в Нидерландах отключили серверы стримингового плеера Moonwalk. Его использовали на 80% пиратских сайтов в России для показа фильмов и сериалов. Об этом сообщил сайт TorrentFreak со ссылкой на Голландский фонд защиты авторских прав (BREIN). Moonwalk.cc является самым старым и самым популярным видеобалансером, которым пользуются владельцы пиратских онлайн кинотеатров. К их семейству плееров относятся Moonwalk, Streamguard, Clastarti и другие.\n　\nОрганизация совместно с судебными приставами добилась отключения серверов, конфискации улик и выдачи метаданных трёх голландских и двух зарубежных юридических лиц, связанных с Moonwalk. BREIN провела операцию совместно с американскими ACE («Альянс креативности и развлечений») и MPAA («Американская ассоциация кинокомпаний»).\nПредставители организации назвали Moonwalk «балансером загрузки видео». Плеер не просто воспроизводил контент, но ещё и хранил его, а также обеспечивал быструю отдачу.\n　\nПо данным правообладателей, Moonwalk обслуживал множество пиратских сайтов в рунете, включая ресурсы вроде HDrezka, KinoGo, «ГидОнлайн», ex-fs.net и т.д. Система представляла собой пиратскую сеть доставки контента (CDN), а для её использования достаточно было вставить код плеера на страницу сайта.\n　\nКак отметили в BREIN, на 50 самых популярных сайтов с Moonwalk пришлось 395 миллионов визитов от 89 миллионов уникальных посетителей в месяц. В организации пояснили, что для правообладателей подобные цифры означали потери сотен миллионов долларов.\n　\nВпервые о Moonwalk заговорили в СМИ в феврале 2019 года. Тогда компания по кибербезопасности Group-IB разослала отчёт о крупных монополистах на рынке пиратского видео.\n　\nПо данным экспертов система заработала в 2013 году и на начало 2019 года хранила 33,4 тысячи фильмов и сериалов, платя за это по 0,6 долларов за тысячу просмотров. Владельцы Moonwalk неизвестны, однако они получали деньги за встроенную в плеер рекламу — обычно, нелегальных онлайн-казино (которая, к слову, легко отключалась любым адблокером типа uBlock).\n　\nВ Group-IB тогда поясняли, что российским правообладателям сложно добиться отключения Moonwalk, так как её серверы находятся за пределами России — в Нидерландах. После этого ситуацией заинтересовались в BREIN и добились прекращения работы системы.\n　\nОригинал: https://stichtingbrein.nl/brein-serves-ex-parte-order-on-dutch-hosting-providers-for-80-of-russian-streaming-sites/",
			"added": 1571735858
		},
		{
			"topic_id": 1602778018,
			"title": "Крупнейшая свободная электронная библиотека LibGen выходит в межпланетное пространство",
			"body": "Library Genesis - настоящий бриллиант Интернета. Онлайн-библиотека, предоставляющая свободный доступ более чем к 2.7 миллионам книг, на этой неделе сделала долгожданный шаг. Одно из веб-зеркал библиотеки теперь дает возможность скачать файлы через IPFS - распределенную файловую систему.\n\nЗа этим скрывается очевидный факт - коллекция книг Library Genesis загружена в IPFS, запинена и соединена с поиском. А это значит, что теперь лишить людей доступа к нашему общему культурному и научному наследию стало немного тяжелей.\n\n### О LibGen\nВ начале нулевых в пока ещё свободном от регулирования интернете лежали дюжины сборников научных книг. Крупнейшие коллекции из тех, что я могу вспомнить - KoLXo3, mehmat и mirknig - содержали к 2007 году десятки тысяч учебников, публикаций и других важных djvuшек и pdfок для студентов.\n\nКак и любые другие свалки файлов, эти коллекции страдали от общих проблем с навигацией. Библиотека Колхоз, например, жила на 20+ DVD-дисках. Наиболее востребованная часть библиотеки руками старшаков переселялась в файловую шару общежития, а если нужно было что-то редкое, то горе тебе! Как минимум ты попадал на пиво для хозяина дисков.\n\nТем не менее, коллекции были все ещё осязаемых размеров. И хотя поиск по названиям самих файлов зачастую разбивался о креативность создателя файла, ручным full-scanом можно было вытащить нужную книгу после упорного проматывания десятка страниц.\n\nВ 2008 году на rutracker.ru (тогда torrents.ru) энтузиастом были опубликованы торренты, скомпоновавшие существовавшие сборники книг в одну большую кучу. В этом же треде нашелся человек, начавший кропотливую работу по систематизации выложенных файлов и созданию веб-интерфейса. Так появился Library Genesis.\n\nВсе это время с 2008 года и до текущего момента LibGen развивался и пополнял собственные книжные полки силами соообщества. Метаданные книг редактировались, а затем сохранялись и распространялись в виде дампов MySQL для всех желающих. Альтруистическое отношение к метаданным привело к появлению большого количества зеркал и повышению выживаемости всего проекта, несмотря на возросшую фрагментацию.\n\nВажной вехой в жизни библиотеки стало зеркалирование базы данных Sci-Hub, стартовавшее в 2013 году. Благодаря коллаборации двух систем в одном месте оказался сконцентрирован небывалый по качеству набор данных - научные и художественные книги вместе с научными публикациями. У меня есть предположение, что одного дампа совместной базы LibGen и Sci-Hub будет достаточно для восстановления научно-технического прогресса цивилизации в случае его утраты в ходе катастрофы.\n\nСегодня библиотека довольно устойчиво держится на плаву, имеет веб-интерфейс, позволяющий искать по коллекции и скачивать найденные файлы.\n\n### LibGen в IPFS\nИ хотя социальная значимость LibGen очевидна, столь же очевидны причины, из-за которых библиотека постоянно находится под угрозой закрытия. Именно это сподвигает мейнтейнеров зеркал искать новые пути обеспечения устойчивости. Одним из таких путей стала публикация коллекции в IPFS.\n\nIPFS появился относительно давно. На технологию при её появлении возлагались большие надежды и не все из них оправдались. Тем не менее, развитие сети продолжается, а появление в ней LibGen может усилить приток свежих сил и сыграть на руку самой сети.\n\nУпрощая до предела, IPFS можно назвать файловой системой, натянутой на неопределенное количество узлов сети. Участники одноранговой сети могут кешировать файлы у себя и раздавать их окружающим. Адресация файлов происходит не по путям, а по хешу от содержания файла.\n\nНекоторое время назад участники LibGen анонсировали IPFS-хеши и встали на раздачу файлов. На этой неделе ссылки на файлы в IPFS стали появляться в результатах поиска некоторых зеркал LibGen. Кроме того, благодаря действиям активистов команды Internet Archive и освещению происходящего на reddit, сейчас идет наплыв дополнительных сидеров как в IPFS, так и на раздачу оригинальных торрентов.\n\nПока неизвестно, появятся ли сами хеши IPFS в дампах базы LibGen, но кажется, что этого стоит ожидать. Возможность скачать метаданные коллекции вместе с IPFS-хешами снизит порог входа для создания собственного зеркала, увеличит стабильность всей библиотеки и приблизит исполнение мечты создателей библиотеки.\n\nP.S. Для желающих помочь проекту создан ресурс freeread.org, на нем живут инструкции как настроить IPFS.",
			"added": 1602778015
		}
	],
	"topic_vote": {
		"1630010730_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1
	},
	"next_comment_id": 33,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "> [geekless](#comment_18_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Были всякие прокси, но сейчас ни один не отзывается: http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies\n\nКак минимум https://proxy.zeronet.a0z.ru отзывается",
				"added": 1518883090
			},
			{
				"comment_id": 2,
				"body": "> [geekless](#comment_20_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Кстати, как-нибудь можно сделать mention пользователя, чтобы ему пришло уведомление, ссылаясь не на конкретный комментарий, а на ник?\n> Т.е. не так:\n> [swashbuckler](#comment_1_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ)\n> А что-то типа того:\n> [swashbuckler](swashbuckler@zeroid.bit)\n\nХороший вопрос. Но тогда куда придёт уведомление? (если бы оно было) :D\nТест: [geekless](geekless@zeroid.bit) [geekless](#geekless@zeroid.bit) [geekless](#1GooUE19488nDwG3TdkM8seYAHct4gjkq4) [geekless](1GooUE19488nDwG3TdkM8seYAHct4gjkq4)\n",
				"added": 1518896683
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 3,
				"body": "Интересно наблюдать, как люди считают сеть децентрализованной, но проблемы типа \"чинить централизацию\" всё равно остаются... Потому что даже внутри децентрализованной сети точки централизации - это сами пользователи и группы, которые они формируют.",
				"added": 1562391033
			}
		],
		"4_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 4,
				"body": "Систематизированной и релевантной информации о технических и прикладных темах.\nГлавное - не количество людей, а качество информации.\n\nНапример, было бы полезно заиметь что-то вроде Deskle или Miro (бывший Realtimeboard). Это очень мощные коллаборативные инструменты, которые могли бы преобразить \"внутряк\" ZeroNet'а.\n\n[+] Плюсы:\n- ZeroNet на плаву уже больше трёх лет. И он ещё плавает.\n\n[-] Минусы:\n- Мало людей-создателей. Слишком много троллей и \"генерирующих шум\". Но это больше проблема самих пользователей, а не платформы.",
				"added": 1562392327
			}
		],
		"1_1FHnuq52Et74p1YGGFtGd2xrKTUBjEqjbm": [
			{
				"comment_id": 5,
				"body": "> [reflevmas3](#comment_2_1FHnuq52Et74p1YGGFtGd2xrKTUBjEqjbm): Копипастой работает.Копипастой не очень уж удобно.\n\nУчить английский. Это несложно :)",
				"added": 1562514084
			}
		],
		"5_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 6,
				"body": "> [anonymouslogin](#comment_25_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Mute - не удаляет, а скрывает контент. Требуемого вам механизма - нет, можно вести личный список Sample blocklist и включать его во время просмотра любого сайта или написать кастомные css если для Millchan они применимы.\n\nА если идти путём кастомного CSS, есть ли какой-то универсальный селектор для пользователя? Его хеш, айди или ещё что-то? По ссылке указан идентификатор как пример для коммента и топика. Но если сайт какой-то пользовательский, то получится ли и там скрывать определённого пользователя? Иными словами, уникален ли такой идентификатор для любой структуры зайта или эти айдишники обязательно должен определять владелец сайта при его создании?",
				"added": 1562621892
			}
		],
		"4_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 7,
				"body": "Может речь о пентестинге? Описанное больше похоже на пентестинг, а не на \"хакинг\". Да и само слово в культуре хакеров не трактуется как \"сломать что-то\". Хакеры - это прежде всего исследователи. Вам наверное к кракерам.\n\nРесурсы существуют всякие, и понятий, которые охватывает хакерская культура, очень и очень много. Обозначьте вашу цель, сформулируйте вопрос. Какие именно инструменты вам нужны? В Clearnet'е можно найти многое. Всё упирается в вашу конечную, конкретно сформулированную цель.",
				"added": 1563757073
			}
		],
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 8,
				"body": "Почему бастуют и какие требования выдвигают?",
				"added": 1563996284
			}
		],
		"5_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 9,
				"body": "Праздники - бестолковое понятие.",
				"added": 1565622203
			}
		],
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 10,
				"body": "И сюда говно в уши заливают... Профсоюзы, вконтактик, дискордик, новости великой РФии...\nЗеронет загнётся из-за людей, которые приносят всё тот же мусор, которого полно в клирнете. А полно его потому, что мусор - в головах.\n\nВы обсуждаете не то и не там, ultraviolet. Защищать права рабов внутри капиталистической системы - это сильно.",
				"added": 1566177395
			},
			{
				"comment_id": 12,
				"body": "> [ultraviolet](#comment_131_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Что вы здесь предлагаете обсуждать?\n> \n> Ваши предложения?\n\nПредложения? Ну, смотрите: вы предлагаете \n> \"создание большой гильдии ИТ работников которая сможет защищать трудовые права и интересы работников а в будущем, при росте численности и силы союза заниматься и более серьёзными вопросами, например противодействии цензуре.\"\nА чем вас не устраивает уже существующий проект https://roskomsvoboda.org/ ? Развивайте уже существующие решения. Не нужно создавать сотню ячеек, 90% из которых так и останутся в стадии \"инициативной группы\". Подключайтесь к тому, что уже есть. Это только один из примеров.\n\n> Мы создаём демократический, \"боевой\" союз работников изначальное ориентированный на активную защиту прав и интересов.\nГромкие слова: \"демократический\", \"боевой союз\", \"защита прав/интересов\". Звучит как лозунги типа \"летим, сломя голову и уделываем всех\". Технологиям и процессам внутри системы плевать на ваши забастовки. Бастуют грузчики, потому что им не платят или у них нет работы? Так стоит задуматься, почему так происходит и подумать, почему беспилотные дальнобойщики справляются с задачами дальних рейсов лучше, чем водители, которым нужно спать, кушать и получать вознаграждение.\n\nЯ клоню к тому, что вашим основным инструментом лучше бы выбрать образование. Чтобы бастовать, много ума не нужно. А вот чтобы уметь ориентироваться в стремительно меняющемся мире с кучей процессов вокруг - тут надо поднапрячься.",
				"added": 1566381157
			},
			{
				"comment_id": 13,
				"body": "> [ultraviolet](#comment_135_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e):\n> \n> Мечты прекрасны но на дорогах пока нет ни одной подобной машины.\n> Водителей - гастарбайтеров я вижу много но вот роботов как то не очень.  Догадываетесь почему?\n\nНаверное потому, что пока что (акцент на \"пока что\") выгоднее содержать людей, выплачивая им копейки, чтобы они окончательно не \"раскачали лодку\". Куда ж девать такую толпу гастарбайтеров? Вот о чём я, на примере Китая: https://invidio.us/watch?v=OmkFDWYsyHA (в клирнете можете поискать перевод от Vert Dider - видео называется \"Робототехника: Быстрее, сильнее и дешевле\". YouTube его удалил вместе со старым каналом, но в соц. сетях типа ОК и ВК наверняка что-то осталось).\n\nА вот касательно \"ни одной подобной машины\": https://invidio.us/watch?v=vMXivgUGVn8",
				"added": 1566659524
			}
		],
		"1_1JJoeimWbdW8iRd5dpgE7CJ5gAQVGphQFB": [
			{
				"comment_id": 11,
				"body": "Продажа квадратиков...",
				"added": 1566177496
			}
		],
		"2_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 14,
				"body": "> [if0](#comment_239_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Любители централизованных стриминговых сервисов должны страдать.\n\nКаковы децентрализованные альтернативы? Ace Player?",
				"added": 1571918555
			},
			{
				"comment_id": 15,
				"body": "Технически, может ли ZeroNet выступить в роли CDN для раздачи медиа-контента? Каковы требования и ограничения? Оправдан ли вообще такой подход (использование ZeroNet в качестве сидера контента)?\n\nВот есть у нас некое подобие YouTube'а. Каким образом там осуществляется раздача видео-контента, и где хранится начальный файл? Можно ли превратить это в совместный сервер раздачи медиа-контента с выбором самих медиа-файлов (кто и что хочет сидить)?",
				"added": 1572010033
			},
			{
				"comment_id": 16,
				"body": "> [fant](#comment_55_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): И может, и давно используется - BigFiles.Подход оправдан ровно настолько, насколько и любая раздача в торрентах.Скачал/создал, хранишь, раздаешь - контент доступен. Не хранишь и не раздаешь - недоступен.\n\nЭто я понимаю. Но как сделать так, чтобы был хотя бы один peer, который раздавал бы файл даже если оригинальный аплоадер уже даже не пользует ZN?",
				"added": 1572118117
			}
		],
		"1_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 17,
				"body": "О чём речь вообще? Введите в курс дела, пожалуйста...",
				"added": 1572871243
			}
		],
		"4_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 18,
				"body": "Ничего не понятно. Что шифрует? Как шифрует?\nГрубо говоря, если взять пучок нейронов и определить связи с ассоциациями, которые формируют понятие, которое необходимо зашифровать, то такое шифрование скорее всего приведёт к амнезии. У нас в мозгу не хранится \"вот это вот предложение\" или \"вот такая вот информация\". Наша память - ассоциативная, и у каждого индивидуума набор ассоциаций - свой, уникальный.\n\nУ компьютеров есть стандарты и спецификации, которым следуют, чтобы произвести шифрование информации. С человеческим мозгом всё сложнее, т.к. там нет спецификаций относительно того, как именно формировать ассоциативный ряд и каким образом будут формироваться нейронные связи, чтобы точно знать, где и какой кусок информации брать. \n\nМне кажется, что если такое ПО когда-то и будет разработано, то изначально это будет анализатор исходных связей и понятий, и только затем конкретный мозг можно будет \"частично обесточить\". Когда информация будет \"шифроваться в мозгу\", это значит, что сам носитель эту информацию будет забывать, на время (частичная амнезия, например). И восстановить связи или зашифрованное понятие можно будет, используя уникальный ключ дешифрации для этого человека: например, только ему знакомая комбинация звука и визуального образа, которая заставит \"вспомнить\" информацию.",
				"added": 1572975592
			}
		],
		"1_17BiztV4FPbkq1EgrLMgcVD1hXSsw8gQtk": [
			{
				"comment_id": 19,
				"body": "Сделай лучше. Критиковать легко, а что ты предлагаешь? Большинство просто клонирует зайт и не работает с JS/CSS и с API ZeroNet'а. Сделай привлекательнее, поковыряв доки - всё в твоих руках.",
				"added": 1573135303
			}
		],
		"4_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": [
			{
				"comment_id": 20,
				"body": "Benchmarking ZeroNet 0.6.5 (rev3870) Python 2.7.13 (v2.7.13:a06454b1afa1, Dec 17 2016, 20:42:59) [MSC v.1500 32 bit (Intel)] on: win32...\n\nCryptBitcoin:\n- hdPrivatekey x 10..........0.305s [x2.30: Fast]\n- sign x 10..........0.432s [x0.81: OK]\n- openssl verify x 100..........0.148s [x2.50: Fast]\n- pure-python verify x 10..........0.367s [x4.36: Insane!!]\n\nCryptHash:\n- sha256 5M x 10..........0.198s [x3.03: WOW]\n- sha512 5M x 10..........0.238s [x2.52: WOW]\n- os.urandom(256) x 1000..........0.004s [x1.63: Fine]\n\nMsgpack: (version: 0.4.8)\n- pack 5K x 10 000..........0.287s [x2.72: WOW]\n- unpack 5K x 10 000..........0.432s [x2.78: WOW]\n- streaming unpack 5K x 10 000..........0.450s [x3.11: WOW]\n\nDb: (version: 3.8.11, API: 2.6.0)\n- Open x 10..........0.015s [x8.67: Insane!!]\n- Insert x 10 x 1000..........0.498s [x2.01: Fast]\n- Buffered insert x 100 x 100..........0.794s [x1.64: Fine]\n- Total rows in db: 20000\n- Indexed query x 1000..........0.112s [x2.23: Fast]\n- Not indexed query x 100..........0.214s [x2.80: WOW]\n- Like query x 100..........0.400s [x4.50: Insane!!]\n\nCompression:\n- Zip pack x 10..........0.076s [x1.58: Fine]\n- Zip unpack x 10..........0.164s [x1.22: Fine]\n- Tar.gz pack x 10..........0.176s [x1.70: Fast]\n- Tar.gz unpack x 10..........0.124s [x1.61: Fine]\n- Tar.bz2 pack x 10..........1.200s [x1.67: Fine]\n- Tar.bz2 unpack x 10..........0.305s [x1.64: Fine]\n\nDone. Total: 7.28s",
				"added": 1581286617
			}
		],
		"1603651874_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 21,
				"body": "Весело у вас тут... =)",
				"added": 1603659412
			},
			{
				"comment_id": 22,
				"body": "@gitcenter \n\nВ DevZone такая ошибка при попытке оставить комментарий:\n\n```\nПодпись контента не удалась\nInclude too large 912B > 0B\n```\n\nПлюс мне кажется там нет поддержки сертификатов KaffieID",
				"added": 1603661319
			},
			{
				"comment_id": 23,
				"body": "> [gitcenter](#comment_133_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Черт, забыл опубликовать. Вроде теперь должно работать. [...]\n\nKaffieID не мёртв. KxoID - другое дело, с ним я не смог сработаться... xD Но Кафиенну можно добавить (либо он там есть, но я не увидел)",
				"added": 1603661651
			},
			{
				"comment_id": 24,
				"body": "@geekless\nЗачем всё удалил? Верни, люди же читают и пытаются вникнуть, чего и к чему.\nПерепалки можно оставить в стороне. Холодный ум для разработчика - это важная штука =) Сгоряча бахать столько написанных мыслей - это чести не делает...",
				"added": 1603662366
			},
			{
				"comment_id": 25,
				"body": "Почитал тут ваши беседы. Я конечно, как сторонний наблюдатель, не шибко подкован в том, что происходит в контексте именно ваших разработок/тем/сообщений друг с другом, но тем не менее попробую вставить свои пять копеек :D\n\nИ gitcenter и geekless - вы оба говорите дельные вещи. Я разделяю недоверие к GitHub как площадке для хостинга проектов, которые претендуют на \"разрыв шаблонов\" в вопросе подхода к копированию данных. Все эти DMCA и копирасты стоят поперёк горла, и поэтому лучше подыскать другую платформу, где шанс того, что данные никуда вдруг не самовыпилятся, будет выше. В идеале круто было бы перетащить сорцы ZN в сам ZN - это будет показателем =) Но в текущем варианте, в котором существует Git Center, это будет очень неудобно. Есть куда расти: уже тот момент, что такой проект, как Git Center, существует, указывает на попытки двигать и развивать экосистему зеронета.\n\nСогласен также насчёт иссякания энтузиазма. Тут наверное любой выгорит, когда его детище за 4 года только обрастает комментами (зачастую сомнительного качества), а толковые сайтостроители заезжают очень \"со скрипом\". Думаю, порог входа можно понизить, если основательно проработать документацию. Тот же Truth About ZeroNet, который лежит в виде репозитория, дал мне намного больше инфы как начинающему, чем оф. API документация (в плане того, чтобы въехать, \"а как же оно всё тут работает\").\n\nА работает оно всё тут... сложновато. Это наверное основной нюанс, почему всё так медленно едет вперёд. Core-часть уже достаточно хорошо \"проверена временем\", чтобы продолжать её использовать. Есть ведь возможность писать плагины - так почему бы не использовать этот момент? Может nofish специально отправил всё в \"свободное плавание\", чтобы посмотреть, а нужно ли это вообще хоть кому-нибудь? И это надо как-то показать, общими усилиями. Это требует времени... Особенно учитывая то, какие события сейчас происходят на общемировой арене, и насколько всеобъемлющ кризис \"мозгов\" (достаточно посмотреть на деградняк, например, в сфере музыкальных вкусов).\n\nДумаю, надо пробовать дорабатывать что-то, что уже есть внутри сети, и заниматься экосистемой зеронета. А тут, получается, основной упор смещается на то, чтобы пилить сам зеронет.\n\nЯ, конечно, много чего тут не знаю, PR'ов на GitHub у меня не было, но я следил и продолжаю следить за развитием этого проекта. Мне нравится идея распределённой раздачи сайтов, где нет централизованного сервера. Нужно ценить усилия каждого, кто тащит этот титанический корабль где-то на просторах пока ещё мало кому известного моря :D Перебранки и попытки что-то кому-то доказать в рядах \"команды на палубе\" хорошей погоды точно не сделает. Поэтому, думаю, необходимо очертить цели и потихоньку двигаться к ним. Для себя я такой целью поставил сделать небольшой поиск, который пока что в alpha режиме, так как параллельно является ещё и моей песочницей, в которой я постигаю азы работы с API зеронета. Затем, думаю, при достаточном количестве знаний, можно будет помогать с доработкой существующих проектов, которые востребованы. Тот же ZT++ или Git Center, или IFS (в IFS вообще кучу всего можно допиливать).",
				"added": 1603664257
			}
		],
		"1593644510_1DsDKkrbdNHdbm1wfWi4AwZvhgJn8jUKNz": [
			{
				"comment_id": 26,
				"body": "Соль Земли (2014, Вим Вендерс) - разоблачает общечеловеческие отношения.\nТорговцы сомнением / Merchants of Doubt (2014) - разоблачение табачных компаний и их подходов.\nПричём тут здоровье? (What The Health) + Сахарная Лихорадка (Джейми Оливер) + Скотозаговор - разоблачение food corporations.\nРеальная цена моды (2015) - разоблачение индустрии моды.\nКоммерциализация детства - разоблачение того, как детей с малого возраста делают потребителями.\nВыбор за Нами (2016) - о проекте Венера, самостоятельный фильм после Духа Времени.\nДжеймс Рэнди - Секреты экстрасенсов - разоблачение экстрасенсов :D\n\nОтдельно сериал от создателя Духа Времени:\nКультура в упадке (Питер Джозеф)",
				"added": 1604666745
			},
			{
				"comment_id": 27,
				"body": "Ну и \"Гипернормализация\":\nhttps://www.youtube.com/watch?v=zQRxhiF6L8M - первая серия, дальше сам найдёшь.",
				"added": 1604666825
			}
		],
		"1604363170_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 28,
				"body": "> [mokshanets2](#comment_12_1BTR1SP5uKs6nURymSE4uX74vJ8CmAXyB9): Что бы писать. Но отличные от zeroid.bit сертификации могут быть добавлены.\n\nТак это же логично: чтобы что-то написать, надо быть привязанным к какому-либо идентификатору. А если это ограничение кому-то не нравится, можно сделать свой форк форума и позволить гостям писать анонимно и т.д.",
				"added": 1606505856
			}
		],
		"1615456715_1Fb5iVeVmyT53woPjVQ4vc86oxYmN6sfTK": [
			{
				"comment_id": 29,
				"body": "Слишком абстрактный вопрос. Непонятно, кто такой \"преступник\" и каково его \"преступление\". Также не совсем ясно, кто такие \"психически больные люди\".\n\nНаверное, отношение к \"психически больным людям\" хуже потому, что корректировка окружающей средой в большинстве случаев невозможна. А вот \"преступник\", своровавший, к примеру, палку колбасы в магазине, может скорректировать своё поведение, если обстановка поменяется (например, если у него будет работа или его обеспечат необходимым).\n\nДело в гибкости: многие преступники могли бы и не быть таковыми, а вот с вариантом психологических отклонений выбирать особо не приходится, потому что \"поломка\" внутренняя, а не внешняя.",
				"added": 1621181043
			}
		],
		"1630010730_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 30,
				"body": "Selfhosted решения:\nhttps://www.seafile.com/en/download/\nhttps://owncloud.com/",
				"added": 1630183731
			}
		],
		"1633210683_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 31,
				"body": "Хорошо, что ты не в стойле :D",
				"added": 1633380464
			}
		],
		"1626784540_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 32,
				"body": "[Prism Break](/1Br4MT7PgsRET2APJkbhqqoxwL1CqcCFxh/en.zip/protocols/index.html) уже неактуален? Может стоит пересмотреть этот список и что-то там обновить...",
				"added": 1636586687
			}
		]
	},
	"comment_vote": {
		"1_1AtHamvjTgcyTeJytnTf2i5ah3CrEa3rJG": 1,
		"185_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"85_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"61_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"45_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"247_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"141_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"109_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"101_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1,
		"90_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1,
		"87_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1,
		"79_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1,
		"78_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1
	}
}