{"cert_user_id": "idlesong@github", "next_comment_id": 9, "comment": {"1604065071_mirrored_HelloZeroNet_github": [{"comment_id": 1, "body": "I think one user per site is more more attractive.  If there's any chance, please treat this as a prime consideration.\n\nWhy I think zeronet social is very attractive? \n1.  I have the total control of my date. That's why I choose p2p social instead of centralized site.\n2.  My data will always online. Because my friends(followers) have big willing to seeding my site.\n\nThe more user per site solution is less attractive.\n1. I lost my total control. It's hard to choose a hub, because we have very small information of the hub.  \n   I need to choose a hub. I will worry about that he may banned my site, if he don't like my content. If I changed my hub, I may need to inform my followers that I changed my hub and ask them to seed again. Because the hub can modify my data, then it can fake me: Banned my profile and say I have changed to a fake profile. Because my followers have seeding the hub for a while, they may trust the hub. Because we have few information to choose a hub, maybe in the future, who have many servers and bandwidth will gain most users. \n2. My followers need to seed other 99 users they don't want to follow. This may decrease their willing to seed the sites.\n\nPlease forgive my poor English:)\n", "added": 1462433320, "modified": 1462433320, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/232#issuecomment-217120260", "source_type": "github"}, {"comment_id": 2, "body": "Yes I know, create my own hub is a solution. But if there are many users like me care about the control of own data. Then this solution would be less attractive. \n", "added": 1462434526, "modified": 1462434526, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/232#issuecomment-217123120", "source_type": "github"}, {"comment_id": 3, "body": "For the issues of one user per site solution\n- (a)Initial seeding can be problematic\n- (b)Needs lots of connections (5connection/site is minimum to make sure you got every update)\n- (c)More network communication (tracker announce requests)\n- (d)More files and hdd space requirement on hdd (if you comment on multiple profile you only need new file for every profile)\n- (e)Less privacy: You exactly know who follows who (tor improves this)\n\n---\n\nConsider most zeronet users don't treat 1.easy to use and 2.decrease hdd space as top priority, so (a),(c) are not big problem right now.\nAnd with tor, (e) also can accept.\nSo the really problem are (b) and (c). Am I right?\n", "added": 1462434817, "modified": 1462434856, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/232#issuecomment-217124224", "source_type": "github"}, {"comment_id": 4, "body": "I will take more time to think about this. Thanks for your hard work, it is really awesome.\n", "added": 1462436660, "modified": 1462436660, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/232#issuecomment-217128509", "source_type": "github"}, {"comment_id": 5, "body": "Zerome or myzero\n", "added": 1462763426, "modified": 1462763426, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/232#issuecomment-217783197", "source_type": "github"}], "1604065074_mirrored_HelloZeroNet_github": [{"comment_id": 6, "body": "This feature seams like a kind of zerome, they seams very familiar.\n", "added": 1453283502, "modified": 1453283502, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/233#issuecomment-173195236", "source_type": "github"}, {"comment_id": 7, "body": "Is it possible to use this feed news to replace the zerome? So you do not need to maintain two apps.  There will be many kind of feeds, blog, forum.., we can use lists to filter them. Server a site is like follow a site:)\n", "added": 1453284304, "modified": 1453284304, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/233#issuecomment-173197494", "source_type": "github"}, {"comment_id": 8, "body": "OK, I understand. I just think if this news feed can replace the ZeroMe would be very cool. (ZeroMe: A twitter-like social site)\n", "added": 1453343884, "modified": 1453343884, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/233#issuecomment-173460512", "source_type": "github"}]}}