{
	"title": "伊斯兰的威胁",
	"description": "反伊斯兰反邪教",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1526573408,
	"post": [
		{
			"post_id": 6,
			"title": "2018.5.17印尼再遭IS恐袭",
			"date_published": 1526573254.061,
			"body": "【[印尼](http://jump2.bdimg.com/safecheck/index?url=rN3wPs8te/pL4AOY0zAwhz3wi8AXlR5gsMEbyYdIw60z6puXRG4rYfix6OViutD7t6XyibVFgk4fbLMgytUg5Z4Q4OO30Ri8SAtVjSx1NjJY8K44RtEayBtvvM+ey5zlA6dGyAzkvkDyLbQuI+m8+vVyUfqqQmcgo+IGmo/mnZUqxE5ZVGhVnI3X1pphzOon/5ii4U3ezPcwPGbuJnYGNA==)再遭IS恐袭 袭击者持刀驾车撞入警局】当地时间5月16日，[印度尼西亚](http://jump2.bdimg.com/safecheck/index?url=rN3wPs8te/pL4AOY0zAwhz3wi8AXlR5gsMEbyYdIw60z6puXRG4rYTvo0Gu/FwflQYyj+87HHOoiY65SX2hsh16xSq+FxHP6FdK7DP1v3oStqBaZnWN6vVdC7Gg5eFCxKGJo7/3mHkvGpLSqu6YhZM5DGCjSuv5bHdUScDw/hMDUYWQmezEYr5WAqYLZf3aYXcDh3Y8QS9QfrcczIBPx2HY9qHh6BM0y)，数男子袭击地方警察总局造成1死3伤，袭击者手持武士刀，驾驶汽车闯入。警方击毙4名袭击者，逮捕1名，警方称车上有疑似爆炸物。袭击者属于当地恐怖组织，效忠IS，IS宣称对袭击负责，这是印尼近日发生的第三起袭击事件.\n\n![83381e2eb9389b50655bbcf68935e5dde5116ed3.jpg (497x276)](data/img/post_6_83381e2eb9389b50655bbcf68935e5dde5116ed3.jpg)"
		},
		{
			"post_id": 5,
			"title": "好久不来",
			"date_published": 1526571815.406,
			"body": "极端伊斯兰恐怖分子的恐怖袭击又杀死了很多平民."
		},
		{
			"post_id": 4,
			"title": "清真",
			"date_published": 1504866408.595,
			"body": "![v2-6837b197bf9aa82971ed882761fc78ce_b.jpg (600x673)](data/img/post_4_v2-6837b197bf9aa82971ed882761fc78ce_b.jpg)\n\n有一些群体本身就含有很高的恐怖主义成分，有一些信仰本身就是恐怖主义的温床，从源头做起才是真正的解决办法。有朝一日祖国上下一片绿的时候，后悔莫及。"
		},
		{
			"post_id": 3,
			"title": "自622年以来伊斯兰教至少屠杀超过6.69亿非穆斯林",
			"date_published": 1504864732.923,
			"body": "血债累累远超我们的预测。\n\n事实上，没有什么意识形态像伊斯兰教一样种族灭绝\n\n在总数中，我们更新了在巴尔干各州，匈牙利，乌克兰，俄罗斯，500多年来穆斯林遇难的8000多万基督徒。\n\n那么我们有印度。 印度教徒被穆斯林屠杀者的官方估计数是8000万。 然而，穆斯林历史学家Firistha（b。1570）写道（在Tarikh-i Firishta或Gulshan-I Ibrahim），穆斯林人宰杀了超过4亿印度教徒，直到伊斯兰在印度统治的高峰，使当时印度人口从6亿下降到2亿。\n\n**随着这些新的补充，自穆罕默德创教以来穆斯林制造种族灭绝将屠杀超过6.69亿人。**\n\n伊斯兰教：种族灭绝宗教\n\n* * *\n\n透视：想想看西班牙的调查是很坏的吗？\n\n· 平均每年穆斯林杀死的人数都超过宗教裁判所350年的杀人总和[。](http://link.zhihu.com/?target=https%3A//translate.googleusercontent.com/translate_c%3Fact%3Durl%26depth%3D1%26hl%3Dzh-CN%26ie%3DUTF8%26prev%3D_t%26rurl%3Dtranslate.google.com.hk%26sl%3Dauto%26sp%3Dnmt4%26tl%3Dzh-CN%26u%3Dhttp%3A//en.wikipedia.org/wiki/Spanish_Inquisition%26usg%3DALkJrhipEX4VTqWatTXN06gYFOX8Ryiygg)\n\n伊斯兰教人士每年都有更多的人比西班牙宗教裁判所所有350年的时间都被杀死。\n\n1478年至1834年西班牙宗教裁判所是由于穆斯林入侵建立的。 这是战争，战斗，试图结束伊斯兰渗透，阿拉伯法西斯主义和征服。 他们的方法论与穆斯林相似是非常有趣的。 根据穆斯林统治或策略，长期的隐藏关系是习惯吗？\n\n注：西班牙宗教裁判所是一个答案，西班牙社会的多宗教性质的伊比利亚半岛的来自穆斯林摩尔人夺回以下。\n\n在711年入侵之后，伊比利亚半岛的大片地区由穆斯林统治，直到1250年，然后他们被限制在格拉纳达，直到1492年失守。然而，Reconquista并没有完全驱逐西班牙穆斯林，因为他们与被奴役的犹太人被执政的基督教精英所容忍。 大城市，特别是塞维利亚，巴利亚多利德和巴塞罗那，犹太区以犹太人为中心。 穆斯林试图控制整个国家，并扩大到法国去建立伊斯兰国家，无论他们在哪里。\n\n为了驱逐国内恶毒的伊斯兰教寄生虫，法庭杀死了所有怀疑受到伊斯兰教污染的人，甚至是穆斯林所奴役的人。\n\n宗教裁判所不仅追捕新教徒，也针对犹太教中的虚伪皈依者，而且还在摩尔人中寻求虚伪或复发的皈依者，强迫伊斯兰教人士转变。 许多莫摩尔人被怀疑是秘密地信奉伊斯兰教。 他们杀死了任何被怀疑是叛徒或伪信摩尔人的人。 没有人幸免\n\n如此成功的是，在1609年的行动中，在几个月的时间里，西班牙清除了摩尔人。 阿拉贡，穆尔西亚，加泰罗尼亚，卡斯蒂利亚，拉曼恰和埃斯特雷马杜拉驱逐了摩尔人。\n\n换句话说，西班牙的调查挽救了整个地区被伊斯兰统治所接管。 这是历史上一场野蛮但典型的英雄行为，以数以百万计的人民牺牲换来完全彻底地灭绝了伊斯兰教。 他们花了近400年。 试想一下，穆斯林的绝对数量在全国为它取近四个世纪来摆脱他们多么艰难。（如果霍查制定的阿尔巴尼亚宪法1967年开始禁止伊斯兰的政策是坚持200多年，而不是只20多年，那么阿尔巴尼亚就是全世界第二个清除伊斯兰成功的国家）\n\n**认为自从1950年以来KKK一直不好**\n\n· [伊斯兰恐怖分子每天杀死的人比3K党在过去50年中](http://link.zhihu.com/?target=https%3A//translate.googleusercontent.com/translate_c%3Fact%3Durl%26depth%3D1%26hl%3Dzh-CN%26ie%3DUTF8%26prev%3D_t%26rurl%3Dtranslate.google.com.hk%26sl%3Dauto%26sp%3Dnmt4%26tl%3Dzh-CN%26u%3Dhttp%3A//wiki.answers.com/Q/How_many_people_were_killed_by_the_Ku_Klux_Klan%26usg%3DALkJrhiudDnsAKMSZZbbAmdd-B4dwCVw_g)杀的人还多\n\n**认为KKK从1865年至1965年是坏的？**\n\n· [自9/11以来，伊斯兰教徒在泰国杀死了更多的佛教徒，比KKK从1865年到1965年在100年内杀的人更多。](http://link.zhihu.com/?target=https%3A//translate.googleusercontent.com/translate_c%3Fact%3Durl%26depth%3D1%26hl%3Dzh-CN%26ie%3DUTF8%26prev%3D_t%26rurl%3Dtranslate.google.com.hk%26sl%3Dauto%26sp%3Dnmt4%26tl%3Dzh-CN%26u%3Dhttp%3A//en.wikipedia.org/wiki/Lynching_in_the_United_States%26usg%3DALkJrhjc6eCxQmfhI6M5V65ZXsOFLre9PA)\n\n**认为爱尔兰共和军的恐怖运动和北爱尔兰的宗派暴力是坏的？**\n\n· [更多的平民在9月11日的两小时内被穆斯林杀害，比北爱尔兰36年的](http://link.zhihu.com/?target=https%3A//translate.googleusercontent.com/translate_c%3Fact%3Durl%26depth%3D1%26hl%3Dzh-CN%26ie%3DUTF8%26prev%3D_t%26rurl%3Dtranslate.google.com.hk%26sl%3Dauto%26sp%3Dnmt4%26tl%3Dzh-CN%26u%3Dhttp%3A//cain.ulst.ac.uk/issues/violence/death95w.htm%26usg%3DALkJrhh5ufYGocuGmv6uDucuR7Pp55dACA)冲突还多\n\n**认为美国的死刑是野蛮的？**\n\n· [9月11日，19名穆斯林劫机者在两个小时内杀死了更多的无辜者，比在过去65年里处死的美国犯罪分子数量还多。](http://link.zhihu.com/?target=https%3A//translate.googleusercontent.com/translate_c%3Fact%3Durl%26depth%3D1%26hl%3Dzh-CN%26ie%3DUTF8%26prev%3D_t%26rurl%3Dtranslate.google.com.hk%26sl%3Dauto%26sp%3Dnmt4%26tl%3Dzh-CN%26u%3Dhttp%3A//www.deathpenaltyinfo.org/ESPYdate.pdf%26usg%3DALkJrhhH36nKYb9U37tdANCA9C44IoHLAA)\n\n**实际上比这更糟糕：**[更多的看法：圣战之泪](http://link.zhihu.com/?target=https%3A//translate.googleusercontent.com/translate_c%3Fact%3Durl%26depth%3D1%26hl%3Dzh-CN%26ie%3DUTF8%26prev%3D_t%26rurl%3Dtranslate.google.com.hk%26sl%3Dauto%26sp%3Dnmt4%26tl%3Dzh-CN%26u%3Dhttp%3A//www.politicalislam.com/tears/pages/tears-of-jihad/%26usg%3DALkJrhgQUnIJckJyX9MaHDN1cFeHzUSf0A)\n\n这些数字是对圣战政治行为对非穆斯林死亡的粗略估计。\n\n**非洲**\n\nThomas Sowell [Thomas Sowell， _Race and Culture_ ，BasicBooks，1994，p。 188]估计有1100万个奴隶运往大西洋，1400万人被送往北非和中东的伊斯兰国家。\n\n对于每个奴隶来说，许多人死亡。\n\n这种附带损害的估计有所不同。 着名的传教士大卫利文斯通估计，每有1个到达种植园的奴隶来说，就有5人在最初的掠夺袭击中丧生，或因强迫长途行军而患病和死亡。\n\n[女长老会任务委员会_大卫利文斯顿_ ，p。 62，1888]\n\n那些被遗弃的人是年轻人，弱者，病人和老人。由于主要供应商杀害或奴役，这些人很快就死亡。\n\n所以，2500万奴隶被交易，我们估计约有1.2亿人死亡。 伊斯兰教在非洲开展批发奴隶贸易。\n\n_1.2亿非洲人_\n\n**基督徒**\n\n基督徒\n\n在伊斯兰教屠杀下殉难的基督徒人数是900万[David B.Barrett，Todd M. Johnson，World Christian Trends AD 30-AD 2200，William Carey Library，2001，p。 230，表4-10]。\n\n拉斐尔·摩尔 粗略估计在小亚细亚的历史上有5000万的基督徒在伊斯兰圣战中死亡。\n\n因此，截止到20世纪被伊斯兰杀死的基督徒基督徒，有：\n\n5900万名基督徒在小亚细亚\n\n在巴尔干，匈牙利，乌克兰，俄罗斯等五百年间，有8000万基督徒被穆斯林杀害。\n\n_[这个计算不包括中世纪的阿拉伯生物战争，被奴役和感染的犹太人充满瘟疫，在没有犹太起源或定居者的地区被倾倒在欧洲。_ _将这种疾病从阿拉伯奴隶贩卖的野蛮行为中被带走，并且是黑人，基督徒和犹太人奴隶的一部分，他们通过支付斋月而生存下来。_ _这些患病的人随后在穆斯林的努力中蔓延到欧洲，征服意大利海岸（威尼斯），希腊，西班牙等。瘟疫最终导致整个欧洲人口的一半丧生]_\n\n**印度教徒**\n\n印度反对派的科内斯·埃尔斯（Koenard Elst）估计在印度总圣战期间，有8000万印度教徒被杀害。 [Koenard Elst，印度的否定主义，印度之声，新德里，2002年， 34.]\n\n印度目前全国仅有古印度的一半大小，由于圣战。 印度附近的山上被称为兴都库什，意思是“印度教徒的火葬。”\n\n8000万印度教徒+调整3.2亿= 4亿印度教徒\n\n[更新：根据1899年印度宗教领袖Swami Vivekananda的报导，援引穆斯林历史学家Firistha，穆斯林在800年的穆斯林统治下屠杀了4亿多印度教徒，当时人口从6亿下降到2亿人 。 Firishta写了Tarikh-i Firishta和Gulshan-I Ibrahim。 如果穆斯林确实屠杀了印度4亿多人，世界各地的穆斯林种族灭绝将超过8.9亿人。\n\n“当穆罕默德人第一次来的时候，我们被说了 - 我认为，最古老的穆罕默德历史学家弗莱塔（Ferishta）的权威是6000万印度教徒。 现在我们约有2亿。\n\n*   在Prabuddha Bharat出版的Swami Vivekananda采访。 1899年4月，题目为“印度教界”。\n\n4亿印度教徒\n\n**佛教徒**\n\n佛教徒跟不上战争的历史。 请记住，在圣战只有基督徒和犹太人允许为迪米（伊斯兰教的奴仆）生存; 其他人都不得不转换或死亡。\n\n圣战组织沿着丝绸之路在突厥斯坦、阿富汗、印度杀害了佛教徒。\n\n总共约1000万。 [David B. Barrett，Todd M. Johnson，World Christian Trends AD 30-AD 2200，William Carey Library，2001，p。 230，表4-1。]\n\n1000万佛教徒\n\n**犹太人**\n\n奇怪的是，没有足够的犹太人在圣战中丧生，大大影响了歼灭总数。 阿拉伯半岛的圣战有效率是百分之百，但数量在几千为单位，而不是数百万。\n\n之后，犹太人提交并成为伊斯兰教徒的仆人（二等公民），没有政治权力。\n\n**粗略估计伊斯兰圣战杀害6.69亿人以上**\n\n缺失数据\n\n波斯人\n\n穆斯林入侵和占领了爱好和平的波斯人，Zorohaustra的追随者。\n\n附录一部分伊朗的伊斯兰大屠杀：\n\n卡迪西亚和泰西封战役：50万波斯人死亡\n\n贾鲁拉战役：10万波斯人死亡\n\n伊斯塔克尔战役：40000波斯人死亡\n\n纳哈万德之战：40万波斯人在3天内死亡\n\n哈马丹和拉伊（雷）：穆斯林将军萨尔·本·瓦卡斯杀死了一半的人口（今天许多大陆穆斯林还意淫它是波斯人，实际上它是屠杀波斯人的凶手阿拉伯人）\n\n尼沙普尔：哈桑和侯赛因（什叶派的伊玛目），哈里发阿里（伊玛目什叶派）的儿子，杀死了三分之一的人口\n\n戈尔干：10,000波斯人只在一天内死亡\n\n呼罗珊，马赞达兰，阿塞拜疆：穆斯林杀害数十万波斯人的战斗中强奸妇女，宰杀男人，掠夺，破坏或烧毁一切。\n\n在中东的基督徒。\n\n在蒙古入侵期间，穆斯林雇佣军在中国大屠杀。\n\n此外，穆斯林自1948年以来又宰杀了1100万其他穆斯林，以及他们几个世纪以来已经杀害的6.69亿的非穆斯林。 有多少穆斯林在1400多年内被杀也是未知数。\n\n**6.7亿：这比其他种族灭绝的行为更多！** **而且并不止于此。** **全世界穆斯林的杀戮持续到今天。**\n\n· **由于很好的理由，左派讨厌西班牙的宗教裁判所，甚至还反对美国的死刑（尽管我支持这一点）。**\n\n· **左派称西班牙的宗教裁判所、3K党、死刑野蛮没有问题。**\n\n· **那么他们为什么不批评伊斯兰教呢？这显然比三个加起来都更差！！！**\n\n· **事实上，没有什么意识形态像伊斯兰教一样有更多的种族灭绝**\n\n· **这么久以来，也没有任何意识形态十几个世纪以来一直如此嗜血。**\n\n· **没有任何意识形态这样反自由，反民主，反女性**\n\n现在是停止的时候了，好吧。\n\n亚美尼亚大屠杀的人头\n\n在亚美尼亚被穆斯林斩首的150-200万基督徒。 这个种族灭绝是由大穆夫提·胡赛尼告诉给希特勒和纳粹的，然后改编用在犹太人处 - 最终造成了浩劫。 在与胡塞尼联系之前，希特勒没有对犹太人进行系统性的大规模大屠杀（1941年9月毒气室开始运作以前，纳粹德国没有对犹太人系统性大屠杀，只会作战就地抓杀和大规模奴工或者驱逐）。 种族灭绝政策是在希特勒与穆斯林和他们的圣战军队作为纳粹合作者提供合作之后发起的。\n\n[https://themuslimissue.wordpress.com/2015/06/15/muslims-have-killed-over-590-million-non-muslims-since-the-birth-of-mohammed/](http://link.zhihu.com/?target=https%3A//themuslimissue.wordpress.com/2015/06/15/muslims-have-killed-over-590-million-non-muslims-since-the-birth-of-mohammed/)\n\n附录：杀人不是问题，中世纪是人类必经的阶段，但问题在于，杀人的作用、目的和后果是什么？\n\n伊斯兰杀人自己+外教，有十几亿，但除黑非洲外，几乎所有被伊斯兰统治的地区，都比前伊斯兰更贫穷，专制，单一，环境被破坏。埃及伊朗两河流域中亚西域几乎毫无例外。伊斯兰化百年前的伊拉克，库斯鲁一世时代的伊拉克还有沼泽和大象，到黑奴暴动的时代，伊斯兰化200多年，就大部分盐碱地了。粟特发达的商业，千城之国的巴克特里亚，也就是今天的中亚和阿富汗，伊斯兰化以后变成全世界最穷最残暴的地区。伊斯兰的扩张绝大部分就是奴役和退化。\n\n中世纪是人类必经的发展阶段，但要求“绝对完美不能改”，甚至想强迫所有人一起倒退停滞，就是一种犯罪，必须严厉无情的镇压，伊斯兰现在以国家机器加个体组织大规模这样做，不断扩散，就更是主要问题。"
		},
		{
			"post_id": 2,
			"title": "唐山条约",
			"date_published": 1504861829.944,
			"body": "![___________.jpg (1200x760)](data/img/post_2____________.jpg)"
		},
		{
			"post_id": 1,
			"title": "居安思危，以欧为鉴：欧洲会穆斯林化吗 ？",
			"date_published": 1433033779.604,
			"body": "文章无修改，原始转载于微博：[司徒茄子v](http://link.zhihu.com/?target=http%3A//weibo.com/u/3136692303) ：[原文链接](http://link.zhihu.com/?target=http%3A//weibo.com/ttarticle/p/show%3Fid%3D2309404135209275637920%23_0)，一个善良的大v\n\n导语：女人的子宫是穆斯林征服世界绝对的大杀器，胜过任何核生化武器\n\n信奉真主的利比亚独裁者卡扎菲曾宣称：“已有很多迹象显示，真主将引领伊斯兰在欧洲获得胜利——不是用刀，也不是用枪，也不用征伐；在未来几十年，五千万穆斯林进入欧洲，会把它变成伊斯兰的洲际大陆。\n\n”\n\n* * *\n\n**俄德法穆斯林人口较多**\n\n![](https://pic3.zhimg.com/v2-1e09e7ed1c61d0cfcbe33b2ac88d645e_b.jpg)\n\n从整个欧洲大陆看，截至2010年，俄罗斯有1400万穆斯林，占总人口的10%，绝对数量和占比都是欧洲最高的。此外，德国的穆斯林有480万，占该国总人口的5.8%；法国有470万穆斯林，占人口总数7.5%。\n\n**穆斯林占欧洲总人口比例在稳步增长**\n\n![](https://pic4.zhimg.com/v2-7661f7fb68f89a92bfaa54ac594024e3_b.jpg)\n\n每过十年，穆斯林群体在欧洲总人口中的占比都提高一个百分点，已从1990年代的4%提高到了6%。按照这个趋势，2030年穆斯林将占欧洲总人口的8%。\n\n**穆斯林更年轻**\n\n![](https://pic2.zhimg.com/v2-b134fba0bbf6439b8f5e41797bfd89cd_b.jpg)\n\n欧洲穆斯林的年龄中位数是32岁，比整个欧洲（40岁）要年轻8岁。相比之下，在欧洲不信教人士，包括无神论者和不可知论者的年龄中位数是37岁。欧洲基督教徒的年龄中位数是42岁。有了年轻人就有了未来，难怪欧洲本地人这么紧张。\n\n**欧洲国家对穆斯林的态度千差万别**\n\n![](https://pic2.zhimg.com/v2-6e546d80f068576f852b8c2cf4ff4815_b.jpg)\n\n2014年春季的调查显示，法国、英国和德国民众大多数对穆斯林持积极观点，西班牙人支持和反对的力量相当；意大利人、希腊人和波兰人大多数对他们不友好。对穆斯林的观点，与人们本身的意识形态密切相关。从调查来看，右派人士更不喜欢穆斯林。例如在德国，政治右派人士47%不喜欢穆斯林，但仅有20%的左派人士持同样的观点。在法国、意大利和希腊，两方差距也都超过了20%。类似的差距在西班牙和英国也存在。\n\n**欧洲穆斯林从哪里来？**\n\n![](https://pic2.zhimg.com/v2-40b3e96e2de2b048d6396447766d9295_b.jpg)\n\n德国有300多万在海外出生的穆斯林。图片来源：NationalSecular Society\n\n报告显示，截至2010年，欧盟穆斯林总人口为1300万，遍布在27个成员国。从欧洲大陆以外移民进来的穆斯林占总移民人数的39%。在海外出生的300多万德国籍穆斯林，主要来自土耳其，其他还包括科索沃、伊拉克、波黑以及摩洛哥。而在法国，非本土出生的穆斯林共有300万，大多数来自法国前殖民地阿尔及利亚、摩洛哥和突尼斯。\n\n伊斯兰教最初其实在中东也只是很小一块地方信奉，但是由于他们有强烈的排他性和传播意识，结果慢慢占据了几乎整个中东，吞噬了古巴比伦文化。然后扩展到北部非洲，整个消灭了古埃及的文化，接着继续扩展到欧洲，亚洲其它地方。\n\n**西方早晚会被穆斯林搞死**\n\n对于社会的进步，科技的发展，他们是没有一点正面贡献的。相反，他们的繁殖速度，是相当惊人的，而在欧洲这种高福利的地方，孩子多就意味着你可以从政府领导更多的抚养费，于是他们拿着别人的纳税，心安理得的偷窃，抢劫，甚至杀人。最后归结的理由就是，我们有宗教信仰\n\n**荷兰篇：**\n\n阿姆斯特丹和鹿特丹三分之一的人口如今是外国裔。\n\n2012年11月2日，在荷兰发生了一个意外的事件，使欧洲人感到震惊，他们好像突然觉醒。欧洲著名画家的孙子西奥·梵高是一位著名的电影导演，出生在书香门第，因为对穆斯林的生活方式非常不满，制作了一部纪录片电影《屈服》。电影中汇集了许多穆斯林国家妇女不自由的落后画面，并且借用电影中的角色谩骂伊斯兰是人类的文化“垃圾”。\n\n![](https://pic3.zhimg.com/v2-74a128b3c5bd600dc41f9ab7674692f6_b.jpg)\n\n被杀导演梵高\n\n导演梵高在这部本来应当是具有客观学术性的纪录片中，表现了个人过份的情绪，例如他在一个裸体妇女的肉体上显现《古兰经》的经文，这个举动也许对于其它宗教不算过份，可以被容忍，但对于穆斯林绝对不可能宽容。\n\n电影播放后﹐激起了穆斯林的广泛愤怒。11月2日﹐两名年青的枪手在商场附近打死了电影导演梵高。\n\n更可悲的是事情处理的结局：杀害梵高的凶手对两位议员发出死亡威胁，令当局惊恐万状。当局自认为无力保护他们，只好把其中一位女议员送到美国去了6个月，把另一个议员送进牢房一段时间！也就是说，在荷兰的土地上，梵高的孙子被白杀，自己的议员都要去坐牢，就是因为穆斯林觉得他们的主受到了侮辱。\n\n在梵高遇害周年日前几天，他的好友叹息道：“恐怖分子赢了。他们杀害言论自由的领袖人物梵高，比引爆几列火车还要有效。如今没有一个幽默家再敢对古兰经开一句玩笑。然而，放弃一点点言论自由，就等于放弃了整个民主。\n\n比利时篇\n\n比利时斯坦？\n\n比利时是欧洲数一数二人口稠密的国家。狭小的国土面积上居住了1100多万的居民。然而这个在童子尿雕像下鸟语花香的国家，现在却受到了文化上的巨大冲击。\n\n![](https://pic4.zhimg.com/v2-48682be7fd0c16685e65ce04d9682ff7_b.jpg)\n\n![](https://pic3.zhimg.com/v2-de677fdcdf038df66a55e6dc65720e86_b.jpg)\n\n最早的穆斯林移民浪潮发生在上世纪六十年代。荷兰、比利时等国和摩洛哥、土耳其、阿尔及利亚、突尼斯签订了互不干扰的移民协议。作为欧洲出了名的自由国度，荷兰和比利时在宗教上的宽容曾经帮助他们一度成为了欧洲大陆上最为繁盛的国家。\n\n![](https://pic1.zhimg.com/v2-fa60c63ace30510fa8a4e646e0c62b20_b.jpg)\n\n其实他们大都是北非国家。。\n\n![](https://pic2.zhimg.com/v2-568814efbbf58eda84bc65b98f21d7d1_b.jpg)\n\n在人类的新纪元，这两个国家仍然想贯彻自己的民族特性，让更多的穆斯林进入欧洲，帮助他们发展国家。大量穆斯林涌入比利时这个小国，不仅在“搞事情”方面成为了比利时的一块心病，甚至在当地成为了一股新兴的政治势力。请神容易送神难，穆斯林们一来就算是不肯走了。\n\n![](https://pic4.zhimg.com/v2-38b09249b7bb21965c21fa15ae780143_b.jpg)\n\n比利时布鲁塞尔发生针对官员的恐怖袭击后，警察们在街头守卫\n\n早在难民潮到来前的2006年，布鲁塞尔市政府选举就有21%的议员来自非欧洲国家。其中没有华人也没有日本人，绝大多数都是穆斯林。这在当年就已经成为了欧洲的大新闻，周边国家人人自危。毕竟虽然明面上打着宗教自由的旗号，部分穆斯林在一般的欧洲人眼里仍然是落后、愚昧的象征。临近的德国人和法国人不由地考虑，比利时会不会变为比利时斯坦？\n\n![](https://pic2.zhimg.com/v2-7016a6aa10165f48c79820ae52a21821_b.jpg)\n\n布鲁塞尔发生恐怖袭击后，当地居民祈愿和平\n\n随着这几年难民潮的渐渐涌入，布鲁塞尔和安特卫普等名城更是被难民挤得不堪重负。大量穆斯林兄弟的来访以及伊斯兰国在中东制造的事端，让生活在比利时的穆斯林二代三代年轻人兴奋不已。这些摩洛哥后裔虽然有正式的比利时国籍，却因为较低的教育水平和生活水准被当地人当作另类看待，心中自然不服不忿。\n\n![](https://pic1.zhimg.com/v2-f594332ff62531d17994f55935c9bf98_b.jpg)\n\n比利时主要城市\n\n据调查，潜伏在比利时一国境内的穆斯林圣战士就有高达五百人。这些人大多数是20-24岁的移民后裔人，只能通过暴力的方法来宣泄自己的不愉快。不知道高居庙堂的伊斯兰议员会对这些同宗同族的年轻人做出什么样的惩罚措施来？\n\n![](https://pic2.zhimg.com/v2-79ce98ad82811853b128288b59dc90c5_b.jpg)\n\n![](https://pic1.zhimg.com/v2-1e51d2881f3f0c89d33b699a5aaa0290_b.jpg)\n\n更令人觉得悲哀的是，在此种情况下，比利时政府仍然要秉持政治正确的一贯逻辑。就在年初爆炸事件发生之后，比利时外交部长发言时仍然只能暗示“此次犯罪行动和‘所谓’的恐怖分子之间有许多联系。”事实就在眼前，却没有人肯承认，连川普都不由得哀叹摸瞎过日子的比利时快不行了。\n\n![](https://pic4.zhimg.com/v2-8891a71731d91a287f8ef4ae8388d443_b.jpg)\n\n**英国篇：**\n\n脱欧阻止不了英国的穆斯林化\n\n脱欧阻止不了英国的穆斯林化\n\n英国“6.23”公投脱欧成功后，有资深种族主义网民认为：脱欧不利于英国经济，“但從長遠來看，他們為自己的後代留出了相對幹淨的發展環境。”\n\n这种看法不过是一厢情愿。因为脱欧阻止不了英国的穆斯林化，而且，由于英国推崇多元文化的传统，英国今后可能比法、德更早穆斯林化：\n\n2014年英国国家统计局公布的数字表明，英国穆斯林人口为380万人，虽然暂时少于法国（穆斯林人口470万人）和德国（穆斯林人口480万人），但是英国穆斯林的年轻人口的增长势头却超越法国。英、法的穆斯林家庭生育率均在百分之三以上，法国的非穆斯林平均生育率有1.8%,而英国只有1.6%。\n\n英国《泰晤士报》在分析2011年英国人口统计结果时指出，在英格兰和威尔士总共350万年龄不超过5周岁的儿童之中，穆斯林有32万人，比例接近10%，且年龄段越低，其中穆斯林所占的比例越高。\n\n这样下去五十年以后，英国将成为穆斯林人口占多数的国家。此正应了一句：这个世界属于愿意生育的民族；谁拥有了年轻人，谁将拥有未来。\n\n而且英国穆斯林的势力和社会地位的增长势头，很明显超越了法、德：\n\n英国教育部2014年统计，全英国已有136所穆斯林学校，其中125所属于私立学校，且在继续增长。\n\n英国宗教委员会2014统计：全英清真寺已超过9百所，其中不少前身为基督教堂，而且英国穆斯林信徒的人数，已经超过了基督徒，以致有人惊呼：英国快要变成穆斯林国家了！\n\n这种文化穆斯林化的势头，是法国和德国所没有的。\n\n随着穆斯林人口的迅速增长，穆斯林在英国社会地位上升迅速，政治势力增长惊人：现今全英国已有超过三百名穆斯林议员和镇长，2016年巴基斯坦裔穆斯林萨迪克·汗当选伦敦市长，这是历史上首位穆斯林伦敦市长，标志着英国的穆斯林化，取得突破性的进展。\n\n如此政治上的穆斯林化势头，也是法国和德国所没有的。\n\n为什么英国的穆斯林人数比法、德少，穆斯林化的进展却比法、德大得多呢？根本原因在于英国的多元文化的传统：\n\n英国有推崇和优容族群、社团独特性的传统，其优点是多元社会的自由和活力，其致命缺陷是为穆斯林的征服大开方便之门。\n\n而法、德的欧陆传统，决定了他们不象英国那样强调族群和团体，而更注重国家面前公民的个体平等，也就是说，法、德比英国更加国家主义，因此，穆斯林改变法、德的难度，要大于改变英国。\n\n英国脱欧，只能达到减少穆斯林从外部移民英国的目的，而对英国内部穆斯林的扩张和吞噬，根本无能为力。现在英国的穆斯林社区，已经强横到组建穆斯林纠察队，当街干涉非穆斯林妇女着装的地步，试问这是“脱欧”能改变的吗？\n\n在穆斯林化一马当先的情况下，穆斯林难以同化的特点，对英国就是致命的：太多的穆斯林表示，他们无论如何也不认同英国，尽管他们家已经在英国生活了两三代。\n\n英国的穆斯林政客和团体虽然拼命强调：穆斯林忠于英国，穆斯林爱好和平、、.云云，但他们无法回避铁的事实：\n\n英国首位穆斯林议员哈立德·迈哈穆德（Khalid Mahmood）在2014年8月承认：大约有2000名IS圣战分子是英国公民。故特朗普大嘴放炮说:英国穆斯林加入IS的人数比参军的还多。\n\n根据英国一项全国性调查，26％的穆斯林表示，无论如何他们也不会忠于英国；40％支持用伊斯兰宗教法代替英国的法律；13％支持盖达恐怖活动。在有些英国城镇，穆斯林甚至讨论建立“伊斯兰议会”，为将来在英国境内建立“穆斯林省”做准备。\n\n英国的红十字会甚至把圣诞树等标志从他们办的“慈善中心”拿掉，怕冒犯当地的穆斯林。英国穆斯林要求取消大屠杀纪念日，因为这个纪念日只纪念被屠杀的犹太人，而不纪念被以色列屠杀的巴勒斯坦人。\n\n极端分子甚至放话说早晚要用民主手段在唐宁街10号悬挂伊斯兰旗帜。其实现在英国已经不知道该挂什么旗了。2005年英国监狱已经禁止悬挂英国国旗，国旗可能会令穆斯林联想到十字军。驾照与车辆注册局，以及Heathrow机场，也都禁止悬挂国旗。恐怖分子如果只是爆炸建筑物和交通设施的话不可怕，最可怕的是让你一点一点感觉不舒服，然后慢慢妥协。\n\n另：英国现在新生儿的最常见姓是：穆罕穆德\n\n脱欧后经贸滑坡、孤悬海外，既引发苏独复起、北爱离心，又遭穆斯林内部吞噬日甚，英国危矣！\n\n**法国篇：**\n\n法国曾经是北非伊斯兰国家的主要殖民主义宗主国，为法国对外开拓、占有和掠夺这些古老的国家而骄傲。 法国的殖民主义政策与其它欧洲国家有所不同，不许可那里人民高度自治，而实行全面法国化改造，强制他们学习法语，社会制度法国化，甚至把一些殖民地看作是法国领土的一部分，称为“海外省”，把以法国为中心的所有海外殖民地称为“法语世界”，以维护永固的殖民制度，成为一个世界霸权。 二战之后，反殖民主义浪潮高涨，法国被迫允许他们名义上获得独立，但仍旧维持不平等的经济关系，并且引进廉价劳动力。 这些会说法语的北非穆斯林大量涌入法国本土，半个世纪来，法国的穆斯林人口增加了五十倍，如今超过六百万，人口占法国总人口超过10%。\n\n![](https://pic4.zhimg.com/v2-1678df2844132c3ecf25aa27a588efeb_b.jpg)\n\n法国曾经鼓励过穆斯林与法国人通婚，来消化穆斯林，结果发现世界各地来的穆斯林都遵守伊斯兰的婚姻法制，以要求对方归信伊斯兰为结婚条件，所以凡是与穆斯林结婚的法国女子或男孩都变成了新穆斯林，更加增加了穆斯林的人口。 专家警告说：这是一个可怕的趋势，因为根据计算，这样下去，再过25年，法国的穆斯林人口将超过半数，法国的西方文明将无法维持，到那时，按照大多数人口的选举民主，他们可能宣布，法国是一个伊斯兰国家。\n\n法国的穆斯林家庭来看，其生育率是8.1（法国平均生育率只有1.8）。而法国的二十岁及以下人口中，30%是穆斯林背景。按照目前发展的速度，39年后法国将成为一个伊斯兰共和国（法国最大的港口城市——马赛现在实际上已经穆斯林化了）。而在荷兰，50%的新生婴儿来自穆斯林家庭。十五年后，一半荷兰人口将是穆斯林。在比利时，25%的人口已经是穆斯林，50%的新生婴儿来自穆斯林家庭。在德国，联邦统计办公室说，到2050年，德国将成为一个伊斯兰国家。可以说欧洲大陆难逃伊斯兰化的命运。极右的布雷维克2011年在号称世界最安全的国家挪威屠杀了77人，制造了二战以来最惨重的悲剧，他自称此举是为了提醒世人伊斯兰社会的迅速扩张。如果欧洲伊斯兰化了，西方文明演变成伊斯兰文明，西方的民主还有存身之处吗？\n\n![](https://pic2.zhimg.com/v2-cbb0275915aaca362ec558e05a78eb25_b.jpg)\n\n法国是西方国家中接纳穆斯林移民最早和最多的国家之一。由于法国的法律禁止进行各种基于宗教与种族的数据统计，故无法获得更精确的数字。一般认为，法国有400万——500万穆斯林，几乎是法国总人口的1/10，其中近一半的人已是法国公民。在这个以天主教徒为主的国家里，穆斯林的人数已经超过了新教徒和犹太教徒，伊斯兰教已经成为法国的第二大宗教。法国穆斯林绝大多数是来自法国前北非班民地（阿尔及利亚、摩洛哥和突尼斯，统称马格里布地区）的移民及其后代，而来自西非国家、土耳其、印度次大陆的穆斯林移民只占很小一部分。据统计，2000年时法国穆斯林居民的原籍构成如下：阿尔及利亚裔为155万人，摩洛哥裔为100万人，突尼斯裔为35万人，黑非洲裔为25万人，土耳其裔为31.5万人，亚洲裔为10万人，皈依者为4万人，难民或非法移民为35万人。\n\n所有的西欧国家都面临着同样穆斯林人口剧增的问题﹐如法国﹑英国﹑德国﹑荷兰﹑比利时﹑瑞士﹑西班牙﹑瑞典﹑丹麦等﹐法国最感到棘手。法国穆斯林人口25年后过半数，极有可能变成伊斯兰帝国。\n\n六十年代的法国是安全的，但随着穆斯林移民的涌入，犯罪率直线上升。据“国家统计研究所”（INS）的数字，1960年法国犯罪率是12％，到2000年时增长70％；警方说，法国境内的60％罪犯，90％以上的犯罪活动主谋，都是（穆斯林）移民。\n\n六十年代的法国是安全的，但随着穆斯林移民的涌入，犯罪率直线上升。据“国家统计研究所”（INS）的数字，1960年法国犯罪率是12％，到2000年时增长70％；警方说，法国境内的60％罪犯，90％以上的犯罪活动主谋，都是（穆斯林）移民。\n\n法国曾经是北非伊斯兰国家的主要殖民主义宗主国，为法国对外开拓，占有和掠夺这些古老的国家而骄傲。法国的殖民主义政策与其它欧洲国家有所不同，不许可那里人民高度自治，而实行全面法国化改造，强制他们学习法语，社会制度法国化，甚至把一些殖民地看作是法国领土的一部分，称为“海外省”，把以法国为中心的所有海外殖民地称为“法语世界”，以维护永固的殖民制度，成为一个世界霸权。\n\n二战之后，反殖民主义浪潮高涨，法国被迫允许他们名义上获得独立，但仍旧维持不平等的经济关系，并且引进廉价劳动力。这些会说法语的北非穆斯林大量涌入法国本土，半个世纪来，法国的穆斯林人口增加了五十倍，如今超过六百万。\n\n令法国当局和殖民主义学者们感到意外的是，这些穆斯林愿意学习法语，在法国读书工作挣法郎，但不愿意放弃伊斯兰，不接受法国的西方世俗文化，严格保持穆斯林的生活方式和伊斯兰特征。他们虽然脱去了阿拉伯大袍，穿牛仔裤，说标准的法语，但伊斯兰的思想没有被改造，成为地道的法国穆斯林。\n\n根据学者们的政治设计和规划，进入法国的移民不承认他们的宗教信仰，所以在历来的人口普查中，没有“宗教”这个项目，他们以为不给他们信仰的地位，以后就自然消融不存在了，都接受了法国的“美好自由的生活”。社会学研究和人口统计学的专家们发现：不承认他们的信仰是掩耳盗铃，潜伏危险。\n\n例如生活在法国的穆斯林人群中，25岁的年轻人占三分之一，他们坚持是穆斯林，信仰伊斯兰，不接受西方生活方式的改造，以伊斯兰的传统体制组织活动。法国爱猫扑，爱生活曾经鼓励过穆斯林与法国人通婚，来消化穆斯林。\n\n结果发现世界各地来的穆斯林都遵守伊斯兰的婚姻法制，以要求对方归信伊斯兰为结婚条件。所以凡是与穆斯林结婚的法国女子或男孩都变成了新穆斯林，更加增加了穆斯林的人口。\n\n专家警告说﹕这是一个可怕的趋势，因为根据计算，这样下去，再过25年，法国的穆斯林人口将超过半数，法国的西方文明将无法维持，到那时，按照大多数人口的选举民主，他们可能宣布：法国是一个伊斯兰国家。\n\n穆斯林人口迅速增长的趋势在大部份西欧国家是普遍现象，许多国家都在努力控制穆斯林的组织和社会团体，但伊斯兰的教义有充份抵制外来文化改造的固有潜力，使大多数设想和规划都化为泡影。法国和欧洲其它国家的穆斯林，普遍的思想是，他们是“生活在异教徒国家的穆斯林”。不但不接受社会融入，而且决心用伊斯兰改造西方社会。\n\n![](https://pic3.zhimg.com/v2-9a1ac57311078e8327f36e60751a3ab6_b.jpg)\n\n当前这些前法国殖民地的穆斯林移民们，他们进入法国是为了就业﹑安家﹑定居，在法国生儿育女，建立稳固的穆斯林社会，绝不会放弃伊斯兰信仰和文化。战后有两千万穆斯林迁移到西欧国家，他们来寻求美好的生活，也承担着传播伊斯兰的神圣使命，因此，希望用西方的生活方式改造穆斯林，纯属痴心妄想。\n\n基督教的欧洲人的生育率在西方世俗生活方式下越来越低，现在只有1.6，远低于维持人口数量所需的2.3，而由于欧洲穆斯林的生育率远高于信仰基督教的欧洲人，因此，整个欧洲可以预见的结局是最终伊斯兰化。问题是如果将来欧洲真的伊斯兰化，那世界将如何？是否会最终也将全面伊斯兰化？恐惧…\n\n**德国篇：**\n\n[#德国#](http://link.zhihu.com/?target=http%3A//huati.weibo.com/k/%25E5%25BE%25B7%25E5%259B%25BD%3Ffrom%3D501)SPD党的融入专员Aydan Özoguz女士（土耳其裔穆斯林）呼吁给给没有德国籍的“移民”：市镇乡选举权、公投权、入德国籍简化、移民双国籍、强迫企业雇佣一定比例的移民。\n\n（译文：野罂粟）\n\n![](https://pic1.zhimg.com/v2-e7e18e566cea6261524dafe55533fdb4_b.jpg)\n\n![](https://pic4.zhimg.com/v2-19db84fded5218a7087d75f23ea9df9b_b.jpg)\n\n![](https://pic1.zhimg.com/v2-5fdfaa2e0c2ba541ee158206a4d56610_b.jpg)\n\n德国中部的穆斯林难民甚至打出了要求自己划地而治的旗号。按照他们的草案，穆斯林难民会在德国腹地北莱茵威斯特法伦州画出一块飞地，建立伊斯兰自治区。此处禁止供应非清真食品，女性也必须披头巾才能够上街。这种法外之地不可能得到州政府的回应，但是随着时间的推进，谁又知道今后会发生什么呢？\n\n![](https://pic3.zhimg.com/v2-76ae6460c5ff75764acbb6d088a26356_b.jpg)\n\n该州位于德国西部\n\n目前居住在德国的难民已经无法统计。保守估计100万，甚至有可能达到200万人。而德国国内的人口总数也不过是8000万。光是难民的人口数量就已经占掉了这个国家的2.5%——按比例举个例子，你能想象北京或者上海街头有50万操着你听不懂的外语、留着大胡子、对女性可能不太礼貌的难民出现吗？\n\n![](https://pic3.zhimg.com/v2-d9eff92793726b06ba4d6078ac818ace_b.jpg)\n\n德国的穆斯林难民，每一个小人代表10万穆斯林\n\n德国各地最近还频发各种针对女性的性侵犯事件。尽管警方往往没有足够的证据证明这就是难民干的，但如果你仔细统计受害者们对罪犯的口头描述，还是能发现他们往往具有典型的中东人特征。德国一直以来还算是欧洲大国里治安好的，今天这个样子，实在是叫人无奈。\n\n也正因为治安越来越差，难民营建到哪儿，哪儿的房价就应声而落。据说法兰克福火车站边的居民区房价已经被腰斩。开发商哭天抢地，也救不了自己的楼盘了。\n\n![](https://pic1.zhimg.com/v2-2b13b592000ad9d7cfab78df220c894c_b.jpg)\n\n德国警察与难民冲突\n\n默克尔称德国建立战后多元文化社会的努力彻底失败：\n\n国际在线专稿：据英国《每日邮报》报道，德国总理默克尔表示，德国试图建立一个战后的多元化社会的努力“彻底失败了”。\n\n默克尔在波茨坦举行的一次集会上发表演说，这被认为是一次具有里程碑意义的讲话，她表示希望打破来自不同背景的人在德国和当地人和谐共处的隔阂，但是这个努力彻底失败了。据统计，目前大约有700万外国人居住在德国，其中430万是穆斯林，并建有超过3000座清真寺。\n\n默克尔表示： “所谓‘多元文化主义(multikulti)’的概念，即‘我们一起快快乐乐地生活’。但这一想法已经行不通了。”但默克尔同时强调，伊斯兰社区是德国的一部分，穆斯林移民需要学习德语，努力融入德国社会。而仅仅几天前有一项民调显示，三分之一的德国人希望定居德国的外国人回国，认为他们除了用欺骗方式获得更多的移民福利，什么好处也不能为德国带来。\n\n![](https://pic2.zhimg.com/v2-c969842bc6cb2d38dfde1ef06f20a649_b.jpg)\n\n尽管不少人认为移民增加了社会体系负担，但默克尔称德国需要海外专家来维持经济发展。德国共商总会会长德里夫特曼表示，目前德国急需40万名工程师和合格劳工。\n\n之前德国央行德意志联邦银行的董事萨拉辛在一本名为《德国的自我毁灭》的书中称，400万穆斯林涌入德国，德国整体识字率和数学能力都“大幅下降”，德国正逐渐变成一个“笨蛋国家”。随后一项民调显示，有五分之一的人表示，如果萨拉辛要组建一个自己的党派，那么他们将会支持这个党派。"
		}
	]
}