{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Es kann so einfach sein . . .",
			"body": "Nachwuchs für die Elektrotechnik / Informatik ist gesucht. Unter Schülern gilt \"Elektrotechnik\" als \"schwieriges\" Studium. Aber man könnte ihnen zeigen, dass sie selbst schon mit einfachsten Mitteln witzige Lösungen basteln können: http://spurt.pbworks.com/w/page/9145781/Simpelmobil",
			"added": 1528514057
		},
		{
			"topic_id": 2,
			"title": "Die nächsten Mini Maker Faires . . .",
			"body": ". . . finden da statt: https://harenberg-maker.de/events/thalia-mini-maker-faire-20180825/",
			"added": 1533623538
		},
		{
			"topic_id": 3,
			"title": "Nachrichten",
			"body": "http://127.0.0.1:43110/1RivERqttrjFqwp9YH1FviduBosQPtdBN",
			"added": 1534840088
		},
		{
			"topic_id": 4,
			"title": "Klimawandel",
			"body": "Gab es zum #Klimawandel schon mal Ideen, ob man testen könnte, eine Art #Sonnenschirm für die Erde im Lagrange-Punkt L1 auszubringen? Könnte z.B. eine Wolke aus Staubteilchen da messbare Effekte bringen? Wie läge der Aufwand im Vergleich zu bisher angedachten irdischen Maßnahmen? Zu den Auswirkungen des Klimawandels für die kommenden Jahrzehnte ist ja sicherlich die Größe des gesamten auf uns zu kommenden Kostenbergs abgeschätzt worden. Wäre es rationeller, das Geld in diesen Sonnenschirm zu investieren?",
			"added": 1536388726
		},
		{
			"topic_id": 5,
			"title": "Das Projekt Solid von Tim Berners-Lee",
			"body": "Im englischen Zweig hier hat auch gerade eine Diskussion darüber angefangen. Es geht um dieses Projekt: https://solid.inrupt.com/\nWer von Euch ein Händchen für das Fabrizieren von Software hat: Da kann man noch was bewegen.",
			"added": 1539148972
		},
		{
			"topic_id": 6,
			"title": "Kunterbunt frisch fabriziert",
			"body": "Es geht um diesen geklonten Blog: http://127.0.0.1:43110/18SUBtcYrBuCKBAnDzaMResafL2JeD2hhQ/?Home",
			"added": 1541150100
		},
		{
			"topic_id": 7,
			"title": "Kann es sein, dass hier schon mal mehr los war?",
			"body": "Trügt der Eindruck, oder sind die Nutzerzahlen wirklich zurückgegangen?",
			"added": 1573759090
		}
	],
	"topic_vote": {
		"1_18j9agkWyFjhMFeUN5szY17wKiUQn95RfL": 1
	},
	"next_comment_id": 33,
	"comment": {
		"1_18j9agkWyFjhMFeUN5szY17wKiUQn95RfL": [
			{
				"comment_id": 1,
				"body": "> [naturaljoe](#comment_1_1MHsEhziHaatBzZNG72rKCAQZpZvdBCF5A): und hier noch einer! :)\n\nKann man mit ZeroNet rationell was sinnvolles machen, oder ist das mehr so ein Testbeispiel, um mal ausprobiert zu haben, dass ein Netzwerk ohne Server – also nur aus Peers – auch funktionieren kann?",
				"added": 1523281997
			},
			{
				"comment_id": 10,
				"body": "Die Idee war, ein grobes Gefühl dafür zu bekommen, mit wieviel Leuten man hier in der Gruppe etwa rechnen kann. Wie hätte man besser anders fragen sollen?",
				"added": 1537634889
			}
		],
		"1_13hSQgvTK6DKhaibEh2nRAposTN4wGQckW": [
			{
				"comment_id": 2,
				"body": "Mir geht es auch so: echobot antwortet nicht mehr. Dazu sind Mails aus dem Eingang verschwunden, die mal da waren, z.B. die erste Begrüßungsmail und dann auch eine frühere Antwort vom echobot. Was mache ich falsch?",
				"added": 1525711602
			},
			{
				"comment_id": 3,
				"body": "> [froxlr](#comment_5_1NxHLTcNysskS1fr6tYvrLdbD3d1qqjLYf): Moinsen,also bei mir wie auch bei einigen anderen Usern funktioniert der Bot entweder gar nicht oder antwortet erst nach langer Zeit. Wenn du das Versenden testen willst, schicke lieber eine kurze Nachricht an einen Nutzer. Ich denke, die wenigsten hier stört es, wenn du sie kurz anschreibst.BB,froxlr\n\nUnd seltsam ist auch: \"update failed\" (7 files) bei ZeroMail bekomme ich bei einem meiner Rechner, bei einem anderen aber nicht. Und wie gesagt: von allen früher mal gesehenen Eingangsmails ist nur noch eine übrig . . .",
				"added": 1525759750
			},
			{
				"comment_id": 4,
				"body": "> [lin0x](#comment_9_17HsAnNw1DYuQgTAzjE1jFXdPXEQs9PGuJ): Da kannst du - soweit ich weiß - leider nur warten, bis alle Files geladen werden konnten. Bei mir bestand das Problem auch einige Zeit, aber im Laufe mehrerer Tage konnten dann irgendwann alle upgedated werden. Seither gibt es da auch kein Problem mehr. Zumindest wenn man vom EchoBot absieht, aber das liegt ja scheinbar nicht an uns ;-)In dem Kontext vielleicht nicht ganz uninteressant: Wir hatten das Thema vor ein, zwei Wochen hier schon mal.\n> LG\n\nAha, danke, warten wir's ab :–)",
				"added": 1525767909
			}
		],
		"1_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": [
			{
				"comment_id": 5,
				"body": "> [jirbfkljbfklhbf](#comment_4_12X3Jupm3G2WeLHaq5N7DRizW2p9gUNSte): die sind hinterher genau so arbeitslos wie alle anderen. hör auf die jugend zu verarschen.\n\nOh, das habe ich jetzt nicht verstanden, was der Kommentar mit dem technischen Gag zu tun hat?",
				"added": 1532930918
			},
			{
				"comment_id": 6,
				"body": "> [jirbfkljbfklhbf](#comment_4_12X3Jupm3G2WeLHaq5N7DRizW2p9gUNSte): die sind hinterher genau so arbeitslos wie alle anderen. hör auf die jugend zu verarschen.\n\nAch so, ja, ich kenne auch Zeiten, in denen Ingenieure arbeitslos waren, aber aus den letzten Jahren wüsste ich nicht, welcher Absolvent bei den Ingenieuren und Informatikern nach der Ausbildung ohne Job geblieben wäre.",
				"added": 1532931920
			},
			{
				"comment_id": 7,
				"body": "> [jirbfkljbfklhbf](#comment_4_12X3Jupm3G2WeLHaq5N7DRizW2p9gUNSte): die sind hinterher genau so arbeitslos wie alle anderen. hör auf die jugend zu verarschen.\n\nAlso, haben wir hier Absolventen bei Ingenieuren und Informatikern aus den letzten Jahren, die besondere Schwierigkeiten hatten, in einen Job zu kommen? Die könnten sich ja mal melden, um das Bild hier zu vervollständigen.",
				"added": 1532932348
			},
			{
				"comment_id": 8,
				"body": "> [jirbfkljbfklhbf](#comment_4_12X3Jupm3G2WeLHaq5N7DRizW2p9gUNSte): die sind hinterher genau so arbeitslos wie alle anderen. hör auf die jugend zu verarschen.\n\nOder: Kennt hier jemand Absolventen aus seiner Umgebung, die in jüngerer Zeit nach der Ausbildung als Ingenieur oder Informatiker keine Chance haben, einen Job zu bekommen, so dass wir hier zu Recht sagen können, dass \"die Jugend\" sich \"verarscht\" sehen muss?",
				"added": 1532954415
			},
			{
				"comment_id": 18,
				"body": "> [jirbfkljbfklhbf](#comment_4_12X3Jupm3G2WeLHaq5N7DRizW2p9gUNSte): die sind hinterher genau so arbeitslos wie alle anderen. hör auf die jugend zu verarschen.\n\nEben geht wieder die Vermutung durch die Medien, dass wir zu wenig Ingenieure haben werden. Meinst Du wirklich, dass Ingenieurstudenten \"hinterher genau so arbeitslos wie alle anderen\" sind? Warum vermutest Du das? Kennst Du viele arbeitslose Ingenieure?",
				"added": 1542105946
			}
		],
		"4_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": [
			{
				"comment_id": 9,
				"body": "> [hermes32](#comment_15_1LFxK1BSHEnkJcXXb4qGszVUxEwqLVSJU8): So ein Blödsinn. Was kommt als nächstes ? Ein gigantischer Wasserfilter im Ozean welcher das (Micro)Plastik herausfiltert ?\n> Was wir bräuchten ist gesunder Menschenverstand mit blick auf die Umwelt. (zitat Harald Lesch)\n> Oh Herr lass endlich Hirne regnen.\n\nKeine Frage, gesunder Menschenverstand wäre die deutlich bessere Lösung! Doch falls wir feststellen sollten, dass es daran ganz arg mangelt – vielleicht sogar in existenziellem Ausmaß – welche Möglichkeiten hätte man dann noch, um gegenzusteuern? Übrigens wurde auch mal Alfred Wegners Idee der Kontinentalverschiebung als kompletter Blödsinn angesehen . . . :-)",
				"added": 1536428322
			}
		],
		"1_1Gvgnvbm6tiMgrMQFBSpWVmM8J2WQ1h3cJ": [
			{
				"comment_id": 11,
				"body": "Keine Ahnung. Vermutlich meinst Du Seiten hier im ZeroNet? Welche Themen interessieren Dich denn? Dann lass uns dazu einfach deutschsprachige Seiten aufmachen, damit ist dann allen geholfen.",
				"added": 1537941034
			}
		],
		"5_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": [
			{
				"comment_id": 12,
				"body": "Und da gibt es auch einen Chat, wo man sich mit Tim Berners-Lee und seinen Mitstreitern über die Idee und die eigenen Erfahrungen mit den ersten Versuchen zu \"Solid\" unterhalten kann: https://gitter.im/solid/chat",
				"added": 1539325246
			},
			{
				"comment_id": 15,
				"body": "> [froxlr](#comment_9_1NxHLTcNysskS1fr6tYvrLdbD3d1qqjLYf): Jo, ich hab mir da auch vor einiger Zeit in einem Pod angemeldet. Scheint eine coole Sache zu sein, vielleicht kann man das mit ZeroNet verbinden 🤔\n\nJe mehr Leute jetzt da mitprobieren, um so schneller wird die Sache vorangehen.",
				"added": 1539758578
			},
			{
				"comment_id": 19,
				"body": "Falls es kein Gerücht ist, könnte es bald auch offizielle Unterstützung für die Ideen von Tim Berners-Lee geben:\nhttp://www.spiegel.de/netzwelt/netzpolitik/bundesregierung-plant-offenbar-beitritt-zum-digitalen-gesellschaftsvertrag-a-1238192.html#ref=rss",
				"added": 1542183235
			},
			{
				"comment_id": 20,
				"body": "> [realobiwankenobi](#comment_1_17cXcC6ka7jYNCCM8YHjePUTCmTPi1djS5): Echt eine coole Sache das Solid ;)\n\nIm Moment ist das ja anscheinend erst mal \"nur\" die Kernsoftware, an der intensiv gearbeitet wird, also noch nicht so richtig was für reine Anwender. Erste Anwendungsschichten sind wohl etwa für kommendes Frühjahr geplant. Aber wie gesagt, für Programmierer ist das eben ein Feld, wo man jetzt schon mal einsteigen kann. Was auf jeden Fall schon mal geht, ist die Möglichkeit zur Produktion von Webseiten im eigenen Pod, z.B. sowas: https://schlesier.inrupt.net/public/games/pacman.html (Gesteuert wird das Spiel *nur* mit den Kursortasten.)\nWie man dazu schrittweise vorgehen kann, ist z.B. da beschrieben: https://solid.gitbook.io/solid-hacks/",
				"added": 1543679081
			}
		],
		"4_1JN7Pe12nq1MF39wZJ59wSDoZH5aVVHJ9e": [
			{
				"comment_id": 13,
				"body": "Hast Du Dir das mal angeschaut ( – besonders die letzten hundert Jahre)?\nhttps://xkcd.com/1732/",
				"added": 1539579610
			},
			{
				"comment_id": 14,
				"body": "> [nullbock](#comment_5_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6): Das Problem ist die Auslagerung von Abfall in die Atmosphäre. Statt das endlich anzugehen und Alternativen und alternative Lebensmodelle, die nicht auf weiten Handel angewiesen sind, auszuloten\n\nUnd hier ist das Hauptproblem wieder, dass Leute bestreiten, dass der in die Atmosphäre ausgelagerte Abfall zur Erwärmung geführt hat und sich deshalb weigern, das endlich anzugehen.",
				"added": 1539582311
			}
		],
		"6_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": [
			{
				"comment_id": 16,
				"body": "> [684678687](#comment_1_19ikjxXuox6tn9VyzcKEc5Tox3dJt26h5X): dein scheiss blog interessiert hier keinen\n\nVielen Dank für die Auskunft. Nett wäre, wenn Du einen Tipp geben könntest, was Du hier eher für interessant halten würdest :–)",
				"added": 1541158368
			},
			{
				"comment_id": 17,
				"body": "> [684678687](#comment_1_19ikjxXuox6tn9VyzcKEc5Tox3dJt26h5X): dein scheiss blog interessiert hier keinen\n\nWo liegen denn hauptsächlich Deine Interessen? Kosmonautik? Kosmetik? Religion? Theodizee? Technik? Astronomie? Psychologie? Psychiatrie? Philatelie? Philumenie? Botanik? Ornithologie? Immer frei von der Leber weg – hier hindert Dich niemand, deinen besten Ideen freien Lauf zu lassen. Vielleicht machst Du einfach einen Blog, der mich dann interessiert? Kopf hoch.",
				"added": 1541159974
			},
			{
				"comment_id": 21,
				"body": "Diesen Blog kann ich von zweien meiner Rechner aus editieren. Eben hatte ich von einem Rechner aus was neues geschrieben, und nun wundere ich mich, wie lange es dauert, bis ich die Änderungen am anderen Rechner finde. Noch tut sich da gar nichts. Wie kommt das?",
				"added": 1554112277
			},
			{
				"comment_id": 22,
				"body": "> [wabbe](#comment_21_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj): Diesen Blog kann ich von zweien meiner Rechner aus editieren. Eben hatte ich von einem Rechner aus was neues geschrieben, und nun wundere ich mich, wie lange es dauert, bis ich die Änderungen am anderen Rechner finde. Noch tut sich da gar nichts. Wie kommt das?\n\nAch, nun ging es doch, aber ein paar Stunden hat es schon gedauert.",
				"added": 1554112359
			},
			{
				"comment_id": 23,
				"body": "Neuer Text: Repaircafé",
				"added": 1561701061
			},
			{
				"comment_id": 24,
				"body": "Oh, plötzlich gibt es hier keine Peers mehr ?–(",
				"added": 1562652380
			},
			{
				"comment_id": 25,
				"body": "Neues Posting: \"Balkonkraftwerk\"; Solarmodul wird einfach per Schukostecker mit meinem Wohnungsnetz verbunden und liefert mir Elektrizität zum Selbstverbrauch, die dann nicht per Zähler abgerechnet wird.",
				"added": 1565169096
			},
			{
				"comment_id": 26,
				"body": "> [bober](#comment_1_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): halts maul du opfer. ferpiss dich zurueck inst klarnetz\n\nPardon, weshalb, bitte?",
				"added": 1565175369
			},
			{
				"comment_id": 27,
				"body": "> [cyia](#comment_3_15hNU3VduDTFXv1QikQyrCucZSEMwCZtsn): Funktioniert die Seite gerade nicht? Ich bekomme keine Einträge angezeigt :-(\n\nDas macht mich fertig. Seit Tagen schlage ich mich mit dem jüngsten Posting herum. Da wollte ich ein Video einfügen, aber das wurde (wegen Größe) angemeckert, und seitdem geht nix mehr, auch wenn ich versuche, dieses jüngste Posting total zu löschen. Hoffentlich ist das noch irgendwie reparabel; drückt mir die Daumen.",
				"added": 1566122777
			},
			{
				"comment_id": 28,
				"body": "> [wabbe](#comment_27_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj): Das macht mich fertig. Seit Tagen schlage ich mich mit dem jüngsten Posting herum. Da wollte ich ein Video einfügen, aber das wurde (wegen Größe) angemeckert, und seitdem geht nix mehr, auch wenn ich versuche, dieses jüngste Posting total zu löschen. Hoffentlich ist das noch irgendwie reparabel; drückt mir die Daumen.\n\nBeim Saven bekomme ich die Antwort: \nSignierung des Inhalts fehlgeschlagen\nContent too large 13993749B > 10485760B, aborting task...\n\nKeine Ahnung, was ich jetzt noch machen kann :–(",
				"added": 1566123028
			},
			{
				"comment_id": 29,
				"body": "Ach, es geht wieder. Im Verzeichnis dat/img hatte ich Videos, die wohl zu groß waren. Nach dem Löschen ist der Blog wenigstens wieder lesbar.",
				"added": 1566218656
			},
			{
				"comment_id": 30,
				"body": "Eben einen Eintrag für \"NaNoWriMo\" gemacht, und gleich geht es weiter mit dem Thema \"Nand2Tetris\" :–)",
				"added": 1570507466
			},
			{
				"comment_id": 31,
				"body": "> [firstneedle](#comment_1_1LszmRhPzWqzvRQdBcnepykipJ5QgmyCHd): Danke für den schönen Blog!\n\nJa aber immer wieder gern :–)",
				"added": 1570899932
			}
		],
		"1_1BnXe3p9WBoFLP5qpPUbE88t9ixVxahD2x": [
			{
				"comment_id": 32,
				"body": "Ich bin inzwischen für https://wt.social/",
				"added": 1584689182
			}
		]
	},
	"comment_vote": {
		"1_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": 1,
		"1_1MHsEhziHaatBzZNG72rKCAQZpZvdBCF5A": 1,
		"13_1LFxK1BSHEnkJcXXb4qGszVUxEwqLVSJU8": 1,
		"1_1Fc3jLgQGaMHRgsjUTQYGGXie2MbMoqmY5": 1,
		"1_1BYRuYF6RaWWAfEBmQrb949WtZbbsP1Kh3": 1,
		"2_14tkD6qqifoVQs5aKacz9vQJSME92za5cw": 1,
		"3_18dxDGiugpDmk7Uoc4QAKcLQKyysL7ybSy": 1,
		"1_1LcbvJ4ttFZooAeuDUE3jZbmk94LDTuNbV": 1,
		"1_1F4Ejco1xoDXmfas3PgDoxP6MJnir5CHbh": 1,
		"2_1HMFrCYpMeyVCM9e62B6yt1964ED9hs6gm": 1,
		"1_1JotUZXuxBXpqGxowyTTUbBMZoAFvzteea": 1,
		"1_1DVd64Knf2A3xTvbDwFLdbTUJGLYDuqmFy": 1,
		"1_14vCYUEx8SnDWRdT92u83A4X7thWEYAHXD": 1,
		"2_1BiF6pbU1EkhV2ojqMAdEeeGFH8LH8Y3sQ": 1,
		"2_1PuEpLmGzwDtWzVn96wr8iyzyubM5YFQoX": 1,
		"1_18bFDCjpzKhiU7AA6y9hhVVtpN1JaPokF9": 1,
		"5_1LFxK1BSHEnkJcXXb4qGszVUxEwqLVSJU8": 1,
		"1_177ia43eQrnWCHCWt1ik6viQGRzWuNXGzD": 1,
		"1_18P7HcmnENFWkpQFtPjnjHv6x9p2eHa6rp": 1,
		"2_1ByuEoBeryNCZXqRArMfDiAL9bFTqmM5yN": 1,
		"1_1BFh4e3Ln78uq8ccfvz8ADVNv2NWGh7Hgo": 1,
		"1_1M8579Juh5MY92k77jAavFedf6zrzSZjgH": 1,
		"1_14dhXLR6HYKWnhz4tkJpiX1Btp3tteyamH": 1,
		"1_1ApbhMcvUFu2Xi2uWW9uLqkgNPuV89Gx11": 1,
		"1_1ykGA9K9PopqyZbb39qXaCKdohwrjKswR": 1,
		"3_1CKA5cKZ2nmcXGSZcWKbzHUHu1UmJrkzAT": 1,
		"1_1KkA3C1iVDfieotYpuPUCpUtKzdFcfHMRy": 1,
		"6_18j9agkWyFjhMFeUN5szY17wKiUQn95RfL": 1,
		"4_18j9agkWyFjhMFeUN5szY17wKiUQn95RfL": 1,
		"1_16nZf7G4qaYRtFpHM9MM1A32nV5oqU9TW1": 1,
		"3_18j9agkWyFjhMFeUN5szY17wKiUQn95RfL": 1
	}
}