{
	"file": {
		"WARNING!! NANOPARTICLES IN COVID VACCINES WILL LINK YOU WITH DARPAGATES DNA TECHNOLOGY.mp4": {
			"title": "WARNING!! NANOPARTICLES IN COVID VACCINES WILL LINK YOU WITH DARPAGATES DNA TECHNOLOGY",
			"type": "video",
			"description": "Source: \nhttps://www.bitchute.com/video/8mGWTXGBw8Pp/",
			"is_featured": 0,
			"size": 65220356,
			"date_added": 1623086607
		},
		"Healing The Elite Way.mp4": {
			"title": "Healing The Elite Way",
			"type": "video",
			"description": "Healing The Elite Way by Lindsey Williams",
			"is_featured": 0,
			"size": 259909960,
			"date_added": 1623340299
		},
		"Utopia (2020) - E1 - Life Begins.mp4": {
			"title": "Utopia (2020) - E1 - Life Begins",
			"type": "video",
			"description": "No information",
			"is_featured": 0,
			"size": 468882869,
			"date_added": 1624811121
		},
		"TorahCodesEndToDarkness_fixed.mp4": {
			"title": "Torah Codes: End To Darkness",
			"type": "video",
			"description": "There is a Code in the Torah, the first five books of the Old Testament. The Code is real, and mathematically provable. The events now happening in the world are encoded in the Torah, but that's not all. The film interviews the world experts on the Code, as well as showing the most recent events that have taken place, and are taking place, in Israel and around the world. For the first time, Pinlight's production of TORAH CODES interviews the world experts in New York City and Jerusalem: Prof. Robert Haralick, Prof. Eliyahu Rips, Dr. Alex Rotenberg, Rabbi Matityahu Glazerson and Art Levitt. Also in this film are the events that shaped Israel's recent war with Hamas, as related by blockbuster screenplay writer Dan Gordon.",
			"is_featured": 0,
			"size": 684009384,
			"date_added": 1625240677
		},
		"A Closer Look At Open3DLab.mp4": {
			"title": "A Closer Look At Open3DLab",
			"type": "video",
			"description": "I used to think this site was ok, but after the treatment they gave me and finding out their dark secrets, I have to expose them for the good of everyone.\n\nI hope this helps you. God bless!\n\ntwitter.com/NoahJamesBangs/sta…\narchive.today/RWJfZ\narchive.today/hhkAZ\narchive.today/VOEep\narchive.today/BoCSw\narchive.today/KMzYL\nhttps://odysee.com/@FrenchPaperHatter:d/Website-Review--Smutbase-SFMLab-Open3DLab:5?r=H9jvnQcmj7d2HoSBnyk9uYm54wZ8XVfu\nhttps://odysee.com/@FrenchPaperHatter:d/Damning-Evidence--Smutbase%27s-Trolling---Racism:2?r=H9jvnQcmj7d2HoSBnyk9uYm54wZ8XVfu\nhttps://odysee.com/@FrenchPaperHatter:d/Smutbase-Double-Standards:6?r=H9jvnQcmj7d2HoSBnyk9uYm54wZ8XVfu\n\nMusic\n------------\n\nIndustrial Cinematic by Kevin MacLeod\nLink: https://incompetech.filmmusic.io/song/3909-industrial-cinematic\nLicense: https://filmmusic.io/standard-license",
			"is_featured": 0,
			"size": 325537329,
			"date_added": 1625956262
		},
		"Song Of The South [Blu-Ray Compatible].mp4": {
			"title": "Song Of The South (1946)",
			"type": "video",
			"description": "Seven-year-old Johnny is excited about what he believes to be a vacation at his grandmother's Georgia plantation with his parents, Sally and John Sr. When they arrive at the plantation, he discovers that his parents will be living apart temporarily, and he will live at the plantation with his mother and grandmother while his father returns to Atlanta to continue his controversial editorship of that city's newspaper. Distraught at his father's departure, Johnny secretly leaves for Atlanta that night with only a bindle.\n\nAs Johnny sneaks away from the plantation, he is attracted by the voice of Uncle Remus telling tales of a character named Br'er Rabbit. By this time, word had gotten out that Johnny was missing, and some plantation residents are looking for him. Johnny evades being discovered, but Uncle Remus catches up with him, befriends him, offers him food for his journey, and takes him back to his cabin, where he tells the boy the traditional African-American folktale, \"Br'er Rabbit Earns a Dollar a Minute\". In the story, Br'er Rabbit attempts to run away from home only to change his mind after an encounter with Br'er Fox and Br'er Bear. Johnny takes the advice and lets Uncle Remus take him back to his mother.\n\nJohnny makes friends with Toby, a young black boy who lives on the plantation, and Ginny Favers, a poor white girl. Ginny gives Johnny a puppy after her two older brothers, Joe and Jake, threaten to drown it. Johnny's mother refuses to let him take care of the puppy, so he takes it to Uncle Remus. Uncle Remus takes the dog in and delights Johnny and his friends with the fable of Br'er Rabbit and the Tar-Baby, stressing that people should not get involved with something they have no business with in the first place. Johnny heeds the advice of how Br'er Rabbit used reverse psychology on Br'er Fox and begs the Favers brothers not to tell their mother about the dog. The reverse psychology works, and the boys go to speak with their mother, then realize that Johnny had fooled them. In an act of revenge, they tell Sally about the dog. She becomes upset that Johnny and Uncle Remus kept the dog despite her order (which was unknown to Uncle Remus). She instructs Uncle Remus not to tell any more stories to her son.\n\nJohnny's birthday arrives and Johnny picks up Ginny to take her to his party. On the way there, Joe and Jake push Ginny into a mud puddle. With her dress ruined, Ginny is unable to go to the party and runs off crying. Johnny begins fighting with the boys, but their fight is broken up by Uncle Remus, who scolds Joe and Jake. Johnny runs off to comfort Ginny. He explains that he does not want to go either, especially since his father will not be there. Uncle Remus discovers both dejected children and cheers them up by telling the story of Br'er Rabbit and his \"Laughing Place\". When the three return to the plantation, Sally becomes angry at Johnny for missing his own birthday party, and tells Uncle Remus not to spend any more time with him. Saddened by the misunderstanding of his good intentions, Uncle Remus packs his bags and leaves for Atlanta. Johnny rushes to intercept him, but is attacked by a bull and seriously injured after taking a shortcut through a pasture. While Johnny hovers between life and death, his father returns. Johnny calls for Uncle Remus, and his grandmother escorts him in. Uncle Remus begins telling a tale of Br'er Rabbit and the Laughing Place, and the boy miraculously survives.\n\nLater, a fully recovered Johnny sings with Ginny and Toby while Johnny's returned puppy runs alongside them. Nearby, Uncle Remus is shocked when Br'er Rabbit and several of the other characters from his stories appear in front of them and interact with the children. Uncle Remus rushes to join the group, and, together, they all skip away into the sunset.\n\n\n[The release of this film on this site may as well be the official release, because now Disney has no way of removing it due to the blockchain's permanence]",
			"is_featured": 0,
			"size": 587533523,
			"date_added": 1631390703
		}
	}
}