{"cert_user_id": "hwegge2@github", "next_topic_id": 2, "topic": [{"topic_id": 1604066183, "title": "How-to implement non-internet networks (Bluetooth, Wifi, Radio Comm, Meshnets, etc.)", "body": "As mentioned in the ZeroNet presentation, it was noted that it could be implemented for non-internet networks (Bluetooth, WiFi, Radio Comm, Meshnets, etc.) \r\n\r\n[https://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub?start=false&loop=false&delayms=3000&slide=id.g11ba381582_0_0](url)\r\n\r\nAssuming you would be on a private intranet for this, what modifications to the code base would need to be implemented in order to support such a change. \r\n\r\nThis is also assuming a private distributed ledger would have to be made in order to point and update to a private block-chain. ", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1508171697, "modified": 1509926275, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1153", "source_type": "github"}], "next_comment_id": 3, "comment": {"1604066183_mirrored_hwegge2_github": [{"comment_id": 1, "body": "@unsystemizer  This would be for running a private instance of ZeroNet in an Intranet Type environment. (i.e. setting up a private Namecoin Ledger)\r\nhttps://themerkle.com/altcoins-dying-make-one-hour/\r\n", "added": 1509892908, "modified": 1509892939, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1153#issuecomment-341990970", "source_type": "github"}, {"comment_id": 2, "body": "Not quite, it was actually discussed as a use case in documentation.  As note above the plug-in already is implemented for a bootstrapped build. A majority of altcoins are forks of other crypto-currencies, so the logic behind this would be to perhaps implement a blockchain agnostic feature to perhaps support any coin with name value stores (ie. Emercoin) in order to further decentralized DNS and identity management.", "added": 1509926275, "modified": 1509926275, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1153#issuecomment-342033889", "source_type": "github"}]}}