{
	"next_topic_id": 954,
	"topic": [
		{
			"topic_id": 38,
			"title": "有句話說得好，中國人是在野的共產黨，共產黨是執政的中國人。",
			"body": "他們痛恨的並非奴役，而是恨自己沒有參與奴役的機會。他們痛恨的不是貪腐，而是痛恨自己沒有貪腐的機會。",
			"added": 1530336990
		},
		{
			"topic_id": 52,
			"title": "只要是华人扎堆的社区，就不再是最好的社区了，这是铁的定律。",
			"body": "海外华人，一定要保持离散，有华人搬入一个本来没有华人的社区，就一定要想方设法搬走，否则，这个社区慢慢会变成华人社区的，出国等于没有出，在海外过着海内的生活，移民失去本质意义。",
			"added": 1531098163
		},
		{
			"topic_id": 62,
			"title": "鄙人在军中呆过，4年军校，只是灌输英雄主义思想，听从党指挥。",
			"body": "对国际事务从来不提，比如联合国日内瓦战俘公约、反地雷公约，连国际法都不提。只教人上面怎么说，下面怎么执行。现在的城管、治安联防及所谓的特勤，在强拆、截访、反示威游行上，都是这种教育出来的退伍军人，凶残血腥，麻木、无人性。",
			"added": 1531379928
		},
		{
			"topic_id": 114,
			"title": "刘少奇女儿刘亭亭、邓小平小儿子邓质方、江泽民孙子江志成等都是美国公民，习姐姐齐桥桥是加拿大人，弟弟习远平是澳洲人，女儿习明泽也有美国长期签证，随时可以申请入美籍。胡锦涛、温家宝、朱镕基等的儿孙辈，都曾长期留美，或早已取得绿卡。香港行政长官郑月娥丈夫和两个儿子都有英国护照。",
			"body": "",
			"added": 1532502055
		},
		{
			"topic_id": 132,
			"title": "我是个建桥的工人，这次找了个不错的活，别的工地一天一百二，这里给一百五。",
			"body": "上班第一天我就明白了他们工钱高的原因——这是个豆腐渣工程，拿沙子充水泥，拿水泥充钢筋。别的工人不敢干都走了，我咬咬牙留了下来。儿子上个月查出白血病，我那点家底砸锅卖铁也不够他治病的，再不多赚点钱，就只能眼睁睁看着他恶化了。",
			"added": 1532915695
		},
		{
			"topic_id": 139,
			"title": "每当提到为上合峰会后勤筹备的那几个月，魏岩既兴奋又略带自豪：",
			"body": "“2018年3月份，市农委质检处领导主动联系我们，说有个政治任务要交给我们，问接不接？当然要接啊，这还犹豫什么？”青岛市农业委员会农产品质量安全监管处宋处长，在带队考察了整个蔬菜基地的育苗、种植、水肥一体化、采收、初加工等各个环节后，选取了十多个直供上合峰会指定酒店的蔬菜品种。与此同时，整个基地也被几十个高清摄像头严密监控起来，每一颗蔬菜从选种育苗开始，都全程处于摄像头的监控中，峰会召开前夕，市农委干脆派专人24小时吃住在菜地里。",
			"added": 1533056474
		},
		{
			"topic_id": 150,
			"title": "【中共这个犯罪集团】组建于2011年11月的中共河北省委常委业已全军覆没。",
			"body": "过程大致如下：最先落马的是组织部长，时在4年前，即组建3年后的2014年；次年，秘书长和省委书记先后东窗事发；2016年，政法委书记被逮捕；去年，省人大常委的实际主持人被审查；前天，2018年7月31日，最后一名常委投案自首。简言之，中共的这个省委，领导班子成员个个都是罪犯。",
			"added": 1533265048
		},
		{
			"topic_id": 179,
			"title": "村干部当然喜欢公有制啰！即便是大饥荒的年代，有权的人也是过的很滋润的。",
			"body": "比如当年大饥荒时的凤阳，村干部还有酒喝。至于女色，用阿Q的一句话：“革命了，老子想要什么就是什么，喜欢谁就是谁。”这些鼓噪公有制的畜生，无非是还想回到那个反人类反文明的地狱时代！",
			"added": 1533824521
		},
		{
			"topic_id": 202,
			"title": "以前不知道，原来外国留学生在中国还有50万元人民币的医疗费用报销！",
			"body": "最近有视频报道，中国东莞一家医院拒收15岁小女孩治疗致其死亡，脾气再好的人也忍不住要骂这个鸡巴朝廷，操蛋！外国人的命值钱，中国人的命就不值线？！",
			"added": 1534471070
		},
		{
			"topic_id": 449,
			"title": "学习一下党史： ",
			"body": "第一任书记陈独秀叛党。 第二任瞿秋白叛党。 第三任向忠发叛党。 第四任博古反党。 第五任张闻天反党。 第六任毛泽东反革命家属（妻江青、侄毛远新反革命）。 第七任华国锋走反动路线。 第八任总书记胡耀邦走反动路线。 第九任赵紫阳反党。 吴评：江胡习，新反人类集团⋯",
			"added": 1541265889
		},
		{
			"topic_id": 450,
			"title": "你们都不要给我提当年你们多苦！你们那是活该！找抽。 ",
			"body": "你们明知道饭都吃不上，还去尼玛逼生产队干活…… 你们没有胆量造反，为掩饰自己的无能，把你们这种甘愿做牛做马的畜牲行为比作光荣劳动、服从组织，服从领袖…一种光荣革命事业。 我呸。你们个傻逼，要我从那年代过来，都不好意思说自己多能干。",
			"added": 1541266395
		},
		{
			"topic_id": 532,
			"title": "孙维世是死在北京公安局地下室，钉子贯穿太阳穴而死。死前高喊、我是被毛操过的人，你们不能这样对我。",
			"body": "",
			"added": 1542732400
		},
		{
			"topic_id": 548,
			"title": "【日本的真正崛起，是从干掉爱国贼开始的！】",
			"body": "日本也曾经有过盲目排外的日本义和团：出发点是一样的，打着爱国的旗号，认为【凡是与外国沾边的人都有卖国嫌疑】 而日本和中国的不同就是日本逐渐文明开化，清除了国内“义和团”的影响力，干掉了爱国贼。而中国的义和团影响却残留至今，而且还有发扬光大的趋势。",
			"added": 1543233336
		},
		{
			"topic_id": 603,
			"title": "特朗普政府将向非洲国家释放讯息：请在美国与中俄之间选边站队，只能选一边！",
			"body": "正如特朗普在全球其他地区所做的那样，他正在努力加强与志同道合的非洲盟友的关系，孤立那些与美国最大的竞争对手合作而不与美国合作的领导人。博尔顿周四将公布美国这一非洲策略。他还将宣布中俄在非洲的“掠夺性行为”对美国国家安全利益构成重大威胁。",
			"added": 1544878297
		},
		{
			"topic_id": 768,
			"title": "傳上海爆恐怖血案 女孩頭被砍扔落馬路 網路緊急封殺",
			"body": "",
			"added": 1548387692
		},
		{
			"topic_id": 769,
			"title": "中華民族是停滯、平庸、屈辱、充滿偏見的民族。  孔多塞，一位繼伏爾泰之後的法蘭西思想家。他認為：\"中華民族是停滯、平庸、屈辱、充滿偏見的民族。\"他在《人類精神進步的歷史畫卷之概述》中說：\"如果人們想知道專制政府可以將摧殘人類的技能發展到何種程度，那根本不需要提起那些可怕的迷信，翻阅什么典章，只需要看一看中國就行了......\"",
			"body": "",
			"added": 1548404352
		},
		{
			"topic_id": 770,
			"title": "中国人极其残酷，冷漠。无论身边发生什么不公，无论身边发生什么令人发指的事情，中国人只要一句美国天天在发生枪击案就心安理得了。跟畜生没什么区别。不过畜生还知道物伤其类。",
			"body": "",
			"added": 1548405705
		},
		{
			"topic_id": 771,
			"title": "济南自杀灭门案",
			"body": "济南市天桥区影壁后街20号楼一单元门前，静静地停放着一黑一白两辆电瓶车，它们的主人柏某才和其妻子李然再也不会回来了。从外面看，六楼一户人家的外墙被火熏得发黑，窗户几近损毁。走上楼梯，601室的楼道里各种家用物品堆放在一起，其中还有孩子的画作，一摞摞鞋盒和堆满烟头的烟灰缸。\n\n2019年1月18日下午，本该去上美术班的7岁的孩子轩轩被父亲柏某才接回了家。半个多小时后，他又谎称老家有老人去世，把妻子也喊回家。随后，柏某才将父母、妻子和两个儿子全部杀害在家中，然后放火焚烧了自己的家，并从屋子东侧的窗户跳下楼去，坠落到隔壁小区的地面后身亡。",
			"added": 1548435664
		},
		{
			"topic_id": 773,
			"title": "甘肃女童下体流血 家属指控教师参与欺凌",
			"body": "",
			"added": 1548511175
		},
		{
			"topic_id": 774,
			"title": "长春小区邻里纠纷 警开枪打死当事人",
			"body": "",
			"added": 1548513539
		},
		{
			"topic_id": 775,
			"title": "这个畜生，不知廉耻的东西居然还来。中国就是这种畜生多，所以藏人，维吾尔人，蒙古人无法与这种畜生相处，只能分裂。",
			"body": "",
			"added": 1548561471
		},
		{
			"topic_id": 776,
			"title": "聶樹斌殺人冤案平反兩年 至今無一人被追責: 聶樹斌故意殺人、強奸婦女冤案平反已過去兩年，但是，至今為止，沒有一位參與製造這起重大冤案的官員被追究任何責任。相反，一位參與製造這起重大冤案的警官升任石家莊市中級法院副院長。",
			"body": "",
			"added": 1548561952
		},
		{
			"topic_id": 777,
			"title": "10年前第一次上中国的微博，看到一个中国人说：中国大部分的人都不正直。印象深刻。经过10年观察，确实如此，毕竟长期生活在中国的人对这现象了解的清楚。其实这人说的已经很客气了，应该是中国有大量的人口与畜生无异。",
			"body": "",
			"added": 1548564593
		},
		{
			"topic_id": 778,
			"title": "男子因经济压力大想轻生 将陌生女孩从商场3楼扔下",
			"body": "",
			"added": 1548648346
		},
		{
			"topic_id": 779,
			"title": "史密斯在《中国人的性情》一书中说“中国人有着与骡子一样固执的性格，还有独特的屈从能力。 他们真正缺少的是人格和良知。”",
			"body": "",
			"added": 1548648568
		},
		{
			"topic_id": 780,
			"title": "“中国是一片还没有被人类的精神之光照亮的土地。在那里，理性与自由的太阳，还没有升起。人还没有摆脱原始、自然的愚昧状态。一切属于精神性的东西，都离中国人很远。”--黑格尔",
			"body": "",
			"added": 1548658267
		},
		{
			"topic_id": 781,
			"title": "卢梭对中国人的评价：中国的孩子不仅没有学到区别真理与谬误的本领，反而学会了一套善于诡辩的技能，把真理与谬误搞混，使人分不清真伪。什么叫崇高，什么叫正直，什么叫谦和，什么叫人道，什么叫勇敢，他们全然不明白。",
			"body": "",
			"added": 1548659090
		},
		{
			"topic_id": 782,
			"title": "美國學者薩爾克：“中國人的麻木冷血令世界震驚！”",
			"body": "",
			"added": 1548666337
		},
		{
			"topic_id": 783,
			"title": "中国人最缺乏的不是智慧，而是勇气、正直、和纯正的品性。这个评价，虽历经百年，如今依旧诊断出中国的综合症结。 ————孙海英",
			"body": "",
			"added": 1548666389
		},
		{
			"topic_id": 784,
			"title": "马克思对中国人的评价：  看来，历史要先让这些人民全部染上毒瘾，然后才能让他们从世袭的愚蠢中醒来。",
			"body": "",
			"added": 1548666758
		},
		{
			"topic_id": 785,
			"title": "这是一个非常现实的民族，这种现实的背后是令人发指的极端自私、极度冷漠和极其怯弱，  它少有为公义而担当的勇士，更多的却是明暂保身的懦夫。当然，这种现实的背后还有苟且、鼠目寸光和更多的愚蠢。由这种族群所构成的社会，不但是靠不住的，而且也必将是不断步入深渊、一个劫难连着一个劫难的，这便是它的宿命。如果我因此而被迫选择了自私的沉默，那么看着他们坠入地狱应是对我最好的补偿。【张剑】",
			"body": "",
			"added": 1548666851
		},
		{
			"topic_id": 786,
			"title": "據《東華續錄·同治朝》載：  清同治五年1866年初，英國駐華公使威妥瑪向總理各國事務衙門呈說帖，請中國停止凌遲這種極度野蠻、不人道的刑罰。 直到1905年，在各國的外交壓力之下，光緒帝才勉強同意不再對中國人使用凌遲、梟首等酷刑… 然而直到今天——中國人都將這段文明開化的歷史稱之為「屈辱史」",
			"body": "",
			"added": 1548666951
		},
		{
			"topic_id": 787,
			"title": "晚清翻译家严复：以中国民品之劣，民智之卑，即有改革，害之除于甲者将见于乙，泯于丙者将发之于丁。",
			"body": "",
			"added": 1548667224
		},
		{
			"topic_id": 790,
			"title": "每天看中央电视台，好像全世界都讨厌美国人，全世界都欢迎中国人，其实全世界都讨厌中国人，都欢迎美国人。中国人在这种环境下生活，成长，在别人眼里都是异类，怪物。",
			"body": "",
			"added": 1549877912
		},
		{
			"topic_id": 792,
			"title": "俄罗斯从来没有发生过把美国人打出屎的事，倒是中国人在俄罗斯被打出屎，还经常发生。你这小畜生从来没听说过？委内瑞拉中国人也被打出屎，才发生没几年。伊朗民众现在盼着美国人去伊朗，没伊朗人欢迎中国人，除了几个毛拉。",
			"body": "",
			"added": 1549938322
		},
		{
			"topic_id": 794,
			"title": "印尼反華情緒高漲，軍警殺氣騰騰！要求華人改說印尼話",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/data/users/1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv/1518860771-bysyhy.mp4",
			"added": 1549943309
		},
		{
			"topic_id": 795,
			"title": "你这个畜生还中国公民，你拿个公民证件出来看看。中国这个共产奴隶国还有公民？除了中共奴隶主集团，你们这些畜生都是奴隶。",
			"body": "",
			"added": 1549952855
		},
		{
			"topic_id": 796,
			"title": "这个小畜生自我感觉还挺好的，中国人就是这样的，极其愚昧还自我感觉很好。",
			"body": "",
			"added": 1549954685
		},
		{
			"topic_id": 797,
			"title": "愛因斯坦：中國人勤勞骯髒昏昧，若取代了其他民族就真是淒涼",
			"body": "",
			"added": 1549956185
		},
		{
			"topic_id": 804,
			"title": "俄罗斯发生大规模反华游行",
			"body": "",
			"added": 1553987710
		},
		{
			"topic_id": 806,
			"title": "网曝中国少年拐骗儿童被抓 供称已杀5童卖器官",
			"body": "",
			"added": 1555228293
		},
		{
			"topic_id": 808,
			"title": "更有网民挖掘出一个网民所谓的悲催事实，这就是电影《上甘岭》当中的那个当年令亿万观众着迷的中国军队卫生员的演员刘玉茹在电影上演之后不久被中共当局打成右派，受尽几十年迫害之后，如今在美国安度晚年。",
			"body": "",
			"added": 1558265605
		},
		{
			"topic_id": 942,
			"title": "习近平偷自行车,也被关进过少管所。少管所和习家商量:继续关少管所还是下乡插队?习家选择了让习近平下乡插队。",
			"body": "",
			"added": 1575217128
		},
		{
			"topic_id": 944,
			"title": "白川 月夜：  先和大家告别了 还有30天就2020年了，十三五规划2020年要消灭全国贫困人口，我很快就要消失了，能够认识你们这群有钱人，我真的很开心。",
			"body": "",
			"added": 1575279878
		},
		{
			"topic_id": 945,
			"title": "从湖南来广州务工的老石骑着电单车，载着要奉子成婚的儿子骑行在街上，突然地面凹陷，他们跌入了深坑！然而等待他们的不是救援，而是狠心的回填，借口是害怕更大的地陷发生！",
			"body": "",
			"added": 1575353935
		},
		{
			"topic_id": 946,
			"title": "10万元医疗费何以成了不能承受之重？ 一个患病的中年男子，因为付不起10万元医疗费而出走离世，你信吗？  很多人肯定不信，但这确是千真万确的事，就发生在几天前的中国。",
			"body": "",
			"added": 1576419854
		},
		{
			"topic_id": 947,
			"title": "沈阳研究生遭同学砍断肌腱 报案3个月无果 因奖学金评定发生矛盾，沈阳大学一名在读硕士研究生遭多名同学捅伤，大腿肌腱被砍断，报案三个月无果，痛苦中无奈到网上发帖爆光，引发舆情关注后，警方方回应称正在抓捕犯罪嫌疑人。",
			"body": "",
			"added": 1576804863
		},
		{
			"topic_id": 948,
			"title": "大陆村民：天然气太贵烧不起 冬天难熬 据《新京报》12月19日报导，山西省临汾市洪洞县大槐树镇南营村村干部，大约一周前，开始挨家挨户封堵煤炉。如果家里没人，村干部就翻墙进村民家里，“强制给炉子堵上”。多名山西村民也向大纪元记者反馈，烧天然气太贵了，村民们根本烧不起，家里冷得不行，村干部还把炉灶给封了，“村民心里肯定接受不了”。",
			"body": "",
			"added": 1576995640
		},
		{
			"topic_id": 949,
			"title": "圣诞卡求救信 曾被迫害英记者透露更多细节 上周末，一张圣诞卡求救信揭发中国上海青浦监狱强制囚犯工作的内幕，引起全球关注。周一，曾在大陆经历类似遭遇的当事人透露更多细节。",
			"body": "",
			"added": 1577167404
		},
		{
			"topic_id": 950,
			"title": "网友发问如何清洗“细颈瓶”被删帖！ 近期有从事化工研究的网友提问\"如何彻底清洗细颈瓶？ 竟被系统判定\"违反互联网相关法律法规\"并下架，推测是因\"细颈瓶\"与\"习近平\"读音相近所致。 如果发打烂细颈瓶的贴小心坐牢！",
			"body": "",
			"added": 1577458968
		},
		{
			"topic_id": 951,
			"title": "2020新年庆祝活动，后排一个小姑娘突然晕倒在地，周边的同学只是看一眼，包括指挥的老师，没有一个人去扶她，为了集体荣誉，继续表演。               她们唱的歌词，“爱祖国，爱人民”，……唱的真好！",
			"body": "",
			"added": 1577890308
		},
		{
			"topic_id": 952,
			"title": "2019年最后一天，一男子吊死在山西省信访局接待大厅门上！！！吏害了人民！",
			"body": "",
			"added": 1578066634
		},
		{
			"topic_id": 953,
			"title": "贵州原副王省长怕被查到，把每瓶价值万元甚至数万元的茅台酒倒进下水道，喝也喝不完，是倒也倒不完，直至被抓时还有4000多瓶！ 而同样是贵州女大学生吴花燕，因为没钱吃饭愣是饿死了。死时只有43斤，享年24岁的花季年华！",
			"body": "",
			"added": 1579010233
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_1JUB5Je5X4rw5jEPK235iNxbkboLpcS4Xb": [],
		"7_1JUB5Je5X4rw5jEPK235iNxbkboLpcS4Xb": [],
		"11_1JUB5Je5X4rw5jEPK235iNxbkboLpcS4Xb": []
	},
	"comment_vote": {}
}