{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1618045921_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": [
			{
				"comment_id": 1,
				"body": "When you are on http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/ you just hoover on the left over a zsite, and 3 vertical dots appears, click pause.",
				"added": 1618046029
			}
		],
		"1617909117_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 2,
				"body": "Nothing will happen during the funerals, we are 6 to 18 months away from reaching london. RIP and funeral in peace. We ain't mean, we just want to be respected. and you will or die.",
				"added": 1618046940
			},
			{
				"comment_id": 3,
				"body": "But of course all of this could be easily prevented, one individual: Bill Browder.",
				"added": 1618056191
			},
			{
				"comment_id": 4,
				"body": "please comeback in 24 months, and reread it... you would at this time be less arrogant and agree. Sometimes, humility must be learned the hard way. We will be harder than you ever could even dream to be.",
				"added": 1618056273
			},
			{
				"comment_id": 6,
				"body": "And just don't forget, the problems are already there in ireland. As such you have to understand that the only space available is to amplify, professionnally, like you did in HK, Xinjang, Chechenya, or even Tibet, meaning that even if you finally STOPPED unilaterally and totally your continous aggression toward our nations, it may not mean a return to peace. However with fuel and fire, arming and co, London is in sight. \n\nAnd then once, London will be a WAR ZONE, you won't have the ressources to annoy you, because that's only what you are dear MI6, nuisances, pests.\n\nHow to qualify those who protects the friends of epstein? humans?\n\nno.\n\nfilths, enemies, things to kill... yes\n\nthat's it.\n\nthings.\n\nin simple term, the less of you, the better the world.\n\nI hope you understand, if you don't, I love wars... just another little front, still in it's infancy, but with such great potential...\n\nand KILL people at the BBC...\n\nyeah...\n\nyou don't fix the price, you fix nothing, but you provide the corpses we wish, then we leave... or you die, all.\n\nyou are my enemies\n\nand that's ironic because UK itself, as a concept, not.\n\nwar is full of ironies isn't it?",
				"added": 1618061056
			},
			{
				"comment_id": 7,
				"body": "and for those following the situation, what about the ethnic genocide that the occupation state forces there plan? I mean don't they want to bring millions of invaders? I hope those behind those plans will be targeted and killed during the turmoil...\n\nIt's already boiling oil... matches, who invented matches?",
				"added": 1618061203
			},
			{
				"comment_id": 8,
				"body": "matches (body armor piercing munitions, body armors / vests, secure comms, real modern war rifles, tactic instructions, tactical HIGH INTENSITY supports (like wiping the whole mi5/6 families in UK while they are there, or them using REAL WEAPONS (for A to Z)... what else? isn't it fun? ahh you thaught it would be lazers and rainthings? huhuhu...",
				"added": 1618061334
			},
			{
				"comment_id": 9,
				"body": "what you have to learn to forget is your colonial pride, and dream of being with the occupiers of the usa in their various plots against US. and don't forget we have all interests to be kinder to the firsts to bail from D.C...  with the lasts, we won't have...",
				"added": 1618061423
			},
			{
				"comment_id": 10,
				"body": "In short, I always prefer peace, however \"hypocrites\" are made to be killed. You can't fool all the proles, all the time, and once exposed, there are always more proles than \"elites\".\n\nshow us corpses.",
				"added": 1618061533
			},
			{
				"comment_id": 11,
				"body": "Personally I believe the mi5/6 are way too brainwashed for the \"innocents\" and way too corrupts for those themselves pedos for the institutions to be able to reform themselves. I believe that even without talents it will be super easy to spread it to the whole of ireland, to then jump emerald see and litterally burn london.\n\nat this stage, they, the pedo feodalists servants won't be a threat to anyone anymore, at worst they could nuke london themselves...\n\nand finally that they are even too dumb and arrogant, right now trying in their low iqs to find a way to game the plan, unable to see that they are already defeated...\n\nsad...\n\nsometimes and often the defeated ones don't want to recognize it and have to be put to death...\n\nwar, nothing new for uk...",
				"added": 1618061729
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 5,
				"body": "To never be ashamed to have a product, like gaz, in high demand. It's an honor and duty to serve the market. The real question is what will the market asks for next...",
				"added": 1618056344
			},
			{
				"comment_id": 15,
				"body": "to or not to engage an alien space craft...\n\nat first, following halo ODST, I would have say no... the alien is just walking the street... natural in a foreign planet.\n\nand that implies 2nd... what the fuck is this doing there? however you don't fire a micro missile like a russian sidewinder... \n\n3rdly if you want to air nuke (nuclear armed side winder) at least fire when the alien space craft is still in space\n\nhowever like all movies, there it is a great fallacy... your little micro primitive weapon are just feed...\n\nwhich leads to 5th... if they come first, they have already won.\n\nnow the question is why did they come.\n\nbecause if they can move... they can move us too...\n\nspace hitch hicking, how to move without thinking !\n\nto revert to the question : why would they come, aka need earth for what? so it's not the planet, it's LIFE and or humans and or the next intellectual apex brewing somewhere... my guess, they would come for a preemptive war against the squids :). or they lost something which crashed on earth and finally the funniest to capture some fugitive...\n\nfinally, the whole crash and \"scene\"... like the one with the nicotine addiction device... destabilizing... however the desisional combat structure, so greater than the \"white house\" setting... ahhh fianlly, professionals :).",
				"added": 1618126267
			}
		],
		"1618088512_13F2Tpa4B5BT72c2Qg3eSLWsGhjZPiCp2g": [
			{
				"comment_id": 12,
				"body": "imho it's a big mistake.\n\nyesterday I saw the end of a great movie... there were 2 russian cosmonauts, who had crash landed somewhere in a very cold forest in the middle of blizzard... they had no comms, and no one on sight, and rather than stay in their crash landed reentry vehicule, they were just outside, slowly freezing, one decided to walk in the storm, to some high point to fire some lightgun... Once on top of his little hill, with the view over vastness, realizing that it was hopeless, he got very angry... russian cosmonots normally don't get angry...\n\nby this little story, I just illustrate that the \"gagging\" of human beings with laws on what they say, and worst accepting it, is a mark of slavery and serfdom.\n\nHowever, what is this hungarian neo colonial attitude toward the serfs of germany? they want to get their country youth raped and threatened, create a climat of constant urban fear, live under total political correctness and censor and jail themselves all the time, or become the new pcnazi or vaxxnazi, in what does it concern hungary?\n\nif you want to be left alone, you have to left the others too free to kill themselves. So rather than interfer in the domestic affairs of germany, and become fascist : what is the business of the hungarn state in how a german soccer club select his team? Aren't there more pressing issues? or like all the fake thieverish western state, using a good political polemik to stir the goyim from what they shouldn't look?\n\nIs hungary still the \"porn\" capital of the world? ahh... there silent... I guess it brings foreign currencies? you see, human filth? your games, your plays, your fakery, I smash, with fun and pleasure...\n\npsd technically the cosmonaut gets angry, after the mission :).",
				"added": 1618125624
			},
			{
				"comment_id": 13,
				"body": "> [houtje](#comment_40_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): based\n\nuhu? what do you mean? what is this boomerish expression?",
				"added": 1618125651
			}
		],
		"1618088072_13F2Tpa4B5BT72c2Qg3eSLWsGhjZPiCp2g": [
			{
				"comment_id": 14,
				"body": "nazi go there in your filthy censored world : http://127.0.0.1:43110/1E4XLtKC59YV8V9JQ4AkeqSvqECSvrUtnv (it's another dead language forum).",
				"added": 1618125786
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 16,
				"body": "Who did alex jones fucked to lead to his divorce with his first wife? I still don't know if it was mcadoo or if his first wife was psywarfared to get her away... maybe she was all along a double agent... who knows....",
				"added": 1618210695
			}
		]
	},
	"comment_vote": {}
}