{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1530176328,
			"title": "Anyone built solar system that is really worth money and the work?",
			"body": "I have some solar panel and a battery, but i had problem with over night discharging. Is there anyone who have experience and can recommend cheap components that prevent discharging and can be bough anywhere?",
			"added": 1530176327
		},
		{
			"topic_id": 1530176700,
			"title": "Multimeter and discovering shorted components on the electronic boards?",
			"body": "Hello,\n\ni was warned numerous times not to try to work with electric devices without me having school qualification in this. Because of life threatening high voltage that can be in capacitors on some electronic boards even if they are disconnected from the mains (electricity supply).\n\nYet from your experience are there any rules that a noob have to follow and be safe and rules to follow to discover shorted/faulty electro component on the board to replace it? Or indeed the warnings i received was correct and i should not be involved?",
			"added": 1530176698
		},
		{
			"topic_id": 1535180205,
			"title": "Other ZeroNet DIY sites",
			"body": "This site has no admin, i was thinking what are other similar sites..\nThere is one - a Millchan DIY board: http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1FXZSzXtewQgEGcy1ovtA2c6BbkyAzKhYU:DIY:0",
			"added": 1535180202
		},
		{
			"topic_id": 1561453524,
			"title": "Audio jack 3.5 switching headphones and internal speakers possible?",
			"body": "Hello,\nmy laptop has one jack 3.5 output connector, sometimes i am using headphones and sometimes laptop internal speakers. I am afraid of the wear of the jack connector connection to the motherboard and also it is bothering to always manualy plug the connector. Is there any way to keep headphones connector plugged and do the simple switching (internal speakers/headphones)? (this is M$ Windows).\n\nI was also thinking if there can be a small device that has a switch button and jack connectors that can be used for this purpose, but possibly that is not how it can be done: https://www.amazon.com/3-5mm-switch/s?k=%223+5mm%22+switch",
			"added": 1561453520
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1530176328_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "> [balancer73](#comment_2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Probably, it is necessary to put two modules and an additional voltage converter dc-dc step-down.\n\nYou mean two 6V, 1W solar panels in this case to increase power output to ~9-12V?\nBy additional voltage converter you mean something that reduces voltage? You mentioned the diode already does this. The battery on the image is rated 3.7V and the charger module is rated 5V so i would assume the diode would have to be maybe rated to 5V.\n\nThe diode mentioned by you prevents discharging battery into solar panel in the night or the \"battery charger\" board contains some element that does this?",
				"added": 1530203267
			},
			{
				"comment_id": 2,
				"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): charging module based on tp4056\n\ni found it [on Aliexpress](https://www.aliexpress.com/af/TP4056.html), though from Yours linked document i see \"Preset 4.2V Charge Voltage with 1.5% Accuracy\". For example on the balancer73 image is 3.7V battery. I think this voltage difference in case of li-ion batteries may be problem according to [this article](https://learn.adafruit.com/li-ion-and-lipoly-batteries/voltages). They say:\n\nMake sure when you're buying batteries and chargers to match them up! **Overcharging a 3.6V battery by attaching it to a 4.2V battery charger can at the very least permanently damage your battery and at worst cause a fire!**\nImportant Note! When charging batteries you must make sure that the charger voltage is less than or equal to the battery voltage. For the best battery performance/life you should have them matched. For example: 3.7/4.2V battery and 3.7/4.2V charger: OK - 3.7/4.2V battery and 3.6/4.1V charger: OK (but not ideal) - 3.6/4.1V battery and 3.6/4.1V charger: OK - 3.6/4.1V battery and 3.7/4.2V charger NOT OK!\n\n> [balancer73](#comment_3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): It is necessary to take two panels and put an effective converter DC-DC Step Down to 5V.\n\nYou mean because the 2 solar panels peak voltage would be 6+6V and the mentioned charging board with specs. \"Input Supply Voltage(VCC)：-0.3V～8V \" would not be sufficing (8V vs peak voltage 12V) ? But if the charging board would accept up to 12V, yours mentioned step down module would not be needed right? I tried to search for some 5V step down modules, but on Aliexpress they often do not mention what is the minimum input voltage and if it is mentioned, then it is somewhere at 3V while for solar charging purposes i assume i need it to work with very low voltages.",
				"added": 1530281310
			}
		],
		"1561453524_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "> [leftside](#comment_3_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm):\n\nThank you for the input. Thanks to yours mentioned bluetooth i got also an idea of USB sound card. I know i was looking for some and these may not produce good audio quality. :-S\nBut it may solve issue described in this thread\nhttps://duckduckgo.com/?q=USB+sound+dongle\nhttps://duckduckgo.com/?q=USB+cable+with+the+on+off",
				"added": 1561484861
			}
		],
		"1580415793_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 5,
				"body": "hi)",
				"added": 1580470360
			}
		]
	},
	"comment_vote": {
		"2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"2_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"3_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1
	}
}