{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1563540336,
			"title": "JavaScript - what went wrong?",
			"body": "JavaScript is an utter nightmare for both security (malware attacks) and privacy (fingerprinting). How did such bad technology become a ubiquitous standard in the Internet? Can it realistically be replaced by something better?",
			"added": 1563540335
		},
		{
			"topic_id": 1563987524,
			"title": "Without open hardware, we have no privacy or security",
			"body": "Most privacy-conscious people preach that if you use fully-Libre with no binary blobs like Debian, you can be sure you are not spied on. WRONG. The fucking CPU you are using has that nightmarish proprietary Intel ME or AMD PSP which basically has access to all of your RAM and can bypass any encryption and send it over the Internet back to those tech giants or anyone else. Even your keyboard and mouse may as well be logging your every key via their proprietary firmware and send it too. At least you can use libreboot for the motherboard, but that's too little.\n\nThe only way of actually having any privacy is to physically disconnect from the internet, the GPS and also make sure your hardware doesn't have a hidden WIFI card that can silently connect to any nearby unprotected network and send your data this way. \n\nAlso, don't get me started on always-on microphones in our phones, even dumbphones! They can remotely spy all they want, unless you physically break it by dismantling your device. I DO NOT even want to possess any phone and carry it with me to track my every step, but please explain that to my sheeple employer or family...\n\nOh, and by the way, even speakers connected to output-only port can be remotely reconfigured to act as a microphone (with shitty audio quality, but working nonetheless). So you can't even safely watch movies at home. Yuck.\n\nWe need fully opensource hardware AND physical killswitches for cameras and mics, or else we're still fucked.",
			"added": 1563987522
		},
		{
			"topic_id": 1565448182,
			"title": "Can't easily delete/recreate ZeroID indentity?",
			"body": "I can't seem to find any way to create a new identity. If I delete the whole zeronet folder it will do the trick, but it shouldn't be that complicated. This is a privacy-friendly network after all, there should be a way to ditch your old nickname and create a new one!\n\nJust like everyone on r/privacy does - creating random-nickname accounts, then post for a few weeks, and then mass-delete your posts and account and make a new one.",
			"added": 1565448179
		},
		{
			"topic_id": 1566570350,
			"title": "Religion is the cancer of civilization",
			"body": "In the past, it helped unite huge masses under a common allegiance, but it's high time we saw it's all fiction, business and slavery. I'm happy atheism is growing, and in the next few decades, religion may be a minority.",
			"added": 1566570346
		},
		{
			"topic_id": 1568481715,
			"title": "ZeroNet won't update",
			"body": "I have version 0.6.5, I tried to update but after it disconnected and reconnected I still have old version... do I have to redownload the whole zeronet from website?",
			"added": 1568481710
		}
	],
	"topic_vote": {},
	"next_comment_id": 35,
	"comment": {
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "What parameter do I have to launch the ZeroNet script with so that it opens in Tor (or no browser at all) by default, and not my actual default browser? Using Linux.",
				"added": 1560950445
			},
			{
				"comment_id": 2,
				"body": "> [r3naam3r](#comment_1_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM): What parameter do I have to launch the ZeroNet script with so that it opens in Tor (or no browser at all) by default, and not my actual default browser? Using Linux.\n\nOK figured it out, I just have to add \"--open_browser some-nonexisting-name\"",
				"added": 1560952658
			}
		],
		"1560821466_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 3,
				"body": "Because EU is threatened by ACTA v2 agreement which may censor the Internet. ZeroNet would resist this.",
				"added": 1560953676
			}
		],
		"1561030213_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 4,
				"body": "I for example learned to use ZeroNet because of ACTA2 in EU which may censor the whole clearnet in the near future. However, I could just use a VPN in that case.",
				"added": 1561031017
			}
		],
		"1560995957_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 5,
				"body": "Please at least use invidio.us instead of YT links. We're in ZeroNet, after all. PeerTube would be the most preferred.",
				"added": 1561031391
			}
		],
		"1563400508_1E1ETHw8wzWhza7R49wyrM1U9ZRHvykejr": [
			{
				"comment_id": 6,
				"body": "I think most people here use Linux",
				"added": 1563540170
			},
			{
				"comment_id": 9,
				"body": "Don't use github, it's owned by Micro$hit",
				"added": 1563984896
			}
		],
		"1563975046_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 7,
				"body": "You forgot the most important pro: money-hungry banks don't track all of your purchase data and sell it to third-parties",
				"added": 1563983636
			}
		],
		"1563904309_164cJJtm3Q2Xd7NZbFxJYngmW8MSqUMMxi": [
			{
				"comment_id": 8,
				"body": "Ross got double life in supermax for hosting a website. His sentence is more of a scare-message for other Tor webmasters than any sort of justice. I hope they finally at least lessen duration of his sentence.\n\nAlthough TBH he was quite stupid - he walked away from his laptop while having silkroad open, and previously even hinted at his current occupation on his linkedin profile. He also ordered parcel with fake passports to his actual home address",
				"added": 1563984086
			}
		],
		"1563548848_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 10,
				"body": "Both systemd and gnome are opensource, they may be less secure (I don't know this, really) but at least they dont spy on you, right? Also, if everyone used their own solutions for everything to avoid being dependent on specific project, none of them would be well tested and thus very insecure. If you want maximum privacy and security, design your own hardware, produce it yourself, write an OS and its programs all by yourself from scratch, and prepare to bug-test the shit out of them until the rest of your days before even daring to use the internet for any actual work or entertainment on such setup. When you're 90 years old, you've (maybe) finally done it! But... was it worth it?",
				"added": 1563985853
			}
		],
		"1563985981_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 11,
				"body": "I tried finding an automated backup program on Linux. All of them were shit for my likings, so I eventually wrote my own scripts to do it. Best decision I ever made - it is now fully independent and works EXACTLY the way I want it.\n\nHowever, being scared of having to do \"everything\" in the terminal is what keeps almost all people I know from migrating to linux. People are just lazy and don't have that feeling of responsibility that in order to use powerful technology we have today, you have to learn a bit how it works and how to use it well.",
				"added": 1563986614
			}
		],
		"1563987524_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 12,
				"body": "> [parad0x](#comment_3_1DBWQfUYNcyjPMMc22b6PUDxHNz5iCM6E3): https://puri.sm/Check out their stuff, it's what you are looking for. Hardware killswitches on their laptops, Intel ME neutralized and FSF approved OS.\n\nYeah I know about them, but I won't pay $2000 + shipping + 23% VAT for a 1-year, overseas pseudowarranty and ship it all the way from US to EU for such an important daily use thing as a PC/laptop.\nMy only bet is to use ancient Thinkpad with libreboot or very weak Raspberry Pi, but I want my PC to be actually useful AND free of builtin malware.\n\nAlthough I am excited about upcoming PinePhone since it will be dirty cheap and has killswitches and open hardware.",
				"added": 1564040278
			},
			{
				"comment_id": 16,
				"body": "5G is creepy as hell, I will not use 5G-enabled phone for as long as possibly possible",
				"added": 1564672938
			}
		],
		"1564024341_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 13,
				"body": "Is this some kind of religious propaganda? Church exists only to make money and control the masses, exactly like today's dirty governments.",
				"added": 1564042799
			}
		],
		"1564043724_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 14,
				"body": "Democracy is good in theory, but this theory never ever succeeds in practice. In true democracy, government should be afraid of the citizens and NOT the other way around! As we all know, that NEVER works.",
				"added": 1564048877
			}
		],
		"1562414209_1CvZDPgKk2p8Uk1ZfJ3hcZb1DzuNJXndhn": [
			{
				"comment_id": 15,
				"body": "> [sceptique](#comment_16_1TWoxhM5cZiLpzybpLyYtEsskuGJ9yVhv): Why do you want to reduce the amount of people in the world ? [...]\n\nResources, and save the environment. And less congregation and competition or outright inability to find work. And reduce poverty by having more resources available. Religion is the biggest culprit here because it tells sheeple they are good if they reproduce like rabbits and bring more new \"souls\" to this world.",
				"added": 1564049310
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 17,
				"body": "Do you agree with such statement:\n\"Yellow race has the best intellectual potential but worst physical, white race is in the middle, and the black race has best physical potential but worst intellectual\".\n?\n\nI think it makes sense but no one can speak this in a \"politically-correct\" world.",
				"added": 1565447736
			}
		],
		"1565448182_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 18,
				"body": "> [capitanjack](#comment_10_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk): take a look on users.json inside your zeronet folder\n\nOK that's nice but there should be a GUI way to do it too, IMHO",
				"added": 1565448720
			}
		],
		"1565463702_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 19,
				"body": "Since we are on ZeroNet, I'll leave this lecture here, cuz why not.\n\nPlay Minetest instead. It's open-source, not owned by Mi€ro$hit™ and has built-in mod repository management! There are surprisingly many of them already with good quality.",
				"added": 1565554314
			},
			{
				"comment_id": 20,
				"body": "> [brianhanson2nd](#comment_31_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): YES!!! We finally have the minecraft nine year olds coming to zeronet. [...]\n\nIs that a bad thing though? Don't we want to spread awareness and make all different kinds of people use ZeroNet?",
				"added": 1565554767
			},
			{
				"comment_id": 22,
				"body": "> [brianhanson2nd](#comment_35_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): I meant that as a joke. I don't care who joins, or what they post.\n\nok then",
				"added": 1565686385
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 21,
				"body": "- they reproduce infinitely without thinking about consequences of hunger and poverty of their children\n- almost all crimes are commited by them in countries that there are many of them\n- their faces look like ape, seriously, especially their huge lips, it's like they were stuck in evolution behind whites\n- they are too stupid to have democracy, they insist of enslaving each other with dictatorship in their shitty african countries\n- they are so stupid there are virtually no black scientists or nobel winners\n- https://img.ifcdn.com/images/635849e0c7e238fd0c91d192d2649f033f045f0b58434cde1ce3dc020b4349f0_1.jpg",
				"added": 1565686125
			},
			{
				"comment_id": 23,
				"body": "> [xlk](#comment_17_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): They're great. I think they keep white folk on their toes and keep us from getting too soft. Every liberal I have ever met has been raised devoid of contact with actual blacks (maybe some contact with cream of the crop types) and as such is a complete faggot. Food for thought.\n\nWell sometimes you must blow a few dicks to make sure you're straight :>",
				"added": 1565777500
			}
		],
		"1566241934_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 24,
				"body": "I keep my ZeroNet on a Linux system with encrypted hard drive, and use it with forced Tor. Recommend this to everyone else for true security and privacy.",
				"added": 1566331122
			},
			{
				"comment_id": 25,
				"body": "> [ratsmack](#comment_22_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): It's funny how Security Concerned people willingly trust a VPN service: https://gist.github.com/joepie91/5a9909939e6ce7d09e29 [...]\n\nSo find me a better alternative for system-wide secure connection. VPNs at least protect me from ISP spying, protect me from copyright scareletters, and allow me to bypass geoblock. They are definitely better than using clear connection. I'd rather some privacy-friendly country VPN have my logs who may not sell them to admakers than my ISP who will DEFINITELY sell them and keep them forever.",
				"added": 1566464626
			},
			{
				"comment_id": 28,
				"body": "> [crazylime](#comment_148_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): What do you mean by \"forced Tor\"?  ZN's \"Tor Always\"?  OS-level proxy forcing all Internet through Tor?\n\nMaybe I worded that badly, but I meant just starting zeronet .sh with \"--tor always \" parameter.",
				"added": 1566473295
			}
		],
		"1566399180_17KiwHwKMhcEVfPrnwf4wfggjmrsQZjN3x": [
			{
				"comment_id": 26,
				"body": "WTF, I never knew you can drag the logo like that. Cool",
				"added": 1566464828
			}
		],
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 27,
				"body": "https://puri.sm/posts/what-a-no-carrier-phone-could-look-like/",
				"added": 1566465004
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 29,
				"body": "> [aspidochelone](#comment_130_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Atheism is religion.  When you look at a universe where stuff like math exists ... well, how do you explain that?  Did the dodecahedron evolve to have the golden mean as the length of the the side of the cube it circumscribes? [...]\n\nYeah, because assuming an infinitely-complex, human-like sentient omnipotent being, who is his own cause, has forever existed like so, totally explains it better.\n\nAnd atheism is not religion, we don't \"believe god doesn't exist\", we just don't know and find the god theory implausible.\n\n> [78fns2epawa2nrm9](#comment_1_1Q9Z7n9SFG8nyNj528N1382s8dn7ykDMMh): Yeah, I can't wait for all common allegiance to die out so we can finally be completely defenseless to all the divide and conquer tactics of those who would want us subjugated.Have fun with all the SJWs, climate alarmists, SCIENCE retards, etc that will flourish in your atheist utopia.\"If God did not exist, it would be necessary to invent him.\" [...]\n\nReligion brings a lot of conflict and division. Just look at muslims in Europe and LGBT vs catholics.\nAnd if you think scientists are retards, GTFO from your computer and ZeroNet which was brought to you just by them.",
				"added": 1566708545
			},
			{
				"comment_id": 30,
				"body": "> [eyeballgummy](#comment_10_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M): 2 Timothy 3Godlessness in the last days. [...]\n\nAnd what reason do you have to believe that these words, or any in that book, are factual and trustworthy? Bible has so many absurdities and inconsistencies that it's only rational to treat it as untrustworthy.",
				"added": 1568137057
			}
		],
		"1568442422_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": [
			{
				"comment_id": 31,
				"body": "I sometimes wish for an apocalypse that would wipe out humanity. I don't mind dying at all, my life is far from happy. The world is so corrupted, full of inequality, poverty, hate, prejudice, lust of power and money that it's too late to try and save it. Even if there was an apocalypse that would force a mere thousand survivors underground, there would still be all those bad things, as Metro 2033 very well describes. Because human nature is just that bad.",
				"added": 1568452667
			},
			{
				"comment_id": 32,
				"body": "> [bigbadbob](#comment_711_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): If the greediest of all corporations, banks, and corrupted/over stepping governments all burned, that would suffice.\n\nAre there any non-corrupted governments? In my country, there is even a saying \"lie like a politician\"",
				"added": 1568476409
			},
			{
				"comment_id": 33,
				"body": "> [bigbadbob](#comment_712_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): power corrupts... so i doubt it.  Would be nice if they were held accountable for their lies.\n\nSo we need a solution just like in internet privacy and freedom - complete decentralization of power and law.",
				"added": 1568481149
			}
		],
		"1568481715_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 34,
				"body": "> [pexo](#comment_152_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): ZeroNet version 7.x.x runs on python3. ZeroNet version 6.x.x runs on python2. These two are incompatible with one another and you cannot upgrade from 6.x.x to 7.x.x, so you'll have to redownload ZeroNet. Be sure to backup your data directory so you can use it in the 7.x.x version.\n\nok I'll do that",
				"added": 1568482432
			}
		]
	},
	"comment_vote": {
		"13_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"19_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"36_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": 1,
		"1_15r56UHicKBnyAayhxJzT4XhpVuyStyKoU": 1
	}
}