{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "BRASIL PARALELO: Documentários que a extrema-esquerda tenta esconder de você",
			"body": "**Descrição**\n\nA Brasil Paralelo acredita que o Brasil vai dar certo. E por meio de nossas produções trabalhamos para fortalecer em nossa cultura os valores e tradições que, notoriamente, ao longo da história conduziram a humanidade à paz e prosperidade.",
			"added": 1605817782
		},
		{
			"topic_id": 2,
			"title": "Coreia do Norte – Autoritarismo e Fome. Entenda os horrores dessa ditadura comunista",
			"body": "**Um dos regimes ditatoriais mais sangrentos do planeta**\n---\n\n\n**A Coreia do Norte é um dos regimes mais autoritários e repressivos do mundo. A família Kim e o Partido dos Trabalhadores da Coreia do Norte governam o país desde 1948.**",
			"added": 1606508770
		}
	],
	"topic_vote": {
		"1_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"2_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1
	},
	"next_comment_id": 67,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "> [mclanarb](#comment_8_1QHtQkdJDXnioEAmVWda3hZmw87WHS5A9b): Cuba, Venezuela e as polêmicas feat. Fabio Luis\n> \n> https://gateway.pinata.cloud/ipfs/Qmdqjb1tDPMgbJVVHru61QXECfMCpeFSYfrYzaWgXT73aP\n> \n> O livro é Uma história da onda progressista sul-americana, de Fabio Luis Barbosa dos Santos, publicado pela Editora Elefante em 2018.\n\nA esquerda “anti-fascista” tem muito em comum com os fascistas originais\nEla não é oponente do fascismo, mas sim uma genuína representante\n\nhttps://www.mises.org.br/article/2868/a-esquerda-anti-fascista-tem-muito-em-comum-com-os-fascistas-originais",
				"added": 1589487241
			},
			{
				"comment_id": 3,
				"body": "COMUNISTA FILHO DA PUTA!",
				"added": 1590346498
			},
			{
				"comment_id": 5,
				"body": "Só vagabundo acredita nesse lixo",
				"added": 1605811849
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "Arquivos Da Morte: A Guerra do Tráfico\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1589421307_18RQ8ZRVSG3NZYJEK6JwbaJivW8L14qwXu\n\nBem vindo a mundo cruel! Situações extremas de vida e de morte que acontecem todos os dias ao redor do mundo, captadas por jornalistas e cinegráfistas amadores com muita coragem e nervos de aço!",
				"added": 1589487610
			},
			{
				"comment_id": 17,
				"body": "**OS DONOS DA VERDADE**\n---\nEntenda o verdadeiro risco que a liberdade de expressão corre em nosso país.\n\nhttps://www.youtube.com/watch?v=8kn4mFP3uUY",
				"added": 1605911630
			},
			{
				"comment_id": 18,
				"body": "**7 DENÚNCIAS: AS CONSEQUÊNCIAS DO CASO C0VID-19**\n---\nPediram pra você ficar em casa. E você obedeceu. Em poucos dias de quarentena, as ruas ficaram vazias e a economia parou. Quais as consequências desses atos para todos nós?\n\nhttps://www.youtube.com/watch?v=-ugqbyDCamw",
				"added": 1605912106
			},
			{
				"comment_id": 19,
				"body": "**1964 - O Brasil entre armas e livros**\n---\nO filme é uma extensão da série Brasil: a última cruzada. Conheça a história não contada sobre um dos períodos mais perturbadores da história brasileira.\n\nhttps://www.youtube.com/watch?v=yTenWQHRPIg",
				"added": 1605912231
			}
		],
		"4_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": [
			{
				"comment_id": 4,
				"body": "Esses comunistas vagabundos estão tentando acabar com o mundo.",
				"added": 1605734861
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 6,
				"body": "> [otp](#comment_15_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ): BNDES não financia Cuba nem Venezuela\n> https://ipfs.infura.io/ipfs/QmY3V2jEv6TzRXMfEFDsyEcgbFKkt1fxwbdug5T9zmud6a\n> \n> Fonte: https://invidio.us/MofJVCRpOCs\n\nEsse cara do video fuma maconha ou cheira pó? Voz de drogado. Comunista filho da puta!",
				"added": 1605813776
			},
			{
				"comment_id": 7,
				"body": "**O Livro Negro do Comunismo: Crimes, Terror, Repressão**\n---\nAUTORES:  Nicolas Werth, Jean-louis Panne, Karel Bartosek, Jean-louis Margolin, Andrzej Packzowski\n\n- https://sumateologica.files.wordpress.com/2009/09/o-livro-negro-do-comunismo-crimes-terror-e-repressao.pdf\n\n**Descrição do livro**\n\nÀ luz dos fatos aqui revelados, o Terror Vermelho deve estar presente na consciência dos que ainda creem num futuro para o Comunismo. O Livro Negro do Comunismo traz a público o saldo estarrecedor de mais de sete décadas de história de regimes comunistas: massacres em larga escala, deportações de populações inteiras para regiões sem a mínima condição de sobrevivência, expurgos assassinos liquidando o menor esboço de oposição, fome e miséria que dizimaram indistintamente milhões de pessoas, enfim, a aniquilação de homens, mulheres, crianças, soldados, camponeses, religiosos, presos políticos e todos aqueles que, pelas mais diversas razões, se encontraram no caminho de implantação do que, paradoxalmente, nascera como promessa de redenção e esperança. Os autores, historiadores que permanecem ou estiveram ligados à esquerda, não hesitam em usar a palavra genocídio, pois foram cerca de 100 milhões de mortos. Esse número assustador ultrapassa, por exemplo, o número de vítimas do nazismo e até mesmo o das duas guerras mundiais somadas. Genocídio, holocausto, por tanto, confirmado pelos vários relatos de sobreviventes e, principalmente, pelas revelações dos arquivos hoje acessíveis.",
				"added": 1605814254
			},
			{
				"comment_id": 8,
				"body": "**A Grande Fome de Mao: A história da catástrofe mais devastadora da China. Entre 1958 e 1962**\n---\nAUTOR: Frank Dikötte\n\n- https://siasky.net/_A22SlOy2qj1vHEw0jgUSkyaFN6fgeIWSpk0s1WvG42q7w\n\n**Descrição do livro**\n\nA China tornou-se um inferno. Mao Tsé-tung jogou o país em um delírio com o Grande Salto Adiante, uma tentativa de alcançar e superar economicamente a Grã-Bretanha em menos de quinze anos. O experimento terminou na maior catástrofe que a China já viu, destruindo dezenas de milhões de vidas. Com riqueza de detalhes, Frank Dikötter expõe um período da história chinesa nunca antes completamente enfrentado. Mostra que, ao invés de desenvolver o país para se equiparar às superpotências mundiais, comprovando assim o poder do comunismo — como Mao imaginara —, o Grande Salto Adiante na verdade foi um passo gigante e catastrófico na direção oposta. O país virou palco de um dos assassinatos em massa mais cruéis de todos os tempos: pelo menos 45 milhões de pessoas morreram de exaustão, fome ou vítimas de abusos mortais das autoridades. Foi também a maior demolição de imóveis da história humana, já que quase um terço das residências foram postas abaixo, sendo a terra revirada na busca incessante por aço e outros recursos industriais. Descortinando as maquinações cruéis nos corredores do poder e o cotidiano da população comum, A grande fome de Mao dá voz aos mortos e esquecidos. Com pesquisa meticulosa e um texto brilhante, este relato inédito é uma reformulação fundamental da história da República Popular da China.",
				"added": 1605815717
			},
			{
				"comment_id": 9,
				"body": "**Esquerda Caviar**\n---\nAUTOR: Rodrigo Constantino\n\n- https://siasky.net/_Aj39ku8BIp27ri39rYUT1p7EhWtueGySnD8nrOmaTaJHQ\n\n**Descrição do livro**\n\nEsquerda Caviar – O livro é sobre aquilo que tradicionalmente se chamou de “esquerda festiva” – que o autor atualiza e renomeia para “esquerda caviar” – e trata da associação histórica entre ícones da cultura (Chico Buarque, por exemplo) e líderes autoritários/populistas (Fidel, Hugo Chavez); entre elite econômica (George Soros) e causas politicamente corretas (meio ambiente, aquecimento global). Embora escorado em ampla bibliografia e em evidente estudo, o livro tem um caráter essencial de provocação e de chamada à discussão.",
				"added": 1605816539
			},
			{
				"comment_id": 10,
				"body": "**O Império do Oprimido**\n---\nAUTOR: Guilherme Fiuza\n\n- https://siasky.net/_ATLnTOj2FEaaRZ5o2RPfzJ0ddWQSb-6VafRzlU6GJfQXw\n\n**Descrição do livro**\n\nO primeiro governo popular assume prometendo libertar o país da opressão dos ricos. Filha de um dos homens mais ricos do país, a jovem Luana Maxwell rompe com a família aristocrática no dia da eleição. Sufocada, aos 25 anos, ela sai de casa só com a roupa do corpo, afrontando duplamente o pai magnata: abre mão da herança da sua rede de hotéis e vai procurar a “vida real” ao lado dos adversários políticos dele. Sua ponte para o universo progressista é o advogado Beto Leal, seu professor de mestrado, por quem ela está fascinada. Beto acaba de criar uma ONG e Luana começa a trabalhar com ele no momento em que a organização conquista um contrato com o governo – graças ao publicitário Marivaldo Valadares, operador invisível do partido do novo presidente. Vendo o dinheiro cada vez mais abundante nas mãos dos defensores dos pobres, Luana\n",
				"added": 1605816889
			},
			{
				"comment_id": 20,
				"body": "**O Mínimo Que Você Precisa Saber Para Não Ser Um Idiota**\n---\nAUTOR: Olavo de Carvalho\n\nhttps://siasky.net/_Aml5AhdnlCRCeIZLuN2DqinK5egFeHz75hvLWVw-AK6RQ\n\n**Descrição do livro**\n\nHá tempos que a obra jornalística de Olavo de Carvalho – o maior filósofo brasileiro – merecia uma leitura como esta, lapso intelectual imperdoável, a que só mesmo a organização de um livro como este poderia responder. Escritos entre 1997 e 2013 e publicados em diferentes jornais e revistas do país, os 193 textos aqui selecionados, artigos e ensaios de consistência e profundidade só muito raramente esboçadas na imprensa nacional, esmiúçam os fatos do cotidiano – as notícias, o que nelas fica subentendido, ou que delas passa omitido, o centro das questões, o que verdadeiramente importa e implica – para afinal destrinchar, sem dó, a mentalidade (ou seria cegueira?) brasileira e sua progressiva inclinação pelo torpor e pela incompreensão. O pensamento de Olavo de Carvalho, corajoso, independente, original e esclarecedor, ademais costurado por uma prosa de estilo único, é aqui beneficiado pelo extraordinário trabalho de Felipe Moura Brasil, cuja organização primorosa – ao que se somam o texto de apresentação e as centenas de notas – oferece os melhores instrumentos para uma leitura que ao mesmo tempo provoca e apraz. Com este “O mínimo que você precisa saber para não ser um idiota”, a Editora Record publica apenas uma pequena fração – uma pequena, mas estupenda fração – do que é a colossal e brilhante obra de Olavo de Carvalho, livro que se pretende, portanto, pontapé inicial para outros que virão.",
				"added": 1605973682
			},
			{
				"comment_id": 21,
				"body": "**O Imbecil Coletivo** \n---\nAUTOR: Olavo de Carvalho\n\n- https://siasky.net/_A35u3cryLVaGe7YEOSgfLI_uDBFIk5o1MejgpTic94zoQ\n\n**Descrição do livro**\n\nO Imbecil Coletivo – O Ministério da Saúde adverte: O Imbecil Coletivo faz mal aos imbecis individuais.\n\nA função de ‘O imbecil coletivo’ é bastante explícita e foi declarada no prefácio – descrever, mediante exemplos, a extensão e a gravidade de um estado de coisas – atual e brasileiro – do qual a nova era dera o alarme.\n\n",
				"added": 1605984243
			},
			{
				"comment_id": 22,
				"body": "**Mentiram Para Mim Sobre o Desarmamento**\n---\nAUTOR: Flavio Quintela\n\n- https://siasky.net/fAEaMQwdXCrulvwFxlmbuPHK5FqeW77dEeEehMTHxbbqWQ\n\n**Descrição do livro**\n\nNo segundo livro da série “Mentiram para mim”, Flavio Quintela está de volta, desta vez junto de Bene Barbosa, líder do Movimento Viva Brasil, para desmantelar e reduzir a chiados os argumentos mais usados pelos defensores do desarmamento: que países desarmados são mais seguros, que o governo quer desarmar as pessoas porque se preocupa com elas, que as armas precisam ser controladas para facilitar a solução de crimes – entre outras frases prontas. Este livro é resultado de uma pesquisa séria, feita com primor por seus autores, extremamente dedicados à questão já por muito tempo, na qual são expostas as informações reais a respeito dos benefícios que as armas trazem à sociedade. Como em “Mentiram e muito para mim”, este livro desfaz um grande número de mal-entendidos e falsos pressupostos – e o faz sem dó.",
				"added": 1605986213
			},
			{
				"comment_id": 23,
				"body": "**Fidel – o Tirano Mais Amado do Mundo** \n---\nAUTOR: Humberto Fontova\n\n- https://siasky.net/_BWmLNV4ccYBKdL2WqszACdQ1Vqy8A6EeS23jTt_gMFW4g\n\n\n**Descrição do livro**\n\nInúmeras vezes elogiado e homenageado por celebridades e autoridades nos últimos 60 anos, Fidel Castro tem seu lado mais negro desnudado por Humberto Fontova. Depoimentos emocionantes e uma vasta pesquisa histórica mostram os **crimes e as mentiras do ditador mais duradouro da América Latina.** Com linguagem irônica e incisiva, o autor dá voz àqueles que **foram calados por pelotões de fuzilamento, batalhas sangrentas e prisões desumanas durante a ditadura comunista de Fidel em Cuba.** Fontova mira também aqueles que não se cansam de elogiar o ex-ditador, jornais e redes de TV, cineastas, agências de inteligência e políticos americanos. Bill Clinton, John F. Kennedy e Che Guevara não passam impunes à análise corrosiva do autor. Trata-se de um livro essencial para quem quer conhecer a história cubana oculta pela propaganda e pela ideologia.",
				"added": 1606065321
			},
			{
				"comment_id": 24,
				"body": "**Ponerologia: Psicopatas no Poder**\n---\nAUTOR: Andrew Lobaczewski\n\n- https://siasky.net/_AQTund7eiCg3wijxq60fzg2a9Nfu6zlrFCv6Mv1_gsjig\n\n**Descrição do livro**\n\n“Não é preciso nenhum estudo especial para saber que, invariavelmente, o **discurso comunista, pró-comunista ou esquerdista é cem por cento baseado na exploração da compaixão e da culpa**. Isso é da experiência comum. Mas o que o dr. Lobaczewski e seus colaboradores descobriram foi muito além desse ponto. Eles descobriram, em primeiro lugar, que só uma classe psicopatas tem a agressividade mental suficiente para se impor a toda uma sociedade por esse meios. Segundo: descobriram que, quando os psicopatas dominam, a insensitividade moral se espalha por toda a sociedade, roendo o tecido das relações humanas e fazendo da vida um inferno. Terceiro: descobriram que isso acontece não porque a psicopatia seja contagiosa, mas porque aquelas mentes menos ativas que, meio às tontas, vão se adaptando às novas regras e valores, se tornam presas de uma sintomalogia claramente histéria, ou histeriforme. O histérico não diz o que sente, mas passa a sentir aquilo que disse – e, na medida em que aquilo que disse é a cópia de fórmulas prontas espalhadas na atmosfera como gases onipresentes, qualquer empenho de chamá-lo de volta às suas perpecções reais abala de tal modo a sua segurança psicológica emprestada, que acaba sendo recebido como uma ameaça, uma agressão, um insulto.” – Olavo de Carvalho (trecho do prefácio).",
				"added": 1606102970
			},
			{
				"comment_id": 25,
				"body": "**1984**\n---\nAUTOR: George Orwell\n\n- https://siasky.net/_AmBhKaQZTrJGnct4lIgohm7Dd3V_itXXssKEU7rG5HhZw\n\n- https://ipfs.io/ipfs/QmYSxBxwiUgLcBDmXQVsFxxqwvHcdoWj1iCKSyH4F3vFPu\n\n\n**Descrição do livro**\n\nRomance distópico clássico do autor britânico George Orwell. Terminado de escrever no ano de 1948 e publicado em 8 de Junho de 1949, retrata o cotidiano de um regime político totalitário de modelo comunista. No livro, Orwell mostra como uma sociedade oligárquica é capaz de reprimir qualquer um que se opuser a ela.\n\nO romance tornou-se famoso por seu retrato da difusa fiscalização e controle de um regime coletivista-socialista na vida dos cidadãos, além da crescente invasão sobre os direitos do indivíduo. Desde sua publicação, muitos de seus termos e conceitos, como “Big Brother”, “duplipensar” e “Novilíngua” entraram no vernáculo popular. O termo “Orwelliano” surgiu para se referir a qualquer reminiscência do regime ficcional do livro. O romance é geralmente considerado como a magnum opus de Orwell.\n\nDe facto, 1984 é uma metáfora sobre o poder e atuação dos regimes comunistas, Orwell o escreveu animado de um sentido de urgência, para avisar os seus contemporâneos e às gerações futuras do perigo que corriam, e lutou desesperadamente contra a morte – sofria de tuberculose – para poder acabá-lo. Ele foi um dos primeiros simpatizantes ocidentais da esquerda que percebeu para onde o estalinismo caminhava e é aí que ele vai buscar a inspiração: percebe-se facilmente que o Grande Irmão não é senão Stalin e que o arqui-inimigo Goldstein não é senão Trotsky.\n\nExplicando que seu objetivo básico com a obra era imaginar as consequências de um governo stalinista dominante na sociedade britânica, Orwell disse: “1984 foi baseado principalmente no comunismo, porque essa é a forma dominante de totalitarismo. Eu tentei principalmente imaginar o que o comunismo seria se estivesse firmemente enraizado nos países que falam Inglês, como seria se ele não fosse uma mera extensão do Ministério das Relações Exteriores da Rússia.”",
				"added": 1606240550
			},
			{
				"comment_id": 29,
				"body": "**Tiranos**\n---\nAUTOR: Antonio Ghirelli\n\n- https://siasky.net/_AQvjpk8lPDkv_KumyyGGag42gipdGxkAvpN6hnJlwtHAA\n\nDescrição do livro\n\nSão sete ditadores (Adolf Hitler, Benito Mussolini, Josef Stálin, Mao Tse-Tung, Pol Polt, Francisco Franco e Augusto Pinochet) analisados por Ghirelli. Cada um com cerca de 25 páginas, o autor faz um pequeno estudo desde a chegada ao poder até a decadência anunciada.\n\nO escritor pega os pontos fracos de seus personagens e transforma os sanguinários em reféns de si próprios. Detalha os erros cometidos por eles e as consequencias brutais de seus atos. Trata-se de um livro difícil de ler, não apenas por exibir as desumanidades, mas também por sua linguagem esmerada.",
				"added": 1606402474
			},
			{
				"comment_id": 31,
				"body": "**Deus é Vermelho**\n---\nAUTOR: Yiwu Liao\n\n- https://siasky.net/_Ar5cabxw8X3oZOxUK6GLW6_q2KVGKMTSlomfO8SOfcJaA\n\n\n**Descrição do livro**\n\nNa China comunista, sob o regime de Mao Tsé-tung, todas as práticas religiosas foram banidas. O comunismo tornou-se a religião nacional e Mao foi entronizado, deificado e adorado. Apenas a igreja oficial era permitida, mas em seus cultos, apenas palavras de honra e louvor ao regime e ao líder Mao. Mas debaixo de tanta opressão, a semente do cristianismo brotou e floresceu. Deus é vermelho percorre pequenos vilarejos e grandes cidades, trazendo narrativas emocionantes e assombrosas sobre dezenas de milhões de cristãos chineses que vivem a fé debaixo do duro regime socialista. Indo de casa em casa, reunindo-se porões e sótãos, vivendo à margem da religião oficial do Estado, assim caminham os cristãos chineses. Correndo perigo de prisão, castigos e até morte, assim vivem os que desafiam o regime para manter e cultivar a fé em Jesus Cristo. Conversas sussurradas, códigos cifrados, bíblias e material evangelístico contrabandeados, assim o evangelho é pregado cotidianamente. \n\nDeus é vermelho é o relato tocante e desafiador de uma Igreja viva que cresce e floresce no regime mais fechado do planeta. Liao Yiwu traz nesta obra uma perspectiva nova sobre a força e a importância do Evangelho para pessoas simples e abnegadas, mas que morrerão sem negar o Autor de sua fé. Escritor chinês censurado na China e exilado na Alemanha, onde vive desde que conseguiu fugir do regime, Liao Yiwu escreveu este livro para nos revelar uma China diferente, com uma Igreja cristã pujante e vigorosa. O autor do poema Massacre, que lhe custou anos de cadeia, nos conta a história secreta de como o cristianismo sobreviveu e floresceu na China comunista.",
				"added": 1606506713
			},
			{
				"comment_id": 60,
				"body": "**Lavagem Cerebral: Como as Universidades Doutrinam a Juventude – Ben Shapiro**\n---\n- https://siasky.net/_AHKtWNTyBbmpMczRKmkggG_VLkbf2Ohvn3nokVHjdfmkA\n\n\n*Descrição do livro*\n\nLavagem Cerebral é uma exposição explosiva da agenda esquerdista que atua nas universidades hoje. Este livro prova de uma vez por todas que a assim chamada “educação superior” afunda cada vez mais nas profundezas da loucura progressista, uma vez que professores fanáticos e bitolados transformam seus alunos em socialistas, ateístas, racistas, incendiários e narcisistas ninfomaníacos. “Ben Shapiro escreve de maneira inteligente, informativa e incisiva. O autor é mais sábio que sua idade deixa transparecer, sem perder a impetuosidade da juventude.” — Ann Coulter",
				"added": 1609208190
			},
			{
				"comment_id": 61,
				"body": "**Ponerologia: Psicopatas no Poder – Andrew Lobaczewski**\n---\n- https://siasky.net/_ATk4iUckahL9QnZOclhIZ2vfr_ATaZfmokvWhdQ9OAp0w\n\n\n*Descrição do livro*\n\n“Não é preciso nenhum estudo especial para saber que, invariavelmente, o discurso comunista, pró-comunista ou esquerdista é cem por cento baseado na exploração da compaixão e da culpa. Isso é da experiência comum. Mas o que o dr. Lobaczewski e seus colaboradores descobriram foi muito além desse ponto. Eles descobriram, em primeiro lugar, que só uma classe psicopatas tem a agressividade mental suficiente para se impor a toda uma sociedade por esse meios. Segundo: descobriram que, quando os psicopatas dominam, a insensitividade moral se espalha por toda a sociedade, roendo o tecido das relações humanas e fazendo da vida um inferno. Terceiro: descobriram que isso acontece não porque a psicopatia seja contagiosa, mas porque aquelas mentes menos ativas que, meio às tontas, vão se adaptando às novas regras e valores, se tornam presas de uma sintomalogia claramente histéria, ou histeriforme. O histérico não diz o que sente, mas passa a sentir aquilo que disse – e, na medida em que aquilo que disse é a cópia de fórmulas prontas espalhadas na atmosfera como gases onipresentes, qualquer empenho de chamá-lo de volta às suas perpecções reais abala de tal modo a sua segurança psicológica emprestada, que acaba sendo recebido como uma ameaça, uma agressão, um insulto.” – Olavo de Carvalho (trecho do prefácio).",
				"added": 1609369878
			}
		],
		"2_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": [
			{
				"comment_id": 11,
				"body": "**Venezuela: Uma Tragédia do Século 2 - Brasil Paralelo**\nhttps://www.youtube.com/watch?v=w0LuZFE_BRE",
				"added": 1605817433
			}
		],
		"1_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": [
			{
				"comment_id": 13,
				"body": "**FIM DAS NAÇÕES**\n---\nO que significa o século americano e por que ele pode estar chegando ao fim? A trilogia \"Fim das Nações\" te ajudará a entender a política internacional e a relação entre três grandes potências: Estados Unidos, China e Rússia.\n\n**FIM DAS NAÇÕES | A ELEIÇÃO DO VOO 93 -EPISÓDIO 1**\n\n- https://www.youtube.com/watch?v=aYAMElVUSMg\n\n**FIM DAS NAÇÕES | A BATALHA DA AV. MICHIGAN - EPISÓDIO 2**\n\n- https://www.youtube.com/watch?v=2cRVPUEc0d4\n\n**FIM DAS NAÇÕES | A NOVA GUERRA FRIA - EPISÓDIO 3**\n\n- https://www.youtube.com/watch?v=vFO7xBaJBoU",
				"added": 1605818038
			},
			{
				"comment_id": 14,
				"body": "**PÁTRIA EDUCADORA: Trilogia Completa**\n---\nPara entender o motivo de chegarmos aos últimos lugares, fizemos uma jornada pela história do Brasil, trazendo conceitos e análises sobre as diferentes ideologias e pessoas que pensaram o nosso sistema.\n\n**O FIM DA HISTÓRIA | PÁTRIA EDUCADORA - CAPÍTULO 1**\n- https://www.youtube.com/watch?v=EU5sAWPKgMc\n\n**PELAS BARBAS DO PROFETA | PÁTRIA EDUCADORA - CAPÍTULO 2**\n- https://www.youtube.com/watch?v=UPDjFGGN2w0\n\n**GUERRA CONTRA A INTELIGÊNCIA | PÁTRIA EDUCADORA - CAPÍTULO 3**\n- https://www.youtube.com/watch?v=yJunMvIFtxI",
				"added": 1605818301
			},
			{
				"comment_id": 15,
				"body": "**1964 - O Brasil entre armas e livros**\n---\nO filme é uma extensão da série Brasil: a última cruzada. Conheça a história não contada sobre um dos períodos mais perturbadores da história brasileira\n\n- https://www.youtube.com/watch?v=yTenWQHRPIg",
				"added": 1605911153
			},
			{
				"comment_id": 16,
				"body": "**OS DONOS DA VERDADE**\n---\nA liberdade de expressão nem sempre foi uma constante na história humana. Entenda o verdadeiro risco que corremos de perdê-la em nosso país.\n\n- https://www.youtube.com/watch?v=8kn4mFP3uUY",
				"added": 1605911475
			},
			{
				"comment_id": 27,
				"body": "**Venezuela: Uma Tragédia do Século 21**\n---\nO média metragem faz uma viagem histórica desde a ditadura venezuelana de 1950, comandada pelo General Marco Evangelista Perez Gimenez, passando pelo Foro de São Paulo, as relações entre regime Bolivariano e o Partido dos Trabalhadores, a acensão de Hugo Chavez, a entrada de Maduro, até os dias de hoje.\n\nMuitas informações novas que nunca estariam nos arquivos da mídia oficial e das produtoras do mainstream são trazidas à tona de forma pedagógica e em pouco tempo. \n\n- https://www.youtube.com/watch?v=w0LuZFE_BRE",
				"added": 1606328670
			},
			{
				"comment_id": 28,
				"body": "**Os 11 Supremos**\n---\nO documentário Os donos da verdade apresentou o risco que a liberdade de expressão corre no Brasil, a série Os 11 supremos coloca tudo que foi dito em xeque. A verdade pode ser dita até que ponto?\n\n- https://www.youtube.com/watch?v=xdRCQr352bA",
				"added": 1606329763
			},
			{
				"comment_id": 45,
				"body": "**AS GRANDES MINORIAS**\n---\nAs minorias ganharam as capas dos jornais nos últimos tempos e moldaram a opinião da população com as pautas da militância.\n\n**OS ANTIFASCISTAS  - EPISÓDIO 1**\n- https://www.youtube.com/watch?v=sPjDv2y_f9M\n\n**GERAÇÃO SEM GÊNERO - EPISÓDIO 2**\n- https://www.youtube.com/watch?v=EOdcJ7JuiXk\n\n**VIDAS (NEGRAS) IMPORTAM - EPISÓDIO 3**\n- https://www.youtube.com/watch?v=hyAGftWKEh0",
				"added": 1606542463
			},
			{
				"comment_id": 56,
				"body": "**ESPECIAL DE NATAL BRASIL PARALELO | Episódio 1/3**\n---\n- https://www.youtube.com/watch?v=K9ehE0S1IwA\n\nReunimos grandes nomes e uma orquestra completa para celebrar esse momento tão especial. Um evento inédito que resgatará o verdadeiro significado do Natal.",
				"added": 1608061313
			},
			{
				"comment_id": 57,
				"body": "**ESPECIAL DE NATAL BRASIL PARALELO | Episódio 2/3**\n---\n- https://www.youtube.com/watch?v=nY5zMj4WKWY\n\nReunimos grandes nomes e uma orquestra completa para celebrar esse momento tão especial. Um evento inédito que resgatará o verdadeiro significado do Natal.",
				"added": 1608240202
			},
			{
				"comment_id": 58,
				"body": "**ESPECIAL DE NATAL BRASIL PARALELO | Episódio 3/3**\n---\n- https://www.youtube.com/watch?v=dlORSRep7HY\n\nReunimos grandes nomes e uma orquestra completa para celebrar esse momento tão especial. Um evento inédito que resgatará o verdadeiro significado do Natal.",
				"added": 1609010809
			},
			{
				"comment_id": 62,
				"body": "> [landlor](#comment_2_18s9bPc31yy9Hx5o27ixbtFkvaHL5FRRrd): Qual é a dificuldade se tem no youtube?\n\nQuero divulgar por aqui tbm. Posso?",
				"added": 1613090636
			},
			{
				"comment_id": 63,
				"body": "**A Queda Argentina - trailer oficial**\n---\n- https://www.youtube.com/watch?v=SEbrtQ4hXGc\n\nConfira agora o trailer oficial da nova trilogia da Brasil Paralelo \"A Queda Argentina\", que estreia dia 22 de fevereiro.\n\nClique no link para saber mais e receber de graça os conteúdos exclusivos da nova produção e um e-book exclusivo: https://bit.ly/3p9YdJ8",
				"added": 1613090830
			},
			{
				"comment_id": 64,
				"body": "**A Queda Argentina - COMPLETO**\n---\n\n- https://www.youtube.com/watch?v=dadsluy_IDc&list=PL3yv1E7IiXyTJjinyHasMWtc0NegBnMAg\n\nA QUEDA ARGENTINA faz parte de um projeto que vem conscientizando milhões de brasileiros.",
				"added": 1614534983
			},
			{
				"comment_id": 65,
				"body": "**O fim da velha mídia está próximo**\n---\n- https://www.youtube.com/watch?v=kUsosDT-3BY\n\nOs grandes grupos de comunicação perderam credibilidade e estão perdendo cada vez mais audiência. Não são mais hegemônicos.\n\nO que se viu nos últimos anos foi uma atitude da população brasileira em não aceitar ser subestimada e manipulada pela velha mídia. \n\nIsso criou uma nova oportunidade na história do Brasil. A de recriarmos os meios de comunicação e a qualidade do conteúdo que circula na nossa cultura.\n\nE é exatamente nesse cenário e com esse objetivo que a Brasil Paralelo foi fundada.\n\nEstamos completando 5 anos desde a nossa fundação.\n\nAnalisando o nosso crescimento, percebemos que os 5 primeiros anos da empresa são mais bem sucedidos do que os 5 primeiros anos da Rede Globo.",
				"added": 1616020424
			}
		],
		"2_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": [
			{
				"comment_id": 32,
				"body": "**Ditadura na Coreia do Norte**\n---\n- https://www.educabras.com/ensino_medio/materia/geografia/conflitos_e_crises_atuais/aulas/ditadura_na_coreia_do_norte\n\nA ditadura de Kim Jong Un emprega punição coletiva para silenciar opositores. Não existe liberdade de imprensa ou de religião no país",
				"added": 1606509254
			},
			{
				"comment_id": 33,
				"body": "**A cruzada dos norte-coreanos para fugir do país**\n---\n- https://web.archive.org/web/20201127204213/https://jornalggn.com.br/internacional/a-luta-de-norte-coreanos-para-fugir-do-pais/\n\nUm documentário produzido pelo canal português Sic Notícias mostra a dificuldade que os cidadãos norte-coreanos enfrentam para fugir do país que, desde os anos 1950, está sob a ditadura do Partido dos Trabalhadores da Coreia, hoje liderada por Kim Jong-un, filho de Kim Jong-Il e neto de Kim Il-sung, fundadores do único partido permitido naquela nação.",
				"added": 1606509872
			},
			{
				"comment_id": 34,
				"body": "**A crueldade do regime de Kim Jong-un**\n---\n- https://web.archive.org/web/20200513164604/https://ideiasradicais.com.br/a-crueldade-do-regime-de-kim-jong-un/\n\n**Uma rede de gulags**\n\nOs norte-coreanos vivem com medo e essa é uma estratégia do modelo de governo do ditador. Por lá, pessoas acusadas de crimes políticos são presas e levadas para campos de prisioneiros sem julgamento, enquanto suas famílias são mantidas no escuro sobre seus paradeiros.\n\nAté 120 mil presos estavam entre as quatro principais prisões políticas do país em 2014 e foram submetidos a condições terríveis de encarceramento, de acordo com a ONU.\n\nNesses campos, os prisioneiros passam fome, são torturados, estuprados e forçados a trabalhar. Além disso, os direitos reprodutivos são negados por meio de abortos induzidos e infanticídios.\n\nÀs vezes, as execuções acontecem inclusive em público. Segundo um relatório das Nações Unidas, centenas de milhares de presos políticos morreram nesses locais nos últimos 50 anos.\n\nJunto aos campos políticos, a Coreia do Norte também opera prisões para os acusados ​​de crimes comuns. Algumas das quais são campos de trabalho de curto prazo. Outros, servem para manter prisioneiros que enfrentam tortura por longos períodos.",
				"added": 1606510110
			},
			{
				"comment_id": 35,
				"body": "**Coreia do Norte – Conflito e Ditadura. Entenda a crise e as últimas notícias**\n---\n- https://web.archive.org/web/20200815193934/https://www.gestaoeducacional.com.br/coreia-do-norte-conflito-e-ditadura/\n\nO conflito na Coreia do Norte iniciou a partir da Segunda Guerra mundial e ainda hoje representa vários impasses, dois quais inclui uma ditadura, o fechamento do país para relações comerciais e a criação de armas nucleares",
				"added": 1606510275
			},
			{
				"comment_id": 36,
				"body": "**A ditadura na Coreia do Norte e o mundo do lado de fora do aquário**\n---\n- https://telegra.ph/A-ditadura-na-Coreia-do-Norte-e-o-mundo-do-lado-de-fora-do-aqu%C3%A1rio-11-27\n\nA ideologia esquerdista colocou a modernidade num aquário de ilusões; nela vivem grande parte de nossos intelectuais, jornalistas, formadores de opinião e universitários; nesse reduto que os gurus socialistas mantêm em cárcere privado — isto é, refém de um discurso único — as mentes das pessoas doutrinadas (que chamaremos de “peixes” aqui no texto) que são incapazes de romper as paredes de vidro que os cercam.",
				"added": 1606510912
			},
			{
				"comment_id": 37,
				"body": "**Eles escaparam da Coreia do Norte e revelam a vida de desamparo e fome sob o comunismo**\n---\n- https://telegra.ph/Eles-escaparam-da-Coreia-do-Norte-e-revelam-a-vida-de-desamparo-e-fome-sob-o-comunismo-11-27\n\nEsse foi justamente um dos desafios encontrados pela jornalista Barbara Demick, enviada para a Península da Coreia por um jornal americano para ser correspondente internacional dos dois países. Demick morava em Seul, capital da Coreia do Sul, e fez poucas viagens ao país vizinho, que bloqueava constantemente a visita de jornalistas estrangeiros.\n\nAs únicas viagens que conseguiu realizar eram acompanhadas de perto por um guarda-costas, que não permitia que ela se desviasse do roteiro original ou falasse com outras pessoas que não estavam pré-estabelecidas na programação oficial, que se mantinham a um discurso de enaltecimento nacional.\n\nO jeito que a jornalista encontrou para entender melhor o que acontece no país foi conversar com ex-moradores: pessoas que eventualmente conseguiram sair do país e estavam dispostas a contar suas histórias.",
				"added": 1606511466
			},
			{
				"comment_id": 38,
				"body": "**Miséria, fome e autoritarismo: Histórias proibidas da Coreia do Norte**\n---\n\n- https://telegra.ph/Mis%C3%A9ria-fome-e-autoritarismo-Hist%C3%B3rias-proibidas-da-Coreia-do-Norte-11-27\n\nCom uma produção literária exclusivamente propagandista e com censura fortíssima, é fácil ver porque os textos de Bandi são tão perigosos. Em sete contos, o autor revela que a Coreia do Norte é gerida por um sistema de privilégio, no qual aqueles que têm bons contatos conseguem mais chances ou vantagens. Além disso, a população vive com medo constante e as necessidades básicas de alimentação e saúde não são atendidas. Ele também apresenta o sistema com suas contradições internas: no discurso, se diz igualdade, na prática se vê a desigualdade.",
				"added": 1606511977
			},
			{
				"comment_id": 39,
				"body": "**A vida e as crueldades de Kim Jong-il, ditador da Coreia do Norte**\n---\n- https://web.archive.org/web/20200227040332/https://super.abril.com.br/mundo-estranho/a-vida-e-as-crueldades-de-kim-jong-il-ditador-da-coreia-do-norte/\n\nAs decisões erradas desse tirano causaram uma crise de fome que matou 2 milhões de pessoas",
				"added": 1606512193
			},
			{
				"comment_id": 40,
				"body": "**Um desertor norte-coreano: “Delatei minha mãe por uma ração de arroz”**\n---\n- https://web.archive.org/web/20190715044516/https://brasil.elpais.com/brasil/2014/02/18/internacional/1392732706_750079.html\n\nA ONU documenta crimes contra a humanidade na Coreia do Norte Nesse país de 25 milhões de habitantes, existem cerca de 100 mil presos em campos de concentração",
				"added": 1606512469
			},
			{
				"comment_id": 41,
				"body": "**Reportagem do SBT sobre a ditadura da Coreia do Norte**\n---\n- https://www.youtube.com/watch?v=Fwap4lz1ma4\n\n**Outro documentário sobre a ditadura da Coreia do Norte**\n---\n- https://www.youtube.com/watch?v=SfH8TJYMRrg",
				"added": 1606512774
			},
			{
				"comment_id": 42,
				"body": "**6 filmes que mostram os horrores da ditadura da Coreia do Norte**\n---\n- https://telegra.ph/6-filmes-que-mostram-os-horrores-da-ditadura-da-Coreia-do-Norte-11-27\n\nO cinema é uma das principais atividades de lazer na Coreia do Norte. Porém, com uma restrição: apenas filmes produzidos no país são exibidos por lá. As produções hollywodianas são proibidas e, caso alguém seja flagrado assistindo a um filme de fora, será severamente punido. Com exceção do líder Kim Jon-Un, que é fã de diversos filmes estrangeiros, como os do agente 007, James Bond.",
				"added": 1606514366
			},
			{
				"comment_id": 43,
				"body": "**Os parasitas que infestam os norte-coreanos: “Nunca vi nada parecido”**\n---\n- https://telegra.ph/Os-parasitas-que-infestam-os-norte-coreanos-Nunca-vi-nada-parecido-11-27\n\nSofrimento do último desertor norte-coreano, que carregava vermes de até 27 centímetros no organismo, é uma pequena amostra da vida no país de Kim-Jong-un",
				"added": 1606514833
			},
			{
				"comment_id": 44,
				"body": "**Bebês mortos a pauladas, fome e execuções: a vida em um campo de concentração norte-coreano**\n---\n- https://telegra.ph/Beb%C3%AAs-mortos-a-pauladas-fome-e-execu%C3%A7%C3%B5es-a-vida-em-um-campo-de-concentra%C3%A7%C3%A3o-norte-coreano-11-28\n\nInfelizmente virou lugar-comum fazer comparações descabidas com o nazismo e o fascismo. Pessoas são igualadas a Hitler e ações com o nazismo com uma facilidade que na verdade constituem uma afronta ao pesadelo enfrentado pelos judeus sob o regime totalitário e assassino do Terceiro Reich. Mas existe algo que dura há mais de 50 anos e continua acontecendo com o conhecimento do mundo inteiro que não é exagero comparar com o pior da Alemanha nazista: os campos de prisioneiros da Coreia do Norte.",
				"added": 1606542145
			},
			{
				"comment_id": 46,
				"body": "**6 obras para entender o legado de horror deixado pelas revoluções comunistas**\n---\n- https://telegra.ph/6-obras-para-entender-o-legado-de-horror-deixado-pelas-revolu%C3%A7%C3%B5es-comunistas-11-30\n\nA Revolução Comunista chega ao seu centenário carregada por uma carga negativa. As marcas deixadas pelo regime totalitarista que inspirou movimentos de esquerda pelo mundo são difíceis de ser esquecidas, em especial, pelo povo soviético e outros sobreviventes dos métodos criados pelos comunistas. A literatura, ao longo dos anos, tem compilado de maneira diversa os efeitos dessa ideologia.",
				"added": 1606698833
			},
			{
				"comment_id": 47,
				"body": "**Estudo mostra que o comunismo estimula a desonestidade nos indivíduos**\n---\n- https://telegra.ph/Estudo-mostra-que-o-comunismo-estimula-a-desonestidade-nos-indiv%C3%ADduos-12-01\n\n Que o socialismo prejudica as pessoas que vivem sob esses regimes, piorando as condições de vida e suprimindo a liberdade, todo mundo sabe. Agora um estudo recente aponta que o comunismo pode também ter um efeito negativo sobre a honestidade dos indivíduos.",
				"added": 1606856268
			},
			{
				"comment_id": 48,
				"body": "**Situação de direitos humanos na Coreia do Norte não teve melhora, diz ONU**\n---\n- https://exame.com/mundo/situacao-de-direitos-humanos-na-coreia-do-norte-nao-teve-melhora-diz-onu/#:~:text=A%20Coreia%20do%20Norte%20nega,comunidade%20internacional%20para%20isol%C3%A1%2Dla.\n\nProibido pelo governo de entrar na Coreia do Norte, o relator especial da ONU para direitos humanos na Coreia do Norte, Tomas Quintana, visitou a Coreia do Sul nesta semana como parte de uma investigação que será apresentada ao Conselho de Direitos Humanos da ONU em março.",
				"added": 1607113992
			},
			{
				"comment_id": 49,
				"body": "**Norte-coreanos enfrentam “violações de direitos humanos e incertezas no ambiente jurídico”**\n---\n- https://news.un.org/pt/story/2019/05/1674061\n\nUm relatório da ONU destaca que as populações da Coreia do Norte estão envolvidas em um círculo vicioso, em que a falha do Estado em suprir necessidades básicas as obriga a recorrer a mercados rudimentares. Nesse processo, ocorrem “violações dos direitos humanos e incertezas no ambiente jurídico”.\n\nO estudo do Escritório de Direitos Humanos tem como título “O preço é direitos: a violação do direito a um padrão de vida adequado na República Democrática Popular da Coreia”  e descreve a ação de serviços públicos há mais 20 anos.",
				"added": 1607114075
			},
			{
				"comment_id": 50,
				"body": "**ONU condena abusos de direitos humanos da Coreia do Norte, que rejeita resolução**\n---\n- https://www.terra.com.br/noticias/mundo/onu-condena-abusos-de-direitos-humanos-da-coreia-do-norte-que-rejeita-resolucao,396ba1084ddee16a80a3ad8fe6216d3ag7h2tpg3.html\n\n- https://archive.is/it2IB (**backup**)\n\nA resolução, patrocinada por dezenas de países, incluindo os Estados Unidos, foi adotada pela Assembleia-Geral de 193 membros, sem votação. Essas resoluções não são vinculativas, mas podem ter peso político.",
				"added": 1607199866
			},
			{
				"comment_id": 51,
				"body": "**ONU condena Coreia do Norte por violação sistemática dos direitos humanos**\n---\n- https://www.dn.pt/mundo/onu-condena-coreia-do-norte-por-violacao-sistematica-dos-direitos-humanos-10336539.html\n\n- https://web.archive.org/web/20201207182857/https://www.dn.pt/mundo/onu-condena-coreia-do-norte-por-violacao-sistematica-dos-direitos-humanos-10336539.html (**Backup**)\n\n- https://archive.is/EcaRK (**Backup**)\n\nA ONU condenou a Coreia do Norte \"pela violação sistemática e generalizada dos direitos humanos\" e por desviar recursos para armas nucleares e mísseis em vez de cuidar do bem-estar da população.\n\nA Assembleia-Geral da ONU notou \"com preocupação\" que cerca de dez milhões de norte-coreanos são considerados subnutridos e na Coreia do Norte há \"uma inaceitável elevada prevalência de malnutrição crónica e aguda\".",
				"added": 1607365625
			},
			{
				"comment_id": 52,
				"body": "**Dezenas de mulheres repatriadas sofreram abusos na Coreia do Norte**\n---\n- https://www.dw.com/pt-br/dezenas-de-mulheres-repatriadas-sofreram-abusos-na-coreia-do-norte/a-54355184\n\n- https://archive.is/YNhhb (**Backup**)\n\nDezenas de mulheres que saíram da Coreia do Norte para procurar trabalho no exterior foram vítimas de abusos cometidos por agentes de segurança norte-coreanos após terem sido forçadas a regressar ao país, denunciou nesta terça-feira (28/07) o Alto Comissariado das Nações Unidas para os Direitos Humanos.\n\nSegundo o relatório da ONU, que ouviu cerca de 100 norte-coreanas que foram repatriadas à força e detidas entre 2009 e 2019, os abusos incluem estupros, espancamentos, revistas corporais invasivas e abortos forçados. As mulheres ficaram ainda presas em locais considerados insalubres e quase sem alimentação. Uma das detidas teria morrido por inanição.",
				"added": 1607444411
			},
			{
				"comment_id": 53,
				"body": "**DITADURA NA COREIA DO NORTE**\n---\n- https://www.educabras.com/ensino_medio/materia/geografia/conflitos_e_crises_atuais/aulas/ditadura_na_coreia_do_norte\n\n- https://archive.vn/0umYb (**backup**)\n\nA Coreia do Norte é um dos regimes mais autoritários e repressivos do mundo. A família Kim e o Partido dos Trabalhadores da Coreia do Norte governam o país desde 1948.",
				"added": 1607535503
			},
			{
				"comment_id": 54,
				"body": "**Presos são tratados 'pior do que animais' na Coreia do Norte, diz Human Rights Watch**\n---\n- https://g1.globo.com/mundo/noticia/2020/10/19/presos-sao-tratados-pior-do-que-animais-na-coreia-do-norte-diz-human-rights-watch.ghtml\n\n- https://archive.vn/9SsLx (**backup**)\n\nEm documento que reúne informações de ex-prisioneiros e autoridades do governo, a ONG internacional registrou graves infrações aos direitos humanos.\n\nTortura, humilhação e confissões forçadas são práticas comuns no sistema de justiça norte-coreano, que trata seus presos \"pior do que os animais\", de acordo com relatório da ONG Human Rights Watch (HRW)",
				"added": 1607618699
			},
			{
				"comment_id": 55,
				"body": "**Os \"crimes contra a humanidade\" cometidos pelo regime de Kim Jong-un**\n---\n-https://www.dn.pt/mundo/os-crimes-contra-a-humanidade-cometidos-pelo-regime-de-kim-jong-un-9440731.html\n- https://archive.vn/K6m9k (**backup**)\n\nEm março de 2013 o Conselho de Direitos Humanos da ONU decidiu avançar para uma comissão de inquérito sobre a situação da Coreia do Norte. O australiano Michael Kirby, a sérvia Sonja Biserko e o indonésio Marzuki Darusman, relator especial para os direitos humanos na República Popular da Coreia do Norte, foram os membros indicados para prosseguir com a investigação.",
				"added": 1607986711
			},
			{
				"comment_id": 59,
				"body": "**Liderado por Kim, regime exerce brutal controle sobre os norte-coreanos **\n---\n- https://web.archive.org/web/20201111162957/https://www1.folha.uol.com.br/mundo/2018/06/liderado-por-kim-regime-exerce-brutal-controle-sobre-os-norte-coreanos.shtml\n\nExecuções e doutrinação estão entre violações dos direitos humanos apontadas no país",
				"added": 1609011187
			},
			{
				"comment_id": 66,
				"body": "**COREIA DO NORTE: SEGREDOS OBSCUROS | HISTORY CHANNEL DOCUMENTÁRIO**\n---\n- https://www.youtube.com/watch?v=0ehDO8S3L_U\n\nEste especial revela a história complexa, a política extremista e os rígidos padrões sociais que deram azo a um legado de opressão interna e agressão externa. Enquanto a fome domina o povo norte-coreano, além do trabalho escravo em verdadeiros campos de concentração e das execuções públicas, o regime de Kim passou três gerações a lutar de forma inflexível pelos seus ambiciosos sonhos no campo nuclear. Operam como uma máfia, usando dinheiro falsificado, droga e espionagem cibernáutica para financiar a máquina de Guerra. Agora, com armas capazes de fazer frente às superpotências mundiais, a retórica agressiva levou o mundo a uma situação de crise iminente.",
				"added": 1616020854
			}
		]
	},
	"comment_vote": {
		"7_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"8_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"9_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"14_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"13_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"10_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"15_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"16_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"24_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"23_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"22_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"21_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"20_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"25_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"27_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"28_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"26_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"19_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"18_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"17_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"30_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"31_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"42_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"43_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"40_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"41_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"37_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"38_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"39_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"34_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"35_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"36_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"33_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"32_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"45_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"46_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"44_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"56_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"60_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1,
		"61_1EAN2UcrFkR3piGpPMhkfwfxgX5iV3jciT": 1
	}
}