{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1565969602,
			"title": "How does prostitution work in Communism?",
			"body": "If i want sex with a hot chick, and a hot chick can provide me with it, she is obligated to do it... for free of course, ... right?",
			"added": 1565969601
		},
		{
			"topic_id": 1565985176,
			"title": "[Poll] Chinks or Rioters?",
			"body": "Vote here: https://www.strawpoll.me/18490749\nLets see what zeronet thinks.",
			"added": 1565985174
		},
		{
			"topic_id": 1565986540,
			"title": "a group inside a group?",
			"body": "",
			"added": 1565986537,
			"parent_topic_uri": "1565986382_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m",
			"type": "group"
		},
		{
			"topic_id": 1566461918,
			"title": "Reminder that jews did 9/11",
			"body": "it is proven",
			"added": 1566461914
		},
		{
			"topic_id": 1571272586,
			"title": "I hate niggers",
			"body": "yes, i do",
			"added": 1571272581
		},
		{
			"topic_id": 1571905302,
			"title": "Tor Browser Update REEEEEEEE",
			"body": "Did the recent Tor Browser Update get rid of the \"No Proxy For\" option where you had to set 127.0.0.1 to be able to access zeronet?\nI had to fuck around with setting network.proxy.no_proxies_on in about:config now.",
			"added": 1571905296
		}
	],
	"topic_vote": {
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 1,
				"body": "> [memesadler](#comment_89_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I'd just like to interject for a moment. What you're referring to as Linux, is in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX. [...]\n\nNo, Richard, it's 'Linux', not 'GNU/Linux'. The most important contributions that the FSF made to Linux were the creation of the GPL and the GCC compiler. Those are fine and inspired products. GCC is a monumental achievement and has earned you, RMS, and the Free Software Foundation countless kudos and much appreciation.\n\nFollowing are some reasons for you to mull over, including some already answered in your FAQ.\n\nOne guy, Linus Torvalds, used GCC to make his operating system (yes, Linux is an OS -- more on this later). He named it 'Linux' with a little help from his friends. Why doesn't he call it GNU/Linux? Because he wrote it, with more help from his friends, not you. You named your stuff, I named my stuff -- including the software I wrote using GCC -- and Linus named his stuff. The proper name is Linux because Linus Torvalds says so. Linus has spoken. Accept his authority. To do otherwise is to become a nag. You don't want to be known as a nag, do you?\n\n(An operating system) != (a distribution). Linux is an operating system. By my definition, an operating system is that software which provides and limits access to hardware resources on a computer. That definition applies whereever you see Linux in use. However, Linux is usually distributed with a collection of utilities and applications to make it easily configurable as a desktop system, a server, a development box, or a graphics workstation, or whatever the user needs. In such a configuration, we have a Linux (based) distribution. Therein lies your strongest argument for the unwieldy title 'GNU/Linux' (when said bundled software is largely from the FSF). Go bug the distribution makers on that one. Take your beef to Red Hat, Mandrake, and Slackware. At least there you have an argument. Linux alone is an operating system that can be used in various applications without any GNU software whatsoever. Embedded applications come to mind as an obvious example.\n\nNext, even if we limit the GNU/Linux title to the GNU-based Linux distributions, we run into another obvious problem. XFree86 may well be more important to a particular Linux installation than the sum of all the GNU contributions. More properly, shouldn't the distribution be called XFree86/Linux? Or, at a minimum, XFree86/GNU/Linux? Of course, it would be rather arbitrary to draw the line there when many other fine contributions go unlisted. Yes, I know you've heard this one before. Get used to it. You'll keep hearing it until you can cleanly counter it.\n\nYou seem to like the lines-of-code metric. There are many lines of GNU code in a typical Linux distribution. You seem to suggest that (more LOC) == (more important). However, I submit to you that raw LOC numbers do not directly correlate with importance. I would suggest that clock cycles spent on code is a better metric. For example, if my system spends 90% of its time executing XFree86 code, XFree86 is probably the single most important collection of code on my system. Even if I loaded ten times as many lines of useless bloatware on my system and I never excuted that bloatware, it certainly isn't more important code than XFree86. Obviously, this metric isn't perfect either, but LOC really, really sucks. Please refrain from using it ever again in supporting any argument.\n\nLast, I'd like to point out that we Linux and GNU users shouldn't be fighting among ourselves over naming other people's software. But what the heck, I'm in a bad mood now. I think I'm feeling sufficiently obnoxious to make the point that GCC is so very famous and, yes, so very useful only because Linux was developed. In a show of proper respect and gratitude, shouldn't you and everyone refer to GCC as 'the Linux compiler'? Or at least, 'Linux GCC'? Seriously, where would your masterpiece be without Linux? Languishing with the HURD?\n\nIf there is a moral buried in this rant, maybe it is this:\n\nBe grateful for your abilities and your incredible success and your considerable fame. Continue to use that success and fame for good, not evil. Also, be especially grateful for Linux' huge contribution to that success. You, RMS, the Free Software Foundation, and GNU software have reached their current high profiles largely on the back of Linux. You have changed the world. Now, go forth and don't be a nag.\n\nThanks for listening.\nFUCK NIGGERS",
				"added": 1565959895
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac@kxoid.bit](#comment_114_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): This I wondered. So they're playing \"race war\" just to make a charade of sorts.\n\nYes, its all satire, everybody here accepts the existence of the Nazi masturbation machines, the lampshades out of jew skin, giant pools where people got killed by electro shocks and the rollercoasters straight into huge ovens. Nobody would ever question that. It's all satire.",
				"added": 1565982152
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac@kxoid.bit](#comment_115_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Judaism isn't a race.\nThats why we call them jews, nigger.\nhttps://en.wiktionary.org/wiki/Judaist\nhttps://en.wiktionary.org/wiki/Jew#English\nhttps://en.wikipedia.org/wiki/Medical_genetics_of_Jews#Ashkenazi_diseases",
				"added": 1565983880
			},
			{
				"comment_id": 9,
				"body": "> [xcape2net](#comment_319_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): They have no right to start telling the rest of us to leave.\nAnd nobody did that.\nBut you have to see the irony behind actively choosing to stay around an unmoderated decentralized plattform and then wondering why people might say oppinions that offend you.",
				"added": 1565984172
			}
		],
		"1565969602_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 2,
				"body": "> [mido](#comment_15_1G2nXDHaHSiL2SV5w9jy1tWddBS5EegZMw): A human is not a goods.\nA human provides a service, be it hard manual labour, a hairdresser cutting your hair, or a prostitute sucking you dry.\nSo communists agree that the first two examples here should be free, simply because you want it, and in exchange, you provide some service for free to the commune... if you feel like it... because of your social obligation to provide things to other comrades if you are able to and they want it.\n\nSo by commie logic, i get free sex with hot chicks? Right?",
				"added": 1565971485
			},
			{
				"comment_id": 4,
				"body": "> [russianspy](#comment_10_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9): Prostitution cannot exist under communism. Prostitution is an exchange for money. Under communism commodity barriers are broken down and the means of production become collectively owned by the community; Meaning that there is no hoarding of resources that leads to exchange as a necessary general rule of the economy. [...]\n\nThen make up some other word for it, who cares, you know what i mean.\nIf the basic service from a hair dresser and plumber is free, then it's also the case for prostitution.\n\nIf you imply that there won't be any prostitution because no chick will do it for free, then i have to ask you the question why you think that there will be some people readily doing all other shitty jobs that are neccessary for society to function, but that people just do because of money?",
				"added": 1565973443
			},
			{
				"comment_id": 5,
				"body": ">Isn't prostitution done because it isn't free? isn't it just having sex at that point?\nYou can have sex because for procreation, or with your partner out of love, or because both find each other hot and want a quick fuck.\n\nBut prostitution is a service that a girl provides for you, she doesn't know you, she doesn't find you hot, You just buy 30min with her to release some cum.\n\nSo do i get free whores to fuck in communism or not?",
				"added": 1565973877
			},
			{
				"comment_id": 6,
				"body": "> [xlk](#comment_70_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): Yeah, some things are blocked like Google and Facebook. Torrents work fine and Zeronet didn't have any trouble. Tor needs a bridge.  [...]\n\nHow does prostitution in chink land work?",
				"added": 1565974362
			}
		],
		"1565966228_1DSKrukt2XkjBwy7bCdqsHpgeSiF8DoaRn": [
			{
				"comment_id": 3,
				"body": "My wife bought me a Nintendo Switch and allowes me to play Pokemon on it when she is getting pounded by Tyron.\nIt is very relaxing and i love it nearly as much as i love my soylent drink.Only problem is that i have to share it with my wifes son.",
				"added": 1565972064
			}
		],
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": [
			{
				"comment_id": 10,
				"body": "You could take some complexity out of the proposal by letting every zite-owner itself  be the root node in your WoT for that zite.\nYou have to trust the owner of a zite anyway, when you visit it, and he is already in control of the content of the zite.\n\n> [stardust666](#comment_4_16Fu36vdXG8dynYf9XUqN9F1za5xa19gHK): The authority is just a zite with a mapping in a certain format. The developer of each zite chooses which authority to trust. https://zeronet.io/docs/site_development/cert_authority/\n\nReading this, it means that in the current design it's not possible for a CA to sign a User Certificate that expires or to declare an already issued certificate as invalid. It's just a user/key mapping that's valid in all eternity.\nThat limits the ability to of dealing with spam or malicious behaviour a lot.",
				"added": 1571415193
			}
		],
		"1571549623_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 11,
				"body": "I am just into ordinary bondage or light BDSM. Like, BDSM but just with light pain/slapping. With the girl as the sub.\nIt's the most popular fetish, pretty normie stuff, not embarrassing at all.\n\nbtw. if you jerk off to some weird fetish porn and after you cum feel disgusted about yourself, you don't have that fetish, you are just jerking off so much that you have to consum more and more fucked up porn. Just stop jerking off for a while, and then think about it again.",
				"added": 1571564301
			}
		],
		"1573908669_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 12,
				"body": "If a sponge grenade is the most brutal thing that happens there, in a riot where apparently millions participate, then i don't see much of a problem.\nIf that would be Detroit, that wouldn't be just a sponge grenade, people would die, and it wouldn't even be on the local news, because it's just an ordinary daily occurrence.\n\nAnd that's why those protests look so staged, because it's full of fake outrage that wouldn't be an issue if it would happen literally anywhere else on this world. If you want support for your freedom fighters™, stop doing that. It smells so much like the arab spring, where we had the exact same kind of \"news\", and it ended up with fucking ISIS.\n\nI don't even know for what they are currently rioting. They don't have any demands anymore. That one law that they didn't like got dropped a long time ago already. What do they want? Independence? How would that look like? Without China using HongKong as a Hub, they will experience an economic crash. Whats their plan of dealing with it? Will they then become totally independent on the USA or whoever pays? So from one dependence you switch to another?\nOr do they want to replace the Chinese Commie Government to something that's not as horrible? That would be a legit concern, but for that they have to shill for mainland China support, but they don't do that, they are very eager to limit it on HongKong and not even Taiwan cares.\n\nSo what exactly do they want?\nHow do they want it?",
				"added": 1574270433
			},
			{
				"comment_id": 13,
				"body": "> [z3n5if](#comment_78_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): It's better to deal with probable economic trouble now than definite oppression later.This is the same argument used to say that the UK should remain in the EU even though it's undemocratic.\n\nIts the same argument, just that it's valid for HongKong, while its not valid for the UK.\n\nThe UK is a country that can and has been independent until at least the Maastricht Treaty 1992, producing it's own goods, not totally relying on the EU, able to feed itself, and that doesn't share the same ethnicity and culture with the rest of the EU.\nHong Kong is 92% Chinese, all it's wealth is based on being a trading Hub for Chinese companies, it can't stand on it's own, being independent from China would immediately mean to switch to being dependent on someone else (most likely the USA, which is on the other side of the globe, a totally different culture and they don't have a good reputation of taking care of their sock puppet states).\n\nThe plan for the UK is to go back to being independent like how it was before the EU turned into a repressive aristocracy.\nWhat is the plan for Hong Kong? Do the rioters actually want independence? \nBecause i really do not see any clear stance, maybe i am just not well informed. So they are actually separatists now?",
				"added": 1574349644
			}
		],
		"1574883594_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "I agree that it's the Content Creators fault,\nAnd i totally support CPPA. Youtube went full censorship on everything that isn't pc and child friendly and actively targeted the platform towards children. And most creators go with it and make shit for children. And now the government treats youtube as what it is: A platform aimed at children. And applies basic child protection laws.\n\nThose shitheads making content for children and being outraged that they can't exploit and violet the privacy of children should kill themselves.\nAnd the shitheads with million of subscribers complaining about youtube censoring them for years, but never taking the step to make their own platform, can fuck themselves too. Especially pewdiepie. He has 100 million subscribers, he could pressure youtube or just go to another platform, every platform that he shills will immediately have millions of users, he just has to say a word and everyone will follow. But he decides to be a cuck instead and bows to youtube and let them fuck him in the ass.\n\nand god, you have to place your cam differently.",
				"added": 1574886389
			}
		]
	},
	"comment_vote": {}
}