{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Don't let \"A S S A D W A V E\" die!",
			"body": "I don't own this zite, but I noticed I'm the only seeder left. Help me fix that boys.\nhttp://127.0.0.1:43110/1FaRfsHb3uc6dtMMPTfRRiNPvB8txnsMrC/",
			"added": 1497575962
		},
		{
			"topic_id": 1523567875,
			"title": "Pouring milk into a bowl of cereal in honor of Adam Sandler",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1523512831_1DmuqxmEjz9fYuHqsS5Jte9GE29J7t2xSN",
			"added": 1523567873
		},
		{
			"topic_id": 1531822752,
			"title": "How To Hang Sayori in real life",
			"body": "1. Download an image of a hanging Sayori onto your phone - preferably ipad or tablet.\n2. Set the said image as lock screen (if your charger port is at the bottom of your device, flip the image upside down)\n3. Connect a long charger cable to your device (Doesn't have to actually be charging)\n4. Congratulations. You now have a hanging Sayori for your viewing pleasure.",
			"added": 1531822749
		},
		{
			"topic_id": 1535156678,
			"title": "A Topic On Japan-Weeaboo Relations",
			"body": "Hi. I'm person who studies Japanese cultural influences on Americans and how American or Western culture has influenced Japan. Not really, I'm really just here to talk about the obsessive Japanese sub-culture domination that inflated over the past decade or so... Which is typically listed as Anime (Animation) or Manga (Graphic novels).\n\nAs someone who has lived in Japan for around eleven years, I have been exposed to such sub-cultures before. And those said sub-cultures are incredibly looked down upon, enough to spawn stereotypical slurs such as Hikikomori (Shut-in) and Otaku (Geek). There is no pride in being either or both of those things, yet the youth in Western civilization seem to want to adopt such lifestyles. As someone with cultural ties to Japan, I found this incredibly odd.\n\nBetter yet, people influenced by Anime, Manga, and other Japanese Media seem to carry on some kind of trend of wanting to be Japanese themselves! Denying their own race, abandoning Patriotism, all for some short-lived obsession (Hopefully short-lived...) with anime. Some try to learn Japanese, some completely fail but others are incredibly competent. Rivalling me and my somewhat alright knowledge on the Japanese language. But when they fail... It is the worst. Students have come up to me, just using a horrible mish-mash of Japanese and English at the same time. Some of these perceived weeaboos speak with a high pitch voice, (Are they trying to sound cute, or something?) and say words like 'Baka!' or 'Ja-ne!' or 'Kawaii!' mindlessly. I can't help but feel insulted.\n\nAnd don't talk to me about the ones who come into school wearing a different cosplay, Every. Single. God damn. Day. Just because I lived in Japan for a bit, people expect me to know every single minor reference to some anime episode, or character, or trope. It's a little racist, honestly. Not enough for the Racism Dog to slam them on twitter, but it does make me... Uncomfortable.\n\nRegardless, from what all of my Japanese friends have to say, is that they can generally understand my sensitivity on such matters because as a previous resident, I had to learn several society rules dealing with behaviour, manners, religion, culture and all sorts. In a way, I wouldn't mind criticizing myself for Gate Keeping. However, even if I think it is a particularly cringey passion, anime is still a part of Japan. Though it mostly changes white people for the worse, it keeps the economy going, and most Japanese people seem delighted that foreigners are interested in their land and culture. \n\nI hate the way they act, and the level of disrespect... But, I suppose as long as they make Japan some extra cash by selling out their hobby with more and more One Piece episodes and movies, and merch, I suppose I am fine with their existence (As long as they aren't going to pull a Logan-Paul stunt in Aokigahara. That was just unforgivable).\n\nDoes anyone else have any experiences with weeaboos or Japanophiles? If so, what do you think of them?",
			"added": 1535156674
		},
		{
			"topic_id": 1539909575,
			"title": "Euler has a JS Trojan according to Windows Defender",
			"body": "A Zite with the URL 13eFkhbXXQcJqd729zRLL9tMxxhz9d4UA6 appears to have a JavaScript Trojan, please let me know if anyone knows about this, should it be added to NopeList?",
			"added": 1539909570
		}
	],
	"topic_vote": {
		"3_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1,
		"1_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA": 1,
		"1_1KjKGbXe5KwQkmHdtsyhp1TzRieGu3wPBw": 1,
		"1_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f": 1,
		"1516511139_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC": 1,
		"1516596886_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": 1,
		"1516635756_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": 1,
		"1516719067_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1516735052_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": 1,
		"1516934759_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"1516909698_14fPfJZ6aNTsVoRjGHfprq78VtvBN1vx9F": 1,
		"1517193644_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": 1,
		"1517172421_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": 1,
		"1514422899_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1517916166_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"1518633396_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1519142918_18A7MxMQS5WnxRnQR6CtytEzjZ4UsGRpbm": 1,
		"1519107162_19pJyuDtmDMaXxWCWB4bHdpna37x1TiNMa": 1,
		"1519561412_1PqYB6Rm8CCNtcbZSjLbKTEM2Cey2qkxXc": 1,
		"1520456088_1KG6UMLtakzi7eDDkqCb27nYxa1VGMDcsP": 1,
		"1521091378_1MmenSoorLtuF2FDmJ2iBNrvriQPeRwdJ3": 1,
		"1522317542_1FenK9SJK21haGBvxM7vZNCLp1Z9hsCWUc": 1,
		"1523252023_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": 1,
		"1525203779_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j": 1,
		"1527011238_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1534997008_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1534955222_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX": 1,
		"1535409736_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1536308470_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"1538339767_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": 1
	},
	"next_comment_id": 15,
	"comment": {
		"5_1CnPgdHbuiXvD1M9xPU3UiXKmLwLLQKCVV": [
			{
				"comment_id": 1,
				"body": "Why not have one ZeroTalk with an option to filter by languages? When writing a post you could mark which languages you have translated the post to (if any) and be on your way.",
				"added": 1497180335
			}
		],
		"1_1CHu7fwMzSL51Xn336vf8WFdH7t7TEW65w": [
			{
				"comment_id": 2,
				"body": "Allo to you too pal.",
				"added": 1497346613
			}
		],
		"1_1KjKGbXe5KwQkmHdtsyhp1TzRieGu3wPBw": [
			{
				"comment_id": 3,
				"body": "New Zealand",
				"added": 1498362163
			}
		],
		"1_1DmuqxmEjz9fYuHqsS5Jte9GE29J7t2xSN": [
			{
				"comment_id": 4,
				"body": "> [nawk](#comment_1_1DeqwmPZAx4MD7YcXpe7tbxqXqaAtm1tH6): good music\n\nIt's S I M P S O N W A V E by FrankJavCee.",
				"added": 1498964333
			}
		],
		"1_15CHkoxQnozZEe1A9uXutFRw3FS46Yspvy": [
			{
				"comment_id": 5,
				"body": "Someone probably could make a ROM site on ZeroNet using a database of metadata, screenshots and magnet links. A bit like Play.",
				"added": 1498964466
			}
		],
		"1_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f": [
			{
				"comment_id": 6,
				"body": "Assuming that whatever zite you want to \"DoS\" is popular, I would expect that the hard part would be making enough malicious hosts, but look around for zerotalk discussions on distributing fake versions of a zite, and they might tell you if checking zite hosts takes particularly long or is protected in any way.\n\n@braindonor, there's a difference in meaning; 'zite' is a 'zeronet site' and 'site' is a more generic term.",
				"added": 1504864019
			}
		],
		"1516204068_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": [
			{
				"comment_id": 7,
				"body": "I get cheap (around US$100) new phones and replace them every year or so. They're still good enough for my needs and losing or cracking one is less devastating that way.",
				"added": 1516321738
			},
			{
				"comment_id": 8,
				"body": "ROMs are pretty unpopular on cheap phones, and they never get OS upgrades either, but thankfully I'm finding with my Samsung Galaxy J1 Samsung is at least releasing security updates, still sucks that it's a 2 year old phone stuck on Lollipop 5.1.1 though...",
				"added": 1516430796
			}
		],
		"1516596886_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 9,
				"body": "I'd say the initial goals should be simple; the Wikipedia client is one Zite, and the database is split by languages into respective sub-zites and each sub-zite has the database split into, say 1MB optional files (or alternatively on an article by article basis using optional files, but that's a lotta small files to index), articles are read only so no revision history needs to be kept. No Wikimedia, so images have to be downloaded from the clearnet just to avoid even more network stress.\nIf these goals were reached we'd have a functional Wikipedia mirror for firewalled countries. We can build from there if the ZeroNetwork can handle that.",
				"added": 1516674842
			}
		],
		"1519107162_19pJyuDtmDMaXxWCWB4bHdpna37x1TiNMa": [
			{
				"comment_id": 10,
				"body": "With ZeroNet in it's current stage, it's best that you have at least 5 peers available at the same time. That would never be viable with low quality long range wifi connections between even people in an apartment. It's a wonderful idea, but we need long range fast wireless communication, at this stage it doesn't sound very viable even if everyone in the world was on this hypothetical network.",
				"added": 1519161611
			}
		],
		"1525203779_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j": [
			{
				"comment_id": 11,
				"body": "I can confirm the game code and resources are hosted on the Zite, however once the game is loaded it authenticates with cloud.unity3d.com for the multiplayer features.",
				"added": 1525308590
			}
		],
		"1531822752_1DmuqxmEjz9fYuHqsS5Jte9GE29J7t2xSN": [
			{
				"comment_id": 12,
				"body": "Here's an example (Warning: ClearNet); https://cdn.discordapp.com/attachments/238976460063244288/468705761275674634/image.jpg",
				"added": 1531822807
			}
		],
		"1532639553_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 13,
				"body": "Rev3542 turned up on mine by clicking on update about 24 hours ago.",
				"added": 1532645700
			}
		],
		"1533160269_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 14,
				"body": "Isn't any traffic through TOR encrypted like mad? Taking that into consideration, as long as Tor is on, the only thing really differenciating the two is speed and popularity.",
				"added": 1533172830
			}
		]
	},
	"comment_vote": {
		"7_1AbePuUWjWSijpyTZ9snkkmEz4QZaCaj75": 1,
		"230_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"67_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"937_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"112_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y": 1,
		"371_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"459_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"13_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": 1,
		"2_16rZsjufk1LwqZd42XhqrVxQz8SeDxMfZs": 1,
		"11_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f": 1,
		"242_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"251_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"118_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"269_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"3_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"9_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": 1,
		"15_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU": 1,
		"3_1HkY5PYrDcEiLotJNaANYGLebcDSQ93wP4": 1,
		"64_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"294_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1
	}
}