{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Por Lugares Incríveis\n- https://siasky.net/CADZpE4Gtci1vO7ezHW-d0rcmkVM6WIrts6EA3wxCTixPA\n\nDois adolescentes que estão passando por momentos difíceis criam um forte laço quando embarcam em uma jornada transformadora para visitar as maravilhas de Indiana.",
				"added": 1599957319
			}
		],
		"1_1DJf8DgxdWYpZ1GMguWfX6mPGybGtjA5Sv": [
			{
				"comment_id": 2,
				"body": "Cjdns implementa uma rede IPv6 criptografada usando criptografia de chave pública para alocação de endereços e uma tabela de hash distribuída para roteamento. Isso fornece configuração de rede quase zero e evita muitos dos problemas de segurança e escalabilidade que afetam as redes existentes.\n- GitHub: https://github.com/cjdelisle/cjdns.git",
				"added": 1599957514
			},
			{
				"comment_id": 3,
				"body": "#Ricochet - Mensagens instantâneas anônimas para privacidade real\n- https://ricochet.im/\n- https://github.com/ricochet-im/ricochet.git\n\nRicochet usa a rede [Tor](https://www.torproject.org/) para alcançar seus contatos sem depender de servidores de mensagens. Ele cria um serviço oculto, que é usado para encontrar seus contatos sem revelar sua localização ou endereço IP.",
				"added": 1599957761
			},
			{
				"comment_id": 4,
				"body": "#Redes Anônimas/Descentralizadas: Freenet\n- https://siasky.net/AACVJAQQCuTTLDLmfmlBfq5UlZUl4p1bg7jChXZAhZlLcQ\n\n- Download do Tutorial: https://ipfs.infura.io/ipfs/QmTChUPDXpAHS4w2rxtGsbEmpg5YUDstBBQwPZKZtpaNcL\n- Download da Freenet (Site Oficial): https://freenetproject.org/\n- Source code: https://github.com/freenet/fred.git\n\nFreenet é um software gratuito que permite compartilhar arquivos anonimamente, navegar e publicar \"freesites\" (sites acessíveis apenas através da Freenet) e conversar em fóruns, sem medo de censura. O Freenet é descentralizado para torná-lo menos vulnerável a ataques e, se usado no modo \"darknet\", onde os usuários se conectam apenas aos amigos, é muito difícil de detectar.\n\nAs comunicações por nós da Freenet são criptografadas e roteadas por meio de outros nós para tornar extremamente difícil determinar quem está solicitando as informações e qual é o seu conteúdo.\n\nOs usuários contribuem com a rede fornecendo largura de banda e uma parte de seu disco rígido (chamado de \"armazenamento de dados\") para armazenar arquivos. Os arquivos são mantidos ou excluídos automaticamente, dependendo de quão populares são, com os menos populares sendo descartados para dar lugar a um conteúdo mais recente ou mais popular. Os arquivos são criptografados, então geralmente o usuário não consegue descobrir facilmente o que está em seu armazenamento de dados e, felizmente, não pode ser responsabilizado por isso. Fóruns de bate-papo, sites e funcionalidade de pesquisa são todos construídos sobre esse armazenamento de dados distribuído.",
				"added": 1599958604
			},
			{
				"comment_id": 5,
				"body": "> [mensoneo](#comment_2_18kFbZ6n1ttt8eChaTj7x2JgfVaQsYfWTT): Cjdns implementa uma rede IPv6 criptografada usando criptografia de chave pública para alocação de endereços e uma tabela de hash distribuída para roteamento. Isso fornece configuração de rede quase zero e evita muitos dos problemas de segurança e escalabilidade que afetam as redes existentes.\n> \n> GitHub: https://github.com/cjdelisle/cjdns.git\n\n#Instalador para cjdns no Windows: https://github.com/interfect/cjdns-installer.git",
				"added": 1599959372
			},
			{
				"comment_id": 6,
				"body": "#Redes Anônimas/Descentralizadas: Galet\n- https://siasky.net/AADOFjAfBthybWEQ-INvkEyP5XJxD63g5d7GmUIuLDaVAg\n- Download do Tutorial: https://ipfs.infura.io/ipfs/QmR4GkPyjA85KVXxaBsYYekKKA5eSCM6ZPQFV2YacHEwCR\n- Download do Galet (Site Oficial): http://galet.sourceforge.net/#home\n- Source code: https://siasky.net/PAN4OsCQn5JG8so-Vs82FfmaSNEpp9U2_XklwilW546pwA | SHA-256: b8e43457d8db142db0e0098917a143a24b3c4d7a4a892dcd408e7670af72b587\n \nGalet é um aplicativo ponto a ponto, cujo objetivo principal é fornecer canais de comunicação seguros e fáceis de configurar entre os computadores de pessoas que se conhecem e confiam umas nas outras. Seu objetivo secundário é criar uma rede pública baseada nesses canais. Nenhuma conexão direta ocorre entre dois nós que não tenha sido explicitamente aceita pelos usuários desses nós. Isso torna a rede muito difícil de censurar, pois o acesso direto de um invasor à rede é limitado.\n\nComo Galet possui tunelamento, ele também pode ser usado como uma VPN muito fácil de configurar.",
				"added": 1599960120
			},
			{
				"comment_id": 7,
				"body": "GitTorrent é uma rede ponto a ponto de repositórios Git compartilhados pelo BitTorrent. Você pode ler mais sobre o projeto nesta [postagem do blog](https://web.archive.org/web/20200823235747/http://blog.printf.net/articles/2015/05/29/announcing-gittorrent-a-decentralized-github/).\n- https://github.com/cjb/GitTorrent.git",
				"added": 1599961537
			},
			{
				"comment_id": 8,
				"body": "#Radicle - Colaboração de código ponto a ponto segura sem intermediários\n- https://radicle.xyz/\n- https://github.com/radicle-dev/radicle-link.git\n\nO Radicle está sendo construído para fornecer um fluxo de trabalho de colaboração conveniente sem intermediários ou servidores centrais. Problemas, patches e itens de revisão de código podem ser compartilhados perfeitamente entre pares e interagir com a máquina do usuário, assim como alguém interage com um repositório git.\n\nProjetado em torno da rede ponto a ponto, ele oferece um novo espaço de design para o desenvolvimento no [estilo bazar](https://web.archive.org/web/20200820183453/http://www.catb.org/~esr/writings/cathedral-bazaar/cathedral-bazaar/). Os sistemas de login são substituídos por criptografia de chave pública, rastreadores de problemas hospedados são substituídos por replicação de pares locais e a ideia de um único upstream canônico é substituída por um modelo ponto a ponto familiar aos hackers de código aberto dos anos 90 e início dos anos 2000— atualizado com um novo protocolo para colaboração entre pares aberta e confiável.",
				"added": 1599962290
			},
			{
				"comment_id": 10,
				"body": "#Fuxico - Rede livre feminista\n- http://redeautonomafeminista.org/fuxico/index.html\n- https://web.archive.org/web/20200913032945/http://redeautonomafeminista.org/fuxico/index.html\n\nÉ um dispositivo móvel autônomo de troca e colaboração, feita para conectar pessoas presentes em um mesmo espaço físico. A Fuxico cria uma rede sem fio fora da internet para troca de conteúdos digitais como imagens, vídeos, áudios,documentos, sala de bate-papo e Rodas de conversa. Totalmente anônima!\n\nSeu sistema operacional é um 'Remix' da Piratebox (caixa-pirata), um famoso projeto de Software Livre criado em 2011 por David Darts e Matthias Strubel http://piratebox.cc. Esse nome foi inspirado nas 'rádios piratas' e nos movimentos de cultura livre ao redor do mundo.",
				"added": 1599973172
			},
			{
				"comment_id": 11,
				"body": "#Deep Web - Como Acessar a I2P\n- https://siasky.net/AABePGGKPw6bKrn98KNBkcqYDA8K6qvfaw_GVvhD7D5dLg\n- Download do Tutorial: https://ipfs.infura.io/ipfs/QmTkidApAAU5UhtZmRcHT2QowWhb3NvfC4hf7B96VDFZNJ\n- Download da I2P (Site Oficial): https://geti2p.net/pt-br/download\n- Código-fonte da I2P exportado para o GitHub: https://github.com/i2p/i2p.i2p.git\n\nA I2P é uma rede anônima, que disponibiliza uma camada simples sobre a qual se faz possível a comunicação entre aplicações, por meio de troca de mensagens, de maneira anônima e segura. A rede é por si só estritamente baseada em mensagens (a la IP), mas há disponível uma biblioteca que permite uma confiável comunicação por streaming uma camada acima (a la TCP). Toda a comunicação é criptografada de ponta-a-ponta (há, no total, quatro camadas de criptografia usadas ao se enviar uma mensagem), e mesmo os extremos (\"destinos\") são identificadores criptográficos (essencialmente um par de chaves públicas).",
				"added": 1599973446
			},
			{
				"comment_id": 12,
				"body": "Tox é um mensageiro instantâneo [ponto a ponto](https://en.wikipedia.org/wiki/Peer-to-peer) (sem servidor) que visa tornar a segurança e a privacidade fáceis de obter para usuários regulares. Ele usa [NaCl](https://nacl.cr.yp.to/) para sua criptografia e autenticação.\n- https://tox.chat/index.html\n- https://github.com/TokTok/c-toxcore.git",
				"added": 1599974155
			}
		],
		"1_13rDPgWD9NkUQGuquV3j8kTqcLkrXMaoCV": [
			{
				"comment_id": 9,
				"body": "#Fuxico - Rede livre feminista\n- http://redeautonomafeminista.org/fuxico/index.html\n- https://web.archive.org/web/20200913032945/http://redeautonomafeminista.org/fuxico/index.html\n\nÉ um dispositivo móvel autônomo de troca e colaboração, feita para conectar pessoas presentes em um mesmo espaço físico. A Fuxico cria uma rede sem fio fora da internet para troca de conteúdos digitais como imagens, vídeos, áudios,documentos, sala de bate-papo e Rodas de conversa. Totalmente anônima!\n\nSeu sistema operacional é um 'Remix' da Piratebox (caixa-pirata), um famoso projeto de Software Livre criado em 2011 por David Darts e Matthias Strubel http://piratebox.cc. Esse nome foi inspirado nas 'rádios piratas' e nos movimentos de cultura livre ao redor do mundo.",
				"added": 1599967999
			}
		]
	},
	"comment_vote": {}
}