{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1636134204,
			"title": "I need help with proof of vaccination",
			"body": "Hi ZeroNet\n\nI'm living in Australia and our government has recently mandated vaccinations.\n\nI'm not here to harp on about discrimination or to spread anti-vaccination views. I have my own reasons for my hesitance and I hope that will be enough.\n\nMy partner and I have been forced, for the last two years, to maintain an online relationship which has been hell for us. With the new mandates, it looks like the light at the end of the tunnel is getting even farther away.\n\nThe plan was for her to fly out from her home country to come here. We plan to get married, and I would return with her. Her home country is accepting unvaccinated individuals.\n\nThe problem is that the Australian government is not going to allow me to leave. I have thought about getting on a mental health care plan to see various psychologists with the hopes that one of them will advocate for me to be granted an exemption, and this is the next thing on my list to try.\n\nIf all else fails, and the choice is between the vaccine and my future with the woman I love, I may have to fold to the demands being asked of me.\n\nWith some digging I have found my way here and I am writing in hopes that there is someone with the knowledge and tools to be able to assist me in navigating this situation. I would be willing to travel interstate to see a doctor who can \"administer\" the vaccine to me (twice) so it is on record. We would also be willing to pay such an individual who is willing to assist in this way.\n\nI don't expect that any medical professionals will respond to me here, as they would be risking their license to even entertain what I am asking of them. Instead, look at this as a cry for help to anyone who has been in my position and knows of any back doors or ways in which I can appear as vaccinated when leaving my country (permanently) to be with my soon-to-be wife.\n\nIf you can help, or have any information at all to offer me... Even just what they ask for at the airport, anything would be useful... \n\nPlease e-mail me at help-with-vax@protonmail.com.\n\nSeriously, thank you to anyone who takes the time out to help us with this.",
			"added": 1636134203
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}