{"title_info": {
"17948": {"summary": "Rookie lawyer Ryuuichi Naruhodou faces his first murder case; the accused defendant is his grade school classmate Masashi Yahari. With limited evidence, logic has become the only weapon Naruhodou has in order to turn the case around when all the odds are stacked against him. (From ANN)"},
"11571": {"summary": ""},
"12375": {"summary": ""},
"15334": {"summary": ""},
"8550": {"summary": ""},
"12435": {"summary": ""},
"73": {"summary": ""},
"17743": {"summary": ""},
"14960": {"summary": ""},
"18799": {"summary": ""},
"18671": {"summary": ""},
"17756": {"summary": ""},
"659": {"summary": ""},
"4778": {"summary": ""},
"4240": {"summary": ""},
"16917": {"summary": ""},
"12436": {"summary": ""},
"16098": {"summary": ""},
"1361": {"summary": ""},
"915": {"summary": ""},
"10050": {"summary": ""},
"11858": {"summary": ""},
"16338": {"summary": ""},
"6843": {"summary": ""},
"13262": {"summary": ""},
"12306": {"summary": ""},
"10942": {"summary": ""},
"15799": {"summary": ""},
"17480": {"summary": ""},
"15337": {"summary": ""},
"16826": {"summary": ""},
"14418": {"summary": "Ryota Sakamoto is an unemployed 22-year-old who lives with his mother and spends his days doing nothing but playing video games. In the real world there may be nothing special about him, but online he's one of the world's top players of the combat game called Btooom. One day he awakens on what appears to be a tropical island, though he has no memory of how he got there or why. While exploring the island Ryota runs into a stranger who attacks him by throwing a strange looking bomb at him. Ryota then realizes that his life is in danger, and that he has somehow become trapped in a real-life version of his favorite game. Ryota and the other \"players\" must now survive through the nightmare to figure out the reason why they ended up in the game in the first place. (From ANN)"},
"15205": {"summary": ""},
"18812": {"summary": ""},
"19019": {"summary": ""},
"13890": {"summary": ""},
"15683": {"summary": ""},
"16660": {"summary": ""},
"13858": {"summary": ""},
"15804": {"summary": ""},
"15245": {"summary": ""},
"15630": {"summary": ""},
"16275": {"summary": ""},
"12376": {"summary": ""},
"15843": {"summary": ""},
"11763": {"summary": ""},
"14090": {"summary": ""},
"14949": {"summary": ""},
"15808": {"summary": ""},
"16314": {"summary": ""},
"17031": {"summary": ""},
"12828": {"summary": ""},
"14317": {"summary": ""},
"15814": {"summary": ""},
"17689": {"summary": ""},
"18691": {"summary": ""},
"16344": {"summary": ""},
"16845": {"summary": ""},
"16783": {"summary": ""},
"16733": {"summary": ""},
"16816": {"summary": ""},
"16649": {"summary": ""},
"16514": {"summary": ""},
"15714": {"summary": ""},
"16309": {"summary": ""},
"15280": {"summary": ""},
"16697": {"summary": ""},
"17055": {"summary": ""},
"16790": {"summary": ""},
"16679": {"summary": ""},
"16857": {"summary": ""},
"16812": {"summary": ""},
"16729": {"summary": "In the year 2138, virtual reality gaming is booming. Yggdrasil, a popular online game is quietly shut down one day. However, one player named Momonga decides to not log out. Momonga is then transformed into the image of a skeleton as \"the most powerful wizard\". The world continues to change, with non-player characters (NPCs) beginning to feel emotion. Having no parents, friends, or place in society, this ordinary young man Momonga then strives to take over the new world the game has become. (From ANN)"},
"10547": {"summary": ""},
"14016": {"summary": ""},
"16592": {"summary": ""},
"16900": {"summary": ""},
"16731": {"summary": ""},
"16838": {"summary": ""},
"17084": {"summary": ""},
"16792": {"summary": ""},
"16718": {"summary": ""},
"15511": {"summary": ""},
"16677": {"summary": ""},
"13659": {"summary": ""},
"15228": {"summary": ""},
"16312": {"summary": ""},
"16515": {"summary": ""},
"15149": {"summary": ""},
"16655": {"summary": ""},
"16870": {"summary": ""},
"16554": {"summary": ""},
"16623": {"summary": ""},
"16889": {"summary": ""},
"16603": {"summary": ""},
"16856": {"summary": ""},
"14062": {"summary": ""},
"15812": {"summary": ""},
"15556": {"summary": ""},
"16894": {"summary": ""},
"16313": {"summary": ""},
"16593": {"summary": ""},
"16546": {"summary": ""},
"16340": {"summary": ""},
"16687": {"summary": ""},
"16636": {"summary": ""},
"16723": {"summary": ""},
"14730": {"summary": ""},
"15750": {"summary": ""},
"16680": {"summary": ""},
"11017": {"summary": ""},
"12841": {"summary": ""},
"16648": {"summary": ""},
"16868": {"summary": ""},
"16242": {"summary": ""},
"13616": {"summary": ""},
"15002": {"summary": ""},
"16343": {"summary": ""},
"15291": {"summary": ""},
"14841": {"summary": ""},
"15017": {"summary": ""},
"15751": {"summary": ""},
"18906": {"summary": ""},
"14395": {"summary": ""},
"15543": {"summary": ""},
"16032": {"summary": ""},
"14858": {"summary": ""},
"12089": {"summary": ""},
"10947": {"summary": ""},
"18894": {"summary": ""},
"19014": {"summary": ""},
"18985": {"summary": "Humans have been driven to extinction by \"Beasts\". The duty of fighting the Beasts fall to \"Fairies\", who are destined to use their powers to wield \"Holy Swords\" called \"Kariyon\" and eventually meet their destiny of death. A sole human being named Willem wakes up after several hundred years, and continues his fight against the Beasts. (From ANN)"},
"18142": {"summary": ""},
"15004": {"summary": ""},
"16120": {"summary": ""},
"14041": {"summary": ""},
"12991": {"summary": ""},
"14781": {"summary": ""},
"14950": {"summary": ""},
"14196": {"summary": ""},
"15919": {"summary": ""},
"16087": {"summary": ""},
"16318": {"summary": ""},
"16028": {"summary": ""},
"15336": {"summary": ""},
"886": {"summary": ""},
"885": {"summary": ""},
"887": {"summary": ""},
"16142": {"summary": ""},
"16843": {"summary": ""},
"17599": {"summary": ""},
"15718": {"summary": ""},
"16737": {"summary": ""},
"16594": {"summary": ""},
"16840": {"summary": ""},
"16919": {"summary": ""},
"17386": {"summary": ""},
"15585": {"summary": ""},
"16906": {"summary": ""},
"17645": {"summary": ""},
"17034": {"summary": ""},
"16726": {"summary": ""},
"16754": {"summary": ""},
"16357": {"summary": ""},
"17482": {"summary": ""},
"16973": {"summary": ""},
"16892": {"summary": ""},
"17083": {"summary": ""},
"16252": {"summary": ""},
"16888": {"summary": ""},
"16781": {"summary": ""},
"16827": {"summary": ""},
"17157": {"summary": ""},
"16893": {"summary": ""},
"17057": {"summary": ""},
"15114": {"summary": ""},
"17646": {"summary": ""},
"17485": {"summary": ""},
"17628": {"summary": ""},
"17255": {"summary": ""},
"15150": {"summary": ""},
"16782": {"summary": ""},
"17629": {"summary": ""},
"17449": {"summary": ""},
"18795": {"summary": ""},
"17911": {"summary": ""},
"17691": {"summary": ""},
"17752": {"summary": ""},
"15051": {"summary": ""},
"11451": {"summary": ""},
"16692": {"summary": ""},
"16647": {"summary": ""},
"17241": {"summary": ""},
"16895": {"summary": ""},
"14732": {"summary": ""},
"16771": {"summary": ""},
"17062": {"summary": ""},
"17260": {"summary": ""},
"17285": {"summary": ""},
"17685": {"summary": ""},
"17723": {"summary": ""},
"16125": {"summary": ""},
"17897": {"summary": ""},
"17185": {"summary": ""},
"17751": {"summary": ""},
"17732": {"summary": ""},
"18486": {"summary": ""},
"17552": {"summary": ""},
"17064": {"summary": ""},
"17647": {"summary": ""},
"16322": {"summary": ""},
"17526": {"summary": ""},
"17831": {"summary": ""},
"17731": {"summary": ""},
"16183": {"summary": ""},
"17123": {"summary": ""},
"17217": {"summary": ""},
"17043": {"summary": ""},
"17788": {"summary": ""},
"17323": {"summary": ""},
"17670": {"summary": ""},
"16614": {"summary": ""},
"17703": {"summary": ""},
"17794": {"summary": ""},
"17795": {"summary": ""},
"17513": {"summary": ""},
"6236": {"summary": ""},
"16370": {"summary": ""},
"18734": {"summary": ""},
"17329": {"summary": ""},
"17778": {"summary": ""},
"17186": {"summary": ""},
"17833": {"summary": ""},
"17644": {"summary": ""},
"17643": {"summary": ""},
"16555": {"summary": ""},
"17980": {"summary": ""},
"17796": {"summary": ""},
"16347": {"summary": ""},
"17910": {"summary": ""},
"15632": {"summary": ""},
"17830": {"summary": ""},
"16137": {"summary": ""},
"17530": {"summary": ""},
"17790": {"summary": ""},
"15493": {"summary": ""},
"16597": {"summary": ""},
"16141": {"summary": ""},
"17122": {"summary": ""},
"17514": {"summary": ""},
"17991": {"summary": ""},
"17360": {"summary": ""},
"17686": {"summary": ""},
"18003": {"summary": "An art club in a certain middle school has the following members: Subaru Uchimaki, who is a genius at drawing faces, but only wants to draw the perfect 2D wife; Colette, a rich troublemaker who never stops making mischief; and the club president, who sleeps through sessions and collects sleeping aids. Mizuki Usami is the only person in the club who wants to do art club-like activities, and constantly struggles to do so. (From ANN)"},
"18075": {"summary": ""},
"15759": {"summary": ""},
"17328": {"summary": ""},
"17706": {"summary": ""},
"11752": {"summary": ""},
"16693": {"summary": ""},
"18139": {"summary": ""},
"18169": {"summary": ""},
"15721": {"summary": ""},
"17755": {"summary": ""},
"18072": {"summary": ""},
"15770": {"summary": "Three freshman girls: Tsugumi Harudori, a \"normal girl\" in every way; Meme Tatane, an airheaded girl; and Anya Hepburn, a tsundere princess, encounter and start their new lives at Death Weapon & Meister Academy (DWMA). (From ANN)"},
"18272": {"summary": "Hope's Peak High School is a special school that nurtures those with exceptional talents and abilities. While only top students are a part of the main course, anyone can join the preparatory course, like Hajime Hinata has. Hinata wants nothing more than to be part of the talented elite, but his desires lead him to a fateful encounter that drives the future of the school into despair. (From ANN)"},
"15712": {"summary": "The planets of the East and the West were once connected by the Ama-no-Hashidate. The culture that built it was destroyed countless years ago, and the two planets have had separate histories ever since. On the Western planet, ancient culture is experiencing a renaissance after a long period of war. Jeanne Kaguya D'Arc, a girl from the Western Planet, was prophesied to be the Savior of the World at her birth. With Leonard Da Vinci, she lands on the Eastern Planet, where Nobunaga \"the Fool\" longs for the power to change the world, as his planet is still locked in a war where many heroes vie for supremacy. When these two people meet, the culture of both worlds will be transformed. (From ANN)"},
"16081": {"summary": "Saburou is a high school boy who time-travels to Japan's Sengoku Era. He must become Oda Nobunaga, the famed warlord who helps unite Japan. (From ANN)"},
"18112": {"summary": "After the qualifying test with curry dishes, eight contestants have entered the quarterfinal of Autumn Elections: Souma, Megumi, Takumi, Hisako, Alice, Kurokiba, Hayama, and Mimasaka. Their next challenge: bento. (From ANN)"},
"15692": {"summary": "The year is 1987 and 17-year-old Jotaro Kujo finds himself suddenly plagued by a ghost-like entity. Jotaro's grandfather Joseph Joestar, a veteran of a fight to save humanity fifty years prior, arrives with his own supernatural aura and explains that this power, known as a \"Stand\", physically manifests its user's spirit and can be controlled by its user at will. The sudden emergence of these Stands is revealed to be caused by the revival of the megalomaniacal vampire DIO (the Joestar's longtime enemy) whose awakening from his century-long slumber has triggered Stands to awaken down the Joestar family line, including in Jotaro's mother whose uncontrollable Stand will ultimately kill her in a few weeks' time. Jotaro, Joseph, and their allies have fifty days to locate DIO (using their Stands to thwart DIO's network of devoted Stand-user minions along the way) and eliminate DIO himself in order to save Jotaro's mother and prevent DIO's ambitions of world domination. (From ANN)"},
"16303": {"summary": "After 30 grueling days of fighting off wave after wave of assassins sent by the megalomaniacal vampire DIO (all the while traveling by plane, train, and automobile from Japan, through Southeast Asia, and across the Middle East), Jotaro and his allies have made it at last to Egypt where DIO lies in wait. DIO, striving to end the Joestar line that has stood in his way for 100 years, sends his final and most fervent team of Stand-user followers, the 9 Egyptian Gods, to eliminate Jotaro and his allies. Jotaro and his party now have only two weeks to make their way to DIO's hideout in Cairo and eliminate him before Jotaro's mother succumbs to DIO's curse. (From ANN)"},
"17832": {"summary": "It's the year 1999, 11 years after Jotaro Kujo's desperate fight against Dio in Egypt. Jotaro meets with Josuke Higashikata, the illegitimate son of his grandfather Joseph Joestar. He discovers that Josuke also has the same \"Stand\" power and that a new threat is surfacing in Morioh City. (From ANN)"},
"18064": {"summary": "\"Mob\" is a boy who will explode if his emotional capacity reaches 100%. This boy with psychic powers earned his nickname \"Mob\" because he does not stand out among other people. He keeps his psychic powers bottled up so he can live normally, but if his emotional level reaches 100, something will overwhelm his entire body. (From ANN)"},
"17786": {"summary": "Mankind has developed superpowers known as \"Quirks\" with 80% of the population having some kind of superpower. These new abilities see the rise of both superheroes and villains. A prestigious school known as the The Hero Academy trains superpowered hopefuls into the heroes the world needs. Middle school student Izuku Midoriya wants to be a hero more than anything, but he's part the 20% without a Quirk. Unwilling to give up his dream, he plans to take the exam and be accepted into a high school for budding heroes. Through a series of serendipitous events, he catches the eye of the greatest hero, All Might, who agrees to train him. (From ANN)"},
"18136": {"summary": "Chise Hatori, 15 years old. Lost, without hope, and without family, she is bought for money - not by another person, but by a non-human sorcerer named Elias. Though she hesitates, she begins life anew as his apprentice and future wife. She moves on with her new and peaceful life, slowly but surely, until one day, when she finds a Japanese picture book among the many sent to her from London by Angelica. It is a fateful book that discovered her in her younger years, when she was still troubled and lonely. This piece is a prequel to Chise's encounter with the Thorn Sorcere. (From ANN)"},
"18401": {"summary": "Saiki Kusuo, an otherwise normal teenager, has various super-powers, telepathy and telekinesis included. This should have been cool, but through experience, Saiki comes to realize that having powers while trying to lead an ordinary life is a bad mix. (From ANN)"},
"18167": {"summary": "A social game called The Magical Girl Raising Project allows one in tens of thousands of people to be a \"magical girl\" - possessing extraordinary physical capabilities and looks, as well as special magical powers that set them apart from the rest of the human race. But one day, in a district containing 16 magical girls, the administration announces that it must halve the number of magical girls to solve the problem of magical energy. At first, the 16 magical girls race to collect more \"magical candy\" than their competitors, but the rules quickly become twisted, and it quickly becomes a murderous battle for survival among them. (From ANN)"},
"16083": {"summary": "After punching a famous curator in the face for criticizing his work as \"textbook and lifeless\", Handa Seishuu is sent to Gotou Island to calm his nerves and find new inspiration for his calligraphy. Growing up in the city all his life, though, Handa must adapt to country life while meeting an assortment of quirky people during his tenure. (From ANN)"},
"17937": {"summary": "This is a world where humanity is always at war with the Unknown. The kids who were evacuated to a cold sleep facility during the initial invasion decades ago wake up from their slumber to find that they'd manifested superpowers called the \"World\". To protect Japan from the Unknowns appearing from the Tokyo Bay, these kids would start their own battles at the defensive strongholds of Tokyo, Kanagawa, and Chiba. (From ANN)"},
"18506": {"summary": "In 1939, the imperialist nation of Germania launched a sudden invasion of its neighboring countries. This conflagration engulfed all of Europe in one fell swoop, and the era was dragged into the maelstrom of war. Then in 1940, Germania set its sights on Elystadt, a tiny principality blessed with breathtaking greenery and water in the Alps. Izetta is a descendant of a clan of witches who had passed down mysterious powers for generations. Since she was little, she and her grandmother lived their lives on the road, traveling between European countries in order to hide these powers. Fiine is the sole daughter in line to succeed Rudolph III, the ruler of the Principality of Elystadt. Since her father has been stricken by illness, she has been busy preparing for Germania's invasion in his stead. (From ANN)"},
"18682": {"summary": "In the world of BBK/BRNK, it's been ten years since Azuma Kazuki has been in Japan, and upon his arrival he is taken prisoner by a group of armed men. Azuma is saved by his childhood friend, Kogane Asabuki, thanks to a living weapon she wields on her right hand, known as a Bubuki. Learning about these weapons, Azuma becomes a Bubuki wielder himself and sets out on a journey. (From ANN)"},
"18191": {"summary": "Yuuri Katsuki carried all of Japan's hopes on his shoulders to win at the Gran Prix Finale ice skating competition, but suffered a crushing defeat. He returns home to Kyushu and half feels like he wants to retire, and half feels like he wants to continue ice skating. Suddenly the five-time consecutive world championship ice skater Victor Nikiforov appears before him with Yuri Plisetsky, a young Russian figure skater who is already defeating his seniors. Victor and both Yuris take up the challenge on an unprecedented Gran Prix series. (From ANN)"},
"18193": {"summary": "Allen Walker is an exorcist working for the Black Order whose mission is to protect mankind from the evil Millennium Earl and his deadly Akuma. Allen and his comrades must recover lost Innocence while defending against the Earl's terrifying army. But if they fail, Innocence will be lost forever. (From ANN)"},
"18177": {"summary": "Papika and Cocona hold the keys to open the door. When the two girls meet, their adventures in a different time and different overlapping dimension called \"Pure Illusion\" begin. Many things in Pure Illusion will stand in the girls' way on their search for the mysterious crystal called the \"Shard of Mimi\", an item that is said to grant any wish. However, when the girls find themselves in danger, the Shard of Mimi shines, and they are able to transform. (From ANN)"},
"18719": {"summary": "60 years ago, a strange case of insomnia struck the population, forcing them to stay awake for more than a full week. The victims, completely sleep deprived, all went mad. To cure this illness, a new medicine was produced, but the side effects turned the patients into vampires. Humanity went to war against this new species and triumphed, but some of the vampires managed to survive. Born from a Human and a Vampire, Mi Liu is the ringleader of a bank robbery, arrested, and transferred to a special prison of the National Defense Agency that monitors Vampires. Trying to break free with Anji, Mi Liu is attacked by strange monsters and he finds out that the prison location corresponds to the birthplace of Vampires, the old capital \"Blue Town\". (From ANN)"},
"17584": {"summary": "Childhood friends Akeno Misaki and Moeka China want to become Blue Mermaids, a new female force established to protect the remaining coastal towns after many countries have sank into the sea. Together with others who shared their dream, they enrolled in Yokosuka's Marine High School. (From ANN)"},
"18777": {"summary": "A hikikomori neet is transported to a fantastical RPG-game-like world with the mission to defeat the Dark Lord. He completes quests along side his companions, a useless goddess, a M crusader, and a loli chuubyou mage. (From ANN)"},
"18166": {"summary": "The protagonist Rei is a 17-year old professional shougi player, who lives by himself, not having a real family, and has scarcely any friends. Among his acquaintances is a family, which consists of a young woman, Akari, and two young girls, Hinata and Momo, and who also keep a numerous number of cats. (From ANN)"},
"18749": {"summary": "Masamune Makabe was mercilessly teased for being overweight as child, especially by a girl named Aki Adagaki. Masamune decides to get his sweet revenge by transforming himself into an attractive, intelligent, and athletic young man. After many years honing his new persona, he transfers to Aki's school in hopes of finally getting his long-awaited vengeance. (From ANN)"},
"18558": {"summary": "Kumiko and her teammates have won the Kyoto regional tournament. From now on, life will be getting a lot more hectic. With the national tournament fast approaching, Kumiko's band is doubling down on practice and discipline, leaving little time for sleep or other recreational activities. The redoubled practice schedule brings Kumiko and Reina closer together, but elsewhere in the band, it seems like drama threatens to tear the group's unity apart. The ghost of the prior year's mass band exodus still haunts many of Kumiko's classmates, and with former band member Nozomi Masumi now asking to return, it seems like the grudges of the past will soon be impossible to ignore. (From ANN)"},
"18478": {"summary": "Chou Soran leads a very common college student's life until he finds himself caught up in a terrible incident that happened in a small village. As he was walking through a graveyard, he is assaulted by zombies. Thinking that it was over for him, a mysterious girl carrying a sword suddenly saves him and disappears. (From ANN)"},
"18189": {"summary": "Tsubasa is a new hire in the A&R department of the major recording company Gandala Music. Tsubasa is immediately assigned to oversee the idol unit \"B-PROJECT\", which is made up of three idol groups: Kitakore, Thrive, and MooNs. This is Tsubasa's first job, and she gets involved in various incidents and accidents as she deals with this group of young men who each have their own differing personalities. (From ANN)"},
"18692": {"summary": "Tanya Degurechov used to be one of Japan's elite office workers, but because of a wrathful god, was reborn as a little girl. She has blonde hair, blue eyes, and nearly transparent white skin, and she flies through the air and mercilessly strikes down her opponents. She speaks with a young girl's lisp and commands the army. Tanya prioritizes optimization and career advancement above all, and she will become the most dangerous entity among the Imperial Army's sorcerers. (From ANN)"},
"18156": {"summary": "Nine idiosyncratic individuals are linked by the \"Choujou Kagaku Kirikiri Basara\" occult summary blog run by 17-year-old second-year high school student Yuuta Gamon. Little incongruities that occur around these nine eventually lead to a larger, unimaginable event that may alter what is considered common sense in this world. (From ANN)"},
"18807": {"summary": "Miss Kobayashi is your average office worker who lives a boring life, alone in her small apartment - until she saves the life of a female dragon in distress. The dragon, named Tohru, has the ability to magically transform into an adorable human girl (albeit with horns and a long tail), who will do anything to pay off her debt of gratitude, whether Miss Kobayashi likes it or not. (From ANN)"},
"18806": {"summary": "Hanabi and Mugi are a super sweet, seemingly perfect couple. Their peers envy them and their impenetrable facade. What they don't know is that Hanabi and Mugi have a not-so-pure secret. (From ANN)"},
"18776": {"summary": "Hiromi Maiharu moved from Nagasaki to Kamakura. She begins her new life in Kamakura and her first day in high school by bicycling to her school, but she has not ridden a bicycle since she was young. On the way to the ceremony for the first day, she meets Tomoe Akitsuki, and Tomoe helps her train to be better at bicycling. (From ANN)"},
"18832": {"summary": "High school girl Tomoko Konagai is very shy and has few friends to talk with at school. She always thinks about her three cats: Ma the cheerful Munchkin, Ro the smart Russian Blue, and Shi the crybaby Singapura. Later, Tomoko befriends her classmate Azumi, another cat-loving girl who owns a Turkish Angora named Elza. (From ANN)"},
"18724": {"summary": "Tetsuo Takahashi is a teacher working at Shibasaki High School and specializing in the physiological studies of demi-humans. His students include Hikari Takanashi, a vampire and lover of tomato juice; Kyouko Machi, a dullahan; and Yuki Kusakabe, a yuki-onna. The school also employs math teacher Sakie Satou, a succubus. (From ANN)"},
"16375": {"summary": "After death, humans go to either the eternal void or are reincarnated. However, where there's doubt as to where to place some occasional souls, these instead arrive at bar Quindecim, with no memories of having died. Decim, the bartender, challenges them to the Death Game, wherein they wager their \"lives\" and reveal their true natures. Decim himself is actually an arbiter in charge of deciding the fate of those that arrive at Quindecim - by pulling the darkness from deepest within them, he judges their ultimate fate. (From ANN)"},
"18122": {"summary": "Math teacher Kouhei Inuzuka is a widower with a young daughter named Tsumugi. Inuzuka isn't adept in the kitchen but with the help of his student Kotori Iida and his daughter, he embarks on a culinary adventure. (From ANN)"},
"18280": {"summary": "For thirty years, companion robot Hoshino Yumemi has patiently waited to show someone the stars. Left in an abandoned planetarium, she sits hoping for customers that will never show. That is, until Kuzuya, a Junker - a plunderer of goods and artefacts from the ruins of civilization - stumbles upon the crumbling establishment. (From aniDB)"},
"17448": {"summary": "Aomori, Japan. In a land blessed by nature's bountiful beauty, bizarre things begin to take place. Makoto Kowata, 15 years old, is a professional witch. She left Yokohama with Chito, her black cat, to live in the house of her relatives in Aomori. This is where she begins to train as a witch. Even though Makoto's powers are still limited to just flying through the sky, she and her second cousins Kei and Chinatsu surely make the most out of each and every day. (From ANN)"},
"18457": {"summary": "\"Bananya\" are neither cats nor bananas, but cats hidden in bananas. They come out and play when people are not watching. (From ANN)"},
"15974": {"summary": "One summer day, a terrorist attack strikes Tokyo. The perpetrators are two boys who call themselves \"Sphinx\". The attack was just the beginning of the grandiose game they are playing that will envelop all of Japan. (From ANN)"},
"14338": {"summary": "The story centers around Akito Himenokouji, a boy who was separated from his twin sister Akiko, but they end up living under the same roof together during high school. (From ANN)"},
"12157": {"summary": "Yukitaka Tsutsui is a freshman who moved out of his parents' home to live on his own, hoping to pursue a baseball team position at the new high school he's attending. When he arrived at his new apartment however, he discovered that someone else was already inside - a young man who claims to be an alien and is suffering from amnesia. (From ANN)"},
"17798": {"summary": "Being the heir of a tonkatsu (breaded pork cutlet) restaurant running for three generations, young Agetarou Katsumata works at the family business daily under his father's supervision but with little motivation. One day he stumbled into a nightclub in the neighborhood and soon discovered the similarities of rhythmic moves between cooking tonkatsu and being a disc jockey. (From ANN)"},
"18588": {"summary": "Matoi Sumeragi, a second-year junior high school student, works part-time as a shrine maiden at Tenman Shrine in the city of Kamaya. Her close friend Yuma Kusanagi is part of the family of the shrine's chief priest, and is a candidate to be the successor shrine maiden. One day, Matoi and Yuma walk from the school to the shrine as usual, but when they arrive, they are greeted by the shrine's now damaged grounds, and Yuma's parents have both collapsed from their wounds. Matoi's father Shingo, a police detective, launches an investigation, and he comes upon a man who does not seem entirely sane, his only witness. When he holds down the man, Yuma begins the ritual of Divine Possession. Something strange then happens, not with Yuma, but with Matoi. Matoi Sumeragi, who had only wanted a normal, peaceful life, takes the role of a god, and gains the power to banish evil spirits. (From ANN)"},
"16681": {"summary": "Eren Jaeger swore to wipe out every last Titan, but in a battle for his life he wound up becoming the thing he hates most. With his new powers, he fights for humanity's freedom facing the monsters that threaten his home. After a bittersweet victory against the Female Titan, Eren finds no time to rest - a horde of Titans is approaching Wall Rose and the battle for humanity continues. (From ANN)"},
"18895": {"summary": "Kazuya Kagami's most treasured possession in the world is the obi left to him by his late mother. The scent of cherry-blossoms infused into it helps him through his day - but he never expected it to save his life, becoming a beautiful kimono-clad girl who calls herself an \"artifact spirit\". Her name is Kiriha, tsukumogami of the sash, who naturally moves in with him, as he is her \"owner\". Throw in Chisato, his bespectacled friend, an overprotective older sister who wants to take baths with him, a busty priestess, a seductive sorceress named Kokuyoura, and Kazuya's life has just gotten a lot more interesting. (From ANN)"},
"18181": {"summary": "Shimazu Toyohisa is the real-life samurai who fought in the pivotal Battle of Sekigahara. In his dying moments, Shimazu is transported to a world of magic with other famous warriors throughout history. These warriors are forced to fight each other in an endless battle. (From ANN)"},
"15350": {"summary": "In the aftermath of the loss of the Silver and Red Kings, Kuroh and Neko continues to look for Shiro, whom they believe is still alive. Meanwhile, HOMRA members have dispersed, leaving Yata and Rikio to take care of what's left along with Anna, whose powers became unstable. As the Green Clan makes their appearance and kidnaps Anna, the remaining members of Silver and Red Clans unite to save her and to hopefully discover the outcome of having lost their Missing Kings. (From ANN)"},
"15743": {"summary": "Kirito is called for an emergency counseling meeting at his new school while his sister has swimming lessons with their friends. There he meets an elite member of the Virtual Division of the Ministry of Internal Affairs. Kirito then tells him details about what really happened in Aincrad and in Alfheim. (From ANN)"},
"15855": {"summary": "Shinichi Izumi is a normal high school boy whose right hand has become infected with an alien parasite that names itself \"Migi\" (\"right\"). Migi is the first parasite to develop a symbiotic relationship with its host, as he and Shinichi slowly develop a grudging friendship. Migi isn't the only Parasite on earth, however, and as cases of Parasites killing humans begin to emerge, humans seek to kill off Parasites. Shinichi and Migi find themselves caught in between these two sides of the struggle over planet earth. (From ANN)"},
"5943": {"summary": "Sakai Yuuji, a high school student who expected his normal life to last forever, is dead. When he was on his way home he witnessed a shocking view as the world suddenly froze: people were engulfed by blue flames and a monster resembling a large doll swallowed them. Just as the monster prepared to consume Yuuji, a sword-wielding girl in black attire with flaming red eyes and hair that burns like embers saved him from the monster. The girl called herself a \"Flame Haze\" who hunts the \"Guze no Tomogara\", creatures from another world. As Yuuji noticed a blue flame in his chest, she called him a \"Torch\", a temporary replacement, saying that the \"real\" Yuuji's existence had already ended. Unfazed, Yuuji befriended the strange girl, named her \"Shana\", and joined her fight against Tomogara and other Flame Hazes. (From ANN)"},
"15622": {"summary": "The relationship between Yuuta and Rikka starts to develop slowly in their own unique way as they begin to live together with Kuzuha under one roof. However, \"chuunibyou\"-plagued Satone, Yuuta's old acquaintance, showed up in the most unexpected place and time; challenging their budding, yet fragile relationship. Meanwhile, the rest of the Oriental Magick Napping Society in Summer club members continue to expand their own unique selves and relationships with one another. (From ANN)"},
"6660": {"summary": "Meet Louise, a budding magician. The students at the Tristein Academy call her \"Zero Louise\", due to her current record of zero successes with magic. In fact, her magic tends to go spectacularly wrong. Now, as an important test of her aptitude for magic, she must summon a familiar to be her servant. At this critical moment, she summons up all her magic and wishes for a familiar that is \"devoted, beautiful and powerful\", and gets... Hiraga Saito, an ordinary Japanese boy. It's difficult to say who is more surprised and dismayed, but the rules don't allow for second attempts. Louise is stuck with her strange familiar, and he with her. (From ANN)"},
"13001": {"summary": "Shu's entire world was shattered after a meteorite crashed into Japan, unleashing the lethal Apocalypse Virus. The chaos and anarchy born of the outbreak cost Shu his family and reduced him to a timid, fearful shell of the boy he'd once been. His life took another unexpected turn after a chance encounter with the stunning pop star, Inori. This mysterious beauty introduced Shu to the King's Right Hand: a genetic mutation that allows him to reach into hearts of mortals and turn them into weapons. Shu finds himself caught in the crossfire between those who desperately seek his newfound strength. On one side lurks a clandestine government agency, and on the other, Inori and the spirited band of rebels known as Funeral Parlour. The choice is Shu's to make - and the world is his to change. (From ANN)"},
"14209": {"summary": "The Yuukis' residence is now full of people: in addition to Rito and Mikan Yuuki, Lala, her twin sisters Nana and Momo, and Golden Darkness. Momo, who also falls for Rito, actively tries to create a harem for him. Meanwhile, a mysterious red hair girl named Mea Kurosaki enters Sainan High School with a hidden agenda. (From ANN)"},
"16646": {"summary": "Yuki Rito, Mikan, Lala and the gang have been enjoying many great every day adventures but something is not quite right. Mea is adjusting to earth life but her sister Yami has a \"dark\" secret that may endanger the whole world. That and Rito has a lot of pervy accidents to practice in the meantime. (From ANN)"},
"16158": {"summary": "Erika talks to her friends about boyfriends and romance, but in all her sixteen years she's never actually dated anyone. She thought her lies had reached a limit until one day she takes a surreptitious video of a good looking guy she saw in town. She brags that he's her boyfriend, but it turns out that his name's Kyouya Sata and he's just transferred to her school. She tells him what's going on and offers to admit to her lie, but it turns out that under his sweet exterior, he's actually a malicious sadist. Seizing on Erika's weakness, he orders her to be his dog. (From ANN)"},
"19022": {"summary": "Yoshiko is a high school girl who is so ridiculously stupid everyday that even her childhood friend Takkun wants to give her a big punch. (From ANN)"},
"11962": {"summary": "Hayao Imagawa, a 30-year-old salaryman, is visited by Daigorou, a god sent from heaven to help him get rid of his virginity. (From ANN)"},
"11725": {"summary": "A year after Lala came to Earth the story from ToLoveRu continues. Lala is determined to make Rito fall for her, and she will put all her effort onto it, even knowing that Rito loves another girl. Rito will have a harder time since Lala's little twin sisters live in the same house, also Mikan, and Celine. They will have a lot of fun and trouble with their other friends from school and many others, with Lala's inventions, Yami's contract to kill Rito and many pending issues from season 1. (From ANN)"},
"2480": {"summary": "Yukito Kunisaki is on a journey, seeking a girl with wings who flies in the sky, as mentioned in a childhood tale. During this journey, he settles down in a small town, trying to make some money. There, he meets a strange girl named Misuzu. Misuzu quickly makes Yukito her friend and invites him to stay with her. Yukito decides to stay in the small town, and continue searching for the winged girl his mother had searched for in her life. (From ANN)"},
"9701": {"summary": "Life continues on for Tomoya. A few months have passed since he confessed his love to Nagisa. Now entering the second semester, he continues to meet a variety of different people, expanding his own world in the process. As well, Tomoya and Nagisa's relationship begins to enter a level of intimacy unlike before. Through his relationship with Nagisa, and his various encounters, Tomoya begins to understand the meaning and importance of family. Unfortunately, as Tomoya and Nagisa begin their own family together, they are faced with many hardships and challenges along the way. (From ANN)"},
"7809": {"summary": "Tomoya Okazaki is a third year high school student resentful of his life. His mother passed away from a car accident when he was younger, causing his father to resort to alcohol and gambling. This results in fights between the two until Tomoya's shoulder is injured in a fight. Since then, Tomoya has had distant relationships with his father, causing him to become a delinquent over time. While on a walk to school, he meets a strange girl named Nagisa Furukawa who is a year older, but is repeating due to illness. Due to this, she is often alone as most of her friends have moved on. The two begin hanging out and slowly, as time goes by, Tomoya finds his life shifting in a new direction. (From ANN)"},
"6431": {"summary": "Yuichi Aizawa returns to this city after seven years. In his childhood, he often visited it, but something happend in the past which caused him to block out his memories of the events of seven years ago. On the day after he gets settled in, he meets a girl carrying a backpack with wings on it. Her name is Tsukimiya Ayu and he begins to recall the memories he had lost. (From ANN)"},
"15401": {"summary": "Seven Masters with Seven Servants fight to the death in a battle to win the Holy Grail. This is a retelling of the original 24 episode anime, Fate Stay Night, in OVA form. (From ANN)"},
"5394": {"summary": "Shirou Emiya lost his parents in a fire when he was young and was later adopted by a sorceror by the name of Kiritsugu Emiya. Although he was full of admiration for his adopted father and yearns to become an ally of justice, Shirou has limited powers and was unable to become a strong sorceror like his father. That is until one fateful day, he was drawn into the Holy Grail War and had to summon a female \"Servant\" known as Saber in order to protect himself. It turns out that the Holy Grail War involves a series of battles among powerful sorcerors to fight for the possession of a relic that will grant one's wishes, the Holy Grail. There are altogether seven \"Masters\" who can summon their respective \"Servants\" from different classes known as Saber, Archer, Rider, Berserker, Lancer, Caster and Assassin. These \"Servants\" have to hide their names in order not to reveal their weaknesses to the enemies. The story revolves around Shirou and his entanglement in the Holy Grail War. (From ANN)"},
"12112": {"summary": "Tooru takes a test so she can enter the same high school as Run, her childhood friend and the girl she likes. She passes the exam and cannot wait to break the good news to Run. However, when Tooru arrives at Run's house, she finds Run hugging a girl she's never seen before. Tooru is introduced to Run's high school friends, Yuuko and Nagi. As Run, Nagi and Yuuko begin their second year while Tooru begins her first year, their exciting high school life filled with drama and adventure begins for the four friends. (From ANN)"},
"12156": {"summary": "During the Gallian war with the Empire, the nameless is a renegade squadron in Gallia. Although being labeled as enemies by both the Gallian and Imperial army, the nameless struggle to protect the civilians following their motto: \"where the regular army can't, the nameless can\". (From ANN)"},
"11788": {"summary": "The project is a spinoff from Circus's D.C. Da Capo franchise and features the Yoshino Sakura character as a seemingly ordinary third grader with secret special powers. (From ANN)"},
"13736": {"summary": "There are two forces in the world: the Zet, who are entrusted with the survival of humanity; and the Alphas, who have chosen an extreme form of justice. In a certain city, Jin lives under a bridge with an old man, struggling to pay off debts. He carries the destiny of humanity's survival. Kouga lives on a hill and stands to inherit vast wealth. In his admiration for heroes, he seeks out the meaning of justice. They don't know it now, but they are destined to one day meet. (From ANN)"},
"10873": {"summary": "In St. Mikhailov Academy, Oribe Mafuyu meets a silver-haired boy called Alexander. He is a Qwaser, a being who can manipulate iron and draws his power from breast milk. A mystery surrounding an Icon transforms the academy into the setting for conflict between the various different Qwaser. (From ANN)"},
"13756": {"summary": "College student Yuuta Segawa is suddenly given custody of his older sister's three daughters, aged 14, 10, and 3. They're now stuck living together in a 10 square meter apartment. Meanwhile Raika, the object of his affection, has a fondness of cuteness, and his unexpected arrivals may finally offer an opportunity for them to get together. (From ANN)"},
"4148": {"summary": "The Diclonius, a mutated homo sapien that is said to be selected by God and will eventually become the destruction of mankind, possesses two horns in their heads, and has a \"sixth sense\" which gives it telekinetic abilities. Due to this dangerous power, they have been captured and isolated in laboratories by the government. Lucy, a young and psychotic Diclonius, manages to break free of her confines and brutally murder most of the guards in the laboratory, only to get shot in the head as she makes her escape. She survives and manages to drift along to a beach, where two teenagers named Kouta and Yuka discover her. Having lost her memories, she was named after the only thing that she can now say, \"Nyuu\", and the two allow her to stay at Kouta's home. However, it appears that the evil \"Lucy\" is not dead just yet... (From ANN)"},
"12400": {"summary": "The Japanese government was rescued from the brink of financial collapse by the Sovereign Wealth Fund. For its citizens, however, life has not improved, and unemployment, crime, suicide, and despair are rampant. Kimimaro is a scholarship student whose only dream is to avoid all this and live a stable life as a civil servant. One day, however, he meets a man who offers him the chance to make money fast. From then on Kimimaro is drawn into a mysterious realm known as \"The Financial District\", where people engage in supernatural battles for the possibility of money. (From ANN)"},
"18557": {"summary": "Ever since their champion was defeated, the world of girls' junior high ping pong has been in turmoil. Koyori is the new smirking transfer student at her junior high and she's ready to shake up girls' ping pong. (From ANN)"},
"19145": {"summary": "Lies are forbidden. Love is even more forbidden. The time is in the not-so-distant future. In Japan, your marriage partner is selected by the government when you turn 16. Yukari Nejima is a 15-year-old boy who lives in a corner of Japan and has never made much of himself. In grades as well as sports, he ranks below the middle of the pack. However, he conceals a passionate love in his heart. (From ANN)"},
"11603": {"summary": "Haruka Kasugano and his twin sister Sora have lost both their parents in an accident, and with them all their support. They decide to move out of the city to the rural town where they once spent summers with their late grandfather. At first everything seems familiar and peaceful, but changes come as Haruka starts to remember things from his youth. (From ANN)"},
"14777": {"summary": "Hinata and Aoi made a promise to each other when they were very young to climb a mountain. Years later they get in contact again and start acting on that promise. However Aoi has developed a fear of heights, and Hinata has little patience for planning and even less caution. (From ANN)"},
"14888": {"summary": "Hachiman Hikigaya is an antisocial high school student with no friends or girlfriend and as a result has a distorted view on life. When he sees his classmates talking excitedly about their adolescent lives, he mutters, \"They're a bunch of liars\". When he is asked about his future dreams, he responds: \"Not working\". A teacher gets Hachiman to join the volunteer \"service club\", which happens to have the school's prettiest girl: Yukino Yukinoshita. (From ANN)"},
"15553": {"summary": "In 2018, humans and wizards live together in Tokyo. Police continue to protect order in society, but wizards are tried according to magical law, in special courts defended by wizard barristers. At age seventeen, Cecile has just become the youngest wizard barrister, and begins work at the Butterfly Law Offices. While she hasn't realized it yet, she has tremendous magical potential. (From ANN)"},
"12398": {"summary": "Going home from his grandfather's funeral, thirty-year-old Daikichi is floored to discover that the old man had an illegitimate child with a younger lover. The rest of his family is equally shocked and embarrassed by this surprise development, and not one of them wants anything to do with the silent little girl, Rin Kaga. In a fit of anger, Daikichi decides to take her in himself. As Daikichi nurtures Rin, he started to understand the struggle while at the same time the joy of parenting. (From ANN)"},
"13002": {"summary": "With the help of his strange assistant Inga, \"defeated detective\" Shinjuurou Yuuki solves crimes in a near future Japan still suffering from the ravages of war. Problem is, the credit always ends up going to super detective Rinroku Kaishou. (From ANN)"},
"6257": {"summary": "Shinichiro is a student living in what would be a dream come true for most high school boys, but for him is mostly a frustration. A well liked girl in school named Hiromi has lived in his house for a year along with his family. Her father was a close friend of the family, and when he died they immediately took her in. She is popular and well liked, always smiles, is talented in sports - but Shinichiro knows there must be tears inside her. Having an artistic tendency, he makes watercolours of her and thinks about wishing to ease her tears. Yet he cannot bring up the nerve to talk to her even in his own home. She, too, is quiet and withdrawn in their house, quite unlike at school. Shinichiro is also distracted by teasing from his friend Nobuse for watching Hiromi from afar, a curse of bad luck from a strange girl named Noe, and being forced to perform Muhiga dancing. By helping Noe he hopes to ease his own problems, yet he seems to have difficulty helping himself. (From ANN)"},
"12428": {"summary": "In a futuristic Tokyo, humans who have awakened distinct powers are being hunted by a secret organization named Kestos. Denominated as Attracters, these exceptional individuals are joining forces to defend themselves. They are led by an idealist named Quon who is determined to save all Attracters he can. (From ANN)"},
"14167": {"summary": "Konatsu Miyamoto was rejected to sing with the other members of her chorus club by the teacher because she was missing \"something special\". Being her last year in high school, she felt like doing something crazy: She quit. In the place of her former club, Konatsu comes up with the idea to make a new chorus club, inviting the people around her to join. With dreams in each of the member's hearts, they live out their high school lives. (From ANN)"},
"15347": {"summary": "Shinichi Kanou is a young secluded Otaku who is offered a job thanks to his vast knowledge of anime, video games and manga and just after meeting his new employer, he is kidnapped, awakening in an alternate world with a fantasy setup. Shinichi then is informed that he was in fact selected by the Japanese government to help improve his country's relations with this new world by establishing a company to spread the unique products of the Japanese culture to this new, unexplored market. (From ANN)"},
"14953": {"summary": "Thirty years before, a strange phenomena called a \"spacequake\" devastated the center of Eurasia, claiming the lives of at least 150 million people. Since then, smaller spacequakes plague the world on a irregular basis. Shidou Itsuka, a seemingly ordinary high schooler comes across a mysterious girl at the ground zero of a spacequake and learns from his sister Kotori she is one of the \"Spirits\" who are the real cause of the spacequakes that occur when they manifest themselves in the world. He also learns that Kotori is the captain of the airship Ratatoskr and recruits him to make use of his mysterious ability to seal the Spirits' powers and stop them from being a threat to mankind. However, there is a catch: to seal a Spirit, he must make her fall in love with him. (From ANN)"},
"14549": {"summary": "Youto Yokodera is a perverted schoolboy who is unable to express his true feelings freely. After hearing about the wish-granting Stony Cat, he decides to try and make an offering to lose his facade, only to meet Tsukiko who wishes instead to be more discreet with her feelings to become more adultlike. Who'd have thought the rumors of the wish-granting Stony Cat turns out to be true; transferring the facade that Youto wishes to lose into a classmate who needs it more and making it difficult for Tsukiko to show even the slightest of emotions on her face. Being on the same boat, they both search for ways to remedy the situation. (From ANN)"},
"14450": {"summary": "A young boy called Eita enters high school aiming for the National University School of Medicine. Because of his parents' divorce and his goal, he shuns anything to do with romance or love. One day Masuzu, the school beauty with the silver hair, who's just returned to the country, enters his life in a most unexpected way. Chiwa, his childhood friend since elementary school, will not let this go without a fight. (From ANN)"},
"12339": {"summary": "Kazuma's brother Ayumu needs to recuperate from an illness, so they move from the city to a rural mountain village. They plan to board at their father's inn, Yorozuyo, but get lost on their way. Wandering in the mountains, Kazuma stumbles across a girl named Ui Nakatsugawa. It's the first of many encounters in his new country life. (From ANN)"},
"16128": {"summary": "Shinichirou Asano begins work as the housekeeper for the old family of Shimazu, where he meets the ill-mannered, selfish, beautiful Sakuya. She is actually the 37th head of the Shimazu family in charge of sealing away monsters with Spirit Archery. Discovering that he has the powers of \"true names\" and \"true eyes\", Shinichirou becomes wrapped up in Sakuya's battle with the monsters as her assistant. (From ANN)"},
"19593": {"summary": "After graduating from high school, Suzukaze Aoba starts work at the game company Eagle Jump, where she ends up working on the third installment of the game she loved as a child, \"Fairies' Story\". Aoba then meets Yagami Kou, who inspired her to become a character designer in the first place, and other senpai at her new job who help her grow along the way. \"Fairies' Story 3\" launched with no problem and now it's been about a year since Aoba first joined Eagle Jump. The season to welcome in new employees has arrived. A working life comedy about the daily lives of girls working at a gaming company begins its new chapter! (From aniDB)"},
"19380": {"summary": "Touya Mochizuki is the unfortunate victim of a bolt of lightning thrown carelessly by God. Because he really wasn't supposed to die at fifteen, God is willing to cut him a deal - Touya can be reborn, or rather, re-placed, at his present age in a new world in order to continue living. To sweeten things, the world will have magic, which Touya will be able to use, his physical abilities will get a boost, and he can bring any one thing with him. Touya opts to take his smartphone, which God kindly equips with the appropriate maps and translation functions for his new life. And that life looks like it's going to go pretty well - within moments of awakening, Touya has been paid for his other-world clothes, formed a party with twins Elze and Linze, learned he can use all seven forms of magic, and introduced his new world to ice cream - and this is only the first day. (From ANN)"},
"19402": {"summary": "Follows the school life of a teenage centaur named Himeno, and her friends, who happen to be mermaids, angels and other mystical creatures. (From ANN)"},
"18908": {"summary": "Kyou Mekui is a high school student who tends to skip school due to a trauma in his past. Kyou secretly creates songs using vocal song synthesis software as his hobby. Three girls who just entered fifth grade - the crybaby Jun \"Jun-tan\" Gotou, the strong-willed Nozomi \"Zomi\" Momijidani, and the somewhat sleepy Sora \"Kuu\" Kaneshiro who takes life at her own pace - email Kyou. These three girls, who were raised together like sisters since childhood, want Kyou to help them break into music. (From ANN)"},
"19362": {"summary": "A Japanese mecha otaku dies in a car accident and his soul is reincarnated into another world as Ernesti Echevarria. Eru inherits memories and interests from his previous life, and aims to be a pilot of a Silhouette Knight, a large humanoid weapon that really exists in his world. (From ANN)"},
"19393": {"summary": "Five girls live in 19th century London, a city within the Albion Kingdom divided into east and west by a large wall. The girls serve as undercover spies enrolled as students at the prestigious Queen's Mayfair school. The girls make use of their individual abilities to remain active in the underground world of disguise, espionage, infiltration, and car chases. (From ANN)"},
"19412": {"summary": "The year is 1863 as the tumultuous samurai era is coming to an end, Japan is split between the pro-shogunate and anti-shogunate factions. The fate of the world is threatened as an army of historical revisionists are sent from the future to alter the course of history. In order to bring these forces down and protect the real history, two sword warriors, spirits who are swords brought to life by Saniwa (sage), rush to Edo. The polite and thoughtful Horikawa Kunihiro and the short tempered yet skillful Izuminokami Kanesada, who served the same master, confront the invading army along with a lively gang of other warriors including Mutsunokami Yoshiyuki, Yagen Toushirou, Tombokiri, and Tsurumaru Kuninaga. As the fate of history lies in these hero's hands, what meets the blade is yet to be uncovered... (From ANN)"},
"19188": {"summary": "To detect lies, refuse fakes, and reach the miracle of God - that is their mission as Vatican Miracle Examiners. Hiraga, a scientific genius and Roberto, an expert on the decryption of cryptography and ancient documents are not only good partners but also \"Miracle Examiners\" working for the Vatican. They are secret examiners, who are requested to examine and identify the authenticity of miracles from all over the world. (From ANN)"},
"19409": {"summary": "High schooler Masahiro Setagawa is a fairly helpless delinquent, so much so that the neighborhood bullies use him to run their errands. His life changes when he meets high school teacher Kosuke Oshiba, a man whose fighting abilities have earned him a powerful reputation on the streets. Oshiba finds himself with a desire to protect Setagawa, and despite swearing that he's not interested in men, Setagawa finds himself getting more involved in Oshiba's affairs. (From ANN)"},
"19057": {"summary": "Young love - it takes many unique and fascinating forms that flourish as children begin to mature into adults. From being unable to confess to not knowing what real love actually feels like, various obstacles can arise when learning about romantic attraction for the first time. But underneath all that, young love is something truly beautiful to behold, leading to brand new experiences for those young and in love. (From ANN)"},
"19360": {"summary": "Minori is an illness-stricken, constantly bullied orphan. After one rainy day, she doesn't turn up at school, having been admitted into a hospital in a distant town. Two months pass, and the girl's two school friends, Takashi and Kyouko, receive a mysterious email with no sender listed. The email reveals a summer festival taking place at a nearby town. (From ANN)"},
"19544": {"summary": "Koudo Ikusei Senior High School is a leading prestigious school with state-of-the-art facilities where nearly 100% of students go on to university or find employment. The students there have the freedom to wear any hairstyle and bring any personal effects they desire. Koudo Ikusei is a paradise-like school, but the truth is that only the most superior of students receive favorable treatment. Kiyotaka Ayanokouji is a student of D-class, which is where the school dumps its \"inferior\" students in order to ridicule them. For a certain reason, Kiyotaka was careless on his entrance examination, and was put in D-class. After meeting Suzune Horikita and Kikyou Kushida, two other students in his class, Kiyotaka's situation begins to change. (From ANN)"},
"19479": {"summary": "A restaurant called \"Youshoku no Nekoya\" (Western Cuisine Cat Restaurant), which is located on the first basement floor of a building at a corner of a shopping district near an office area. While it normally feeds salarymen, there is a secret in Nekoya. Every Saturday when the shop takes a day off, Nekoya is teeming full of \"special customers\". For the office workers, it is a familiar place with familiar dishes, but for these Saturday customers - \"people from that world\" - it is nothing but cuisine never seen or heard before. (From ANN)"},
"18916": {"summary": "Five girls work in the tourism bureau of their small provincial town. The town revives its \"micro-nation\" tourism program, which originated from a nationwide movement during Japan's bubble economy period, and hires the five girls as \"monarchs\" (tourism ambassadors). (From ANN)"},
"19399": {"summary": "Keita Amano is a lonely young man who loves video games; Karen Tendou is the beautiful president of the video game club; Chiaki Hoshinomori constantly fights with Keita; and Tasuku Uehara puts on a facade of being satisfied with his life in the real world, but he in truth loves video games. (From ANN)"},
"19475": {"summary": "First year high school students Haruki Mishima and Toure Honda are looking forward to their new school life. Meanwhile Nasa Sanagi, sole member of the cooking research club, continues with his club activities from middle school, striving to work on the theme that his adviser laid out for him. Second year student Natsu Asumi, although he matured a little since the height of his impudence during his first year, has nevertheless chosen to remain alone this year. Third year students Mikado Nakajima and Masamuna Sakurakoji watch over him with a smile. All of them will pay the nearby convenience store a visit after school. (From ANN)"},
"18952": {"summary": "An enormous pit and cave system called the \"Abyss\" is the only unexplored place in the world. Strange and wonderful creatures reside in its depths, and it is full of precious relics that current humans are unable to make. The mysteries of the Abyss fascinate humans, and they head down to explore. The adventurers who venture into the pit are known as \"Cave Raiders\". A little orphan girl named Rico lives in the town of Osu on the edge of the Abyss. Her dream is to become a Cave Raider like her mother and solve the mysteries of the cave system. One day, Rico starts exploring the caves and discovers a robot who resembles a human boy. (From ANN)"},
"18485": {"summary": "Taking off right after the last episode of the first season. The school is temporarily closed due to security. When U.A. restarts, it is announced that the highly anticipated School Sports Festival will soon be taking place. All classes: Hero, Support, General and Business will be participating. Tournaments all round will decide who is the top Hero in training. Wills and strengths will be tested, as weaknesses will be overcome in this new season of My Hero Academy. (From ANN)"},
"18943": {"summary": "High school student Sota is watching the anime Elemental Symphony of Vogelchevalier when he suddenly finds himself drawn into it. When he returns to his world, the heroine of that series, the warrior-princess Selesia Uptiria, comes with him. They soon discover that this is not an isolated case, as several characters from anime, manga, and video games are being transported into what they call \"the realm of the gods\" by the mysterious girl Military Uniform Princess. Some Creations seek to meet their Creators, while others have more hostile purposes. (From ANN)"},
"18190": {"summary": "10 years after the world escaped destruction due to the revival of Bahamut, humans at the royal capital gather wealth, the demons are enslaved to assist with the capital's revival, and the gods lose their power due to a decrease in religious piety. The world is thrown off balance as humans, gods, and demons hold their own ideas of justice. (From ANN)"},
"19410": {"summary": "One day, Haruto wakes up on a round bed in a strange room, with the only familiar things around being his smartphone and headphones. After encountering a strange girl in white named Lily who claims to be his sister and a man who looks like a cat, Haruto learns that he is in a dream belonging to Yuko, a girl stricken with Sleeping Beauty Syndrome. Yuko is the Witch of Thunder, an all-powerful woman who makes the dream world bow before her to ensure she's known the strongest, the best, and the most fun person around. Haruto's sister tells him that he must wake Yuko up by killing her in the dream in order to break the \"spell\" she's under, but Haruto's got some other ideas about what might be keeping Yuko asleep. (From ANN)"},
"18936": {"summary": "Chronos Rulers (Jikan no Shihaisha) are those who fight the time-eating demons that appear when people wish they could turn back time. The Chronos Rulers fight a time-manipulation battle against these demons. (From aniDB)"},
"19416": {"summary": "Hell Girl Enma Ai and her group return for another series to continue their task of transporting cursed people to hell. New questions arise when a previously unseen girl dressed in green appears before them. As her appearances grow more frequent the mystery behind her purpose is gradually revealed even as the task of carrying people to Hell continues. (From ANN)"},
"18155": {"summary": "Tamaki Honda is a first-year high school girl who joins a somewhat peculiar \"SNS-Bu\" circle that makes doujin (self-published) games. (From ANN)"},
"19478": {"summary": "The \"local heroine fighter\" of a certain city became popular and a national star. Because of this, \"local heroines\" debuted in various other places, and their action live events became a hit trend nationally. In Hinano City, high school girl Misaki Shirogane and other girls become local heroines (at the urging of Misaki's aunt, the prefectural governor) and vow to produce action live events. (From ANN)"},
"19161": {"summary": "I-Machines are the general term for robots that operate in extreme environments. While Alliance Academy student Maya Mikuri is in the middle of operating an I-Machine, she gets involved in an incident with pirates, and ends up serving as a crew member on an excavation company's spaceship. (From ANN)"},
"15492": {"summary": "Sei Iori is a Gunpla builder whose family runs a hobby shop in a small town. He aspires to be a Gunpla Battle champion like his father, but despite his exceptional building skills, he lacks the combat abilities to compete with other contestants. Then one day, he meets a mysterious boy named Reiji, who helps him improve his confidence in participating in Gunpla Battles. Together, Sei and Reiji battle their way to the 7th Gunpla Battle World Tournament. (From ANN)"},
"16135": {"summary": "It has been seven years since Sei Iori won the 7th Gunpla Battle Championship World Tournament. Gunpla Battle is now more popular than ever, with new rules and new ways to battle. Fumina Hoshino is the president of the Gunpla Battle Club at Sei's old school, Seiho Academy, and a big fan of the game, but unfortunately, she cannot attend the upcoming All-Japan Gunpla Battle Championship tournament without a three-person team. Desperate to participate, she meets transfer student and young martial artist Sekai Kamiki, as well as a young Gunpla builder named Yuuma Kousaka. The three decided to join up to form Team \"TRY FIGHTERS\", a new team of Gunpla builders and fighters that will together face the challenge of winning the tournament. (From ANN)"},
"15780": {"summary": "In the eleventh year of the Meiji era carrying swords was forbidden by the government and those known as samurai were slowly fading away. However, there were plenty who didn't like those changes taking place in Japan and inevitably the crime rates increased. The country's only solution was an inescapable lake prison. Since the prison had no other way to access it except by water, the three boys of the Kumo family were assigned to transport the criminals to their new \"home\". (From ANN)"},
"15105": {"summary": "God has abandoned the world. Women had stopped giving birth and the dead are damned to walk among the living even if their bodies are damaged beyond healing. Only appointed individuals called gravekeepers can bury the deceased and put them to rest. Ai Astin is a young girl who took on the role of a gravekeeper after her late mother passed away. One day, a mysterious immortal man appears at Ai's village and slaughters all of the residents except her. Ai, having no where else to go, ends up leaving her home to travel with the man in hopes of seeking answers to why God left the world in such a horrific state. (From ANN)"},
"15359": {"summary": "By 2039, global warming had caused sea levels to rise and large amount of territory to be lost. As though in response, a mysterious group of warships clad in mist, \"the Fleet of Mist\", appeared in every corner of the ocean, and began attacking human ships. In spite of humanity mustering all their strength, they were utterly defeated by the Mist's overwhelming force. All of humanity's trade routes were blockaded by the Fleet of Mist, their political economy was destroyed, and the human race was steadily beaten down. Seven years later, the Fleet of Mist's submarine I-401 appears before cadet Gunzo Chihaya. The humanoid life form that pilots the sub, who should be their enemy, is instead offering her services to mankind. (From ANN)"},
"12104": {"summary": "While job hunting, Naoya is taken by a mysterious girl to a magical land where he is installed in the harem of the succubus Princess Lotte. Thanks to trauma from her childhood, Lotte hates men and surrounds herself with lots of other women, who all have quirks of their own. In spite of her selfishness, when Naoya learns that Lotte is really quite lonely he agrees to stay in her world... if he can bring his daughter Asuha with him. (From ANN)"},
"12368": {"summary": "Five childhood friends grow apart after the death of Meiko Honma, close playmate of them all. Jinta Yadomi, leader of the group when they were kids, neglects high school and lives as a shut-in when he unexpectedly starts seeing the ghost of Meiko, who can only interact with him and no one else. She has returned to ask Jinta to fulfill the forgotten wish she made as a kid. (From ANN)"},
"11795": {"summary": "When her mother runs off with her latest boyfriend, Ohana Matsumae is sent to live with her grandmother, who she has never met nor spoken to. Her grandmother is not pleased to find Ohana on her doorstep, and sets her to work at her Taisho-era (1920s) hot springs inn. It's not a lifestyle that Ohana would have chosen, but she decides not to be discouraged and to make the most of her difficult circumstances. (From ANN)"},
"11059": {"summary": "Hino Akiharu lost his parents when he was small and was adopted into his uncle's family. But he noticed his uncle is after the inheritance of his parents, so he decides to enter a boarding school, Hakureiryou high school. However his delinquent boy-like appearance frightens the girls, who make up the majority of the students. Being unable to get along with the classmates, Akiharu meets his childhood girlfriend Saikyou Tomomi. (From ANN)"},
"10885": {"summary": "In a world after death, angels fight for their fate and their future. Yuri, the leader of the Shinda Sekai Sensen, rebels against the god who destined her to have an unreasonable life. On the otherhand, Tenshi, the chairperson of the student council for the world after death, battles against the SSS members. SSS members utilize armed weaponry to battle it out against the angels harnessing supernatural powers. (From ANN)"},
"10687": {"summary": "Nice guy Kio's normal life gets turned upside down when he meets a friendly, sexy cat-alien named Eris. She's on a peaceful mission - and she's ready to play. Things get even friskier when her fellow felines set up base in Kio's house. It's not all fun and games, though. Danger is afoot, thanks to several secret agencies and enemy dog-aliens on Eris's tail. (From ANN)"},
"11965": {"summary": "Eris is now on a mission to learn about Earth games and how they are played... There's just one thing, Eris seems to think that bets have to be placed every time, and while some bets are material items, eventually the Catians learn the idea of betting clothing items... This could get real interesting for Kio. (From ANN)"},
"11199": {"summary": "Yamada is a high school student, and a virgin, who aspires to have 100 casual sex partners. Despite this, she soon finds herself targeting and pursuing only one boy. (From ANN)"},
"12857": {"summary": "Saya is a seemingly normal girl living with her father in a shrine. During the day she goes to school and spends time with her friends at a local cafe. But when night falls Saya is called upon to protect her village from strange monsters. (From ANN)"},
"13228": {"summary": "Tokyo has enacted the Youth Protection Ordinance, minors are forbidden to be out at night, and the Internet is policed. However, Sirrut, an underground rebel organization, has declared war on Fumito Nanahara. Sirrut uses the Internet to try and find information in cyberspace, and they discover something more gruesome: TOWER, a mysterious organization behind Fumito that is rumored to be conducting experiments involving human beings, and alluding to people being... eaten. (From ANN)"},
"10519": {"summary": "Juu Juuzawa is a delinquent high school boy who just wants to be left alone. One day, he is approached by Ame Ochibana, who claims that she knew him in a previous life, and now wants to serve him as his \"knight\". At first Juu wants nothing to do with Ame, but after a classmate is murdered, he accepts her help as he looks for the killer. (From ANN)"},
"11721": {"summary": "Ryuuji Kisaragi is a normal high school boy whose peaceful life is turned into an adventure by the return of his second cousin Eriko Nanao. Ryuuji and Eriko seize a relic box from a black broker, and in the box they find Rose, a red dragon girl. In order to protect Rose from the black organization, Ryuuji decides to fight using his power as a relic handler. (From ANN)"},
"15784": {"summary": "Genius gamer siblings (plus being NEET & hikikomori) Sora and Shiro are known as the undefeatable \"__\" (blank). Their talents and skills are so good they are considered as urban legend. One day, a young boy named Teto appears before them, claiming to be the \"God\" of another dimension where Sora and Shiro are summoned to, in which no violence is allowed and everything is decided by a game. Of the 16 different races residing in this world, \"Humanity\" is the weakest. After having the vast majority of their lands captured by the other races and being driven to the brink of extinction, Sora and Shiro challenge these one-of-a-kind battles of the intellectual powers in order to save Humanity. (From ANN)"},
"11808": {"summary": "Makoto Niwa is a high school boy who, since his parents are away on business, lives with his aunt's family. It is there he meets his mysterious cousin of the same age Erio Touwa - who happens to tie a futon around her upper body and is a self-proclaimed alien. Her staple food is pizza. Erio had been missing for half a year and was found floating in the sea. She doesn't remember anything about what happened during that period of time, but she began to think that it was the act of an alien and wanders the neighbourhood wrapped in the futon. (From ANN)"},
"11681": {"summary": "-Prelude of the Girl Who Gazes into Dreams- Amano Tooko is a high school student with the strange power of being able to experience books by savouring them. While visiting the workplace of her deceased father, she stumbles upon the rejected drafts for a writing contest. One of them has such an impact on her that she asks her acquaintance there to give it one more chance. -Requiem of the Sky Dancing Angel- Asakura Miu lives a sad and troublesome childhood due to her parents' constant fighting. Eventually her father leaves the house and she ends up living with her bitter mother. Miu has been desperately trying to escape the harsh reality that surrounds her to the only safe place she knows: the worlds inside the books she loves. Ostracised by the kids at school, due to her imaginative mind that prompts her to frequently lie, she becomes a friend of Inoue Konoha, who rather than estranged, ends up fascinated by Miu's tales. -Rhapsody of the Love Maiden- Unable to express her feelings toward the boy she likes, Kotobuki Nanase inadvertently makes it look like she hates Inoue Konoha instead. Her best friend, Mori Kurara, tries to help as Nanase attempts to clear up the misunderstandings she has created. (From ANN)"},
"11684": {"summary": "Touko Amano and Konoha Inoue are the sole members of their literary club. After school, they meet so that Touko can assign topics which will guide Konoha in writing a short story within fifty minutes. (From ANN)"},
"10815": {"summary": "As first year student Konoha Inoue is about to leave school campus, he sees a girl eat a page from the book she is reading. She introduces herself as second year Touko Amano, the literature girl, and asks him to join the Literature Club so that he doesn't expose her secret. After almost two years of being the sole two members of the club, a strange message arrives: a piece of paper with a peculiar drawing. Further investigation leads them not only to Inoue's past, but to the reason to why he has given up on writing novels for the rest of his life. (From ANN)"},
"15564": {"summary": "Haruka Takayama and Yuu Sonoda were inseparable during their junior high school years, but upon entering their senior high school, they end up being seated on opposite sides of the classroom. Having to spend time with more friends, the two decide to do something to make their relationship special. (From ANN)"},
"11211": {"summary": "Upon reaching the train station to death, a dejected soul is informed that he is \"lucky\" and will have another chance at life. He is placed in the body of a 14-year-old boy named Makoto Kobayashi, who has just committed suicide. Watched over by a neutral spirit named Purapura, the soul must figure out what his greatest sin and mistake in his former life was before his time limit in Makoto's body runs out. He also has a number of other lesser duties he must complete, such as understanding what led Makoto to commit suicide in the first place and learning how to enjoy his second chance at life. (From ANN)"},
"12431": {"summary": "Akihisa Yoshii, now in his third year in high school, continues his misadventures with Yuuji, Mizuki, and other high school friends. Akihisa, however, is enrolled in a rather unique high school. In Fumizuki Academy, all of the students are given avatars with fighting abilities whose power reflects the student's academic success. With their avatars by their side, our characters explore deeper into what it means to be a friend and how they treat each other and why. While Shoko, the school's #1 student, endlessly tries to woo Yuuji, Minami and Mizuki try to capture the romantic attention of the oblivious Akihisa. (From ANN)"},
"13223": {"summary": "A year before the battle of Sekigahara that ended the Sengoku Period, the ninja Kirigakure Saizou meets the miko Isanami as she's attacked by assassins. Her shrine was destroyed by Ieyasu Tokugawa for siding with Sanada Yukimura. Meanwhile, Sanada has been gathering ten warriors known as Sanada's Brave 10, who have the power to change history. As they gather one by one, Isanami's own mysterious power awakens. (From ANN)"},
"11318": {"summary": "Mato Kuroi just got into junior high school, and on the first day, someone catches her eye: her classmate Yomi Takanashi. The two meet. The innocent and naive Mato. The mature Yomi. Seemingly opposites, but the time they spend together only strengthens a growing friendship. But as they go into their second year at the school, they get placed in separate classes, and they begin to grow apart. But somewhere simultaneously... In another world, a young girl, blue fire residing in her eyes, Black Rock Shooter faces another young girl; this one holding a jet-black scythe, Dead Master, and a battle to the death begins to unfold. (From ANN)"},
"13636": {"summary": "Three months after his adventure in Flonyard, Shinku gets summoned back once again, this time bringing Rebecca with him. His cousin and rival athlete Nanami, also is summoned to Flonyard as Galette's Hero. The First Princess of the Principality of Pastillage, Couver, leads her squirrel-like faction into the battlefield as well with the intention of scouting Rebecca to become their hero. (From ANN)"},
"15226": {"summary": "Since so few women are naturally born with the ability to become Pandoras and fight the extra dimensional aliens known as Nova, a program is approved by the Chevalier organization to allow any female to artificially become such a warrior. In order to test this new generation of E-Pandora, small groups of the highest ranked cadets from various Pandora academies around the globe are sent to Alaska in order to gauge the project's progress. Among those sent are Satellizer, Rana, and Kazuya since they display a skill level far above their position. It is not merely their combat prowess that is tested however, when the Evolution Pandora project does not go as expected. (From ANN)"},
"14991": {"summary": "Shinobu Omiya is a 15-year-old girl who had once did a homestay in Great Britain when she was 10 years old. She met a blonde, extremely shy, English girl named Alice Cartalet. Once getting to know each other, and getting past the language barrier issue, the two became close friends. On Shinobu's last day in England, Alice makes a promise that she will come visit Japan someday. 5 years later, Shinobu receives a letter from Alice stating that she is coming to Japan. And on the same day of receiving the letter Alice appears at Shinobu's school, revealing that she has transferred to her class and will be staying at her house. (From ANN)"},
"14671": {"summary": "GJ-bu, or GJ Club, revolves around five members of a vague high school club, where on any given day they may be playing Twister, taking naps, or reading manga. The show outlines the relationship between the protagonist, a boy named Kyouya, and some rather interesting girls, including a tiny tsundere president, her calm kind sister, a genius chess player, and a girl who is always eating meat and resembles a cat. (From ANN)"},
"12825": {"summary": "Wacky hijinks abound as Rika finds herself in a parallel Hinamizawa in which Tokyo is made of superpowered henchman and Rika herself is a magical girl. After returning to her regular Hinamizawa, Rika finds that the time line has not completely straightened out, as her younger self from 4 years prior has accidentally come to the future. (From ANN)"},
"13787": {"summary": "It has been several centuries since human population has declined. Food has become harder to find and what little sources the humans have are considered highly valuable. The most prosperous species on the Earth are \"Fairies\", 10 cm tall creatures with high intelligence and a great love for sweets. A nameless girl, the main character, became a UN arbitrator between the humans and the fairies and had returned to her hometown to help her grandfather. One day, the village is sent some strange products made by a company called FairyCo. Since the villagers are wary of using the products, the girl, her grandfather, and a nameless boy decide to go to the factory to investigate the mysterious products and find out who is behind making them. (From ANN)"},
"15195": {"summary": "Haruto moves to Tokyo to live with his older sister in order to attend high-school there and be closer to his girlfriend Yuzuki. The two of them have been having a complex long distance relationship ever since she moved away from Hiroshima. However, when he arrives he doesn't get the welcome he expected. Instead he's mistaken for a prowler and assaulted by his new neighbor with a baseball bat and his girlfriend is doing her best to avoid him. (From ANN)"},
"15107": {"summary": "It is the early 20th century, and Raishin Akabane is a student puppeteer from Japan, who has come to the Walpurgis Royal Academy of Machine Arts in England to study the emerging field of Machinart: a combination of magic and technology with military applications. He is accompanied by a girl named Yaya, who is actually his Automaton: a living machine doll powered by magical circuits specialized in hand-to-hand combat. In the Academy, there is a combat tournament exclusive to the Top 100 students and their automata, to decide who shall be bestowed with the title of \"Wiseman\", the greatest puppeteer. (From ANN)"},
"11169": {"summary": "Keita has two older stepsisters, Ako and Riko, but since they aren't related by blood, they love him in a lustful way. After a mishap at school, Ako and Riko finally confess their love to him. Keita dislikes the thought of seeing them other then brother and sister, but as he tries to enter the same school as his sisters, he slowly becomes attracted to them. (From ANN)"},
"11670": {"summary": "On her 16th birthday Kanna Aoyagi is asked by her 28-year-old sister Yayoi to become an eroge seiyuu (erotic game voice actress) at her sister's eroge company. Kanna disagrees at first, but after she thinks about all the things her sister has done for her she finally relents. But being a high school student and knowing nothing about eroge, can she do the job properly... (From ANN)"},
"14113": {"summary": "Kokoro Connect revolves around the daily, not so normal lives of Taichi, Iori, Himeko, Yoshifumi and Yui and their encounters in the Cultural Research Club. Up until recently they thought that they and their friends lived normal happy lives, but now the Heartseed is pulling their lives apart and exposing their inner secrets through body switching, urges and age regression. (From ANN)"},
"16123": {"summary": "A little girl named Kohina ends up summoning a Kokkuri-san, a lower-ranking ghost in Japanese folklore. The Kokkuri-san she calls ends up being a white-haired handsome, young man. Although he had intended to merely haunt her at first, he becomes worried about her terrible eating habit of cup ramen for every meal, so he decides to haunt her in order to protect her. (From ANN)"},
"7801": {"summary": "Much like looking through a window, Iblard Jikan explores the fantastic and beautiful world of Iblard by panning through art created by Naohisa Inoue. Iblard shows itself to be nothing short of amazing and will wash serenity over your mind. (From ANN)"},
"14732": {"summary": "Ashinaka High School is known for its unique setting: the entire campus is built on an island. Yashiro Isana (aka Shiro) is having lunch with a cat on one of the school rooftops. After his lunch break, Shiro goes on an errand for his classmate Kukuri to prepare for their upcoming school festival, only to be chased by some intimidating-looking men. (From ANN)"},
"15574": {"summary": "One day, Red, a boy filled with dreams of going on a Pokemon journey, is called to Professor Oukido's lab. There, he and his rival Green are given a Pokedex in order to collect data on all of the Pokemon in the region. As Red works his way to become champion with his Charmander, he meets many people on his journey, including Old Man Fuji, a man who runs the home for abandoned Pokemon, and Reina, a girl who works there. As danger in Red's journey begins to peak, he and his partner Pokemon experience a transformation like never before... (From ANN)"},
"15842": {"summary": "In order to survive the eventual arrival of the \"Dusk End\", people of the western reaches of the \"Land of Dusk\" devoted their efforts to rediscover and recreate lost alchemic technologies. Those technologies were then gathered in the alchemy city known as \"Central\", where research was conducted on how to halt the advance of the twilight. Having learned the newest alchemic techniques in Central, young alchemist Logy requested a transfer to an understaffed town of Colseit on the frontier to make use of his abilities. There he meets Escha, an apprentice girl assigned to the Development Department. Together, the two make a promise to use their alchemic techniques to bring success to the Development Department. (From ANN)"},
"13761": {"summary": "Ordinary high schooler Yoshiharu gets pulled into a time slip to the warring states period. There he meets Nobuna Oda - not Nobunaga, Nobuna. In this world, all the famous warlords of the era are female. Nobuna recruits Sagara, who she dubs \"Monkey\", to help her in her quest to rule the world. (From ANN)"},
"11225": {"summary": "The story takes place in a trading city Ert'Aria. Leicester Maycraft is an item engineer belonging to an adventurer guild \"Oasis\". One night, he is at a party with his friends to see a meteor stream on the rooftop of a chapel. One meteor grazes them and hits the steeple of the chapel. There he finds a secret room and a sleeping girl. The girl wakes up and says \"You must be my father\". The encounter with the mysterious girl brings an unexpected adventure to Leicester. (From ANN)"},
"15565": {"summary": "Raul had always wanted to be a hero, but the demon king was defeated, leading to the end of hero exams. He reluctantly took a job working at a small electronics store called Magic Shop Leon. His life is dull but busy until a new girl comes applying for a part time job. She's the daughter of the defeated demon king. (From ANN)"},
"15757": {"summary": "When he was a child, Murakami was friends with a girl he called Kuroneko. One day, while trying to prove the existence of aliens to Murakami, she is killed in an accident that he barely survives. Guilty of his role in the accident, Murokami decides to dedicate his life to proving that aliens exist. Then, one day, a new student with mysterious powers transfers into his class who not only looks a lot like Kuroneko, but is named Kuroha, Neko. (From ANN)"},
"15769": {"summary": "In the year 2021, mankind was defeated by Gastrea, a parasitical virus, and is forced to live within a wall made of Varanium Monoliths, a metal that is able to subdue Gastrea. Soon, the \"Cursed Children\", children born with the Gastrea virus who are able to control it - which gives them superhuman abilities - were discovered. Due to the Gastrea virus' intervention, the Cursed Children could only be female. Civil Securities are formed to specialize in fighting against Gastrea, operating with the pair of an Initiator, who are cursed children, and a Promoter, serving to lead the cursed children. Ten years after the war, Rentarou Satomi, a high school student who is also a Promoter in his childhood friend Kisara Tendou's Tendou Civil Security, along with his Initator Enju Aihara, receives a secret mission to prevent the Tokyo Area's destruction. (From ANN)"},
"16174": {"summary": "Main male protagonist Kasuna Arata finds his world turned upside-down one morning when a magical disaster known as a \"Breakdown Phenomenon\" destroys his hometown and claims the life of his childhood friend. After receiving a Grimoire (book of spells) and a sudden encounter with a Mage sent to destroy him, he decides to join forces and enlists in a magical school charged with training magicians to deal with these disasters. Now enrolled and underway with his training, he finds himself butting heads with an organization out to destroy the world, a harem of deadly magicians at his back and his new-found powers threatening to destroy him while the world hangs in the balance. (From ANN)"},
"16248": {"summary": "During the Hundred Year's War between England and France in the Middle Ages, a powerful witch named Maria lives in a secret forest with her familiars. She hates the war around her, and will sometimes stir up trouble against the church that does nothing to stop it. Her interventions into the world, however, run against the plans of heaven, earning her the attention of the Archangel Michael. (From ANN)"},
"15865": {"summary": "High School freshman Koutarou Satomi wants to start a new life living alone in the tiny Room 106. That lonesome life is immediately broken by the invasion of a group of mysterious girls who all claim Room 106 belongs to them one way or another. (From ANN)"},
"16133": {"summary": "Seiya was forced to accept an invitation to an amusement park by the mysterious and beautiful girl Isuzu. What he didn't know was that she would bring him to the decrepit Amagi Brilliant Park, Japan's most disappointing amusement park. Seiya is introduced to the leader of the Park, the \"real princess\" Latifah, who suddenly entrusts him with saving the park, which is in danger of shutting down. Amagi Brilliant Park, it turns out, is not just any amusement park, but rather one populated by fairies. (From ANN)"},
"16579": {"summary": "High schooler Yuuta Iridatsu has experienced \"astral projection\" i.e. his spirit has been separated from his body. He woke up in a mansion named Koraikan and met a cat spirit named Chiranosuke, who told him \"You must find the Sacred Tome of Koraikan in order to return to your physical body\". While searching through corridors of Koraikan, Yuuta bumped into underpants of its female residents, and doing so would, eh, create some big trouble for planet Earth. (From ANN)"},
"16443": {"summary": "As an adventurer living in Orario, Bell Cranel becomes the only member of Hestia Familia. Although he was very weak compared to veteran dungeon crawlers, he gained a special skill that enables him to become stronger quickly as long as his feelings towards Aiz, the Sword Princess whom he looks up to, does not change. With the help of his Goddess, Hestia and other people who cares for him, he vows to be strong enough to stand side-by-side with Aiz and protect everyone important to him. (From ANN)"},
"19878": {"summary": "The Dream Festival is the stage that all idols dream of singing on, with their professional debut on the line. In order to get there, idols work their hardest every day to perfect their performance... and the key to coming out on top is the Dream Festival Cards sent by fans to their favorite idols. Receiving these Cards makes the idols who make it to the stage shine even brighter. Now head to the Dream Festival with your Dream Festival Card in hand for the idol you love most! (From aniDB)"},
"799": {"summary": "Azumanga Daioh is about high school life through the eyes of six girls with unusual personalities: Chiyo (the 10-year-old genius), Osaka (the resident airhead), Sakaki (the shy one prone to cat bites), Tomo (the loose cannon), Yomi (the short-tempered one) and Kagura (the resident jock). (From ANN)"},
"14172": {"summary": "Naruto and his friends are trapped in a Genjutsu created by the mysterious Masked Shinobi who is testing it for a greater plan. In this new world, or reality, everyone except Naruto and Sakura have their personalities changed to the opposite of their normal personality. Also, dead characters are now alive and roles are reversed. Naruto and Sakura must find a way to get out of this Genjutsu, and return things to normal. (From ANN)"},
"18662": {"summary": "Two third-year middle school girls, Sumire and Meguri, fight evil as Twin Angels under orders from a hedgehog named Miruku-chan. The girls disagree, but as they work together, little by little they become friendlier with each other. (From ANN)"},
"19010": {"summary": "Ao opens a package that arrives at her doorstep. Inside the package is Gourai, a Frame Arms Girl: a small robot capable of independent movement. Gorai is a newly-developed prototype: a Frame Arms Girl equipped with an \"Artificial Self\", an advanced AI that gives her a personality. Ao is the only one that has activated her. Gourai begins to gather both battle data and emotions, starting a day-to-day life with Ao, who knows nothing about Frame Arms Girls. (From ANN)"},
"19024": {"summary": "A group of young girls possess a mysterious power known as \"Alice's Dream\", which gives them the ability to turn their thoughts into reality. Detained and experimented upon, these youths are locked away in secret until one of them manages to escape. Her name is Sana - a girl with the power to ignore the very laws of physics. When this willful powerhouse crosses paths with a stubborn old man named Zouroku, his carefully-ordered life will never be the same again. (From ANN)"},
"18461": {"summary": "The kingdom of Dowa, which is subdivided into 13 states, is celebrating its monarch's 99th birthday. These 13 states have many agencies that are controlled by the giant organization known as ACCA. Within ACCA, Jean Otus is the second-in-command of the inspection agency. His agency has ten people placed in each of the 13 states, with a central office in the capital city. They keep track of all the activities of ACCA across the kingdom, and keep data on each state's ACCA office flowing toward the central office. Jean also often has business trips from the capital to the other districts to check on the situation and personnel there. (From aniDB)"},
"18690": {"summary": "In Osaka in the year \"AD20XX\", Hand Shakers are partners who can summon \"Nimrodes\", weapons born from their deep psyche by joining hands. In order to grant the pair's wish, the Hand Shakers compete with and fight other Hand Shaker pairs. The top pair will then meet and challenge \"God\". (From ANN)"},
"19020": {"summary": "Liones Yelistratova is the naive princess of a small nation, who goes to Hokkaido to enter ALCA, an educational institution dedicated to teaching Logicalists who uphold world peace. Liones enters Class S, and encounters many unique classmates, including Logicalist Nina Alexandrovna. (From ANN)"},
"16036": {"summary": "Chiyo Sakura confesses her feelings to her schoolmate Nozaki. Due to a misunderstanding, Nozaki thinks Chiyo is just a fan. She then discovers Nozaki's other identity: a shoujo manga artist. As she gets closer to Nozaki, she befriends Nozaki's quirky acquaintances who assist him and serve as inspirations for his manga. (From ANN)"},
"15705": {"summary": "Kazama Kenji was feared as the worst delinquent of Fujou High, but after certain events led him to peek in on the Game Development Club, he witnesses the outbreak of a fire. While the members inside manage to succeed in putting it out, they all attack Kenji to erase his memory and hide the incident. Kenji desperately tries to escape from them, but when their president Shibasaki Roka rescues him he ends up joining their Game Development Club. (From ANN)"},
"17690": {"summary": "Illya and the gang have finished their battle against the heroic spirit residing in the eighth class card. They're back in vacation mode again, looking to make the most of what they have left of summer break. But their hopes get crushed in the blink of an eye. An all-too-unrealistic silhouette appears before them when they go to investigate the strange event at Mount Enzou. After a short skirmish, the entire space ends up being warped. Illya wakes up in a wintry Fuyuki City... in a parallel world. This is the world where Miyu was born and raised. (From ANN)"},
"15136": {"summary": "Blood Lad follows Staz, a vampire that is obsessed with the human world, and Fuyumi, a human girl that was killed and turned into a ghost after wandering into the demon world. Staz promises to help Fuyumi regain her humanity by bringing her back to life, as it means that he would be able to visit the human world. (From ANN)"},
"18950": {"summary": "In a town filled with super powers, Asai Kei is a boy who forgets nothing. One day he meets Haruki Misora, a girl who can reset time. After discovering that Kei's memories aren't affected by a reset, together they try to help the people of Sagrada with their unique problems. (From ANN)"},
"15785": {"summary": "Ordinary high school students Shougo Ryuujin, Tyrone, Antonio, and Luke are the White Bone warriors. With their special Bone Cards they defend Earth from the evil Dark Bone, who has come from the darkness to destroy our world. However, the true identity of the \"enemy\" is still uncertain. (From ANN)"},
"19919": {"summary": "With nothing left to lose, ordinary high school student Haruka Shinozaki confesses to beautiful, diligent class representative Akiho Kousaka and to his surprise she accepts. Kousaka takes dating as seriously as she does everything else, but does not quite get it. She pragmatically suggests activities that are too sexual. (From ANN)"},
"19011": {"summary": "Koujiro Shindou is a highly-skilled negotiator working for the Ministry of Foreign Affairs. As his plane at Haneda airport prepares to take off, a huge mysterious cube appears from the sky. 'It' expands rapidly, and absorbs the passenger plane and its 252 passengers. The cube's name is \"Kado\". A strange being called Yaha-kui zaShunina appears from within Kado and tries to make contact with humanity. Shindou, who was been absorbed by Kado, ends up taking on the role of mediator between Yaha-kui zaShunina and humanity. The Japanese government sends its own negotiator, Saraka Tsukai. (From ANN)"},
"19818": {"summary": "In a world where Spirits and Humans coexist and can fall in love with each other, many Spirits see their human loved ones die before them due to the Spirits' much longer life expectancy. Even when that human is reborn, the previous memories of their past life is erased from their memory. However, it is said among Spirits that a certain \"service\" is spreading. This \"service\" is provided by the \"Fox Spirit Matchmakers\" who can revive the lost memories of their former lover. When a Spirit loses their lover, they can purchase the service of the Fox Spirit Matchmakers to attempt to restore their former lover's memories, and continue their love story together. This story follows a young Fox Spirit Matchmaker who tries her best to restore lost memories and spread love. (From ANN)"},
"18982": {"summary": "Feckless high school student Tatara Fujita wants to be good at something - anything. Unfortunately, he's about as average as a slouchy teen can be. The local bullies know this, and make it a habit to hit him up for cash, but all that changes when the debonair Kaname Sengoku sends them packing. Sengoku's not the neighborhood watch, though. He's a professional ballroom dancer. And once Tatara Fujita gets pulled into the world of the ballroom, his life will never be the same. (From ANN)"},
"19325": {"summary": "A girl named Yuuka encounters a being from the depths of the Earth named Chii-chan (a pun of 'Chiteijin', the Japanese word for underground-dweller), and an alien named Ucchan (a pun of 'uchuu jin', or 'alien'). The two beings begin living with Yuuka who promises to protect them. (From ANN)"},
"19357": {"summary": "Negi Springfield, the boy wizard, fought and won many battles. Now it is decades later and Negi's grandson, a little boy name Touta, dreams of leaving his quiet village and heading to the City to climb to the top of the space elevator and make a name for himself. But first he must defeat his teacher, the immortal vampire, Evangeline. (From ANN)"},
"19094": {"summary": "Pascal-sensei is an elementary school teacher who is so stupid, he cannot even write his own name. He does whatever he likes in his classroom. Plus, by all appearances, he is not human. (From ANN)"},
"19335": {"summary": "The 12th Twelve Tournament gets held every twelve years. Twelve brave, strange warriors who bear the names of the signs of the zodiac fight each other for the lives and souls. The victor of this tournament gets to have one wish granted, whatever the wish may be. (From ANN)"},
"19876": {"summary": "Three high school girls are putting together a limited-time shop called \"PARK\" in Japan's Harajuku. One day, aliens come to Earth with the intent to steal the famed district's culture. At the same time, a mysterious girl appears. The three girls band together to defeat the alien threat and protect their beloved Harajuku. (From ANN)"},
"19614": {"summary": "In a world inhabited by crystalline lifeforms called The Lustrous, every unique gem must fight for their way of life against the threat of lunarians who would turn them into decorations. Phosphophyllite, the most fragile and brittle of gems, longs to join the battle. When Phos is instead assigned to complete a natural history of their world, it sounds like a dull and pointless task. But this new job brings Phos into contact with Cinnabar, a gem forced to live in isolation. (From ANN)"},
"19827": {"summary": "Civilization is dead, but Chito and Yuuri are still alive. So they hop aboard their beloved Kettenkrad motorbike and aimlessly wander the ruins of the world they once knew. Day after hopeless day, they look for their next meal and fuel for their ride. But as long as the two are together, even an existence as bleak as theirs has a ray or two of sunshine in it, whether they're sucking down their fill of soup or hunting for machine parts to tinker with. For two girls in a world full of nothing, the experiences and feelings the two share give them something to live for. (From ANN)"},
"19982": {"summary": "Akira Fudo learns from his best friend, Ryo Asuka, that an ancient race of demons has returned to take back the world from humans. Ryo tells Akira that the only way to defeat the demons is to incorporate their supernatural powers, and suggests that he unite with a demon himself. Akira succeeds in transforming into Devilman, who possesses both the powers of a demon and the soul of a human. The battle of Devilman and Akira Fudo begins. (From ANN)"},
"19670": {"summary": "Ichiro Inuyashiki is down on his luck. While only 58 years old, his geriatric looks often have him written off as a pathetic old man by the world around him and he's constantly ignored and disrespected by his family despite all that he's done to support them. On top of everything else, his doctor has revealed that he has cancer and it appears that he has little time left in this world. But just when it seems things couldn't get any worse, a blinding light in the night sky strikes the earth where Ichiro stands. (From ANN)"},
"20009": {"summary": "Quiet but capable, Mizusawa Chisato is a beautiful leader who has a secret that only her husband, Sora, knows about: she loves to drink, and when she's drunk, she becomes extremely adorable! What bliss will Sora's cocktail bring tonight? (From aniDB)"},
"19669": {"summary": "Maika gets a job at a cafe where all the waitresses are given certain attributes - such as \"tsundere\" or \"little sister\" - to embody while serving customers. The manager asks Maika to be the \"Do S\" (extreme sadist) waitress, so she will have to adopt a dominant and aggressive persona. (From ANN)"},
"19592": {"summary": "Itsuki is a novelist and \"modern day Pygmalion\" who works day in and day out to create the ultimate younger sister. He's surrounded by various other characters: a beautiful genius writer who loves him, his big-sisterly classmate from college, a fellow male writer, a sadistic tax accountant, and his editor. They're all looked after by Itsuki's perfect younger step-brother, Chihiro, who has a serious secret. (From ANN)"},
"19812": {"summary": "Kokohana-tei is a hot spring hotel located in an inn town between our world and the other world, where many people go to visit. The story portrays the lives of fox spirits, who take the form of girls and work at the hotel. (From ANN)"},
"19980": {"summary": "30-year-old Moriko is single and recently became a NEET after quitting her corporate job. Tired of the real world, she decides to reinvent herself as a handsome male character on the internet. (From ANN)"},
"19997": {"summary": "\"The world is not beautiful, therefore it is.\" A story about Kino, who travels around the world with nothing but her guns for protection and talking motorcycle Hermes. Kino travels to many mystical worlds, each with its unique customs and people, and learns about the world through their stories, at times conjuring humor and inspiration or other times piercing cynicism. However, Kino has her own custom, to stay no longer than three days in every town without exception, as it is enough time to learn almost everything important about the place while still leaving time to explore new lands. (From ANN)"},
"18695": {"summary": "On the screw-shaped island country of Nejigajima, two \"Bokyabots\" Hebotto and the Yurui Prince Nejiru collect different \"Bokya Neji\" screws. When the Bokyabots wear the Bokya Neji screws on their heads, they're able to compete in \"Bokya Battles,\" battles for who can think up and tell the best jokes. (From ANN)"},
"15693": {"summary": "Usagi Tsukino was a normal second-year middle school girl whose own life changes one day when she encounters a black cat. The cat's name is Luna who can talk and bears a cresent moon on her forehead. Luna tells Usagi that she is the chosen guardian of justice with the power to transform into Sailor Moon. Usagi now has a new responsiblity which is a mission to find the Illusionary Silver Crystal as well as the other chosen guardians to protect the Moon Princess. During her mission, she must deal with various enemies sent by Queen Beryl who is also after the Illusionary Silver Crystal. (From ANN)"},
"17890": {"summary": "Rokuro is from a family of exorcists who remove the evil Kegare, but his real dream is to be a singer, a soccer player, or anything other than an exorcist. When another exorcist name Benio arrives, Rokura is suddenly inflamed with competitive spirit and decides to put his natural knack to good use. Their rivalry gets more complicated when they both learn they are the destined \"Twin Star Exorcists,\" two ultimate fighters fated to marry and create the prophesied child who will eliminate all the Kegare in the world. (From ANN)"},
"18869": {"summary": "Ai, Mai, and Mi are high school girls of a manga club. They fought off alien invaders as well as rivals in tournaments, yet only Ai actually does all the artwork. (From ANN)"},
"19987": {"summary": "In a world powered by advanced technology, crime and action unfold in the archipelagic nation of Cremona. Koku, the protagonist. Keith, the legendary investigator of the royal police force RIS. A mysterious criminal organization. A wide variety of characters race through the fortified city as it is beset by the serial killer, Killer B, and a chain of crimes. (From ANN)"},
"18791": {"summary": "High schooler Morina Nanase starts work at Trattoria Festa, an Italian restaurant filled with various and sundry quirky characters, and where through its unique cuisine, she will begin to mature as a person. (From ANN)"},
"19989": {"summary": "In Japan in the year 2035, an accident known as the \"Burst\" occurs during a research project, spawning an out-of-control artificial life form called \"Matter\" that has spread throughout the Kurobe Gorge. The research city that was once hailed as the hope for humanity is cordoned off by the government. Two years later, 15-year-old Aiko Tachibana, who lost her family in the Burst, learns something unbelievable from Yuya Kanzaki, a new student at her school. A secret is hidden within her body, and the answer to the puzzle lies at the \"Primary Point\" that was the center of the Burst. Aiko resolves to infiltrate the restricted area, escorted by a team of divers and with Yuya as her guide. (From ANN)"},
"19984": {"summary": "Gai was born beside a woman who met her death in a forest. He was adopted by the swordsmith Amon. A few years later, Gai becomes Amon's apprentice, and during the forging of a sword, he loses his right arm. To help him, Amon crushes the demon sword Shiryu (lit. Death Dragon) to form it into Gai's replacement right arm. Gai then is able to fuse with the weapon on his arm, and fights against his enemies. (From ANN)"},
"21243": {"summary": "The battle with Zsoltgewinn ends calamitously, with Ichijo turning into a Busoma and Gai being forced to fulfill a promise that has serious consequences for him. Meanwhile, other threats are afoot as Marcus loses control over a matter of love, Kagami schemes to rescue her father even at the cost of crossing the Shoshidai, Shin starts to take an interest in Sayaka, Shin's sister endures her own perils, and Princess Himiko starts making moves of her own. A bullied youth also gets help from an unlikely source, while a certain hairdresser just can't seem to shake the attentions of a certain portly hammer-wielder. Behind it all, a couple of key schemers, one human and one Busoma, make their ultimate moves. (From ANN)"},
"16104": {"summary": "The year is Regild Century (R.C.) 1014. A millennium has past since the catastrophic end of the Universal Century era. Mankind has rebuilt itself and, through the lessons learned from the previous era, managed to sustain a long lasting peace. However conflict has once again arisen, resulting from disagreements regarding the world's only space orbital elevator, the Capital Tower, and its role as the sole means by which nations on Earth obtain energy. During a routine training session while ascending the Capital Tower, Capital Guard pilot cadet Bellri Zenam, tasked with protection of the Tower, fights off an attacking space pirate, Aida Rayhunton, and helps capture her mobile suit, the G-Self. Strangely, Bellri finds out that he is one of the only three individuals to be able to pilot this mysterious mobile suit. Seemingly chosen by the G-Self, Bellri is thus drawn into a brewing conflict that will have consequences for the entire world. (From ANN)"},
"19996": {"summary": "Programmer Ichirou Suzuki is transported to another world. In a foreign land, he finds that life is an adventure that's sometimes fun, sometimes serious, and full of girls. (From ANN)"},
"20205": {"summary": "In order to save her brother and nephew who have been kidnapped by a mysterious religious group known as the Genuine Love Society, Juri and her family cast a spell using a stone hidden by her grandfather to enter the world of stopped time known as Stasis. However, when they infiltrate the kidnapper's base, they're met by other people who can also move about freely. (From ANN)"},
"20213": {"summary": "Mediocre college student Yuuya Nomoto encounters a mysterious girl named Hitomi. At an abandoned waste facility, Yuuya is shocked to see her transform into a beast and battle a lion monster. These strange people are \"Brutes,\" fighters that combine the brains of humans and the fangs of beasts. Hitomi has the strongest fighting instinct, called \"Rattle.\" These \"Killing Bites\" battles have been the decisive turning points in the Japanese economy since ancient times, and Hitomi is the latest to be swallowed up in the fierce skirmishes. (From ANN)"},
"20394": {"summary": "Michiru Amazuki is a 20-year-old woman who moves to Tokyo for a new job. She moves into Stella House, a share house for women. Her housemates all have widely different jobs and ages, but as long as they have alcohol and delicious food, everything turns out fine. (From ANN)"},
"20012": {"summary": "As Kokonotsu continues on his path to become a manga artist, Hotaru refuses to give up on bringing him to the side of Japanese snack foods. With new faces and new tasty treats to try, Kokonotsu might be swayed to take over his father's sweet shop or finally move on from this small town and follow his manga dreams. (From ANN)"},
"20186": {"summary": "While Hakumei is cheerful, outgoing and prefers to be outside, Mikochi is more introverted and prefers to stay indoors. These differences will set the tone for their friendship. Riding on insects and birds, creating tools from the forest and living their normal lives, day to day chores can be the biggest adventure in a small world full of wonders. (From ANN)"},
"19828": {"summary": "Mari Tamaki is in her second year of high school and wants to start something. It's then that she meets Shirase, a girl with few friends who's considered weirdo by the rest of the class and nicknamed \"Antarctic\" since it's all she ever talks about. Unlike her peers, Mari is moved by Shirase's dedication and decides that even though it's unlikely that high school girls will ever go to Antarctica, she's going to try to go with Shirase. (From ANN)"},
"19398": {"summary": "Fashionable Yuzu imagined the first day at her new school she transferred to after her mother's remarriage a bit differently; she didn't know it'd be an ultra-strict and conservative girls' school. So instead of a sweet high-school romance, she butts heads with the stern student council president Mei - who turns out to be her new stepsister. And she has to learn that hate and attraction are often not that far apart. (From ANN)"},
"19975": {"summary": "Hazuki Kagimura is a normal girl who is usually alone. Her relationship with her new family is not going so well, so she retreats every day to the world of stories and books. One day, after school, one of the library's bookshelves sends her to another world with a magic school, where she meets Shizuka Tsuchimikado. She finds out that girls (called \"maedchen\") who attend the school are selected by old fairy tales and folk stories to wield their magic, and are taught how to wield it in the school. The school has girls who are chosen by such stories as Kaguya-hime no Monogatari, Issun-boushi, Der Freischutz, Shuten-douji, The Little Matchstick Girl, The Gigantic Turnip, Arthurian legends, and The Ramayana. Hazuki herself is chosen by the Cinderella story. She begins her new life at the school to become a magic user, and be friends with Shizuka. (From ANN)"},
"19675": {"summary": "Koizumi is a high school girl who looks like a cool beauty at first glance, but actually has an unexpected side of her that loves ramen. (From ANN)"},
"20397": {"summary": "Since appearing in another world, Ains has sent out daily commands as the ruler of the Great Tomb of Nazarick. He also maintains his alter-ego Momon, the strongest adventurer in E-Rantel, to gather funds and keep an ear to the ground. He sets out on quests considered suitable for a adamantite class adventurer, like defeating the Gigant Basilisk. Meanwhile, Ains returns to Nazarick and asks Albedo for a full status report. (From ANN)"},
"18115": {"summary": "Young female ninja Chidori dreams of helping the Warring States-era warlord Oda Nobunaga to achieve his goals. (From ANN)"},
"19927": {"summary": "The year is 1555, the middle of the Warring States period, and one young man holds on to a very big dream. That young man, known as an empty-headed fool, is none other than Oda Nobunaga. Enchanted by his dream, a certain young girl who admires Nobunaga swears that she will become his ninja one day. Nobunaga has one goal: to unify Japan by military might! Decorated by a colorful cast of characters, including the airheaded Kichou, the errand boy Hideyoshi, the tsundere Nene, the straight man Mitsuhide, and the half-dead Hanbei, this heavy-hitting wartime gag anime is about to begin!! (From aniDB)"},
"19762": {"summary": "Chise Hatori is 15-year-old orphan. She has no relatives, means, or hopes when a demonic sorcerer who can't become human buys her. He states that Chise will now be his apprentice and bride. (From ANN)"},
"18681": {"summary": "Yuzuka continues to experiment with her magical girl powers while spending time with her friend Chiya. (From ANN)"},
"20010": {"summary": "Rin enjoys camping by the lakeshore, Mt. Fuji in view. Nadeshiko rides her bike to see Mt. Fuji, too. As the two eat cup noodles together, they behold the beautiful scenery around them. (From ANN)"},
"21204": {"summary": "Kageyama is an ordinary 8th grader who just wants to live a normal life. Although he can disappear in the crowd in a flash, he was actually the most powerful psychic. The lives of those around Mob and his numerous feelings that softly piles up for the eventual explosion. The mysterious group \"Claw\" stands before him once again. In the midst of his youthful days, where will his roaring heart take him!? (From aniDB)"},
"20514": {"summary": "Karen Kohiruimaki is a 183-centimeter-tall (6-foot-tall) college student who's insecure her height, and is bad at dealing with people in the real world. She enters the world of Gun Gale Online with her avatar, Llenn, who is less than 150 centimeters (5 feet) tall and wears all pink. She meets a beautiful, brown-skinned female player who goes by Pitohui. They hit it off, but one day Pitohui pressures her to participate in \"Squad Jam,\" a team Battle Royale variation of the Bullet of Bullets tournament. (From ANN)"},
"20565": {"summary": "In the not too distant future, boxing has become a sport enhanced by \"Gear\", machine exoskeletons worn over the shoulders and arms to allow boxers to punch farther and harder than before. Known as \"Megalobox\", the sport is popular as both a regular sporting event and as one during which underground bets are laid, with dramatic differences between the fanbases. Junk Dog, a young Megaloboxer, is struggling both to make a name for himself in the underground fights as well as with whether he's really happy with his current situation. When he hears that the upscale Shirato Group is sponsoring a worldwide Megaloboxing tournament in a special arena, he's largely ambivalent, seeing it as both not worth it and beyond his grasp. But he's getting tired of the rigged fights he's forced to participate in. Then he encounters Yuri, the reigning champ of the sport, and might change his mind. (From ANN)"},
"20225": {"summary": "Mitsuyoshi Tada, a boy who has never known love, is taking pictures of the cherry blossoms in full bloom when he meets Teresa Wagner, a transfer student from Larsenburg. Upon arriving in Japan, she got lost, and separated from her travel companion. Mitsuyoshi helps her and brings her to his grandfather's coffee shop. (From ANN)"},
"19850": {"summary": "In the distant future the land is ruined and humanity establishes the mobile fort city Plantation. Pilots produced inside Plantation live in Mistilteinn, also know as the \"birdcage.\" Children live there knowing nothing of the outside world or the freedom of the sky. Their lives consist of battling to carry out missions. Their enemies are mysterious giant lifeforms known as Kyouryuu, and the children pilot robots called Franxx to face off against them. For the children, riding the Franxx proves their existence. A boy named Hiro is called Code:016, and he was once known as a prodigy. However, he has fallen behind, and his existence seems unnecessary. Not piloting a Franxx is the same as ceasing to exist. One day, a mysterious girl known as \"Zero Two\" appears before him. Two horns grow out of her head (From ANN)"},
"20048": {"summary": "15-year-old high school student and manga creator Kaoruko Moeta uses the pen name Chaos. After ranking at the bottom of a reader survey, Kaoruko's editor recommends that she enter an all-female dormitory for manga creators. Kaoruko's roommates are shoujo manga creator Koyume Koizuka, teen romance manga creator Ruki Irokawa, and shounen manga creator Tsubasa Katsuki. The girls support each other as they work to become better manga creators. (From ANN)"},
"20424": {"summary": "After moving back to her hometown, Natsuno Hanabi is ready to start high school and excited to be living in Tachibana Mansion, a luxurious mansion-style dormitory. However, due to some complications, she winds up at run-down but lively Tachibana House and finds herself stuck between her childhood friend and a mysterious beauty. (From ANN)"},
"18900": {"summary": "Blood Blockade Battlefront centers around the crime fighting organization \"Libra\" and their battles in Hellsalem's Lot, formerly known as New York City. Hellsalem's Lot was created when a portal to the \"Beyond\" opened, becoming a paranormal melting pot of monsters, magic and the everyday mundane life, and it is up to Libra to clear the streets of trouble and prevent the horrors of this city from spreading to the outside world. (From aniDB)"},
"20190": {"summary": "This season continues the course of the second interhigh bycicle race were the past season lefted, the second third of the first day to the end of the second day and the start of the third day. the competition is fierce and nobody want to lose. neither sohoku, kyoto fushimi nor hakone gakuen admits the defeat yet. (From ANN)"},
"20122": {"summary": "A group of aspiring idols gather at Takanashi Productions and are entrusted with the company's future. The seven men who have just met represent a variety of totally different personalities. However, they each have their own charm and possess unknown potential as idols. Forming a group, they take their first step together as \"IDOLiSH7.\" Their brilliantly shining dancing forms onstage eventually begin captivating the hearts of the people. (From ANN)"},
"20043": {"summary": "In prosperous Russell City, a conspiracy threatens to shake its world has been set in motion. A man named Sword is the first to hear the earliest stirrings of the plot, and throws himself into a shadow war in order to expose it. His only clue is the keyword \"El Dorado.\" He meets Sophie, a woman searching for her older brother who left her with only a message with the same word: \"El Dorado.\" With Sword having also lost his younger sister in the past, both are drawn together by the word, and work together to find out its meaning. (From ANN)"},
"20505": {"summary": "The cheerful orange tabby cat Tapio Chatorazawa and the pessimistic Russian blue Kuehiko Roshihara live like people in an anthropomorphic world. The two study in the same college, and also work together on various odd jobs. (From ANN)"},
"20226": {"summary": "17-year-old high school student Akira Tachibana is a girl who barely expresses herself. She harbors a secret crush on Masami Kondou, the 45-year-old manager of the family restaurant she works at part-time. (From ANN)"},
"20462": {"summary": "Micchiri Neko is a cat-like creature who always sticks with each other wherever they go! (From ANN)"},
"20679": {"summary": "Subaru Ichinose is the ace pilot of the space battleship \"Tiramisu.\" Since he cannot get used to being surrounded by older pilots, Subaru shuts himself in the cockpit of his personal ship \"Durandal.\" (From ANN)"},
"20598": {"summary": "In a world very much like our own, great race horses of the past have a chance to be reborn as \"horse girls\" - girls with the ears and tails of horses as well as their speed and endurance. The best of these horse girls go to train at Tokyo's Tracen Academy, hopefully moving on to fame and fortune as both racers and idols. Special Week, a high school horse girl from the countryside, has just transferred to Tracen, and she's determined to fulfill her promise to her mother to become the best horse girl in Japan. On her way to school, she takes a pit stop at the race track and instantly falls in love with Silence Suzuka's style, becoming determined to race on the same team as her. (From ANN)"},
"20709": {"summary": "Iori Kitahara is a college student living along in a coastal city who meets scuba-diving and fun-loving upperclassmen. (From ANN)"},
"20613": {"summary": "Nagisa Aragaki is the strict captain of the badminton club at Kitokomachi High School. After a crushing defeat in a tournament, Nagisa trains harder than ever; now fueled by her anger, torment, and fear that all her effort has been in vain. The arrival of two people at Kitokomachi change everything: Kentaro Tachibana and Hanesaki Ayano. Kentaro, who had been selected to participate in the Olympics in the past, becomes the new coach. Hanesaki is the daughter of Uchika Shindo, one of the legends of badminton in Japan. Ayano also happens to be the girl who merciless beat Nagisa in the tournament six months ago. (From ANN)"},
"21105": {"summary": "With his foundations now set in this new world, the first steps of Ains Ooal Gown's master plan apparent begin to come to fruition. The value of Carne village and especially the political value of his alter ego Momon are reaffirmed; the \"hidden\" genius of his actions is continuously met with shock and awe by Demiurge, Albedo, the rest of his guardians, and even Ains himself at his \"great wisdom\". His attempts to act in a way befitting the ruler of Nazarick, continuing to further cement his guardian's loyalty, push him ever further down the path of not-so-intentional world domination. Without human conscience due to being undead, he is motivated only to continue searching for other players from Yggdrasil and to gain power to better protect the children and home of him and his forty former companions. Lord Ains Ooal Gown maintains his mantle of Overlord and leads the Great Tomb of Nazarick unto the world stage, directly into a vicious power struggle between two great empires. (From ANN)"},
"20787": {"summary": "Beautiful high school girl Satou Matsuzaka believes she has finally found the meaning of love when she begins living with a younger girl. Previously, Satou never refused the advances of any guy around her, but that changes when she meets the girl Shio. The background and age of the mysterious girl are unclear. When Satou is with Shio, she experiences a very sweet feeling, which she understands as love. In order to protect that feeling, Satou is willing to do anything, even if it means committing murder. (From ANN)"},
"21104": {"summary": "Calico Tapio Chatorazawa, who's got more energy than anyone, Russian Blue Kuehiko Roshihara's a bit of a sourpuss. These two classmates will do all kinds of different jobs to learn how fun and hard it is to work! (From aniDB)"},
"20446": {"summary": "A few months have passed since the members of the Future Gadgets Lab inadvertently unlocked the power of time travel using a phone and an old microwave, but for Rintaro Okabe it may as well have been an eternity. While his friends' memories remain mostly hazy, Okabe can still clearly recall crossing over hundreds of world lines, watching as his friends suffered and died innumerable times for meddling with the fabric of the universe. Though he ended up saving the life of his best friend Mayuri, Okabe is still suffering from the trauma of being unable to prevent the murder of the brilliant young scientist Kurisu Makise. He has focused on forgetting the past and moving on with his life, but he is constantly reminded by future freedom fighter Suzuha that their current world-line is set to be torn apart by a devastating Third World War, and all of the Future Gadget Lab members will be caught up in the struggle. Okabe must decide whether he will once again fight the future one final time. (From ANN)"},
"20583": {"summary": "Three classmates play simple hand games. One of the girls is good at games, but hates them as she always lost to her older sister and forced to do chores while growing up. Another girl is of American descent, but raised in Japan, and who only pretends to be bad at Japanese. Another girl usually observes their games, and loses to the other girls. (From ANN)"},
"16441": {"summary": "The manga's story centers on the psychologist Ryou and his nurse Asuna. The pair explain aspects of mental illness through a series of loosely connected cases that usually conclude in one manga chapter. With a light-hearted tone, the doctor helps readers understand conditions such as depression, adjustment disorder, and Asperger syndrome. (From aniDB)"},
"19819": {"summary": "Eren and his companions in the 104th are assigned to the newly-formed Levi Squad, whose assignment is to keep Eren and Historia safe given Eren's newly-discovered power and Historia's knowledge and pedigree. Levi and Erwin have good reason to be concerned, because the priest of the Church that Hange had hidden away was found tortured to death, making it clear that the Military Police are involved with the cover-up. Things get more harrowing when the MPs make a move on Erwin and the Levi Squad narrowly avoids capture. Eren is also having problems with his Titan transformation, and a deadly killer has been hired to secure Eren and Historia, one Levi knows all too well from his youth. (From ANN)"},
"20564": {"summary": "The world is a dangerous place for a red blood cell just trying to get her deliveries finished. Fortunately, she's not alone... she's got a whole human body's worth of cells ready to help out. The mysterious white blood cell, the buff and brash killer T cell, the nerdy neuron, even the cute little platelets -- everyone's got to come together if they want to keep you healthy. (From ANN)"},
"20287": {"summary": "Popuko and Pipimi are a pair of foul mouthed girls ready to take on every pop culture reference ever made. Pop Team Epic follows the pair through a series of surreal skits and short stories full of internet, movie, video game, and self-referential based comedy. (From ANN)"},
"20241": {"summary": "A female college student named Aoi inherits the ability to see spirits from her late grandfather. Aoi prides herself on her cooking, and one day she's feeding some agricultural spirits when suddenly a god and the master of the \"Tenshinya\" (Heavenly Inn) appears and takes Aoi away. He says that due to her grandfather's debts, she must become his bride. Aoi hates this idea and instead declares that she will pay back her grandfather's debt by working at the Tenshinya. (From ANN)"},
"16634": {"summary": "High school student Eruna Ichinomiya enters the Mikagura Academy dreaming of a boarding school life filled with beauty. However, Eruna finds out that in the culture clubs, there is a rule that battles that are fought with special powers decide a club representative's treatment. Through various circumstances, Eruna becomes a representative of a club, and is thrown into the fray. (From ANN)"},
"19872": {"summary": "A teenage boy named Yaichi Kuzuryuu happens to be the strongest shogi player in history, holding the top title of \"Ryuo\" (Dragon King). One fateful day, shogi-loving elementary student, Ai Hinatsuru, appears before him claiming that he promised to be her master. (From ANN)"},
"20735": {"summary": "Yuuto Suoh gets more than he bargained for when he joins his childhood friend Mitsuki Shimoya in testing out an urban legend, When he uses his phone to take a picture of himself with the local shrine's divine mirror, he is whisked off into another world - one heavily steeped in the lore of the old Norse myths. Using his knowledge gained from school and from his solar-powered smartphone, he has the chance to bring the Wolf Clan, the same people who cared for him, to prominence, all while earning the adoration of a group of magic-wielding warrior maidens known as the Einherjar. (From ANN)"},
"20356": {"summary": "In a world where superpowers known as \"Quirks\" grant great power to their bearers, Midoriya has risen from being a Quirkless young boy to a resilient hero-in-training, working alongside his peers at U.A. High School in hopes of one day becoming a true superhero. Having clashed with actual villains like Shigaraki and his League of Villains, Midoriya understands the fragility of his world and the speed with which he must rise to defend it. In the wake of his recent encounter with Shigaraki, Midoriya and his fellow 1-A classmates will now be forced to undergo summer training, all to prepare them for the day when their guardians' protection isn't enough. But the League of Villains is also preparing, and the repercussions of their next strike will shake this peaceful society to its core. (From ANN)"},
"20582": {"summary": "In the MMORPG Cross Reverie, Takuma Sakamoto is so powerful that he is lauded as the \"Demon Lord\" by other players. One day, he is summoned to a world outside his own, but with the same appearance he had in the game. There, he meets two girls who both proclaim themselves to be his Summoner. They perform an Enslavement Ritual to turn him into their Summon, but that's when Takuma's passive ability Magic Reflection activates. Instead, it is the girls who become enslaved. Though Takuma may be the strongest Sorcerer there is, he has no idea how to talk with other people. It is here he makes his choice: to act based on his persona from the game. (From ANN)"},
"18175": {"summary": "Urashima is an island far from the mainland. The people who live there lead carefree lives. But five years ago, the island's three great families suffered a series of misfortunes, and succumbed to suspicion. The people of the island cut off all contact with the mainland, and began a slow decline. One day, a young man named Setsuna washes ashore claiming to be a time-traveler and suffering from amnesia. He meets three local girls: Sara, Rinne, and Karen. Their meeting will change the course of the island's fate. (From ANN)"},
"14419": {"summary": "Shizuku Mizutani has learned to deal with life's disappointments by repressing her emotions and trusting no one but herself. She has only one focus and that is academic achievement. Haru Yoshida throws himself at life with every ounce of emotional power he has which would not necessarily be a problem except he deals with deep seated rage issues. He has seriously hurt several students over the years and consequently everyone is afraid of him. Shizuku sees no point in engaging the world around her and Haru doesn't know how to engage the world around him. All that begins to change when the two first meet and find themselves almost immediately attracted to each other. Their unlikely pairing leads both of them to begin to break out of their lonely, little worlds to see what life really has to offer. (From ANN)"},
"21115": {"summary": "A skeleton named Honda works in a bookstore. Hilarity ensues daily in his work at the shop's manga counter. (From ANN)"},
"20811": {"summary": "In the city state of Lisvalletta, the citizens live peaceful lives by day while crime and illegal drugs permeate the area at night. A highly lethal drug \"Anthem\" has taken hold and the SEVEN-O Special Crime Investigation Unit is tasked with stopping it. Members of the unit operate in groups of two called the \"Double Decker System\". Doug Billingham is a seasoned investigator, and joining him is Kirill Vrubel, whose abilities are mysterious and unknown. (From ANN)"},
"20794": {"summary": "In Nagasaki, a descendant of mages, 17-year-old Hitomi lost her sense of color at a young age and grew up lacking emotion. Her grandmother Kohaku, a great mage, sends Hitomi to the past, to the year 2018. There, she spends time with a 17-year-old Kohaku and friends from club activities. (From ANN)"},
"20848": {"summary": "There's a rumor about a mysterious phenomenon call \"puberty syndrome\". For example, Sakuta Azusagawa is a high school student who suddenly sees a bunny girl appear in front of him. The girl is Mai Sakurajima, Sakuta's upperclassman and also a famous actress who has gone on hiatus from the entertainment industry. For some reason, the people around Mai cannot see her bunny-girl figure. Sakuta sets out to solve this mystery, and as he spends time with Mai, he learns her secret feelings. Other heroines who have \"puberty syndrome\" start to appear in front of Sakuta. (From ANN)"},
"21013": {"summary": "At Dahlia Academy, a prestigious boarding school attended by students of two feuding countries - the eastern Nation of Touwa, and the Principality of West - Romio Inuzuka, leader of the dorms' Touwa first-years, wishes for a romance that can never be. For his ladylove is none other than his arch-enemy, Juliet Persia, leader of the dorms' West first-years. (From ANN)"},
"21363": {"summary": "A typical morning. The usual music. Their normal lives. The peace these seven girls experience will suddenly be destroyed. By the living dead... zombies. A reality that they never wanted a part of, an amazing and terrifying zombie world. They all share one wish: \"We want to live\". These girls will struggle through this saga, in order to achieve a miracle. (From aniDB)"},
"16154": {"summary": "King Il of Kouka, a land said in legends to have been founded by four dragons, has only one remaining heir, a daughter named Yona. She lives a happy life in the palace with her cousin Soo-won, who she loves in spite of her father's opposition to them marrying. Her life is turned upside down when Soo-won murders her father and steals the throne. Yona, with her childhood friend and bodyguard Hak, must retreat to gather allies and reclaim her place as ruler of the kingdom. (From ANN)"},
"20369": {"summary": "Yuta Hibiki awakens with amnesia and the ability see things that others cannot. He first encounters a Gridman in the reflection of his friend Rikka Takarada's computer and it tells him to \"Remember his calling\", but Yuta doesn't understand what this means. Later, in the distance, he sees an extremely large monster but it doesn't move. It's only when Yuta gets to school that the two sightings make sense: a monster attacks and the hero Yuta saw in the computer screen pulls him within the computer and transforms Yuta into a giant hero named Gridman. (From ANN)"},
"20595": {"summary": "A lone high school girl named Momo attends a high school in the city of Sorasaki. Unbeknownst to everyone, Momo is an agent who works for the private intelligence agency Tsukikage, that protects the city and its people. Under the tutelage of her senior Yuki, and her other friends, they keep the peace in the city. (From ANN)"},
"21409": {"summary": "Five girls and one cat are all living as housemates in Nakano, Tokyo: the three Himote sisters (Tokiyo, Kinami, and Kokoro) whose family manages the \"Himote House\", Kokoro's classmates Tae and Minamo, and the cat Enishi. The girls live their daily lives trying to figure out ways to be popular, and they (and the cat) all possess a mysterious secret power. (From ANN)"},
"20845": {"summary": "Misha is a little girl who lost her mother at an early age, and now lives with her father. Her father employs a maid named Tsubame, who was a former Self-Defense Force official, and is also a lolicon. (From ANN)"},
"21135": {"summary": "Due to a strange incident, Akari Amano is rescued by a vampire girl named Sophie Twilight, and Akari becomes interested in her. (From ANN)"},
"20672": {"summary": "A young priestess has formed her first adventuring party, but almost immediately they find themselves in distress. It's the Goblin Slayer who comes to their rescue--a man who's dedicated his life to the extermination of all goblins, by any means necessary. And when rumors of his feats begin to circulate, there's no telling who might come calling next. (From ANN)"},
"16428": {"summary": "Number of wars occurred in order to make Japan a peaceful country but no warlords successfully achieved this objective, until Hideyoshi Toyotomi reigned. He created unity across Japan. But his death led to chaos. His son, Hideyori is supposed to succeed the throne but the Tokugawa clan believes that he can't. And so, the conflict between the Toyotomi and Tokugawa clan arises, also between the two brothers in the Sanada clan, Yukimura who sided in the Toyotomi clan and Nobuyuki Sanada who joined Tokugawa. A fateful battle awaits the two. (From ANN)"},
"20853": {"summary": "Suzuka Nagami is a beautiful third-year middle school student who has excellent grades and is the student council president. She wrote a novel about a little sister who dotes on her older brother, and the the novel wins a light novel award. After they discuss the matter, her older brother Yuu is the one who debuts as a proxy light novel author instead of Suzuka, under the pen name Chikai Towano. (From ANN)"},
"20850": {"summary": "There was once a legendary party named Subaru in the globally popular MMORPG Union. The group was made of elementary school friends. They earned fame in the blink of an eye for their unparalleled abilities in the Sense system at the core of the game. However, there was an incident where a player passed away inside the game. As a result of the death, Union ended service. Six years pass. Haruto Amou, who was a key member of Subaru, has become a hopeless high school student. His personality has changed, and he has no friends or ambition. A classmate gets him to log in to the new Re'Union game, and he ends up having a \"reunion\" that is hard to believe. He meets his former in-game partner and real-world childhood friend Asahi Kuga. The girl who was supposed to have died six years ago was there. (From ANN)"},
"20478": {"summary": "Narumi, a female office worker who hides her fujoshi lifestyle, and Hirotaka, a handsome and capable company man who is a game otaku. The two seem perfect for each other, but love is difficult for a nerd. (From ANN)"},
"21239": {"summary": "Yuu has always loved shoujo manga and awaits the day she gets a love confession that sends her heart aflutter with bubbles and blushes, and yet when a junior high classmate confesses his feelings to her, she feels nothing. Disappointed and confused, Yuu enters high school still unsure how to respond. That's when Yuu sees the beautiful student council president Nanami turn down a suitor with such maturity that she's inspired to ask her for help. But then the next person to confess to Yuu is Nanami herself. (From ANN)"},
"20447": {"summary": "Kogarashi, a high school boy cursed with misfortune to see ghosts since birth, finds a haunted inn offering rent-free room to anyone able to exorcise a ghost. When the ghost turns out to be an innocent young girl, Kogarashi decides to help her move on rather than purify her. While he works on that, Kogarashi is pulled into the paranormal hijinks of the other residents of the inn and even his new schoolmates. (From ANN)"},
"20317": {"summary": "Hikari Tsutsui is a high school boy who is satisfied with the virtual girls he encounters in anime and games. He does not have many friends and he lives in his own world. One day, when he is stuck on pool cleaning duty, he is approached by Iroha, a \"real girl\" who is showy and popular with boys. (From ANN)"},
"21480": {"summary": "The popular Iroha Igarashi and reclusive Hikari Tsutsui continue to navigate the tumultuous waters of young love and what it means to be true to yourself. As their relationship grows and deepens, new and difficult challenges threaten to break them apart. While they are committed to overcoming everything that comes their way as a couple, somethings may be too much for them to conquer. (From ANN)"},
"20665": {"summary": "Kirito awakens in a vast, fantastical forest filled with towering trees. In his search for clues to the truth of his surroundings, he encounters a young boy who seems to know him. He ought to be a simple NPC, but the depth of his emotions seem no different than a human. As they search for the boy's parents, Kirito finds a peculiar memory returning to him. A memory from his own childhood, of this boy and a girl, too, with golden hair, and a name he should have never forgotten - Alice. (From aniDB)"},
"18662": {"summary": "Two third-year middle school girls, Sumire and Meguri, fight evil as Twin Angels under orders from a hedgehog named Miruku-chan. The girls disagree, but as they work together, little by little they become friendlier with each other. (From ANN)"},
"19054": {"summary": "Yuma and Hotaru have been friends since childhood. It is only natural that when Yuma is nervous about her new boyfriend, she asks Hotaru and her boyfriend along for a double date. But when Hotaru offers herself to Yuma as \"practice\", both girls realize that they're more interested in each other than they are in their own boyfriends. (From ANN)"},
"19749": {"summary": "Nora Handa is a high school boy who meets a girl named Patricia in a park who claims to be a princess of the underworld. Patricia and Nora accidentally kiss, and this act turns Nora into a black cat. Patricia takes Nora to her home, and a few days later Nora turns back into a human. However, Nora keeps turning into a cat and back into a human. (From ANN)"},
"19376": {"summary": "In the year 2045, the world has been contaminated by Irousu (mysterious invaders who suddenly appeared), and humans find themselves restricted and contained. Standing boldly against these invaders are ordinary girls everywhere, without a powerful army or even weapons. The Shinjugamine Girls Academy is a school for these \"Hoshimori\" (Star Guardians) destined to fight the Irousu. (From ANN)"},
"17693": {"summary": "After young man Atsushi Nakajima saves a man from his wish of suicide, he and his friends join the \"Arms Detective Company\", a league of literary figures that also harness special powers. (From ANN)"},
"18709": {"summary": "Guild has entered Yokohoma city. Along with the city, they want Atsushi of The Armed Detective Agency too. As Port Mafia want the city for themselves, a three way war seems unavoidable. While fighting, Atsushi & Akutagawa find help in strange places. And in the background, Dazai continues his endless scheming. (From ANN)"},
"21733": {"summary": "The White Tiger and the Black Beast - Atsushi Nakagawa and Ryunosuke Akutagawa's fight against Francis F. brings an end to the great war against the Guild. Life goes on as normal in Yokoyama, thanks to the continued truce between the Armed Detective Agency and the Port Mafia, who, together, saved the city from ruin. But there are still rumors of Guild stragglers and other crime organizations making their way in from abroad. Meanwhile, Osamu Dazai had premonitions of another impending disaster. Lurking in the darkness is the Fyodor D., leader of pirate organization Rats in the House of the Dead, his dreadful plans on the verge of execution. (From ANN)"},
"19665": {"summary": "A certain point in time, in the continent of Telesis. The great war which divided the continent into North and South has ended after four years, and the people are welcoming a new generation. Violet Evergarden, a young girl formerly known as \"the weapon\", has left the battlefield to start a new life at CH Postal Service. There, she is deeply moved by the work of \"Auto Memories Dolls\", who carry people's thoughts and convert them into words. Violet begins her journey as an Auto Memories Doll, and comes face to face with various people's emotions and differing shapes of love. There are words Violet heard on the battlefield, which she cannot forget. These words were given to her by someone she holds dear, more than anyone else. She does not yet know their meaning but she searches to find it. (From ANN)"},
"21114": {"summary": "Miyako Hoshino is a shy college student and otaku. Miyako's younger sister Hinata, who is a fifth grader, has a classmate and friend named Hana. When they meet, Miyako falls for Hana at first sight. (From ANN)"},
"21270": {"summary": "Subaru Mikazuki, a mystery author who lost both parents in an accident, loves reading and has always hated leaving the house, he finds interacting with people an annoyance because they intrude on his imagination, and the noise of the outside world makes it hard to think. When a chance encounter with a stray cat gives him inspiration for a new novel, he brings it home with him to be his muse. In taking care of the cat, Subaru slowly finds his world becoming more broad, as more people join his life and the cat helps him remember what family is. The stray cat, just trying to survive in a harsh world, decides to follow a human home because he seems to be a good source of food. In trying to take care of and protect him she learns what it's like having a family and a home. (From ANN)"},
"20736": {"summary": "Satoru Mikami's life was pretty ordinary: at age 37, he was coasting along with a decent job but no girlfriend. That all changed when he was stabbed to death in broad daylight, and his final thoughts were translated into special abilities in his next life. Reborn in a fantasy world, Satoru now has a wide variety of skills and powers available to him, but the downside is that he's no longer human. Instead, he's become a blue slime monster, and is alone in a cave full of magical plants and minerals, or so he thinks until he runs into a giant dragon named Verudora. Satoru and Verudora soon become friends, but there's a violent world waiting for them outside the cave. (From ANN)"},
"21205": {"summary": "High schooler Natsuo is hopelessly in love with his cheerful and popular teacher, Hina. However, one day at a mixer, he meets a moody girl by the name of Rui and ends up sleeping with her. Soon after, his father announces that he's getting remarried to a woman with two daughters of her own. And who shows up in tow, other than both Hina and Rui. (From ANN)"},
"21201": {"summary": "There is an urban legend that children tell one another about a shinigami that can release people from the pain they may be suffering. This \"Angel of Death\" has a name: Boogiepop. And the legends are true. Boogiepop is real. When a rash of disappearances involving female students breaks out at Shinyo Academy, the police and faculty assume they just have a bunch of runaways on their hands. But Nagi Kirima knows better. Something mysterious and foul is afoot. (From ANN)"},
"21552": {"summary": "Emma, Norman, and Ray are the three most brilliant children the Grace Field House has produced in decades. Unlike in a typical orphanage, they, and their fellow children, eat well and are given an intensive education. However, despite living in a peaceful environment with fun games and a caring mother, there's something not quite right. When six year old Connie is \"adopted\" by foster parents, she forgets her favorite stuffed rabbit, and Emma and Norman sneak out to return it to her. When they arrive at the scene, the two realize exactly why they had always been isolated from the outside world. (From ANN)"},
"21401": {"summary": "Kaguya Shinomiya and Miyuki Shirogane are two geniuses who stand atop their prestigious academy's student council, making them the elite among elite. But it's lonely at the top and each has fallen for the other. There's just one huge problem standing in the way of lovey-dovey bliss - they're both too prideful to be the first to confess their romantic feelings and thus become the \"loser\" in the competition of love. (From ANN)"},
"11770": {"summary": "Rintaro Okabe is a self-proclaimed \"mad scientist\" who believes that an international organization is conspiring to reshape the world according to its own interests. He and his friend Itaru Hashida inadvertently create a gadget able to send messages to the past. The discovery and experimentation of this instrument become the catalyst of fundamental alterations to the present. Oblivious of the consequences of their actions, Rintaro and his friends end up creating modifications of grievous proportions. He must then try to find a way to return as close as possible to the original timeline in order to save his precious lab members. (From ANN)"},
"20759": {"summary": "Yukiya is about 14 years old. He spends his time DJ-ing alone. Due to his father's influence, he's listened to house music since he was young, and he uploads videos online. He wants to convey something to someone. He wants to be recognized, and become important. But getting hurt is scary. One day, while trying to get more views, he does something that can't be undone. And he sees a live broadcast from \"that world\". Yukiya believes he can't do anything alone, but that he could accomplish something if he were doing it together with someone else. (From ANN)"},
"21280": {"summary": "A story about three sisters struggling to survive in a desolate world surrounded by decaying buildings and red fog. The story revolves around Rin, a girl with an updo. There's also Ritsu, the big sister who has cat ears and is always calm, and Rina, the innocent, cheerful one dressed in a maid's costume. Just what is it that these sisters are after in this mysterious world? (From aniDB)"},
"15901": {"summary": "Touko Fukami's family runs a glass-working business in a small seaside town. She hangs out with her four best friends at a cafe called \"Kazemichi\". During the summer break of their senior year in high school, they meet a transfer student named Kakeru Okikura, who claims that a voice from the future talks to him, and that it's led him to Touko. His arrival sets off a series of events that will make their final summer together one full of hope and heartache. (From ANN)"},
"16027": {"summary": "In the spring when the cherry blossom petals fall, Yuu Narukami moves to Yaso Inaba to live with his uncle and cousin due to his family's circumstances. He transfers to Yasogami High School, where his event-filled school life begins. However, when serial murders begin occurring in the peaceful town, Yuu is awakened to the power of his heart turned to physical form: A Persona. Within these new mysteries is Marie, a resident of the alternate world, the Velvet Room, who has no memories of her past. Together with his friends, Yuu must solve all the riddles set in front of him and save Yaso Inaba from further violence. (From ANN)"},
"17601": {"summary": "Mysteria Academy is a prestigious magic school that teaches magic without discrimination to the three factions (men, gods, demons), who usually are engaged in battle with each other. Two of the academy's students are Anne, a princess and honor student, and Grea, a princess born from a dragon and a human. (From ANN)"},
"21226": {"summary": "Three years ago, alien invaders ravaged the Earth - until they were defeated by a group of young women blessed with powers from a mysterious source. The girls went back to their normal lives after vanquishing the ghastly monsters, but that time of peace is about to end. The same malevolent creatures have resurfaced, which means it's time for the Magical Girl Special Ops force to head back to the battlefront and defend mankind. (From ANN)"},
"21228": {"summary": "Yulia \"Yusha\" Chardiet is a young adventurer-in-training who dreams of becoming a legendary Hero and defeating a Demon Lord. The only problem is that there's no Demon Lord in the world at the moment, which means nobody can choose Hero as their adventuring class. That leaves Yusha classless for the time being, but she's getting by with help from her friends Seira the priest, Fai the warrior, and Mei the mage. Their adorable new adventuring instructor Mao has challenged the class to complete a simple dungeon, but this pint-sized teacher might just be a little more demonic than she appears. (From ANN)"},
"21248": {"summary": "Ueno is the president of the science club at a certain junior high school. She's a master inventor beyond her years but can't seem to confess to her crush Tanaka. (From ANN)"},
"21371": {"summary": "In a barren frontier where people trade goods with each other in order to help each other survive, the Kotobuki Squadron are bodyguards for hire, led by a strict but beautiful squadron leader, an unreliable commanding officer, and a true artisan of a crew chief. Alongside pilots who don't lack for personality, they take to the air in dogfights, letting the engine noise of their Hayabusa fighters ring out in the skies. (From ANN)"},
"18889": {"summary": "A P.O.V. anime where you are the protagonist. A new project in virtual anime that revolves around 3 stories that develop in your (one) room. (From ANN)"},
"20808": {"summary": "Takato Saijou has reigned as the idol industry's \"Most Huggable\" for five years, that is, until freshman actor Azumaya. Takato was always considered brusque while Azumaya's smile is winning over admirers by comparison. The whole fiasco drives Takuto to over indulge in alcohol and his actions catch the attention of the last person he wants to see. To his surprise, Azumaya uses this new info to blackmail Takuto for physical affection. (From ANN)"},
"15846": {"summary": "Izumi was born in a family of celebrities. His father is a singer, his mother and artist, his older brother the lead vocalist for the popular band Crashers. Izumi himself, however, is just a nerdy college student. He loves the manga \"Magical Girl Lala Lulu\" and dreams of becoming a manga writer himself. One day he is roped into filming a commercial where he wears a dress. Another actor on the set, Ryoma Ichijo, mistakes him for a woman and falls in love at first sight. As it turns out, though, they met ten years in the past. And Ryoma feelings don't change when he finds out Izumi is a boy. (From ANN)"},
"18459": {"summary": "The boys prepare to finally face off for the right to represent the prefecture in the volleyball national championship. Despite being known as \"The Fallen Champions\", Karasuno is determined to take down the powerhouse that is the Shiratorizawa High volleyball team. As Hinata comes closer to fulfilling his promise to defeat Ushijima's team, will the \"Flightless Crows\" finally find their wings and soar above the best school in the prefecture? (From ANN)"},
"18160": {"summary": "Spurred by the flame raging in his heart, the Black Swordsman Guts continues his seemingly endless quest for revenge. Standing in his path are heinous outlaws, delusional evil spirits, and a devout child of god.Even as it chips away at his life, Guts continues to fight his enemies, who wield repulsive and inhumane power, with nary but his body and sword - his strength as a human. (From ANN)"},
"21992": {"summary": "The button appeared out of nowhere. There weren't any signs NOT to push it...so the solution is obvious, right? Is it a trap or the start of something new and exciting? The crews of Re:Zero, Overlord, Konosuba, and The Saga of Tanya the Evil will find out when they go from their world to another and get stuck in...class?! See what adorable chaos they'll get up to in this collection of shorts! (From aniDB)"},
"21282": {"summary": "An increase in villain activity has the Hero Organization worried that the \"Earthdoom prophecy\" will soon come to pass. In an effort to alleviate the overworked heroes, they turn to villains themselves for help. The decision looks ill-advised as at least one villain is more interested in helping the prophecy along than preventing it. (From ANN)"},
"16306": {"summary": "A mysterious animal landed while Atsushi and En is taking a bath. The animal is asking the two to protect the Earth. Being disturbed, Yumoto went to ask the two but then stopped when he saw the animal whom he referred to as Wombat. In school, Wombat is still chasing Atsushi and En and being chased by Yumoto. The chase ended in Earth Defense Club room with Ryuu and Io inside. Wombat asked the five of them to help protect the Earth and gave them 'Lovracelet', a bracelet that lets them transform into Battle Lovers. (From ANN)"},
"21908": {"summary": "Nakano is an employee of an exploitative \"black\" company, who meets a divine fox spirit named Senko. While she looks like a young girl, Senko is in fact 800 years old. She offers to spoil Nakano as much as possible, and begins looking after him. (From ANN)"},
"21819": {"summary": "Nona is a bishoujo character figure that the young male otaku office worker Haruto bought and she suddenly comes to life, and begins moving and talking on her own. (From ANN)"},
"20469": {"summary": "In April, Ren Amamiya transfers schools for mysterious reasons - something to do with him getting a criminal record for committing grave bodily harm, with the conditions of his probation being to attend a new school far away. A friend of his parents named Sojiro Sakura agrees to take the boy in for reasons of his own, so a reluctant Ren begins his new life. He deletes a mysterious red app from his phone before arriving at Sojiro's house, but the app reappears as he's going to bed for the night. He dreams of a strange place known as the Velvet Room where a man named Igor tells him that there's a way to break free of the chains binding him. The next day, when another red screen on a new classmate's phone leads them into a trap, a persona know as Arsene appears to help Ren. Somehow, all of this will lead to Ren falling back into police custody by November. (From ANN)"},
"21593": {"summary": "After growing up in Tokyo, high school student Kaito Jin moves to Nagoya where he meets Monaka Yatogame, a fellow student who puts her Nagoya dialect on full display. With her cat-like appearance and unvarnished Nagoya dialect, Yatogame won't open up to him at all. (From ANN)"},
"20806": {"summary": "Bocchi Hitori, a girl with extreme social anxiety, has had only one friend throughout elementary school. When Bocchi learns they'll be split up after graduation, she makes a promise to her: \"By the time of my middle school graduation, I'll make friends with everyone in my class\". And if she can't do it they won't be friends anymore. But Bocchi has a hard time talking to people. When she gets nervous, her legs cramp. She can't look other people in the eye. She doesn't even know how to make friends. Every way she thinks of to make friends ends up failing. (From ANN)"},
"21190": {"summary": "Arata Miyako is a new government worker assigned to the Shinjuku Ward Office's \"Nighttime Regional Relations\" department. Each of Tokyo's 23 wards has one such department, which were established to solve paranormal and occult-related events. Arata can understand non-human speech that no one else understands, and he encounters a youkai (supernatural entity) at Shinjuku Gyoen park that calls him Abe no Seimei - the name of a historical Japanese occultist and diviner. (From ANN)"},
"20774": {"summary": "Masaru Saiga is a fifth-grade boy who aims to become a puppeteer. After Sadayoshi Saiga - the CEO of the giant home telephone maker Saiga and Masaru's father - passes away, Masaru inherits 18 billion yen. Masaru is targeted for his wealth, and is saved by two people. Narumi Katou is a man who has studied Kung-Fu and has a weird illness called \"Zonapha Syndrome\", and Shirogane is a silver-haired woman who controls the puppet \"Arurukan\" (Harlequin). Together, Masaru, Narumi, and Shirogane get thrown into various conspiracies by those who would try to steal Masaru's fortune. (From ANN)"},
"21131": {"summary": "Fresh from surviving his adventures in Morioh, Stand user and Joestar ally Koichi Hirose is touching down in Naples, Italy to discover a man known as Haruno Shiobana, who may well be the inheritor of a truly terrifying legacy. Though he now calls himself Giorno Giovanna and makes a living from petty thievery, there is no mistaking the regal bearing and cunning that mark his bloodline, or the natural Stand affinity that he's already begun to harness. Whatever he may call himself, Giorno Giovanna's parentage mark him as a true threat - for he is the son of Dio Brando, and no son of Dio could possibly live quietly on this earth. (From ANN)"},
"21890": {"summary": "Because of a plane crash a group of students are spending their lives on a desert island where there's nothing available and they'll have to make it themselves. The students will show to eat cicadas, how to build traps, a simple allergy test, how to eat hermit crabs, and more. (From ANN)"},
"22018": {"summary": "Boring and normal high school student Kiryuu Keiki finds an anonymous love letter addressed to him. In the process of investigating who could be his \"Cinderella\" he discovers every candidate is uniquely perverted and desperately interested in having him participate in their perversion. (From ANN)"},
"20779": {"summary": "During the 1470s after the Wars of Onin and Bunmei in the Noto Peninsula of the Hokuriku District, Hyakkimaru, who lacks as much as 48 body parts, obtains a fake body and eliminates 48 monsters that were made from his body to retrieve his missing body parts. (From ANN)"},
"21779": {"summary": "In the year 2063, travelling through space has become commonplace. Eight students from Caird High School, along with one child, set out for a school camp on a nearby planet. However, the students are then mysteriously transported 5,000 light years away from home, with no way to call for help. Aboard an abandoned spaceship they call the Astra, these nine students slowly try to make their way back and figure out why they were transported in the first place. (From ANN)"},
"20673": {"summary": "Bell and Hestia are back in action! As they struggle to prove the strength of their Familia, Bell completes a task that moves him up in the rankings - but as a result, he soon finds himself the subject of scrutiny he never saw coming... (From aniDB)"},
"20057": {"summary": "One day, Yuzuki is enveloped by a mysterious light suddenly emanating from her cell phone and finds herself in an unfamiliar place. The scenery spread out before her almost resembles Sengoku period Japan -- But this is another world known as \"Shinga\" where non-human creatures such as vampires and werewolves reside. Long ago, the various tribes of Shinga lived together peacefully under the protection of the Himemiko who possessed special blood. However, one day the Himemiko suddenly vanished. With the protection of the Himemiko gone, the world has fallen into a period of strife. (From ANN)"},
"20017": {"summary": "High-school beauty Umaru seems like the perfect teen wunderkind, but she's hiding a shocking double life. As soon as she gets home, she becomes a junk-food-inhaling, soda-guzzling, video-game-addicted slob. The only one who sees this unsavory side of Umaru is her beleaguered older brother Taihei, who does his best to keep up with his work while trying to get his little sister to behave like a decent member of society. As she makes new friends and gets into a number of wacky situations, Umaru will continue to fight for her right to stay up all night binging potato chips and anime. (From ANN)"},
"20055": {"summary": "Under the cherry blossom tree at Sakuragaoka High School's Entrance Ceremony, Miou Aida meets Haruki Serizawa for the first time. Ever since that day, their eyes chased after each other. Miou is reserved, while Haruki is very social. While many mistook them as a couple, their relationship remained a little more than friends. As they stop to sit on the steps of a deck on their walk home, Miou cannot help but ask, \"Haruki... do you like anyone?\" Haruki replies, \"I do like someone ...what about you?\" Just 10 centimeters between their hands. It's just 10 centimeters, but the distance remains... (From aniDB)"},
"20000": {"summary": "After failing in the preliminary tournament of the previous Love Live, the members of Aquors have rededicated themselves to succeeding both as idols and as saviors of their school, making sure their home will never be taken away. But Mari learns some terrible news about their upcoming school open house event and it seems like all of their efforts will be for naught. Chika and her friends must find some way to preserve their school and carry on as idols. Either way, it looks like they'll need a miracle to get through this, fortunately, from u's to Aqours, miracles are what idols do best. (From ANN)"},
"19364": {"summary": "Hozuki is the aide to the Great King Enma. Calm and super-sadistic, Hozuki tries to resolve the various problems in Hell, including a rampaging Momotaro and his companions. However, he also likes spending his free time on his hobbies, such as fawning over cute animals and raising 'Goldfish Flowers'. (From aniDB)"},
"19945": {"summary": "For a group of high school seniors, a chance reunion with a transfer student will change the course of their final year. Eita Izumi has come back to his hometown after four years and encounters some unlikely acquaintances: Haruto Soma, Eita's childhood friend; Ena Komiya, the photography student who witnesses Eita and Haruto's reunion; Mio Natsume, whose feelings for her middle school crush still linger; and Hazuki Morikawa, a girl who seems uninterested in romantic relationships. When the paths of these five cross, their fates turn in a way none of them could have seen coming. (From ANN)"},
"19921": {"summary": "Operating under a small production company in Sendai known as \"Green Leaves Entertainment\", WUG overcame countless obstacles to beat national idol group \"I-1 club\" at the Idol Festival and win the event. They had suddenly become top idols... but with an idol recession going on, things weren't so easy. The days of steady and honest idol work continued for the girls. Meanwhile, Sendai-based middle school trio Hayashi Ayumi, Morishima Otome, and Atsugi Itsuka have developed an increasing desire to become idols... (From aniDB)"},
"19972": {"summary": "Unbeknownst to her classmates, 16-year-old Hana Ichinose was a year late in enrolling into high school. Although it may not seem like a big deal, it is a big deal to her. She wants to catch up with everyone else someday. (From ANN)"},
"20461": {"summary": "As the two ReLife experiments are about to reach their time limit, Arata Kanzaki and Chizuru Hoshino must wrap things up at school. Soon their memories will be partially erased and they will be introduced to their adult lives once again. (From ANN)"},
"20176": {"summary": "Nishikata is a middle school student who has suffered humiliation due to being teased by Takagi, the girl who sits next to him. Since then, he has vowed to one day do the same to her and succeed in teasing her. (From ANN)"},
"20207": {"summary": "An omnibus of the works of horror mangaka Itou Junji, with each episode adapting a different story. (From aniDB)"},
"17006": {"summary": "After defeating Majin Buu, life is peaceful once again. Ordered by Chi-chi to earn money, Goku works even as he wants to train even more. Meanwhile, Goten, about to become a brother-in-law to Videl, sets out on a journey with Trunks to find her a present. (From ANN)"},
"19400": {"summary": "Ryuuichi and Kotarou Kashima are brothers. Ryuuichi is in high school and Kotarou is still a toddler. After their parents are killed in a plane crash, the two brothers find themselves living with the chairwoman of the Morinomiya Academy, who herself lost her son and daughter-in-law in the same accident. The chairwoman, however, has one stipulation for the brothers in order to live with her: Ryuuichi has to work at the academy's daycare center as a babysitter. (From ANN)"},
"19359": {"summary": "A boy named Chakuro lives on the giant vessel Mud Whale that drifts over the sea of sand. Chakuro and his friends have never seen anyone from the outside world, and they spend their days yearning to explore and learn about it. One day, a ruined ship suddenly drifts ashore, and Chakuro meets a girl inside. (From ANN)"},
"20014": {"summary": "At first glance, Fukuoka seems like a peaceful city, but under the surface, crime is running rampant. The city's Hakata ward is home to the professionals of the underworld: professional killers, detectives, informants, professional revenge seekers, those skilled in torture, and more. And according to urban legend, even a \"killer of professional killers\" exists in the city. When stories of the men in the underworld are told, a \"professional killer murder\" appears. (From ANN)"},
"20373": {"summary": "In a certain corner of a certain park in a certain Ueno area of Tokyo exists the secret base of the \"justice organization\" called \"Colors\". A group of three elementary school girls lead Colors, and the members of the group roam the park day and night (actually just until evening) to protect the peace of the park. (From ANN)"},
"19487": {"summary": "Sakura and Syaoran are starting junior high school. With the Final Judgment passed, Sakura thinks school life will be quiet, but then all her cards suddenly turn blank. The mysterious new power she discovers will change how she thinks about her powers. (From ANN)"},
"15573": {"summary": "Hoozuki is the aide to the great king of Hell, King Enma. Calm and super-sadistic, Hoozuki tries to resolve the various problems in Hell, including a rampaging Momotarou and his companions. However, he also likes spending his free time on his hobbies, such as fawning over cute animals and raising \"Goldfish Flowers\". (From ANN)"},
"14445": {"summary": "Beginning its tale in 19th century England, young aristocrat Jonathan Joestar finds himself locked in bitter rivalry with Dio Brando, a low-born boy who Jonathan's father took under his wing after the death of Dio's father. Discontent with his station in life, Dio's fathomless drive to reign over all eventually leads him to seek the supernatural powers of an ancient Aztec stone mask in the Joestars' possession - an artifact that will forever change the destiny of Dio and Jonathan for generations to come. Fifty years later, in 1938 New York City, Jonathan's grandson Joseph Joestar must take up his grandfather's mission and master the abilities necessary to destroy the stone mask and its immensely powerful creators, the Pillar Men, who threaten humanity's very existence. (From ANN)"},
"20316": {"summary": "With the introduction of an ultra-advanced AI that surpasses human intelligence, beings that mankind is yet to fully comprehend made from materials far too advanced for human technology begin coming into being. Lacia, an hIE equipped with a black coffin-shaped device, is one of these. In boy-meets-girl fashion, 17-year-old Arato Endo has a fateful encounter with the artificial Lacia. (From ANN)"},
"20511": {"summary": "Aya Asagiri is a young girl who has fallen victim to bullies at her school. Looking for a way to escape her troubles, she looks to the Internet for distraction, when a mysterious website called \"Magical Girl Site\" appears. Simply viewing the page is all it takes to hurtle Aya headlong into the deadly world of the Magical Girl Apocalypse. There, it's fight or die, against a seemingly endless array of savagely adorable, frilly-skirted killing machines, each armed with magical powers and an unquenchable thirst for blood and chaos. (From ANN)"},
"18586": {"summary": "Learning about the world from her journey to Earth, Kudelia founded Admoss Company to strive for the financial independence of Mars. While inspecting a mining site of halfmetal, Orga Itsuka, leader of Tekkadan hired by Admoss as guards, senses an attack from a new enemy and heads out to confront them, along with Mikazuki in the mobile suit Gundam Barbatos Lupus. (From ANN)"},
"20071": {"summary": "Sixth grader Washio Sumi is a hero chosen by the Divine Tree spirit to protect the world. She fulfills her mission while treasuring each day with her classmates Nogi Sonoko and Minowa Gin. (From aniDB)"},
"19988": {"summary": "Rin is an energetic girl who loves to eat and lives in a verdant frontier village. Deep within the royal palace in the bustling capital city, the songstress Finis spends her days in solitude. Both share a special power no other person has. A miraculous power that can heal wounds, create water and stir the wind -- the power of song. Guided by destiny, the two young women each face an arduous journey with the power of song. The shadow of war looms over the kingdom, tainting even the miraculous songs with the blood of innocents. Loved ones meet their deaths as silent screams echo through a stone prison. (From ANN)"},
"20607": {"summary": "Retsuko is a 25-year-old red panda who works in her dream company's accounting department. But it turns out that she is forced to keep doing more and more impossible tasks by her superiors and co-workers. She doesn't talk back to them, but she still has to let off steam, so she ends up going to karaoke by herself and singing death metal. (From ANN)"},
"20692": {"summary": "Hikari Kohinata and Futaba Ooki have together found joy in many things through scuba diving and the most everyday of events. Hikari was born and brought up in a small oceanside town on Izu, and Futaba moved there from Tokyo, but the two polar opposites met at Yumegaoka High and instantly hit it off. The always-reserved Futaba found her perfect foil in the cheery and optimistic Hikari, and their friendship gave her the courage to take the first step and experience many of the smaller joys in life. She also took the Open Water Diver exam and passed, and now she has her sights set on the Advanced Open Water Diver certification. (From ANN)"},
"20185": {"summary": "The battle for succession that continued for three generations of shogun in the Keichou era culminated in a gruesome battle of ninja arts between the Kouga and Iga clans. Amidst a rain of flower petals, a man and woman who had decided to live for love were separated once again. However, it is said that by the hand of Hattori Hanzo's adopted son, Kyouhachirou, these two lovers were given life again and left two mementos behind. These children, born with a destiny of their own, were called Hachirou Kouga and Hibiki Iga. The former had eyes like his father's, and the latter had eyes like her mother's. It is now the Kan'ei era, and the land is at peace. As ninjas begin to disappear into the shadows after being deemed unnecessary, The Kouga and Iga clans ask a favor of Hachirou and Hibiki in hopes of reinforcing their foundations. (From ANN)"},
"20392": {"summary": "Tadashi Satomi is a virtual idol known as u who performs user-inputted songs and gains self-awareness through exposure to users' bitter feelings and dissatisfaction toward reality. Wanting to save humanity - which she believes is continuously suffering - she lures people to a virtual reality world called Mobius with her songs. She then imprisons them in Mobius, thinking they will be free from the suffering of reality and that all their wishes will come true. Nine members of the \"Going Home Club\", a club that was formed because the characters want to escape from Mobius and go home, try to find a way out. (From ANN)"},
"20543": {"summary": "The forces of evil are on the rise. When the evil mastermind Sister Jill transforms one of her girls into the bestial Breast Claw and sends her minions out on a mission involving the group Panther Claw and a jewelry story heist, Honey Kisaragi departs from her Catholic girls' school to confront the threat as Cutie Honey. But that's exactly what Sister Jill wants, as she desires Honey's Airborne Element Fixing Device, which allows her to transform into Honey's seven different forms. Meanwhile, Sister Jill is also on the scene in disguise as Inspector Genet, trying to worm her way into Honey's confidence from a different angle. (From ANN)"},
"20284": {"summary": "Tsukasa, a college student, is rescued from an attack by a devil, one of many vampires that can blend in among the human population. Anzai, her savior, is a half-devil who exploits his supernatural gifts as a member of a shadowy police task force that specializes in devil-related crime in Tokyo. As Anzai continues to keep guard over Tsukasa, the two quickly forge a tentative bond - one that Anzai fears will test his iron-clad rule of never drinking human blood. (From ANN)"},
"20321": {"summary": "People have always seen Eia as an emotionally distant person, so she's isolated herself more and more over time, accepting their words as the truth. But when Eia runs into Yuuga Ohta, she finds someone who believes in her abilities and introduces her to a world she never knew existed. Yuuga possesses an \"SCM\", a device that allows people to take control of others entirely through participating in SCM duels. While Yuuga simply wants to use these duels to test his own potential, others are happy to use SCMs in order to trick people into becoming their willing slaves. Eia's powers of perception may shine in this new and menacing world, but she'll soon come to regret learning about the power of SCM. (From ANN)"},
"18796": {"summary": "Nine months have passed since teen soldier Sousuke Sagara first became Kaname Chidori's covert protector. In that time, Mithril has been remarkably successful at thwarting Amalgam's efforts, but this has only made Amalgam more determined. Leonard Testarossa's visits with Tessa and Kaname are just preludes to all-out attacks that begin with global communications disruptions. Kaname's status as a Whispered makes her one of Amalgam's main targets, which means that any semblance of a peaceful life at Jindai Municipal High School is now over for her. (From ANN)"},
"21103": {"summary": "Fujii Ren is a normal student who just had a fistfight with his former best friend, leading him to break off their friendship. But with the help of his childhood friend, Ayase Kasumi, and upperclassman, Himuro Rea, he's gradually returning to his normal school life. Then a series of brutal murders in which the victims are decapitated begins to strike their city. Strangely, at the same time, Ren starts to have terrifying nightmares of being beheaded by a guillotine. But these are just a prelude to the painful and terrifying battles to come. (From aniDB)"},
"20144": {"summary": "A few thousand years in the future, humans have begun to immigrate into space. These space colonies where split into two countries with opposing government organizations called the Galactic Empire -- an autocracy -- and the Free Galaxy Alliance -- a democracy. These two nations fight together in the endless galaxy for over 150 years. The two nations continue to fight. The Galactic Empire is beginning to crumble due to its society of nobles. On the other hand, the abuse of the democratic system has turned the country's politics into a mobocracy. At the end of the eighth century in the space calendar, history begins to chance due to the appearance of two people: the invincible genius Reinhard von Lohengramm, and the never-losing magus Yang Wen-Li. With each controlling an opposing force, they find themselves clashing again and again. (From ANN)"},
"20206": {"summary": "In the early twentieth century, Russo-Japanese War veteran Saichi \"Immortal\" Sugimoto scratches out a meager existence during the postwar gold rush on the wild frontier of Hokkaido. When he stumbles across a map to a fortune in hidden Ainu gold, he sets off on a treacherous quest to find it. But Sugimoto is not the only interested party, and everyone who knows about the gold will kill to possess it. Faced with the harsh conditions of the northern wilderness, ruthless criminals and rogue Japanese soldiers, Sugimoto will need all his skills and luck - and the help of an Ainu girl named Asirpa - to survive. (From ANN)"},
"19711": {"summary": "Fearing disaster brought about by chaos, the people lived protected by \"Lords\"; those with the power of \"Crests\", used to suppress the chaos. However, the Lords decided to abandon their posts and began fighting against each other secretly in war, stealing each other's Crests to gain dominion over one another. Among these people are Siluca, a lone mage who despises the Lords, and Theo, a vagrant knight who continues his journey of training to someday liberate his homeland from tyrannical rule. They make an oath as master and retainer, with hopes of bringing reform Atlatan, the land ruled by chaos. (From ANN)"},
"20202": {"summary": "Bonda Natsunosuke (26, single) is a left-handed relief pitcher for the professional baseball team the Jingu Spiders. He became a pro right after high school and now in his 8th year makes 18 million yen a year, and is not what you'd call a \"first rate player\". He's approaching 30 but still believes he can hit his prime and find \"money buried in the grounds\". (From ANN)"},
"20195": {"summary": "Issei and the 2nd years attend a class trip to Kyoto for well-deserved relaxation, leaving the senior and junior class students of the Gremory family behind. However, once there, they fall under attack and must win without Rias or their other powerhouses. (From ANN)"},
"20335": {"summary": "A super-powered girl named Hina suddenly appears in Nitta's room, a young member of the yakuza. She threatens him with her extraordinary powers. However, they end up living together. (From ANN)"}
}}