{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1589998528_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 1,
				"body": "Нахера надо, мне очково тестить",
				"added": 1590098582
			}
		],
		"1588766031_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [
			{
				"comment_id": 2,
				"body": "> [exhumator](#comment_20_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq): У меня браузер такого протокола не понимает, и потому сразу переходит в https://Duckduckgo.com чего-то там искать... А равно не поймёт tg:// magnet:// и пр. Вот если каждому протоколу соответствующее приложение, тогда - да. Ведь открывает же Telegram cвою ссылку tg://\n\nСмени конфигурацию адреса https://start.duckduckgo.com вместо своего. А лучше этот адрес протестируй https://search.disconnect.me   этот по крайней мере следов запросов не оставляет",
				"added": 1590100723
			}
		],
		"1602100033_1L8aDU3W6ecnjZDQURTV7d5tx9aXjMybrS": [
			{
				"comment_id": 3,
				"body": "> [jk7](#comment_91_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Очередное ненужно. Tahoe-lafs уже есть! Да и Freenet никуда не убежал.\n\nЭто точняк!",
				"added": 1602423149
			},
			{
				"comment_id": 4,
				"body": "На мобиле ни хера не заработал, после запуска повисло приложение, а следом жёстко подвис и сам андроид. С другим софтом такого нет.",
				"added": 1602423285
			}
		],
		"1597862552_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 5,
				"body": "Лучше воздух чистый покупай и воду скоро пригодится и будут бесценны эти сокровища",
				"added": 1602508119
			}
		],
		"1590428068_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": [
			{
				"comment_id": 6,
				"body": "Верховный суд разрешил продавцам не обслуживать покупателей без масок\nПодробнее на РБК:\nhttps://www.rbc.ru/society/02/12/2020/5fc753c79a7947750c025b82?utm_source=vk_rbc\n\nВ верховном суде тоже пропидоры за валюту продались, у кого деньги тот и правит балом, этому поспособствовали как конченые коммерсанты так и чинуши",
				"added": 1606943411
			}
		],
		"1606848904_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 7,
				"body": "Супер, так держать!",
				"added": 1606943555
			},
			{
				"comment_id": 11,
				"body": "Ждем когда выйдет Gnunet на мобиле",
				"added": 1607072003
			},
			{
				"comment_id": 15,
				"body": "> [topnet](#comment_109_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): Freenet лутьше зеронета но там поиска нет пока что\n\nРебята те кто недавно узнал о Freenet уже сайты строят там же, думаю у них хватит мыслей додуматься и собрать поисковик хотя бы на основе Yacy либо похожий для децентрализованных сетей, но на всё нужно больше свободного времени.",
				"added": 1609959934
			}
		],
		"1604941685_16JByxcaVSnx4QiPAXHjuV6hzi44uNoWCD": [
			{
				"comment_id": 8,
				"body": "я не поддавался и не поддаюсь со времён начало этой дичи и по сей день и пошли они нах...й",
				"added": 1607070918
			},
			{
				"comment_id": 9,
				"body": "Бля орнул, бро в москве не только спят в намордниках но ещё и едят, люди уже снять их порой забывают. Настолько быдло напугано этой дичью(безнаказанность мусоров, беспредельщина и винтилово, штрафы из воздуха, мнимость суперзлостного вируса который не способен проникнуть через супер защиту маски), что мозг у них напрочь отказывается думать логически.))))))))))))))))))))))))))))))))))))))))))",
				"added": 1607071332
			},
			{
				"comment_id": 10,
				"body": "Если уж намордник использовать чтоб хоть как-то защитить себя от соплей и чихов, то лучше смастерить его из стерильного бинта либо из стерильной марлевой ткани, их хоть делают из натурального хлопка, а не из этой нефтяной херни и пластмассы со всякой химии после которой начинаются осложнения с дыхательной системой у совсем здравого в этом плане человека.",
				"added": 1607071819
			},
			{
				"comment_id": 12,
				"body": "> [ksnde](#comment_44_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): А главное, чтобы заразиться впринципе нужна вирусная нагрузка, т.е. нужно чтобы вокруг тебя были симптомные больные! Люди отупели в конец! По улице в масках ходят, в своих машинах находясь по однуому ездят в намордниках.. пиздец. на людей так глаза открылись... что они реально тупое стадо в большинстве.\n\nЧему ты удивляешься, если в три часа ночи на улице где никого нет в радиусе пары км, идёт тело с собакой на поводке, прогуливается блять.\n\nВопрос: кто из них в наморднике?\n\nПравильно это имбецильное тело в наморднике. Таких шизоидов сейчас валом, стоит лишь присмотреться. Еду в общественном транспорте на работу, бля все в этих тряпках смотрят на тебя из-под лобья как на дичьи готовые разорвать на суб атомы из-за того, что ты без намордника. Бля сколько же у этих недочеловеков ненависти к безмасочникам))))))))))))",
				"added": 1607105891
			}
		],
		"1607389065_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": [
			{
				"comment_id": 13,
				"body": "Чтоб NAT пробить надо в настройках роутера использовать STUN",
				"added": 1607552136
			}
		],
		"1609441034_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 14,
				"body": "> [dsfsdfsefcxvxcvc](#comment_28_16JByxcaVSnx4QiPAXHjuV6hzi44uNoWCD): \"Мы не зарабатываем на наших пользователях и не заглядываем в ваш трафик.\"Код открыт?, тогда в топку!Проще Роскомнадзор установить)\n\nБро, золотые слова!!! Сама роскомсвобода сотрудничает с мусорами из фсб так что тут думать особо нечего))))))))",
				"added": 1609958599
			}
		],
		"1612044848_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg": [
			{
				"comment_id": 16,
				"body": "> [jk7](#comment_112_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): не, товмайор, так не пойдёт!\n\nМолодец, быстро его раскусил. Этот хер на многие ресурсы предлагает зайти для компрометации",
				"added": 1612131839
			},
			{
				"comment_id": 17,
				"body": "> [praid256](#comment_5_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg): Ну, я так не думаю. Я считаю, что с помощью большевиков мы замутим мировую революцию, а потом...\n\nТы сам то хорошо понял что сморозил нелепицу?",
				"added": 1614796484
			}
		]
	},
	"comment_vote": {}
}