{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Новые технологии.",
			"body": "когда интел зделал 32 бита процессор - амеры зделали интернет с 32 бита длиной адреса. теперь амеры зделали интернет на 128 бит адреса. А процессор на 128 бит и 128 бит памяти кто делать будет?",
			"added": 1550758925
		},
		{
			"topic_id": 2,
			"title": "Российский капитализм",
			"body": "Возможен ли переход россии в капитализм после 100 лет коммунизма-ленинизма?",
			"added": 1551014799
		},
		{
			"topic_id": 3,
			"title": "Отака хуйня, малята...",
			"body": "В 1967 году Египет, Сирия и Иордания стянули свои войска к границам Израиля, изгнали миротворцев ООН и заблокировали вход израильским кораблям в Красное море и Суэцкий канал. В своём выступлении по радио президент Египта Насер призвал арабские государства сбросить Израиль в море[64]. Эти действия стали для руководства Израиля поводом для превентивной атаки и начала войны, вошедшей в историю под названием Шестидневной[65]. Израиль одержал в ней убедительную быструю победу, захватив Синайский полуостров, сектор Газа, Западный берег реки Иордан, Восточный Иерусалим и Голанские высоты[66].\nПремьер-министр Израиля Голда Меир\n\n6 октября 1973 года, в Йом Киппур (Судный день) — священный день в еврейском календаре, когда все верующие евреи находятся в синагогах, — Египет и Сирия одновременно атаковали Израиль, застав врасплох его правительство[67]. Несмотря на значительные потери, нападение было отражено, а затем израильские войска перенесли боевые действия на территорию противника, прежде чем было достигнуто соглашение о прекращении огня. Хотя внутреннее расследование обстоятельств войны сняло ответственность с правительства, недовольство общественности заставило премьер-министра Голду Меир уйти в отставку[68].\n\nВ 1978 году состоялся исторический визит в Израиль президента Египта Анвара Садата. Это событие стало первым шагом к признанию государства Израиль со стороны главы арабского государства[69]. 26 марта 1979 года Анвар Садат и Менахем Бегин подписали египетско-израильский мирный договор, по которому Израиль возвращал Египту Синайский полуостров и обязывался начать переговоры по созданию Палестинской автономии[70].\n\nВ 1982 году Израиль вмешался в гражданскую войну в Ливане для того, чтобы уничтожить базы Организации освобождения Палестины (ООП), где готовились атаки на Израиль. Эта операция была названа «Мир Галилее», но впоследствии получила неофициальное название Первая ливанская война[71]. Руководство и боевики ООП были вынуждены покинуть Ливан, и в 1985 году Израиль вывел войска с большей части территории этой страны, кроме буферной зоны, которая оставалась под израильским контролем до 2000 года[72].\n\nВ 1994 году был подписан израильско-иорданский мирный договор, что сделало Иорданию второй арабской страной, нормализовавшей отношения с Израилем[73].\n\n12 июля 2006 года ливанская шиитская организация «Хезболла», поддерживаемая Сирией и Ираном, запустила несколько ракет по израильским населённым пунктам и атаковала позиции израильских войск[74], захватив двух солдат. Эти действия стали толчком ко Второй ливанской войне, в которой Израиль не добился существенного ослабления «Хезболлы» и свернул операцию после вмешательства ООН[75].",
			"added": 1551387437
		},
		{
			"topic_id": 4,
			"title": "Да, это я долбанул по москве зверским оружием, под названием - вас не существовало.",
			"body": "Кто меня просил это зделать? Панин Виталька. Ибо песенки про бомбежку союза пел именно он. Просил? Получи и роспишись. Ходят упорные слухи, что мы все \"братские народы\" с 1917 года по 1991 жили в советском союзе. Это ложь. Какие ваши доказательства, спросите вы? Я отвечу. Не было никакого советского союза по нескольким пунктам. Не существовал ниодин новорожденный \"СССР\". Существовали миллионы новорожденных \"маленьких сср-ов\" с разными буковками в качестве первого символа. У кого-то литовская сср, у кого-то эстонская, у кого-то украинская, у кого-то чеченская сср, у кого-то колмыцкая сср, у кого-то грузинская сср. У некоторых \"ублюдков операторов\" так вообще узбецкая сср. И всем нам рассказывали, что мы все живем в \"ЕДИНОМ и БОЛЬШОМ\" СССР, но по факту - это байки и брехня. Некоторые \"люди\" или, скорее нелюди, утверждают, что мы как америка, но нет. Это ложь. Ибо я никогда не слышал о новорожденном вермонтовце или колорадовце, а вот о новорожденном американце в штате вермонт или колорадо слышал, но именно американце. Вы скажите, что это вопрос мировоззрения (привет идеологам кпСС), нет это вопросы юридические, правовые, вопросы наследования, если хотите. Некоторые персонажи утверждают, что нужно было служить в армии, а вот потом тебе выдавали паспорт гражданина ссср - это тоже ложь. Ибо паспорт выдавали с 16-ти лет, а служили в армии с 18-ти. Дееспособность возникала тоже с 16-ти лет. И не мудрено, что эта конструкция развалилась при первых толчках, а многие предпочли бежать за границу, за что были немедленно записаны в предатели.Нет, ребята, это вы там в москве - предатели, ибо за 100 с лишним лет вы так и не смогли напечатать простой документ свидетельство о рождении в ссср, а не в [а..я]сср и создать правовую систему в котором человек рожденный мог существовать с этим документом. Вывод - СССР был просто вывеской над многострадальным континентом. И таки да, это очень смахивало на тюрьму народов... Ибо просто родившись на этом многострадальном континенте человек оказывался СРАЗУ репрессирован до размеров республики,еще даже не выучив слово мама и папа, а уже репрессирован, и в течении следующих 8-16 лет был вынужден слушать учителя по географии рассматривая большую карту и периодически заглядывая в свидетельство о рождении и наблюдая чудовищное несоответствие между учебником географии и свидетельством о рождении. И как при этом можно было не заболеть всеми видами психических заболеваний к 18-ти годам - остается загадкой. И если еще немного вдуматься, то было понятно следующее, что репрессированным был не родитель за какие-либо пригрешения, которые безусловно были, а именно НОВОРОЖДЕННЫЙ, и родители при этом все понимали, и изменить ситуацию не могли в принципе, ибо решения этого вопроса не существовало и в мОСЬКВЕ.Со всеми супер-пупер адвокатами и юристами. За сим разрешите откланяться. Теперь можете меня немного расстрелять как предателя( с вашей точки зрения)...",
			"added": 1551453585
		},
		{
			"topic_id": 5,
			"title": "Рассшифровка слов.",
			"body": "жив_от_ное.\nЖивущий от ноя.",
			"added": 1552157955
		},
		{
			"topic_id": 6,
			"title": "Обращение к русским",
			"body": "Как мне повернуть русских на путь демократии, если у вас метод изучения языка - диктант и слово диктатура это однокоренные слова?",
			"added": 1552539289
		},
		{
			"topic_id": 7,
			"title": "Кадыров",
			"body": "Степан Бандера воевал против советской власти. Кадыров воевал против советской власти. Почему Кадыров не Степан Бандера?",
			"added": 1554171174
		}
	],
	"topic_vote": {},
	"next_comment_id": 45,
	"comment": {
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 1,
				"body": "суверенность интернета заключается в невозможности повлиять на работу интернета в стране \"а\" из страны \"б\", ну или свести такое влияние к минимуму.",
				"added": 1550683415
			}
		],
		"2_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 2,
				"body": "Ще залежить від рівня на якому працює меш. Бо буває меш на канальному рівні.",
				"added": 1550751479
			},
			{
				"comment_id": 4,
				"body": "p2p - piont-to-point сеть прямые соединения между абонентами сети (конечный абонент не может выступать маршрутизатором данных).\nmesh - каждый участник сети - маршрутизатор.",
				"added": 1550804201
			},
			{
				"comment_id": 5,
				"body": "p2p - piont-to-point сеть прямые соединения между абонентами сети (конечный абонент не может выступать маршрутизатором данных).\nmesh - каждый участник сети - маршрутизатор.",
				"added": 1550805257
			}
		],
		"3_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 3,
				"body": "Скотина",
				"added": 1550767184
			}
		],
		"1_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 6,
				"body": "квантовый - среда. А ширина регистров в ядре - это ширина регистров.",
				"added": 1550806284
			},
			{
				"comment_id": 7,
				"body": "квантовый - среда. А ширина регистров в ядре - это ширина регистров.",
				"added": 1550806579
			}
		],
		"1_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 8,
				"body": "В чем смысл залезать в зеронет и пиздеть, что он скоро умрет? Проще выйти из зеронета и уйти из интернета в нахуй. Для таких долбайбов у меня есть хорошее предложение. Зарегистрироваться на сайте американской администрации и рассказывать американцам что америка скоро загнется и ей настанет кирдык.",
				"added": 1550988157
			}
		],
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 9,
				"body": "> [deliriumgoddesss](#comment_31_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): так уже перешли\n\nДык, любопытно, а в чем это выражается?",
				"added": 1551094654
			},
			{
				"comment_id": 10,
				"body": "> [hartmann](#comment_1_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c): Проблема не в том что нет Ъ капиталистов (они есть), проблема в том что им никто не даст. У нас как - сел царь и сидит, пока вперёд ногами не вынесут. Исключения по пальцам пересчитать можно.\n\nА что именно, по вашему мнению, капиталистам должны именно \"дать\"? Это коммуно-социализм и национал-социализм оперируют понятиями \"мы дадим\".",
				"added": 1551204397
			},
			{
				"comment_id": 11,
				"body": "Если капиталист в россии держит деньги в росийских банках - в чем проблема? В книжке карла-маркса? Я задам вопрос. Карл Маркс - немецкий коммунистический философ - в россии война.\nгИТЛЕР - немецкий национал социалист - убивающий в россии и других территориях коммунистов, которых придумал немецкий коммунист Карл Маркс. Но виноваты в россии именно капиталисты...\nНичего странного в этом нету?",
				"added": 1551249223
			},
			{
				"comment_id": 12,
				"body": "> [hartmann](#comment_5_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c): Я что-то вообще не уловил нити мысли.  Вопрос был о возможности капиталистической экономики и общества в России - да, это возможно при условии что действующую власть попячат. А \"капиталисты виноваты\" это всего лишь старый и удобный жупел работающий со времен революции, вне зависимости от того кто сидит на троне.\n> И проблема содержания денег в российских банках в том что деньги там перестают быть твоими собственными, а легко и непринужденно меняют владельца по первому же хлопку щёк сверху.\n\nЭтот жупел и был подрывным моментом, направленным на внутренние финансовые структуры с целью вызвать бегство капитала из страны в иностранные банки, где эти деньги могли быть отобраны точно так-же, но только другим правительством, а не правительством страны капиталиста.",
				"added": 1551262682
			},
			{
				"comment_id": 13,
				"body": "> [hartmann](#comment_5_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c): Я что-то вообще не уловил нити мысли.  Вопрос был о возможности капиталистической экономики и общества в России - да, это возможно при условии что действующую власть попячат. А \"капиталисты виноваты\" это всего лишь старый и удобный жупел работающий со времен революции, вне зависимости от того кто сидит на троне.\n> И проблема содержания денег в российских банках в том что деньги там перестают быть твоими собственными, а легко и непринужденно меняют владельца по первому же хлопку щёк сверху.\n\nЭтот жупел и был подрывным моментом, направленным на внутренние финансовые структуры с целью вызвать бегство капитала из страны в иностранные банки, где эти деньги могли быть отобраны точно так-же, но только другим правительством, а не правительством страны капиталиста.",
				"added": 1551262717
			},
			{
				"comment_id": 14,
				"body": "> [hartmann](#comment_5_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c): Я что-то вообще не уловил нити мысли.  Вопрос был о возможности капиталистической экономики и общества в России - да, это возможно при условии что действующую власть попячат. А \"капиталисты виноваты\" это всего лишь старый и удобный жупел работающий со времен революции, вне зависимости от того кто сидит на троне.\n> И проблема содержания денег в российских банках в том что деньги там перестают быть твоими собственными, а легко и непринужденно меняют владельца по первому же хлопку щёк сверху.\n\nЭтот жупел и был подрывным моментом, направленным на внутренние финансовые структуры с целью вызвать бегство капитала из страны в иностранные банки, где эти деньги могли быть отобраны точно так-же, но только другим правительством, а не правительством страны капиталиста.",
				"added": 1551262750
			},
			{
				"comment_id": 15,
				"body": "> [hartmann](#comment_5_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c): Я что-то вообще не уловил нити мысли.  Вопрос был о возможности капиталистической экономики и общества в России - да, это возможно при условии что действующую власть попячат. А \"капиталисты виноваты\" это всего лишь старый и удобный жупел работающий со времен революции, вне зависимости от того кто сидит на троне.\n> И проблема содержания денег в российских банках в том что деньги там перестают быть твоими собственными, а легко и непринужденно меняют владельца по первому же хлопку щёк сверху.\n\nЭтот жупел и был подрывным моментом, направленным на внутренние финансовые структуры с целью вызвать бегство капитала из страны в иностранные банки, где эти деньги могли быть отобраны точно так-же, но только другим правительством, а не правительством страны капиталиста.",
				"added": 1551262813
			},
			{
				"comment_id": 16,
				"body": "Дуплит, что-то...",
				"added": 1551263150
			},
			{
				"comment_id": 17,
				"body": "> [hartmann](#comment_1_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c): Проблема не в том что нет Ъ капиталистов (они есть), проблема в том что им никто не даст. У нас как - сел царь и сидит, пока вперёд ногами не вынесут. Исключения по пальцам пересчитать можно.\n\nНельзя внести в конституцию изменения?\nГде-то в конституции есть запрет на капитализм?\nВ америке тоже читали карла маркса. Там уничтожать свой капитализм даже и не подумали.\nТолько мы на поводу у немцев.",
				"added": 1551287775
			},
			{
				"comment_id": 21,
				"body": "> [dezdechado](#comment_1_1LoaipbDCCk4wRFNNmrBqPSb2WMy7JYqnH): Ленин - реинкарнация бога Шивы на Земле. И если он пришел - пизда всем капиталистам ебучим. Просто Ленин это делает медленно. Шива если надо уничтожает Вселенную, раскладывая её на кварки и собирает новую. Так что... какой нахуй \"переход к капитализму\" Все будут схвачены и отхуячены\n\nЦю хуйню изначально придумали не в россии и не в украине.",
				"added": 1551545193
			},
			{
				"comment_id": 22,
				"body": "Капитализм - это организация производства. У кого доступен банковский кредит - у того есть возможности суверенитета и поддержка собственного народа. У кого - нету - постоянные репрессии. Был ли когда-либо голод и репрессии в странах развитого капитализма? Ответ - небыло. И не надо мне рассказывать про депрессию в америке в 1930-х годах - это брехня.",
				"added": 1551824946
			}
		],
		"4_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 18,
				"body": "И да, по прошествии стольких лет, если цель кпсс была создание советского человека, то какой он должен был быть национальности?",
				"added": 1551460014
			}
		],
		"1_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd": [
			{
				"comment_id": 19,
				"body": "Эта кнопка находится в правом-верхнем углу и называется \"follow in Newsfeed\"",
				"added": 1551468489
			},
			{
				"comment_id": 20,
				"body": "Эта кнопка находится в правом-верхнем углу и называется \"follow in Newsfeed\"",
				"added": 1551468539
			}
		],
		"3_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 23,
				"body": "почему не зеронетовский ютьюб?\nнапример http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1550688739_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp",
				"added": 1551919492
			}
		],
		"3_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 24,
				"body": "> [avokado](#comment_4_1KUkif7CaEVu11iaBLNug6izd2kQ5ErH9p): Копипаста из педивикии. Очень ценно, блд.\n\nВ википедии есть правки, в результате которых информация теряется, или изменяется. Создать пост в котором зафиксировано состояние. Если не в курсе, что такое информационная вона, то и не спрашивай.",
				"added": 1551958554
			}
		],
		"1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 25,
				"body": "Через сервер ничего не проходит. Через маршрутизатор проходит. Сервер выполняет несколько иные функции.",
				"added": 1552075963
			},
			{
				"comment_id": 26,
				"body": "> [zxfhu](#comment_7_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): да ебать все российские сети пускай путинские пидорасты сами налоги по ним гоняют из пизды в жопу\n>  иностранных спутников полно спутниковый интернет будем юзать и заливать в локалку РФ торенты\n\nПутинские - не путинские, а размерность номера автономной системы всего 65535 вариантов на весь мир.",
				"added": 1552159196
			},
			{
				"comment_id": 27,
				"body": "> [zxfhu](#comment_12_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): 65535 это диапазон портов ( какие номера автономной системы дурачек )\n\nhttps://ru.wikipedia.org/wiki/%D0%90%D0%B2%D1%82%D0%BE%D0%BD%D0%BE%D0%BC%D0%BD%D0%B0%D1%8F_%D1%81%D0%B8%D1%81%D1%82%D0%B5%D0%BC%D0%B0_(%D0%98%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82)",
				"added": 1552160714
			}
		],
		"1_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": [
			{
				"comment_id": 28,
				"body": "нахера его блокировать?",
				"added": 1552539189
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 29,
				"body": "Но если слово диктант появилось только после 1920-х годов, то как же учили дореволюционны русски язык? Процесс был наверняка аналогичный, а вот слово было совсем другое...",
				"added": 1552691777
			},
			{
				"comment_id": 30,
				"body": "Но если слово диктант появилось только после 1920-х годов, то как же учили дореволюционный русски язык? Процесс был наверняка аналогичный, а вот слово было совсем другое...",
				"added": 1552691867
			},
			{
				"comment_id": 31,
				"body": "Но если слово диктант появилось только после 1920-х годов, то как же учили дореволюционный русски язык? Процесс был наверняка аналогичный, а вот слово было совсем другое...",
				"added": 1552691951
			},
			{
				"comment_id": 36,
				"body": "> [hartmann](#comment_13_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c): Демократия нежизнеспособна.\n\nРасскажи это америкосам.",
				"added": 1553187563
			}
		],
		"5_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 32,
				"body": "> [mistalero](#comment_56_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Ной - это имя, пиши с большой буквы, а так молодец.\n\nНой - это прообраз Сталина ;-)",
				"added": 1552901601
			}
		],
		"1_1KDowLVWPX3uVoksFQ1e9Pw1ZA6xcLTfSX": [
			{
				"comment_id": 33,
				"body": "Кому интересен твой IP адрес?",
				"added": 1552925311
			}
		],
		"1_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": [
			{
				"comment_id": 34,
				"body": "Про \"бімбу у метрі\" в период мадана мы уже читали... эффект такой-же.",
				"added": 1552954763
			}
		],
		"2_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 35,
				"body": "Zeronet работает и без трекеров.",
				"added": 1552959528
			}
		],
		"1_12gkvzRiZk99ZSaaCWFkBEXaefBzhz75vJ": [
			{
				"comment_id": 37,
				"body": "> [deepstrelok](#comment_23_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Будущее за тем, что окажется наиболее удобным и массовым. \n> Какова бы не была задумка, без юзеров к сожалению она ничто. В i2p скучно и пусто сейчас. Тем не менее сам по себе это отличный проект по созданию закрытой анонимной сети. И уж точно гораздо более безопасен, чем эти ваши zeronet.\n\nzeronet достаточно периодически появляться в сети.\ni2p нужно постоянное подключение.",
				"added": 1553804947
			}
		],
		"1_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [
			{
				"comment_id": 38,
				"body": "Что для тебя является \"интересным\"?",
				"added": 1557168177
			},
			{
				"comment_id": 39,
				"body": "> [jcactus](#comment_2_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa): Что-нибудь, где есть хотя бы люди. Да и просто, где тут местные сидят? Кроме зероТалк\n\nКакие местные?",
				"added": 1557168389
			},
			{
				"comment_id": 40,
				"body": "Существует несколько моделей информационного пространства.\nКлассическая - несколько студий генерят и доставляют контент множеству пользователей. Например классическое телевидение или физбуки с ютубами, с точки зрения хранения информации. Зеронет имеет отличную от классической архитектуру.",
				"added": 1557175739
			}
		],
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 41,
				"body": "CQEGAcGUxsBNBFzOB0YBCAC1m2xHyyfApV/Fa0tgETlXCXW9vzB/CUZlpUJCqG8K\nhIRMAFpQyJ1ky0L0d1cvZdkOom3IujQDspawmG1YjHOrDZiwLO8CGzDDLNJjsUiD\nlgNlWR9Kua0xl579/AeEG1M/gPNMo7q5kHw9zrMxdTmrLrhVtB9Bg7xymuHMq4uO\nQ850/Q3XJtDQdQHfbriuPUwbxTsGOxs4002a7xWhoJ/KDv9tHvso7Y8aGKwbO0Ot\nbiA31D177sNEro/Pi0B4D3vChJbDpJ7MvM7gOzyHEbkoSXQNpZ8g/KTlZ5qNZVsa\nfzTPC1Me2QbhRmQeaKjdMd3vSAJ51ifOLliQtd7lwX3DABEBAAHNIFR1eCAoR2Vu\nZXJhdGVkIGJ5IFJldHJvU2hhcmUpIDw+wsBfBBMBAgATBQJczgdGCRDhl/Wix37G\n+wIZAQAAD6IIALTLt/T5ssXjIS0MpWj7tcMkPz2V0Q5KmLAnYIj7oG236Qe6DeUE\nBNOHQfCAn08sP5JJVGJ5CFAmYOu2PjXajbpdN7fEr10dI7xJ3obBM3FjHXyqlJs/\nlcEW9tcpK2XdZFan0+RruthGJqhNod8Z9ZITZx61e6ng+z64/gYFxuon+UjFWWmW\ncVcnjyJvyMhJlcDNPkGP5X/19rjh8rKWTb3xgRIp8LakSxOOddbFJjoUD+eLNvfR\nVDO4f4pmzuzFolLfM68k/drnh4ANfVVgnQubXugdlXz/bIDvRa6vT5+iSkpa/1nF\n/rDyk9AnyWJTVtSoXmDXbAAULqzN4eR1/LACBsEaG3w93gMGwKjXAT3eBAAGA1o3\nNwUQ+gMvykrDp2RmsGPQHEKxlQcDSWme",
				"added": 1557210141
			},
			{
				"comment_id": 43,
				"body": "retroshare://channel?name=%D0%9F%D1%80%D0%BE%20%D0%B4%D0%B5%D0%BC%D0%BE%D0%BA%D1%80%D0%B0%D1%82%D0%B8%D1%8E&id=d63c100ec4b4b4df7706fcb8a230c34d",
				"added": 1565029347
			}
		],
		"1_1AoBLSHxtHL11EBHgm2d1Epp5Chxkn45EA": [
			{
				"comment_id": 42,
				"body": "Куда?",
				"added": 1557868207
			}
		],
		"6_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 44,
				"body": "Что именно вы называете \"русским языком\"?",
				"added": 1565947851
			}
		]
	},
	"comment_vote": {
		"2_1KUkif7CaEVu11iaBLNug6izd2kQ5ErH9p": 1,
		"48_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1
	}
}