{
	"title": "CryptonBits",
	"description": "Random musings about cryptography and communication.",
	"links": "##Recent Articles##\n##[Evernote for Zeronet aka Zeronote](http://127.0.0.1:43110/cryptonbits.bit/?Post:9:Unique+Usage+for+a+ZeroTalk+Fork)##\n##[BitcoinContract.net Escrow System](http://127.0.0.1:43110/1C5P1EcTZA6FDEg4w6SacfPjvSDCWmzeyt/?Post:7:Lack+of+Posts+Due+to+BitcoinContract.net)##\n##[Zeronet Markdown Cheatsheet](http://127.0.0.1:43110/cryptonbits.bit/?Post:6:Zeronet+Markdown+Cheatsheet)##\n##[Your Zeronet Site is a Bitcoin Wallet](http://127.0.0.1:43110/cryptonbits.bit/?Post:5:Your+Zeronet+Site+is+a+Bitcoin+Wallet)##\n##[How to Connect your .bit domain to your Zeronet site](http://127.0.0.1:43110/cryptonbits.bit/?Post:4:How+to+connect+your+.bit+domain+with+your+Zeronet+site)##\n##[Are you still trying to figure out Zeronet?](http://127.0.0.1:43110/cryptonbits.bit/?Post:3:Are+you+still+trying+to+figure+out+Zeronet+)##\n\n##Other Info##\n[Email Me on Zeromail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=crypton)\n\n- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1458683137,
	"post": [
		{
			"post_id": 9,
			"title": "Unique Usage for a ZeroTalk Fork",
			"date_published": 1458681809.651,
			"body": "So I was out for a walk today and was thinking about unique usages for Zeronet when it struck me there is a very simple solution for those Zeronet users who have multiple computers/systems.\n\nThe problem is this...  Do you access Zeronet from multiple desktops and laptops?  Maybe you have one computer for your Zeronet development work and another computer you use for browsing Zeronet and another for doing something with a blog or what not?  And have you ever wanted a solution where you could have a shared notes folder with just you?  \n\nThe solution is sort of like a Zeronet version of Evernote or Google Keep.\n\n**How to create Evernote on Zeronet**\n\nFirst you need to fork ZeroTalk.  Don't tell anyone what the URL address is of your new site.\n\nOpen up the HTML file and customize the layout and wording. (For my first version I simply went and replaced any text that referred to *topics* and replaced it with *notes*.\n\nNow you can share that **ZeroNotes** site with any of your other computers or Zeronet accounts to automatically sync any of your notes you type on any of your computers/accounts.\n\nAnd since nobody would be able to *guess* your custom **ZeroNotes** site address and you are only sharing/syncing it with yourself it should stay private.\n\n**Code I'm Working on to expand ZeroNotes**\n1. Add the ability to create checklists\n2. Place a dropdown field that will allow for sorting of different types of notes\n3. Build the ability to archive specific notes\n4. Basic search field which will search the current page for single word strings\n5. The ability to \"share a note\" by sending an email through Zeromail\n\nAnyway, just thought I would share what I'm working on during some free time.  And have no fear, when I finish the final demo site I'll make it able to be cloned so everyone could use a **Zeronote**.\n"
		},
		{
			"post_id": 8,
			"title": "Opinions are like assholes...",
			"date_published": 1458561558.458,
			"body": "I don't care whether you believe that...\n- blacks are better than whites or \n- whites are better than donkeys or \n- that Hitler was great or gay or \n- that 9/11 was an inside job or\n- Mohammed raped little girls and stole parts of the Koran from Jewish wives tales or\n- Christians are killing babies or\n- Muslims are killing Christians or\n- Iraq hid weapons of mass destruction or gassed millions of their own people or\n- Aliens are real (which would be really cool by the way) or\n- This or that was a hoax or not or\n- The rational behind when its okay to assault someone else or\n.... whatever\n\nEveryone has an opinion just like everyone has an asshole and in the same manner both normally stink!!!\n\n\nZeronet SHOULD be about inclusion.  If you truly want to BUILD something great and contribute to the idea of a decentralized and censorship-free environment you might find people more willing to contribute their time, money, and energy to further developing out the infrastructure and capabilities of Zeronet.  \n\n\nIf all you can do is act like a 12 year old that is experiencing his first night staying up after curfew and spewing whatever the hell you think people might find funny you will kill whatever hope Zeronet has of gaining traction.  Why do you think ALL social networks, dating sites, and other sites that are trying to encourage new users to join DO NOT show any of the hate speech or idiotic \"opinion\" on their frontpage... even though if you look you can find it all over \"on the inside or side areas\".  It's because the VAST majority of people don't care about fringe opinions.  If you find people that appreciate your own personal opinions then build out your own section and ask people to join to further your exciting and intellectual communication.\n\n\nAsking people to be aware that derogatory (towards ANY direction) is a deterrent to new people getting involved in a community is NOT censorship.  It's asking people to actually grow up and realize you can do whatever you want ON YOUR OWN TIME and with YOUR OWN FRIENDS.  Forcing everyone participate in your own personal derogatory rants is not just rude but just plain destructive to the community as a whole.  (I personally don't think that ZeroTalk should be about linking to the latest and greatest porn either... but I'm pretty sure I'm a minority on that issue.)\n\n\nWhen I want people to understand the passion I have for Bach or that I think Beagles are the best dog or that the best way to travel is by sailboat or that I disagree with the current hagiography of Nelson Mandela due to my being in South Africa and seeing first hand what he did... I'll do it on my time and on my own sites because I believe that's where it belongs.\n\n\nWhat is ZeroTalk:\n- A conversation place about Zeronet\n- A \"getting started\" area\n- A place to share about new sites that have been built (not for repeat spamming every hour a new thread about \"Come see my awesome site!!!\")\n- A place people can ask questions and get answers\n- A place to enhance Zeronet\n\n\nBut hey, you can disagree with me and I'm fine with that.  But I'll ask you a two part question... If you want to spam your derogatory crap (regardless of what side or about what topic) are you 1) okay with destroying whatever hope Zeronet has of becoming a useful tool and 2) if you decide to post derogatory crap, will you agree to let anyone else post opposing derogatory crap and you will be happy when someone insults you because you believe in \"free speech\" are are just so delighted when people/things/places that you hate are using this free speech and censorship-free opportunity YOU \"cherish\" to insult you.\n\n\nTo be a true free speech/censorship-free community you have to agree that everyone has opinions BUT also understand that everyone needs to be an adult and realize there are times and places for opinions.  And if you don't understand this distinction than all you are is a drain on society. \n\n\nIf you made it to the end... thanks for ready this brain dump.  I do hope that the awesome opportunity that Zeronet provides for users won't be squandered by the \"vocal minority\" who haven't learned how to properly act in public and social settings."
		},
		{
			"post_id": 7,
			"title": "Lack of Posts Due to BitcoinContract.net",
			"date_published": 1457661051.674,
			"body": "Sorry about the lack of Zeronet posts during the past few days.  I've been focused on an old crypto code project revolving around a trustless escrow system for Bitcoin.\n\n![BitcoinContract.net](https://forum.gethashing.com/uploads/default/optimized/2X/7/7aa1f0be931f5238d8c7d705bd37d999a56c8f9c_1_600x99.png)\n\n[BitcoinContract.net](http://bitcoincontract.net)\n\nThis is a system the evolves out of the Bitcoin's [BIP38](https://en.bitcoin.it/wiki/BIP_0038) and its ability to provide encryption to Bitcoin's private keys.\n\n**How does this all work?**\n\n1. Two parties agree on a contract. This could be selling a product, performing a service, whatever needs an escrow system.\n2. The party who will be receiving the money visits [http://bitcoincontract.net/](http://bitcoincontract.net) and creates their own passphrase that they keep secret to themselves. The site generates an Escrow Code that they send to the party who will be sending the money.\n3. The sending party visits [http://bitcoincontract.net/](http://bitcoincontract.net) and visits Step #2 and enters the Escrow Code which will allow then to generate three fields. 1) The bitcoin address that will be used for the transaction. 2) A confirmation code that will be send to the receiving party. 3) An encrypted private key that will only be turned over to the receiving party once the transaction has been completed. \n4. The sending party will then send both the Bitcoin address and the Confirmation key to the receiving party.\n5. The receiving party will take the Confirmation code they are given by the sending party and visits [http://bitcoincontract.net/](http://bitcoincontract.net) and uses Step #3. They enter the Confirmation Code and the original passphrase they created in Step #1. When they verify the Confirmation Code it will display a modal window that will show a Bitcoin address. If the Bitcoin address displayed by Step #3 matches the Bitcoin address generated from Step #2 and sent to the receiving party then all is good and the private key for the correct Bitcoin address has been encrypted and validated.\n6. The receiving party can then contact the sending party to let them know they can send the Bitcoins to the address.\n7. At this point NEITHER party has access to the unencrypted private key of the Bitcoin escrow address.\n8. The transaction can be verified by looking up the Bitcoin escrow address on a blockchain. When the transaction is confirmed the receiving party will then finish whatever service or send whatever product is needed to complete the transaction.\n9. The sending party will verify the service or product had been received and then can send the encrypted private key to the receiving party.\n10. The receiving party then visits [http://bitcoincontract.net/](http://bitcoincontract.net) at Step #4 and is able to use the passphrase used in Step #1 to unencrypt the private key of the Bitcoin escrow address. One the receiving party has the unencrypted private key they can transfer the funds out of the Bitcoin escrow address to wherever they want.\n\nLet me know what you think.\n\n\n"
		},
		{
			"post_id": 6,
			"title": "Zeronet Markdown Cheatsheet",
			"date_published": 1457288870.591,
			"body": "I notice that there are a number of people asking basic Markdown formatting questions.  And in order to go find Markdown cheatsheets you have to leave the \"safety\" of Zeronet.  So I thought I would post a Markdown Cheatsheet here on Zeronet for anyone to bookmark or follow.\n# Headers\n`# H1`\n`## H2`\n`### H3`\n`#### H4`\n`##### H5`\n`###### H6`\n*You can also use an underline-style for H1 and H2 tags:*\n```\nAlternative H1\n===========\nAlternative H2\n------------------\n```\n# Strong, Strikes, and Emphasis\n- Emphasis (or italics) can be accomplished with `*astericks*` or `_underscores_` surrounding the word or phrase you wish to _emphasis_.\n- Strong (or bold) can be accomplished with double `**astericks**` or `__undercores__` surrounding the word or phrase you wish to __make strong__.\n- Strikethrough uses two tildes `~~strike~~` surrounding the word or phrase you wish to ~~have a strike through~~.\n## Lists\n\n```\n1. First ordered list item\n2. Another item\n  * Unordered sub-list\n1. Remember that numbers don't actually matter, they will render on the front end as a correct ordered list\n  1. Ordered sub-list\n4. Another item\n```\n\n*Note that the two sub-list items above have two leading white spaces (spacebar) before the astericks or the numeral.*\n\nAlso note that unordered lists can use either astericks or minuses or pluses.  All three will work.\n# Links\nThere are really two ways to handle links in Markdown. The first way deals with inline-style links.\n```\n[This is the inline-style link text](https://www.domain.com)\n[This is the inline-style link text WITH title](https://www.domain.com \"Title of Link\")\n```\nOr you could use a reference text or number that will provide the linked url at the bottom of the document.\n```\n[This is the inline-style link with a reference to 'footer'](arbitrary case-insensitive reference text)\n- - -\nThen later in the document you can provide the reference links like:\n[arbitrary case-insensitive reference text]: https://domain.com\n[1]: https://domain.com\n```\n# Images\nIn Markdown there is a simple method of adding images to a document.\n\n`![alt text](https://www.domain.com/img/image.png)`\n\n*Note that you can also use a similar reference style link described in the LINKS section.*\n\n**IMPORTANT** :  When it comes to linking items in Zeronet there is a recommended method of linking your images.  \n` ![image alt](data/img/some-image.jpg)`\nBy placing the image in your data folder of your Zeronet folder you don't have to worry about outside image hosting solutions to work.\n# Code Snippets\nThe important thing to remember about Markdown and sharing code snippets is the back-tick key \n```\nInline `code` has `back-ticks around` the items that will be highlighted.\n```\nInline `code` has `back-ticks around` the items that will be highlighted.\n\nIf you use a triple back-tick it will turn on the syntax highlighting and will continue to highlight everything until you use another triple back-tick to turn it off.  This is how you can display blocks of code.\n```\nThis will highlight multiple lines of code.\nAnd make it easier to share code\n```\n\nIf during your initial triple back-tick you also write the name if the language like ````javascript` it will format your code.\n\n```javascript\nvar s = \"You can also have it format the code by declaring which language you are using.\nprint(s);`\n```\n# Blockquotes\nBlockquotes are handled by starting each line with a *greater than* element or *closing tag)\n```\n> Blockquotes are simple ways to draw attention to text\n> That can stand out for your posts.\n```\nAnd it looks like this\n> When you highlight interesting bits\n> from your blog post for all to pay attention.\n\n# Other Notes\nThere are other aspects of Markdown that some sites (Github and other flavors of Markdown) use that are not in the traditional Markdown specs.  I haven't test that functionality currently, but if people want I can do a followup to talk about tables, horizontal rules, line breaks, limited embeds, and how to do other neat tricks here on Zeronet."
		},
		{
			"post_id": 5,
			"title": "Your Zeronet Site is a Bitcoin Wallet",
			"date_published": 1457186535.497,
			"body": "*Side note: I hope you enjoy or find useful these tutorials and background information articles.  If these are helpful for people to better understand Zeronet and to get more involved, just let me know.*\n\nIn prior articles, I've made mention of public and private keys.  The public key of a Zeronet site is the address you see in the URL.  I have bolded the public key element of the URL below.\n\nhttp://127.0.0.1:43110/**1C5P1EcTZA6FDEg4w6SacfPjvSDCWmzeyt**/Home\n\nNow here's the cool thing.  This public key is ACTUALLY a Bitcoin wallet address.  Go ahead, look it up.  [https://www.blocktrail.com/BTC/address/1C5P1EcTZA6FDEg4w6SacfPjvSDCWmzeyt](https://www.blocktrail.com/BTC/address/1C5P1EcTZA6FDEg4w6SacfPjvSDCWmzeyt) You see that my site is in possession of some Bitcoins. Yup... a whole $2 USD :)\n\nSo what can you do with this knowledge and how do you move Bitcoins.  When you create a new site on Zeronet you are given a public key and a private key.  On Zeronet that private key is used to verify that you are indeed the site owner and you have the cryptographic signature proof that only you can publish updates and modifications to the site.  This private key is ALSO the private key for your Bitcoin wallet.  So you can simply use the *import privkey* command in your Bitcoin wallet to gain control of the \"coin\" aspect of your wallet/address.  So this is also a VERY important reason to keep your private keys secure.\n\nThis usage of the Bitcoin public and private keys is another exciting aspect of Zeronet because it opens so many opportunities for the future."
		},
		{
			"post_id": 4,
			"title": "How to connect your .bit domain with your Zeronet site",
			"date_published": 1457125640.311,
			"body": "I've seen an increase in people asking a simple question on how to integrate or link up a **.bit** domain name instead of having to pass out a public key address for people to visit.  So here's a quick little walk through.\n\nFirst, its important to understand that **.bit** domains an an important part of the [Namecoin blockchain](https://namecoin.info/) .  Namecoin is a merge-mined coin with Bitcoin(BTC) and its blockchain operates as a [decentralized DNS](https://bit.namecoin.info/).  So the easiest way to get a **.bit** domain name is to have a [Namecoin-Qt client](http://www.namecoin.info/?p=download) running on your machine. \n\n![Register .bit domain](https://s3.amazonaws.com/f.cl.ly/items/0c2O3T1s323W1r03032O/Image%202016-03-04%20at%203.49.01%20PM.png?v=5c7775f2)\n\nIn the above input box you enter your desired **.bit** domain name WITHOUT the .bit extension.  So if you want to register *cryptonbits.bit*, you would enter just *d/cryptonbits*.  It will cost you 0.02 NMC to register the domain.  (Any time you make updates to the name's record it will cost you 0.005 NMC.) \n\nWhy does it cost money?\n\nBecause the entire decentralized DNS system lives in the blockchain of the Namecoin cryptocurrency any registration or record change must be recorded in the blockchain for everyone to verify and confirm.  Thus the small fees associated with registration and record modifications are the simple transactional fees that make the network possible.\n\nOkay, so you've followed so far up to this point.  Now we will look at how to point that **.bit** domain to our Zeronet site we have built.  When you click on the name record in the *Manage Names* tab of the Namecoin-QT wallet you will be presented with a window that looks like this:\n\n![Modify .bit Domain Records](https://s3.amazonaws.com/f.cl.ly/items/123N0W1o1E2b030H3G12/Image%202016-03-04%20at%203.55.07%20PM.png?v=699cacfd) \n\nSince we are going to be hooking up our **.bit** domain to Zeronet we need to use the Custom Configuration settings.\n\n![Add Zeronet configuration to .bit domains](https://s3.amazonaws.com/f.cl.ly/items/320B1D0o333i1i241z0W/Image%202016-03-04%20at%203.58.58%20PM.png?v=a7cdd86a)\n\nAs you can see we entered a valid JSON string into the empty field box that sets up the connection to our Zeronet site that currently lives at [http://127.0.0.1:43110/1C5P1EcTZA6FDEg4w6SacfPjvSDCWmzeyt](http://127.0.0.1:43110/1C5P1EcTZA6FDEg4w6SacfPjvSDCWmzeyt).  To make things easier I'll write out the JSON string so you don't have to squint and guess at the image.\n\n{ \"zeronet\" : { \" \" : \"1C5P1EcTZA6FDEg4w6SacfPjvSDCWmzeyt\" } }\n\nWhen we hit okay, if we are doing this custom configuration after our initial registration of the **.bit** domain it will cost us the 0.005 NMC to change the records.  And now you wait for the records and the domain registration to make its way into the Namecoin blockchain.  Once that is in the blockchain, and Zeronet sees the domain records (due to the *zeronet* configuration we entered above), we can now use our new **.bit** domain.\n\n[http://127.0.0.1:43110/cryptonbits.bit](http://127.0.0.1:43110/cryptonbits.bit)\n\nI hope these tutorials and mini-walk through posts are helpful.  If people find them useful I'll keep doing these.\n\n*Special Note* -- Be aware that there are many ways to register a .bit domain and command line methods of setting up the configuration of the .bit domain.  I simply wanted to show one of the easiest ways to accomplish the task."
		},
		{
			"post_id": 3,
			"title": "Are you still trying to figure out Zeronet?",
			"date_published": 1457095570.334,
			"body": "With so many different \"anonymous\" and \"distributed\" networks all competing for users it is understandable for people more familiar with one network to expect or look for features, sites, and/or functionality that exists on other systems.  So I thought I would provide a little basic \"how things work\" post to help people understand one of the core differences between Zeronet, Tor, I2P, Freenet, etc.\n\nFirst, at the heart of Zeronet is your own localhost.  When someone builds a website for people to use and visit on the Zeronet network, they do it on their localhost.  And at this point the site only exists on the site creator's localhost.  \n\nThe magic happens when that site creator shares the \"public key\" address of their site that is registered with the Zeronet network.  When someone visits the \"public key\" site a handshake/verification process begins within the content.json file of the site directory.  The visitor's localhost installation of Zeronet downloads the site's content.json file that contains a listing of all other file names, hashes, and the site creator's cryptographic signature.  Once the visitor's localhost is able to verify that the content.json file is for the correct site \"public key\" address and the validity of the site creator's cryptographic signature then your localhost downloads all the other files required by the content.json file and verifies it all using a SHA512 hash.\n\nNOW, going forward everytime you visit this site, you are actually visiting your localhost.  So even if you get disconnected from the intetnet and your computer has no outside connections, you can STILL access any of the sites on Zeronet that you have previously visited because they are all being served by your localhost.\n\nYou may have seen on the \"Zeronet Starting (Hello) Page\" that any of the sites that you have visits are constantly checking peers and downloading updates in the background.  This is because whenever an original site owner modifies their site they sign and publish a new content.json file and once the peers have verified the integrity (the site owner's cryhptographic signature) the peers begin downloading and sharing the modified file.  This means that even if you haven't visited a site in a while BUT your Zeronet connection has been open, when you final visit again you are STILL viewing your localhost version of that site.\n\nTL;DR - Zeronet is all about the localhost.\n\nNote: This is very basic core understanding and doesn't go into all the nitty gritty and details (especially for advanced and multi-user sites) but at least it should give some understanding."
		},
		{
			"post_id": 2,
			"title": "Anonymous and Crypto-Backed and Protected Community Options",
			"date_published": 1457041426.83,
			"body": "In a series of future-focused articles, I will be exploring multiple competing methods (that may also cross-pollinate) and systems for anonymous and protect communication venues.  This first post is going to stay simple and limited within the scope of simply identifying several of these systems.\n\nWithin the cryptocurrency world there are a number of alt-coins that contain the foundation for encrypted and decentralized communities and communication.  Coins like Shadow (SDC) with its ability to completely anonymize (and wash) coins to eliminate any tracing of transactional history is extremely useful.  And when you pair it with the encrypted messaging abilities it provides a really solid solution for a Proof-of-Stake coin that only requires a minimum of two peers to keep the blockchain alive.  There are a number of other cryptocurrency alt-coins that had excellent tech ideas like billing/invoicing systems, anonymous ecommerce stores over the blockchain, and even a twitter/Sone concept that occurred with low block confirmation times but it seems many of these developers either lost interest in their project or no longer have the funds to keep their project going.\n\nAs for other anonymous networks there are platforms like Freenet, I2P, Zeronet, Tor, and a few others.  But to survive as a future useful tool, I think its important that content creation and inter-account communication be at the forefront of the capabilities inside each of these secure network concepts.  In future posts, I'll be taking a close look at each of these options and looking at the usefulness of each solution from the eyes of a \"new entity\" joining the network.\n\nPlease let me know if there are other networks that I should also look at or that I missed.  You can always email me on ZeroMail at [crypton@zeroid.bit](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=crypton)."
		},
		{
			"post_id": 1,
			"title": "Getting things setup",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}