{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1DSVWXJjaSa3wDMjDLhsAP8W3a9ZMV49Mj": 1
	},
	"next_comment_id": 6,
	"comment": {
		"2_1CbWzhKQcoxwgB7z3ncTW5vdnvLM8xQDtV": [
			{
				"comment_id": 1,
				"body": "> [sickgamer2](#comment_5_1LExHAGduhvTgxYjDCJT6rMYi2zAuuWDju): c'est une blague ?vous critiquer le nouveau président, franchement vous faite ca ca chaque présidant francais !\n\nCe mail permet surtout de critiquer l'équipe de campagne, plus que le président lui-même. On s'en doutait, voici une confirmation, les gens ne se dérange pas à leurer le peuple voir le \"chef de file\" lui-même pour faire passer ce qu'ils souhaitent, et planquer des marges sympathiques... Cette fuite de mail permet surtout de deviner les rouages d'une machinerie, peu importe le parti ou le candidat : ça tourne probablement de la même façon chez tout le monde.",
				"added": 1498383587
			}
		],
		"1_12ieSrCzre9k5CCveXhcoC2fNV5Xmnx2NN": [
			{
				"comment_id": 2,
				"body": "Je plussois pour le retroshare !",
				"added": 1499087651
			},
			{
				"comment_id": 4,
				"body": "> [poka](#comment_1_1FcfmaNZ4nhcpk9dh6pVnnpaix2txLjTKZ): Salut salut!Heureux de voir des contrib t411 ici =DNous en train de relancer t411 sur ZeroNet. Nous sommes plusieurs modos et gros contributeur de t411 à nous rassembler sur Wire pour en discuter. Je travail à commencer la base du site. Tout aide est la bien venu! Vous pouvez nous rejoindre sur Wire m'ajoutant: @pokapowJe vous ajouterais alors au groupe de discussion en question.Sinon nous somme aussi sur l'irc t411 qui est revenu: https://search.mibbit.com/channels/t411\n> reloading\n\nSauf que t411 c'est pas seulement un site, c'est aussi - et surtout - un tracker BitTorrent... Y'a déjà des sites de torrent anglophone sur le ZN, et c'est souvent des annuaire de fichier torrent, qui doivent de toute façon se connecter à un tracker bien centralisé. Si vous voulez du bon décentralisé, faut se tourner vers les magnet et/ou des trackers publiques, mais j'ai des doutes qu'on puisse surveiller le ratio des utilisateurs du coup.\n\nEn fait, le problème du ratio, c'est que ça impose du centralisé... Sauf mauvaise compréhension du protocole BitTorrent de ma part.",
				"added": 1499110386
			}
		],
		"2_1DSVWXJjaSa3wDMjDLhsAP8W3a9ZMV49Mj": [
			{
				"comment_id": 3,
				"body": "zeromail enovoyé aussi",
				"added": 1499097493
			},
			{
				"comment_id": 5,
				"body": "> [padtrique](#comment_1_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): Je suis aussi intéressé, qu'est-ce qu'il faut comme infos pour s'échanger les contacts ?\n\nIl faut s'échanger le certificat, normalement tu l'as sur la page de démarage de retroshare. Les deux utilisateurs doivent s'échanger leur certificat pour communiquer.\n\nJ'ai toujours pas de nouvelle de troll, je sais pas si c'est zeromail qui bug (j'arrive pas à envoyer des zeromail à certaines personnes), ou s'il est juste inactif...",
				"added": 1499412930
			}
		]
	},
	"comment_vote": {
		"6_1Hqe3wJ9TbGJa9J47V8UZ71yoKdZxjmWLL": 1
	}
}