{
	"message": [
		{
			"body": "頭號親共僑領被取消綠卡陳用林：中共進退兩難(圖): 近日，被稱為“頭號親共僑領”的大陸富商黃向墨遭澳大利亞政府拒絕其公民申請，並被取消其永久居留權。黃向墨目前滯留海外。中共駐悉尼領事館前政治領事陳用林表示，中共當局面對這件事是進退兩難，如果中共進行反擊，就“坐實... ",
			"date_added": 1549523975036
		},
		{
			"body": "赴美产缺陷儿，弃子逃回中国 近日，美国知名华裔妇产科医生沈伯文表示，一对赴美产子的中国大陆父母，在美国医院产下孩子后，因宝宝有先天疾病，竟然闷声不响将其抛弃在医院，直接飞回中国！",
			"date_added": 1549524250259
		},
		{
			"body": "川普將軍習近平 死期限短3天 諾獎經濟得主：中國經濟算總賬臨近: 中美貿易戰死期限倒計時，川普總統日前明確拒絕3月1日前的川習會。美國學者謝田認為，川普拒絕川習會後，死期限前移3天。加國評論人士趙培分析，靠習近平和川普首腦會解決貿易問題實則“違背常識”。",
			"date_added": 1549631655257
		},
		{
			"body": "高官披露中美談判要破局 川普開辟一個金融新戰場 中概股受監管被指罪惡股: 白宮經濟顧問庫德羅周四對媒體表示，美中兩國目前遠不足以達成貿易協議，達成共識仍存很大距離。去年底，有213家在美上市的中資企業被美國兩家機構點名存在審計風險。有機構創始人指出，有些赴美上市公司數據造假，... ",
			"date_added": 1549631700626
		},
		{
			"body": "中共悄悄勾消喀麥隆一筆債務 為何怕曝光",
			"date_added": 1549789199450
		},
		{
			"body": "一名中国女子占据了菲律宾头条，只因为菲律宾警察安检时拒绝她的液体类危物进站，这位中国女子就将一盒豆腐脑泼在了菲警脸上！并使出绝招“仙人摘桃”，掐了菲警的蛋儿……很快这位女子被拘捕，等待她的将是菲国法律的追诉和刑期！",
			"date_added": 1549789232184
		},
		{
			"body": "一个反人类的怪胎(20190210) 美国监测100万颗小行星，中国监控13亿人民。美国有最强望远镜，中国有最多摄像头。一个面对未来一个僵化续命，穿着共产主义裤衩的权贵资本主义是一个反人类的怪胎。",
			"date_added": 1549789271384
		},
		{
			"body": "这轮打黑除恶，举一个案例：湖北某地，一个私营老板参与市政工程招投标，有高人好心提醒他不要参与，偏不听，结果被打成黑社会，没保护伞，无暴力行为，名下千万资产查没。公司两个小姑凉也成了涉黑人员，一个做标书的，一个呆办公室，其中一个怀孕在身，律师力争，一审合议庭同意缓刑。报上去，领导说严打，不能有特例，遂改成实刑。",
			"date_added": 1549789393168
		},
		{
			"body": "美議員明信片寄往中共監獄：李先生 我們支持你 我們也不會忘記你(圖): 非政府組織工作者李明哲因被判顛覆政權罪已在中國被關押1年多，其妻李凈瑜在美國時間7日拜會美國聯邦眾議員麥考文（Jim McGovern），2人在會面時，表示如何將李明哲解救出來是大家一致的目標，麥考文也允諾，將... ",
			"date_added": 1549789537936
		},
		{
			"body": "專訪川普前競選顧問：川普政府將中共視為頭號威脅",
			"date_added": 1549789748225
		},
		{
			"body": "去年揭露中國明星范冰冰逃稅的前中國央視主持人崔永元再度爆料！港媒報導，前晚他在微博揭發一名中共警察竟擁有5700萬港元（約新台幣2.2億元）巨款，要求公安部介入調查。許多人認為，此警察是上海市公安局經偵總隊六支... ",
			"date_added": 1549789810576
		},
		{
			"body": "遭中國大量盜伐木材 俄揚言關稅措施回擊(圖): 近年來，大量俄國西伯利亞和遠東地區的森林資源遭到中國公司破壞，大量俄國森林的木材被盜伐並出口至中國，引發俄國環境保護人士抗議。俄國當局近期表示，正在考慮利用關稅和海關監管等方法來解決此問題。 ",
			"date_added": 1549789956441
		},
		{
			"body": "印度总理访藏南争议地，中国外交部：坚决反对",
			"date_added": 1549790294570
		},
		{
			"body": "‪《卫报》：至少17名维族澳大利亚公民往新疆探亲期间遭中共软禁、监禁或拘押 ",
			"date_added": 1549897621412
		},
		{
			"body": "中美贸易新一轮对话谈判之际，两艘美国海军第7舰队驱逐舰驶入南海施行自由航行，引发中国强烈不满。中美两国上一次在北京谈判开启日，也有美国军舰在南海航行。评论指美国此时派遣军舰进入南海彰显震慑，但中国的抗议显示低调。",
			"date_added": 1549898049155
		},
		{
			"body": "多大中生网路串联 藏裔学生会长：对抗无知  多伦多大学才刚结束学生会会长的选举，就立刻在校内引起反弹。一群就读该校的中国学生疑因不满新会长支持西藏自由的立场，展开一连串的网路行动。",
			"date_added": 1549898220381
		},
		{
			"body": "维族澳大利亚居民被中国拘留，人权人士呼吁澳政府采取行动",
			"date_added": 1550033691776
		},
		{
			"body": "新西兰航班疑因没有矮化台湾被拒降落上海",
			"date_added": 1550033707635
		},
		{
			"body": "新西兰民航客机真相！ 原因是：这架客机的申请写的是台湾而不是中国台湾。这个应该是主要原因，另外，新西兰也阻断了华为5G网络。 又是政治报复！新西兰朝野义愤填膺，包括总理。 拿几百条生命玩政治游戏，多一半还都是中国人。真是不能低估红匪的流氓程度啊。",
			"date_added": 1550033787103
		},
		{
			"body": "纽时载文吁美不再容忍中国互联网封锁以市场换市场",
			"date_added": 1550033838026
		},
		{
			"body": "习近平急于见川普无助于贸易谈判，只为缓解国内压力",
			"date_added": 1550033946055
		},
		{
			"body": "制裁陳全國呼聲日高 議員：美應善用制裁懲治人權惡棍(圖/視頻): 美國一聯邦眾議員說，美國應更好地利用《全球馬格尼茨基人權問責法》這一有效工具，懲治貪腐官員和人權施害者。與此同時，人權組織呼籲特朗普政府盡快出台新一輪制裁名單。 ",
			"date_added": 1550034608516
		}
	]
}