{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1526288062,
			"title": "is this even active?",
			"body": "",
			"added": 1526288061
		},
		{
			"topic_id": 1528703264,
			"title": "Principles of content filter",
			"body": "This is what i think should be the principle of all content filter should follow\nfor it to be called reasonable, acceptable and to not malicious censorship\n\n**WARNING: Opinions ahead**\n\n- User must always have an option to opt out shall user not which to participate in it\n\n\\- Opting out will result of censored post no longer begin censored, and user should always have an option to opt out\n\n- Filter must not be forced onto user, but as an option for user to choose\n\n\\- When a new user joined the site, the filter should always be off, unless user turns it on\n\\- Grey area: Fliter is turn on when a new user joins, BUT it receives a prompt telling user to choose\n\n- User must be aware that the filter is active\n\n\\- Any filter should notify user of it existence shall user did not opted in(if user opted in, we can safely assume user know it's ongoing thus there's no need to be notified)\n\nDid i missed something? comment below\n(no idea why i choose to post here but probably because of the high limit and feel like we should cultivate more insightful discussions)",
			"added": 1528703262
		},
		{
			"topic_id": 1528712915,
			"title": "Why there should be bandwidth control",
			"body": "Bandwidth control is defined as in the ability for user to control their bandwidth in upload and download, like download and upload max speed, and total bandwidth or in more advance manners total upload ratio and persite ratio or peer count overwrite for sites that has small peers\nTLDR: basically we should have torrent control as advanced as a torrent client can be\n\nfor example: bob has limited bandwidth data cap, so he can set the global seed ratio to take priority and will stop at 1.5 ratio\nso he wont eat up his upload cap while at least begin able to give back more than what he take,\nbob dont really want to also render small sites inaccessible so he set it up that if sites have lower then 20 peers it will keep seeding\nwhen bob return to home where he as unlimited bandwidth he can switch to his normal template and only enable limited when he's tethered to his mobile data\n\nthe example also run well for people who runs zeronet on a phone, normally most phone data also comes with data cap restrictions,\nso these will greatly help user's quality of life without having to kill and restart zeronet to prevent it eating up bandwidth\nbonus, user can also set it up that when it's connected to a trusted network, it automatically change to unmetered mode and change back to metered when it's no longer connected to a wifi\nin this way, even mobile can contribute to the network when its able to\n\nSide note:\nI am NOT suggesting we make seeding disable by default, i think if the user find a site's content that they do not support or wish to, they can turn off seeding which must be manually invoked by user\n\nPossible Arguments Against this:\n\nArgument 1: Leechers, there will be people who will just stop seeding a site after visiting it with no reason\nWhile it's true, lets ask our self, how many times did we visit a page and find nothing interesting or content you dont want to seed then proceed to delete it, there's also no way to counteract that other then having more peers\nI argue not seeding and dont delete is better since if you will visit the same site again now everyone have to give you the same files that you could have just not delete so you get to keep your upload,\nAnd torrent existed for so long and they still fine, because there's always more generous peers in the swarm then leacher\n\nArgument 2: It goes against the principle of zeronet that everyone should be helping each other\nbut there's a line between \"forced\" to help or helping voluntarily, and begin forced does violate zeronet principle that everyone is \"free\"\n\nArgument 3: It throws newer sites with less peers under the bus\nyes but only if the newly joined peers aren't interested and decided to delete after viewing(which is already happening) or not seed, there's not much more then to advertise your site more to get a few generous peers\n\nPros and cons of adding it:\nPro: Users now finally can control their bandwidth\nCon: Some users will abuse it",
			"added": 1528712912
		},
		{
			"topic_id": 1529347344,
			"title": "Concept For Blockchain Like Data Storage System",
			"body": "To start you will need to understand what is blockchain and bitcoin,\nin this example we only care about blockchain, bitcoin is irrelevant as you just need to understand the differences between both.\n\n>A blockchain, originally block chain, is **a continuously growing list of records, called blocks, which are linked and secured using cryptography.**\n>Each block typically **contains a cryptographic hash of the previous block, a timestamp, and transaction data.**\n>By design, a blockchain **is resistant to modification of the data.**\n>It is **\"an open, distributed ledger that can record transactions between two parties efficiently and in a verifiable and permanent way\".**\n>For use as a distributed ledger, a blockchain is typically managed by a peer-to-peer network **collectively adhering to a protocol for inter-node communication and validating new blocks.**\n>**Once recorded, the data in any given block cannot be altered retroactively without alteration of all subsequent blocks,** which requires consensus of the network majority.\n> - Definition of blockchain copied form wikipedia\n\nTo begin with, we have alice and bob playing chess as an example,\nIn this example alice will start by forging a genisys block,\nThe genisys block will have the settings for the chain.\nThere will be a few possible values in this example:\n\"signature\" will be auth address and signature\n\"admin_signers\" will be an array of signers auth address that can alter block settings //probably be redundant as one can just fork it\n\"signers\" will be an array of auth address that allowed to forge and chain block to this chain\n\"nonce\" will be a field for random data to alter/ensure hash wont collide\n\"starting_board\" will be the initial board state, will be default or customized for custom games, there should be indication of who is at which side(for chess piece direction), and \"authaddress_piecename\" for each piece\nIn this example there will only be these, but in other needed case we can add more network consensus and initial states for different games/usecases.\nThis will be saved as hash_of_block.json in a folder WITH the hash of genisys block is suggested but not enforced,\nThere also should be blockmetadata.json which have \"genisys block\" assigned to the hash of genisys block allowing it to be found easier.\n\nNow, alice can choose to forge a second block to dictate chess movement, or broadcast it for bob to reply.\nThey can also choose to play by the free for all, first who broadcast gets to be first.\n\nIn this example alice choose to be first,\nSo alice will forge another block to dictate her move, this will be a \"normal block\".\nIn this example the block will have:\n\"signature\" will be auth address and signature\n\"genisys_hash\" will be the hash of genisys block maybe just redundant\n\"parent_hash\" this will the hash of parent block\n\"move\" will be alice's move, example can be first \"coordinate -> second coordinate\"\n\"nonce\" will be a field for random data to alter/ensure hash wont collide\nWhich she will have to broadcast both to bob.\n//Timestamp simply not included as it's easily faked and quite useless, if the client want, they can inject cliend sided metadata of when they recieved it\n\nIf the match/moves deem unfair bob can simply forfeit/reject to continue the match until a valid move is made or allow it by continuing the chain,\nIf this match want to be eternal and un-erasable it can be broadcasted to peers of the network who will keep a copy of the chain and also validate it against consensus rules,(note, everyone keeps THEIR OWN COPY OF THE CHAIN kinda waste of dataspace rn since zeronet dont treat it as the same object even if it has the same hash)\nto make it accessible it can just be saved in optional files:\n/user/data/usersauth/optional/chains/genisysHASH/ (chain data here) which allow peers to download it,\nor we can also have a protocol to request certain blocks using P2P message plugins for example.(protocol wise may be covered latter...)\n\nThis process can keep on continuing until the end of match is met.\n\nThe special \"feature\" of this method that, this is a branching blockchain,\nthere's no \"real\" chain like money it's as real as it gets because we all agree it worth a value.\nSay alice won, and bob want an rematch, bob can choose a blockhash where he thought he could make a better move,\nHe will revert the board to that blockhash and make a move then broadcast it, which alice will continuing play on the new forked chain.\nThis process can be repeated indefinitely until both parties are satisfied/bored to keep on playing and forking\n\nThere's also a special block called \"fork block\",\nsay caral and dennis want to \"mirror\" a scenario from alice's chain they can \"fork\" it.\nThis is kinda like a \"genisys block\" but continuing after a chain and keeping it's data and telling the network that consensus has changed.\nThere should be:\n\"signature\" will be auth address and signature\n\"parent_hash\" will be where the block was forked off\n\"previous_genisys_hash\" will be the previous genisys block's hash \n\"admin_signers\" will be an NEW array of auth address that can alter chain settings\n\"signers\" will be an array of NEW auth address that allowed to forge and chain block to this chain(should be caral and dennis)\n\"nonce\" will be a field for random data to alter/ensure hash wont collide\nChain data should be stored in /user/data/usersauth/optional/chains/genisysHASH/forks/newgenisysHASH/ new chain data here including new metadata files.\nAll blocks forward will refer this \"fork block\" as genisys as in the genisys_hash.\n\nNow they both can play against each other on the \"same\" chain while making their own moves.\n\nNetworking side:\nEach broadcast can just be simply packets sending out the new \"block\" for subscribers of the chain.\nNodes should also be able to query by a block hash+genisys hash.\nNodes should be able to also get a list of hash by a genisys hash\n\nAPI side:\nThe library will try to fetch all blocks and index them\nthere will be _internal or something else which is used to store internal data and excluded when hashing for verification\nafter indexing the library will try to link things together like having get parents and childs, get forks by genisysblock ETC so developers dont have to deal with raw data\n\nAfterthought: why do I write wall of text that I am certain I am not capable to implement nor anyone will read",
			"added": 1529347340
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1516525820_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "cant using external images leaks user's IP?",
				"added": 1528706208
			},
			{
				"comment_id": 2,
				"body": "> [balancer73](#comment_18_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Any use of external images can always reveal your IP. But those users who beware this, use Tor :)\n\ni think it should just only use internal ip linking for images",
				"added": 1528708745
			}
		],
		"1528703264_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 3,
				"body": "> [gamer](#comment_2_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh): I believe that optional content filtering is something that would be of benefit to ZeroNet.  I also believe that a Web of Trust model could be leveraged to provide a wealth of options to ZeroNet, one of which being optional content filtering.\n\nyep as soon as \"optional\" became mandatory it's no longer called content filter but censorship\nand yeah i believe if someone is capable enough we can have some sort of web of trust plugin to trust/distrust user's action like voting a post as spam\nwithout WOT, we will have to have blind fate in that votes are not manipulated\nin WOT if we find someone we trust voted it, we can trust that the vote is correct",
				"added": 1528786730
			},
			{
				"comment_id": 4,
				"body": "regarding the first part, it sounds like a filter bubble 2.0 but what i like about this is, it's user's choice to filter for themself,\nnot in the hands of some company with some hidden algorithm and no way to opt out\nyes you might not like cats, but this time, you get to define what you dont like, or if you choose to face the unfiltered results, it's all solely up to you, not some site that tries to do it in interest of keeping you longer on the site\n\n> [gamer](#comment_3_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh): Even filtering that is perceived as \"mandatory\". \n\nthe problem lies in when the core decided to force it, but this is OSS and i am sure someone will decide to make an alternate with no forced filters\n\n> [gamer](#comment_3_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh): A WoT zite might not be trusted, so having protocol that enables users to host their own trust dbs adhering to a specific format might be handy. The WoT site should be FOSS and/or able to be cloned, so that if there is a trust issue with the zite owner, others can spring up without effort and \"merger\" (or something) the end user trust dbs.\n\nI agree, the standard should be set by community consensus and it should no doubt be open standard\nthere's a few possibilities..\n\nwe can embed WOT data on said same site, say a search site will have /userdate/$authaddr/wot/ (wot data here)\nthis means that WOT is dependant on site owner\n\nwe can have WOT to be under a usercontrolled site which the WOT metadata will live on\nwe still need some discovery method to link $authaddr to $wotzite ideally without indexers as it's censorship prone\n\nit's still kinda up to site to allow/enable WOT support\nthe WOT should be handled by plugin rather then site, say i click WOT button it opens the prompt of options to vote\n\nfor the control panel of WOT it should be the WOT plugin page if this was implemented by plugin",
				"added": 1528819292
			},
			{
				"comment_id": 5,
				"body": "> [gamer](#comment_6_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh): content curation gateway\n\nproblem lies in gateway begin compromisable but it's still inevitable\ni still dont see the differences in embedding it in the same site\n\ni guess if we want we dont even need an plugin to handle WOT, site based can also handle WOT\ntho if it's plugin site and a single owner controlled site, we can easily patch it, say a site dont support WOT, we can somehow patch it to support it without modifying owner's site",
				"added": 1528821323
			},
			{
				"comment_id": 6,
				"body": "> [gamer](#comment_7_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh): Oh, you mean embedding it in the curation zite?  The problem there, IMO, is that if the curation zite is not to be trusted, then we can't trust the user data stored there.  Users should store their own data independently of the curation gateway.  That should allow us to move from an untrusted WoT zite to a trusted one without losing the community curation data, and still being able to trust that our trust level of their trust data is accurate.\n\nthe data can be trusted because it will be signed by the address you trusted, if it isnt, the file is automatically invalidated\nif we are still following, a \"trust\" is just something like this\ni tell my friends i trust bob a lot, he's a good and honest guy that you all should do business with him if you can\nsay my friend is alice, carol, daniel\n\nalice trust me a lot, since i vouched bob, she now also trust bob because of me, she doesn't explicitly trust him but proxy via my trust\ncarol trusted me a bit so, bob inherit my trust of carol<=>me\ndaniel trusted me a bit but he dosent really easily buy people's vouch so his trust will still be unknown to bob\n\nthis can be translated to:\ni announce my trust of me->bob to be level 10 by placing a file/array/whatever that denotes i trust bob with level of 10, and of course sign it\nalice trust me a lot, the client sees i vouched bob so now it sets bob's trust to be proxied via me and say it will be me<=>alice trust -1 as bob's trust level\ncarol trusted me a bit so, bob inherit my trust of carol<=>me\ndaniel trusted me a bit but his client is set to dont listen to vouch unless trust of target is over 20, but my trust level is lower so it's ignored\n\nbob can be a site, an action(flagging a post) or anything\n\nstill if the files are attached to the site, if owner bans me, the web will be lost together with my data\nzites cant control my post here, because i signed it with my signature which only i have, same thing goes on the WOT i announce\n\nif say everyone vote a site as not trusted, the only thing admin can do is ban these who voted it not trusted\nbut most sites uses it for content moderation, not moderation of the site itself\nlike for example if a post on zerome is NSFW, or if a post on zerotalk is spam and should be hidde\n\nif you dont trust the site, there's even more to consider, since everything is done by javascript, what's stopping sites to manipulate the UI, so that voting \"distrust this site\" on the page actually is masked to vote it as \"trusted\"\nwhile we are in control of our data, the data is processed/manipulated by the site's javascript before begin signed\n\njust like if the siteowner want, he could make autoreplacing \"fuck\" to \\*\\*\\*\\* via javascript\nyes i still can do it via editing my jsonfiles but it's still possible",
				"added": 1528833763
			},
			{
				"comment_id": 7,
				"body": "> [gamer](#comment_9_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh): That makes sense.  What about the event where the zite owner is intentionally a jerk, and deletes the trust dbs?  Shouldn't they be controlled by the users to prevent this?\n\nthey cant be deleted, like i said, owner cant delete my post, only thing he can do is ban me\nbut by under that assumption shouldn't all forum post be user controlled too?\nit's generally a balance between convenience and implimentation\n\n> [thunder33345](#comment_6_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): if you dont trust the site, there's even more to consider, since everything is done by javascript, what's stopping sites to manipulate the UI, so that voting \"distrust this site\" on the page actually is masked to vote it as \"trusted\"\n>while we are in control of our data, the data is processed/manipulated by the site's javascript before begin signed\n\n>just like if the siteowner want, he could make autoreplacing \"fuck\" to **** via javascript\n>yes i still can do it via editing my jsonfiles but it's still possible",
				"added": 1528878439
			}
		],
		"1528712915_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 8,
				"body": "> [ssdifnskdjfnsdjk](#comment_7_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): You probably mean by setting high DL speed and low UP speed. This con can be removed by allowing always same up/down limit: Set bandwidth limit for ZeroNet in KB/s: 200--> roughly 100kb up, 100kb down [...]\n\nif we gonna limit user's option, why even bother, why not just keep it like this\nyou either believe user should be in full control, or have no control and it's at developer's mercy to force them to do whatever developer wish\n\nif they wanna abuse they will find another way anyways, torrent got past that easily, i dont see why we wont do the same\nthere's already 3rd party tools that's capable of limiting any app's bandwidth\nor if i am crazy i can limit zeronet's port via my router",
				"added": 1528953540
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_8_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): is good idea, mainly for mobile network users.\n\nactually i think yeah that will be good\nalso generally you arent \"leeacher\" because you have a lower upload rate\nmainly leeacher is a term for people who do nothing, and have no intention to reach 1.0+ ratio, mostly hit and run(download and dosent seed any)\nyou might only have 10mb down 5mb up mobile sim, so you set: 4mb down and 2mb up\n\nyou arent leeaching, it's just ATM you arent contributing, what if you will remove the limit when you reach home and docked to a power source? and your home network have 50 mb up and down and will easily give back more then what you take",
				"added": 1529049648
			}
		],
		"1529347344_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 10,
				"body": "> [htgozn](#comment_3_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): I read, also there is a working model of what you propose. [...]\n\nThey just look something like filecoin or something doe\nThe idea is that all \"chains\" data is public, anyone can request it and if someone has it they will share it\nIf the data is deem private, only two parties(both player) will have it and it wont be broadcasted to the network\n\nWhen i said blockchain, i dont meant storing things in a blockchain, i meant utilizing the blockchain method to store data, like now no one can alter the previous moves, because my move have a hash to your move that isnt altered, if you alter it your hash changes thus invalidated it",
				"added": 1529561190
			}
		]
	},
	"comment_vote": {
		"3_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh": 1
	}
}