{
	"next_comment_id": 51,
	"comment": [
		{
			"comment_id": 1,
			"body": "如果可以，请认同的人，以后在各处留言评论最后落款都用公正（党）二字，私人的账号不方便，可以注册个小号，头像显示名统一，先感谢各位了。以这个带动其他人知道我们的存在，也许能代替民运大佬的作用，让文章被广泛讨论。\n\n——公正\n",
			"post_id": 2,
			"date_added": 1520477420
		},
		{
			"comment_id": 2,
			"body": "> [chengxing](#comment_1_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 直接上来就用公正党，敢用的人就少了，建议先期用公正，反向歧视，偏担坏老人，坏女人。这些具体的不公正现象。为名好些。不要固定标志。这样一是没有党派信息，否则安个罪名抓了。二是更具体，可以发动所有人。三是容易聚集相同观点的人对相关不公正现象作出改变。四，大众又不傻只是恐惧，只要他们看到了这些以往不常见的现象出现，必然会懂，并默契参于。多不明显标志可以避免直接冲突，恐惧，审查，分化，，好处太多了。中共肯定是使用了用偏担坏老人和坏女人来分化绑架民主力量的。\n> 建议此文章分成几篇，附相关链接就是了。现在这长，难以突出重点，中心思想，总结。我这有耐心都只看了大半。\n\n只写策略也可以，但是一是没有说服力，二是并不是对现有民运的重塑，很多行为需要规范的。如果把文章分开几篇了，绝对会出现，只看其中一部分的人，但是其实他们的问题并不会去改正。\n\n那个名称，我说了大家可以一起讨论，就像具体活动里面说的，甚至用什么联合会。不过，我希望大家仔细看，我这个选词是有讲究的，既不代表具体含义（所有人不会成为某些特别事件维权的附属品），又有特别意思（公平正义），还是共产党自己经常宣传的。\n\n关于标志，可以直接用公正画个圈，这也算标志，我个人看法标志还是有必要的，标志比文字显眼，更能形成统一印象。\n\n其次，所有的前提还是要这篇文章被广泛传播，我认为能翻墙的人数还愿意参与的上百万没问题，这就是我在文中说的前期团结的目标，只要在墙外传开，热烈讨论，不足之处大家一起完善，完全可能在今年就出效果，直接到可公开抗争的时间。\n\n如果可以，请尽力传播这篇文章，zeronet外的可以给他们发medium那里的链接，或者发文档。",
			"post_id": 2,
			"date_added": 1520658752
		},
		{
			"comment_id": 3,
			"body": "> [chengxing](#comment_2_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 一，好多博文没有写文章名。这样不便于查找，阅读。二是，去中心化，又不散的方法就是尽量团结一切可以团结的力量，多沟通，达成更广泛的共识。先期不用党派字眼可团结到更多恐惧的人。中后期人多了，他们胆子大点了再用党字还差不多。三， 这是大事需要一整套体系策略。建议参考区块链，比特币及其它币的发展历史，宣传方法。linux开源系统的发展，哲学。很有借鉴作用。\n\n没写文章名的就是发推那种感悟，没想形成什么文章的。\n\n这个大事，我一个人肯定考虑不全，但是后记里我也说了，我尽量写全是因为怕自己哪天就被抓了。",
			"post_id": 16,
			"date_added": 1520661156
		},
		{
			"comment_id": 4,
			"body": "> [chengxing](#comment_4_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 随笔也先写个标题的好，以后可以更新。否则很混乱，各种话重复的说。你累，看的人也易疲劳。毕竟这个可不容易继续阅读。过一会再接着读又要翻好多页。我信息公开好久了，也没事，大不了等喝茶后再说。\n\n这事不会只是喝茶那么简单的，我去加个标号吧\n",
			"post_id": 16,
			"date_added": 1520661621
		},
		{
			"comment_id": 5,
			"body": "> [chengxing](#comment_6_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 因为我没有号召建党派，只相当于维权。我讲究润物细无声。治癌症，艾滋病先从细胞以下层面开始。\n\n我在后记里提过，我既然做这事，不会抱幻想。\n\n至于结果，发展知名度的时间，我是等不了了，我只能期待有赏识的人愿意传播。\n",
			"post_id": 16,
			"date_added": 1520661890
		},
		{
			"comment_id": 6,
			"body": "> [chengxing](#comment_7_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 这不是个人道德和勇敢问题，通俗说要接地气，方案要尽量的更多人愿意参于和共识。更能触动人，更快见效。\n\n我不是在说道德问题，我是说你说的喝茶，后记里提过，任何民主有关的怎么都能给你找到罪名，我是没抱幻想跟他们辩论。\n\n其实接地气，这文章里面讲的全是怎么发动基层民众，你应该能读出来我多接地气。",
			"post_id": 16,
			"date_added": 1520662269
		},
		{
			"comment_id": 7,
			"body": "> [chengxing](#comment_3_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 这是其它平台链接呀，这重要应该添加文章名吧。文章名现在也可以修改的。这博客没有目录，我的零网博客有。最好早日换个博客或添加\n\n有添加目录的教程吗，我克隆的官方blog，再换有点麻烦啊\n",
			"post_id": 14,
			"date_added": 1520662313
		},
		{
			"comment_id": 8,
			"body": "> [chengxing](#comment_9_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 是相比其它我所有见过的更接地气，但还可更接地气。我判断我的方法更接地气些。\n\n我不争论……我回twitter尽力去传播了",
			"post_id": 16,
			"date_added": 1520662502
		},
		{
			"comment_id": 9,
			"body": "> [chengxing](#comment_10_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 怎么能说是争论?你现在做的事不是用量可以补的。不讨论不会有更广泛的共识，更有效的策略。现在你的所有文章只有百分之一的人会看，愿意看。没有一篇能让百分之五人愿意读完的。策略再好，只有骨干，没有血肉。愿意的还是愿意，不愿意的还是不愿意，形不成势。\n\n我说了是需要广泛的讨论啊，这个愿意，就是靠你们看过的推荐啊，我当然也可以随那些民运大佬一样整天侃侃而谈，混成大V，那得多久？我用量传播不是我认为是最优解，而是我的无奈之举，关于你说的方法，影响身边人，其实我在里面就说过了，我不太认为这种方式这些年起了什么作用。",
			"post_id": 16,
			"date_added": 1520663868
		},
		{
			"comment_id": 10,
			"body": "克隆了博客，改不了了，忘改身份签发了，虽然后来改回来了，但是评论修改删除都不行，文章倒是可以操作。",
			"post_id": 16,
			"date_added": 1520667888
		},
		{
			"comment_id": 11,
			"body": "> [faith](#comment_2_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz): 至于统一标志，让我想起了有一部电影，大概叫做浪潮还是死亡诗社的，是说统一标志和服装导致了学生组织的强大力量，揭示纳粹的秘密。也让我想起了大陆前几年盛行“公民”标志，抓人非常方便。\n\n所以单列策略显得特没水平，只有结合长文看，才知道具体特别在哪，这个模式不会向其他模式那样公开，也不会像其他模式那样几个人参与，必须读完全文，才能理解为什么只要传开就会有很多人参与，不是之前那些，说的怎么有理，都没人愿意实际去做。\n",
			"post_id": 20,
			"date_added": 1520735734
		},
		{
			"comment_id": 12,
			"body": "> [chengxing](#comment_14_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 你的博客已经可以修改评论了，你怎么做到的呀。还有你尽然可以直接克隆对方站点，而保留之前站点数据。评论。\n\n保留站点data目录，其他拷其他博客的过来，自己再改改信息。签名发布，暂时我不知道这种方式会不会有问题，你可以克隆我的博客。",
			"post_id": 16,
			"date_added": 1520735818
		},
		{
			"comment_id": 13,
			"body": "> [chengxing](#comment_16_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): telegram,g+社区，推特全上吧，这几个平台人多。开了通知g+社区最即时高效。建议这个发力路线为零网再到其它平台，重点g+,第三站才是推特。\n\nG+有人用啊，我几乎找不到中文社区，缺点是G+要手机号，telegram也是。telegram还可以用虚拟号，Google绕不过。",
			"post_id": 21,
			"date_added": 1520739463
		},
		{
			"comment_id": 14,
			"body": "> [yas](#comment_1_1965fNDmmvHB3LFPmAHkb9vqBN484QEM2a): 如果你考虑到国内的朋友，可以用roit.im如果是海内外者乱炒菜的，可以telegram很强大。如果是开站点发消息发博客以及论坛讨论，零网尽管很多滞后性问题，但还不错。\n\n考虑国内，最终也得翻墙，因为只要发展起来了，肯定会封，虽然riot可以自建服务器，但是建一个封一个，不如直接用墙外的。但是很多人又惮于telegram的手机号问题",
			"post_id": 21,
			"date_added": 1520747185
		},
		{
			"comment_id": 15,
			"body": "> [yas](#comment_2_1965fNDmmvHB3LFPmAHkb9vqBN484QEM2a): roit.im还不错。如果不考虑传输文件，那么signal,discord也都行。telegram有技术难度，目前也有被利用控制和攻击用户的嫌疑。\n\n考虑手机号的话，discord，riot确实是最好的",
			"post_id": 21,
			"date_added": 1520779922
		},
		{
			"comment_id": 16,
			"body": "> [icedwatermelon14](#comment_1_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb): 大致地浏览了一下 长文，文中很少提到意义的一块，因此我还是不太明白其中追求民主、进行民运对于人的意义，我认为这是整套逻辑中最关键的一环。\n\n我在最开头就说了，为什么要变革是翻来覆去讨论问题，这文章是集结认为需要变革的人，认为中国挺好的不需要改的，是需要很后期才能影响的，暂时不在考虑范围之内，你如果真的涉及面够广，我不认为有人能认为中国的现状正常。也就你说的变革没意义",
			"post_id": 23,
			"date_added": 1520820655
		},
		{
			"comment_id": 17,
			"body": "> [icedwatermelon14](#comment_3_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb): 我不认为有什么事物是在哪一天是“正常”的，因为没有一个我信服的关于“正常”的定义。\n> 我看了一些关于主张民运、民主的变革人士对民运的意义的思考，没有一个人用一套逻辑清晰的理论去支持他们自己的观点，都是通过自己的发展了的世界观、价值观去随意地区判断事物，就认为自己的逻辑、想法是“顺畅的”、“正确的”的了。我认为像这种，就是一种复杂一些的、隐藏得更深一点的泄愤罢了。\n\n你这就是完全用定义来驳斥现实，只考虑哲学上的意义，却不考虑人类现实世界的文明。用一点相同性来对等，来脱罪，我不会纠缠在这上面。你要觉得中国真的发展好，你是没考虑经济分布吧，中国人绝大多数人一生没有时间是在享受生活。我相信你又会说国外人也一样，要看事情，请看细节，请尽可能多对比。\n\n如果你认为现在不正常但是也可以，那你觉得如果没有这堵墙，人民可以表达，会有一半人觉得正常吗？\n\n其次，如果你看了，你应该知道我的目标并不是现在推翻共产党，只是自由表达，无审查。别再用管造谣管色情来辩了，你认同不了，那我只能等，我并不指望被自由主义混淆的现在能那么简单被理顺。我只指望认为需要变得人，我不会讲为什么需要变革，这是浪费大家的时间。",
			"post_id": 23,
			"date_added": 1520833133
		},
		{
			"comment_id": 18,
			"body": "> [icedwatermelon14](#comment_4_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb): 我有点看不懂你在回复谁...因为我感觉你在回复的时候，好像在多处预设我的立场。比如：你的第一句话说：“完全用定义驳斥现实”，可能是预设了“我认为中国的现状是正常的，要看你怎么定义”的立场。然而我并没有这样的立场，我实际上是在质疑你的用词。\n> 我所提到的“正常”，是见到你在使用“正常”一词的时候，有点理所当然了。因为一个词语我认为是有它的适用范围的。你使用“正常”去形容国家的现状，这不符合人们日常使用的范围，因为你可以说人的身体是正常的，意味着没有显著疾病、充满活力、四肢健全，但是在形容国家的时候是没有明确的定义的。\n> 所以你如果在使用这个词，并且超出了它通常的使用范围，我认为是需要先行定义的。\n> 关于第二段：“如果你认为现在不正常但是也可以，那你觉得如果没有这堵墙，人民可以表达，会有一半人觉得正常吗？”我想指出的是，这里的“正常”与价值观捆绑了。这样就会让“正常”变成一个宽泛而繁杂的概念，令人难以领会了。\n\n不好意思，我用词不规范，也许不该用正常，但是不用那词，我不知道怎么对应你说的变革的意义。你回复，我肯定会根据你的用词来猜测你的意思的啊，而你的回复我的判断就是你认为其实现状不好不坏，没必要动。如果你理解不了我说的正常，我想表达的正常是什么状态，而只是渴求正常该是什么定义，好跟我辩论。那这是价值观的冲突，不认同我的价值观我不强求。我不解释为什么要变革，问这问题的人我暂时没指望认同我。我在开头就很明确的表达了，这文章不解释为什么要变革，但是你却选择性屏蔽。你真要追究，对人民就是有冤必伸，不会被掩盖。\n\n如果不知道对人民的意义，请多看点事，去新疆西藏走走。如果还是觉得没意义，那就算了，你一直让我说对人民的意义，新疆人民也是人民。\n\n其次，我在文章也明确解释过，关于有的人认为现状不需要变得那种心理。你如果是真的不知道为什么，你只能靠以后的生活感受才知道，在那之前我不可能说服得了你。如果你是想引起辩论，我不会接受的，这种伎俩我不会被引着走。要玩文字游戏，恕不奉陪。\n\n不管你是哪一种情况，我都不愿意在这上面花时间，我并没有指望现在就说服所有人。",
			"post_id": 23,
			"date_added": 1520865618
		},
		{
			"comment_id": 19,
			"body": "> [chengxing](#comment_19_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 你弄个长文一，长文二，，，这样容易接着看也便于定位翻页。没量超大那种心理压力。 在很少有人看长文。并不是要提炼出来。\n\nsteemit的正好，因为那里长文容不下，分成了7篇",
			"post_id": 20,
			"date_added": 1520915482
		},
		{
			"comment_id": 20,
			"body": "> [lizhanshu](#comment_1_1DbrSfnbumfV45oVXiprzK6N9qSHCsWGx): 虽然世俗的眼光经常存在着各种偏见，但总有一些脱离势利眼的觉醒者在行动。 长文如果很有水平，会有人看的。  转贴到论坛去了，供更多网友们参考：http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DbrSfnbumfV45oVXiprzK6N9qSHCsWGx/ 不用担心没有希望。越来越多素不相识的人在探讨文明转型，本身就是一个最简单的事实， 说明光明即将突破黑暗！哪怕很多探讨是带有争议性的，仍然蕴藏着巨大的推动文明进步的历史动力！\n> 可能内容太长了，以附件形式上传到以下网址：http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:4_1DbrSfnbumfV45oVXiprzK6N9qSHCsWGx/\n\n是的，我在后记里也说过，写全面是因为不知道自己会哪天被抓，很多具体活动形式，都需要大家一起探讨，我并不是觉得都该听我的，有理才能服众",
			"post_id": 24,
			"date_added": 1520921370
		},
		{
			"comment_id": 21,
			"body": "> [xijinpingdevil](#comment_1_19iT2hvxE2hqh87ywgpuqKSy42T9tuX2TP): 顶！ 陈小鲁暴毙，接下来是刘源、刘亚洲… 链接分享：https://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc全民共振、全民上街!顺应天意、符合民心!\n\n希望他们一起考虑下这个，一起探讨我长文说的模式，因为他们这种那么分散却公开的没人敢参加的，国内民众的情况没想象的那么乐观，我文中提供信任度，可以仔细阅读下。",
			"post_id": 20,
			"date_added": 1520921528
		},
		{
			"comment_id": 22,
			"body": "> [chengxing](#comment_21_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 哪篇文章?给个链接也好呀，长文可以分成几篇，标上章和节就是，这样有章名和节名，想看的也可以连着看。给出同章的节链接就是。你说的<<困局与对策>>这一文是指的哪个?并未见其文章名。没标还是没写或是在其它位置很出名?原来在这，http://127.0.0.1:43110/19bL8w6dqoU6vc4d7gnVmDAbDmpBvdVoxz/?Post:2\n> 我上次留言向你提过，让你弄个时间索引的功能。我博客现在就是这么干的，可克隆版面。这样才能看到所有博客目录。现在的目录字小，且只有最近的文章列表。并不全。你不会认为就靠这篇就能得到认同，大规则传播吧。少了血肉。只有骨干。对民众的近况没有直接有效的方法。当初中共是用打土豪分田地才获得的支持。要是和他们讲民主，谁理呀。你现在就是陷入了这个问题。\n\n我其中说了，我现在的目标是先把求民主的集中起来，民众我吸引的方式也是跟他们相关的利益，问题是文章传不开。我有那个自信，文章传开，能获得这群人的认同，不是你说的民众，你还是看得不仔细。\n\n文章并不是骨干，其实很全了。其实一切只是知名度的问题，但是如果我需要变成我文章批评的人才获得传播，那这事我听天由命。我并没想成为大V，这群人要是喜欢整天跟着大V混，我永远改变不了，那这现状我尽力了。",
			"post_id": 25,
			"date_added": 1521084351
		},
		{
			"comment_id": 23,
			"body": "> [chengxing](#comment_22_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 那你先把民众相关利益的文章弄点出来呀，现在大家没看到，只会认为还不具体。有的人会想是空中楼阁。现在网上民众利益那些是难争取的，如税，言论审查，，说再多一时也难有效。直接就面对中共?先找容易的。像我的博客中写的多是老人，妇女多被你共拉拢了。也容易洗脑，配合。特权多，绑架着有担当些的人的思想行为。这是论理上的绑架。道德上的绑架。如果破解不了。根本不可能有希望。钱，权，影响力，大的变态。他们平时在新闻上丢脸，被骂。可是那是其它人受了他们的苦和气，在网上爆发下。真见面了，只得供着，怕的要命。这又有什么用。他们本来就不要脸。并且平时少看那些新闻。他们的影响力多在老家。用赶情，金钱，几十年积下来的同盟。以前我以为外出打工或是一条路。可现在你共又在赶人。那些年轻人还是多要回家乡。一切归零。在外面文明，回去了也变一样了。\n\n我说靠先集结的线下影响，你说的那种人不是靠一个人的文章影响的，他们必须要看到实际行动影响他们。\n\n我不是写了吗，让能看到文章的在境内伸张正义，自然能拉拢他们，他们还不会觉得在牵涉政治。你说的看文章觉得跟自己无关的，我说我不指望团结他们，只是不指望说服他们。",
			"post_id": 25,
			"date_added": 1521096796
		},
		{
			"comment_id": 24,
			"body": "> [chengxing](#comment_23_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 你说让他们申张正义，首先，太不具体了，二，不能解决好人吃亏。难以发展的。\n\n我说的匿名引导舆论，没有公开，开会讨论就是了，这需要怎么具体，哪有什么吃亏。你这才是难呢，一开始就要全拉拢。",
			"post_id": 25,
			"date_added": 1521097201
		},
		{
			"comment_id": 25,
			"body": "> [chengxing](#comment_23_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 你说让他们申张正义，首先，太不具体了，二，不能解决好人吃亏。难以发展的。三，不指望不行的。你这样只会让一成做好人被其它九成欺负。不能解决共产内斗的力量。没有对制度修复的对策就不可能成功。制度问题只能用制度力量来解决。\n\n你的好多回复，我看其实我在文章里面都讲过，但是你没看仔细。\n\n目录也没必要，也就7个部分，没必要搞什么目录，长文我实在不知道怎么修订。",
			"post_id": 25,
			"date_added": 1521097457
		},
		{
			"comment_id": 26,
			"body": "> [chengxing](#comment_24_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF): 你说的匿名，标识，鼓舞人心这套早就有人做了。法轮功电话天天打，光盘，小册子发了十五年有毛用?你这套强十倍也只能让十亿人中的万分之一人同意观点，执行人百万分之一。就算人再多百倍也就万分之一，从理论上就会被另外的人斗掉。你反而害了执行人。起码浪费了他们的时间精力，要是爆露，丢工作，被孤立。反被垃圾上位了，受益了。\n\n真的不深刻理解长文无法认同，你这么久了还觉得是一样……\n\n我不争论了",
			"post_id": 25,
			"date_added": 1521098292
		},
		{
			"comment_id": 27,
			"body": "策略唯一性的佐证\n\n困境：\n国际对中共没有任何的办法\n分析：\n国内没法集结不能说明求助国际是正途，所有的抗争绝对是靠国人自己，国际就算有帮助也是国内必须有组织的。策反现在的人你也必须有能让人相信的组织力量，不是靠一句话。\n对策：\n把重心重新转回国内，集合国内的民众，民众规模只要集结够大，比任何的军事力量，国际力量都强大。\n\n困境：\n国内民众麻木，无公民意识，被分化恐吓。喊破嗓子让他们站出来，渲染各种民族存亡也没法让他们站出来。所以各种号召永远没人参与。\n分析：\n愚民也是现有民运渲染的，民众心理真的不需要民主？民众不一定愿意参与政治，但是民众都知道社会中的很多不公，他们只是没办法，所以选择麻木，他们只是没法集结，所以不敢表达。\n对策：\n不敢公开表达，那匿名呢？只要有统一的行动，有同一标志名称进行协作，这难道会没有影响吗？就单纯宣传标志名称这都可以让民众产生怀疑，这也是一种集结。而且这很简单，就是随手的事，不耽误日常生活，还没有公开抗议的危险性，这就是比其他号召抗议能获得规模的原因。而到标志常见的时候，再转为其他内容宣传或者公开抗争，这种逐步引导的方式不比直接号召公开一起行动容易？\n\n困境：匿名活动怎么做到有组织性，怎么控制不发生暴力对抗\n分析：混乱来源于不正确的价值观，不怀好意的出发点\n对策：为了获得民众的支持，组织的内容主要为为民维权，而维权其实并不是需要公开去以法斗法，我们匿名地引导舆论比其他的都有用，坚持这一个宗旨，公开透明化组织讨论，一定能保证组织的稳定性，这是一种公开的无形制约，不是暗箱的组织组织管理。\n\n困境：推翻共产党过后会造成国家动荡\n分析：这也是民众不愿意变革的很大一个因素，我们能解决这个，民众拥护我们还是很容易的。\n对策：不以推翻共产党为目标，主旨是为国为民，所以目标是只要获得了话语权，解除党禁，言论自由，军队国家化，只要获得了这些，一切的改革是一定有保障的，然后跟共产党的改革派一起过渡到民主，实现多党执政。\n\n如果各位觉得公开号召总有一天会有人站出来，自己认真思考下，这会到什么时候？而共产党这种逐步控制的手段，人们真的会越来越胆大？现在的人比过去怯弱了多少？多少年了，不解决大家的担心，号召有意义吗？用正义斥责他们有意义吗？经济状况真的能怎么恶化？贫富差距这么大民众不是依旧觉得很正常吗？在一个资讯完全被控制的未来，也许什么都会变成正常，你们真的觉得乐观是对的吗？",
			"post_id": 27,
			"date_added": 1521791912
		},
		{
			"comment_id": 28,
			"body": "活动过程中，他们有一个很常见的处理方式，就是说民众得理不饶人，故意把事情复杂化。\n\n这是非常聪明的一种转移方法，而且确实会让很多人觉得说的有理，把矛头一下就调转了。寻衅滋事、勾结境外势力，这些抹黑手段都是同一个道理。\n\n解决方法：同样攻击他们的态度问题，说“我们一要求公义，就说我们叛国，就说我们勾结境外势力，有这些时间怎么不想想怎么解决大家的问题，每次都这样把人民打成叛国，所以问题才会屡禁不止，因为根本就没人解决问题，犯错的说纠错的态度问题，这样问题就被掩盖过去了”。你不用去解释他们说的勾结境外势力，这个你解释不了，他会主动给你造证据，你就让他们解释你说的问题是不是问题，怎么解决，专注于自己的所求，别被人带着话题走。\n\n凡事要注意，别让自己最开始的诉求被其他给掩盖。",
			"post_id": 38,
			"date_added": 1535785626
		},
		{
			"comment_id": 29,
			"body": "再谈暴力革命跟理性非暴力：\n现在对暴力革命推崇的人完全是非黑即白的思维，因为非暴力多年的败退，就认为暴力革命是唯一希望，这不是实验，这种试探没必要。\n\n暴力革命存在且成功的环境：通信闭塞，行动被包装（民意），没法迅速控制，长线战斗逐渐壮大。今天的环境，暴力革命怎么包装？如果你的宣传能压过当局，能获支持，不应该早就可以革命了吗？再是对抗，暴力革命要当局压不住，必须有巨量的人群，煽动暴力革命的人有多少？这些人敢参与的又有多少？没法游击的今天，你怎么在不断抗争的过程中壮大？无民意支持，无实力基础，有的只是未知的尝试。\n\n理性非暴力革命，最重要是的民意，谈到最多的是正义，公义，让当局完全没有立场，就像甘地的抗争，民众看得到明显的区别。所以我一直强调坚守正义，不要被混淆。但是，如今的民运完全没有理性，他们的理非，只有非没有理，不分什么事件，所有事件都去凑热闹，造成了为黑而黑，偏激，愤青。\n\n理非并不是只在旁边夸夸而谈，等待民众全有公民意识，认为政治避无可避，一起抗争。对公义事件发声，对极度不公的事件或者政治属性压制不住良知的事件发声，这完全不需要告诉民众这是政治，这就是他们的利益，他们也不用觉得自己在参与政治，你可以让他们在不觉得自己在参与政治的情况下带动他们参与政治。\n\n现在的民运全都在走极端，指望所有人了解政治，认为政治避无可避，主动参与政治，了解了就会参与吗？或者就是指望全面崩溃，问题爆发，这个极端别说当局的控制度（不止经济，包括认知），民间都不会希望出现这种情况。\n\n一个是全民觉醒，一个是全面崩坏，等待两个极端，前面一个会出现对“利益说”不屑一顾，一副圣母的样子，而第二个就是这些人对事件没有判断力的原因，不管事件的属性，凡事都去凑热闹。",
			"post_id": 38,
			"date_added": 1535785677
		},
		{
			"comment_id": 30,
			"body": "为什么要挑选事件?\n这个圈子最混乱的就是这里，认为只要是热点就有可能激发抗争，无限追逐热点。对事件的属性不进行甄别，结果是每次被牵着鼻子走。\n\n我长文里说过，中共最厉害的地方就在混淆和隔离恐惧，分化进行恐吓，而混淆又用于后者的具体实施方法。\n\n乐观派认为人民都很愤怒，只是因为恐惧不敢造反，所以他们一直在谈规模效应。但是只会谈规模有什么意义？你怎么做到规模才是最重要的！\n\n规模就一定要看切身利益的受众，不是说热门就代表着规模，热门的事会因热度而消散，是个谈资，不会触及心底。从前面的事件分析：\n\n红黄蓝跟疫苗，对象是孩子，这是最触目惊心的事件，而且所有人都是可能遇到的，对象特殊。\n\n北大性侵案，包括后来的metoo，对象女性，同样弱势群体，对象特殊，亲近的人都可能遇到。\n\n镇江老兵，自身利益，人们很难感同身受，甚至民主派都会分化，指责他们作恶的过去。民众没兴趣，圈子里造假造势非常严重，圈子非常热心。\n\n卡车罢工，自身利益，民众没兴趣，圈子热心。\n\n佳士，自身利益，参与群体成分很多，刻意政治化，可以说这受众广是被有心人士强行涉足，受众广而少，这个能有多大影响？民众不可能参与，圈子也非常热心。\n\n可以看到，民众参与的事件是完全公义的，当事人没有任何利益在里面，这是人们心底的善，没有利益，这也是无法被混淆的恶。这是从道德角度，如果从利益角度，这是因为这种事件是所有人都可能遇到的，不是其他人的利益就不觉得自己被利用，这是他们自己的利益。全然在一个“公”字上面，另外三个玩弄文字游戏，你肯定能解释成“公”，但是文字游戏只会让人觉得你强行解释，为黑而黑。\n\n其实我想做的“帮助维权”，看起来也是一个个体利益，同样存在孤立分化的问题，也会无法让其他人帮忙发声。但是，我们是第三方，我们不存在直接利益。其次，我说的让其他群体帮助发声，是在我们具体有实效之后，就是集合我们现有的人群成功影响一次舆论过后，这种效应的出现是给他们自己保障，这就代表着他们出事可以倚仗我们，帮助别人就是壮大我们，就是帮助在未来的自己，这也是中国梦有市场的原因，有一颗可以依靠的大树。\n\n我既在谈利益，又在谈正义，但是两者是可以并存的，不同的地方用不同的支点。没有任何优势的未来，有正义有何用？\n\n这里谈的是为什么要选择事件而不是凑热闹，做白日梦（因为刷存在感不会让人依赖你，深深的被利用感，不是受助方，可以看看各种事件中当事人对谈政治的人群的反感），这是谈怎么选择事件。而选择事件后怎么做我在长文有说，不是选对了你就可以走传统路线了，因为这里面并不是只有你跟民众，还有对手。现在的环境需要匿名的，大体路线我给过，但是具体每次的活动一定要事前讨论。\n\n悲观派的“民众无法唤醒”，这里其实也解释了，民众的动力并不会是政治意识，最大的动力是切身利益。我自己是，乐观派的悲观派的都有认同，因为其实都存在，但不同的地方所看待的角度要不一样。\n\n对立的不一定不能一起存在，而相似的也不一定就能一起配合。",
			"post_id": 38,
			"date_added": 1535785701
		},
		{
			"comment_id": 31,
			"body": "看圈子对抗争的理解，就像现在的动物研究人类的发际史，开始学习，梦想着某一天统治人类。\n\n如果你要走传统路线，组织>斗争，你得思考在今天如何组织？因为公开组织太不现实了，但是如果口头协定说等将来一起，这里你就需要考虑怎么维持大家的激情，因为没有活动的还是口头约定的组织其实就是一个热闹广场，几乎都是看戏，来去自如，久而久之当初的核心也会懈怠，慢慢荒废，这就是无限的组织死亡无限的组织诞生的原因。其次，人都是有私心的，在这种并没有口头协定的组织里，谁敢相信将来的那一天其他人就会站出来？如果是说人多了没人不敢站出来，那这个组织存在的意义在哪里？既没有严谨性，也没有起推动作用。其实你要走传统路线，也该去对比下，共产党到公开活动的前面是只在等待吗？塔利班没有严谨的纪律，会有人民相信他们吗（后面走偏另看）？",
			"post_id": 38,
			"date_added": 1535785726
		},
		{
			"comment_id": 32,
			"body": "细节决定成败，但是凡事以此为铁律就有点死板了，没有完美的计划，你只能做到主体上行得通，细节上遇到不同的情况做不同的打算，意外随时有。\n\n意外，不能以此为铁律，但是像指着一切按自己计划走的“多米诺骨牌”式活动，你就应该多考虑意外了，因为你要的全是细节，而确实串联的，一个出意外都会失败。\n\n因为盲目乐观指望多米诺骨牌，一个人影响一个人，以微薄力量对抗大网宣，指望反洗脑，最后全都觉醒；因为极度失望又只能每天自嘲，消解情绪。哪一种方式都是在麻痹自己，我不希望每天嘲讽，但我也不指望一个接一个影响的那种理想结果。我们需要愚公移山的精神，但是我们不能要愚公移山的方式，实在太情怀了。",
			"post_id": 38,
			"date_added": 1535785744
		},
		{
			"comment_id": 33,
			"body": "接着谈下之前说的传播，“为什么会有禁止政治讨论的想法”，国内害怕，那国外呢？这现象已经很普遍了，谈政治的在翻墙里面算是九牛一毛。我说过，谈政治总会给别人一种“他是傻逼就你懂”的感觉（因为普遍自我意识强烈，自己也有广泛涉猎）。其次还有对现状的无奈，越看得多越心烦，索性不看，“人艰不拆”。\n\n他们不需要你告诉他形势到底有多严峻，他们会翻墙，他们能自己看，他们不愿意看那你的强迫也没有意义！他们看到政治第一想法是“所以呢”？“然后呢”？要方法不是要你说教，不过大多数情况，这里会用道德绑架来回应他们，用情怀（大家不要恐惧我们就是无敌的）说教（其实这只会让他们暗笑），然后情绪化辩论，撕逼到底，这有什么意义？\n\n传播的方法（避免面对面，让其感觉自己主动获取，没人说他被洗脑，没人觉得他是傻逼），传播的用语（让其感觉你跟他的感觉是一样的，你传播事件想表达严峻，但之后你要附和一声叹息，不让他抵触你，他的潜意识里你们是同道中人，这也不是发泄，用他不反感的方式持续呈现，这都是在累积情绪），需要改进太多。",
			"post_id": 38,
			"date_added": 1542167766
		},
		{
			"comment_id": 34,
			"body": "> [gongzhengdang](#comment_33_12AyVjYPn8ToxvMSxbxbcMaTYNCBhqE1Fz): 接着谈下之前说的传播，“为什么会有禁止政治讨论的想法”，国内害怕，那国外呢？这现象已经很普遍了，谈政治的在翻墙里面算是九牛一毛。我说过，谈政治总会给别人一种“他是傻逼就你懂”的感觉（因为普遍自我意识强烈，自己也有广泛涉猎）。其次还有对现状的无奈，越看得多越心烦，索性不看，“人艰不拆”。\n> 他们不需要你告诉他形势到底有多严峻，他们会翻墙，他们能自己看，他们不愿意看那你的强迫也没有意义！他们看到政治第一想法是“所以呢”？“然后呢”？要方法不是要你说教，不过大多数情况，这里会用道德绑架来回应他们，用情怀（大家不要恐惧我们就是无敌的）说教（其实这只会让他们暗笑），然后情绪化辩论，撕逼到底，这有什么意义？\n> 传播的方法（避免面对面，让其感觉自己主动获取，没人说他被洗脑，没人觉得他是傻逼），传播的用语（让其感觉你跟他的感觉是一样的，你传播事件想表达严峻，但之后你要附和一声叹息，不让他抵触你，他的潜意识里你们是同道中人，这也不是发泄，用他不反感的方式持续呈现，这都是在累积情绪），需要改进太多。\n\n今天的受众心理很不一样，而大网宣搅浑水太有力，思维混乱，非常自我，非常排斥他人，跟历史上太不一样了。",
			"post_id": 38,
			"date_added": 1542168183
		},
		{
			"comment_id": 35,
			"body": "https://medium.com/@iyouport/https-medium-com-iyouport-disinformation-thinking-eed8534b04ac\n专制政权最害怕的是人民的联盟、很容易受到允许人们更容易沟通和形成组织的工具的影响，以及那些为公民提供外部信息和观点的工具。\n简而言之，能冲击专制政权的是真相、是社会互信、是社团联合，是信息自由，而不是表达另一种立场的虚假消息如宫廷八卦。这在任何一个专制国家都一样。\n而专制权力的稳定需要公众互相之间不知道其他人的感受 — — 需要人们对哪些机构、团体和观点是真实的以及哪些是阴谋、欺诈或权力争夺战，保持持续的混淆。需要人们的互不信任，需要人们整天思考的是哪个家伙是当局的线人、谁在钓鱼、谁在利用大众的思维缺陷实现他们自己的名利欲……简单说，“我正在被谁利用”，而不是“我能和谁结盟”。\n反过来，一旦公众发现并确定周围有多少人对专制政权的抵制是存在共识的、对恶行的揭露是握有证据的，他们就会大胆地站起来反对。民间独立团体和社群应该能够给民众以“找到组织了”的感觉，这是不需要你分发红包以换取的“点赞和转发”。支持和协作建立在信任之上。\n\n我们跟民运最大区别就是，“民运一直在想着跟对手表达不满，而我们是在向同伴表达我们就在身边”，标志虽然也可以解读为不满，但最大的作用还是发现同伴。方向完全不一样",
			"post_id": 38,
			"date_added": 1544773020
		},
		{
			"comment_id": 36,
			"body": "崩溃论，我一直用隐性通胀劝大家别抱期待，只要保证好普通人的吃穿，控制这个基础需求的物价，其他行业随便收割（当然，肯定不会同时全行业，一个一个收）。分化政策的长期影响使各行业完全不可能联合，这已经摆在眼前了的，不是“大家知道不联合无力反抗就会联合”的，这么简单的话，早就被推翻了。你们说人民会吃不上饭，那自然就会崩了，你们完全把中国看成市场经济了，这个可无限收割的环境，人民吃不上饭何其难！都知道走极端政策会反，但都不会想他们不走极端？他们从来没有急转，他们现在的行进算快？不一样是缓冲式？你们就没去看看普通人到底有没有感觉到大变化？还是跟以前一样被缓冲到没太大感觉？用把对手当智障！\n\n所以，经济问题，受罪的其实根本不是民众，因为他们吃穿一直是这样，平时买不起的依旧买不起（不是刚需的，比如房子，他们感觉会非常弱，物价上涨他们会等或者舍），被收割的只会是中产阶级，你指望中产阶级因此造反吗？民众普遍是仇富的，因为贫富差距太大了，这个在哪里都存在，看着过得比自己好的受罪就会幸灾乐祸，你没看每次整治，下边一片叫好吗？他们是被孤立的群体，中产阶级根本不被民众支持，阶级对立一直存在，他们怎么敢反？他们才占普通人多少？他们反之后，不只上面镇压，下面还排斥。这个群体，不听话，灭了换一批人就是了，都可以换体制内的。\n\n政府怕的一直是最大的受众：民众。他们一直在尽力安抚民众（或者至少让民众不觉得问题是政府的，政策安抚的同时辅以认知的操纵），但到底哪些人才是民众，被民运用一些文学化的表达法进行强行解释了，然后造成对事例解读的错误，发现不了自身问题。\n\n现在的政令没有产生历史上的结果，又怎么发生历史上的反应？怎么能以政令判断结果会一样？你自己觉得他们在走极端，但从民众的反应来看其实根本没有走极端，或者走极端的速度非常慢。我一直是认为极端是需要我们去推动的，是等不来的，因为他们一点不蠢，不会急速下降。\n\n预测崩溃的人简直是祸国殃民，以小众情况分析大部局势，以最好的期待判断结果，以市场经济推断崩溃，以自己的智商代表对手的智囊团，然后坐等，不只自己坐等，还影响其他人坐等，等一个不断变换说辞的预测结果。\n\n主要原因还是以自己的感受当成民众的感受",
			"post_id": 38,
			"date_added": 1545278781
		},
		{
			"comment_id": 37,
			"body": "中国的分布式活动不该是随机瞬发的\n\n在分布式活动中，只有在有共同目标的时候我们才是一体的，军队才不敢对这个群体使用武力，但推翻过后，各方野心家都会登场，划分势力。但这个分布式群体不像其他组织，有明确的组成结构，也没有明确的上下级关系，所诞生的势力绝不会有压倒性优势的一方，以至于会形成各种乱流。可对比法国“黄背心”运动，在失去最初的目标后，队伍持续萎缩，各种群体各种需求，没有统一的压力，后期的需求很难得到满足。分布式运动需要长期的活动团结队伍，强化“统一极其重要”的观念，瞬间形成的力量很容易被分化，面对对手是一个整体的情况下，熬不过对方的，请看黄背心的后期。如果你说你只需要黄背心的前期效果，中国的变革只需要那么点时间？只需要获得一件事的成功？他们只能熬几天？\n\n松散的组织要维持一个长期的纪律，这一定是很难的，所以我们要从开始的坚定变革者就严于律己，通过行动展示给其他围观者一种固有的印象，后期的行动再一直强化这种印象。这能最大程度减小松散、混乱的可能性。而且在到了可以公开聚集的时候，可以通过传统的组织管理进行整肃队伍，约束大家，形成一个有纪律的政治组织。",
			"post_id": 38,
			"date_added": 1545490990
		},
		{
			"comment_id": 38,
			"body": "> [gongzhengdang](#comment_37_12AyVjYPn8ToxvMSxbxbcMaTYNCBhqE1Fz): 中国的分布式活动不该是随机瞬发的\n> 在分布式活动中，只有在有共同目标的时候我们才是一体的，军队才不敢对这个群体使用武力，但推翻过后，各方野心家都会登场，划分势力。但这个分布式群体不像其他组织，有明确的组成结构，也没有明确的上下级关系，所诞生的势力绝不会有压倒性优势的一方，以至于会形成各种乱流。可对比法国“黄背心”运动，在失去最初的目标后，队伍持续萎缩，各种群体各种需求，没有统一的压力，后期的需求很难得到满足。分布式运动需要长期的活动团结队伍，强化“统一极其重要”的观念，瞬间形成的力量很容易被分化，面对对手是一个整体的情况下，熬不过对方的，请看黄背心的后期。如果你说你只需要黄背心的前期效果，中国的变革只需要那么点时间？只需要获得一件事的成功？他们只能熬几天？\n> 松散的组织要维持一个长期的纪律，这一定是很难的，所以我们要从开始的坚定变革者就严于律己，通过行动展示给其他围观者一种固有的印象，后期的行动再一直强化这种印象。这能最大程度减小松散、混乱的可能性。而且在到了可以公开聚集的时候，可以通过传统的组织管理进行整肃队伍，约束大家，形成一个有纪律的政治组织。\n\n黄背心可以说证明了去中心的成功，但对于想要更多改变，它一定算失败了。它的凝聚力来的快，去的也快，这是为什么我们需要以长期活动来强化“统一”观念的原因，而不是一直试不同方法，指望某一次瞬间爆发，因为那种队伍，必败！别想着爆发后你能理想化整理队伍……瞬间的爆发只会实现瞬间的那个诉求，得到满足就会对其他避嫌，自动分化，也许甚至那个瞬间诉求都得不到满足。",
			"post_id": 38,
			"date_added": 1545492280
		},
		{
			"comment_id": 39,
			"body": "很多不谈政治的人，我一批评体制，我就是崇洋媚外，我就是不爱故土，我就是想阻碍中国复兴。自己什么都不接触，却总觉得自己才不偏不倚，别人都是偏激愤子。空前的民族主义，看似在日常教导理性，实际却煽动了非常强烈的民族主义，不得不说宣传的强大啊。平时怎么批评民族主义影响都不大，关键时刻要民族主义就有民族主义。咋一看，当局做很多正常的事，但却总能达到他们背后的目的。从小教辨证法，但普通人却总在该辨证的地方不辨证；从小教自由民主，人民却总能自发为特色专制辩护。思辨能力被他们巧妙地修饰，然后输入到人民体内。其实问题不在于民族主义，问题是，他觉得他们爱国，我不爱国，他觉得他们有民族主义，我没有民族主义。",
			"post_id": 38,
			"date_added": 1545548865
		},
		{
			"comment_id": 40,
			"body": "> [gongzhengdang](#comment_36_12AyVjYPn8ToxvMSxbxbcMaTYNCBhqE1Fz): 崩溃论，我一直用隐性通胀劝大家别抱期待，只要保证好普通人的吃穿，控制这个基础需求的物价，其他行业随便收割（当然，肯定不会同时全行业，一个一个收）。分化政策的长期影响使各行业完全不可能联合，这已经摆在眼前了的，不是“大家知道不联合无力反抗就会联合”的，这么简单的话，早就被推翻了。你们说人民会吃不上饭，那自然就会崩了，你们完全把中国看成市场经济了，这个可无限收割的环境，人民吃不上饭何其难！都知道走极端政策会反，但都不会想他们不走极端？他们从来没有急转，他们现在的行进算快？不一样是缓冲式？你们就没去看看普通人到底有没有感觉到大变化？还是跟以前一样被缓冲到没太大感觉？用把对手当智障！\n> 所以，经济问题，受罪的其实根本不是民众，因为他们吃穿一直是这样，平时买不起的依旧买不起（不是刚需的，比如房子，他们感觉会非常弱，物价上涨他们会等或者舍），被收割的只会是中产阶级，你指望中产阶级因此造反吗？民众普遍是仇富的，因为贫富差距太大了，这个在哪里都存在，看着过得比自己好的受罪就会幸灾乐祸，你没看每次整治，下边一片叫好吗？他们是被孤立的群体，中产阶级根本不被民众支持，阶级对立一直存在，他们怎么敢反？他们才占普通人多少？他们反之后，不只上面镇压，下面还排斥。这个群体，不听话，灭了换一批人就是了，都可以换体制内的。\n> 政府怕的一直是最大的受众：民众。他们一直在尽力安抚民众（或者至少让民众不觉得问题是政府的，政策安抚的同时辅以认知的操纵），但到底哪些人才是民众，被民运用一些文学化的表达法进行强行解释了，然后造成对事例解读的错误，发现不了自身问题。\n> 现在的政令没有产生历史上的结果，又怎么发生历史上的反应？怎么能以政令判断结果会一样？你自己觉得他们在走极端，但从民众的反应来看其实根本没有走极端，或者走极端的速度非常慢。我一直是认为极端是需要我们去推动的，是等不来的，因为他们一点不蠢，不会急速下降。\n> 预测崩溃的人简直是祸国殃民，以小众情况分析大部局势，以最好的期待判断结果，以市场经济推断崩溃，以自己的智商代表对手的智囊团，然后坐等，不只自己坐等，还影响其他人坐等，等一个不断变换说辞的预测结果。\n> 主要原因还是以自己的感受当成民众的感受\n\n我反对认为会崩溃，反对乐观，不代表我不认为现在是机会。不要乐观说的是不要觉得会自然到达极端情况，然后乐观干等，等肯定没用，他们处理问题非常灵活，极端情况你能想到他们想不到吗？觉得是机会是因为，外部树敌太多，内部控制越发收紧，达不到极端也有抵触。",
			"post_id": 38,
			"date_added": 1545549153
		},
		{
			"comment_id": 41,
			"body": "通过言传身教影响身边人的民主意识，这个策略真的无脑，这么多年有效吗？分化影响持续存在，他们懂什么都不敢相信有其他人一起站出来。他们根本不需要什么提升，他们是因为害怕。你认为我参与政治是因为我突然获得了什么民主知识，头脑发热吗？不，我参与是因为我的价值观不允许我融入他们，知识和良知不是对等的，获得多少知识并不一定让人获得多少良知。如果不是靠信念，只是通过翻墙看到了一些负面新闻，就出来反对什么，这样的人群很难坚持下去，也就是突然同情心爆发，但很快他就会屈服于现实。",
			"post_id": 38,
			"date_added": 1545550799
		},
		{
			"comment_id": 42,
			"body": "提的惊涛骇浪，贸易战可有人关心？这不是人民不信政府，而是他们根本不关注，所有一切都有政府搞定，自己的吃穿没受影响，他们怎么会感觉到有异样？",
			"post_id": 38,
			"date_added": 1545551907
		},
		{
			"comment_id": 43,
			"body": "都看到了西方世界在开始防范中国，觉得会全面对抗。但是没人意识到，中国现在有多强势，虽不愿，但不惧。现在西方的盟友关系并没有那么紧密了，分化联盟太简单，就像现在这样，打击美国的盟国，美中也不会正面直接对抗，这是双输。这种情况下，盟国白白被打，而且盟国也不是不跟中国做生意，怎么会为了美国跟中国对抗？这不是一个以意识形态为准的时代，这是一个以经济利益为标准的时代。都是一种聊胜于无的心态，既然是坐等，有压力好过没压力吧！坐等内斗论崩溃来源同理。谈政治的这群人总是以自己感觉极端认为中共就在走极端，极端情况已经或者马上发生，到底极不极端，社会状态什么样，你看看普通人什么变化不就知道了吗？我跟人沟通后，他们都说根本没感觉近两年有什么变化。一次变革，社会该是什么样，你应该理智的判断。社会环境波澜不惊，一切变化，终究只是皇家的事！",
			"post_id": 38,
			"date_added": 1545993708
		},
		{
			"comment_id": 44,
			"body": "以各种案例预测未来的，什么时候能消停！别说不同时代你该有不同思维，就算你照搬，现状真的跟你所谓的变革前夕一样吗？政令A产生效果B，导致结果C。你们现在是怎么？看到政令A认为直接推出结果C，B的效果都没有，怎么导致C？国内社会完全不是变革前的民怨四起，你们要的造反从何而来？内斗吗？\n\n预测家存在的意义是什么？可以让人心安理得地坐等，既消除了罪恶感又看到了一个“希望”。因此，预言家可以获得这群人持续的追随（准与不准不重要，重要的是他们对围观者的意义，围观者只是需要有人一直告诉他“他想要的能成为现实”），促进他们继续预测，相互促进着。又没实际推动力，准了出来吹一波，不准就是时机未到，分析局势可以别预测结果吗，误人子弟。",
			"post_id": 38,
			"date_added": 1546315183
		},
		{
			"comment_id": 45,
			"body": "我之前说传统文化是为了修德，道德崩溃导致社会问题频发，所以借传统文化进行道德影响，但越来越发现传统文化更大作用是操纵民族主义，盲目的民族主义。我认识一个人，特别喜欢传统文化，按道理说，他应该比我更注重精神层面的提升，但他对弃德拾财的民族复兴却非常忠诚，一切不公都能以国情需要理解，用西方霸权批评西方，也用此回顾历史展望富强。对注入的民族主义能这么完美地修饰，哪里该有哪里该没有，随意操纵，实在太恐怖了！",
			"post_id": 38,
			"date_added": 1546315250
		},
		{
			"comment_id": 46,
			"body": "觉醒？觉醒论的人到底是什么观点，什么方法？\n \n“让更多人知道真相”！\n \n从小到大的学习，人们不知道民主、人权、自由？人们不认为这些东西对自己有益？\n \n满大街宣传，包括共产党自己的历史叙事，都是反独裁，人民当家作主，有封禁这些思想吗？\n \n人民对这些是持怀疑态度，任何事带着“不一定”来看待，当然也是被中共的宣传所混淆，成为特色版“民主、自由”。但是，只是被混淆吗？混淆代表着虚假，遇事自然能看清楚，比如对重大事件的封禁、打压，在追求的过程中，受挫才是他们停步的原因。\n\n也许你会说，遇事从来都是少数人，不遇事的人不是很多吗？社会大事件不需要是直接当事人，也能让人对混淆产生怀疑。也许人民会认为是下面的部门有问题，不会自己思考整个体制，但这能成为他们不表达对下属部门的抗议的原因吗？事实是，除了当事人，他们从未抗议，尽管他们知道问题。\n\n这是不是没觉醒？还是因为害怕？本质是知道问题，但没涉及自己核心利益，用怀疑论为自己的道德辩护？\n\n或者说觉醒派所谓的需要觉醒的是不识字的？因为其实但凡能看新闻的，生活在这个社会中的人，都或多或少知道些问题，只是自己选择了无视。我相信觉醒派针对的对象是识字的，至少主体是，这个群体才能接受他们的宣传，那他们其实本质上是指望唤醒道德。\n\n所以，让“更多人了解真相”这一说让人觉得自我拔高了。认为自己在用事实真相唤醒，其实需要的是道德唤醒，看了很多人谈论觉醒，其实觉醒派我没看到提及唤醒道德，尽管他们对道德沦陷表示鄙视，但他们一直持有的观点是“大家要传播真相”。\n\n我没有否认现实世界中，真相被掩盖，我所探讨的是觉醒派的初衷是认为大家不知道社会问题，而他们的解决方法跟本质问题根本不构成逻辑关系。\n\n话说回来，就算大家完全不知道问题。所谓的觉醒又怎么做呢？\n\n用你们这点渺小宣传盖过中共的宣传？听了你们的宣传就不会被其他宣传影响？太小看混淆能力了吧。知识阶层都被怀疑论影响，能单方面只认同你的有多少，是什么人？\n\n其实从觉醒论的目标来看，很清楚，目标是什么都不知道的人【或者他们认为不接受普世价值的都是因为不知道真相，把坏当成无知，他们认为自己针对的群体没具体对象分类，其实受体本质是不识字的，或者进社会以前的学生（毫无阅历，不成熟的群体，未来很容易会变的，唤醒过后未来也会沉沦，以为唤醒了很多人，但这个群体却一直是动态平衡）】，怀疑论的知识阶层并不在他们的目标范围，他们辩不过，这些人在他们眼里都是自干五。\n\n即便是都无知，问题又出来的，唤醒的受众其实很容易被反唤醒，质量堪忧啊。\n\n所以，觉醒派，所针对人群的本质问题不清楚，自己想要唤醒的受众也没搞清楚，更多是玩弄一种道德情怀。",
			"post_id": 38,
			"date_added": 1563000224
		},
		{
			"comment_id": 47,
			"body": "经济论到底怎么反驳？\n\n他们跟追求民主自由的价值观完全不一样，你说有经济没人权有什么用，他说有人权没经济有什么用！\n\n两者重视点不一样，但“经济最重要，其他都可以让位”这种观点在境内有非常吃香，专注经济发展，别的什么都不管，人权不能当饭吃！\n\n我想正规的辩论好像起不了用，基准不一样。用反问法更好，怎么反问呢？\n\n每次出现“好好发展经济，别搞事”的观点的时候，必然是有不公的事件发生，而此论点的言外之意是什么？好好发展发展经济，不要对不公平的事件发声，别管别人遇到什么不公的事，这些不关你的事！我们需要摒弃道德才对吗？这种社会是正常的吗？我们真的需要这种社会吗？\n\n都知道不行，所以我们不管现实以经济掩盖道德沦丧，我们的宣传却一直在呼唤道德，既得利益者需要只需要自己无德，需要其他人讲道德，他们需要一个讲文明的社会环境，不然挣那么多钱什么用呢？但是讲经济优先论的时候，分人了吗？凭什么要求别人有道德？这不是一个永久存在的矛盾吗？\n\n这个时候，会有人搬出“不是不要道德，是在挣钱的同时保持道德”，但是现实真的是这样吗？大发特发的，都是是需要掩盖道德，而且想保持道德的时候你根本没有自主权吗，你可以尊老爱幼，你可以孝顺父母，你可以施舍救济，但关于整个社会的公义的事，是否能有道德，这要看政府。",
			"post_id": 38,
			"date_added": 1563107621
		},
		{
			"comment_id": 48,
			"body": "经济崩溃……\n\n中国经济要分两部分，一是跟国际有贸易关系的，一个是只在国内流转的。\n\n中国不透明的经济能被国际接受，就是因为他们不管怎么通胀，怎么超发货币，它绝不会流向国际贸易，国际贸易都是利用国内强大的产能创造的价值进行交易的。之前的海外活动少，都是海外进来，自己很少出去。近些年强势了，主动开拓海外的开始变多。可以看到中国政府在控制海外投资的规模，控制海外资金的转移，这些都是防止应该用于国际贸易的人民币被不受控方用于了国际贸易，最终打击人民币的国际公信力。\n\n中国对内的超发，不会导致普富，超发的钱不会到人民手里，依旧有金字塔结构，他反而让人民跟资本家的差距更大，在一个没有反抗的环境里，这只会更加激励人们努力工作，它根本不会造成传统的通胀问题，可控的通胀（隐性通胀，控制在非基本生活必需行业的通胀，让人民仍可苟活）。让企业有资金运作，让人民有活可干，营造贫富差距让人民更努力工作（强大的产能）。国内再怎么不遵循经济发展规律，但它创造的价值在国际上可是货真价实的。它利用了国内的不公平，创造国际贸易价值。\n\n再看有些人说的国库空虚，入不敷出了，特别是维稳经费。\n\n维稳需要经费，但它不需要经济价值，纯投入，那他们会用国际贸易的经济来投入这一块吗？这当然不会，钱要花在刀刃上，高科技上面，国际关系打理，国外势力发展，这些都不能用超发的那部分的，只能用国际认同你创造的那部分价值的体现。真实价值的部分国际需要，不能动，境内经费就只能用境内市场经济的收入了，但境内有滥发这一长期的恶例。\n\n货币发多少不是关键，它的最终目的是为了促进资源的流通。只要是只在境内流转的经费，他们完全可以无限发放（不管发放多少，大部分是企业之间的数字流通，并不会被用于市场上的直接流转），不会导致普富就行，不然那就是完全的通胀了，他们需要控制阶级差距维持生产力。超发让企业有能力获得资源，但并没有让打工者获得购买资源的能力，这激活了市场，不是导致了通胀。在企业间的通胀，只要不参与国际贸易，这通胀就不用考虑（企业需要生产力，需要有资源调配能力，只需要创造出生产价值，企业主再通胀，自己也是比其他人获得更多的高层阶级），如果要参与国际贸易，同样把真实生产价值用于国际，通胀的货币用于国内即可（最终会到人民手里，怎么不会通胀？发放到人民手里的是工资，不是企业那种投资，只够生活，对于在企业之间的通胀量，简直是九牛一毛）。哪一部分是真实产生的价值，哪一部分是超发，当然是没有具体标记的，只能是控制流通量，民间如果出去多了，国家能用的就少了，但这完全被政府控制着。\n\n为什么他们可以这么干却没有直接采用发钱的方式搞完全计划经济？维持差距即可。历史的实践证明了市场经济才能激活创造力，计划经济再维持差距，所有企业同属一家，会僵化的。\n\n既然在国内搞可控型市场经济，那超发不会有事吗？它总得符合市场经济发展规律啊！无限借贷不用还吗？\n\n放贷方是哪里？发钱的！坏账它不可以直接销帐吗？它需要的是持续的产能（这部分钱也根本不需要国际市场的监督），又不是那个数字，保持一定的压力，让民营有持续的动力，它根本不希望民营垮掉。\n\n但直接销账不是破坏市场经济规律吗？这不会鼓励企业烂账吗？让市场活力下降，削弱生产力。直接销账是终极方案了，当然是尽量维持市场经济规则，只要有收割、企业倒闭，有危机意识，市场玩家一直更新，它就不会被僵化。收割式补偿亏空，能尽量避免大规模直接销账，尽力保证市场经济的正常运行。而直接销账呢，虽然破坏市场经济，但却能消除烂账，更是有助于回收超发的货币，缓解通胀，发行货币并不会真实让货币体现为市场流通的物理介质（就是印钱，铸币），这个时候它正好利用这些机会把超发的货币（数值）销毁。请注意，贷的通胀款不是用来发给工人导致烂账的，它的主要花费是企业之间的交易，所以流向终端消费市场的数值很小，通胀会非常缓慢，符合正常发展的通胀率。高税收、国企在控制通胀中的作用都不可小觑。\n\n不公平的市场经济，但民营什么时候不是被收割的？想要管控，谁敢不交出来？甚至都会主动表态。既得利益者没有立场，没有能力反对。\n\n经济增长放缓，数据下滑，这些不会导致经济问题吗？你见过老百姓关心经济数据的吗？只要控制住基本需求的市场物价，基本生活需求能以工作满足，工人就肯工作，就有生产力，数据会造成什么影响？关心数据的既得利益者，敢与整个体制斗争？本来就得益于这种模式，不管怎么下滑，他们都是跟普通工作者维持一定的差距，他们一直都是较好阶级。阶级差并不需要你的资产在国际上体现出多大差距（最明显的例子就是朝鲜，他们的高管同样可以享受境内的锦衣玉食），只需要你在这个环境里比别人有更多可能获得的资源。\n\n因为老百姓不懂经济，只知道努力赚钱，有“中国人勤奋”的说法（生产多大的生产价值都不会流到人民手里，他们也不会反抗），中国的无形压迫让国内有充足的产能。这两年经济数据下滑，这里就有崩溃论兴奋的点了，产能过剩，基建搞完了，内需全满足了怎么办？除了衣食住行的行业能永远运转，其他行业都会出现倒闭潮，失业率增高，继而出现经济问题，最后民怨四起，政治动荡。\n\n首先，经济问题并不一定导致政权崩溃，况且这还不是全面经济问题。再者，产能真的能剩下来？你应该知道中国国民的生活水平完全没赶上发达国家，但中国却利用强大的产能建成了世界上最大的交通运输系统（引以为傲的基建，发钱利用差距让人们努力工作，让人们有事可干），4G晚于国际几年建设，5G却跟国际同步发展。满足了5年前的生活需求，5年后的生活需求又变得完全不一样了，欲望可以利用宣传无限培植。全都造完了，可以翻新，产品可以升级换代，只需要舆论的配合（短期改变不了观念，他们有足够的时间、资源，潜移默化地改变人们的思想，“必须买房”就是这么来的）。发展领域如果不是高科技，只是为了维持境内稳定，让人们有事可干，它根本不需要跟随国际的脚步（特别是服务业）。你应该知道，中国花大钱半小事的案例并不在少数，垃圾分类都能成为一种生意。只要你肯工作，它一定有办法给你找出行业，甚至创造一个行业。而且他们一直在处理产能问题，往外转移产能，内需消化产能。就算是世界上的都被造完了（这都不知道要多少年了），那也只是到达“平稳发展期”，跟国际接轨，国民完全能理解。\n\n说实话，发点经费给维稳，这个内环市场消化不了吗？经费不等同于经济，经费本来就是无限的，它甚至都不需要内部这个伪市场经济支撑。",
			"post_id": 38,
			"date_added": 1564242468
		},
		{
			"comment_id": 49,
			"body": "“你在其位也会如此，贪腐、弄权”。如何回应这种道德攻击？\n\n之前我说的“这是给人预先定罪”，别人可能做，却用来抵消了对“已经做了的”不忿感！这种说辞虽然拉回了对不公正的批判焦点，但挽回不了情感的抵消。\n\n从现代人的超自我心理来分析，批判别人，就是在强调你比别人更好，更有道德，所以，对你进行道德绑架是最有消解力的。而且对旁观者，这是最有影响力的，因为自我，冷漠旁观的人听任何事都会觉得你在彰显自己的道德比他们优越。\n\n除非你本来就有很高的道德水平，但难点也是它是未知的、未来的，本来就是一个可能，你怎么证明？\n\n但是如果预先就承认自己可能犯错呢？虽然无法证明你多么优秀，但在批判的时候，不会再有更大的消解能力。\n\n回应就成了“我在其位同样会贪腐，并不能成为证明贪腐合理的论据”，“我在其位贪腐，就应该接受人民的审判”，不只把焦点完全放在了问题上，因为对自己的严格，还让自己更有立场批判“已经做了的人”。而预先承认“自己可能犯”更不会造成旁观者道德低下的受挫感。\n",
			"post_id": 38,
			"date_added": 1569047031
		},
		{
			"comment_id": 50,
			"body": "“你在其位也会如此，贪腐、弄权”。如何回应这种道德攻击？\n\n之前我说的“这是给人预先定罪”，别人可能做，却用来抵消了对“已经做了的”不忿感！这种说辞虽然拉回了对不公正的批判焦点，但挽回不了情感的抵消。\n\n从现代人的超自我心理来分析，批判别人，就是在强调你比别人更好，更有道德，所以，对你进行道德绑架是最有消解力的。而且对旁观者，这是最有影响力的，因为自我，冷漠旁观的人听任何事都会觉得你在彰显自己的道德比他们优越。\n\n除非你本来就有很高的道德水平，但难点也是它是未知的、未来的，本来就是一个可能，你怎么证明？\n\n但是如果预先就承认自己可能犯错呢？虽然无法证明你多么优秀，但在批判的时候，不会再有更大的消解能力。\n\n回应就成了“我在其位同样会贪腐，并不能成为证明贪腐合理的论据”，“我在其位贪腐，就应该接受人民的审判”，不只把焦点完全放在了问题上，因为对自己的严格，还让自己更有立场批判“已经做了的人”。而预先承认“自己可能犯”更不会造成旁观者道德低下的受挫感。\n",
			"post_id": 38,
			"date_added": 1569047152
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}