{
	"title": "里世界",
	"description": "随意随性",
	"links": "*   [里世界-目录](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:1)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1520852441,
	"post": [
		{
			"post_id": 13,
			"title": "里世界-12-灵能核心",
			"date_published": 1520850160.461,
			"body": "很快一个简单的营地已经扎好，全程都是巨力三兄弟一起在干。\n\n在矿洞的一侧用树枝搭了三个帐篷最中间的大一些，两侧的是同样大小的，整个帐篷围着中间的篝火。\n\n巨力站在营地的外面站哨，影丸负责管理篝火飞失丸则负责狩猎这些。\n\n小佳茗同我一起住在大帐篷里面白则在左侧的帐篷里面休息。\n\n因为忙完了这些已经是傍晚十分，四处都是野生物的鸣叫声，那些喜欢在夜晚出来活动的家伙陆陆续续的苏醒了过了。\n\n这里的环境我确实是十分的喜欢，依然决定以后就在这里长住下来，因为地脉族也是夜行生物，他们到了傍晚的时候都显得非常的精神。巨力依然如同守卫一般站在营地外面站哨以防止那些野生物闯进来。\n\n影丸和飞失则被我派了回去，把超市里面剩余的饮水和烟草带带回来。\n\n这时的我在篝火旁边与白进行对抗练习，可能是今天猎杀那些野生物吸收了10粒绿晶整体的抗打击能力得到了一定的提高，白每次的拍击已经不能将我直接拍飞，也就向后退个几步而已。而且在不断的练习中我也逐步的熟悉了她的战斗方式，虽然不能对她照成直接的影响，但我也能够顺着自己的感觉对她的打击进行规避。\n\n佳茗她则用自己的精神力托着毛球在她头顶四处乱飞，吓的毛球整个身子都缩成一团，一边发出呜呜的鸣叫，似乎是在对她抗议。\n\n毛球才来到这个世界两天，它的变化也非常的快，从开始没有睁开眼睛的奶狗蜕变成了一个足球大小的小狗，我想用不了多久它就会完全张大，成为一只成年的大狗。\n\n影丸他们来来回回走了3躺才把物质都搬了过来，那边的超市里面基本上能用的工具都被他们抬了过来，看着他们只有我肩膀高的个子我也感觉十分的意外。\n\n东西都收拾好了过后，我取出了从超市带来的饮料每人给了一瓶。白优雅的接过饮料用她的小手拧开瓶盖，开始喝了起来。巨力他们看到我递给他们的饮料十分兴奋的接了过去，学着白的样子拧开瓶盖喝了起来，生怕漏掉半滴。\n\n忙活了大半天，现在已经是在夜晚了，"
		},
		{
			"post_id": 12,
			"title": "里世界-11-次级灵能矿脉",
			"date_published": 1519817319.992,
			"body": "现在的天空已经泛着微微的青绿之色，佳茗也已经十分的精神起来，不过今天我们没有弄早餐......（昨天晚上所有的食物都已经被地脉长者带着人都给带走了。）\n\n我对着站在门口的黑色地脉族说道：“巨力，你知道在哪里能够找到食物么？”\n\n* * *\n\n“主人，我们的巢穴附近是安全区域，就在我们的王巢附近，这里已经没有其他的野生物了，如果要获得食物，我们可以去您的次级灵能矿脉那边，哪里属于未开发区域，有不少的野生物在哪里。”巨力单膝跪地说道。\n\n“那我们去看看吧，巨力你安排一下你的两个兄弟，到里面找一个大袋子，带些水准备出发。”我接着说道。\n\n佳茗知道今天能够一起出去也是十分的兴奋，两眼直冒光。在她一旁的白依然是静静的站在哪里。\n\n很快我们就准备好出发了。\n\n从超市出发一直往东走了大约1个小时的时间，巨力带着我们来到了一个巨坑面前，从这个巨坑往下看里面是一圈清亮的湖泊围绕者一片树林在树林上得十分的茂密，看不到里面的情况。在水岸边依稀能看到一些小型的生物在饮水。\n\n我们跟着巨力沿着坑边的一条小道来到了湖边，在这片湖边停着一艘小船，小船大小能够容纳10个人的样子，只是我们六人根本不成问题，巨力和他的兄弟在后面掌舵往湖中小岛划去。\n\n很快我们就来到了岸边，我们刚下船把它固定好，飞失就已经拉开了他的短弓向着不远出的一只类似小野猪的家伙就是一箭射去，那小家伙还没来得急发出声音就已经被一箭贯穿脑袋被钉在了地上。看到飞失直接杀了一只野物，我心里想着这家伙技术不错。正想着，飞失就跑了过去，把那只小野猪大小的野物拖了回来，从自己的腰间摸出了一把小刀向着那野物的头骨挖了进去，从里面掏出了一小指甲大小的绿色水晶般的东西，然后小心翼翼的递到了我的面前“主任，这是绿晶。”\n\n“绿晶？”我伸手刚触碰到那枚指甲大小的晶石它就变成了一缕绿色的能量浸入我的身体中沉入我的丹田位置。\n\n“它直接被您吸收进入了身体？”白很是惊讶的说道，巨力三兄弟也是一副不可思议的表情看着我。\n\n“怎么，难道不应该这样？”我疑惑道。\n\n“李默先生，绿晶是一种固态的能量结晶他们通过生物吸收雨能转化出来的，已经是一种固态的能量，我们很难将他们吸收进入自己的身体，这种能量结晶只能用作一些器物的能量来使用属于外在的消耗品。我们一般把它当作一种货币来与别人相互交换物资用的。”白回答到。\n\n原来这个是一种被当作货币用的东西，我想到。\n\n“哦，那我们先在这里填饱肚子，等下去看看我们的矿脉吧。”我说道。\n\n因为现在多了三个帮手，做实物这些也直接交给他们负责了，我佳茗和白都坐在了停靠小船旁边不远看着他们在哪里摆弄食物。\n\n没过一会儿他们就把食物带了过来，一张又长又大的叶子里面盛着几片新鲜的肉片肉片旁边还放着几枚野生的果子一共有三份儿送到了我们的面前......\n\n佳茗一脸不可思议的表情盯着那些食物，我很是无奈，原来他们是吃生食的......\n\n白则很是平常的托起那些鲜肉用手抓着正要往嘴里送去。“别！别吃！”我急忙叫到佳茗也死露出了惊讶的表情。\n\n“我们还是生活烤着吃吧，至少可以吃熟的。”我说道，说罢便带着三兄弟去里面的树林里捡拾柴火去了，他们三人学得还是挺快跟着我的样子捡了一些干燥的树枝跟着我回来了。然后我招呼着他们三兄弟在湖边找了一些砖头大小的石头砌了一个火坑，让影丸用他的匕首在一块大点的木头上凿了一个小坑，在坑周围铺了一些干草叶子，然后我又找了一根木棍把前面削成了元头，两手捧着木棍在木块坑里搓动了起来。\n\n三兄弟好奇的盯着我的一举一动。\n\n约10十分钟后，篝火就被点燃，我指挥者三兄弟填柴火小佳茗则是用一些新嫩的树枝把那些肉串串了起来和白一起开始烤了起来。\n\n肉想一阵阵的飘了出来，佳茗的手艺确实不错，火候掌握得很好，同时她还研究了一些那些不认识的果子就着野果当成香料混着一起烤，确实另有一番风味。\n\n影丸认真的看着佳茗的动作，似乎是在跟着学习。食物烤好后，我拿着那些肉串送到了巨力三兄弟面前，他们先是楞了一下也没多说什么接过了肉串。\n\n我回到了佳茗的身边，接过她递给我的肉串开始吃了起来，味道不错虽然不是平时吃的那种熟悉的味道，不过这些野果配出的调料弄出来的口感非常的不错，白也是吃的很是开心，虽然她没有多说一个字。而在我们脚边的毛球，也是埋着头吃得津津有味。\n\n饭包后，巨力三兄弟又领着我们往树林里面走去，在路上碰上的都是一些低级野物他们三人都能很轻松的解决，同时也不忘把采集到的结晶送到我这里来，开始我吸收了一块绿能晶石这次正好又有我便拿去给佳茗试试，结果能量结晶没有任何变化依旧如同水晶一般，最后这些战利品全都被我吸收掉了，总共吸收了10粒能量晶石。让我感觉自己的小腹处的能量变得更加的丰盈起来。\n\n一路上十分的顺利，我们来到了次级灵能水晶矿脉的洞穴面前。洞穴口不算小，可以容纳2个人平行进入，在洞穴周围则是一片茂密的草丛，再远一些就是那些长得葱葱郁郁的树林。\n\n“这就是次级灵能水晶矿脉？”我问道。\n\n“是的主人，从这个洞口进去，走大约200步就能看到矿层了。”巨力回答道，显然这里对他来说是比较熟悉的。\n\n“那这里安全么？”我继续问道。\n\n“回，主人这个小岛附近都是一些低级野物，对我们来说没有任何危险。”巨力半跪着回道。\n\n“以后回答我的问题不用跪着~我问你，只要你知道的直接和我说就好了。”我很是不习惯巨力用看国家元首的样子对我说话的态度。\n\n“是的主人！”说着巨力就站了起来，整个身体笔直如同军人一般。\n\n“那我们就在这里扎营把。”既然这里十分安全，又是四面环水的环境，整体来说比在超市那边的环境好得多，超市那边四面十分的平坦如果遇上敌人，根本就没有地方可以逃躲，而这里不一样，这个小岛四面环水，而且面积也不小，到处都是树林草丛，碰上危险也能有逃避的可能。\n\n我刚说完这些，巨力三兄弟就走了出去各自准备起来，俨然跟之前我安排他们做的事情一样。看来他们很是认真的学习着我的生活习惯，并且主动的去分担这些工作，这让我很是满意。\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:11)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:13)"
		},
		{
			"post_id": 11,
			"title": "里世界-10-午夜的拜访",
			"date_published": 1519469790,
			"body": "在吃完晚餐后，白和佳茗她们都窝进了自己的被窝里面，小毛球到是十分的兴奋，跟着我在另一边的落地窗前四处嗅着。我则叼着一根香烟往窗外望去，外面一片寂静，天空中看不到星光连一点周围事物的轮廓都看不到。我背靠着落地窗角坐下，小毛球则爬到我的身上，在我怀里蹭了几下，找了一个舒服的姿势静静的闭上了眼睛。\n\n* * *\n\n不知过了多久，窗外出现了一阵绿色的亮光，我眯着眼睛看到了在不远的地方来了几个人立而行的地脉族的成员，其中那个老者和长得比较高大的家伙也在，他们身边还跟着来了几个其他的地脉族，他们都缓缓得跟在老者的身后。很快它们就已经来到了大门前。\n\n“砰砰------”\n\n“你好人类朋友。”老者在门外道。\n\n现在的佳茗还在睡觉，而白已经醒来跟着我来到大门前，我用钥匙把铁链打开站到了外面，心里有些疑惑的说道：“您好地脉族长者，这个时候来到我们这里有什么事么？”\n\n“我们是来和你做交易的。”老者说道，随之他向自己身后的人轻轻的挥了挥手。红色的大家伙往一旁站去后面跟着来的地脉族跟着走到了我的面前,在最前面的那个地脉族一身黑得发亮的毛发双瞳孔呈现出银灰色，在他的背后背着一把与他身体差不多高的大剑。在这个黑色的家伙身后还站着两个浅灰色毛发的家伙左边那个是一个独眼龙腰间挂着2把泛着紫色的匕首，另外一个背着一个箭筒一把黑色木料做的短弓。“黑色的家伙名叫，巨力丸，独眼的那个叫影丸，带弓箭的这位叫飞失丸，他们是三胞胎，我们地脉族的优秀的勇士也是我与你交易的筹码。”\n\n“交易？您们想要在我这里得到什么？”我有些疑惑的问道。\n\n“嗯，我们需要您的巢穴里面的东西。那些东西对现在的我们来说是十分重要的东西。”老者说道。\n\n“用三个勇士和我做交易？”三个地脉族的族人来和我做交易？他们需要哪些被雨能浸入的食物吧。但是三个地脉族的勇士和我交易，我又不是他们的什么重要人物，是派三个杀手和我在一起好随时击毙我吧......\n\n老者看我十分犹豫他继续说道：“当然，我也会让他们把自己的命魂也交给你，这样你就不用担心他们对你反抗了。”那三个站在我身前的地脉族兄弟听到老者这么一说，也是很无奈的激活了什么能力，散团绿色的如同火苗般的能量飘到我了我身前。老者继续说道：“我们地脉族是十分遵守信用的种族，有了他们三个勇士跟着你，对您现在的状况来说应该更有利一些对吧。”\n\n“那你们想要什么？” 我问道。\n\n“就是你们巢穴里的那些拥有雨能的东西，最少要八成。”老者继续说道。\n\n“八成？”本来这些东西足够我和佳茗支撑很长一段时间了，现在这个老家伙一来就要我们八成，这样的话我和佳茗大概只能在这里不用冒险寻找食物的生活1个月的时间，但是如果不予他们交易的话，我想他们这么想要这些物资，肯定也会下狠手的，虽然他们现在是采用的文明的手段来处理这些事情，但时间长了发现这里只有我和佳茗在这里生活，对他们造成不了任何威胁我想我和佳茗还会因此而丢了性命。看来还是只有让步，把东西给他们了。\n\n“当然，我知道只是三个地脉族的勇士肯定不够分量。”老者继续说道“作为交易我们也为您准备了足够价码，在我们的领地的东面有一座还未开启的灵能矿脉是一座次级矿脉，不过经过我们的学者的考察哪里的能量相当于您巢穴中的2倍之多，只是开采的时间比较长，而我们现在迫切的需要能够立即使用的雨能，所以我想我们可以把那个矿脉范围内10公里的地域拿来与你交换你看如何？这笔交易你与你们来说是十分划算的。”\n\n“次级灵能矿脉？加上三个勇士。那好我们成交。”反正怎么算都不可能包住现在的这些资源，他们又给我这些条件还是顺水推舟的好。\n\n地脉族老者见我答应了，也是十分的开心随即让那巨力丸三人交出了自己的命魂，三团火苗般的命魂飘到了我的手掌中化作一股奇异的能量流入了我的大脑之中，我立即对他们三个有了一种感应，仿佛只要我的一个意识就能够结束了他们的生命似的。\n\n巨力丸三兄弟的表情也从开始的无耐变成了臣服装。他们单膝跪在我的面前。\n\n“我们巨力丸(影丸、飞失丸）誓死效忠李默大人！”只听他们齐声说道。\n\n“好，都到一旁去吧，让他们取走自己需要的东西。”我说道，同时护着佳茗站到了超市大门旁边。\n\n老者也带着他的队伍井然有序的进入了超市。\n\n很快我们就交接完毕他们带着8成的食物走了，同时也给我留下了一份地图，这是他们自己的地图里面明确的标明了他们的领土范围，同时也把我的超市和灵能矿脉周围十公里的范围标示了下来。\n\n再次回到超市，现在的超市里面的蔬菜肉类还是零食这些全部都被他们一扫而空，就剩下了一柜的香烟和饮用水这些。\n\n而巨力丸他们则站在已经被锁好的大门旁边作为我们的守卫。\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:10)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:12)"
		},
		{
			"post_id": 10,
			"title": "里世界-9-不一样的天空",
			"date_published": 1519465312.838,
			"body": "翠绿色亮光很快就透过玻璃窗户照射了进来，把整个超市染成了绿莹莹的一片。空气中带着一种湿润的感觉，就如同清晨的风拂过面庞。\n\n“这真是奇妙，我感觉时间过得并不是很快，既然又是一天了？而且这次的 颜色是翠绿色的。”我感叹道。\n\n* * *\n\n“你们不知道我们这里的7个色时？”白有些讶异，李默竟然会有这样的感叹。\n\n“7个色时？这个我确实不知道，因为我们根本就不这里的居民，我们那边的时间可能和你们这里不一样吧。”我向白解释道。\n\n“我们这里有7个色时，墨绿；翠绿；青绿；黑；白；红；紫，7个色时。每个色时都代表着不同的力量，墨绿代表着智慧，翠绿代表着生命，青绿代表着精神，黑代表着破坏，白代表着速度，红代表力量，紫色代表创造。而且这个世界的族群都有自己的主导色，而我们地脉族的主导色就是墨绿色。”白解释道。\n\n“但是，我看你们的族群里面除了那个老者是墨绿色的，你和那个战士的颜色也不一样。”\n\n“那是因为我们是异者的原因。异者就是身体拥有各种颜色的个体，而我是白色所以我的速度非常的快，这是白色的异能赋予我的力量，而且做为异者，我们的身份也会比其他的普通族群的生命更高一些，所以作为你们的使节族群会派我过来，这是出于对你们族群的尊重。”白继续解释道。\n\n“哦原来是这样？我能感觉到我体内的灵能是绿色的，这就代表着我的生命力得到了增强对吧。”这就说得通，我为什么受伤后能够很快的恢复过来。\n\n“是的。”你的灵能拥有这样的效果，随之她转过头看向了佳茗，一层淡淡的青绿色的光晕包裹这她“你的小妹妹是精神类的，她能够用自己的灵能移动各种物体，如果能够得到更多的锻炼的话她还能通过精神进行远距离的心灵沟通等。”\n\n“那我们要如何进行锻炼？”\n\n“熟能生巧。”白淡淡的说道。\n\n......小佳茗倒是可以经常用精神力去试着控制不同的物体，而我呢，熟能生巧的意思是，要我经常战斗挨打？？？不会吧，我来到这个世界就是为了找虐的？\n\n“......我这个恐怕不是很好练。”我自顾自的说道。\n\n“其实你可以找我的，我能够陪着你一起练习。”白依然是很平淡的说道。\n\n这时那只小奶狗已经吃饱喝足，懒洋洋的趴在佳茗的怀里睡着了。\n\n“小佳茗，你来一下，刚才白看了一下你的身体，里面有青绿色的灵能，它可以教你如何运用自己的能力，这样一来，以后我们也多一些自保的手段。”我对小佳茗说道。\n\n小佳茗，小心的把小狗，放到了自己的被窝里面，一脸好奇的来到那个只有她半个身高的白色的地脉族女士的面前。只见那只白色的地脉族，的眼睛闪烁出绿光，盯着佳茗的眼睛。\n\n小佳茗站在那里楞了一会儿后，她便回到了自己的被窝处，用眼睛盯着放在她旁边的NF泉的瓶子，开始的时候她的小脸憋的通红，但是瓶子并没有任何变化，过了大约10分钟后，她的脸色好了很多，似乎开始慢慢熟练了起来，那NF泉的瓶子开始微微晃动了起来。\n\n“成了？”我激动道，其实佳茗的能力我很是喜欢！如果自己能这样运用就好了。\n\n“嗯，哥哥，我的感觉自己好像多了一只看不到的手一般，不过用起来有些费力。”佳茗也有些兴奋道。\n\n“嗯，多多练习熟能生巧！加油，看好你。”\n\n白也是微微点头，精神力需要很纯净的心灵才便于操控，而这个小女孩确实有这方面的天赋。\n\n“那么佳茗小妹妹，就先在这里练习，只要能够将这个瓶子举起来，你就算是成功了，以后就可以逐步的加大要移动的物体的重量就好，别太心急慢慢来。”说罢白转过身来对我说道：“李默先生，那我现在就陪你锻炼一下吧。”她做了一个请的姿势。\n\n我跟着她来到了超市门外的空地上，白调整了一下她的姿态，整个身子微微向前倾斜摆出随时都会一冲而出的动作。\n\n“嗖”一声，她的身影就已经消失不见。再次出现的时候已经是在我的背后，她的爪子成掌猛拍在我的身上“啪”，一股大力从我的背后传来，我 一下就被拍得爬在了地上......来到这个世界我已经是第二次被拍打趴下了。\n\n“......啊，你太快了，我完全看不到！”我大喊着。\n\n这时一个白色的身影出现在我的面前“熟能生巧，要用心！”说完那个影子又消失不见了。\n\n这一击并不是很重，没一会儿我就恢复了过来站了起来。刚把脚站稳，又是一道影子闪过我的左侧，一个大力拍在了我的肩头，顿时我整个身子飞了出去，一股控制不住的力量拽着我在空中翻滚着。“噗------”我又摔了一个狗肯泥......\n\n“要用心......”是白的声音，她在用心灵对话。\n\n就这样，我爬起来就被她给拍飞，又爬起来继续被拍飞......\n\n直到天色暗了下来.......\n\n一道白色的身影又突然出现在了我的右侧，不过这次，我一拳对着那个白影砸去，一只纤细的小爪子抓住了我的手。\n\n“看来你还是有些进步，能够判断出我的位置了，今天看来没有白费功夫。”说完她长长的吐了口气，好像在她的心里一直有一块大石头压着现在终于放下了一般。\n\n......我看得出来，她看着我在心里焦急着呢，可能是因为我很笨拙的原因......\n\n今天的时间过得视乎又比较慢些，感觉和我原来的世界差不多。\n\n天色已经暗下，我也收拾了一下自己身上的尘土和白一起进入超市，而这时的佳茗已经开始烹饪起吃的来，而那只小奶狗，既然也起来了，眼睛滴溜溜的乱转，整个身体也长大了一圈，身上的毛发很长很蓬松就像一个毛球一般，绕着佳茗身边乱转，不注意看还以为是一团毛球在地上滚动。\n\n佳茗看到我们进来了连忙招呼着“哥哥，白，稍等一会儿马上就可以吃晚餐了。”\n\n“嗯”我应了一声，就要去帮忙。\n\n切被飘来的NF泉水给挡住了“哥哥不用你来帮我啦，现在我感觉又多了好多只手了，不用再要你打下手了哟。嘻嘻。”\n\n在白的面前也飘着一瓶NF泉水......白看着佳茗一脸的满意，同时眼角转过来用余光看了看我似乎是在叹气？？？\n\n......我......我无话可说，小佳茗现在都能一个人一边用精神力控制着送水，同时在旁边的菜板上控制这菜刀切菜而且她人还在那里动着炒勺炒菜......这没法比呀。\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:9)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:11)"
		},
		{
			"post_id": 9,
			"title": "里世界-8-第三天",
			"date_published": 1519445750,
			"body": "看着那些地脉族群缓缓离开后，那只叫白的地脉族女士跟着我一同进入超市。\n\n小佳茗，有些激动的拽着我的衣角，同时好奇的打量着，我身边只有半人高的人立着的名叫白的地脉族。\n\n* * *\n\n白也很是好奇，看着我们所在的超市的琳琅满目各种商品，她能透过这些可食用的商品之中看到绿色的充满生机的能量。心里很是惊讶。\n\n我带着这个白“女士”来到我们搭火的地方，佳茗则跑去生活区弄了一套被褥安在了佳茗的“床铺”的旁边，并且也给我们各自带了一些NF泉水。\n\n就这样我们一起围坐了下来。\n\n“你好白。这里就是我们休息的地方，既然你作为我们的使节，那么就将就一下吧，请坐。”我用手指了指，佳茗给她铺的床位。\n\n“谢谢。”她很是优雅的学者我们窝进被子中。\n\n“哥哥，你的伤怎么样了？”佳茗很是关心我的伤势，走到我的身边，轻轻的把手搭在我的后背上。\n\n“我也不知道，在后背上的，不过现在没有感觉到什么疼痛，要不你帮我看看？”那个地脉战士一直轰击我的后背，我没办法自己看自己的后背到底怎么样了。\n\n说着我便脱下了身上的衣物，整个上身裸露了出来，佳茗则站在我的背后仔细的打量着。\n\n“只是一片浅红色的印记。”佳茗说道。\n\n“哦，还好。”说着我就把衣服重新穿上。\n\n而哪位白女士则是很淡然的看着这一切。\n\n检查完过后我直接就拧开了放在自己身旁的NF泉，大口的罐进嘴里。一股清凉的感觉直接通过我的喉咙，向着我的心肺浸去在我的胸膛里面扩散开来，一种很是舒爽的感觉传来。\n\n本来因为之前的战斗有些疲劳的身体也恢复了不少。看来之前那些光雨过后，浸入这些食物中的普通东西都开始发生了一些神奇的变化。\n\n而白也是学着我们用她的小爪子拧开了NF泉的盖子，小心翼翼的喝了一口，只见她的眼眸散发出盈盈绿光，持续了一阵后就慢慢恢复原样。\n\n我也静待她恢复后开始和她聊了起来。\n\n“白女士，你好，我叫李默，在我傍边的是我的妹妹李佳茗。其实我们也是第一次来到这里，对这里的环境很是陌生，还希望能够从你这里多多了解一下这边的情况，你们族里派你来做我们的使节，我想关于这些事情你应该可以跟我们说吧？”\n\n“李默先生，我有一个问题也想要知道，可否先和我说说么？”白并没有直接回答我的问题。\n\n“白女士，您请说。”\n\n“你们是怎么来到这里的？还有你们是使徒么？”她平静的问道。\n\n“使徒我们到不是，我只能说我是从爆裂的球形通道过来的。”我回想了一下，我们应该就是因为那场爆炸后来到这个世界的，虽然具体是怎么过来的并不是很清楚。\n\n“爆裂的球形通道？原界点？你们是通过原界点过来的种族！”提到那所谓的原界点，白的眼睛中闪烁着一阵异样的光芒。“你说，你们不是使徒，那你们是什么种族？”\n\n说道种族我们当然是人类！“我们是人类。”认真的回答道。\n\n她上下打量着我和佳茗，眼睛满是犹疑。\n\n“人类？没听说过的种族，不过世界之大什么样子的种族都有，也不排除有一个人类族，我想你们是从很远的地方，通过原界点过来的吧。”白平淡的说道。似乎她对于和她们差别特别大的生物并不会感到惊讶。“那你们生活的习性如何？是夜行性还是日行性？”\n\n“夜行性和日行性具体是什么意思？”我觉得很好奇，这个世界还有夜行性和日行性？\n\n“所谓的夜行性就是在整个世界都暗下来后，才会活动捕猎，繁衍的族类，日行性的随之相反。”白解释道。\n\n“哦，那我们可以算是两边都占吧。”回想起我们的生活，我们无论在白天还是黑夜都会有自己的活动，因为工作或者生活的原因我们都会因此而不一样。\n\n“这和原初族类很相似，不过看你们身体里的能量切实很少？莫非你们是被遗落的族类？”\n\n“我们的能量很少？？”她这么说我完全就蒙了..我怎么知道自己的能量有多少？\n\n“看来，你们的文明已经遗留得不多了，这些常识性的东西都没有保留下来哎，看来我们的世界真的正在走向终结。”白有些感叹道。\n\n“砰！”又是一阵巨响响起，就在超市旁边透过玻璃就能很清楚的看到。在哪里又出现了一个黑色的能量球，不过范围很小只有大约1米的直径。\n\n而白看到这个能量球的时候，身上柔滑的白毛立马炸了起来，很是紧张的盯着那团能量球。\n\n很快能量就开始破碎，随着一道刺眼的白光后，留下了一只白色的奶狗崽子。而在奶狗崽子一旁横躺着只有半截身体大狗尸体，看那个和伤口切面就如同之前我看到的那堵门墙后面一样......大狗的血液潺潺的从伤口中流出，把那只小狗给染成了红色。\n\n“呀，是一只小狗！”佳茗看到后，冲出超市把那只“嘤嘤”叫唤的小狗给带了回来。\n\n“......这么小，都还没有睁开眼睛，怕是活不了吧......”看着这只小狗，确实太小了一点，应该是才出生没有多久，就因为那种奇怪的黑色球体被带到了这边。\n\n“我一定要养活它！”佳茗说完就跑去了奶制品区拿了只纯牛奶，并在日常生活区找了一个小号的玻璃奶瓶出来开始给这个小家伙准备吃的去了。\n\n而这时的白也说话了“这个小家伙是一个空体，在我们这个世界根本就不可能活下来的。作为空体，在我们这个世界是根本就没有活下去的资格，只要下一轮的日光照耀下来，立马就会失去生命。”虽然看到这么小的生命很快就会死去，它也是无可奈何。空体在这个世界代表的就是死亡。\n\n“空体？你是怎么看出来它是空体的？”我很好奇的问道。\n\n“哦，这些基础的灵能运用你们都失去传承了？”白露出了惊讶的表情。\n\n“那你可以教我么？”既然她说我们的身体里面有能量，那么我应该也能控制。\n\n“你闭上眼睛，用心去感受找到那一团能量，它可能是温热的，也可以能冰凉的，根据每个族类的不同体质它们的表现都不一样，不过有一个共同点那就是它们总是集中在一起的。”白说道。\n\n我闭上了眼睛，认真的感受着自己的身体，确实发现以前从来没有体验过的感觉，有一阵温热感聚集在我的小腹中，“我似乎找到了。”\n\n“那么用你的精神把它引导至你的眼睛，并想象着要看穿那个小家伙的身体。”白轻描淡写的说到。\n\n我试着引导着那股暖流进入我的眼睛，而那股暖流也是很配合的往上流去，直接注入了我的双眼“已经到了眼睛的位置了。”我说到\n\n“那么你睁开眼睛，去看那小家伙吧。”\n\n当我睁开眼睛的时候，发现周围的景象变得更加的清晰起来，不时的能够看到在超市里面的那些食物，蔬菜，零食，饮料上面都包裹这一层绿色的光华，很是奇妙这个就是它们说的雨能吧？然后我把目光焦距在小狗的身上，切只能看到一个类似剪影的轮廓，里面是漆黑一片。“这就是空体！？”我惊喜道。\n\n“是的，这就是空体，它的体内没有任何的灵能，这样的体质在一个昼夜后就会很快的死去的。”白解释道。\n\n听她这么一说，我转过头去正好看到了白的身体，她的身体同样的是一个剪影般的轮廓，不过在轮廓内有着一道白色的光芒充斥着它的身体，光芒很是柔和，美丽至极。“......不好意思，我没有收回能量......”\n\n而这时的白，切很人性化的表现出了害羞的样子。\n\n这个时候，佳茗已经把奶瓶装好，开始给小狗喂奶了。\n\n“这怎么可能？？空体既然能够吸收雨能？”白看到正在喝奶的小狗，顿时惊讶了起来。\n\n听了她这么一说，我立马激活了，双眼看去，那小狗的黑色轮廓，正在慢慢的发出绿色的微光，微光也是向着它的小腹处聚集。\n\n“这有什么不对的么？”我问道\n\n“正常来说空体是不会吸收雨能的，雨能会主动的回避与空体结合。”白也是觉得不可思议。\n\n而在小狗狗吃牛奶等这会儿，天色也是越加明亮了起来完全变成了翠绿的颜色。\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:8)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:10)"
		},
		{
			"post_id": 8,
			"title": "里世界-7-第二天",
			"date_published": 1519379060,
			"body": "很快我们就吃完了晚餐，看看外面的景色依然入昨天晚上般漆黑一片，不过这次又有些不同，因为才不远的地方总能听到以下窸窸窣窣的声音，似乎是什么动物的声音，小佳茗也是听的真真切切，有些紧张的望向我这边。\n\n* * *\n\n“别太紧张，一定要把心态平静下来，不然等下碰上危险，没有注意到就不好了！”说着我也把自己的手搭在她的稚嫩的肩膀上面，我能够很明显的感觉得到她的身体在颤抖。\n\n“我会注意的。”说完她深深的吸了口气。\n\n这个时候，在超市的外面出现了一片黄豆大小的血色光点，一对一对的在漆黑的四周乱窜，同时发出“吱吱”的声响。\n\n这是一群，昨天从洞口里面冲出来的老鼠？？\n\n看到这样的情景我也是紧张起来，这么多，得有好几百只把？？外面乌压压的一片黑影，红色的光点一片一片的从我们的眼前飘过......\n\n不过还好，我们待着的这个超市是只有一个正门，其他地方都是用的1CM厚度的钢化玻璃做的落地窗户，周四墙柱都是切了大理石板的很是光滑，到不用担心它们从这些地方冲进来。我们只要守好2个窗户中间开出的一个玻璃切口。\n\n那些老鼠也在找突破口，围着整个超市外面不断的转圈，不是的把头贴到玻璃墙上闻闻。\n\n它们非常的警惕，在玻璃墙的其他地方他们都是贴着墙根走的，一旦到了我们这边他们就会主动的拉开一段距离，在我们的面前形成一片空白区域，佳茗跑到“床”边，把我那根2米长的钢条递给了我，同时自己也把自己的小棍子拿上站在我的身后，我们把蜡烛安放在两侧，把墙外照的更加的明亮，现在我们可以清楚的看到那群老鼠里三层外三层的把我们包围起来，有些老鼠不时被后面的老鼠给顶出队列，不过被顶出来的老鼠会非常激动的一个跳跃跳入后面的大军中去。\n\n“吱吱--吱吱-吱吱-吱------吱吱吱吱--吱吱---吱吱吱----”\n\n密密麻麻的老鼠发出的吱叫声，听得我们心里发慌。\n\n屋里的烛光不是的因为空气的微微流动而摇曳起来，拖着我们的影子在窗外摇曳，那些黑影扫到老鼠身上就会引起他们的恐慌。\n\n就这样我们相互僵持了15分钟左右，鼠群突然安静了下来，在远处缓缓的有一个约莫有三只老鼠大小的黑影正在往这边过来。\n\n后面的老鼠也很自觉的往旁边挤着，让开那个黑影，很快它们就让出了一条通道直抵我们面前的鼠圈。\n\n那只比平时大三倍的老鼠，既然是站着走过来的？？？？？？\n\n它手上抓着一根漆黑的木棍，拄着棍子来到了我们的面前。那只大老鼠，的眉心有者一块绿色宝石，它的眼眸是灰褐色的，它的双眼与我的眼睛相互对视了一下，额头的绿色宝石发出了一阵柔和的光芒。\n\n“奇怪的东西？”一个老头子的声音在我脑海里面响起。\n\n“你在和我说话？”我不可思议的盯着那只有大半个人高的老鼠。\n\n老鼠显出不耐烦的表情又盯着佳茗看了一下。额头的绿光又开始了闪烁起来。\n\n随后佳丽也是被吓了一跳大叫道“哥哥，那个老鼠在我脑袋里说话~~~它问我们为什么跑到他们的地盘？”\n\n！！我完全反映不过来呀~~老鼠像人一样走路，并且能够在我们脑子里和我们说话这个事情！！！\n\n过了一会儿，那个像人一样站着的老鼠老者，似乎是有些累了，便盘腿坐了下来开始和我们交流起来。\n\n“吱------我能感觉到你们的巢穴里面的那些食物充满了雨能，我们希望，你能将那些东西供奉给我们的女王。”老鼠老者用它那小爪子人性化的捋了捋下把上的一搓胡须。\n\n这些食物可是支持我们生活下去的源泉，如果就这么让给它们怎么行！“这些东西对我们来说也是很宝贵的，它们就如同我们的生命一般，我们可不能把它们白白的让出来给你们的女王。”我对着那只老鼠说道。\n\n“你占用了我们的土地，还不愿意供奉我们的女王，你是想要和我们的对立吗？吱-------”老鼠长者的眼睛闪烁出一阵凶意，而他身后的鼠群也开始疯狂的“吱吱吱吱---”的叫了起来。\n\n佳茗妹妹看到它们一阵凶吼，有些害怕的退到了我的身后，一只手抓着我的衣角。\n\n“我们也是不小心来到了这个地方，所以我还是希望我们不要相互干涉得好，我们也会尽快的离开这里。”我尽量让自己的心情保持平静。\n\n“就你们两个？能对付我们的家族？”老鼠长者说道。\n\n“你可以来试试。”我也狠狠的对这群老鼠吼道！不就是大些的老鼠么。\n\n“好，我们就来会会你们！”老鼠长者说道，它单手一挥，然后又是一阵吱吱声响后，从鼠群之中又一只有4只老鼠大小的人立人行的老鼠走了出来。\n\n这只老鼠跟人都出不多大小了！我不经想道。\n\n这只老鼠的头顶也有着一颗宝石，不过时淡红色的宝石，它望向我，额头上的淡红色的宝石释放出盈盈光芒随后我便听到它给我传来的声音。\n\n“老鼠？什么是老鼠？我们是地脉族！算了，不跟你说这些了，长老让我出面和你单挑，如果你能赢过我，那么我们就不会再来打扰你如何？”这是一个血气方刚的中年人的声音！\n\n看来他们是智慧族群，这是在试试我们这个族群的能力？试探性的对策？\n\n这时那个地脉族的老者缓缓的站了起来道“如何？既然来到了我们地脉族的领地，又不想要供奉我们的女王，那么你也得表现出你们的实力来，让我们看看是否可以与你们的族群平起平坐，如果我们这场对战下来我们赢了，那么你们的那些带有雨能的东西交给我们，我们还可以放你两一条生路，如果要反抗的话，就别怪我们对您们不客气了！”\n\n我转过身对佳茗说道：“佳茗，他们现在就是找了一个战士一样的家伙约战一场，条件也说的很清楚了，我和那只大老鼠打一场如果赢了他们就不再为难我们，如果不打不按他们的条件来，恐怕我们也挡不了这么多的地脉族。而且如果我输了也没事，把食物让给他们他们也不会杀我们，虽然我不愿意相信他们的话，不过我想我们可以尝试一下，毕竟这里已经不是我们以前待过的世界了。那就按着他们的方式来解决这些事情看看？”其实我自己真的没有任何把握，只能硬着头皮去干一场，可能也是我们来到这个世界中唯一的一场了。之后真的什么都不好说了。\n\n小佳茗，眼泪一直在眼眶里面滚动，她似乎有话想要对我说，但是她也没有开口，只是抓着我的衣袖，用很坚定的眼神看着我的眼睛，我分明的能从她的眼睛里看到（哥哥不要死......）\n\n“好！我们战一场！”这回我也豁出去了。\n\n小佳茗手里擎着蜡烛跟着我来到了，超市大门前面，我用钥匙解开了拴在门口的铁链，推门出去回头让小佳茗把门链重新锁上。\n\n地脉族长老和那只成人高的老鼠也伴随鼠群走了过来，长老往后退了一下，站在了族群前面，而那只成人高的地脉战士来到了我的面前。\n\n“那么我们可以开始了吧？”\n\n“好！”我回应到。\n\n说罢，那个强壮的家伙，一个箭步就冲了过来，一抓轰响我的胸膛“砰”的一声就把我给砸退到玻璃大门边上，如同重锤一般的力道透过我的胸膛直捣我的心肺，一种不可言喻的绞痛很快就传递过来，我整个身体都被痛得蜷缩起来。\n\n接着它又是一拳狠狠的击中我的背部一下把我给打趴在地，顿时喉咙一甜一口鲜血喷了出来。\n\n“哦，原来你这么弱？？？”地脉族战士很是惊讶的看着我。\n\n我得反击！一定得反击！！！！我的心里也是狠了下来。但是一开场就被这个动作迅捷的价格狠狠的砸了两拳，我的身体还没有缓冲过来，现在只能缓缓的动弹。\n\n“哦，这么弱的家伙......似乎我出场都有些太看得起这家伙了！”地脉族的战士发出心灵对话。\n\n我知道自己弱，但是我也有必须生存在这里的理由！这时的我，就在它发出心里对话的空挡，伸手抱住了这个家伙的双腿，用力的往回拽。\n\n“噗”一身，这个地脉族的战士被我拖着横躺在地上，它用力的挣扎，一拳轰到我的肩头想从的的捆抱中挣脱出来。经过前面的两拳后，现在的我感觉现在的力道似乎开始能够承受下来。\n\n地脉族的战士有些慌张起来，刚才两拳就被轰趴下的家伙，竟然现在能够接下它的攻击？？\n\n“你是什么家伙！！！一开始故意这么对付我么？？”一边散发出心灵对话，一边一拳接一拳的往我的后背砸下。\n\n“噗，噗，噗噗”它的拳头一直都没有停下，我感觉后背如被千斤重锤很砸，可奇怪的是现在的这个力道似乎已经被我的身体给接受，那种剧烈的绞痛也随之消失。同时我也感觉到我的小腹处的那团热量正在飞快的窜出，冲到被那地脉族战士击中的地方扩散开来化作涟漪。\n\n“李默哥哥！！哥哥！！呜呜呜------呜呜呜-------”玻璃大门背后的佳茗看到我被这只大老鼠很K的样子很是担心。\n\n而我就这样狠狠的缠着它的双腿，任由它的拳头砸过来，现在我的后腰也开始发力，硬是缠拽着它的腿，往后面拖动，慢慢的我也找到一点诀窍，能够更加轻松的挪移自己的下身，见它又要一拳砸来的时候，我猛的往后一震，它的重心失衡身子往后仰去，拳头砸出的力道在碰到我的后背时已经没有多少力量。\n\n就是现在！我稳住了自己的下盘，保持抱住他双腿的手不放，猛的往上一提，这个地脉族的家伙因为身体往后仰着，又是一股巨力向上一提，身体被担着完全收不回身。心里简直无以复加！！！（他明明是新手，怎么会有这样的力量！！！！根本就不会战斗的啊~~~~~这是怎么回事儿！！！）\n\n哈哈，现在我总于占了主导的位置，缠抱者它的双腿，用力的向下砸去“砰！”似乎听到了骨头的咔咔声响。\n\n“吱吱！”这只大老鼠发出吱吱的声音。\n\n而在玻璃门背后的小佳茗，已经目瞪口呆。\n\n我见它还想反抗，就又大力往上一提，猛的往下一砸。“吱吱吱---吱吱吱---”小样儿，还不是被我摔得吱吱乱叫么？\n\n“好了！！！！今天的比试就到这里！我们输了，以后我们都不会再打扰你。不过你们想要在巢穴外狩猎或者做其他事情，也得跟我们商议，不然我们依然得成为死敌！”\n\n“好！如你所说！”\n\n说罢地脉族长者的头顶发出绿色的光芒，扫向了族群，那些泛着红色光芒的双瞳都静悄悄的退回了黑暗之中，而那只健壮的地脉族战士也狼狈的爬了起来，一脸认真的看着我。只听他的嘴中哼了一声退到了长者的背后。\n“作为我们的新邻居，以后有什么事情好相互商议，我还是把我们的使者留在你这里吧，有什么事情，你想要知会我们的，直接与她说就好。”老者又是招手，一道白色的身影如闪电般窜到了我的面前。\n\n“她的名字叫白，以后作为使者待在你们身边可好？”老者问道。\n\n既然已经按照它们的规矩办事了，我当然也不好拒绝，低头看着这个只有半人高的人立着的白色的地脉族，她的嘴很是收敛，和雄性的地脉族相比看起来温和了许多，而且她的眼眸并不是如同老鼠那样突出在外面，而是如同人类的眼眶一般收在里面，整体看上去好看多了。\n\n“你好，以后我就作为你们族群的使者，希望以后能化干戈为玉帛，相互扶持共同进退。”这位白色的身段又动作奇快无比的地脉族开口说道！对她是真的直接开口说了我们自己的语言！！并不是通过宝石发光那样进行心灵传输！！！\n\n“你好，我也如你们所愿一般！希望以后能够和平的相处！”\n\n这时，天空已经泛起绿色的荧光似乎天空就要开始明亮了起来？？\n\n不过这个夜晚的时间过得似乎有点快？？？\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:7)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:9)"
		},
		{
			"post_id": 7,
			"title": "里世界-6-第一天",
			"date_published": 1519374466.597,
			"body": "现在我也收拾好了自己的行装，和佳茗妹妹一起弄了昨天晚上弄的西红柿炒蛋面，不过这次可不是我掌厨了，想起昨天的那个面汤，佳茗她肯定是不会再让我弄吃的给她了。\n\n* * *\n\n还别说，小佳茗除了很懂事以外，弄吃的也很有天赋，而且不知道她从哪里找了一本日常菜系列食谱，还一边认真研究一遍弄吃的。\n\n我的心里直呼，懂事！！越看她也越是喜欢。\n\n很快外面也吃饱喝足，我们一起收拾好后说道：“佳茗妹妹，要不我们今天就到周围逛逛？如何我想只要不走得太远应该没什么问题。”\n\n“好的哥哥。”今天的佳茗妹妹显得非常的主动亲切，看来前面发生的事情她已经看得比较开了。\n\n说着我们就往超市大门走去。\n\n站在门口，外面的景象依然是昨天傍晚十分的样子，一片绿莹莹的地皮，上面似青苔一样，不过经过晚上的光雨后显得更加有生命力。\n\n我依然是拽着佳茗的小手往外面走去，这次我们是往我自己家的方向走去，依然是那个小山丘，我们很快的就走了上去，似乎比之前更加轻松了，因为现在的光线很好，我们能够看得更远，在我的正前方就是我那栋被一起带过来的房子，而在房子后面更远的地方也有一些建筑，看起来十分的熟悉\n\n“锋利钢材加工厂”几个大字就在那座工厂的大门口。\n\n发现了新的目标我便带着佳茗往哪个方向走去，一路上我们都是小跑而行，连续跑了10分钟才来到工厂的大门口，我们从门口一侧的值班停的小门走了进去，值班停的门口也是大敞开着的，里面凌乱的放着几张凳子，靠墙的一侧有一张长长的沙发，近门口有一个电脑桌子，桌子上面有一台已经断电的监控电脑，电脑旁边有一本出入登记册子，上面写字几个名字和时间。\n\n我们两人没再看这些，跟着就往工厂里面走去，这里面到处都是金属材料，一些厚重的板材整整齐齐的堆在一起，在板材后面就是一大堆钢筋条子，每一根都有大拇指粗细，我在一旁堆着的断节里面找到2根钢条，一个2米左右的我自己拽在手上，一根2尺长的递给了佳茗，毕竟在这个陌生的地方我们得有防身的东西在，万一再碰上昨天的那种老鼠有家伙我们才能更有效的反击。\n\n再往里面走，就全都是大型的机器了~\n\n很快我们把周围都逛了个清楚，这里依然是没有半个人影。这让我们有些失望。于是我们带着自己的战利品（两根钢条）向超市那边走去。\n\n这次我们依然是小跑这一口气冲上了那个小山丘，我站在上面认真的打量一下，四周的环境，想要把他们牢牢的记在自己的脑海里以便下一次我们出去探索。\n\n回到了超市，我在学习用品区，找到了笔记本和原子笔，就开始画起了我们走过的地方的地图，佳茗则陪着我一起努力的回想那些地方是什么样子的，然后我把自己去过的地方都标记了一下，上面写上名字，比如我家就写了一个家，工厂就写了钢厂的名字，超市就写了生活中心字样。而其他的地方，只是如实的画在了上面，等我们修整好后，继续去探查一番。\n\n忙活完这些后，就又到了中午十分，佳茗也主动带着她的食谱开始准备我们的午餐了，今天早上她的动作都还很生疏来着，今天第二次开火她就已经渐渐的进入了状态，我呢也不好闲着，跟在她后面帮他打下手，比如清洗青菜，切肉片之类的。\n\n“不错不错~”我一边吃着小佳茗弄出来的食物，一边赞不绝口，如果换成是我在掌厨的话，我都不敢想象，我们以后还会有勇气自己弄吃的？\n\n“呵呵，哥哥，你别吃得太快，噎着了就不好了啦。”小佳茗看我吃得这么生猛连忙劝到。\n\n“唔------佳茗妹妹弄的东西-------真的很好吃，你------这方面的天赋真心的不错！！”我大口的吃着享受这这些美味。说来奇怪今天的这些食物其实是很简单的食物，但是一入口就有种停不下来的感觉。\n\n在把一大堆食物吃完后，觉得真个身体都舒爽了起来，肚子虽然装了很多，但是也一点都不觉得有被撑住的感觉。\n\n收拾完后我们也开始聊了起来。\n\n“小佳茗，今天我们就先这样吧，过了中午后，等不了多久就要进入傍晚了，这里不是我们了解的世界，如果按照我们那边的世界情况看，到了傍晚的时候，那些生活在这里的动物野兽什么的肯定会开始活跃起来，昨天晚上我们没有碰上什么危险但也不代表不会碰上，所以现在我们就得好好准备一下。比如要把门给关好挡下才行。”\n\n小佳茗很懂事的点了点头“哥哥，那我们现在就开始准备吧，我们一定要在这里好好待着等大人们来带我们回去！”说着这些她的两眼有那么一瞬闪烁出青绿色的光芒。\n\n说罢，我们就去到了日常用品去，找了一根很粗的锁链栓超市大门的门把手一侧“等到了傍晚时候我们就把它锁上。”\n\n“嗯嗯”佳茗点头应道。\n\n然后我们又折回去，到日常生活区带了更多的被子放到我们搭火的地方把自己床给重新整理了一下，时间就这么过去了。\n\n现在已经是傍晚十分，小佳茗主动的找我要了门口锁链的钥匙跑去把门口给锁上了，回来后直接就奔向了“灶台”开始烹饪起来。而我也跟着在她的旁边帮忙，时不时的还和小妹妹一起讨论做什么菜色。\n\n等做好饭后，天色已经完全暗了下来，我们点亮了从日常区找来的大蜡烛，两人面对面的坐下，静静的品尝今天晚上我们自己的劳动成果。当然除了吃的，我给自己准备了一瓶啤酒，小佳茗妹妹则是一瓶罐装的果汁儿。\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:6)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:8)"
		},
		{
			"post_id": 6,
			"title": "里世界-5-雨",
			"date_published": 1519371439.161,
			"body": "也不知道这样静静的躺着过去了多长时间，不过从落地窗往外面看已经是一片漆黑，一点光源都没有，我小心的从被窝里转了出来，用手机的微光照着，来到了超市门口的烟草柜旁，从里面掏出了一包ZH烟，再找了一个金属外壳的打火机，找了一个靠玻璃窗进并且能够一眼就看到李佳茗睡觉的位置坐了下来。\n\n* * *\n\n因为陌生的世界勾起了我好奇心，无论怎么都无法平复我的心情，就是睡不着觉。\n\n我点了一根香烟，又抬头望向天花板，脑袋里是一片空白。\n\n哎，怎么想都想不到原因，我从来都没有碰上过这些事情，算了想了也是空想......\n\n我刚好吐了一个烟圈，就发现外面有些绿色的光点，正缓缓的从漆黑的夜空中飘落下来，像是萤火虫一般又像是羽毛，在空中摇曳，这样的光景十分的好看。\n\n那些光点越压越低，像是没有质量一般，直接穿透了超市的天花板，往下飘落，我整个人都惊得僵住了！不过它们下落的很是缓慢，我赶忙冲到小佳茗的身边，用自己的身体挡着她，那些光点依然飘摇而下，光点落到了我的身上，穿透了我的衣服，直接浸入了我的身体中，一丝丝微微的凉意从光点落下的地方向着我的小腹处游走，这种感觉分明就是杀掉那只老鼠后从它脑子里蹦出的绿色晶石一样的感觉，对身体似乎没有什么伤害，这才让我平静了下来。\n\n我现在完全放弃了替佳茗挡住光点的动作，正坐在了她的身旁，只见一片如同鹅毛般大小的青绿色的光点飘到了她的脸上，那光点刚一触碰到她的脸颊，就化开浸入了她的身体，没一会儿她的脸颊透出了淡淡的红色，只听见她轻盈了一声后，满脸幸福的在被窝里面蹭了两下，依然平静的睡着，自从那青绿色的光点容进佳茗的身体后，其他的绿色光点都绕过她的身体向她周围落下，一些浸入了我的身体，一些浸入地板之中，还有一些落在了生食区的蔬菜肉类上面，也是浸入了进去，还有零食区域那边也是只见光点落上货架后都没有再往地上掉落，就连酒水，烟草，饮料区都是如此。\n\n随着越来越多的光点浸入我的身体，只感觉，微凉的感觉全都向着我的小腹集中起来，小腹最中心的地方泛起来温热的感觉，十分的舒服就像是在大冬天里，怀中抱着个暖宝宝一般。渐渐的我的睡意也开始迷蒙起来......\n\n转眼，一道新绿色的光线从落地窗射了过来，因为光线的刺激，我也从睡梦中苏醒过来，这次我感觉全身充满了活力，好像这一觉把我20年来没有睡好的全补过来了一样，我跟着也叫醒了佳茗小妹妹，她还是像没睡醒一样，嘤了一声，然后似乎是突然想起了什么似的，睁开眼望了我一下，透过她的眼睛我视乎在她的眼底看到了一片青绿色的光华？\n\n“李默哥哥早上好。”佳茗叫了我一身就自己从被窝里面爬了起来，我看着她站起来后，整个个头似乎高了许多，小手超出了衣袖一大截，裤腿也超出了一大截？\n\n“怎么就一下子长高了许多?”可能是昨天晚上的那绿色的光雨？\n\n这时候，佳茗也很是惊讶自己的变化，怎么只是睡了一觉自己就长大了许多，连平时自己平平的胸脯都涨大了小圈由原来的大指拇大小变成了小包子的大小，她见我盯了一下她的胸部有些不好意思起来。\n\n对了里面有个生活区，哪里有衣服你去换一换把。\n\n见小女孩，红着脸小跑过去的样子我也觉得挺好玩儿的。\n\n跟着我也站了起来，同样发现了这个问题，我的个子似乎也长高了一截？\n\n衣袖只能遮住我的手腕中间部分，裤腿也是露出来一寸......腿毛立见！！！\n\n好把，等佳茗换好了我也去给自己换一套衣服吧。\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:5)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:7)"
		},
		{
			"post_id": 5,
			"title": "里世界-4-只有我们两人",
			"date_published": 1519368269.009,
			"body": "整个超市的大门敞开着，门口处凌乱不堪，不过里面的货架依然摆的整整齐齐，里面没有灯光，只有外面的绿色微光从落地窗外投射进来。\n\n看来，这里的人都离开了，没有人被送到这个世界来。\n\n* * *\n\n我牵着小女孩，走了进去，在门口一侧是个5个大柜台连起来的收银台，台子是透明的货柜，里面放满了各种烟草茶叶和酒类饮料。在联排货柜后面是一排饮料架，里面也是琳琅满目的各种饮料，顺着超市规划的的道路一路往里面走，各种货架都有，锅碗瓢盆，油盐酱醋，米面干料，水果蔬菜堆得整整齐齐。看到这些我心里也是庆幸，在这个陌生的环境里还能碰上一个五脏俱全的超市！至少能撑住不少时间了。\n\n小女孩对这些全然没有兴趣，一脸没落的，看着她的样子我顺手从一排小吃货架上抽出了一块DF巧克力递到她的面前。她抬头看了我一眼，便收下了巧克力，小心的把包装打开，掰开了一小块儿放入了自己的嘴中，同时她还不忘给我一掰了一小块儿递到我的面前。\n\n约10分钟的样子我们已经把整个超市也逛完，里面除了货架没有半个人影，说实话我也有些失落，不过现在身边跟着一个小孩，自己得像个大人一样别把自己太过负面的情绪传达给她的好。\n\n于是我在超市里面找了找，找到了一个野营用的酒精炉子，是手提式的那种，然后又去厨用品区带了一口锅，我们两个人就在生食区那边的空当处生火弄些吃的，小女孩也很是懂事，她跑去找了两个塑料凳子，收罗了两副碗筷在一旁准备着。\n\n我用大门口饮水机里面的水清洗了一下锅具，开始弄吃的，当然我做饮食方面完全是个生手，就弄了一个炒鸡蛋，然后下了一点面，从蔬菜区找了些西红柿弄了两碗西红柿炒蛋面。\n\n我将热乎乎的西红柿炒蛋面端到小女孩的面前,她小心的伸出小手接过面碗说道“谢谢大哥哥。”\n\n说来我已经和这个小女孩在一起有些时间了，因为各种事情都堆在了一起，我都还不到她叫什么名字呢！“对了，我都还不知道你叫什么名字呢？以前没见过你呢？”\n\n“李佳茗，我很少回来的，这边是我外婆家里，我爸爸和妈妈在BJ那边上班平时跟着她们一起生活的，现在是放假期间，就回来看看奶奶的。”李佳茗小声的回到，她捧着大碗完全没有吃的样子，像是在等我问完后再开动的样子。\n\n“别只顾着说话，快吃面。”我说到，说着我也捧着自己的面碗大口的喝了一口汤......一个字咸......然后我看向了小女孩。\n\n她也是小口的喝了一口汤，眉头都邹在了一起......不过她发现我正在看她，还是给了我一个笑脸。\n\n......对不起，我自己的技术确实不行......我心里暗自抱歉。\n\n随后我们两都不约而同的跑去饮料架各自拿了一瓶NF泉，就着西红柿炒蛋面吃了起来。\n\n“哥哥，你叫什么名字？”在吃完了面后，小女孩小心翼翼的问我。\n\n对呀，我只顾问她的名字了，自己都还没有介绍呢~“我和你一样的姓，叫李默。”\n\n“李默哥哥。”知道了我的名字后她也跟着唤了一声。“我们现在在哪里，这里有我们镇上的超市，但是外面切是完全不一样的地方？”\n\n“这个我也不清楚，其实我和你是一样的，现在什么都不知道呢，不过我们两还算是好运，在这里有一家超市，里面的东西又很齐全，只要好好过，不要乱来，我想我们可以待上很长一段时间不用担心，吃喝住宿的问题，希望到时候能有人来找到我们把。你可不要到处乱跑。外面说不定会有什么危险的东西。”我强调道，我就怕小女孩好奇心太重跑到外面去，万一碰上什么危险的东西，我也照顾不到她，最好还是让她跟着我，两个先在这里待着稳妥些。\n\n“嗯，我会好好的待在这里的，不会给哥哥添麻烦。”小女孩很懂事道。\n\n在说话间，外面的天色更加阴暗起来，看来这里正是从傍晚入夜时分，我去日用品区，带了点毛毯和空调被在搭伙的地方铺好，就让小女孩躺到上面休息去了，她可能是一直保持紧张的情绪熬到现在，一躺到被窝里就开始打着哈切，最后还不忘看了我一眼才轻轻的闭上眼睛睡下了。\n\n而我则窝在她一旁的被窝中盯着天花板，思考着要如何在这里度过不知道多长的时间。\n\n只有我们两个人，一个大男孩和一个小女孩，这样的组合，真的能够挺过来么？\n\n只有我们两个人?\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:4)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:6)"
		},
		{
			"post_id": 4,
			"title": "里世界-3-伊始",
			"date_published": 1519307893,
			"body": "在一片紫色雾气的世界中，每隔一段时间就会“砰”的一声发生爆炸般的声响，声响过后就在爆炸的那片地域出现了完全不属于这个世界的东西大部分是建筑的残片。\n\n“砰------砰砰-------”陆陆续续的有着爆破的声音发出\n\n* * *\n\n只听见距离自己很近的地方一阵巨响，把我给惊醒了过来，现在的我正侧躺在自家墙角，在我一旁的是哪个穿着灰色衣服的小女孩。看到她眼角挂着泪珠的样子，我轻轻的推了她一把,她轻嘤了一声，迷迷糊糊的睁开了眼睛，先是慌张的望向了我，见到我在她的身边后，似乎放松了一些，这才四处打量了一下周围的环境。\n\n我们现在待着的地方确实是我自己的家里的样子，不过我往自家的窗台往外面看的时候完全是变了一个环境，以前在窗台对面的联排低矮平房变成了一块绿色的空地，上面稀稀落落的长者几颗灌木。\n\n小女孩也同样注意到了这些变化，一脸茫然的样子，不过还好有我这个相对熟悉的人站在她的身边，看她的样子安心了不少。\n\n我打开了自己的手机，上面没有半点信号，拨打紧急电话110.120.114都没有任何回应，看来这里根本就不是自己以前呆过的世界了。得想办法活下来才行！我心里暗暗下着决心。\n\n手机无用，我也只好打开了自己的房门，向着客厅的正门方向望去，那里不再是一个黑乎乎往外冒烟的黑洞了，就像是大门从来没有破坏过一般。\n\n我稍微收敛了一下自己的心情，走到大门处，轻轻的推开了大门，外面的景象已经完全变样，本来是对门的令居的房子已经消失不见，只有我自己的家留在了这个地方。\n\n小女孩，也紧紧的跟在我的身后：“大哥哥？”\n\n“我们去你奶奶家的那个方向看看吧，可能她也和我们一样来到了这里，说不定可以找到她。”我转过身拍拍她的头顶。\n\n“嗯。”小女孩表情认真的对我点了点头。\n\n我拽着，小女孩的手，往她奶奶家的方向走了过去，不过按照原来的路径，只需要转角就能看到的光景，在这里切依旧是一片绿色的空地，什么都没有。看来并不是一块儿被带到这个地方来了。\n\n“砰-------”又是一阵哄响，声音非常的近，吓的小女孩整个人都缩了起来，身体瑟瑟发抖。\n\n我用力的拽这她，往发生爆响的方向走去，穿过空地，前面是一个小山丘，不是太高只有30米左右，山丘上面只有少量的灰色的石块，整体来说还算比较平滑，地面上那绿色像是一片薄薄的青苔，但是脚踩在上面并不滑腻。一点也没有湿润的感觉，反而显得很是干爽。\n\n我们没一会儿就来到了小山丘的顶部，朝着发出巨响的地方望去，哪里有一个直径50米的圆形的黑色大坑，大坑的正中有这像是黑洞一般的能量球还在哪里发出低鸣。\n\n我们也不敢直接过去，只得坐在山丘山静静的等着。\n\n在过了10分钟左右，那个黑色的能量球已经扩大化覆盖了那个50直径的巨坑，黑色的能量密不透风完全将那个坑洞给罩住。\n\n不过着似乎已经到了能量球的极限，它的表面开始发生龟裂，白色的分叉痕迹在表面是不断的扩大衍生，很快就覆盖了整个黑色能量球，接下来如同玻璃破碎的声音响起，整个黑色巨球碎裂开来，细小的碎片快速的脱落，那些碎片是能量构成，在他们脱落的瞬间就开始消散开，在消散的瞬间释放出白色的光芒。\n\n这一切只是在一刹那间完成，白光过后，我的视力也已经恢复，以前那个巨坑也已经消失，取而代之的是一家超市？对是一家超市！！\n\n“LS平价超市”几个大字就在招牌上面！\n\n“哥哥，那是我们镇中心的超市！这么大的超市都过来了，里面肯定有人吧！”小女孩看到这么大的超市出现在了我们的面前，她显得非常的兴奋。\n\n“走我们去看看吧”我拽着她的小手往超市里面走去。\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:3)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:5)"
		},
		{
			"post_id": 3,
			"title": "里世界-2-缘起",
			"date_published": 1519298505.863,
			"body": "“啊~救命啊！谁能帮帮我们，我的奶奶还在屋里！------呜呜-------呜呜------”\n\n一阵急促的呼喊声将我从睡梦中惊醒！因为昨天玩了一把新发布的游戏，玩得特别欢快一下子忘记了时间，结果自己什么时候睡着的都不记得了。\n\n* * *\n\n我迷迷糊糊的从床上爬了起来，脸也没有清洗，就冲出了家门，向着发出求救的呼喊声方向跑去。过了一个转角后我这才发现就是有一个穿着灰色长裙的小女孩正站在门口哭喊着，而在她的身旁一大群的人潮涌过，都是一脸惊恐的样子。\n\n这样的情景让我感觉莫名奇妙？为什么所有人都在不要命的往大街上跑？\n\n“哄------”一声巨响从小女孩的房屋背后响起，只见整个房子的背后凭空消失了般，随之一大团淡紫色的烟雾从房屋消失的那片空间中弥漫出来，散发出淡淡的甜味！\n\n惊得我睁大了眼睛，简直不敢相信会发生这样的事情！\n\n而那个小女孩更是被这样的场面吓得不清，整个人都座在了地上连求救声都发不出来。\n\n我猛的冲了过去，抓住小女孩的手想要把她拉起来，但是现在的她已经完没了力气，没办法，只好将她横抱起来，往自己家里跑去。\n\n总算跑回了家里，小心的将小女孩放到了客厅的沙发上面，这时的她也稍微平静了下来，两眼闪烁着泪花望着我抽咽的说道：“大哥哥，我的奶奶还在那里！求求你救救她好吗?------呜呜呜------呜呜呜------”\n\n说实在的我现在都没有弄清楚是怎么回事！刚睡醒就碰上这种怪事，莫非是发生了什么天灾？不过之前完全没有感觉到有什么动静呀！不过看着小女孩哭啼的样子我还是决定去看看情况吧。\n\n摸摸了小女孩的头说道：“我去看看。”\n\n这回我又折回到刚才发生爆响的小屋前面，只见那些紫色的雾气已经弥漫开来，把整个小屋都包裹住，只是隐隐约约的能够看见，那小屋除了大门口前面的一片墙还在，后面整个程环形彻底消失了一般，切口如同镜面一样光滑，而更里面是一片漆黑，似乎里面有一条通道一般。\n\n“大门后面的一切的消失了呀！我要怎么去找人！”正在我徘徊着要不要去看看的时候，从那片漆黑里面传来了“吱吱吱”的声音，有一个棕色的如同家猫大小的动物从里面转了出来，我去，一只跟猫一样大小的老鼠？？\n\n而那只老鼠也发现了我，红着黄豆大的眼睛，猛的就冲了过来，我哪里想得了那么多，转身就往回跑，不过那只老鼠速度奇快！只是一刹那间就已经冲到了我们身后一下子扑倒了我的后腰“撕拉”一声就用爪子割破了我的外套，爪子低着我的后背拉出了一条巴掌长的血痕，痛得我冷汗直流。\n\n这一扑，我也整个人被顶着趴在地上，我飞快的翻过身，对着那只老鼠就是狠狠的一脚踢了过去，刚好提到了它的肚子，把它给踹了出去，不过它的身手非常敏捷，虽然被我踢到，它还是稳稳的四脚落地警惕的盯着我。\n\n我撑着身体往后退了一点，手边摸到了一根棍子，余光瞟了一下，是一根实心的扫帚的棍身。不过我刚把棍子抓起来，那只老鼠就盯了一下我手上的棍子，猛的一窜往我拿棍子的手臂冲去，我见它朝着我拿棍子的手冲了过来，心里也是一急，连忙曲身一脚顺着老鼠串过来的方向猛踢了过去，不过这次它冲得很快，我的脚没有踢到它，只有膝盖位置顶了它一下，这一下根本就没有什么力道，只能把它挡停在我的面前。\n\n那只老鼠在空中被我顶了一下，没有冲力，只能在我面前向下滑落正好在这个空挡时间，我已经收回来拿棍子的手，一棍就向着它的脑袋敲去！“砰-”一声闷响响起，没办法我的准头不行，本来是要敲它的头的结果只敲到了它的背上。\n\n这只老鼠很是耐打，棍子都敲到了它的背上也没有听到它的一声叫唤。当它四脚落地的瞬间又快速的发力逆袭而上要咬我的胳膊，我也没有其他回避的办法只得用另一只手去挡下来，又是一阵专心的痛苦从我的手臂上传来，不过伴随着疼痛我也感觉自己的越发清醒了过来，反应也开始跟得上这只老鼠的速度了。\n\n顾不得自己手臂传来的疼痛，我整个身子往前一压把它摁在了地上，怕它跑掉，用整个身体把它压在身下，拿着棍子的就朝它的头狠狠的戳去，一直戳一直戳，直到它没有动弹我才停了下来。\n\n这么一搞我也是满身大汗，看它完全没有了动静，我也静下了心情，认真的看了起来，它的嘴巴跟老鼠完全不一样没有具有代表性的尖锐的门牙，整个嘴更像是狗的嘴巴，眼睛确实是和老鼠一样只不过不是绿豆大小，而是黄豆那么大，脑袋------额已经被我戳得稀巴烂了，满是红彤彤的血浆和白花花的脑浆，不过在这一堆恶心的东西里面有一个发着奇异亮光的绿点，我用棍子将那个绿点掏了出来，这才看出来是一块绿色的水晶一样的东西，处于好奇我伸手去拾那个东西，不过刚一碰上那小块绿色水晶一样的东西就化作水分一样从我的指尖浸入我的身体。一股清凉的感觉从我的指尖流遍了我的全身，最后全部都集中在了我的小腹处，从哪里一股暖流再次扩散出来，暖流分别向着我受伤的手臂和后腰流去，不一会儿，那些受伤的地方快速的结巴并传出阵阵瘙痒，在痒痛过后结巴也一并脱落了下来，只留下一片干净平整的肌肤。\n\n！！！这完全超出了我的想象！！！莫非我睡一觉就已经穿越到了其他空间了？\n\n不过现在的情况已经不能给我更多时间去思考了！因为那紫色的雾气已经快弥漫到我的身边了！\n\n我快速的爬了起来，望了一眼刚才窜出老鼠的黑洞，就往自己的家里跑去。\n\n进了屋子里面，小女的见我回来忙问：“大哥哥，我奶奶怎么样了?你怎么没有把她带过来呢！”\n\n“抱歉，我过去的时候，你们家除了大门和外面的那排围墙还在，后面什么都没有了！只有个一个黑色的洞口，并且从洞口里面还在冒着紫色的烟雾，那烟雾可能有毒......”没办法，一直都有一层紫色的雾气，而且盈盈约约的看到在那排墙后面已经是空荡荡一片只留下一个黑洞，我也不敢在继续去看了呀！其实我心里也挺内疚的，不过自己就是一个普通人没有那个气魄去做一些带有自我牺牲的精神的事情！我还做不到。\n\n“呜呜呜------呜呜呜------奶奶------奶奶------”小女孩又开始哭了起来。\n\n而在小女孩哭泣的这个时候，又是一声巨响从我家大门传来。\n\n整个门口被一个黑色洞口吞噬了进去！紫色的雾气也从里面冒了出来！不缓不慢的朝着四面八方飘去。\n\n见到这样的情景我也是心生绝望！带着小女孩往自己的房间跑去，一把关上自己屋子的门扉。\n\n不过自己家因为是住在平民区，周围的不时会有盗窃事件发生，家里的所有的窗户都用钢条封住了的，也没有办法出去，而且家里还没有后门，现在大门被堵住了根本没有地方离开！\n\n哎，真实悲催的人生，我才20岁好不好，莫非就要莫名其妙的在这里和一个不认识的小女孩一起离开了？？？\n\n这时的我才想起自己还有一个手机，掏出手机给老妈拨了一通电话。\n\n“喂，李默，你小子还记得你还有一个妈呀！老妈都出去快一年了，你都不给我打一次电话，这回给我打电话是怎么了？缺钱花了？？”\n\n“妈，我们这儿出了点事儿，可能以后都不能联系了......”\n\n“你出了什么事儿？我这就联系你舅舅帮你解决！”老妈说完还不等我回话就挂了电话。\n\n我也是一阵无奈，老妈就是这么个脾气，因为她外出打工没在家里不能照顾我，一般我生病或者在外面闹了点事儿的时候，她担心我都会联系舅舅来看我一下，顺便帮我把事情给解决了，而且她也是个很急性子的人，虽然自己照顾不到也会不厌其烦的找她哥来照看我，平时都弄得不好意思。\n\n正想着这些，老妈那边电话就打了过来“儿子，别急啊，我刚给你舅舅打电话他没接着，你先给老妈说一下，你到底闹了什么事情了？你别因为出了事情把自己憋着了哟。”\n\n“妈，不是我出事情了，是我们这片地儿出了事情，具体的我也不知道，今今天我醒来才发现的，我在外面看到那些令居都急急忙忙的往外面跑，具体的我也不清楚，可能是发生了什么灾难吧。”\n\n“那你也跟着跑呀！别管家里那些不值钱的东西了，跟着出去到时候妈妈，想办法来接你跟我们一起过！我都说了，你一个人留在老家干嘛！你非不听，现在好了，你一个人在那里边，我也照看不到你！你得让我多操心呀！”\n\n“对不起妈，我现在也跑不了，我们家大门也被堵了。”\n\n“被堵了，你不知道想办法出去呀！”\n\n“家里的窗户都是钢条做的栏杆我也出不去呀。妈，对不起......我可能跑步掉了......”\n\n“......”老妈那头也一下安静了下来。\n\n而这个时候，那紫色的迷雾已经视门扉如无物一般浸透了过来，缓缓的向我们靠近，我拉着小女孩靠到了墙角，小女孩现在也安静了下来，知道自己已经没有办法逃脱，想到自己随后就要跟着我这个大哥哥一块儿死掉，有一个伴儿似乎也没有那么可怕了，到时候自己又能和奶奶团聚了。\n\n“哎哟，我的儿呀，你怎么能这样就丢下我呢！你不能就这么死了！你要给我好好活着呀，什么灾啊！怎么在我们老家就爆发了呀！呜呜呜呜--------呜呜呜-------”\n\n我强打起精神应道“妈妈，我还在，我会好好活着的！你放心......”\n\n这时正片紫色的迷雾已经把我和小女孩罩住，最后我还记得她到最后还死死的拽着我的衣角。\n\n[上一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:2)\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:4)"
		},
		{
			"post_id": 2,
			"title": "里世界-1-开篇",
			"date_published": 1519298382.984,
			"body": "世界历1500年\n\n月夜中在紫月山脉深处，被一片淡淡的迷雾围绕着的一片湖畔边有着一群穿着厚重风衣的神秘人，在那人群最中间站着一位看不到相貌，不过通过衣袖间透出的皮肤可以看出一定是一位年长的人。\n\n* * *\n\n其他围绕着那位长者的每个人都显得精神萎靡，不过他们望向中间长者的目光切闪烁者希望之光-对的一定是希望之光。\n\n“伟大的夜之神，请您开辟出新的道路让我们能够得以延续！”这是那位年长者发出的声音从（他）喉间发出的声音已经分辨不出男女。\n\n在说完刚才的话语后，他从自己的另一只藏在袖内的手伸了出来，（他）的手中握着一颗菱角分明的紫色类似水晶的晶体球。晶球散发着莹莹微光，缓缓的飘浮而上，不急不缓的上升至众人的头顶约3米左右的空中。\n\n围绕着长者的一群人，盯着那个浮在头顶的紫色晶体球，连眼睛都不敢再眨动一下......\n\n唔嗯-唔嗯-的声音从天空中传播开来，声音不大但是它能让能看到它的任何生物都听见这具有规律的声音。\n\n在这种声音持续了一会儿后，音调转高，似是穿透了人心一般的空灵在脑海中拍打。\n\n只见那颗闪烁着微光的晶体球一下子变得明亮起来，亮光把这片被迷雾覆盖的湖畔照得紫光盈盈，湖水变成了一片藏蓝，穿着黑色风衣的人群更是变成了一片人形的阴影立在哪里，中间那位长者抬头望着那片紫色的光华，眼眸中透出如同琥珀般的颜色。\n\n不过这个光景并没有持续多久，仿佛就在一个念头间突然消失。\n\n老者的眼眸一下子失去了光泽，仿佛他的灵魂伴随这这片紫光消失一般，围绕着他的人群一个个露出惊慌失措的表情，不过他们都没有因此而发出悲鸣，他们只是默默的承受这些。\n\n......\n\n“看来也只有这样了，我们的时代已经走向终结。”\n\n[下一章](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:3)"
		},
		{
			"post_id": 1,
			"title": "里世界-目录",
			"date_published": 1433033779.604,
			"body": "[里世界-1-开篇](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:2)\n\n[里世界-2-缘起](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:3)\n\n[里世界-3-伊始](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:4)\n\n[里世界-4-只有我们两人](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:5)\n\n[里世界-5-雨](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:6)\n\n[里世界-6-第一天](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:7)\n\n[里世界-7-第二天](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:8)\n\n[里世界-8-第三天](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:9)\n\n[里世界-9-不一样的天空](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:10)\n\n[里世界-10-午夜的拜访](http://127.0.0.1:43110/16UdGvj2aVpBq8chiB3rFvGeMq8mzQteiW/?Post:11)"
		}
	]
}