{
	"title": "中国人权报告",
	"description": "了解我们本该有的人权\n不吹不黑立场中立\n搬运人权报告完整全文\n{请将右上角0向左拉\n**下载并帮助本站分发文件**}\n\n计划做更多的专题页\n-----欢迎留言建议----",
	"links": "*   [联合国《世界人权宣言》](/1BefPqAk71W14av9ivEQjNTqnYLc2jAxpC/?Post:1:联合国《世界人权宣言》)\n\n*   [人权观察(HRW)简介](http://127.0.0.1:43110/1BefPqAk71W14av9ivEQjNTqnYLc2jAxpC/?Post:10:HRW+组织简介)\n\n*   [CECC 简介](/1BefPqAk71W14av9ivEQjNTqnYLc2jAxpC/?Post:11)",
	"next_post_id": 16,
	"demo": false,
	"modified": 1520915354,
	"post": [
		{
			"post_id": 15,
			"title": "New blog post",
			"date_published": 1520915354.35,
			"body": "Blog post body"
		},
		{
			"post_id": 14,
			"title": "CECC 2014年中国人权报告摘要",
			"date_published": 1520912437.916,
			"body": "2014 Annual Report Executive Summary Chinese Translation\n(2014年年度报告执行摘要中文译文) \n\n## 执行摘要\n\n美国国会及行政当局中国委员会（CECC）系由《2000年美中关系法》（19 U.S.C. 1307） 授权成立，当时中国正在准备加入世贸组织。委员会的职责是追踪中国的人权状况和法治进展，并向总统和国会提交年度报告。委员会的另一项任务是建立和保持一 个中国政治犯数据库，政治犯是指因按照中国宪法和法律及中国的国际人权义务行使其公民和政治权利而受到中国政府监禁的人士。委员会由九位参议员、九位众议 员和总统任命的五位行政当局高级官员组成，后者分别代表国务院、劳工部和商务部。来自行政当局的委员会成员一直参与并支持委员会的工作。本《年度报告》的 内容——包括其调查结果、观点和建议——不一定反映行政当局具体人士的看法或行政当局的政策。本报告涵盖的时段为2013年秋季至2014年秋季。\n\n委员会以17:0的票数通过本报告。\n\n* * *\n\n## 概述\n\n在 过去一年中，中国的总体人权与法治状况没有改善，在本报告涉及的某些领域中出现倒退。中国政府和中国共产党继续以人权与法治为代价强调专制统治。中国在和 平表达、集会和宗教活动方面的有限空间受到进一步压缩。政府加强了对维权人士、公民社会、维权律师、国内外记者、互联网和宗教组织的限制。另外，政府拒绝 为被监禁的活动人士提供医疗服务，并打击报复维权人士的家庭成员及与之有关的人员。一份前所未有的关于香港的白皮书的发布以及全国人民代表大会常务委员会 的决定导致人们对香港的“高度自治”和普选前景感到关切。政府继续在少数民族地区执行未能保障人权的严厉安全措施，近年来这些地区发生了悲惨的暴力事件和 自焚事件。这些负面情况使得一些领域中取得的进展蒙上阴影，包括政府宣布废除劳教制度以及在环境法和司法改革方面取得的一些进展。\n\n近两年前 习近平接任了国家主席和共产党总书记（任期可能是十年），他已经在这个国家留下了他的烙印。他的首要日程包括提出“中国梦”的概念，以促进实现“中华民族 伟大复兴”，以及发起一场反腐败运动，使中国一批最高层的官员落马。他领导的政府面临重大挑战：经济增长率下降、收入不平等、少数民族关系紧张、污染严 重、食品安全存在问题。但是，如本报告所述，习近平及其政府沿袭了前任的专制模式，该模式的核心原则是党的领导不容挑战，并针对党认为构成的威胁进行大力 压制。党的领导人宣称这一模式能保证“社会稳定”与“和谐社会”，但在这种模式下中国14亿公民不能自由参与决策和国家治理。他们不享有实质性的选举权。 他们也不享有中国宪法规定的言论、宗教和结社等基本自由。中国政府在口头上对法治概念表示尊重，但在实践中经常出于政治目的或为求增进中国的经济利益而无 视或扭曲利用国内法律和国际法。\n\n由于中国遵循这种模式，对美中关系和中国的自身发展构成了严重挑战。在具体改善人权与法治和保障美中安全与 繁荣之间存在直接的联系。美国的经济和环境状况、食品安全、以及太平洋地区的稳定都取决于中国遵守国际法、执行其国内法律、允许信息自由流动、解除外汇管 制、及保护公民的基本人权。更好地遵守国际法和更加尊重人权将增进中美之间的善意、信任和信心。为公民提供寻求公正的渠道和更大自由将有助于中国解决腐 败、劳工骚乱、少数民族关系紧张和食品安全问题。它将增进稳定，提升中国在世界上的地位。但是，除非中国领导人朝着一个新方向努力，开始把人权与法治视作 经济和社会进步的关键要素，而不是障碍，这一前景才有可能实现。\n\n### 2014年的重大变化\n\n过去一 年里的三大变化显示，与历届政府相比，习主席和他领导的政府可能加强控制，收紧对不同意见的宽容度。首先，共产党寻求扩大并加强它在关键问题上的权威，这 些问题涉及香港、互联网、媒体，少数民族地区、宗教和公民参与。第二，党采取措施改变了一些不受中国公民和国际社会欢迎的政策，但实际改革与官方所声称的 存在差距，相对党的政治日程而言，政策改革的实施仍属次要。第三，中国在国际参与中明显地试图控制人权与法治领域的话语权，转移国际社会对其侵犯人权行为 的注意力，并寻求降低既定的国际准则。下文阐述了每一种趋势。\n\n#### 加强在关键领域中的权威\n\n共产党在它认为正在 对其形成挑战的领域中寻求加强权威，把重大事件和变化视作威胁，而不是进行建设性接触和提高透明度的机会。2013年11月，中国共产党中央委员会召开了 十八届三中全会，当时有人认为会有重大改革措施出台。然而，共产党在其发布的文件中排除了政治改革的可能性，并且表示党要对三中全会通过的经济和法律改革 措施保持强有力的控制。\n\n在容忍不同意见方面，共产党进一步压缩了本来已经狭小的空间，并加强压制呼吁改善政府政策、扩大公众参与的个人和公 民团体。例如，“新公民运动”的参加者举行了小规模的和平示威及会议，要求政府进行改革，包括提高官员资产透明度和为流动人口的子女提供平等的受教育机 会，而这些都是政府表示关心的事项。值得注意的是，尽管这些要求改革的呼吁非常温和，但仍然不被许可。[政府]于2013年年初开始镇压，拘留了数十人， 今年法院把维权人士许志永、刘萍、魏忠平等核心人物判处严厉的徒刑。2014年6月是1989年天安门抗议活动遭到暴力镇压的25周年，在此前夕有更多人 被拘留，共产党压制了公民公开（有时是私下）纪念这一重要历史事件的活动。中国为数很少的维权律师被作为打击对象，其中包括著名公众利益律师浦志强。据一 些人权组织估计，当局在这场持续镇压中拘留了200多人。\n\n在本报告年度，香港特别行政区（SAR）发生的重要事件为中国政府和共产党重申 《基本法》保障的“高度自治”和“一国两制”框架提供了一个机会。但是，中国领导人没有利用这个机会，而选择强调中国对香港的主权和控制。香港定于 2017年首次通过“普选”产生特区行政长官，在就这次选举的公平性和公开性所作出的一项重大决定被公布之前，香港公众展开了更多辩论，中国的中央政府却 无视获得香港社会各阶层特别是青年一代广泛支持的大规模民主诉求。中国政府首次发布了关于香港的白皮书，强调中央控制而不是香港自治，并要求香港所有法官 和政府官员爱国（“爱国爱港”），而不是仅仅履行职责和解释法律，从而为香港的司法独立带来挑战。2014年6月，香港就产生行政长官候选人的提名途径举 行了一次非官方公投，吸引了八十多万香港居民参加，但中央政府却声称这次公投“非法无效”，而香港特别行政区的亲北京势力则在七、八月间另外组织了一场非 官方签名运动，谴责“占领中环”的活动。8月，全国人民代表大会常务委员会发布了有关香港选举改革的决定，对候选人自由竞选行政长官的能力作出严格限制。 中央政府的行动令人对香港脆弱的自由与法治的未来感到关切，而目前的自由与法治使香港有别于中国大陆，是香港作为金融中心和经济繁荣的基础。\n\n中 国官员面临的另一个问题是涉及维吾尔少数民族族群成员的悲惨暴力事件的激增。官员们采取的应对措施侧重于安全和经济手段，并没有设法化解数十年来由于中国 政策剥夺了维吾尔人的文化、宗教和语言权利而引发的不满，也没有努力在安全和公民自由及信息自由流动之间保持平衡。2014年9月，当局判处知名维吾尔学 者伊力哈木‧吐赫提无期徒刑，他是一位以和平方式温和地批评中国政策的人士，寻求促进维吾尔人和占人口多数的汉人之间的对话。对他的量刑清楚地表明，共产 党不会容忍有思想的辩论或重新考虑它对新疆维吾尔自治区的政策。\n\n在中国的藏族地区，作为少数民族的藏人的悲剧性自焚事件减少，但采用严厉的 安全措施和处罚措施的情况增多。有一个县发布了实施集体处罚的规定，以吓阻藏人自焚。中国政府领导人没有表现出意愿来检讨剥夺了藏人文化、宗教和语言权利 的政策或与流亡的藏人精神领袖达赖喇嘛的代表进行对话。\n\n共产党寻求收紧国内外的信息流动，以确保党的观点占据主导地位，对党不利的信息继续 被屏蔽。中国公司仍然属于世界上透明度最低的企业，部分原因是措辞含糊的保密法律不允许披露重要信息，这是一件令人关切的大事，因为中国公司具有全球性的 影响力，并且据报道存在非法补贴和腐败现象，特别是在中国十四万多家国有及国有控股企业中。共产党面临的最严峻的挑战之一是控制中国6.32亿互联网使用 者——这个数目超过世界上任何其他国家——以及二十五万名新闻工作者。当局在压制类似推特 (Twitter) 的微博的行动中拘捕了一百多位公民，大批中国公民把微博作为一个难得的能够以较自由的方式分享信息的空间。在这一轮压制措施之后，据报道在中国用户最多的 微博网站上的帖子数目减少了70％。中国记者本来就受到名目繁多的限制，现在又面临意识形态要求和进一步限制，因此难以在报道中批评政府或与外国记者分享 信息。政府把禁止入境作为报复外国记者和学者的一种手段。鉴于中国记者受到广泛的限制，外国记者在传播与中国有关的信息方面起着关键作用，有些人因为报道 敏感问题（例如中国最高领导人的亲属的财务状况）被迟发或拒发签证作为惩罚。在1989年天安门抗议活动25周年的前夕，他们收到关于如何进行报道的威胁 性警告。中国政府拒绝让一些寻求到中国从事研究的学者入境。\n\n当局还寻求进一步压缩宗教活动的有限空间。显然，中国参加基督教的人数日益增多使得当局感到担忧，因此基督教徒特别容易受到限制。政府利用拆除“违法建筑”的运动来拆除教堂和宗教标志，包括一些原来经过政府批准的建筑物。\n\n#### 在国内，干涉成为改革障碍\n\n党 采取措施改变了一些不受中国公民和国际社会欢迎的政策，但实际改革与与官方所声称的存在差距，相对党的政治日程而言，政策改革的实施仍属次要。在党的三中 全会期间，官员们表示，市场力量将在资源分配方面发挥关键作用，中国可能朝着遵守国际贸易规则的方向迈进。但是，发布的信息很少涉及具体内容，且包括一个 很重要的例外，即经常违反规则的国有企业将继续在经济中发挥领导作用。\n\n在官方大为报道的另一条三中全会消息中，官员们正式宣布废除劳教制 度，这是一种任意拘留形式，在过去几十年中用于拘留活动人士、法轮功修炼者和其他被边缘化的团体，它不需要经过法院审判，也没有基本的保护程序。废除该制 度是一项值得欢迎的进展，但这项政策变更的真正影响尚不明确，因为据报道当局更多地使用其他设施（例如“法制教育中心”和强制性戒毒中心）来任意拘留公 民。中国的刑事司法系统有一些改善，总体而言被告更容易聘请律师。但是，政治敏感案件中的嫌疑人似乎没有受益。酷刑、虐待、剥夺聘请律师的权利等现象继续 使得一些广受关注的案件受到负面影响，包括涉及伊力哈木‧吐赫提、许志永、张少杰牧师和一个寻求协助被非法拘留的法轮功修炼者的维权律师团体的案件。\n\n在 其他领域中，改革使一些政策产生了有限或表面的变化，却没有涉及导致有缺陷政策的违反人权的根本性问题。例如，政府宣布对中国的计划生育政策进行小幅改 动，允许夫妻一方为独生子女的家庭生育第二胎，但没有废除本来就违反国际准则、导致官员侵犯人权的政策。政府继续采取步骤有限度地放宽对公民自由迁徙的限 制，但没有纠正这项政策中违反迁徙自由的国际准则的内容。\n\n政府继续通过官方的中华全国总工会管理劳工关系，中华全国总工会是中国唯一合法的 工会，尽管相对而言该工会在过去一年中未能有效应对涉及多个行业和地区的罢工和其他劳工抗议活动。共产党没有采取任何步骤来允许工人组织独立工会。与此同 时， 政府压制了较为独立的劳工非政府组织（NGO）对支持工人所作的努力，在某些情况下拘留了此类组织的工作人员。继续有报道指出存在使用童工和强迫劳动的情 况。在本报告年度，政府把针对倡导公民社会的个人采取的压制措施进一步扩大，加大了对独立草根组织和外国非政府组织的监视和骚扰。令人不解的是，政府继续 声称它在放宽对所谓非政府“社会组织”的限制，让它们提供社会服务，减轻政府负担，却不取消对结社自由和营造一个生机勃勃的、自由的公民社会的基本限制。\n\n#### 在国际上，操纵有关中国的讨论\n\n令 人瞩目的是，在参加国际论坛的同时，中国力图控制有关人权与法治的讨论，转移对其侵犯人权行为的关注。2013年10月，联合国人权理事会（UNHRC， 中国于2013年11月重新当选为成员国）对中国政府的人权记录进行了第二轮普遍定期审议（UPR）。中国官员骚扰和拘留了寻求参加中国向人权理事会提交 审议报告的活动的公民，包括公民社会活动人士曹顺利，并拒绝允许独立的公民社会组织参加，导致中国的报告仅仅反映共产党的观点。曹顺利在获释几个星期后去 世，令人不免质疑她在拘留中的状况及是否缺乏适当的治疗。2014年3月的人权理事会会议通过了中国第二轮普遍定期审议结果，中国政府拒绝接受大部分实质 性建议，包括敦促其就批准《公民及政治权利国际公约》提出更明确的时间表。中国于1998年签署该公约，并多次承诺予以批准。在这次会议上，联合国工作人 员发现一名中国代表监视被监禁的中国异议人士王炳章的女儿并对她拍照，中国代表还试图阻止她在会议上发言。委员会审阅了过去一年里中国向多个人权机构提交 的报告，发现中国声称与之磋商咨询的组织中没有一个独立于政府。中国拒绝就对朝鲜违反人权状况进行的调查与联合国合作，并批评这项调查报告是“脱离”现 实。\n\n尽管加入世界贸易组织（WTO）已经有13年，中国仍然没有履行它的许多义务，包括终止对国有企业的补贴和优惠待遇以及在补贴、法律和 规章方面做到透明。据美国贸易代表办公室报告，过去一年里中国对在世贸组织投诉中国的国家征收报复性关税。5月，美国司法部对中国军方的五名成员提出起 诉，罪名是从事互联网盗窃，据说这五人的行动是针对参与对中国贸易制裁的公司。据美国公司和其他外国公司报告，它们在[中国政府的]反垄断执法行动中遭受 不公平待遇，一些观察人士认为，这次行动旨在保护中国公司，并可能违反了中国对世贸组织的承诺。据报道，中国未能执行世贸组织的一项对其不利的关于电工钢 案的裁决。至本报告发布之日，中国仍然没有签署世贸组织的《政府采购协议》。\n\n随着国际上关于政府对互联网进行限制和监视的适当限度展开进一 步辩论，中国试图操纵有关黑客行为的相关新闻报道（这些黑客行为据说有国家的支持），并且把自己说成是网络盗窃的受害者，而不是支持者或肇事者。由国家经 营的中国媒体以显著栏目刊登此类报道，尽管大量证据表明中国是通过互联网和其他途径盗窃知识产权的主要源头之一。在美国司法部对中国军人提出起诉后，中国 中止了一个与美国协作的互联网工作组，该工作组的使命是制定互联网联系规则。中国寻求推行“互联网主权”概念，这个概念如果实施，将以“国家主权”的幌子 给予各国更大的权力来限制其境内的互联网活动，从而削弱关于“通过任何媒介”和“不论国界”保障言论自由的国际法律。\n\n## 主要建议\n\n本委员会认识到，只有中国领导人和中国人民能够决定如何处理其国内事务，但认为国际社会有责任追踪国际准则的执行，并鼓励其发展与实施。基于本年度报告的调查结果，委员会向国会和行政当局提出以下13项主要建议，以鼓励中国执行国际人权准则和发展法治。\n\n· 行政当局的协调。行 政当局应当进一步加强部门之间的协调，确保与中国政府互动的各部门了解与其职责范围相关的人权与法治问题，并寻找机会通过双边对话和其他会晤与中国官员探 讨这些问题。在此类会谈中，美国国务院、司法部、能源部、商务部、国防部、劳工部、农业部、教育部、卫生和公众服务部、国家环境保护局、贸易代表办公室及 其他部门应当拓宽讨论内容，把中国人权与法治的改善同增进经济、安全、环境和外交利益结合起来。在白宫领导下通过美国政府各部门之间的广泛协调与中国开展 的统一人权外交应当体现于白宫、国务院或国防部制定的任何新的国家安全战略、四年度外交和发展审议报告或四年国防评估报告。\n\n· 行政当局的接触。行 政当局应当继续就本报告提及的问题表达适当的关切，涉及的领域可包括透明度、公众参与、善治、劳工权利、环境、公共卫生和法治，表达途径可包括美中战略与 经济对话、美中联合商贸委员会和其他双边会谈，并在美中两国作为成员国共同参加的多边组织中与有关国家协调信息和重点。行政当局应当考虑派遣级别更高的官 员参加美中人权对话和美中法律专家对话。\n\n· 维权人士与公民社会。国会议员和行政当局应当尽可能公开承认中国维权人士、独立非政府组织、公民社会和维权律师在促进中国的法治和保护人权方面所做的工作，并设法确保他们能够参加国际论坛和对话。\n\n· 签证政策。国 会议员和行政当局应当相互协作，确保现行签证法律和政策——包括《美国移民和国籍法》第212条和《第8697号总统公告》——有效地应对中国政府违反人 权的行为。国会议员和行政当局应当就当前签证政策针对中国官员的实施共享信息，考虑是否需要通过进一步立法或采取其他必要措施来解决美国记者、学者和人权 活动人士的签证申请被延误或拒绝的问题及类似问题。\n\n· 香港。国会 议员和行政当局应当续延《1992年美國-香港政策法》第301条的报告要求，特别关注香港民主体制的发展和中国根据国际条约和协议应当承担的义务，并确 保香港的相关发展被列入与中国 有关的其他报告。国会议员和行政当局应当通过声明、最高层会谈及对香港的访问加强对香港民主的支持。鉴于北京的中央政府官员在决定香港的政治发展方面起着 决定性作用，在与他们会谈时应当提出香港的问题。\n\n· 新闻自由。国 会议员和行政当局——包括美国政府最高层官员——应当更多地公开谈到中国的新闻自由问题，谴责对国内外记者的骚扰和拘留、延误和拒绝外国记者的签证申请、 审查和屏蔽外国媒体网站。美国官员应当始终把新闻自由与美国利益相联系，指出对记者和媒体网站的审查和限制如何妨碍有关公众关切的问题的信息自由流动，包 括公共卫生和环境危机、食品安全和腐败等问题，并指出这种审查和限制构成了对寻求进入中国市场的外国媒体和公司的贸易壁垒。\n\n· 强迫劳动、童工、监狱劳动。国 会议员和行政当局应当确保旨在防止进口和政府采购强迫劳动、监狱劳动或童工产品的现行法律和政策——包括《1930 年关税法》第1307节、第13126号行政命令（禁止采购涉及强迫劳动或契约童工的产品）、第13627号行政命令（通过联邦政府项目承包加强对人口拐 卖受害者的保护）——有效地应对中国的强迫劳动、监狱劳动和童工问题。国会议员和行政当局应当考虑是否需要通过进一步立法或采取其他必要措施来提高供应链 透明度，堵塞《关税法》中的漏洞（如消费需求豁免），消除有效执行美国贸易法律的障碍，确保各方遵守关于贸易、强迫劳动和监狱劳动产品出口到美国的现有协 议。\n\n· 商务法治。国会议员和行政当局应当确保中国在终结外汇管制、补贴国有企业及本报告提到的违反中国现行国际贸易义务的其他政策上作出具体改进，以此作为在美中贸易谈判中取得任何进展的先决条件，并确保在此类谈判中的透明度和美国社会各阶层的充分参与。\n\n· 少数民族。行 政当局应当在双边安全对话以及与中国军方和警方官员的任何交流中讨论中国少数民族地区的人权、安全和稳定问题，介绍最佳规范和策略，通过合作交流确立平衡 公民权利和国家安全政策的方法，区分和平抗议和暴力行为，在“反恐”行动中保护人权，并承认适用于难民人口的国际保护。\n\n· 计划生育。由 于中国的强制性计划生育政策加剧了性别比例失衡，因此在有证据支持的基础上，国会议员和行政当局应当公开地把性别比例失衡这一问题与潜在的地区性人道主义 和安全问题联系起来，包括人口拐卖、犯罪、国内外人口流动增加及可能存在的其他严重社会问题，并在双边安全对话中讨论这些问题。国会议员和行政当局官员应 当敦促中国政府废除对家庭的所有生育限制，代之以基于人权的方法，为所有公民特别是妇女提供自由，使他们能按照自己的意愿，并且在隐私权受保护的前提下来 筹组家庭。\n\n· 互联网自由。国会议员和行政当局应当保持并在适当时 扩大开发和广泛传播有关技术项目，帮助中国的维权人士和公民社会组织绕过互联网限制，以便存取和共享受国际人权准则保护的内容。国务院和广播理事会应当继 续扩大促进中国互联网自由的项目，为中国的博客作者、记者、公民社会组织以及人权和互联网自由活动人士提供数码安全培训并帮助他们进行能力建设。\n\n· 可能取得进展的领域。国 会议员和行政当局应当承认并向中国官员进一步了解可能取得进展的领域，包括已经宣布的废除劳教制度的决定、减少误判和增加刑事案件中被告保护措施的努力、 通过修订《中华人民共和国商标法》增加商标侵权的法定损失赔偿、修订《中华人民共和国环境保护法》（包括可能提高透明度的条款）、加强保护残障人士和家庭 暴力受害者的措施、以及本报告各章节提及的具有积极意义的其他可能进展。\n\n· 提出政治犯个案。国 会议员和行政当局应当考虑更经常地向中国官员提出——无论是私下还是在公开场合——中国受到拘留或监禁的政治犯或宗教犯。除呼吁释放个人之外，国会议员和 行政当局还应当考虑在适当时基于可靠信息提出值得关切的具体问题，包括监狱的生活条件、个人健康和能否获得医疗救治、可能的减刑和保外就医、允许家人探视 和聘请律师、停止骚扰家庭成员或朋友。我们鼓励国会议员和行政当局查阅“政治犯数据库”[https://ppdcecc.gov](https://ppdcecc.gov)，以便掌握关于囚犯或囚犯群体的最新可靠信息。下文列出了与本报告提及的各种问题相关的一些个案，这些案件需要从法律或人道主义方面予以关注，类似的案例有很多。\n\n| **姓名和****CECC****案例编号** | **案例概述** | **当前问题** |\n| --- | --- | --- |\n| 浦志强2014-00174 | 浦志强，知名公共利益律师，2014年5月被拘留，2014年6月被正式逮捕。被拘留之前，他曾参加一次私下举行的纪念1989年天安门抗议的活动。 | 浦志强患有多种疾病，包括糖尿病、高血压和高胆固醇。2014年6月，他在被拘留期间告诉前来探视的律师\"他的健康状况正在恶化\"，其原因之一是他的糖尿病没有得到适当治疗。 |\n| 洛桑金巴2012-00275 | 洛桑金巴，藏族佛教僧侣，2013年2月被判处5年刑期。他可能向外国媒体提供了有关2012年6月一次两人自焚事件的信息。 | 据2014年5月的一份媒体报道，由于肾脏和肝脏\"疾病\"，洛桑金巴的\"健康恶化\"，监狱未能提供足够的营养，并拒绝给予治疗。基于他被收押的日期和他的刑期，他在2014年5月就应当有资格保外就医。 |\n| 张少杰2014-00126 | 张少杰，原在官方许可的教会中担任基督教牧师，2014年7月被判处12年刑期。据报道，他曾因用于建造新教堂的土地与地方官员发生争执。 | 据报道，当局在张少杰一案中有数项违反程序的做法，包括一再试图阻止他聘请律师和官员们拘留证人并强迫他们提供不实证词。 |\n| 刘晓波2004-03114 | 刘晓波，知名知识分子和政治改革的长期倡导者，2009年12月被判处11年刑期。他是《零八宪章》的起草人和组织者之一，该文件倡导政治改革和人权。 | 刘晓波仍然被囚禁于辽宁省锦州监狱。基于他被收押的日期和他的刑期，他在2014年6月就应当有资格获得假释。由于\"长期在中国为争取基本人权从事非暴力斗争\"，他在2010年12月获得诺贝尔和平奖。 |\n| 刘霞2010-00629 | 刘霞，政治改革倡导者刘晓波的妻子，自从2010年10月以来一直被软禁在北京家中。当局没有对她提出任何控告或把她定罪。 | 当局继续对刘霞进行监视，并以其他方式限制她的行动和言论自由。2014年2月，据报道，在刘霞的心脏问题和严重抑郁致使其健康恶化之际，她住进了医院。另据报道，当局拒绝让她到国外接受治疗。 |\n| 刘萍2013-00161 | 刘萍，人权倡导者，2014年6月被判处6年半刑期。她曾参加要求官员公示财产的和平示威。 | 据刘萍的律师在2013年7月说，她在被拘留期间变得\"十分虚弱\"，\"体重减轻很多\"。据报道，她在被拘留期间因卫生条件恶劣引发严重腹泻，但当局拒绝给予治疗。 |\n| 伊力哈木‧吐赫提2012-00275 | 伊力哈木‧吐赫提，教授和知名维吾尔倡导者，2014年9月因\"分裂国家罪\"被判处无期徒刑。 | 伊力哈木‧吐赫提患有多种疾病，包括心脏病、咽炎、前列腺炎和一种不明肝病。据报道，他在2014年6月告诉前来探视的律师他\"在被拘留期间受到虐待\"，包括当局连续10天不给他足够的食品和饮水。 |\n| 陈克贵2013-00120 | 陈克贵，法律倡导者陈光诚的侄子，在他的叔叔于2012年4月逃离非法软禁之后，他于2012年11月被判处3年零3个月刑期。 | 陈克贵患有阑尾炎。他的母亲在2013年12月前往监狱探视他之后说，他的\"气色很不好\"，\"他捂着肚子，大汗淋漓\"。当局曾一再拒绝让他保外就医的请求。 |\n| 朱虞夫2004-02253 | 朱虞夫，长期民主活动人士，2012年2月被判处7年刑期。他被当局囚禁在浙江省浙江第四监狱。 | 朱虞夫患有多种疾病，包括冠心病、脑血管硬化、腰椎间盘突出症和高血压。据报道，拘留期间当局多次拒绝为他提供适当的治疗，并一再拒绝他提出的保外就医申请。 |\n| 陈西2008-00379 | 陈西，民主倡导者，2011年12月被判处10年刑期。他被当局囚禁在贵州省兴义监狱。 | 陈西患有肠炎。他的妻子在2014年5月前往监狱探视他之后说，他的\"身体变得很弱，很瘦\"。据报道，当局拒绝为他提供适当的治疗，尽管他\"严重腹泻\"一年多。 |\n| 许志永2005-00199 | 许志永，知名维权人士和新公民运动（NCM）倡导者，2014年1月被判处4年刑期。在许多年里，他一直积极推动法律改革和教育平等事业。 | 据报道，当局在许志永一案中有数项违反程序的做法，包括恐吓证人、阻止独立观察人士进入法庭旁听。他曾告诉一位同事，拘留他是出于政治动机，因为警方曾试图与他达成一项交易：如果他放弃新公民运动，即可以避免坐牢。 |\n\n* * *\n\n# 调查结果和建议（按问题列出）\n\n言论自由 | 劳工权利 | 刑事司法 | 宗教自由 | 少数民族权利 | 计划生育 | 居住和迁徙自由 | 妇女状况 | 人口拐卖 | 在中国的朝鲜难民 | 公共卫生 | 环境 | 公民社会 | 民主治理机制 | 商业领域的法治 | 获得司法公正的途径 | 新疆 | 西藏 | 香港和澳门的发展\n\n下文是本年度报告各章节陈述的具体调查结果的概要，它涵盖了委员会追踪的各个领域。在每一个领域中，委员会列出了一组值得在下一年 度关注的问题，并遵循委员会的法定职责，就每一个领域向总统和国会提出一组建议，以便采取立法或行政措施。\n\n## 言论自由\n\n### 调查结果\n\n· 中国政府和共产党继续以违反国际人权准则（包括《公民及政治权利国际公约》第19条和《世界 人权宣言》第19条和第29条）的方式限制言论。虽然此类准则允许不同国家在有限的情况下限制言论以保护某些利益（如国家安全和公共秩序）， 但中国政府的限制措施涵盖了更广泛的内容，包括和平抗议以及批评中国共产党和政府的言论。\n\n• 中国政府继续采取步骤扩大国家的电信基础设施，为更多人提供互联网接入能力，特别是移动通信能力。截止于2014年6月， 中国有6.32亿互联网使用者，其中有5.27亿人通过手机使用互联网。\n\n· 中国政府和共产党官员对其控制互联网的能力感到严重关切，表示要重新加强控制。一些报告 把互联网或网上公众舆论描述为“斗争”、“战场”或对当局的“新挑战、新考验”， 有些报告引用习近平主席的“宣传思想工作”指南为依据。当局发起了一场压制广受欢迎的微博的行动，拘留了一百多名微 博作者，据一项研究结果，这场运动导致微博上的帖子数目减少70％，微博是最受欢迎的微型博客平台。\n\n· 中国当局继续屏蔽和过滤敏感的网上内容，有时是通过审查运动。在高层党组织领导下，官员们 发动了一场“扫黄打非”运动，政府和党似乎通过这场运动加强了对互联网的控制并扩大了控制范围。今年被禁止的议题包 括与保护环境有关的抗议活动、腐败调查、以及1989年天安门抗议活动和对这场抗议的暴力镇压25周年。在天安门周年纪念日之前，美国公司 谷歌遭遇服务中断。另一家美国公司领英(LinkedIn) 开始审查源于中国的敏感的网上内容，包括一个支持在1989年天安门抗议活动中被 暴力镇压的受害者的视频。\n\n· 当局继续拘留和骚扰人权和民主倡导者、互联网作者、维权律师、公民记者以及行使言论自由权 利的其他人，一些国际媒体和中国国内人士把这场镇压称为数十年来最严重的一次。当局以措辞含糊的罪名和法外骚扰处罚自由发表言论的公 民。因行使言论自由权利而被拘留或骚扰的人士包括一名16岁的微博用户杨忠（网名：杨辉）；维权人士胡佳；“公民记者” 柳学红、刑鉴、王晶；互联网用户秦志辉。诺贝尔和平奖获得者刘晓波的妻子、艺术家和诗人刘霞仍然被在家中软禁，没有报道显示她被控以任何 罪名。当局还打击寻求通过私人聚会、纪念仪式或网上活动纪念1989年天安门抗议的人士，例如倡导者团体“天安门母亲” 的领导人丁子霖和尤维洁；制片人何杨；互联网用户顾义民和张坤乐；记者高瑜；纪念活动参加者陈卫、于世文、石玉、方言和侯帅；以及大学生赵 华旭。\n\n· 中国政府和共产党继续违反国际准则控制新闻。从2014年起，中国的媒体监管机构国家新闻 出版广电总局（简称“广电总局”）开始要求中国的25万名新闻工作者参加一个政治培训项目，作为每年续延记者证的一项条 件。据报道，该项目包括一次考试，其内容与“中国特色社会主义”和“马克思主义新闻观”有关。广电总 局还指令媒体机构禁止记者未经其雇主批准发表批评性报道、报道其指定范围之外的议题、或通过其个人网站或出版物发表批评性报道。\n\n· 敢于直言的记者和报社工作人员继续因为发表官员们认为敏感的评论或从事调查性报道而受到 报复。例如，记者刘虎被逮捕、中央电视台记者王青雷被解聘、腾讯记者张贾龙被解聘、记者罗昌平被调离工作岗位、报社员工辛健被拘留。\n\n· 国际媒体组织和美国政府官员对外国记者能否在中国进行独立报道表示严重关切。2013年12 月，由于一些媒体报道了中国领导人家庭成员的资产，当局迟迟不给大约二十多名为这些媒体工作的记者延长签证。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 更多地公开谈到——包括在美国政府最高层——中国的新闻自由问题，谴责对国内外记 者的骚扰和拘留、延误和拒绝外国记者的签证申请、审查和屏蔽外国媒体网站。美国官员应当始终把新闻自由与美国利益相联系，指出对记者和 媒体网站的审查和限制如何妨碍有关公众关切的问题的信息自由流动，包括公共卫生和环境危机、食品安全和腐败等问题，并指出这种审查和限 制构成了对寻求进入中国市场的外国媒体和公司的贸易壁垒。在战略与经济对话以及其他双边对话中向中国官员提出这些问题。对中国对待外 国记者的方式在何种程度上违反其世贸组织义务或其他义务作出评估。\n\n○ 继续开发和广泛传播有关技术项目，并在适当时扩大此类项目，帮助中国的维权人士和公民社会组织绕过互联网限制，以便存 取和共享受国际人权准则保护的内容。国务院和广播理事会应当继续扩大促进中国互联网自由的项目，为中国的博客作者、记者、公民社会组织 以及人权和互联网自由活动人士提供数码安全培训并帮助他们进行能力建设。\n\n○ 在所有适当的双边会谈中向中国官员提出，当中国政府限制政治辩论、不允许倡导民主或人权以及通过其 他形式和平地表达政治见解时，美中关系就会受到损害，也会削弱中国公众对政府机构的信心。要强调此类限制违反有关限制言论自由的国际准 则，特别是《公民及政治权利国际公约》第19条和《世界人权宣言》第19条和第29条中的准则。还要强调此类限制会削弱公众对媒体和政府机构 的信心。针对中国的下一轮普遍定期审议提出问题，请中国解释它将采取哪些步骤确保对言论自由的限制符合国际准则。\n\n○ 敦促中国官员终结对中国活动人士、律师和记者的非法拘留和骚扰，这些人由于行使言论自由权利而受到报复。呼吁官员们停止 对刘霞等人的非法软禁，释放或证实释放了因行使言论自由权利而被拘留或监禁的人士，例如秦志辉、顾义民、张坤乐、高瑜、于世文和侯帅。在 双边对话中提出这些案例，例如美中人权对话、美中法律专家对话以及战略与经济对话，并利用联合国人权理事会的普遍定期审议和联合国任意 拘留问题工作组等多边机制。\n\n## 劳工权利\n\n### 调查结果\n\n· 中国政府的法律和规范继续违反有关结社自由的国际准则。中国工人没有权利自由成立工会或 参加自己选择的工会。中国政府和共产党领导之下的官方工会中华全国总工会（简称“全总”）是中国的唯一合法工会组织。\n\n· 全总在管理劳工关系时继续侧重于经济发展和社会稳定，但是在劳工骚乱事件不断发生的情况 下，全总基本上没有对工人表示支持。\n\n· 无论是在法律上还是在实践中，集体谈判在中国依然有限。虽然全总近年来促进集体合同和集 体工资谈判，集体合同和协商程序依然存在问题，部分原因是工会缺乏自主权，也不能真正代表工人。\n\n· 由于得不到全总的有效支持，出现了劳工非政府组织（NGO）和其他公民社会行动者，它们在为 工人提供咨询和支持方面发挥着更大的作用。但是，此类组织的代表面临骚扰和拘留。2014年4月，当局拘留了劳工非政府组织工作人员张治 儒和林东，原因是他们帮助广东省东莞市一家鞋厂的罢工工人。许多劳工权利组织也在充满变数的条件下运作，因为它们常常不能作为 “社会组织”向当局注册。\n\n· 委员会继续看到工人们组织罢工和示威的报道，这些活动跨越中国的多个行业和地区，起因常 常是由于与劳工有关的系统性不满，例如工厂关闭或迁移、拖欠工资和福利。中国当局对劳工抗议采取了不同的应对方法，在一些情况下容忍局 限于工资和福利要求的罢工。同时，委员会继续看到当局使用暴力或拘留示威工人的报道。\n\n·在广泛的经济和人口变化发生之际，据报道劳工骚乱也有所增多；观察人士认为，经济和人口的变 化使工人们更敢于提出要求，也赋予他们更多向雇主讨价还价的筹码。另外，专家指出，工人运动日趋活跃反映了工人对自身权利的意识增强， 更有信心采取集体行动 来解决工作场所中引发不满的问题。\n\n· 农民工依然被边缘化，更容易在工作场所遭受剥削，他们面临拖欠工资、社会歧视、劳工和社会 福利保障欠缺等问题。由于在城市中仍然难以获得公共服务，据估计大约6100万农民工子女被父母留在农村，或由其他人照看，或独自生活。据 报道，这些孩子的辍学率较高，并且较容易遭受性虐待。\n\n· 尽管中国法律以及中国基于国际准则作出的承诺都禁止童工，在电子制造业使用未成年工人的 现象仍然很常见，有一些报道亦涉及其他行业。2013年12月，中国媒体报道说在广东省深圳市的两家电子产品工厂中发现至少九名未成年工 人。据报道，由于执法领域存在的系统性问题和缺乏资源，减少童工的努力继续受到制约。\n\n· 虽然近年来制定了一些旨在减少劳务派遣的法律改革措施，但劳务派遣仍然是一个重大问题。 2014年1月，人力资源和社会保障部发布了《劳务派遣暂行规定》，该规定应当能够限制劳务派遣的使用。与此同时，若干行业严重依赖劳务派 遣，无疑为落实上述限制带来挑战。\n\n· 尽管过去一年中工资水平继续上升，上升幅度依然未能跟上生活费用的上涨，特别是在食品和 住房方面。地区、行业和职工群体之间的收入差距逐步扩大。\n\n• 中国工人继续面临重大的职业卫生和安全风险。过去几年里，官方报告的死亡人数一直处于下降趋势；然而，不安全的工作条件 和工作场所违规现象依然常见。尽管制定了旨在防止工伤事故和建立处理违反安全规定的制度的法律措施，在实施和执法过程中仍然存在系统 性问题；另外，由于有关工作场所安全和健康的决策缺乏工人的实质性参与，致使减少工伤事故的努力继续受到制约。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 确保旨在防止进口和政府采购强迫劳动、监狱劳动或童工产品的现行法律和政策——包括《1930 年关税法 》第1307节、第13126号行政命令（禁止采购涉及强迫劳动或契约童工产品）、第13627号行政命令（通过联邦政府项目承包加强对人口拐卖 受害者的保护）——有效地应对中国的强迫劳动、监狱劳动和童工问题；考虑是否需要通过进一步立法或采取其他必要措施来 提高供应链透明度，堵塞《关税法》中的漏洞（如消费需求豁免），消除有效执行美国贸易法律的障碍，确保各方遵守关于贸易、强迫劳动和监狱劳 动产品出口到美国的现有协议。\n\n○ 鉴于中国政府未能履行根据《1992年监狱劳动谅解备忘录》和《1994年美中合作声明》所承担的义务，需要重新审查此等双边 协议，并考虑是否需要通过进一步立法或采取其他必要措施来防止从中国进口监狱劳动产品。增加美国移民及海关执法局在中国的人员和资源， 以便更有效地调查进口强迫劳动产品的案例。\n\n○ 在一些集体谈判取得成功经验的地区，与这些地区的政府官员、工人以及工会领导人展开对话；并透过赞助有关集体谈判的教育 项目和会议，来提高对这些经验的意识，让公民社会、工会领导人、工人和政府官员共同讨论这些经验。尽可能侧重于在进行集体谈判试点的、没 有有效工会组织的企业中展示集体谈判能力的项目。\n\n○ 在所有适当的双边对话中表达对有效的集体谈判和直选工会代表的支持，强调增加工人代表性有助于化解工作场所的不满情绪 ，防止自发性罢工。与政府、工会领导人和雇主对话，寻找机会提高关于成功直选工会代表的意识，为经选举产生的工会领导人提供持续培训和 支持。\n\n○ 支持美国劳工部与中国政府之间的年度劳工对话和年度劳动安全对话。支持美国劳工部和中国全国煤业理事会之间的持续合作，加强有 关产业合规、煤矿工人代表权和改善安全与卫生的技术合作交流项目并为之提供更多资金。\n\n○ 鼓励扩大美国集体谈判人员和中国非政府组织劳工权利倡导者、律师协会、学术界和官方工会之间的交流，举办会议和实施美国 政府有关机构支持的其他交流项目。侧重于强调参与者和培训教员进行面对面会谈的交流项目。\n\n○ 与中国政府商讨制定一个由多个利益相关方参加的行动计划，解决童工问题并消除其根源，包括通过制定政策和项目 提供受教育机会和减少贫困。该行动计划的参加者可包括美中两国政府、跨国公司和有关公民社会组织。\n\n○ 通过所有相关双边会谈鼓励中国政府官员发布关于童工的详细统计数字，并提供有关防止雇用16岁以下童工的措施的信息。寻 找机会支持能力建设项目，以加强捍卫工人权利的中国劳工和法律援助组织。鼓励中国地方官员建立、保持和加深与国内外劳工组织和企业之间 的关系，邀请此类组织在中国举办更多培训项目。\n\n○ 有选择地为国际劳工组织（ILO）为中国建立的技术合作项目提供资金，支持中国增加与该组织的联系及合作。请求国际劳工组 织在遵守核心劳工准则方面更多地与中国协作，此类准则包括结社自由和组织权。\n\n## 刑事司法\n\n### 调查结果\n\n· 在这一年里，中国共产党和政府在刑事司法领域的首要关切是“维稳”和确 保一党专制的制度得以持续，这一导向决定了该领域中的发展趋势。\n\n· 中国当局加强使用定义含糊的非政治罪名来压制和处罚异议、倡导人权的活动以及据信对党的 统治的挑战。例如，知名维权人士和“新公民运动”倡导者许志永于2014年1月被判处四年徒刑，罪名是“聚众扰 乱公共场所秩序”。在1989年天安门抗议活动遭到暴力镇压25周年的前夕，当局刑事拘留了公共利益律师浦志强以及其他一些维权 人士和律师，罪名是“寻衅滋事”。\n\n· 中国政府宣布废除法外的劳动教养制度（简称“劳教”），这一举措受到国内 和包括本委员会在内的国际社会的欢迎。但是，许多其他法外拘留形式依然存在（包括收容教育、强制性戒毒中心、“法制教育中心 ”、“训诫所”以及其他形式的“黑监狱”）。据报道，在劳教制度废除之后，当局更经常地使用 这些手段任意拘留公民。\n\n· 据报道，自从2013年1月1日经修订的《中华人民共和国刑事诉讼法》（简称《刑诉法》）生效以来 ，刑事辩护律师会见被拘留客户的机会增多，但“政治敏感”案件除外。虽然经修订的《刑诉法》的一些条款旨在增加证人在刑 事案件中出庭作证的机会，并且规定不能使用通过非法手段获取的证据，迄今为止情况几乎没有得到改善。如果有效实施，该法律中的一些条款 会增加刑事嫌疑人和被告的权利，但在“政治敏感”案件中，当局通常无视这些条款。例如，维吾尔学者伊力哈木‧吐赫提被单 独囚禁五个多月，没有能够见到他的律师，乌鲁木齐检察院在将他起诉之前也没有事先通知他的律师，这些做法违反了《刑诉法》。在审理张少杰 牧师和维权人士许志永的案件时，法院也拒绝了律师的请求，不允许证人出庭作证。\n\n· 在本报告年度中出现的一个令人忧虑的现象是当局通过国家电视台播放几位广受关注的嫌疑人 “认罪的口供”，其中包括记者高瑜和四川矿业大亨刘汉。此类“认罪的口供”发生于嫌疑人被警方拘留 期间，并无律师在场，剥夺了被拘留者享有公平审判和无罪推定的权利。\n\n·政府与党继续指出刑讯逼供和误判的问题，但在拘留设施中酷刑和虐待依然很普遍。例如，在 2014年春季，当局拘留了四名维权律师并对他们施以酷刑，原因是这些律师曾寻求为被非法拘留的黑龙江省法轮功修炼者提供法律服务。在 “法制教育中心”和用于拘留法轮功修炼者的其他设施中，酷刑被普遍使用。\n\n· 这一年里，当局拒绝为被拘留的活动人士曹顺利提供必要的治疗，曹顺利在获释两周后死亡，引 起对被拘留者及时获得适当治疗的问题的广泛关注。2014年，面临健康风险的其他被拘留者包括伊力哈木‧吐赫提和陈克贵。\n\n· 政府继续把使用死刑的数据视作“国家机密”，拒绝接受2013年10月普遍 定期审议中提出的要求中国发布官方死刑统计数字的建议。虽然中国被处以死刑的人数呈下降趋势，但据国际大赦组织统计，2013年中国政府 处死的人数超过世界所有其他国家的总和。政府宣称它将进一步减少可判处死刑的罪行，目前有55种罪可判处死刑。\n\n· 从被处死的囚犯身上摘取器官的做法仍然存在。2014年4月，一名卫生官员说，中国政府无法 宣布一个具体的时间表，说明何时终止从被处死的囚犯身上摘取器官用作移植的做法，因为捐献者人数太少，器官严重短缺。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 敦促中国政府就批准《公民及政治权利国际公约》（ICCPR）公开承诺一个具体的时间表，中国于1998年签署该公约，但尚未予 以批准。\n\n○ 呼吁中国政府废除所有形式的法外拘留，包括强制性戒毒中心、收容教育设施、“法制教育中心”、“训诫 所”以及其他形式的“黑监狱”，确保中国公民根据《世界人权宣言》和《公民及政治权利国际公约》所享有的公平审 判权利。\n\n○ 鼓励中国政府建立一个独立的国家人权机构（NHRI），依照《巴黎原则》保护和促进人权，这是联合国经济、社会及文化权利委员会最近 在2014年5月对中国履行《经济、社会及文化权利国际公约》的状况进行审议之后提出的建议。国家人权机构的工作重点可反映联合国人权事务 高级专员办事处制定的首要日程，例如防止任意拘留和使用酷刑。\n\n○ 敦促中国释放因从事人权和倡导活动而被以定义含糊的罪名拘留或监禁的中国公民，例如许志永以及公共利益律师浦志强和常 伯阳。支持侧重于在拘留设施中提供医疗服务的技术援助和交流项目，包括医疗准则及其制定、筹集资金的机制、提供服务的方式、投诉程序以 及追踪和监督。\n\n○ 提醒中国政府关于邀请联合国人权事务高级专员访问中国的承诺，鼓励中国立即发出邀请函。\n\n○ 敦促中国向所有联合国特别报告员及其他请求访问中国的特别程序发出邀请，包括联合国被强迫或非自愿失踪问题工作组、和 平集会和结社自由权利问题特别报告员、维权人士状况特别报告员、法官和律师独立性问题特别报告员。\n\n○ 支持有关项目和国际合作，加强刑事辩护律师通过刑事程序捍卫嫌疑人和被告权利的作用，特别是刑事案件审判中证人的关键作用及其 保护机制。\n\n○ 敦促中国就终止从被处死的囚犯身上摘取器官的做法宣布一个具体时间表。\n\n## 宗教自由\n\n### 调查结果\n\n· 在 委员会的2014报告年度，中国政府继续限制中国公民的宗教自由。中国宪法保障“宗教信仰自由”，但保护范围仅限于“正常的宗教活动”，这个概念的应用方 式违反了对宗教自由的国际人权保护，包括《世界人权宣言》第18条和《公民及政治权利国际公约》第18条》。中国政府仍然只承认五种宗教——佛教、天主 教、伊斯兰教、基督教和道教。希望信奉这些宗教的群体被要求向政府注册并受到政府的持续控制。据信违反国家规定的已注册和未注册宗教团体继续受到骚扰、拘 留、监禁和其他迫害，同时政府继续宣布一些宗教和信仰团体为非法组织，包括法轮功。\n\n· 中国政府继续使用法律、法规和政策措施来控制中国的宗教活动，而不是保护全体中国公民的宗教自由。\n\n· 当局继续确保佛教教义和活动符合政府及中国共产党的目标。\n\n· 当局继续拒绝中国的天主教徒自由接受罗马教廷委派主教的权利。当局骚扰和拘留拒绝与政府和共产党合作的天主教神职人员，包括\n\n范忠良主教、马达钦主教、田大龙神父和彭卫照神父。\n\n· 当 局发动了一场为期三年（2013–2015）的“决战”运动，旨在减少法轮功活动和“教育转化”法轮功修炼者。这场新运动由各级政府执行，当局制定了具体 的“教育转化”指标，以达到地方的目标。当局骚扰和拘留试图协助法轮功修炼者的人，包括寻求为被非法拘留于黑龙江建三江农垦总局“法制教育中心”的法轮功 修炼者提供法律服务的四名律师。\n\n· 当局继续监管伊斯兰教领袖的认可和年度出国朝觐。中国各地的地方政 府继续控制讲道内容和对伊斯兰经文的解释。新疆维吾尔自治区当局禁止维吾尔族穆斯林学生、公务员和医院雇员守斋戒月。相比之下，中国当局给予回族穆斯林较 大的宗教自由，允许他们守斋戒月，并允许越来越多的回民出国朝觐。\n\n· 政府和党继续控制和指导基督教神 学教义的解释，以便使基督教信仰符合党的目标和意识形态。对于违反政府或党的政策的已注册和未注册基督教团体，中国当局骚扰、拘留、监禁和干扰其成员的宗 教活动。过去一年里，委员会观察到政府对官方许可的教会的骚扰有上升趋势。具体而言，浙江省当局发动了一场为期三年（2013–2015）的拆除“违法建 筑”运动，这场运动以已注册和未注册基督教会为打击目标，拆除教堂和十字架。\n\n· 当局继续控制道教教义、教士任命、朝拜场所和宗教活动。\n\n· 尽管没有获得中央政府的正式承认，某些宗教团体（例如东正教会）一直能够在中国境内活动，并继续请求中国政府给予正式承认。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 呼吁中国政府按照《世界人权宣言》第18条保障全体公民享有宗教自由，撤销仅仅承认少数宗教团体和为这些团体提供有限的国家保护的框架。向中国当局强调宗教自由包括自由信奉宗教和从事宗教活动的权利，指出中国对“正常宗教活动”的有限保护不符合宗教自由的国际准则。\n\n○ 向 中国政府强调宗教自由权利包括：佛教徒在寺庙中从事宗教活动不受国家控制的权利、佛教僧侣按照佛教程序和准则挑选寺庙老师的权利、藏传佛教徒公开对藏传佛 教老师——包括达赖喇嘛——表达尊重或忠诚的权利；在涉及信仰的相关事项上，天主教徒有权利承认罗马教廷的权威，包括主教的任命；法轮功修炼者在中国境内 自由修炼法轮功的权利；穆斯林不受国家干扰从事布道活动、出国朝觐、挑选和培训宗教领袖、及守斋戒月的权利；基督教徒有自由敬拜的权利，有权利以公开或秘 密的方式表示他们的信仰（包括展示十字架），不受国家在教义及敬拜上的控制，不受骚扰、拘留和其他虐待；道教徒不受政府指导自由解释教义的权利。\n\n○ 呼吁释放因以和平方式追求其宗教信仰（包括持有信仰和从事信仰活动的权利）而被软禁、拘留或监禁的中国公民。此类囚犯包括：索郎拉措（藏传佛教尼 姑，2009年被判处10年徒刑，因她呼吁西藏独立和允许达赖喇嘛返回西藏）；马达钦（天主教上海教区的辅理主教，自从2012年7月公开宣布退出天主教 爱国协会以来一直被法外关押）；王治文（法轮功修炼者，因1999年组织法轮功修炼者和平抗议活动被判处16年徒刑）；阿不都克热木‧阿不都外力（维吾尔 宗教领袖，已经被监禁21年，目前的追加刑期到2019年期满）；张少杰（河南省南乐县一个受到官方承认的教会的牧师，因其所属教会与地方政府之间发生土 地纠纷而被判处12年徒刑）；以及本报告和委员会政治犯数据库中提及的其他囚犯。\n\n○ 呼吁中国政府实施已经接受的2013年10月联合国普 遍定期审议中提出的建议，包括：采取必要措施确保宗教自由权利以及宗教文化和言论受到充分尊重和保护；与联合国人权系统——特别是联合国特别程序和任务负 责人——合作；促成联合国高级专员和特别程序访问中国；采取步骤确保倡导人权（包括宗教权利）的律师能够自由履行其职责，迅速调查有关以暴力和恐吓妨碍其 工作的指控；考虑对立法和行政限制作出可能的修订，以更有效地保护宗教自由。\n\n○ 呼吁中国取消针对宗教和精神运动的刑事处罚和行政处罚，这些手段被用来处罚行使宗教自由权利的中国公民。特别是呼吁中国废止《中华人民共和国刑法》第 300条（该条把利用“邪教”破坏国家法律实施定为犯罪）和《中华人民共和国治安管理处罚法》第27条（该条规定对组织或煽动其他人从事“邪教”活动或 “冒用宗教”扰乱社会秩序或损害他人身体健康的人员进行拘留或罚款）。\n\n○ 鼓励美国政治领导人访问中国的宗教场所，以符合国际人权准则的做法，来提高意识和促进宗教自由。\n\n## 少数民族权利\n\n### 调查结果\n\n· 在 2014报告年度，中国当局严厉限制和镇压少数民族，特别是居住在西藏自治区（简称“西藏”）及其他藏族自治地区、新疆维吾尔自治区（简称“新疆”）和内 蒙古自治区（简称“内蒙”）的少数民族。对于寻求以和平方式弘扬其独特文化、语言和宗教特征并批评国家政策的少数民族维权人士，当局加强了控制。\n\n· 在2014报告年度，蒙古族牧民抗议国家和私人企业在他们一直用作牧场的土地上从事剥削活动，他们提出了对赔偿不足、因环境损害失去生计和非自愿迁移的关切。据报道，安全官员拘留和殴打许多牧民并阻碍抗议活动。\n\n· 2014 年5月13日，据报道蒙古当局把蒙古族维权人士达赖巴特尔·道布钦和图力古尔·诺尔布仁钦强行遣返中国。这两位维权人士被强行遣返一事显示中国政府加大了 对蒙古当局的压力，要求蒙古对中国公民在蒙古从事人权倡导活动加以限制。据报道，在被遣返时，道布钦持有有效的学生签证，诺尔布仁钦则持有联合国难民事务 高级专员办事处签发的有效避难申请人证书。\n\n· 在2014报告年度，蒙古族维权人士哈达继续被法外关 押，其15年刑期早在2010年12月10日已经届满，他的健康状况依然很差。哈达的案例凸显了国家对蒙古族和平抗议和弘扬其文化特征的压制。据哈达的妻 子新娜说，在她公开谈到她丈夫被继续法外拘留后，当局威胁要拘留她，并对她本人以及她和哈达的儿子维勒斯施加限制，包括限制其行动自由。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 继续通过美国的对外援助资金及鼓励联合国非政府组织提供更多的支持来对蒙古人、维吾尔人和藏人团体进行能力建设，以倡导在中国的人权、环境、经济发展和法治。\n\n○ 利用美中环境合作联合委员会和美中能源政策对话等途径敦促中国官员调查内蒙古自治区在采矿活动中弃置有毒废物造成的环境影响，敦促自治区官员审查牧民有关 采矿及其他开发项目的污染造成牲畜死亡和草场退化的投诉。向中国政府表述尊重和保护少数民族文化和语言的重要性。根据《中华人民共和国民族区域自治法》， 敦促中国官员为少数民族学生和家长提供选择，让他们决定在西藏、新疆和内蒙的学校使用何种教学语言。\n\n○ 敦促中国当局不要向蒙古政府施加压力，强行遣返从事维权活动的蒙古族中国公民。根据1951年联合国《关于难民地位的公约》及与之相关的1967年《议定书》（中国已经加入，蒙古正在考虑加入），国家有义务不遣返担心返回本国会受到迫害的人士。\n\n○ 呼吁中国政府释放因倡导少数民族权利而被拘留或监禁的人士，包括蒙古族维权人士哈达、曾担任医科学校校长的巴图张嘎以及本报告和委员会政治犯数据库中提及的其他囚犯。\n\n○ 敦促中国当局停止对哈达的妻子新娜和儿子维勒斯的限制，包括对其行动自由的限制和其他非法限制。《世界人权宣言》赋予“每一个人……在各国境内迁徙和居住的自由”。敦促中国当局与联合国任意拘留问题工作组主席兼报告员联系，讨论哈达被持续拘留的问题。\n\n## 计划生育\n\n### 调查结果\n\n· 2013 年11月，中国政府宣布对中国的计划生育政策作出一项小幅改动，允许夫妻一方为独生子女的家庭生育第二胎。据专家预测，这项改动的受益家庭数目有限，而且 主要集中于城市地区。另外，专家还预期，许多夫妻即使符合条件也可能不会选择生第二胎。迄今为止，中国的出生率的增长略低于预测数字。与此同时，中国和国 际专家继续呼吁废除一胎化政策。\n\n· 中国政府官员继续实施干预和控制中国公民特别是妇女生育的计划生育政策。官员们采用多种手段处罚违反政策的人，包括罚款、拒绝提供社会福利和许可证、强制绝育、强制堕胎、任意拘留等。\n\n· 《中 华人民共和国人口与计划生育法》不符合国际协议中的准则，包括1995年《北京宣言》和1994年开罗国际人口与发展会议《行动纲领》。对中国妇女及其家 庭施加的控制以及该制度带来的其他侵权问题——从强制堕胎到针对“计划外”生的儿童的歧视性政策——还违反了《儿童权利公约》和《经济、社会、文化权利国 际公约》中的准则。中国是这些条约的缔约国，并承诺拥护这些条款。\n\n·中国法律禁止官员们在实施计划生育 政策时侵犯公民权利和利益，但没有界定何为公民权利或利益。对于要求或实施强制堕胎的官员，中国法律没有规定处罚措施。中国31个省级行政区中有至少22 个制定了明确指示官员在“计划外”怀孕情况下执行堕胎的计划生育法规，该手段常常被称为“补救措施”，这种手段似乎不要求征得父母同意。\n\n· 中国政府的计划生育政策继续加剧了中国面临的人口挑战，此类挑战包括人口老龄化、工作人口减少和男女比例失调。\n\n· 一些报道凸显了地方政府滥用或不完全披露征收的计划生育罚款（称为“社会抚养费”），指出某些地方许可官员们保留一部分罚款，在有些案例中官员们把收取的罚款用于个人支出。这种经济利益可能促使官员们采用非法或强制性罚款手段。\n\n·某些地方当局拒绝给不服从当地计划生育规定的家庭签发准生证，并且拒绝给无证出生的子女上户口。在中国，没有户口的人面临很大困难，难以获得为有户口的人口提供的社会福利。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 在有证据支持的情况下尽可能在公开场合把中国的计划生育政策所加剧的性别比例失衡与可能的地区性人道主义和安全问题结合起来，如拐卖人口、犯罪、国内外移民增加以及其他严重的社会、经济和政治问题，并在双边安全对话中讨论这些问题。\n\n○ 敦促中国政府进一步放宽政策，废除对家庭的所有生育限制，代之以基于人权的方法， 为所有公民特别是妇女提供自由，使他们能按照自己的意愿，并且在隐私权受保护的前提下来筹组家庭。在与中国政府的会谈中强调儿童权利委员会的结论性意见。\n\n○ 敦促中国官员重新评估《中华人民共和国人口与计划生育法》，使之符合国际协议中的准则，包括1995年《北京宣言》和1994年开罗国际人口与发展会议《行动纲领》以及《儿童权利公约》和《经济、社会、文化权利国际公约》。\n\n○ 敦促中央和地方政府有力地执行中国法律中有关处罚在实施计划生育政策时侵犯公民权利的官员及其他人员的条款，明确界定这些权利的范围。敦促中国政府针对 实施强制堕胎和强制绝育（这些做法在中国依然持续）或其他侵权行为的官员及其他人员制定处罚措施，包括具体的刑事和经济处罚。敦促中国政府禁止在物质、晋 升和经济方面的激励机制（包括正面与负面机制），以免这些机制鼓励官员在实施计划生育政策时采用强制或非法手段。\n\n○ 鼓励中国政府保障公民在有关各种避孕办法上的合法知情权，并保障他们有权选择是否避孕及使用何种方法避孕。\n\n○ 支持国际合作，并支持法律援助和培训项目的发展，来帮助公民根据《中华人民共和国国家赔偿法》就官方在实施计划生育政策过程中的违反人权行为所造成的伤害向政府寻求赔偿和其他补偿。\n\n○ 敦促中国当局采纳联合国儿童权利委员会的建议，“改革计划生育政策，取消妨碍父母或监护人对儿童进行登记的一切形式处罚和做法”，并“摒弃户口制度，确保所有儿童、特别是外来务工人员子女的出生登记”。\n\n## 居住和迁徙自由\n\n### 调查结果\n\n· 在 很大程度上，中国政府继续执行最初于1958年建立的户口制度。该制度限制了中国公民自由决定其居住地点的权利。户口制度把中国公民划分为农村人口或城市 人口，并基于这种划分决定公民享有的法律权利和社会服务。户口制度歧视迁移至城市地区的农村人口，拒绝为他们提供与城市居民相同的公共服务和社会保障福 利。户口制度违反了保障公民自由选择居住地点和禁止基于“国籍或社会出身、出生或其他身分”进行歧视的国际人权准则。\n\n· 中 国政府在户口制度改革方面取得的进展依然不平衡。国务院和中国共产党中央委员会 于2014年3月公布了一项城镇化规划，根据该规划，到2020年拥有城市户口的人口将新增一亿人。但是，该规划并未规定向迁移至城市的所有流动人口发放 户口，而是呼吁基于城市规模放宽对城市户口的限制，即继续严格控制大城市人口，而对小城市放宽限制。\n\n· 一些地方政府提出或实施了一些放宽限制的政策，为没有户口的流动人口提供某些权利和福利。但是，其中一些改革措施附加了许多流动人口难以达到的条件，包括受教育程度、经济状况、就业要求等等。\n\n· 对于批评政府的公民，中国官员继续剥夺其国际公认的出国权利。关于异议人士被拒发护照和被剥夺出国权利的报道很多。特别是维吾尔人和藏人在申请护照方面受到严格限制。政府继续拒绝让一些发表了让政府感到有威胁性观点的人士回国，这种做法也违反了国际准则。\n\n· 中国当局继续违反一项国际公认的权利，即“合法处在一国领土内的每一个人在该领土内有权享受迁徙自由…”。在政治敏感时期，当局加强限制行动自由，例如在 2014年4月阻止维权律师莫少平与德国副总理在北京会面，在7月美中战略与经济对话期间阻止藏族作家和活动人士茨仁唯色前往美国大使馆参加她被邀请参加的一项活动。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 支持从事农民工研究和外展的项目、组织以及与中国决策者和学术机构在这方面的交流，以便促进为农民工提供的法律援助和反歧视项目，鼓励有关户口制度的政策辩论。\n\n○ 鼓励美国学术机构和公共政策机构向委员会咨询，了解如何与中国学术界和公共政策领域中参与户口制度改革及最终废除的政策性辩论的人士进行交流。\n\n○ 向中国政府官员强调，在迁徙自由方面不遵守国际协议将削弱国际社会对中国政府在总体上承诺执行国际准则的信心。\n\n○ 向 中国当局具体提到在迁徙自由方面对维权人士、倡导人士、批评者及其家人的限制，例如艺术家和诗人、身系囹圄的诺贝尔和平奖得主刘晓波的妻子刘霞；天主教会 的马达钦主教；藏族作家和活动人士茨仁唯色；并提到对出国权利和回国权利的限制，例如已经去世的人权卫士曹顺利和维权人士杨建利。\n\n## 妇女状况\n\n### 调查结果\n\n·中国法律包含旨在保护妇女权利的条款；但是，由于法律中的模糊之处和没有明确界定执法机构和私人实体的责任，以致阻碍了这些条款的实施。\n\n· 联合国经济、社会和文化权利委员会于2014年5月发布了关于中国的第二次定期报告的结论性意见，指出在中国普遍存在性别差异，“在就业、工资、住房和获得高等教育的机会方面尤其如此”，并且“农村妇女尤其是在获得教育、医疗卫生、就业和土地使用权方面处于不利地位……”\n\n· 中国各级政府中的女性比例没有达到国际标准和中国法律规定的标准，凸显了保护妇女权益方面的一个令人关切的长期问题。\n\n· 尽管中国法律禁止基于性别的歧视，这种歧视在就业和教育领域依然存在。雇主在招聘、晋升、工资和退休等方面继续歧视妇女。中国各地的高等院校在招生时实施性别限制。\n\n· 据 报道，家庭暴力影响到中国四分之一的家庭，然而中国关于家庭暴力的国家级法律条款缺乏对家庭暴力的明确定义，没有指明公共部门和私人企业在预防、处罚和 治疗方面的责任。2014年2月，最高人民法院发布了一项报告，列举了十个典型案例，旨在为下级法院审理家庭暴力案件提供指南。至2014年6月，据报道 国务院的2014年工作计划包含有关家庭暴力的立法草案。\n\n· 中国法律未能充分界定、预防和惩处针对妇女的性暴力，包括强奸、强迫卖淫和性骚扰。过去一年里，中央政府发布了若干指导文件，旨在加强预防和处罚对儿童的性侵犯。倡导人士继续呼吁当局堵塞中国法律中可能导致对12至14岁儿童的侵犯者量刑较轻的漏洞。\n\n· 地方官员在执行国家和地方计划生育政策时继续对妇女采用强迫手段和施加暴力，包括强制堕胎、强制绝育和强制避孕。超过一千名中国妇女发出一封信函，呼吁中国官员在起草和执行计划生育政策时“保障妇女的生命健康权”。\n\n· 在执行反卖淫法律时，当局继续以任意拘留、敲诈勒索、暴力、谩骂和强迫劳动等手段对待妇女。此类做法违反了中国法律。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 支持在中国增加妇女政治参与、增进妇女土地权利、提高妇女权利意识和倡导妇女权益的交流、培训和法律项目，敦促上级政府加强对村委会的监督，确保按照国家一级的法律政策充分保护妇女的权利和利益。\n\n○ 敦 促中国政府忠实地执行联合国经济、社会和文化权利委员会于2014年5月对中国审议后提出的建议，采取步骤 (a) “确保严格执行《妇女权利保障法》”；(b) “消除男女在充分取得高等教育、就业和住房的机会方面持续存在的差距”；(c) “消除持续存在的男女工资差别”；以及 (d) “消除农村妇女面临的多重歧视，尤其是在取得教育、医疗保健、就业和土地使用权方面的歧视”。\n\n○ 敦 促中国政府完成全面的国家立法，在刑法和民法中明确定义家庭暴力，配置足够的资源来处理家庭暴力，使政府和公民社会组织承担消除家庭暴力的责任，详细规定 受害者支持和保护程序，规定对施暴者的处罚措施。敦促官员们公布此项立法草案，以便公众评议。支持在司法和执法人员中提高对家庭暴力问题的意识的技术援助 项目。\n\n○ 敦促中国政府修订或制定全面的国家立法，明确定义性骚扰，就预防和惩处规定具体标准和程序。支持提高司法人员和执法人员对性骚扰问题的意识的技术援助项目。美国政府可以提供技术援助的一个领域是制定工作场所规程和举报机制，以确保信息保密，防止报复。\n\n○ 鼓励中国政府采纳联合国消除对妇女歧视委员会的建议，在培训法官、司法人员、律师和检察官时纳入性别教育内容。\n\n○ 呼吁中国政府制止在实施计划生育政策时对妇女采取强制和暴力手段，澄清中国法律中不得以此类手段侵犯妇女权利的条款。针对在执行计划生育政策时采用强制和暴力手段的情况（包括强制堕胎、强制绝育和强制避孕），敦促中国政府制定具体的处罚措施。\n\n## 人口拐卖\n\n### 调查结果\n\n· 在人口拐卖方面（包括男人、妇女和儿童），中国依然是一个来源地、中转地和目的地。大部分人口拐卖案件属于国内拐卖，其目的是性剥削、强迫劳动和强迫婚姻。由于中国政府发布的统计数字有限，关于中国的强迫劳动现象的普遍性并不明了。\n\n· 中外专家认为，中国持续的人口拐卖问题有多种政治、人口、经济和社会因素，包括性别比例严重失调、对预防拐卖缺乏意识和教育、以及在邻国存在的各种严峻条件。\n\n·中 国政府在2009年12月加入了《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》（UN TIP Protocol） ，并在此后采取了一些步骤修订立法和更新政策措施，以达到《补充议定书》的要求。一年前，国务院要求地方政府执行2013–2020全国反拐卖人口行动计 划，但迄今尚难以评估国务院是否向地方政府提供了足够的资源和培训来实施计划目标 ，或地方政府是否有能力按照计划的建议为反拐卖工作提供必要的资金。\n\n· 由 于中国法律将人口拐卖与人口走私、非法收养及儿童拐骗相混淆，关于本报告年度中政府调查和起诉的人口拐卖案件并无准确的官方统计数字。中国当局与国际组织 合作，采取步骤改进了人口拐卖受害者的保护、服务和护理，但似乎其努力继续局限于妇女和儿童。中国当局没有发布已经查明的受害者人数以及有多少人接受服务 和帮助的详细信息。\n\n· 对于人口拐卖的外国受害者，中国政府在法律上并没有就递解出境提供替代法律措施，并继续以“经济移民”的名义驱逐朝鲜难民，而不考虑他们是否是人口拐卖的受害者。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 敦促中国政府遵守其基于《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》作出的承诺；使反人口拐卖法律与 国际准则一致。特别要敦促中国政府从法律上把人口走私、非法收养和拐骗儿童与人口拐卖区别开来，并扩大人口拐卖的现有定义，以包括各种形式的拐卖，包括对 成年男性受害者的犯罪、某些形式的非暴力强迫、以及出于商业目的迫使未成年人卖淫。关于上述法律区别的讨论可纳入下一轮美中法律专家对话。另外，敦促中国 政府对人口拐卖进行认真的、系统的研究，以便按照《补充议定书》的准确定义发布数据。\n\n○ 敦促中国政府采取措施从根本上消除造成中国人口拐卖的原因。此类措施可包括通过提高对妇女价值的意识以及打击在教育和就业方面对妇女的歧视，来致力纠正中国性别比例的失调。\n\n○ 呼吁中国政府为人口拐卖受害者提供更多保护服务。支持扩大为执法人员和庇护所管理者提供的培训项目，以提高意识，改进识别、保护、协助拐卖受害者的程序。支持既帮助人口拐卖的外国受害者又帮助中国受害者的法律援助项目。\n\n○ 反对继续以“经济移民”的名义驱逐朝鲜的人口拐卖受害者。敦促中国政府履行1951年《关于难民地位的公约》和根据该公约制定的1967年关于北韩人口拐卖受害者的《议定书》所规定的国际义务，从法律上提供遣返的替代措施。\n\n## 在中国的朝鲜难民\n\n### 调查结果\n\n· 在委员会2014报告年度中，中国政府继续拘留朝鲜难民，并把他们遣返朝鲜民主主义人民共和国（简称“朝鲜”），违反了中国根据国际人权和难民法律所承担的义务。\n\n· 联合国调查委员会于2014年2月发布的一份报告谴责中国强行遣返朝鲜难民，指出这种做法“可视为帮助和纵容在[朝鲜境内]的危害人类罪行”。\n\n· 在本报告年度，中国政府似乎一直在加强防止朝鲜难民进入中国的措施，包括加强朝鲜边境的安全部署以及拘留和遣返朝鲜难民。据基督教传教士和援助组织报告，中国当局一直压制在中朝边界活动的基督教非政府组织和企业。\n\n· 中朝边界两侧的安全部署加强似乎限制了逃往中国及其他邻国的朝鲜难民人数。2013年逃至韩国的难民人数为1516人，比2012年的1509人仅略有增加，反映了自2009年以来进入韩国的难民人数大幅度减少的趋势。\n\n· 在中国的朝鲜妇女受到拐卖仍然是一个严重问题。据报道，在中国的朝鲜难民中，超过70％的人是女性，其中有很大一部分人被拐卖之后遭受强迫婚姻和性剥削。\n\n· 在中国的朝鲜妇女生育的子女继续被剥夺受教育权等基本权利和其他公共服务。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 坚持要求中国官员尊重“不驱回”原则，停止强行遣返朝鲜难民。\n\n○ 在与中国进行的所有相关双边和多边对话中——包括就朝鲜半岛去核化与中国开展的长期对话——定期讨论朝鲜难民问题。\n\n○ 与中国及其他有关国家的政府制定处理朝鲜难民问题的多边框架，该框架应同时考虑到中国对边界稳定及犯罪活动的关切和有关人权和难民保护的国际准则。\n\n○ 敦促中国官员履行《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》和《消除对妇女一切形式歧视公约》规定的义务，起诉在中国境内以及中朝边界地区活动的人口贩子。\n\n○ 敦促中国官员为与中国公民结婚或生育子女的朝鲜妇女提供合法身份，确保她们生育的所有子女享有居民身份并能够获得教育和其他公共服务。\n\n## 公共卫生\n\n### 调查结果\n\n• 在委员会2014报告年度中，对医务人员的暴力伤害是中国公共卫生领域中的一个主要问题。医学专家认为，对医务人员的暴力伤害事件增多的原因之一是解决医疗争议的机制薄弱。\n\n• 这一年是中国第一部《精神卫生法》实施的第一个年度，尽管该法律包含有关禁止条款，仍然有报道说公安人员强行把上访人员送进精神病院，使该法律的实施蒙上阴影。\n\n• 5月，联合国任意拘留问题工作组在一份关于邢世库案件的意见书中谴责了中国，并得出结论说拘留邢世库违反了《世界人权宣言》第9条和第19条。邢世库是黑龙江省的一名上访人员，被当局在精神病院中关押七年多。\n\n• 据委员会看到的报道，一些从事公共卫生外展和倡导活动的人士被拘留和剥夺个人自由。一月，公安人员刑事拘留了从事公共卫生工作的维吾尔人阿可拜尔‧伊明。 北京当局把维权人士胡佳软禁在家中近六个月，在1989年天安门抗议活动25周年过去之后才解除软禁。公安人员还搜查了河南省公共卫生和反歧视非政府组织 郑州亿人平的办公室，此事与逮捕该组织共同创始人、维权律师常伯阳有关。\n\n• 在本报告年度，中国政府发布了若干份旨在加强现有立法框架、禁止在就业和受教育方面基于健康状况进行歧视的政府工作计划。例如，2014年1月发布的一项 计划寻求为有身体和精神残障的学生提供更多接受义务教育的机会。但是，公务员和教师招聘的体检标准依然包含针对许多身体状况的歧视性条款。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 建议中国政府与医院、医疗和法律专业人员及社区团体协作，制定基于规则的机制来解决病人和医院的纠纷，包括支持维护病人权利的非政府组织注册。\n\n○ 呼 吁中国政府加强实施《精神卫生法》（MHL），停止把上访人员和其他没有精神病的人强行关入精神病院的做法（“被精神病”）。敦促中国政府建立一个独立 的、由政府内部和外部法律和医疗专家组成的小组，以追踪和报告《精神卫生法》的实施状况，特别是非自愿住院和治疗的情况。加强支持中国公民社会组织和维权 人士对《精神卫生法》实施状况的监督。\n\n○ 呼吁中国政府立即释放从事公共卫生工作的维吾尔人阿可拜尔‧伊明，他曾帮助在北京的维吾尔流动人 口治疗和预防艾滋病毒和艾滋病、减轻吸毒危害；郑州的维权律师常伯阳；上访人员邢世库；以及本报告和委员会政治犯数据库中提及的其他公共卫生倡导者和上访 人员。呼吁中国政府停止骚扰从事公共卫生维权活动的非政府组织。\n\n○ 敦促中国官员关注法规条例的有效实施，禁止在就业和教育方面基于健康状 况进行歧视，并确保残障人士享有一个无障碍的环境，包括修订国家公务员和教师体检标准，消除对有某些健康状况的人士的歧视。适当时，向中国官员介绍美国的 经验以及目前正在进行的各项努力，包括通过法律法规及非政府手段促进残障人士的受教育权利和就业权利。增加中国官员对美国的实地考察及其他交流，让他们观 察并和美国人权组织、律师以及州和联邦机构分享经验。\n\n## 环境\n\n### 调查结果\n\n• 在委员会2014报告年度，中国继续面临普遍而严重的环境挑战。污染问题影响到公民健康，据报道还导致中国较富有公民的迁徙人数增加。中国的土壤污染被认 为与国内外食品安全问题有关。总体而言，过去一年里地下水的质量恶化，中国仍然有2.8亿人使用不安全饮用水。污染工业迁移依然是一个问题，这些工厂迁移 至经济相对落后的地区，那里的环保基础比较薄弱，信息透明度比较低。中国公民以及美国和韩国官员都对中国的空气污染恶化表示担忧。\n\n• 本报告年度的一些变化表明中央政府更加重视对环境质量威胁的监管。中国当局对《环境保护法》作了颇大幅度的修改，这是自1989年以来首次修改《环境保护 法》，如果妥善实施，修改后的法律可能增进透明度和公众监督，减少有法不依和执法不力的现象。修改后的法律允许少数环境组织在有限范围内向法院提出公共利 益诉讼，但尚不清楚当局是否会允许与政府机构缺乏密切关系的社会组织享有此项权利。\n\n• 尽管在监管方面取得了进展，重大挑战依然妨碍在环境保护领域中建立法治，此类挑战包括公民难以向法院提出诉讼、威慑机制薄弱以及不遵守环境法律的现象。环 境当局在环境案件中更多地援引刑法。然而，2013年对中国公司的调查表明，许多公司在污染方面依然没有达到环境标准。在环境领域中，腐败和无视法律的情 况依然普遍存在，在有些情况下被认为导致了污染事故。污染问题和环境恶化是环境领域中大规模抗议活动的主要诱因。发生了数起大规模抗议污染的事件，包括针 对广东省茂名市一家化工厂的抗议活动，这次和平抗议后来触发了暴力事件。中国公民和人权团体呼吁对茂名抗议活动中安全人员可能过度使用暴力一事进行调查。\n\n• 在本报告期内，观察人士声称中国当局在某种程度上提高了环境透明度。2014年1月，179座城市开始向公众发布有关空气质量的实时信息。一项全国性措施 也在一月份生效，该措施要求中国大约15000家“重点监控企业”自行监测及公开包括空气、水和噪音污染信息及其他污染物排放信息。修订后的《环境保护 法》要求当局向公众提供全文环评报告。当局公开披露了一次全国性土壤污染调查的有限的一般性数据，此前，一位中国公民曾于2013年基于这次调查提出公开 信息请求，但被当局拒绝，理由是该数据属于“国家机密”。但是，对环境信息的审查继续存在，中国公民在获取环境信息方面仍然面临重大挑战。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 承认中国对《环境保护法》作出的修订，鼓励中国领导人在环境领域中加强法治。支持就增进环境法规的执行和改进遵守工具进行美中双边交流，敦促中国政府更好地响应公民对更清洁环境的要求。与中国官员以及寻求为环境污染受害者制定公平赔偿制度的其他人士接触。\n\n○ 继续在美中能源和环境十年合作框架下提供项目资金。在美中生态伙伴关系项目的重点领域中增加土壤污染和环境透明度。另外，敦促允许中国环保领域的独立性非政府组织参加美中生态伙伴关系的项目。\n\n○ 支持加强中国环保领域非政府组织技术和运作能力的项目，包括帮助非政府组织进行能力建设以充分利用机会提出有关环境的公共利益诉讼。敦促中国当局全面实施有关公众参与环境决策和项目决策的法律条款。\n\n○ 支持美中两国团体在中国提高公民的环境权利意识，促进对这些权利的保护。把环境法律和透明度问题纳入双边人权对话和法律专家对话。另外，把气候变化的人权层面问题纳入美中气候变化工作组的讨论。\n\n○ 支 持在中国继续扩大环境信息公开范围，鼓励中国领导人全面实施经过加强的法律条款，向公众提供全文环评报告。向中国官员介绍美国政府通过“有毒物质排放清单 项目”和其他旨在提高环境透明度的项目所积累的经验。继续美国政府与有关个人和组织的接触，共同努力使中国增强能力，制定战略与方法，来可靠地测量、报 告、发布、及核查碳排放量的减少。在未来美中战略与经济对话中扩大关于环境透明度以及增进温室气体数据可靠性和透明度的讨论。\n\n## 公民社会\n\n### 调查结果\n\n• 中国政府和共产党于2013年年初开始的镇压公民社会活动人士的行动在本报告年度仍在持续，这次行动违反了关于言论自由、结社自由和集会自由的国际准则。 当局把2013年因呼吁政府提高问责性和公民参与而受到拘留的一些人判刑，其中包括法律权利和新公民运动倡导者许志永，他在2014年1月被当局判处四年 徒刑。当局还骚扰和拘留了另外一些人士，原因是他们试图追踪中国履行国际人权准则规定义务的状况和纪念被暴力镇压的1989年天安门抗议活动25周年。\n\n• 过去一年里，委员会还观察到对非政府组织的骚扰增加，特别是对从事公共卫生和反歧视倡导活动的非政府组织。\n\n• 在本报告年度中，中国就其履行数项国际人权义务的状况向联合国提交了报告，但在编写报告的过程中，政府和党没有与独立的公民社会倡导者及组织联系，也没有 向他们咨询，多个联合国委员会和中国及国际人权组织都提到这个问题。一些组织声称，中国的报告中作为咨询团体列举的大约16至22个非政府组织和隶属于政 府的组织中大部分是政府或党建立的组织。中国政府还拒绝回答联合国及国际人权组织关于维权人士曹顺利被拘留、健康恶化并于2014年3月死亡的询问。\n\n• 中央政府和共产党的文件——例如《中共中央关于全面深化改革若干重大问题的决定》》——包含支持非政府“社会力量”参与社会服务的内容。此项政策支持重申 了2013年3月机构改革方案的一些要点，即把提供公众服务的某些政府职能转移给非政府“社会组织”。“社会组织”是政府对非政府实体的称呼。\n\n• 中国政府和共产党曾宣布要在2013年年底发布对有关“社会组织”的三项重要全国性法规的修正条款，但没有按时完成此项工作，不过至少有26个省、市颁布 了临时规定。这些地方性规定促进有限范围内的“社会组织”直接注册，但对宗教、政治和法律组织及其他一些组织保持了“双重管理”。“双重管理”要求社会组 织必须受挂靠单位的监督，削弱了此类组织的组织自主权。\n\n•在中国，政府从非政府部门购买服务仍然处于发展初期，监管框架尚未完全建立。\n\n• 在本报告年度中，北京市和深圳市发布了有关慈善机构管理的规章草案或临时规章，但是全国性慈善立法依然没有明确的时间表。在制定慈善监管框架方面有两个领域存在争议，即何种类别的慈善机构可以公开募款以及政府将在何种程度上控制慈善捐款。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 呼 吁释放许志永以及其他因政治原因被判处监禁的公民社会和人权倡导者。呼吁中国政府停止骚扰倡导保护人权和公共利益或行使其公众决策参与权利的公民社会组织 及个人。大力敦促中国政府建立一个包括中国维权律师在内的独立调查小组，审查曹顺利在2014年3月死亡之前的几个月里在拘押中受到的待遇。\n\n○ 敦促中国遵守国际人权公约关于公民社会组织的作用和参加国家报告、政策制定、追踪国家人权义务实施等方面的内容。\n\n○ 鼓励中国政府修改关于中国社会组织的监管框架，允许所有非政府组织受益于根据《公民及政治权利国际公约》第21条和第22条保障的结社自由和集会权利制定的改革措施。\n\n○ 为美国非政府组织提供更多支持，开发帮助中国独立的草根非政府组织进行能力建设的项目，倡导所有组织享有同等法律和运作权利，包括注册和以公开透明的方式竞争政府购买项目。\n\n## 民主治理机制\n\n### 调查结果\n\n• 中国的政治体制不符合《公民及政治权利国际公约》第25条或《世界人权宣言》所陈述的准则。在2013年10月联合国人权理事会对中国政府的人权记录进行 普遍定期审议过程中，中国拒绝接受关于“批准” 《公民及政治权利国际公约》或为此“制定明确的时间表”的众多建议。但是，中国接受了关于“为批准《公民及政治权利国际公约》采取步骤”的建议。\n\n• 中国中央领导人承诺要把权力关进制度的笼子里，可是却没有表示他们要推行政治改革以使中国符合《公民及政治权利国际公约》和《世界人权宣言》的要求。共产 党中央领导人于2013年11月发布一份重要政策性文件，该文件仅仅概括地谈到改进中国现有的“社会主义民主政治制度”和“强化权力运行制约和监督体 系”。文件强调党继续领导一切以及“加强和改善党对全面深化改革的领导”的目标。\n\n• 共产党继续主导政治事务，党的领导深入到社会各阶层。为了重新促进党的集中领导，最高层领导人建立了新的领导机构，这些机构全部由共产党总书记和国家主席 习近平领导。党中央官员寻求加强党的内部纪律和通过一场“群众路线”运动实施意识形态控制，在运动中对官员进行政治灌输并举行自我批评会议，另外还通过一 场全社会范围的运动促进培育和践行“社会主义核心价值观”。\n\n•对于一些行使言论、集会、结社和示威自由的人士，当局继续骚扰、拘留并将他们 判处徒刑，包括在1989年天安门抗议活动及其后的镇压25周年之前的两个月中被抓的一百多人。被涉及其中的人士有浦志强、徐光、常伯阳、赵华旭以及一批 倡导民主和捍卫人权的人士，例如刘本琦、秦永敏和孙峰。还有一些人被继续监禁，包括朱虞夫（7年）、曹海波（8年）、陈西（10年）和刘贤斌（10年）。 人权捍卫者曹顺利的死亡引发了对拘留设施生存条件的关切，人们认为她的死亡与在被关押期间中国当局拒绝提供及时、适当的治疗有关。曹顺利曾经敦促中国领导 人在编写中国向联合国提交的国家报告时允许公众参与并提出独立看法。\n\n• 人民代表大会和村委会选举继续因政府干预、贿选和不正当程序而受到不良影响，例如2014年春季广东省乌坎村的选举。虽然乌坎村2012年的选举被当作民主典范，2014年的选举却因候选人被拘留以及其他问题而蒙上阴影，显示了民主治理方面出现倒退。\n\n• 当局监禁了一批倡导反腐败和透明度的人士，其中一些人表示自己与新公民运动有关，包括袁冬（一年零六个月）、张宝成（两年）、丁家喜（三年零六个月）、赵 常青（两年零六个月）、李蔚（两年）、刘萍（六年零六个月）、魏忠平（六年零六个月）和李思华（三年）。当局还继续关押其他几位候审人士，包括黄文勋、袁 小华、袁奉初、杨茂东和刘家财。\n\n• 随着公众对腐败问题日益关切，当局在拘留和调查涉嫌腐败的官员方面加大了力度，因此被抓的官员包括前中共中央政法委员会书记周永康。虽然官方报告说反腐败 运动取得了成效，但据报道有人指控说数名因涉嫌腐败而受到拘留的下层官员遭受酷刑。一些观察人士声称，中共中央当局——包括党的总书记习近平——是在利用 反腐败重新实行中央集权、清除政治对手、把自己人安插到掌握重要权力的职位上。\n\n• 一些中国官员和政府机构寻求向公众更加公开，但依然缺乏透明度。财政部指示所有接受政府拨款的机构公布其预算。中央政府当局敦促若干具体领域的官员们提高透明度并同时保护机密。据报道，中国公民提出的公开政府信息的申请有所增加，但在获取信息方面依然存在大量问题。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 支持美国的学术和情报研究项目，以了解中国共产党的结构、功能和发展，包括其意识形态运动以及党在企业、政府机构、立法和司法部门及非政府机构中的作用。敦促中国官员进一步提高党务透明度。\n\n○ 呼 吁中国政府释放因行使言论、结社和集会自由权利、进行和平示威、呼吁官员公开个人资产、呼吁在中国进行政治改革而被拘留或监禁的人士，包括寻求纪念 1989年天安门抗议活动25周年的人士、与新公民运动有关的人士、以及本报告和委员会政治犯数据库中提及的其他良心犯。\n\n○ 支持美中合作项目，针对村委会选举和地方人大选举建立独立的追踪系统，鼓励中央和地方的党和政府领导人在全中国举行自由、公平的选举。继续支持根据中国国情设计的促进民主项目。支持旨在扩大公众参与政治和政策决定的美国学术项目及其他美中合作项目。\n\n○ 支持在中国寻求增进政府透明度的组织团体，特别是旨在扩大和改进政府信息公开机制的项目。此类项目可包括在地方上更好地宣传《政府信息公开条例》和培训公民和团体提出政府信息公开申请的努力。鼓励党和政府官员确保法规、规章和政策向公众公开。\n\n## 商业领域的法治\n\n### 调查结果\n\n• 中国于2001年12月11日加入世界贸易组织（WTO）。但是，中国政府继续推行国家资本主义。中国政府的干预性政策——包括对国有企业的补贴和优惠待 遇——不符合中国对世贸组织的承诺。在2014年上半年，世贸组织专家小组作出了两项重大裁决，就有关稀土的争议裁定中国的出口配额不符合世贸组织规则， 另就有关汽车补贴的争议裁定中国对美国汽车征收的关税违反了中国承诺的世贸组织义务。本报告年度发布的《中国共产党十八届三中全会决议》强调市场在资源配 置中起决定性作用，但承认国有企业将继续在中国经济中发挥主要作用。\n\n• 在披露补贴和就法律法规草案提供监管透明度方面，中国依然未能履行对世贸组织的承诺。中国公司的企业报告信息也很有限，而且中国政府严格控制新闻媒体对政 府官员及其家人的财富的报道。在2014报告年度，美国监管部门、私人企业和投资者在获取有关中国公司的信息时遇到困难，包括美国证券交易委员会在对总部 设在中国的公司进行欺诈调查时也难以获得信息。中国依然屏蔽许多美国高科技公司和媒体公司的网站，包括脸书 (Facebook)、推特 (Twitter)、YouTube、Dropbox、纽约时报和彭博新闻社。\n\n• 据报道，在2014报告年度，从中国境内发动的对美国知识产权的重大盗窃活动一直在持续。美国司法部起诉了中国军队中的五名黑客，据称他们他们侵入的网站 有西屋电气、太阳能世界公司的美国分公司、美国钢铁公司、阿勒格尼技术公司、美国联合钢铁工人工会和美国铝业公司。此前，其中有一些公司和美国联合钢铁工 人工会曾经对中国的贸易政策提出质疑，令人担心上述黑客攻击可能是出于报复。过去一年里，中国政府采取了若干改进知识产权（IPR）保护的步骤，包括在经 修订的《中华人民共和国商标法》中规定了较高的法定赔偿，并开始起草《中华人民共和国反不正当竞争法》的修订条款。然而，美国公司在中国仍然难以有效保护 知识产权。在本报告年度，美国司法部对两个涉及中国国民盗窃农业商业秘密的重大案件提出起诉。\n\n• 中国对外投资继续大幅增加，目前中国对美国的外商直接投资（FDI）超过了美国对中国的外商直接投资。在2014报告年度，中国对美国投资的主要领域是农 业、信息技术、医疗保健和房地产。在2014年上半年，美国外国投资委员会（CFIUS）审查了与联想集团计划收购IBM一个服务器部门有关的潜在安全问 题，因为美国政府的情报和国防部门使用IBM服务器。\n\n• 中国当局增加了反垄断审查，包括对可能违规使用市场优势地位的情况进行审查。2014年6月，出于反垄断法方面的考虑，商务部拒绝批准丹麦穆勒马士基集 团、法国达飞海运集团公司和地中海航运公司的联盟计划。此前，该联盟计划曾经获得美国联邦海事委员会和欧洲联盟委员会的批准。这是自2009年可口可乐公 司收购中国饮料公司汇源受阻以来被直接拒绝批准的第一项合并交易。在本报告年度，中国当局在许多行业展开调查，受调查的美国公司包括高通和微软。2014 年9月，美中贸易全国委员会报告说，回应其问卷调查的公司中有86％的公司对中国的反垄断执法行动在某种程度上感到关切，其具体担忧包括选择性和主观性执 法、缺乏监管透明度、使用行政恐吓手段。据美国商会2014年9月发布的一份报告，中国的执法行动可能违反了它对世贸组织的承诺。\n\n• 中国政府的干预继续导致人民币币值被严重低估。据报道，过去一年里人民币一反升值趋势，在2014年2月下跌1.5％，创下自2005年以来的双周最大跌幅，至2014年4月全年跌幅达2.68%。\n\n• 中国的食品安全问题继续存在，在中国经营的美国公司和美国消费者对此也感到关切。2014年6月，全国人民代表大会发布了《中华人民共和国食品安全法》修 订草案供公众评议，该草案加强了预防性监管、改进了监督、规定了更严厉的处罚措施。在2014年7月，美国食品药品监督管理局针对从中国进口的食品和药品 发布的、截至当时依然有效的警示超过任何其他国家。美国政府计划增加派驻中国的检查人员，但在为他们申请签证时遇到困难。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 确保中国在终止外汇管制、国有企业补贴及本报告提到的违反中国现有国际商贸义务的其他政策方面采取具体改进措施，并以此作为美中贸易谈判取得进展的先决条件，确保透明度和美国社会各界充分参与此类谈判。\n\n○ 指 示美国贸易代表办公室（USTR）建立一个中国在入世协议中作出的所有承诺的公开数据库。美国贸易代表关于中国履行世贸组织义务的报告应当指明任何合规方 面的问题及受到影响的具体承诺，并说明美国贸易代表是否采取了行动。美国贸易代表办公室还应当建立一个中国通过美中商贸联合委员会（JCCT）和美中战略 与经济对话（S&ED）及其前身作出的所有承诺的公开数据库。在商务部和财政部协助下，美国贸易代表应当使用以上两个数据库更加全面地报告中国履 行其承诺的状况。\n\n○ 建立和支持一个项目，调查中国对互联网的限制及其对美国企业的影响。美国贸易代表办公室应当考虑在其有关中国履行世贸组织承诺的年度报告及其有关外国贸易 壁垒的报告中增加与互联网审查相关的内容。另外，还应当通过世贸组织提出一项正式请求，要求提供有关中国对互联网实施限制的详细信息，必要时可考虑向世贸 组织提出争议。在与中国政府官员会谈时，敦促中国政府停止在中国屏蔽美国媒体和高科技公司，包括纽约时报、彭博新闻社、谷歌 (Google)、脸书 (Facebook) 和Dropbox。\n\n○ 与中国政府协作，制止源于中国的互联网盗窃行为。另外，还应当采取措施在中国加强对商业机密 的保护，包括修订中国有关商业机密的法律。美国政府应当向在中国提出重大知识产权诉讼的美国公司提供进一步支持，包括在美中战略与经济对话和美中商贸联合 委员会会谈中与中国领导人讨论诉讼问题。美国政府可以考虑采取的一项措施是向美国超导公司（AMSC）提供进一步支持，该公司目前正在通过一起商业诉讼要 求华锐风电科技（集团）股份有限公司作出超过十亿美元的损失赔偿。美国司法部应当考虑每年报告涉及跟中国公司和中国国民有关的知识产权案件。\n\n○ 敦促中国政府在公司信息方面提高透明度，并停止滥用有关国家机密的法律。美国证券交易委员会在与中国证监会的双边对话中应当把要求在美国证券交易所上市 的中国公司提交文件作为一个讨论要点。中国政府应当鼓励提高透明度，对国家机密提供一个明确而有限的定义，该定义应当符合国际法，并明确界定许可的尽职调 查活动。\n\n○ 与中国官员会谈并在世贸组织中采取进一步行动，确保中国全面执行世贸组织裁定其败诉的争议决定，取消对中国国有企业的补贴，履 行它在世贸组织《补贴与反补贴措施协议》中作出的透明度承诺。应当要求中国及时发出内容完整的通知，说明在国家一级和省一级向国有企业提供的、对美国投资 具有歧视性的补贴。\n\n○ 确保美国政府派遣的食品与药品安全检查官员能够获得签证并在不事先发出通知的情况下对向美国出口的中国设施进行检 查。基于美国的最佳规范加强为中国食品与药品监管人员提供的能力建设项目。为在中国从事食品安全工作的非政府组织提供支持，鼓励中国政府采取提高食品安全 透明度和加强监督的措施。\n\n## 获得司法公正的途径\n\n### 调查结果\n\n• 2014年6月，中国政府宣布在六个省市进行某些司法改革试点，以限制地方政府对法院工作的干预。改革措施包括解除地方政府对当地法院的拨款权和人事任免 权，而把这些权利收回到省一级。但是，在该消息宣布后不久，国家经营的环球时报发表社论说，在新的改革措施中增进“司法公正”的目标并不意味着中国走向 “司法独立”或“三权分立”，此番表态明确无误地显示了这一轮司法改革的局限性。\n\n• 遵照2013年11月发布的《中国共产党十八届三中全会决议》，最高人民法院（SPC）采取了提高司法透明度和问责性的步骤。根据最高人民法院颁布的措 施，从2014年1月1日起，中国的所有法院必须在中国裁判文书网公开其有效书面裁判，以便公众查阅（此项要求包含某些例外情况，如涉及国家机密和个人隐 私的裁决）。在2014年7月发布的最高人民法院第四个五年改革计划中，增加司法开放性被列为八个重要领域之一。\n\n• 共产党和中央政府颁布了数份对信访制度进行改革的文件，这是《三中全会决议》列举的改革领域之一。信访是在正式法律体制之外供民众向当局申诉冤屈的一种广 为使用的机制，可以通过信函或面谈方式投诉。信访制度改革的目标包括但不限于：通过推行网上上访和书面上访减少面谈上访的人数、确保所有涉及法律和诉讼的 案件交由法院通过法律渠道处理。改革措施禁止地方官员非法拘留上访人员和直接接受上访人员的越级投诉。\n\n• 在2013年12月下旬，有史以来第一份《中华人民共和国行政诉讼法》（简称《行诉法》）修订草案提交全国人民代表大会常务委员会审议。修订条款旨在解决 《行诉法》的主要问题，这些问题被广泛称为“三难”：行政诉讼立案难、《行诉法》案件审理难和《行诉法》裁决执行难。目前尚无法确知《行诉法》修订条款能 否促使民众更多依赖法律诉讼而不是信访制度——而这正是修订该法律的目的所在。\n\n• 过去一年里，当局更加严重地骚扰和迫害维权律师和维权人士，特别是在1989年天安门抗议活动遭到暴力镇压25周年的前夕。涉及维权律师的事件包括在河南 省官方以暴力对待为被拘留的基督教牧师张少杰倡导权益的律师、在黑龙江省，官方拘留了唐吉田、江天勇、王成、张俊杰四位维权律师并对他们动用酷刑。在 2014年5月和6月，官员们出于政治原因刑事拘留了一批知名维权律师，包括北京市的浦志强、河南省的常伯阳和姬来松、以及广州的三位维权律师：唐荆陵、 王清营和袁新亭。\n\n• 2014年8月初，维权律师高智晟被从监狱中释放。此后不久，有报道说他在被关押于新疆维吾尔自治区沙雅监狱的两年半时间里受到当局虐待。由于所受的虐待，高智晟的体重减轻50磅，患有严重牙病，语言能力衰退。\n\n• 尽管受到更严厉的压制，中国维权律师仍然采取步骤保护其自身权益。例如，他们成立了中国人权律师团，为因行使其公民权利而被拘留的人士提供法律服务和咨询。另外，2014年6月，40多位维权律师签署了一份保证书，自愿协助受当局迫害的其他律师及家人。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员：\n\n○ 呼吁释放被拘留的维权律师，包括浦志强、常伯阳、唐荆陵、袁新亭和个人自由受到非法限制的其他律师。\n\n○ 呼吁中国政府允许维权律师高智晟前来美国治疗并与现在住在美国的妻子和两个孩子团聚。高智晟在中国期间，中国政府应当确保他在国内享有行动自由。\n\n○ 敦促中国政府保护中国维权律师的基本公民权利和职业权利，调查关于虐待他们的所有指控，确保肇事者受到法律惩罚。\n\n○ 支持美国非政府组织和中国维权律师及非营利法律团体实施的项目，以增进获得司法公正的途径，保障律师不受政府干涉代表被告的权利。通过美国国务院国际访问者领导项目及类似项目提供更大支持，帮助中国维权律师、维权人士和学者前来美国从事学习研究和能力建设。\n\n○ 更多支持美国法学院和其他组织与中国同行合作开展的项目，帮助他们推进中国目前正在进行的司法改革和行政法改革。\n\n○ 考虑在未来的双边法律专家对话日程中增加有关律师行业监管和律师行为准则的内容。\n\n## 新疆\n\n### 调查结果\n\n• 在委员会的2014报告年度，新疆维吾尔自治区（简称“新疆”）以及某些其他地区发生了涉及维吾尔人的暴力冲突，总共造成三百多人死亡。\n\n• 习近平主席及其他高层官员在强调反恐怖主义安全措施的同时也压制了和平宗教活动，并且没有就人们认为反恐措施必须也要保护公民权利的关切采取措施。\n\n• 中国海外维权人士和分析家感到关切的是，当局实施过于宽泛的安全和镇压措施，限制和平宗教活动，限制维吾尔文化特征的表达，导致新疆的局势更加紧张；同时 中国官员未能把暴力或恐怖主义与以和平方式表达不同意见区分开来。官员们和官方媒体承认经济和社会不平等加剧了地区性动荡，但在强调经济发展项目时，没有 对维吾尔人关于其语言、文化和宗教受到威胁的担忧采取措施。\n\n• 海外维权人士和分析家的另一点关切是，当局对维吾尔族抗议者过度使用暴力，包括在五年来新疆发生的死亡人数最多的一场暴力事件中，这次事件于2014年7 月28日发生于喀什地区，官员们把该事件定性为恐怖袭击，并且说有近一百人死亡，但维权人士不同意官方对该暴力事件的描述。\n\n• 国内外观察人士对中国政府在处理新疆的暴力事件时缺乏透明度（包括对记者和社交媒体讨论的限制）感到关切。\n\n• 维吾尔人在互联网上发表意见的空间依然有限。一个维吾尔人权组织于2014年6月发布的一项报告说，2009年7月，自治区首府乌鲁木齐发生示威和暴乱， 当局关闭了一批广受欢迎的由维族人经营的网站，拘留了一百多名维吾尔网站管理人员，在此后的数年里，政府对维吾尔人发布的互联网内容的审查以及维吾尔人的 自我审查明显增加。据这份报告引用的研究结果，至少有一个中国社交媒体的管理人员对新疆用户网帖的审查比例大大超过对北京市用户的审查。\n\n• 过去一年出版的研究表明，有更多维吾尔人被以“危害国家安全罪”起诉，当局有时宽泛地使用此类罪名，把以和平方式从事维权活动、自由表达民族特征和独立的 宗教活动也纳入其中。以此类罪名被起诉的人士包括维吾尔族大学教授伊力哈木‧吐赫提，据报道他以和平方式批评政府在新疆的政策并寻求推动维吾尔人和占中国 人口大多数的汉人之间的对话。2014年2月，他与穆塔力浦·伊明、栢尔哈提·哈力木拉提、肖合来提、阿布杜凯尤木·阿卜力米提等四位年轻的维吾尔人一起 被捕，这四位年轻人曾参与协助吐赫提创办的网站“维吾尔在线”。2014年9月，吐赫提被审定犯有“分裂国家”罪，并被判处无期徒刑。\n\n• 2014年6月，吐赫提告诉他的律师拘留所当局虐待他，包括连续十天不给他食物，让他戴脚镣近三个星期。吐赫提的律师之一李方平报告说检方未能提供完整的证据供吐赫提的辩护律师们审阅。另一位律师王宇所在的事务所在受到北京官员们的压力之后把她从该案件中召回。\n\n• 吐赫提的妻子古再努尔在2014年5月告诉自由亚洲电台，自从2014年1月吐赫提被拘留后，安全人员对她和他们的两个儿子在北京家中“严加监视”，不过最近监视减少。古再努尔还说，由于父亲被拘留造成的心理压力，他们的大儿子心脏出现问题。\n\n• 据报道，当局于2013年8月拘留了阿不都外力·阿尤普、地力亚尔·欧布力和穆罕默德·斯迪克，此前他们曾在喀什市开办了一所用维吾尔语教学的幼儿园，并 试图在乌鲁木齐市开办一所用维吾尔语授课的学校。据报道，乌鲁木齐市天山区人民法院于2014年7月11日审理了阿尤普、欧布力和斯迪克的案件，并于8月 21日把他们分别判处一年零六个月至两年零三个月的刑期，其罪名是“非法集资”。\n\n• 在本报告年度，自治区当局监视、控制和处罚了以和平方式从事伊斯兰教活动的维吾尔人。某些地方的公务员被要求签署保证书，保证其家人不参加“非法宗教活动”，对违反者的处罚手段之一是限制其子女进入高等院校学习。\n\n• 自治区官员们重申了经济和政治发展战略，此等战略侧重于实现国家经济和政治目标，而不是尊重新疆居民的权利，包括《中华人民共和国民族区域自治法》中描述的权利。\n\n• 正如在以往的报告年度中一样，委员会继续观察到有些招聘公告指明只聘用汉人，在公务员和私人企业招聘中都有这种情况，违反了中国的劳工法律和反歧视法律。私人业主和公共部门的雇主还继续为男性保留更多工作机会，使得非汉族妇女在就业方面面临民族和性别双重歧视。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员\n\n○ 支持提高人们对新疆维吾尔自治区人权状况意识的努力以及保护维吾尔族文化的项目，增加维吾尔人保护自己的人权的途径，更经常地对新疆进行以人权问题为核心内容的访问。\n\n○ 呼吁中国政府在报告暴力和恐怖主义事件或对涉及暴力、分裂国家和恐怖主义的案件进行刑事起诉时提高透明度，包括提供每年审理完毕的“危害国家安全罪”案件的确切数字，如同2008年至2012年之间所做的那样。\n\n○ 呼吁中国政府给予国内外记者和观察人士更多自由，使他们能够独立核实官方媒体对暴力和恐怖事件的报道。\n\n○ 呼吁释放因行使其言论自由权利而被拘留或监禁的伊力哈木‧吐赫提、穆塔力浦•伊明、栢尔哈提•哈力木拉提、肖合来提、阿布杜凯尤木•阿卜力米提及其他维族人。\n\n○ 反对拘留和逮捕维吾尔族教育工作者和语言权利倡导者并将他们定罪，此类人士包括阿不都外力•阿尤普、地力亚尔•欧布力和穆罕默德•斯迪克。\n\n○ 呼 吁中国政府就有关新疆学校（从幼儿园直至大学）使用教学语言的问题咨询非汉族家长、教师和学生。呼吁中国官员按照中国宪法第4条和《中华人民共和国民族区 域自治法》第10条要求允许家长和学生选择用维吾尔语和新疆通行的汉语之外的其他语言授课。敦促中国官员支持开发维吾尔语和其他非汉语教学材料。\n\n○ 呼吁中国政府遵守其保证宗教信仰自由的国内法律法规以及保证宗教活动免受国家限制的国际准则。\n\n○ 鼓 励美国公司到新疆从事业务活动或对开发项目投资，促进少数民族的平等就业机会，支持就经济、政治和社会影响向少数民族咨询的开发项目。鼓励美国公司对新疆 的商务机会投资，积极主动地招聘少数民族员工，实施消除就业和工作场所歧视的机制，敦促中方业务伙伴为少数民族提供平等就业机会。\n\n## 西藏\n\n### 调查结果\n\n• 自从2010年1月第九轮对话以来，达赖喇嘛的代表与中国共产党和政府官员之间的正式对话已经停止，这是自从2002年恢复对话以来最长的一次中断。在2014报告年度，委员会没有看到任何迹象表明中方有意恢复对话以探讨藏人对中国藏族自治地区的关切。\n\n• 在委员会的2014报告年度，在共产党和政府采取更多安全措施和处罚措施之后，据报道出于政治和宗教原因的藏人自焚事件大幅度减少。根据委员会的观察，共 产党和政府领导人没有表现出任何迹象以建设性方式来化解藏人的不满情绪或对藏人拒绝接受中国的政策承担任何责任。2013年4月（直至2014年2月才曝 光），四川省的一个县发布了集体处罚规定，以吓阻藏人自焚。\n\n• 要求藏传佛教徒接受共产党和政府对宗教的控制的压力依然很大。共产党的领导人继续把达赖喇嘛描述为对藏传佛教“正常秩序”的威胁，而不是把他视为一位藏民 的主要导师，并敦促把他与该宗教以及“达赖喇嘛”的头衔“分离开来”。据官方媒体报道，截止于2012年3月，共有六万名党的干部（是最初报道的 21000名干部的近三倍）被派往西藏自治区（简称“西藏”）的各个村庄、寺院和尼姑庵。官员们拘留和监禁寺院领导者，甚至把一些人殴打致死，干涉寻找转 世灵童的活动，并禁止出于宗教目的前往冈仁波齐峰。\n\n• 过去一年里，据委员会观察，没有任何迹象表明共产党和政府领导人有意营造一个允许藏人选择其文化和语言的“和谐社会”。政府声称学习和使用藏语“受法律保 护”，但官员们关闭了非政府举办的项目并拘留了推动使用藏语的藏人。对于因藏人的不满情绪而引发的抗议活动，共产党没有承担任何责任，而是归咎于外部势 力，特别是达赖喇嘛。在2013年9月至11月，在西藏的一个县发生的事件凸显了镇压的力度：截止于2014年9月1日，委员会的政治犯数据库记录了58 起拘留案件，其中15起有人被判刑，最高刑期达18年。\n\n• 共产党和政府继续把经济发展作为实现“社会稳定”的主要手段和先决条件。 据报道，当局拘留或监禁了一些藏人，原因是他们针对采矿活动、因采矿而没收或强行拍卖土地或实施据报道对环境具有破坏性的开发项目进行抗议。另据报道，从 拉萨市向西通往日喀则市的铁路于2014年8月“投入使用”，这是自2006年青藏铁路的西宁－拉萨段开通以来竣工的第一个延伸路段。2009年以后，西藏自治区年鉴不再报告县级人口数据，因此无法进行人口分析。\n\n• 在2014年9月1日，委员会的政治犯数据库包含639名据信目前被拘留或监禁的藏族政治犯，其中621人是在2008年3月10日之后被拘留或监禁；44％的人是藏传佛教僧侣、尼姑、老师或祖古。 过去一年里，被官员们拘留、监禁或殴打致死的寺院领导者包括久美楚臣堪布、噶玛次旺堪布、塔堆坚赞经师、阿旺江白格西和克珠堪布。官员们还拘留和监禁了一 批文化维权人士，包括作家楚臣坚赞、歌唱家格被、环保人士曲加和次拉。2014年6月，官员们释放了刑期届满的电影制片人顿珠旺钦；直至9月1日，当局尚 未准许他前来美国与家人团聚。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员\n\n○ 敦 促中国政府与达赖喇嘛或其代表恢复接触，无先决条件地进行对话。对话的目的应当包括在西藏自治区（TAR）和青海、甘肃、四川、云南的多个藏族自治州、县 保护藏族文化、语言、宗教和传统。中国政府如决定开展对话，可能导致对中国政府和藏人双方均有益的长期 结果，并将在今后几十年中增进地方和地区安全。\n\n○ 敦 促中国政府承认政府监管措施和党的政策在藏人自焚浪潮及其他抗议活动中的作用。向中国官员强调指出，强化使藏人感到不满 的措施和政策不大可能促进“社会稳定”或“和谐社会”。敦促中国政府避免使用安全和司法机制恐吓藏民社区，例如起诉和监禁据称与自焚者有关联或传播自焚消 息的藏人。\n\n○ 敦促中国政府避免使用干涉性管理方法和法律措施，停止侵犯和压制藏传佛教徒的宗教自由权利。敦促政府停止把达赖喇嘛视为安全 威胁，而应把他视为藏传佛教的主要导师。敦促政府尊重藏传佛教徒依照藏传佛教的选择和传统寻找和教育宗教老师的权利。向中国官员强调指出，通过强力推行监 管措施、“爱国”和“法制”教育以及反对达赖喇嘛的运动对藏传佛教徒施加更大的压力可能只会危害社会稳定，而不利于保持社会稳定。\n\n○ 西藏 自治区政府主席2010年声称，达赖喇嘛1995年确认的班禅喇嘛更登确吉尼玛（Gedun Choekyi Nyima）当时正在与自己的家人在西藏自治区作为“普通公民”生活，请中国政府就此提供进一步信息。敦促中国政府邀请一个国际组织的代表与更登确吉尼玛 会面，以便更登确吉尼玛能向该国际组织代表表达自己有关隐私权的愿望。\n\n○ 向中国政府表达尊重和保护西藏文化和语言的重要性。敦促中国官员 尊重中国宪法中的言论、结社、集会和宗教自由条款，不要利用安全部门、法院和法律侵犯和压制藏人的此类权利，从而增强藏族文化的活力。强调有必要尊重藏人 的愿望，允许在讲授现代学科时保持藏语和汉语两种语言的作用，而不要把藏人对自己的语言和文化的热爱视为犯罪。\n\n○ 鼓励中国政府在规划中国藏族地区的基础设施、自然资源开发以及定居或迁居项目时充分考虑藏人的观点和意愿。鼓励中国政府聘请相关专家参与评估此类项目的影响，并就此类项目的实施和进展状况向中国政府提出建议。鼓励政府就中国藏族地区的人口状况发布准确且全面的数据。\n\n○ 继续向中国政府强调把和平的藏人抗议者和骚乱者区别开来的重要性；谴责利用治安运动压制人权的行为；请求中国政府提供以涉及抗议和自焚的“罪名”被拘留、指控或判刑的藏人的详细信息。在与中国官员会谈和通信时，继续提出以和平方式行使人权而遭受监禁的藏人的案例。\n\n○ 鼓 励中国政府尊重在国内旅行的藏人的行动自由，包括访问拉萨和其他藏族经济、文化、宗教中心；为藏人申请并获得合法出国旅行的必要文件提供合理途径；尊重中 国藏族公民在出国旅行后返回中国的权利；允许外国记者、非政府组织代表、联合国代表和美国政府官员访问中国的藏族自治地区。\n\n## 香港和澳门的发展\n\n### 调查结果\n\n• 香港和澳门的《基本法》确认，《公民及政治权利国际公约》（ICCPR）适用于这两个地区。香港《基本法》明确规定了普选权，但澳门《基本法》对此未作规定。\n\n• 2014年8月31日，全国人民代表大会常务委员会（简称“人大常委会”）发布了有关香港选举改革的决定，对候选人自由竞选香港特区行政长官（简称“特 首”）的能力作出限制。倡导民主的人士批评该决定未能确保“真正的”民主，香港立法会（简称“立法会”）中27位民主派议员表示要否决基于上述决定的框架 提出的选举改革方案。在作出上述决定之前的五个月间，香港政府就预定在2017年特首选举之前实施的选举改革进行了咨询；2014年7月，特首就香港公众 对选举改革的意见向人大常委会提交了报告。此前，在2007年，人大常委会曾裁定香港最早可从2017年特首选举开始实行普选。\n\n• 中国大陆和香港的官员发表的声明引发了人们对中央政府将限制香港选举的关切。一些官员和法律学者拒绝接受民主派活动人士和立法会议员关于公开提名特首候选 人的方案，理由是只有《香港基本法》第45条中提及的提名委员会有权提名候选人。亲北京的法律专家还说，特首候选人必须“爱国爱港”才具备参选资格，“与 中央对抗的”特首是不可接受的。\n\n• 民主派立法会议员和活动人士继续要求在特首和立法会的选举中实行普选。2014年6月，据报道近八十万人参加了由民主派团体发起的关于选举改革的网上公 投。7月1日，数十万民众在香港市中心游行，他们认为中国政府加强了对香港的干涉并表示抗议。“占领中环”运动声称，如果香港政府提出的选举改革方案不符 合《香港基本法》和自由公平选举的国际准则，作为最后的手段，他们将在香港金融区举行公民抗命的抗议活动。\n\n• 香港记者和媒体报告说，由于自我审查、政府和经济上对新闻报道的直接和间接压力、以及对新闻工作者的暴力攻击，新闻自由受到威胁。据一家国际媒体非政府组织报告说，2013年香港的新闻自由状况继续恶化，其国际自由度排名从前一年的第58名下降至第61名。\n\n• 澳门举行了自2012年一组选举改革措施通过以来的首次立法会选举。澳门立法会的席位从29席扩大至33席，但只有14名（原为12名）议员是通过直接选 举产生。现任行政长官崔士安在没有遇到对手的情况下赢得连任，获得澳门选举管理委员会400票中的380票。根据委员会的观察，在实施2013年联合国人 权事务委员会的建议方面没有取得进展，该人权事务委员会的建议是：澳门“为向基于普遍平等选举权的选举制度过渡制定一个时间表”。\n\n• 腐败以及与澳门赌博行业有关联的涉及来自中国大陆的资金的洗钱活动继续令人关切。赌徒们继续逃避中国大陆的外汇管制，其手段是通过“中介”以及欺诈性的信用卡和借记卡交易。\n\n### 建议\n\n委员会鼓励美国国会议员和行政当局官员\n\n○ 续延《1992年美國-香港政策法》第301条的报告要求，特别关注香港民主体制的发展以及中国根据国际条约和协议承担的义务，确保把香港的发展变化纳入与中国有关的其他报告。\n\n○ 敦促香港和中央政府官员根据《基本法》要求和《公民及政治权利国际公约》在香港2017年特首选举和2020年立法会选举中实行普选。\n\n○ 通 过发表声明和最高层会议及对香港的访问加强对香港民主的支持。鉴于北京的中央政府官员在决定香港的政治发展方面起着决定性作用，在与他们会谈时应当提出香 港的问题。美国政府代表团在香港的会议应当包括与香港立法会议员、香港行政当局、司法机构人员和记者组织的代表的会谈。在澳门，美国代表团应当与立法会议 员（特别是直选产生的议员）、澳门行政当局及政府之外的公民社会领导人举行会谈。\n\n○ 敦促香港当局采取步骤确保记者安全，破解数起以暴力和恐吓对待记者和媒体高层主管的悬案。敦促香港和中央政府官员避免就新闻内容和报道方式向香港记者和媒体施加压力。\n\n○ 在会谈中敦促澳门政府官员根据联合国人权事务委员会的建议，并按照《公民及政治权利国际公约》第25条启动向基于普选权的选举制度过渡的程序。"
		},
		{
			"post_id": 13,
			"title": "CECC 2013年中国人权报告摘要",
			"date_published": 1520907327.999,
			"body": "2013 Annual Report Executive Summary Chinese Translation\n（2013年年度报告执行摘要中文译文）\n\n## 概述\n\n委员会注意到，中国在保障中国公民的表达、集会和宗教自由、制约中国共产党的权力、在习近平主席和李克强总理等新一届领导人的领导下建立法治等方面缺乏进展。新领导人上任伊始，官方在公开宣传中表示愿意考虑进行改革和制约官员权力，在全国各地引发了公众讨论。然而，新领导人很快开始压制日益高涨的要求保障人权和建立法治的呼吁，重申党在公共事务中的绝对领导地位。尽管放松对社会的限制以鼓励公众参与、减少国家对经济的控制、实行法治等观点得到普遍承认，但中国继续在推进经济现代化的同时避免政治改革或保障基本人权。\n\n* * *\n\n在委员会的报告年度（2012年秋季至2013年秋季）开始时，出现了一些让人觉得可能有希望的征兆。在2012年接近尾声时，习主席、李总理及其他高层领导人承诺严惩腐败、限制官员滥用权力，并许诺改革侵犯人权的劳教制度和户籍制度，表示有意赋予中国的《宪法》以更大权威。一批新法律和修订的法律生效——包括《中华人民共和国刑事诉讼法》和《中华人民共和国精神卫生法》——虽然包含重大缺陷，但也带来了加强保护公民权利的可能性。对于2013年初爆发的禽流感，中国采取了相对开放的应对措施，这与十年前对严重急性呼吸综合症（“非典”）危机的不当处理形成了鲜明的对照，这一点在委员会于2013年5月举行的一次听证会上得到强调。要么是受到中国新领导人的讲话的鼓舞，要么是由于权力交接带来的多种可能性，社会多阶层的公民——从一些党内人士到与基层新公民运动有关的人士——寻求对中国的未来展开一场公众讨论。他们敦促政府通过让《宪法》发挥更大效能来制约官员行为，通过要求官员公开资产来兑现打击腐败的承诺，并批准中国于1998年签署的《公民权利和政治权力国际公约》。\n\n然而，到春天时局势已经明朗化：中国新领导人不可能进行甚或容忍就宪政和反腐败等议题展开公众讨论。据报道，中共中央办公厅于4月下达了“9号文件”，把有关宪法制衡作用、反腐败、普遍人权和新闻自由的呼吁视作“西方反华势力”和异议人士的产物，寻求予以扼制和边缘化，而不是把此类呼吁视作中国公民的合法关切和根据中国对《世界人权宣言》及其他国际准则的承诺所应当履行的义务。此后，为了压制言论、集会和结社自由，到2013年9月当局已经拘留、逮捕或“使失踪”近60人，包括知名人权倡导者许志永和郭飞雄。倡导改革的评论文章和互联网上的讨论受到删剪。一些公民因索取有关政府的人权行动计划和定于2013年10月向联合国人权理事会提交的对中国人权状况的定期普查报告的信息而受到骚扰、拘留和逮捕。\n\n在过去一年中，党对改革呼声的严厉压制印证了一个始终贯穿本报告涵盖的19个问题领域的主题——即党的兴趣依然在于保持对中国社会的控制和绝对权威，而不是在透明度、人权、法治和放松国家对经济的管制等方面取得实质性和持久性进展。诚然，委员会在本报告的不同章节也提及一些改善措施，包括发布一份国家反人口贩运计划、在某些地方放宽居住限制、通过旨在减少虐待劳务派遣工的法律修正案、以及在某些省份停止劳教审批。但是，尽管采取了上述措施，大体上中国的国家政府继续对公民存有戒心，并继续拒绝让公民享有基本自由。\n\n这种情况明显地反映于过去一年里中国公民广泛关注的许多议题，从严重的环境污染和政治人物腐败到人们对食品安全的普遍关切和少数民族地区的紧张局势。公民们纷纷索取有关其环境和食品安全的更多信息，但当局坚持认为土壤污染属于“国家机密”。在中国，腐败是许多人最关注的问题之一，但当局拘留了倡导反腐败的人士，并查禁外国媒体关于中国领导人及其家人资产的报道。尽管中国的藏族地区又发生了几十起自焚事件，新疆也发生了一些自2009年以来最严重的动荡，但是中国官员继续依赖更加严密的安全和控制措施，而不是依赖对话与和解。又是一年过去了，与达赖喇嘛的代表的正式对话依然没有恢复，这是自2002年恢复对话以来最长的一次中断。从表面看来，8月份对前中共中央政治局委员和重庆市委书记薄熙来的审判之透明度相对较高，但这次审判也提醒人们，在涉及党的利益的时候，中国在很大程度上仍然是一个党治国家，而不是法治国家。\n\n另外，中国在实现“高效、在法治下运作的现代化政府”方面进展甚微，这是世界银行和中国国务院发展研究中心2012年发布的、具有开拓性的报告《2030年的中国》提出的一项建议。委员会在去年的年度报告中曾提到《2030年的中国》，该报告强调了委员会观察的人权和法治问题同中国的长期经济发展与稳定之间的紧密联系。报告敦促中国采取一系列步骤达到经济发展的下一个阶段，包括允许中国人民有更大的迁徙和参与社会活动的自由，加强法治。报告还敦促中国改革国有企业，这些企业是导致滥用职权的根源之一，为中国履行在法治方面的承诺造成障碍。就此而言，本报告认为政府在中国经济中继续起到过大的作用，不公平地为国有企业提供补贴，协调海外投资战略，实行对国内公司有利而对外国公司不利的政策，违反世贸组织规定的义务，低估货币价值，未能有效制止对外国知识产权的大规模盗窃行为。\n\n中国新领导人必须实行重大改革，以履行中国按照国际准则所承担的人权义务，并加强法治。在这方面，委员会向国会议员和行政部门官员提出以下主要建议，概述鼓励此类改革的方法。\n\n## 主要建议\n\n• 《公民权利和政治权力国际公约》(ICCPR)。 中国1998年签署ICCPR，但15年后依然没有批准该公约，尽管不断声称其有意这样做。在联合国安理会成员国中，中国是唯一没有参加或批准ICCPR的国家。中国必须采取若干具体步骤，以达到ICCPR具体条款的要求，包括下列各项：终结任意逮捕或拘留政治异议人士（第9条）；允许公民自由选择其居住地点（第12条）；终结作为政治惩罚手段对活动人士及其家人拒发护照和限制迁徙自由的政策（第12条）；允许公民自由信奉宗教和举行宗教活动（第18条）；终结对新闻媒体及互联网上的和平政治内容进行的审查，允许言论自由（第19条）；允许公民自由结社，包括成立非政府组织和工会\n\n第22条）；真正实行人人享有平等投票权的普选（第25条）。\n\n### 建议：国会议员们和行政部门官员们应当敦促中国承诺在某一具体日期批准ICCPR，包括就批准公约提供一份具体而透明的计划和时间表，该计划和时间表的制定应当通过真正的、民主的、公开的公众参与和评议程序，确保公民社会各阶层的参与。行政当局应当在2013年10月22日联合国人权理事会对中国进行“普遍定期审查”时以及未来与中国举行的双边对话中提到这项建议，此类对话包括战略与经济对话、人权对话和法律专家对话。行政当局应当在2013年11月12日联合国大会选举人权理事会成员之前及选举过程中提出中国参加联合国人权理事会的资格问题。\n\n• 美中贸易及其与法治和人权的联系。美国与中国之间广泛的贸易关系产生的结果之一是，中国国内的人权与法治进展对美国公众的健康和经济状况的影响超过任何其他国家。中国是世界第二大经济体，自从2001年以来一直是世贸组织（WTO）的成员国。中国是美国的第二大贸易伙伴，对美国出口大量食品、药品和其他产品，而且出口量不断增长。2012年，美国对中国的贸易逆差达到3150亿美元的历史最高纪录；2013年7月的逆差超过300亿美元，这是月份逆差的最高纪录。中国继续是世界上最大的二氧化碳排放国，一些存在水污染和土壤污染的地区继续生产粮食。另外，来自中国的污染物——如汞和臭氧——正在扩散至美国。中国政府在透明度、尊重国际贸易义务、保护中国公民的人权等方面的做法影响到从中国进口的货物的安全与质量，还影响到美国工人和企业公平竞争的能力。\n\n由于两国间的贸易，中国国内商业领域的法治及人权发展与美国人的健康和经济繁荣之间的联系在许多情况下都是显而易见的。没有自由的新闻媒体和公民社会，中国消费者就无法有效地发现和应对食品和药品安全问题、环境威胁以及大规模流行病，这些问题还可能影响到其他国家。产业政策、操纵货币、配额和补贴、强制性技术转让、盗窃知识产权及其他不公平贸易行为——其中许多行为违反了中国作为世贸组织成员国所承担的义务——直接伤害了美国企业和工人的利益。中国对互联网的审查不仅剥夺了近六亿互联网使用者的言论自由，而且阻碍了Facebook、Twitter、彭博通讯、纽约时报、谷歌、YouTube之类的公司进入中国市场。由于中国工人被剥夺了成立独立工会的基本权利，同时最低劳工标准和环境标准没有得到有力地执行，使得美国工人和公司处于不利的竞争地位。在过去两年中，委员会举行了一系列听证会，突出表明不应当脱离中国对言论自由、劳工权利、环境和公共卫生透明度、公民社会等方面的限制来孤立地看待美中贸易关系，听证会的题目包括：“中国对互联网和社交媒体的审查：人力资源损失和贸易影响”、“入世十年：中国是否履行了承诺？”、“中国的工作条件和工人权利：近期变化”、“中国的食品和药品安全、公共卫生和环境”、“中国黑客：对人权和商业领域法治的影响”。\n\n建议：在与中方举行的年度战略与经济对话、关于双边投资条约的谈判以及其他与贸易有关的会谈中，国会议员们和行政当局官员们应当寻求把人权和法治方面的关切纳入贸易和商业会谈，例如指出中国的互联网审查、法治和食品安全问题与中国的产业政策、执法不力以及盗窃美国知识产权之间的联系。行政当局还应当继续确保中国履行其世贸组织义务，包括必要时根据世贸组织争议解决程序行使美国的权利。\n\n• 法治和民主制度。在委员会报告期内的较早时间，习近平主席的一些言论引起了注意，例如“任何组织或者个人，都不得有超越宪法和法律的特权”、“. . . 宪法 . . . 是保障公民权利的法律武器”、“宪法的生命在于实施，宪法的权威也在于实施。”在实践中，中国在法治方面的进展陷于停顿，因为大多数法律法规的制定基本上是闭门造车，缺少民主参与；官员们继续任意利用法律惩罚他们认为在政治上敏感的人士；法律（例如劳工法律）的执行依然不一致。中国缺乏实质性的保障机制（例如独立的司法系统、自由的新闻媒体和不受限制的公民社会）来确保把国家对自由的限制保持在有限的范围之内，以符合国际法的要求。\n\n建议：在与中国官员的会谈中，国会议员和行政部门官员应当提及习主席的话，敦促他们建立法治社会的特有机制——包括通过民主制度和公众参与制定的法律和政策——以及实质性的保障机制，例如自由的新闻媒体、独立的司法系统和生气勃勃的公民社会。希望对中国新领导人打击腐败的努力表示支持的美国官员应当坚持阐明，为了使此类努力能够持续，必须同时确保民主参与、公众监督和法治。美国官员还应当提及报告《2030年的中国》的论点，即建立“高效、在法治下运作的现代政府”是中国未来经济发展的关键。\n\n• 少数民族。中国当前的少数民族政策，特别是有关藏族和维吾尔族的政策，业经证明没有效果且具有反作用。这些政策不但没有促进政府提出的建立稳定与和谐社会的国家目标，反而导致事态朝着相反的方向发展。藏民依然以令人震惊的频率从事悲剧性的自焚行为，新疆维吾尔自治区（简称“新疆”）经历了自2009年以来最严重的一些动荡事件。\n\n建议：国会议员和行政部门官员应当向中国官员指出，如果国家政策延续自上而下的做法，背离中国宪法对“民族自治”的承诺，依赖严厉的安全措施和没有少数民族参与决策、未能保护其文化、语言和宗教特征的发展政策，中国藏族地区和新疆的不稳定可能持续并进一步恶化。应当鼓励中国转向更具包容性、更民主的做法，充分考虑到藏人和维吾尔族人的意见和价值观，尊重他们的文化、语言和宗教。美国官员们应当注意到并努力进一步了解今年党内提出的关于西藏问题的更具包容性的政策建议，并呼吁中国领导人允许社会各群体（特别是因目前政策受到最大不利影响的藏人和维吾尔人）之间进行更广泛的公众对话和辩论，促进一个更稳定、更包容的社会。\n\n• 劳教、计划生育和户口。在过去一年里，一些重要的政策——例如劳教制度、计划生育政策和户口制度——引发了中国公众的广泛不满。这些政策不仅违反人权，而且造成社会不稳定，阻碍中国的经济发展。劳教制度允许在未经审判或得到法律帮助的情况下监禁公民，一些广受关注的滥用劳教制度的案件导致各界广泛呼吁在中国废除此项政策。计划生育政策干涉和控制中国公民——特别是妇女——的生育，并导致严重的侵权行为，例如强制性节育和堕胎。这项政策还加重了中国面临的人口挑战，包括人口老龄化、劳动力减少、男女比例失调等。户口制度剥夺了中国公民自由选择永久性居住地的自由，导致不平等待遇和对农民工的歧视，加剧了社会紧张关系和不稳定。\n\n建议：国会议员和行政部门官员应当询问过去一年里这些政策可能发生变化的迹象，包括把计划生育决策转移至国家发改委的一项政府机构改革和转变计划以及在2013年底前可能对劳教制度和户口制度进行重大改革的宣布。国会议员和行政部门官员应当详细了解这些变化及拟议中的改革方案，敦促中国官员实行认真的改革，以便纠正侵犯人权的状况，并通过终止在中国受到普遍反对的政策来增进社会稳定。\n\n# 报告要点\n\n本报告共分为19个问题领域，下文对每一领域中的主要变化作了简要阐述。\n\n委员会注意到，如今年报告中“言论自由”一节所述，中国的实际做法不符合《公民权利和政治权利国际公约》（ICCPR）第19条和《世界人权宣言》（UDHR）。随着越来越多的中国公民上网分享信息和表达冤屈，中国官员采取的对策是制定过于宽泛且不透明的政策，以减少“网络谣言”，扩大网络实名注册制度。对和平政治内容的审查是违反国际准则的，但继续普遍存在，受审查的内容从外国媒体对前总理温家宝家人财富的报道到国内网上对党的第十八次全国代表大会的讨论无所不包。新的研究表明，中国正在扩大其审查系统，侧重于可能导致集体行动的网上活动。党继续对新闻媒体保持广泛的控制，当局对杜斌和邓聿文这样的记者实施惩罚，杜斌揭露了马三家女子劳教所发生的滥用职权行为，邓聿文则批评了中国的朝鲜政策。2013年1月，在一次罕见的行动中，《南方周末》的新闻工作者举行罢工，抗议查禁一篇倡导自由和宪法权利的社论，关于这起事件的新闻受到审查。\n\n中国继续违反国际公认的工人权利，不允许工人自由结社和成立独立工会。正如“工人权利”一节所述，尽管在促进国家控制的工会中对直接选举工人代表方面作出了有限的努力，总体而言工会代表依然未能有效地代表工人利益。由于缺少保护其权利和对工作环境表达批评意见的渠道，中国人数众多的农民工继续遭受剥削，而他们为中国的经济增长提供了廉价劳动力。研究表明，只有不足半数的农民工签订了劳动合同，享受养老金和医疗保险的人数更少。与此同时，由于电子行业及其他一些行业的工资水平上涨，劳动力紧缺，一些公司违法聘用未成年人和剥削劳务派遣工，在某些案例中地方政府为此提供合作。2012年12月，全国人民代表大会修订了《中华人民共和国劳动合同法》，以纠正侵犯劳务派遣工权利的问题，但能否有效实施依然有待观察。\n\n委员会在“商业领域的法治”一节指出，国家在很大程度上对外向型投资进行协调。作为针对能源、金属、高科技和“知名品牌”等“战略产业”制定的“走出去”战略的一部分，外向型投资在近年来显著增加。一位官员敦促在海外投资的中国公司保持低调，以避免给人造成国家涉足的印象；与此同时，中国政府提供优惠融资，导致海外市场中出现不公平的竞争环境。根据美国财政部提供的信息，人民币的币值依然显著偏低。世贸组织裁定，中国对美国的取向电工钢、鸡肉产品以及欧洲的X光检查设备课征反倾销税和反补贴税的做法不符合中国对世贸组织承担的义务。中国官员继续把技术转让作为市场准入的先决条件，违反了中国对世贸组织承担的义务和中国在2012年美中联合商贸委员会会议上作出的承诺。据报道，对知识产权保护不力和鼓励中国获取技术的政策导致中国在国际知识产权盗窃中占有50－80％的比例。今年披露的信息显示，一次大规模网上盗窃行动与人民解放军的下属机构有关联。法治方面的问题带来持续的食品和产品安全问题，包括危险产品和非法产品的跨境偷运。\n\n正如今年报告中“刑法”一节所述，据委员会观察，就公平审判权利以及免受任意拘留和酷刑的权利而言，不符合《公民权利和政治权利国际公约》和《世界人权宣言》准则的状况持续存在。经修订的《中华人民共和国刑事诉讼法》（简称《刑诉法》）于2013年1月1日生效；虽然新法的大部分内容比原有法律改进，但没有明确规定保持沉默和假定无罪的权利，也没有明确规定被告有不自证己罪之权利。新《刑诉法》第73条把强制失踪（最长达六个月）合法化，违反了国际准则。中国当局继续利用刑法系统压制异议和惩罚社会活动人士及其家人——对知名维权人士许志永进行刑事拘留和囚禁陈光诚的侄子陈克贵只是其中的两个例子。利用刑訊逼供和错误定罪的问题再一次受到公众关注，但《刑诉法》有关刑事审判中不得使用非法获取的证据的新规定是否真正能够减少刑事调查中酷刑的使用尚有待观察。\n\n委员会在“宗教自由”一节中指出，中国政府有关宗教的法律和政策框架违反了国际宗教自由准则，包括《世界人权宣言》第18条。中国宪法仅仅保护“正常宗教活动”，限制了公民从事信仰活动的能力，政府依然只承认五大宗教——佛教、天主教、道教、伊斯兰教和基督教——国家对这些宗教的活动给予有限的保护。政府和党对宗教团体保持严格的意识形态控制和监督，一位高级官员宣布，到2013年年底，所有教职人员必须在政府登记。寻求在国家批准的范围之外从事信仰活动的中国公民继续面临骚扰和拘留。例如，辅助主教赛迪斯·马达钦在其祝圣礼上公开宣布他将退出国家运作的中国天主教爱国协会之后，中国官员撤销了他的辅助主教职务。2013年4月，据一家设在中国的杂志报道，有人指控辽宁省的马三家女子劳教所对囚犯使用酷刑和严重虐待她们，据信其中许多囚犯是法轮功修炼者。穆斯林被警告不要参加不是由政府组织的朝圣活动。政府还继续骚扰北京守望教会的成员（这是北京市的一个基督教家庭教会），并在深圳市拘留了家庭教会牧师曹楠和其他人，原因是他们在一个公园中举行宗教集会。\n\n委员会在“西藏”一节中指出，中国官员依然没有能够以建设性的方式化解藏人的不满情绪，而是在2012年9月至今年7月发生了65起藏人自焚事件之后加强了压制措施，这些措施侵犯了藏人的表达、结社和迁徙自由。自焚在11月第十八次全国党代会期间达到高峰，官员们为此发动了一场令人忧虑的运动，要求自焚者的亲属、朋友和相关者承担刑事责任。据报道，有些自焚者在自焚时呼吁允许更多地使用藏语——显然一些藏人认为官方政策对藏族文化的活力和生存能力构成重大威胁。官员们继续强调经济发展是取得“社会稳定”的关键，即使一些项目引发了抗议或被指控为对当地社区造成损害。中国和达赖喇嘛之间的会谈依然处于中断状态，但是，中央党校的一位学者在公开发表的讲话中提出与达赖喇嘛改善关系可能带来益处，这意味着某些官员可能有意以较公开的方式讨论这个议题。\n\n委员会了解到，春季和夏季的动荡事件导致多人死亡，报道的死亡人数从数十人到上百人不等，甚至可能更多，这使人对新疆维吾尔自治区的民族政策未能消除不稳定的根源感到关切。正如“新疆”一节所述，当局继续依赖严厉的安全措施，包括过于宽泛的、针对普通民众的清查，自上而下的、过多排斥维吾尔人的经济发展，而不是实行具有包容性的、尊重宗教、文化和语言权利的民主政策。中国官员们侵犯了维吾尔人的迁徙自由，阻碍维吾尔族学者伊力哈木‧吐赫提前往国外旅行，并拒绝向一些维吾尔人颁发护照。有消息说，米尔哈米提江·木扎派尔被判处11年监禁，原因是他为一家报道喀什老城拆迁的香港媒体当翻译。\n\n正如“少数民族权利”一节所述，一些蒙古人继续由于和平抗议和弘扬其文化特征而面临骚扰或监禁，一些游牧人口被迫在远离草原的地方定居。当局继续非法关押蒙古维权人士哈达，拒绝为其严重的精神健康问题提供治疗；他们命令原来在内蒙古自治区一所医药学校担任校长的巴图张嘎开始服刑，刑期三年，巴图张嘎曾组织示威活动，抗议政府没收校园财产。\n\n如“计划生育”一节所述，中国干涉和控制中国公民生育的政策继续违反国际人权准则，此类政策包括罚款、剥夺福利、强制绝育和堕胎。2013年3月，中国新领导人把国家人口和计划生育委员会与卫生部合并，把制定人口发展政策和战略的权利移交至国家发改委，有些人认为此举为改革带来了可能性，另一些人则认为这项安排加强了计划生育体系。有人继续呼吁放宽计划生育政策，但地方当局依然大力推行该政策，新闻和社交媒体继续报道中国各地强制堕胎和绝育的事件。\n\n中国当局继续实行户口制度，该制度剥夺了公民自由决定永久居住地的权利，歧视在城市中居住的农村人口，以没有城市户口为借口拒绝向他们提供社会服务，增加了社会不稳定因素。正如“居住和迁徙自由”一节所述，高层官员宣布，作为扩大城镇化规模以保持中国的经济增长的一项措施，2013年年底会出台一项改革户口制度的计划。一些官员制定了试验性政策，为在城市中居住的农村人口提供更多受教育机会和就业机会，但专家说许多地方政府缺乏全面实施此类改革的资源。中国继续剥夺公民自由出国的权利，拒绝向人数日增的政治敏感人士发放护照，此类人士包括藏人、维吾尔人、政治活动人士及其家人。据人权组织估计，至少有1400万人可能受到影响。被囚禁的2010年诺贝尔和平奖得主刘晓波的妻子刘霞继续被在家中软禁，她是被剥夺国内迁徙自由的许多“政治敏感”人士之一。\n\n委员会注意到，中国依然未能全面履行根据《消除对妇女一切形式歧视公约》作出的承诺，没有能够确保妇女在政府中的代表性。正如“妇女状况”一节所述，各级政府中妇女所占比例依然很低，在最高领导层换届后并没有明显改善。教育和就业方面的性别歧视依然普遍存在。国营媒体曾报道说在国家一级会有新的反家庭暴力的立法，但迄今尚未成为现实，此外，基于《中华人民共和国刑法》，被强奸的年轻女性没有得到足够的法律保护。\n\n如“人口拐卖”一节所述，中国为执行《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》采取了一些步骤，包括在今年公布了一项新的全国性打击人口拐卖行动计划。在连续九年被列入第二列观察名单后，今年6月中国在美国国务院2013年《打击人口贩运报告》中被自动降至第三列，即最低的一列。中国继续是贩运成年男女和儿童的目的地、来源地和国内贩运地，贩运的目的包括强迫劳役、强迫婚姻和性剥削。\n\n委员会在“在中国的朝鲜难民”一节中指出，中国继续违反1951年《关于难民地位的公约》及1967年签署的《难民地位议定书》，拘留并把朝鲜难民遣返至朝鲜民主主义人民共和国，尽管他们在被遣返后面临严厉的处罚。中国政府似乎与朝鲜官员一道加强了防止朝鲜难民进入中国的措施。在中国的朝鲜妇女继续被拐卖，遭受强迫结婚和商业性剥削。中国继续违反《儿童权利公约》，遣返朝鲜妇女，迫使她们与在中国出生的子女分离。\n\n委员会在“环境”一节中指出，中国面临严峻的污染问题，但继续拒绝向其公民提供完全透明的信息，也没有通过法律赋予公民行使其权力的能力。中国的公开政府信息法规要求政府发布环境信息。官员们对有毒化学品和“癌症村”之间的联系持较坦率的态度，并开始披露某些环境影响报告简本，但他们拒绝发布土壤污染信息，至少在回答一位公民的请求时声称此类信息属于“国家机密”。总体而言，公民继续被阻隔在决策程序之外，当局拘留了环保人士刘福堂和陈余千，压制了反污染示威。新的《环境保护法》修订草案收紧了一些条款，仅仅允许一个附属于政府的环保组织援引该法律提出公共利益诉讼。\n\n中国继续剥夺公民直接或通过自由选举的代表参与公共事务的权利，也不允许公民在真正的选举中行使普遍和平等的投票权，违反了《世界人权宣言》第21条和《公民权利和政治权利国际公约》第25条阐述的准则。正如“民主治理机制”一节所述，中国新领导人产生于一个不透明的、非民主的程序。在各个级别，从司法系统和全国人民代表大会到新闻媒体和大学，中国共产党继续控制政治事务。当局继续拘留倡导民主的人士或将他们判刑，包括曹海波和刘本琦，他们只是近年来日渐增多的被处罚的人士中的两位。对于被视作政治上敏感、寻求参与公共事务的公民，中国政府继续采取不容忍的态度。例如，当局逮捕了彭兰岚，并骚扰了索取有关中国定于2013年10月向联合国人权理事会提交的对中国人权状况的定期普查报告信息的其他人士。当局还逮捕了至少25位反对腐败和倡导社会公正的人士，他们曾呼吁官员们公布个人资产或就其他问题从事倡导活动。\n\n根据“公民社会”一节，委员会的调查结果显示，中国政府过于宽泛地限制非政府组织（NGO）和非正式公民网络，继续违反《世界人权宣言》第20条和《公民权利和政治权利国际公约》第22条阐述的自由结社准则。政府和党重申对中国非政府组织的发展保持控制，对被视为支持经济增长或提供社会福利服务的团体给予优惠待遇，同时却骚扰从事倡导活动或政府认为政治敏感活动的团体。政府承诺在2013年年底前发布人们期待已久的改变监管的措施，为某些类别的团体在政府注册提供便利，但这不包括政治、法律、宗教和外国非政府组织。\n\n“司法公正”一节凸显了中国政府对由于权利受到政府侵害而寻求有效救济的公民缺乏容忍，这种做法背离了《世界人权宣言》第8条和《公民权利和政治权利国际公约》第2条。在2012年11月举行的第十八次全国党代会期间，据报道官员们下令把维权人士、上访者和法轮功修炼者送往劳教所，以实现“零上访”，防止在会议期间有人在北京举行抗议活动。中国政府以半遮半掩的方式谈及有可能在今年年底时对劳教制度进行改革，媒体、学术界和政府都广泛表示关注。对维权人士和政治活动人士及其家人的骚扰依然持续，知名维权人士高智晟和倪玉兰继续在监狱中服刑。虽然据报道获得法律援助的人数增加，2013年8月逮捕法律维权人士许志永凸显了政府对民间通过独立渠道寻求司法公正的努力感到担忧，许志永被加上一个莫须有的罪名——“聚众扰乱公共秩序”。许在2003年成立了非政府组织“公盟”，该组织在2009年被查封。他还是“新公民运动”的主要倡导者之一，这是一个由个人组成的广泛的网络，旨在促进法律和政治改革、人权、社会公正及其他事业。\n\n委员会在“公共卫生”一节指出，国际卫生组织赞扬中国有效地应对了2013年3月爆发的H7N9禽流感疫情以及在2003年严重急性呼吸综合症（“非典”）爆发以来的十年中在建立紧急应对结构方面取得的进展。但是，中国公众继续对政府保护公众健康和监管食品和药品安全的能力表示关切。中国的第一部《精神卫生法》于2012年10月通过，并于2013年5月生效。令人持续感到担忧的是，对强制住院的决定提出上诉的权利没有保证，亦无保障机制来防止有关方面继续滥用职权，把强迫入住精神病院作为处罚上访人员、政治活动人士及其他人员的手段。政府还发布了有关残疾人教育的规章的修订草案，对此公民社会组织敦促制定更准确的定义并对内容作出修改，以符合联合国《残疾人权利公约》。尽管受到法律禁止，基于健康状况的歧视在教育、医疗和就业方面依然普遍存在。\n\n委员会在“香港和澳门的发展”一节指出，虽然联合国人权事务委员会对“缺少实行普选的明确计划”表示关切，香港官员依然拒绝回应就通过普选产生特区行政长官（简称“特首”）尽早进行公众谘询的呼吁，该选举预定于2017年举行。大陆中国官员在声明中排除了在特首提名过程中允许选民广泛参与的可能性，声称普选中的特首候选人必须享有中央政府的信任。香港政府搁置了一项可能降低公司董事信息透明度的措施。大陆的专家和官员们继续劝说澳门不要寻求普选。据报道，中国政府和澳门官员加强了对澳门博彩业的监管，以配合更大规模的反腐败运动。\n\n委员会的法定任务之一是编集和保持据信由于追求国际公认的人权而被监禁、拘留、软禁、使用酷刑或以其他方式受到中国政府迫害的人员的名单，为了完成此项任务，委员会保持一个内容广泛的中国政治犯数据库。据“政治犯数据库”一节所述，截止于2013年9月1日，委员会工作人员记录了1304名目前已知或据信被拘留或关押的政治犯和宗教犯，另有6005人已知或据信被释放或处死、在监狱中或在释放后不久死亡、或逃脱。委员会指出，这些数字系委员会工作人员基于公开信息收集的结果，并且中国目前的政治犯和宗教犯的实际数字可能要高出很多。\n\n委员会中的行政当局成员参与并支持了委员会的工作。本《年度报告》的内容，包括调查结果、观点和建议，不一定反映行政当局成员个人的看法或行政当局的政策。\n\n委员会以14：0的表决结果通过了本报告。\n\n具体调查结果和建议\n\n言论自由 | 工人权利 | 刑法 | 宗教自由 | 少数民族权利 | 计划生育 | 居住和迁徙自由 | 妇女状况 | 人口拐卖 | 在中国的朝鲜难民 | 公共卫生 | 环境 | 公民社会 | 民主治理机构 | 商业领域的法治 | 司法公正 | 新疆 | 西藏 | 香港和澳门的发展\n\n下文列出本《年度报告》每一节的具体调查结果概述，覆盖委员会追踪的各个领域。在每一个领域中，委员会都列举了需要在下一年度关注的一组问题，并且根据委员会的法定任务就每一个领域中的问题向总统和国会提出了一组建议，以便国会或行政当局采取行动。\n\n## 言论自由\n\n### 调查结果\n\n• 在委员会的2013报告年度，中国官员继续对言论自由保持广泛的限制，违反了国际人权标准，包括《公民权利和政治权利国际公约》（ICCPR）第19条和《世界人权宣言》（UDHR）第19条和第29条。虽然此等准则允许国家在有限情况下限制表达以保护国家安全和公共秩序等利益，中国政府施加的限制所覆盖的活动要广泛得多，包括以和平方式提出的不同意见和批评共产党的意见。\n\n• 据中国负责互联网事务的国家一级管理机构中国互联网络信息中心（CNNIC）发布的数字，截止于2013年6月底中国的互联网用户超过5.9亿人，互联网普及率（互联网用户人数除以总人口）达到44.1％。中国政府承诺要使更多人能够使用移动通信技术，并加强政府对互联网的控制。\n\n• 在2013报告年度，中国类似推特的服务微博网站的用户继续大量增加。中国的微博网站——包括中国最大的微博网站“新浪微博”——的用户人数大幅攀升，到2012年底已有3.09亿个注册账户。\n\n• 据报道，中国政府对某些广受欢迎的微博用户增加了压力，其中有些人发表了坦率的针砭时弊的意见或政治评论。由于微博服务日益受到用户的喜爱，一些博主的博文拥有数百万读者，具有影响公众舆论的潜力。由于对“网上谣言”日益感到关切，中国互联网管理机构对一批知名账户采取了打压措施，并针对互联网活动制定了“七条底线”。有人指控说对知名微博用户的压制是出于政治动机。\n\n• 虽然国内外观察人士继续指出互联网和手机在中国的蓬勃发展，中国政府和共产党官员基本上没有放松政治控制的迹象。中国官员在披露屏蔽内容和屏蔽原因方面依然不具有透明度，官员们依然出于国际准则不允许的目的任意屏蔽内容。在某些事例中，网上审查和网站关闭似乎是出于政治动机，违反了关于自由发表意见和言论自由的国际准则。\n\n• 官员们继续任意限制言论自由，滥用含糊不清的刑法条款，把宽泛的法规和注册要求强加于记者、出版社、新闻媒体和互联网用户。\n\n• 政府和党的官员继续以违反国际准则的方式控制新闻媒体。广东省的一份进步周报《南方周末》的工作人员在2013年1月举行罢工，凸显了新闻媒体缺乏编辑独立性的状况，公众舆论为之大哗。\n\n• 在过去一年中，委员会继续看到中外记者在中国受到骚扰。例如，中国当局采取行动处罚进行独立报道的记者或禁止他们进行报道。在另一些事件中，外国记者和香港记者受到骚扰、恐吓或攻击。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n对于中国政府坚称限制言论自由符合国际准则的做法表示关切并提请国际社会进一步关注。\n强调中国政府的立场违反了有关言论自由的国际人权准则，特别是《公民权利和政治权利国际公约》（ICCPR）第19条和《世界人权宣言》（UDHR）第19条和第29条阐述的准则。\n向中国官员强调共产党和政府对互联网和新闻媒体的审查使公众对媒体和政府丧失信任，可能导致不稳定。\n与中国官员进行对话和交流，探讨政府如何确保对言论自由的限制不过度，不超出保护国家安全、未成年人和公共秩序的必要范围。强调程序性保护机制（例如公众参与制定限制言论自由的规则）的重要性、实施此类限制的透明度、以及对此类限制的独立审查。\n敦促中国官员实施其在立法过程中提高透明度和公众参与的呼吁。此类会谈可以纳入范围更广的讨论，即美中两国政府如何协作，确保保护其互联网上的共同利益，包括保护未成年人、计算机安全和隐私权。\n认可中国政府扩大互联网和手机使用范围——特别是在农村地区——的努力，同时继续敦促官员们遵守国际准则。\n支持有关技术的研发，以便中国公民能够阅读和分享其有权利阅读和分享的政治和宗教内容，并按照国际人权准则分享内容。支持有关做法和中文工具及培训材料，以便中国公民能够以确保其安全和隐私权的方式阅读和分享内容。支持在互联网上传播关于中国公民根据国际准则应当享有的权利和自由的中文信息，特别是通过广受欢迎的中国社交媒体网站。\n更有力地表达对加剧骚扰外国记者的关切，过去一年中曾有殴打外国记者的事件发生。对有关当局一再延迟或拒绝批准外国记者的签证申请表示关切。\n\n## 工人权利\n\n### 调查结果\n\n• 在委员会2013报告年度中，中国政府继续阻止工人行使宪法赋予的结社自由权利。无论是在法律上还是在实践中，中国工人按照国际准则所应当享有的权利都没有得到保障，包括组织独立工会的权利。中华全国总工会（简称“全总”）是共产党指导下的官方工会，也是中国唯一的合法工会组织。在过去一年中，当局继续推动工会代表直选，但关于通过选举能否产生真正有代表性的工会仍然存在疑问，因为管理层继续对候选人的选择施加影响，工人参与选举过程仍然受到限制。\n\n• 真正的集体谈判依然有限，因为基层工会在与雇主的谈判中不能有效地代表工人和促进工人权利，除全总外也不存在其他工会组织。尽管全总在近年来推动集体合同和集体工资谈判，但集体合同及协商程序依然存在问题，部分原因是工会缺乏自主权和真正的代表性。\n\n• 委员会继续注意到，在过去一年中继续有关于工人组织罢工的报道，在全国各地，不同行业和不同地区都发生了示威，起因常常是系统性的、与劳工有关的不满情绪，例如工厂关闭或迁移、欠付工资和福利、以及侵犯工人权利的管理方式。基层的官方工会常常反对工人自发的行动，也未能在工人中发挥组织作用。据媒体报道，在某些事件中政府官员对示威工人使用暴力或拘留了示威工人。\n\n• 近年来的人口和经济变化使工人在工作场所有了更大的讨价还价的能力，他们更有决心要求雇主解决他们不满意的问题，并要求增加工资和改善工作条件。另外，年轻一代农民工对工作条件和劳工权利的期望值不断提高，被认为是近期工人维权趋势上升的主要原因。\n\n• 总体而言，农民工依然被边缘化，在工作场所容易遭受剥削，面临种种问题，例如欠薪、社会歧视、缺少劳工和社会福利保护。农民工主要在不需要很多技术的低端产业就业，因此更可能遭受工伤和罹患职业病。\n\n• 尽管中国法律以及根据国际准则作出的承诺都禁止使用童工，雇用未成年人的做法在电子制造业和其他行业依然明显。据报道，执法过程中的系统性问题以及资源缺乏继续使减少童工的努力鲜有进展。\n\n• 劳务派遣工人在工作场所依然特别容易受到剥削，比起与雇主直接签约受聘的合同工，他们的工资常常更低，福利更少。2012年12月通过的一系列《中华人民共和国劳动合同法》修正条款包含的内容可能有助于改革劳务派遣中某些有损工人权益的做法。但是，执法不力的现象持续存在以及来自一些国有企业和国家及地方政府部门的阻力可能削弱这些改革措施。\n\n• 在过去一年中，中国的平均工资水平继续上升。有报道认为，中国劳工市场的结构性变化——特别是工作年龄的人口减少——以及间或出现的劳动力短缺和制造厂进一步迁往内陆地区或东南亚，标志着中国“廉价劳动力”的减少。\n\n• 虽然工资水平继续提高，地区和行业间的收入差距也在增大，大幅度增加了贫富差距。2013年2月，中国国务院发布了一份期待已久的收入分配计划，旨在减少收入不平等，提高家庭收入。然而，观察人士质疑该计划能否全面实施。\n\n• 在过去一年中，欠付和不付工资的问题依然严重，特别是对农民工而言。国际新闻媒体在2013年全年的报道中表明，欠薪是导致工人自发性抗议的首要原因，特别是在中国农历新年之前的几周内。\n\n• 中国工人——特别是煤矿工人——持续面临职业安全与健康风险。过去几年中死亡率稳步下降，但与此同期官方报告的职业病发病人数增加。虽然存在旨在预防工伤事故和建立检查和处理违反安全规程的监管系统的法律措施，但由于实施和执法过程中的系统性问题以及在工作场所安全卫生决策方面缺乏实质性的工人参与，继续使减少工伤事故的努力不能充分奏效。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持推动改革中国劳工法律法规以便符合国际公认的劳工标准的项目。优先支持的项目应当不仅侧重于起草法律法规，而且侧重于积累知识、专长和实用的解决方案，以便在企业层面与国际公认的劳工标准接轨。\n在成功地进行了集体谈判的地方与政府官员、工人和工会领导对话；寻找推广这些经验的途径；在集体谈判尚不成功的地方向官员们和工会介绍此类经验。如有可能，优先支持有能力在没有有效的工会组织的企业中进行集体谈判试点的项目。\n对有效地利用工人和管理人员联席委员会、有效地进行集体谈判、直接选举工会代表的事例表示支持。与政府官员、工会领导人和雇主对话，寻找机会推广直接选举工会代表的成功经验，为当选的工会代表提供持续培训和支持。支持美国劳工部（USDOL）与中国煤炭工业协会就产业合规、煤矿一级的工人代表性以及改进职业安全与卫生等议题进行交流。\n鼓励美国从事集体谈判的人员与中国非政府组织中的劳工维权人士、律师协会、学术界以及官方工会扩大交流。优先支持强调与具有实践经验的人员和培训人员进行面对面会谈的交流项目。\n支持能力建设项目，以加强维护工人权利的中国劳工和法律援助组织。鼓励中国的基层官员与国内外劳工组织建立、保持和发展关系，邀请这些组织在中国举办更多培训。支持通过培训帮助工人识别工厂一级的问题，获取技能和解决问题的能力，以便他们有效地向雇主反映他们的关切。\n适当时与中国官员分享美国在保护工人权利方面的持续努力和经验，包括法律、监管或非政府途径。增加现场考察机会并扩大与中国官员的其他交流，以便他们进行观察并与美国劳工权利团体、律师、美国劳工部以及美国各级政府中与劳工事务有关的其他监管机构分享经验。\n支持美国劳工部与中国人力资源和社会保障部（简称“人社部”）就制定和实施最低工资标准、加强社会保险和改进就业统计数字等事项进行交流；促进与中国国家安全生产监督管理总局（简称“安监局”）就改进工作场所安全与卫生进行对话和交流。支持美国劳工部从2010年开始与中国进行的年度劳工对话和从2012年开始与中国进行的年度安全对话。支持美国劳工部与中国安监局之间有关工作场所安全与卫生的技术合作项目，并且把双方在采矿业的合作扩大至广泛的职业安全与卫生领域。支持通过建立公私伙伴关系解决工作场所安全与卫生问题的试点项目，开始让工人以实质性的方式参与对工作场所安全与卫生具有重要性的管理层决策。\n\n## 刑法\n\n### 调查结果\n\n• 经修订的《中华人民共和国刑事诉讼法》（简称《刑诉法》）于2013年1月1日生效。在书面上，虽然新法在许多方面具有积极意义，但没有明确规定保持沉默和被告有不自证己罪之权利，也没有按照《世界人权宣言》（UDHR）和《公民权利和政治权利国际公约》（ICCPR）的要求明确规定假定无罪的权利。\n\n• 如果能够有效实施，经修订的《刑诉法》将使律师能够更好地为其客户辩护，进一步保护被拘留的犯罪嫌疑人和被告的权利，例如通过为律师及其被拘留的客户约谈提供便利。基于有限的资料作出的初步报告显示，律师更容易与被拘留的客户会面，但有些问题依然存在。\n\n• 中国当局继续使用定义含糊的罪名压制和处罚不同意见以及被视为挑战中国共产党统治地位的行为。除《中华人民共和国刑法》第105条外（该条规定了“颠覆”和“煽动颠覆”的罪名），在本报告年度中当局还大量使用定义含糊的罪名（例如“非法集会”和“聚众扰乱公共场所秩序”）来压制维权人士和公民社会活动人士。8月22日，公安人员逮捕了知名维权人士许志永，理由是怀疑他“聚众扰乱公共场所秩序”。\n\n• 中国官员继续骚扰和任意拘留维权人士、公民社会活动人士、作家、律师、博主以及维护自身权利或他人权利的普通公民。这些人要么由于以和平方式行使其国际公认的人权而被判处监禁，要么受到不同形式的任意拘留/非法羁押，包括关入“黑监狱”和行政拘留设施，包括劳动教养所，还有人被在家中非法软禁或强迫失踪。\n\n• 在本报告年度中，刑讯逼供和错误定罪问题引起了很多关注，许多事件被接二连三地揭露出来，高层司法官员表示谴责此类做法。经修订的《刑诉法》包含的一些新条款禁止把非法获取的证据用于刑事审判，这些条款如果有效实施，可能导致逼供和错误定罪的案件减少。\n\n• 尽管中国政府继续试图减少拘留设施中使用酷刑和虐待被拘留者的事件，但这种情况在中国依然很普遍。4月，一份中国杂志发表了一篇报道，详细叙述了辽宁省马三家女子劳教所对囚犯施加酷刑、虐待和强迫劳动的情况，引发了改革劳教制度的呼吁。在重庆市前市委书记薄熙来下令进行的打击有组织犯罪运动中使用酷刑和虐待被拘留者的情况被逐步地披露出来。虽然采取了一些初步步骤纠正运动中被错误地指控和定罪的案件，但还有更多的工作要做。\n\n• 尽管中国政府继续把死刑人数视为国家机密，但据估计该数字在稳步减少。仍然存在从死囚身上摘除器官的现象。2013年3月，卫生部和中国红十字会正式推出了一个全国性志愿捐献器官的系统。据报道，一位高级卫生官员在8月宣布两年之后中国将不再依赖从死囚身上摘除的器官进行器官移植。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n敦促中国政府作出公开承诺，按照一个特定时间表批准《公民权利和政治权利国际公约》（ICCPR）)。中国政府于1998年签署了该公约，但迄今尚未批准。\n鼓励中国政府采取行动实现已经宣布的目标，废除劳教制度，并敦促中国政府废除其他形式的行政羁押，确保中国公民享有《世界人权宣言》与《公民权利和政治权利国际公约》所阐明的公平审判和正当法律程序权利。\n呼吁中国政府释放所有因合法行使其基本人权——包括言论自由、结社自由、和平集会以及免受任意拘留的权利——而被拘留和囚禁的中国公民，包括维权人士许志永、倪玉兰、高智晟和王炳章。向中国政府施压，要求释放由于合法行使人权而被非法软禁或囚禁的活动人士亲属，例如刘晓波的妻子刘霞和陈光诚的侄子陈克贵。\n敦促中国签署和批准《保护所有人免遭强迫失踪国际公约》，邀请联合国任意拘留问题工作组访问中国，该工作组曾于2013年2月提出访问中国的请求。\n支持有关取证及其他刑事侦查问题的项目和国际合作，以便减少中国执法部门在刑事案件中对供词的依赖。\n\n## 宗教自由\n\n### 调查结果\n\n• 中国政府关于宗教的法律和政策框架违反了关于宗教自由的国际人权准则，包括《世界人权宣言》第18条。虽然《中华人民共和国宪法》声明所有公民享有“宗教信仰自由”，但由于它仅仅保护“正常宗教活动”，因此限制了公民从事信仰活动的能力。政府依然只承认五大宗教——佛教、天主教、道教、伊斯兰教和基督教——国家对这些宗教的活动给予有限的保护。政府继续宣布某些信仰系统为非法，因此剥夺了这些群体的成员在不担心政府迫害的前提下公开从事其信仰活动的权利。\n\n• 严格的意识形态控制和政府对宗教团体的监督通过宗教事务局、共产党的统战部以及五个“爱国”宗教协会来实现（每一个协会负责一个受到承认的宗教）。所有教职人员和宗教组织都必须在政府注册。一位高级宗教官员宣布，所有教职人员到2013年年底必须注册。在过去一年中，中央政府官员还宣布了一项计划，放宽对社会组织的某些注册和管理限制，这项计划把宗教组织明确排除在外。\n\n• 官员们继续追踪、控制、限制和“引导”中国非藏民区佛教徒的宗教活动，一位高级官员敦促佛教徒“拥护党的领导”。至少有三个佛教派别继续被作为邪教而禁止。\n\n• 观察人士认为，中国的政策导致中国天主教分为“官方”教会和“地下”教会。中国的天主教徒依然无法自由接受罗马教廷挑选主教的权力，2013年4月生效的一个挑选主教的新法规扩大了国家在挑选过程中的作用，明确要求主教候选人“拥护中国共产党的领导和社会主义制度”。国家运作的天主教组织的官员在12月宣布了一项决定，撤销辅助主教赛迪斯·马达钦的辅助主教职务，此前马达钦在2012年7月其祝圣礼上公开宣布他将退出国家运作的中国天主教爱国协会。教职人员继续因为从事地下活动或拒绝加入爱国协会而被拘留，包括宋万军神父。\n\n• 根据委员会了解到的一些报告，官员们继续把法轮功修炼者判处长期徒刑，骚扰试图协助法轮功修炼者的律师，迫使修炼者放弃其信仰。在过去一年中，委员会了解到的报告还说，官方反邪教的努力侧重于教育公众“抵制”法轮功。2013年4月，设在中国的《视觉杂志》发表一篇报道，声称有人指控辽宁省的马三家女子劳教所对囚犯使用酷刑和严重虐待她们，据信其中许多人是法轮功修炼者。\n\n• 中国当局继续限制穆斯林从事其宗教活动的能力，并强调伊斯兰教教职人员在促进国家政策方面的作用。为了推行国家政策，当局还继续监管伊斯兰教领导人的审批，并监督穆斯林前往海外朝圣的活动。2013年2月，伊斯兰教教职人员在一次颁证仪式上被告知要“立志成为政治上靠得住”的教职人员，新疆维吾尔自治区（简称“新疆”）各地的地方当局警告宗教信徒不要参加不是由政府组织的朝圣活动。负责宗教事务的政府机构试图把2013年春季和夏季在新疆各地发生的暴力冲突描述为“宗教极端主义”煽动的行为，并敦促伊斯兰教职人员努力反对“宗教极端势力”。\n\n• 中国政府继续控制其官方基督教会的教义和活动，并对未注册家庭教会的成员进行骚扰、拘留和其他形式的虐待。政府继续试图禁止北京守望教会的集体礼拜活动，该家庭教会在北京市拥有一千多名会众。由于公安人员阻止该教会迁入其购买的房产，教会提出申诉，但被驳回。受到国家支持的对家庭教会的突袭继续发生。2013年4月，内蒙古自治区的地方当局突袭了阿拉善盟的一个家庭教会，使用了催泪弹，并拘留会众和殴打其他人。深圳市的官员拘留了家庭教会牧师曹楠和其他人，原因是他们在一个公园中举行宗教集会。山西省官员把李文习和任拉成判刑，理由是在印刷和出售宗教出版物时“从事非法经营”活动。\n\n• 中国道教协会继续与中国政府合作，以确保道教团体“拥护中国共产党的领导和社会主义制度”。在11月的一次会议上，一位高级宗教官员提醒道教领导人“学习和贯彻党的十八大精神，是宗教界当前和今后一个时期的首要政治任务”。\n\n• 尽管没有得到中央政府的正式承认，但一些宗教团体依然设法在中国境内运作，并继续呼吁中国政府给予更大的承认。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n呼吁中国政府按照《世界人权宣言》第18条保障全体公民享有宗教自由，撤销仅仅承认少数宗教团体和为这些团体提供有限的国家保护的政府框架。向中国当局强调，中国为宗教团体和普通公众提供的意识形态“指导”违反了公民的宗教信仰自由，中国对“正常宗教活动”的有限保护不符合关于宗教自由的国际准则。向中国政府强调宗教自由权利包括：佛教徒在寺庙中从事宗教活动不受国家控制的权利、佛教僧侣按照佛教程序和标准挑选寺庙老师的权利、藏传佛教徒公开对藏传佛教老师——包括达赖喇嘛——表达尊重或忠诚的权利；天主教徒就与信仰活动相关事项（包括主教任命）承认罗马教廷权威的权利；法轮功修炼者在中国境内自由修炼法轮功的权利；穆斯林不按照国家指定方式从事宗教外展和布道活动、不因“维护稳定”的名义而被限制国际上保护的宗教自由权利；基督教徒不受国家对教义的控制自由礼拜、在未注册家庭教会中礼拜、不受骚扰、拘留和其他虐待的权利；道教徒不受政府指导自由解释教义的权利。\n呼吁释放因追求其宗教自由权利（包括持有信仰和从事信仰活动的权利）而被软禁、拘留或监禁的中国公民。此类囚犯包括：索郎拉措（藏传佛教尼姑，2009年被判处10年徒刑，原因是她和其他尼姑举行抗议活动，呼吁西藏独立，祝达赖喇嘛长寿并返回西藏）；赛迪斯·马达钦（天主教上海教区的辅助主教，自从2012年7月公开宣布退出天主教爱国协会以来一直被关押）；王治文（法轮功修炼者，因1999年组织法轮功修炼者和平抗议活动被判处16年徒刑，目前在服刑）；努尔泰·买买提（穆斯林，因在从事宗教活动时涉及“迷信”被判处5年徒刑）；范亚峰（法学学者、宗教自由倡导者和家庭教会领导人，自从2010年11月一直被在家中软禁，原因是他为未注册基督教团体倡导权利，适逢一次对维权人士的大规模镇压）；以及本报告和委员会政治犯数据库中提及的其他囚犯。\n呼吁当局允许中国律师自由承接与宗教自由有关的案件。\n呼吁官员们取消针对宗教和精神运动的刑事处罚和行政处罚，这些处罚手段被用来处罚行使宗教自由权利的中国公民。特别是呼吁官员们废止《中华人民共和国刑法》第300条（该条把利用“邪教”破坏国家法律实施定为犯罪）和《中华人民共和国治安管理处罚法》第27条（该条规定对组织或煽动其他人从事“邪教”活动或“冒用宗教名义”扰乱社会秩序或损害他人身体健康的人员进行拘留或罚款）。\n促进法律交流，安排中国专家访问美国和美国专家访问中国，以增进对有关保护宗教自由的国际人权准则的了解。促进与中国知识分子讨论宗教自由问题的文化交流。支持非政府组织收集关于中国宗教自由状况的信息和告诉中国公民如何维护其宗教自由权利。支持帮助因行使宗教自由权利而被判刑或劳教的公民就刑期判决和劳教命令提出上诉的组织；质疑政府没收财产的做法；质疑基于宗教信仰的就业歧视。\n会同尊重宗教自由并与中国有贸易关系的国家的政府，倡导在中国实行宗教自由。\n\n## 少数民族权利\n\n### 调查结果\n\n• 在2013报告年度中，少数民族根据《中华人民共和国民族区域自治法》和国际法享有的权利面临挑战。当局对被视为有可能威胁“稳定”的群体施加了最严格的控制，其中包括西藏自治区（简称“西藏”）及其他藏族自治地区、新疆维吾尔自治区（简称“新疆”）和内蒙古自治区（简称“内蒙”）。当局继续拘留、骚扰和监禁从事和平抗议活动和寻求弘扬其独特文化特征的少数民族维权人士。\n\n• 政府当局继续实施要求牧民和游牧民迁居至城市地区或人口密集的大型农村社区的草原政策，把这种要求描述为改善蒙古人、藏人、哈萨克人及其他少数民族群体的生活并使之“现代化”以及防止草原退化的努力。\n\n• 在2013年的几次事件中，蒙古族牧民抗议政府收取牧场用于军事目的和私人开发项目。安全人员拘留和殴打了一些牧民，并为抗议活动设置障碍。\n\n• 官方的内蒙草原政策的批评人士对采矿活动的增加以及因此造成的水源损失和有毒废水表示关切。\n\n• 在2013报告年度中，当局继续非法关押蒙古维权人士哈达，拒绝为其严重的精神健康问题提供治疗。内蒙呼和浩特市当局更加严密地限制哈达的妻子新娜和他们的儿子维勒斯的迁徙和通讯自由。\n\n• 2013年4月，当局逮捕了在一所医药学校曾担任校长的巴图张嘎。自从2011年1月以来，他一直在内蒙鄂尔多斯市受到监视居住。当局声称巴图张嘎试图与他的妻子和两个孩子一道逃出中国。巴图张嘎曾于2009年组织示威活动，抗议政府没收校园财产。据报道，2013年4月逮捕巴图张嘎后，当局命令他开始服刑，他被判处三年监禁。\n\n• 据报道，2013年7月4日，内蒙锡林郭勒盟东乌珠穆沁旗当局以欺诈罪名逮捕了色恩道，他曾经倡导蒙族牧民的权利。据报道，其家人说在被关押期间他的健康状况恶化。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持关注中国少数民族人权状况的非政府组织，使得它们能够继续从事研究，制定项目帮助少数民族增强保护自身权利的能力。鼓励此类组织制定培训计划，推动在促进经济发展的过程中向少数民族社区咨询和鼓励他们参与；制定项目保护少数民族的语言、文化和生计；制定项目记录内蒙古自治区、新疆维吾尔自治区、西藏自治区及其他少数民族自治地区的人权状况并调查侵权行为。\n支持法治项目和交流项目，帮助中国领导人了解保护少数民族权利的不同的治理模式，允许少数民族按照中国法律和国际人权准则对自身事务行使实质性自治权利。\n呼吁中国政府审查现行草原政策在防止环境退化方面的有效性，并采取步骤确保牧民的权利也受到保护。\n呼吁中国政府调查在内蒙采矿活动造成的地下水损失以及有毒废水。确保在该地区经营业务的矿业公司遵守国家环境法规。\n呼吁中国政府释放因倡导少数民族权利而被拘留、监禁或以其他方式羁押的人士，包括蒙古族维权人士哈达、前医药学校校长巴图张嘎、牧民权利倡导者色恩道、以及本报告和委员会政治犯数据库中提及的其他囚犯。\n\n## 计划生育\n\n### 调查结果\n\n• 2013年3月，中国新领导人宣布了一项国务院机构改革和职能转变方案，其内容之一是合并国家人口和计划生育委员会（简称“人口计生委”）和卫生部。此项重组把原有两个部门的大多数职能合并，组建新的“国家卫生和计划生育委员会”，但是把制定人口发展政策和战略的职能（原来属于人口计生委）转移至国家发改委。此等变化对中国计划生育政策及其实施的全面影响尚有待观察。在此期间，政府领导人、专家、学者和公民在本年度继续呼吁人口政策改革。\n\n• 中国政府官员继续实施干涉和控制中国公民——特别是妇女——生育选择的计划生育政策。官员们采用多种手段——包括罚款、拒绝提供社会福利和许可证、强制绝育、强制堕胎、任意拘留——处罚违反政策的人员。\n\n• 《中华人民共和国人口与计划生育法》不符合国际协议中的准则，包括1995年《北京宣言》和1994年开罗国际人口与发展会议《行动纲领》。对中国妇女及其家庭施加的控制以及该制度带来的其他侵权问题——从强制堕胎到针对“计划外”儿童的歧视性政策，还违反了《儿童权利公约》和《经济、社会、文化权利国际公约》中的准则。中国是这些条约的缔约国，并承诺拥护这些条款。\n\n• 中国法律禁止官员们在实施计划生育政策时侵犯公民权利和利益，但没有界定何为权利或利益。对于要求或实施强制堕胎的官员，中国法律没有规定处罚措施。中国31个省级行政区中有至少22个制定了明确支持强令堕胎计划生育法规，并把该手段用作官方政策工具，这个工具常常被称为“补救措施”。\n\n• 中国政府的计划生育政策使中国面临的人口挑战继续恶化，该挑战包括人口老龄化、工作人口减少和男女比例失调。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n敦促中国政府抓住政府重组——特别是人口计生委和卫生部合并——的机会，废止限制性的计划生育政策和人口控制措施，开始采用基于人权的方法，为全体公民（特别是妇女）提供更大的生育自由和隐私权。\n敦促中国官员重新评估《中华人民共和国人口与计划生育法》，使之符合国际协议中的准则，包括1995年《北京宣言》和1994年开罗国际人口与发展会议《行动纲领》以及《儿童权利公约》和《经\n\n经济、社会、文化权利国际公约》。\n敦促中央和地方政府有力执行中国法律中有关处罚在实施计划生育政策时践踏公民权利的官员及其他人员的条款，明确界定这些权利的范围。敦促中国政府针对实施强制堕胎和强制绝育（这些做法在中国依然持续）或其他侵权行为的官员及其他人员制定处罚措施，包括具体的刑事和经济处罚。敦促中国政府禁止利用物质、晋升和经济激励机制（包括正面和负面机制）鼓励官员在实施计划生育政策时采用强制和非法手段。\n支持制定法律援助和培训项目，加强国际合作，帮助公民就官员们在实施计划生育政策过程中的违反人权行为所造成的伤害根据《中华人民共和国国家赔偿法》向政府寻求赔偿和其他补偿。\n\n## 居住和迁徙自由\n\n### 调查结果\n\n• 中国政府继续执行1950年代建立的户口制度。该制度限制了中国公民自由决定其居住地点的权利。户口制度把中国公民划分为农村人口或城市人口，并基于这种划分决定公民享有的法律权利和社会服务。户口制度歧视迁移至城市地区的农村人口，拒绝为他们提供同等的公共服务和社会保障福利以及同等的社会、就业和受教育机会。在过去一年里，这种歧视在就业和享受城市高等教育机会方面特别普遍。\n\n• 中国的高层和地方政府官员继续强调户口改革的必要性，包括李克强总理，他于2013年5月宣布，将于2013年年底前出台的城镇化方案将澄清拟议中的户口改革的时间安排。改革措施可能包括土地管理改革、改善公共服务和社会保障系统、农村人口城镇化、以及澄清城市户口的申请标准。\n\n• 例如，一些地方政府建议或实施的政策将废除户口划分，把所有的人包括在同一个户口类别内；增加农村流动人口的子女在城市地区参加入学考试的机会；建立一个积分指标体系，以便为农村流动人口提供更多公共服务和机会；或授予当地高等院校毕业生城市户口。但是，一些学者和记者对户口改革能否成功不无疑虑，他们指出，地方政府会因大量农村人口进城带来的经济负担和对公共服务和基础设施造成的压力而持反对态度。\n\n• 对于批评政府的公民，中国官员继续剥夺其国际公认的出国权利。在委员会的2013报告年度，有许多关于政治活动人士及其家人被禁止离开中国或被拒发或没收护照的报道。\n\n• 据报道，近年来出国旅行权利受到限制的中国公民人数大幅度增加，人权组织估计受影响的人员至少有1400万人。据报道，受限制最大的是藏人和维吾尔人，美国国务院报告说，这些群体的成员“在申请护照时遇到极大困难”。\n\n• 中国当局继续违反一项国际公认的权利，即“合法处在一国领土内的每一个人在该领土内有权享受迁徙自由……”，作为一种骚扰手段限制了活动人士及其家人的国内迁徙自由。在过去一年中，据报道在政治敏感时期限制活动人士迁徙自由的事件增加。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持从事农民工研究和外展的项目、组织以及与中国决策者和学术机构在这方面的交流，以便促进为农民工提供的法律援助项目，鼓励有关户口制度的政策辩论。\n鼓励美国学术和公共政策机构向委员会咨询，探讨如何接触参加户口制度改革政策辩论的中国学术界人士和公共政策人物。\n向中国政府官员强调，在迁徙自由方面不遵守国际协议将削弱国际社会对中国政府在总体上承诺执行国际准则的信心。\n向中国当局具体提到在迁徙自由方面对维权人士、倡导人士、批评者及其家人的限制，这些人士包括：藏族作家茨仁唯色、维吾尔族学者伊力哈木‧吐赫提、身系囹圄的诺贝尔和平奖得主刘晓波的妻子刘霞、民主倡导者刘贤斌的妻子陈明先等。\n\n## 妇女状况\n\n### 调查结果\n\n• 中国法律，包括经修订的《中华人民共和国妇女权利保障法》和《中华人民共和国婚姻法》，都包含保护妇女权利的条款；但是，由于中央政府立法中的模糊之处和缺乏明确界定的责任，限制了在保护妇女具体权利方面取得的进展。\n\n• 无论是在国内法律和政策措施中还是通过批准《消除对妇女一切形式歧视公约》（CEDAW），中国政府都承诺确保妇女在政府中的代表性。在中国共产党和政府领导人分别于2012年11月和2013年3月换届后，一些党的高层领导机构中妇女的代表性提高，但在另一些机构中降低。在新任国务院领导中，妇女的代表性降低。总体而言，中央政府中的妇女代表性仍然低于中国同意的国际准则。在村一级的决策中，妇女参与程度依然很低，凸显了长期以来人们对保护农村妇女权利和利益的关切。\n\n• 根据《消除对妇女一切形式歧视公约》，中国承诺采取“一切适当措施，消除在就业方面对妇女的歧视”。虽然中国的现行法律——例如《中华人民共和国劳工法》、经修订的《中华人民共和国妇女权利保障法》和《中华人民共和国就业促进法》——禁止就业中的性别歧视，但妇女在招聘、晋升、工资和退休等方面继续受到普遍歧视。\n\n• 尽管中国宪法和《中华人民共和国教育法》禁止性别歧视，但这种歧视在中国的大学中依然存在。全国各地的大学实施性别定额，要想进入某些专业学习，女性的高考成绩必须高于男性。\n\n• 中国关于家庭暴力的国家级法律条款缺乏对家庭暴力的明确定义，没有指明公共部门和私人企业在预防、处罚和 治疗方面的责任。据报道，家庭暴力依然很普遍，受害者包括男性、女性和儿童。最高人民法院（简称“最高法”）拟出台涉家暴刑事案件审理的规范性文件或案例,规范此类案件的审理工作。最高法还建立了几个试点项目，以加强家庭暴力案件的审理程序。虽然国家媒体报道新的家庭暴力立法将在2012年 列入工作计划，但似乎没有向公众公布任何草案。\n\n• 中国法律未能充分界定、预防和惩处针对妇女的性暴力，包括强奸、强迫卖淫和性骚扰。中国的立法没有明确定义性骚扰，也没有规定预防、举报和惩处的具体标准和程序，使受害者在保护自身权利时面临困难。在本报告年度发生了几起被广泛报道的性暴力案件，反映出加强法律保护和提高执法人员意识的必要性。\n\n• 中国各地的官员们在执行国家和地方计划生育政策时继续对妇女采用强迫手段和施加暴力，包括强迫堕胎、强迫绝育和强迫避孕。中国法律未能就此类侵权行为为妇女提供保护。在执行反卖淫法律时，当局也继续对妇女使用暴力和虐待她们。这种做法违反了中国法律。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n通过美中交流和国际会议支持在中国增加妇女政治参与和发挥妇女领导作用的项目。支持增进妇女土地权利（特别是在农村地区）的项目，敦促上级政府加强对村委会的监督，以确保地方规章符合国家法律和政策，充分保护农村妇女的权利和利益。\n敦促中国政府采取步骤忠实地执行《中华人民共和国劳工法》、《中华人民共和国妇女权利保障法》和《中华人民共和国就业促进法》中禁止性别歧视的条款。敦促中国各地城市中的官员以地方法规对这些法律作出补充，以处理就业方面各种各样的歧视问题并对违规者进行惩处。支持帮助妇女了解如何在工作场所保护和倡导自身权利和利益的项目。\n敦促中国官员废止大学招生中基于性别的定额，这种定额允许在某些专业领域中优先招收男生。\n敦促中国政府落实已经宣布的计划，完成全面的国家立法，在刑法和民法中明确定义家庭暴力，配置足够的资源，使政府和公民社会组织承担消除家庭暴力的责任，并详细规定对施暴者的处罚措施。敦促官员公布此类立法的草案，以便公众评议。\n敦促中国政府进一步修订《中华人民共和国妇女权利保障法》或完成新的全面的国家立法，明确定义性骚扰，就预防和惩处规定具体标准和程序。支持技术援助项目，提高司法人员和执法人员在对妇女施暴问题上的意识。此类美国技术援助的一个领域可以是制定工作场所规程和举报机制，以确保信息保密，防止报复。\n敦促中国政府制止在实施计划生育政策时采取强制和暴力手段，澄清中国法律中不得以此类手段侵犯妇女权利的条款。针对官员和其他人员在执行计划生育政策时采用强制和暴力手段的情况（包括强制堕胎、强制绝育和强制避孕），敦促中国政府制定处罚措施，包括具体的刑事和经济处罚。\n\n## 人口拐卖\n\n### 调查结果\n\n• 在人口拐卖方面（包括男人、妇女和儿童），中国依然是一个来源地、中转地和目的地。大部分人口拐卖案件属于国内拐卖，其目的是性剥削、强迫劳动和强迫婚姻。关于中国的强迫劳动现象的普遍性并不明了。\n\n• 中国政府在2009年12月加入了《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》（UN TIP Protocol） ，并在此后采取了一些步骤修订立法和更新政策措施。在委员会2013报告年度，国务院发布了一项新的全国反拐卖人口行动计划，该计划看来在术语和目标方面有所改进，明确规定了负责实施的政府机构。但是，当局能否向地方政府提供足够的资源和培训来实施计划目标仍然有待观察。\n\n• 由于中国法律并不把人口拐卖与人口走私、非法收养及儿童拐骗区别开来，关于本报告年度中政府调查和起诉的人口拐卖案件并无准确的官方统计数字。中国当局与国际组织合作，采取步骤改进了人口拐卖受害者的保护、服务和护理，但其努力继续局限于妇女和儿童。中国当局没有发布已经查明的受害者中有多少人接受服务的详细信息。\n\n• 对于人口拐卖的外国受害者，中国政府在法律上并没有就递解出境提供替代措施，并继续以“经济移民”的名义驱逐朝鲜难民，而不考虑他们是否是人口拐卖的受害者。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n敦促中国政府遵守其基于《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》作出的承诺；使反人口拐卖法律与国际准则一致。特别要敦促中国政府从法律上把人口走私、非法收养和拐骗儿童与人口拐卖区别开来，并扩大人口拐卖的现有定义，以包括各种形式的拐卖，包括对成年男性受害者的犯罪、某些形式的非暴力强迫、以及出于商业目的迫使未成年人卖淫。\n敦促中国政府实施2013–2020行动计划中有关打击人口拐卖的目标，从根本上消除中国人口拐卖的文化和社会原因。上述已经申明的目标包括消除妇女能力低下的传统观念、改善妇女教育、确保农村妇女的财产权。\n呼吁中国政府为人口拐卖受害者提供更多保护服务。支持扩大为执法人员和庇护所管理者提供的培训项目，以提高意识，改进识别、保护、协助拐卖受害者的程序。支持既帮助人口拐卖的外国受害者又帮助中国受害者的法律援助项目。\n反对继续以“经济移民”的名义驱逐朝鲜的人口拐卖受害者。敦促中国政府履行1951年《关于难民地位的公约》和根据该公约制定的1967年关于朝鲜人口拐卖受害者的《议定书》，从法律上提供遣返的替代措施。\n\n## 在中国的朝鲜难民\n\n### 调查结果\n\n• 在委员会2013报告年度中，中国政府继续拘留朝鲜的寻求政治避难者和难民，并把他们遣返朝鲜民主主义人民共和国（简称“朝鲜”），尽管这些难民被遣返后面临严厉的处罚。根据1951年联合国《关于难民地位的公约》和公约要求制定的、1967年签署的《难民地位议定书》，中国政府有义务不遣返那些由于担心遭受迫害而离开朝鲜或担心返回朝鲜后会遭受迫害的朝鲜难民。\n\n• 在过去一年中，中国政府似乎加强了防止朝鲜难民进入中国的措施，包括据报道加强了朝鲜边境的安全部署和开展新的查找和遣返难民的大规模活动。\n\n• 中国当局继续与朝鲜安全官员合作，允许他们在中国境内运作，逮捕朝鲜难民和干扰那些试图协助他们的组织。2011年，逃入韩国的难民人数为2706人，2012年下降至1508人，降幅为50％。2013年7月，逃入韩国的难民人数略高于2012年同期数字。\n\n• 在中国的朝鲜妇女继续遭受强迫婚姻和出于商业目的的性剥削。中国政府遣返被拐卖的朝鲜妇女的做法违反了1951年《关于难民地位的公约》和根据该公约制定的1967年《议定书》以及《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》（UN TIP Protocol）第7条。\n\n• 在朝鲜妇女和中国男人生育的子女中，有越来越多的孩子在中国生活在没有母亲或父母双缺的家庭中。来自朝鲜的母亲中，在某些情况下一些人被中国当局遣返朝鲜，另一些人逃往韩国或中国其他地区。一些专家和学术研究认为，近年来户口政策发生了很大变化，允许大多数朝鲜妇女在中国生育的子女享受公共教育和社会服务，但是普遍贫困和持续的被遣返威胁使得这些孩子及其家人面临风险。中国政府遣返在中国生育子女的朝鲜妇女的做法违反了中国根据《儿童权利公约》所承担的国际义务，因为该公约禁止把母亲与其子女分开。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n在与中国官员的双边会谈中——特别是美中人权对话中——提出朝鲜难民问题。\n支持联合国难民事务高级专员办事处（UNHCR）的努力，以便办事处人员在不受阻碍的情况下接触在中国的朝鲜难民。鼓励中国政府与办事处协作，制定和实施全国性的避难法律，以履行中国根据《1951年公约》及其《议定书》所承担的义务。敦促中国政府立即停止拘留和遣返在中国的朝鲜人。\n敦促中国官员为与中国公民结婚的朝鲜妇女提供居民身份和有关社会福利。并敦促中国政府为更多朝鲜难民提供庇护所和安全的中转途径，直至他们抵达第三国。\n敦促中国官员履行《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》（第9条）和《消除对妇女一切形式歧视公约》（第6条）规定的义务，起诉中国东北以及靠近朝鲜民主主义人民共和国边界地区的人口贩子。\n支持联合国朝鲜人权问题调查委员会的工作，记录朝鲜违反人权的行为，确定这种行为在何种程度上属于对人类犯罪。\n\n## 公共卫生\n\n### 调查结果\n\n• 在2013报告年度，随着3月爆发H7N9禽流感，中国政府对公共卫生事务的监督和应对成为人们关注的焦点。国际卫生组织赞扬了中国在这次爆发中采取的有效措施以及中国在2003年“非典”爆发以来的十年中在建立紧急应对结构方面取得的进展。2013年公布的两项研究以统计数字证实了中国的环境污染和不利健康影响之间的联系，包括癌症发病率升高和预期寿命缩短。中国公众对政府保护公众健康和监管食品和药品安全的能力表示关切。\n\n• 作为2013年3月全国人民代表大会和中国人民政治协商会议期间宣布的大规模政府重组的一项内容，卫生部（MOH）和国家计生委合并为一个机构，即国家卫生和计划生育委员会。一些医学界人士对这一名称变化以及宣布前缺乏磋商表示不满。原卫生部副部长黄洁夫指出，合并后的机构名称可能使中国“在国际交流中遇到困难”，因为国际上对中国的计划生育政策存在争议。\n\n• 中国的第一部《精神卫生法》（MHL）于2012年10月通过，并于2013年5月1日生效，其宗旨是“使更多人能够获得精神卫生服务”。另一项重要目标是防止“被精神病”，中国执法人员曾经使用该手段强迫拘留上访人员及其他人员并把他们送入精神病院。国际组织和中国公民社会组织以及维权人士指出，新的《精神卫生法》中有一些条款存在问题，可能导致践踏人权的现象持续。\n\n• 2013年2月，作为通过持续立法增进残疾人权利的一项工作，中国政府公布了《残疾人教育条例》（1994）修订草案，供公众评议。公民社会组织认为，对一些语言需要更准确的定义，内容上亦需要作进一步修改，以符合联合国《残疾人权利公约》中的人权准则。中国已经签署并批准了该公约。\n\n• 中国的现行立法框架禁止在就业、医疗和教育等方面基于健康状况进行歧视，但是，由于法律没有得到有效执行，国家法律和地方规章不一致，歧视现象依然普遍存在。维权组织和非政府组织继续请求对公务员和教师招聘的身体状况标准进行修订，现行标准使残疾人和某些传染病病毒携带者无法达到资格要求。广东省于2013年5月删除了教师身体状况标准中的歧视性条款，受到残疾人维权人士的赞扬。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n赞扬中国政府有效地应对H7N9禽流感爆发，并敦促其公共卫生及食品和药品安全部门在应对传染病爆发和其他公共卫生紧急事件方面保持高度警觉和透明度。加强支持美国疾病控制与预防中心与中国进行技术交流，交流内容不仅包括疾病监测和应对，而且包括环境与卫生监测和应对机制。\n鼓励倡导消费者食品和药品安全权利、公共卫生和残疾人权利的非政府组织（NGO）和媒体群体的发展。支持增强此类非政府组织的技术能力和运作能力，为它们提供机会参加关于卫生、食品安全和受教育权利的国际论坛。\n敦促中国政府监督《精神卫生法》的实施，确保上访人员和其他人员不再“被精神病”和强迫送进精神病院。向中国公民社会组织、倡导者、法律组织和医学组织提供培训、调查和公布调查结果需要的资金及其他支持，以便它们追踪《精神卫生法》的实施。\n呼吁中国政府在修订《残疾人教育条例》过程中允许残疾人及其代表和残疾人权利组织（不一定隶属于中国残疾人联合会）参与。敦促官员确保修订条款符合联合国《残疾人权利公约》规定的“合理便利”和“全纳教育”标准以及其他国际公认的准则。适当时向中国官员介绍美国在促进残疾人受教育权利方面的长期经验和努力（包括法律、监管和非政府途径）。增加实地考察及与中国官员的其他交流，使他们有机会观察并与美国残疾人权利组织、律师、美国教育部和其他确保残疾人受教育机会的美国联邦州政府机构交换想法。\n敦促中国官员关注法规条例的有效实施，禁止在就业、医疗和教育等方面基于健康状况进行歧视，并确保残疾人享有一个无障碍的环境。向中国官员了解残疾人维权人士索取公开政府信息受到拒绝的情况。\n\n## 环境\n\n### 调查结果\n\n• 在委员会2013报告年度，尽管取得了一些进展，但污染问题依然很严重，污染造成的经济代价不断增大。新闻报道和其他报告突出描述了重大冬季空气污染事件、地下水污染和土壤污染带来的挑战、有毒化学品和“癌症村”之间的联系、以及污染工业迁往西部和较贫困地区带来的问题。与土壤污染相比，在空气和地下水污染问题以及有毒化学品方面当局的透明度较高。\n\n• 在本报告期内，当局继续制定一个解决环境问题的监管框架，尽管该框架存在很大局限性。中国领导人高调表示，环境保护是中国的“四项基本原则”之一，党的领导人把对“生态文明”的承诺纳入了党章。但是，经济发展依然是“核心关切”。当局先后发布了《环境保护法》修订草案的两个版本，邀请公众建议。草案包含一些旨在提高透明度和官员问责性的激励机制。环保组织、专家和环保部指出了草案的其他一些问题，包括环境公益诉讼和许多其他问题。当局似乎重启了一度陷于停顿的修改《大气污染防治法》的努力，并试图起草一部主要的国家土壤污染法律。另外，国务院颁布了十项空气污染政策和重点区域大气污染防治\"十二五\"规划。\n\n• 在该领域中建立法治依然面临重大挑战，包括违反法律、执法不力或任意执法、优先经济增长的评估标准、腐败、缺乏监督、软弱的环境保护机制、以及没有足够的环境追踪和处罚措施。6月份的《环境保护法》修订草案规定，只有政府支持的中华环保联合会有资格提出公益诉讼，致使制定环境公益法的努力陷入停顿。在环境案件中，法律救济依然没有保证，其原因有多种，包括法院不愿立案、律师对承接案件不无疑虑、调解缺乏强有力的法律基础、以及当事方可能被强迫接受调解协议。公民继续通过诉诸街头的方式寻求解决其冤屈。\n\n• 在本报告年度，中国公民倡导改进环境质量，但是，在寻求保护其权利或调查污染指控的过程中，一些人面临拘留（刘福堂）、非法家中软禁（张兵）、官员骚扰（陈余千和内蒙牧民）以及身份不明者的殴打（一名环境记者）。官员们还询问环保人士，采取非常措施防止反污染示威，删除互联网帖子，包括批评规划中项目的帖子。\n\n• 在2013报告年度，公民呼吁提高环境问题透明度，环境当局也发布了新的内部规则，以求改进主动披露环境影响报告书简本和其他信息的做法。一些市政府开始使用经修改的空气质量指数公布PM 2.5和空气质量数据。尽管采取了这些新规则和措施，当局在公布信息方面仍然有很大的随意性，而且信息审查也在持续。一项研究表明，虽然有更多环境主管部门对信息公开申请作出应答，但与上一年度相比在更多案例中披露的信息较不全面。\n\n• 草原牧民迁居项目据说旨在防止草原退化，促进牧业现代化，但在一些情况下迁居并非自愿。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n呼吁中国政府停止处罚从事草根环保倡导活动、调查污染事件、或利用官方渠道或正式渠道表达与环境有关的冤情或保护自身权利的公民。支持中国团体和在中国的美国团体提高公民的环境权利意识，促进对这些权利的保护。把环境法问题纳入双边人权对话和法律专家对话。另外，把人权视角纳入新成立的中美气候变化工作组有关气候变化的讨论。\n支持就环境法规的执行和实施工具进行多边交流，此类工具包括环境保险、市场机制、对严重违反环境法律者追究刑事责任、公益诉讼机制等。鼓励中国领导人加强环境影响评估程序以及公民对此类程序的参与。与中国官员以及寻求为污染受害者制定公平赔偿制度的其他人士接触。\n支持在中国继续扩大环境信息公开范围。介绍美国政府通过“有毒物质排放清单项目”和其他旨在提高环境透明度的项目所积累的经验。支持帮助中国公民了解中国的政府信息公开系统的项目。另外，继续美国政府与有关个人和组织的接触，共同努力使中国增强能力，改进战略与方法，可靠地测量、报告、发布、核查减排信息。\n鼓励中国环保领域非政府组织的发展，包括在双边项目中鼓励美中两国的非政府组织共同参与。支持加强中国环保领域非政府组织技术和运作能力的努力。\n敦促中国当局终止强迫牧民迁移的做法，根据国际科学与人权规范执行迁移项目。在这方面，敦促当局考虑下列文件中提出的建议：《2012年食物权问题特别报告员提交的报告》；《向联合国人权事务高级专员办事处提交的有关对中国访问的报告，增编》。\n\n## 公民社会\n\n### 调查结果\n\n• 中国有数百万公民社会组织，为倡导公共利益、提供社会服务、组织休闲活动、促进农业和商业发展作出贡献。在政府注册的非政府组织（NGO）是公民社会组织中的一部分。许多非政府组织作为工商企业注册或由于限制性监管环境而没有注册。中国也有个人倡导者和非正式网络介入公共利益问题。\n\n• 在2013报告年度，中国政府和共产党的政策文件重申了政府和党对“社会组织”（这是对非政府组织的常用称呼）的领导以及对其发展的控制。中国学者发现，非政府组织受到不同的待遇；政府愿意支持被认为支持经济增长或提供社会福利服务的组织，但继续骚扰倡导政府视为政治敏感的问题或事项的团体和个人。\n\n• 据人权组织报告，从2013年春季起对维权人士开始了一场打压活动，其中一些人与“新公民运动”有关联，这是一个由个人组成的松散网络，就一系列问题展开倡导活动，例如政治和法律改革、人权和社会公正。7月，北京市民政局取缔了从事公共利益研究的智库传知行社会经济研究所，据报道原因是该研究所没有作为非政府组织注册。\n\n• 政府承诺在2013年年底前颁布期待已久的改变监管措施，改变社会组织注册和管理的法律框架，包括许可直接注册，即允许组织在没有事先找到政府或准政府主管单位的情况下在民政局登记。但是，直接注册将仅限于工商业协会、科学技术组织、慈善组织和社区服务团体。政治、法律和宗教组织以及在中国设立办事处的外国非政府组织依然需要有主管单位，在现行“双重管理”体制下运作。\n\n• 作为发展“非国家服务部门”的一项措施，中国的中央和地方政府部门拨出资金从非政府组织采购服务。学者和公民社会专家感到关切的是，涉及非政府组织的政府采购监管框架缺乏完整性和一致性，在服务供应者选择、合同实施和项目监督方面造成了问题。\n\n• 在中国公民看来，中国政府管理的慈善机构——例如中国红十字会——是否值得信任依然是一个问号，原因是有报道说此等机构使用捐款不当以及财务报告缺乏透明度。这种不信任使得民间（非政府）慈善组织受益，这一点从2013年4月四川地震时它们收到的大量捐款中可以看出。据报道中国政府正在制定一部全国性《慈善法》，但尚未公布草案供公众评议。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n敦促中国政府修改有关在中国社会组织的监管框架，根据《公民权利和政治权利国际公约》第22条规定的自由结社权利允许所有非政府组织（NGO）从规划的改革中受益。向中国当局强调结社自由包括在一系列问题上倡导公共利益。呼吁中国政府停止骚扰从事权利保护和公共利益倡导的非政府组织和公民社会活动人士。\n鼓励中国政府就政府向非政府组织采购社会服务的实施和监管建立公平、透明的框架。适当时支持技术交流，邀请中国的中央和省政府官员访问美国，观察美国联邦和州政府在采购非政府组织服务方面的做法。\n采取措施促进作为非政府组织成员的中国公民参加有关国际会议和论坛，支持在美国提供更多培训机会，帮助他们增强在非营利组织管理、公共政策和公共利益倡导等方面的领导能力。进一步支持与中国非政府组织进行项目合作的美国组织，帮助中国公民社会组织进行能力建设。\n\n## 民主治理机构\n\n### 调查结果\n\n• 在2012年11月召开的中国共产党第十八次全国代表大会上完成了党内重大政治权力的交接，这种交接每十年进行一次，在一个不透明的程序中把广泛的权力移交给略为年轻的新一代政治领导人。党的总书记和国家主席习近平似乎在上任后的最初几个月采取了迅速行动，推行他的议程和展示其领导风格。一些国际和中国学者、记者和评论员认为，在新一代最高领导人领导下，看来中国的政治改革前景黯淡。\n\n• 十八大对党章作了修改，把“科学发展观”（前总书记胡锦涛提出的社会经济理论）纳入党章，宣布“中国特色的社会主义”是中国取得所有成就的原因，重申“改革开放是强国之路”。\n\n• 在十八大之后，2013年3月进行了政府换届，党的最高领导人在中国政府中就任领导职务。新任政府领导人公布了国务院 “机构改革和职能转变”的方案，其目标包括提高政府效率、实行有关“大部制”的改革、处理政府与市场、政府与社会、中央和地方的关系。\n\n• 中国的政治体制不符合《公民权利和政治权利国际公约》第25条定义的准则，虽然中国领导人已经签署该公约并宣称有意批准。中国的政治体制亦不符合《世界人权宣言》所陈述的准则。共产党继续全面控制政治事务，仅仅允许独立的政治力量有限地参与。共产党还控制法院、全国人民代表大会、新闻媒体以及国家领导人的任命。在地方人大选举中，官员们采取多种其他措施防止独立候选人被提名或当选为人大代表。另外，官员们制定了有关全国人民代表大会代表的特征和人数的要求。在本报告年度，党试图对大学生团体以及非政府和准政府组织施加更大的影响。另外，一些变化表明新的党中央正在加大力度控制意识形态领域的潮流。\n\n• 当局继续拘留和逮捕行使中国宪法和国际人权准则所保护的言论、集会、结社和示威自由的倡导民主的人士，并把一些人判处徒刑。在本报告年度，当局继续拘留倡导民主的人士或将他们判刑，包括曹海波和刘本琦。近年来被判处长期徒刑的其他倡导民主的人士继续被监禁，包括陈卫、陈西、李铁、朱虞夫、薛明凯、刘晓波、刘贤斌、郭泉、周永军、谢长发和黄成城。\n\n• 虽然中国高层领导人表示支持提高透明度，公民在获取信息方面继续面临挑战。例如，当局对索取定于2013年10月向联合国人权理事会提交的对中国人权状况的定期普查报告的信息的公民进行压制。据报道，一些个人因索取信息而被骚扰、禁止离家、拘留或正式逮捕。\n\n• 当局已经制定或正在起草的一些重要法律涉及公民向政府官员问责的机会和方式，此类法律包括《中华人民共和国民事诉讼法》、《中华人民共和国行政诉讼法》和《中华人民共和国行政复议法》。国务院公布了继续加强以行政手段执行法律和政策的计划，其具体做法包括在地方一级促进行政评估系统和加强支持“执法责任制”。中国领导人和公民继续对腐败表示关切，据报道许多国内外工商界人士认为中国的法律环境恶化。最高领导层把党的正统地位与其治理腐败的能力联系起来。当局继续发布制止腐败的监管措施。2013年9月，一家法院以腐败罪名判处前中央政治局委员和重庆市委书记薄熙来无期徒刑。但是，中央领导人尚未完全支持高层领导人披露资产的要求，并且依然不允许民间自发的反腐努力。在公众强烈要求政府官员披露资产的呼声中，当局动用刑法拘留或逮捕了数十名公开呼吁最高领导人披露资产的倡导人士，包括孙含会、丁家喜、侯欣、袁冬、张宝成、马新立、刘萍、赵常青、王永红等反对腐败人士。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n采取主动步骤与新任中国领导人接触以及建立关系，了解他们在中国未来的治理计划。在高层立法机构之间展开对等交流，就国家立法机构的运作及美中政治制度交换信息和举办培训。支持对党和政府权力交接以及国务院机构重组的影响进行研究，并广泛发布研究结果。支持揭示中国共产党结构、功能和发展的美国研究项目，包括党组织在政府机构内部、中国的立法机构、新闻媒体、非国有公司、及社会组织（非政府组织、基金会和非营利组织）中扮演的角色。敦促中国官员进一步提高党内事务的透明度。\n呼吁中国政府释放因行使自由结社和集会权利、从事和平示威、呼吁披露官员个人资产或呼吁在中国实行政治改革而被拘留或监禁的人士。这些被监禁的人士中有一些人与“新公民运动”有关联，另一些是因倡导民主而被判处长期徒刑的人士。\n支持寻求与中国地方政府和非政府组织协作加强透明度和问责性的美国或中国组织的项目，特别是扩大和改进中国的政府信息公开制度的努力。此类项目可能包括推动在基层更好地宣传政府信息公开（OGI）条例以及就利用该条例申请信息开展培训的共同努力。鼓励党和政府官员确保法规、规章和政策公开。另外，支持就自下而上的机制交流信息的项目，以便对政府和党的官员进行评估和问责、强调效率和问责之间的联系。\n支持协助地方政府、学术界和非营利组织增加透明和公开的听证会及公民参与决策程序渠道的项目。此类项目可能包括在中国进行的一些试点，把公民就法律、法规或政策草案对当局提出的建议向公众公开。\n\n## 商业领域的法治\n\n### 调查结果\n\n• 中国政府和共产党继续鼓励国家对外向型投资进行协调，作为 当局通常称为“走出去”战略的一部分。当局继续鼓励中国企业通过对外投资增加机会，以便朝着价值链的上游移动。作为“走出去”战略的一部分，当局锁定“具有战略意义的”行业，例如能源、金属、先进技术和“知名品牌”。\n\n• 过去一年中，当局采取措施改革中国的银行系统，银行继续优先为国有企业提供贷款。中国人民银行取消了一个贷款利率下限，但保持了支付储户的利率的上限。新闻媒体指出，这种做法可使国有企业获得成本较低的贷款，减少小银行的利润，限制家庭积累储蓄的能力。\n\n• 过去一年中人民币升值，但美国财政部报告说，其“估值依然显著偏低”。一些中国官员呼吁在汇率政策上更多发挥市场的作用，但是中国政府继续通过累积外汇储备干扰汇率。\n\n• 在2013报告年度——即中国加入世贸组织（WTO）十余年之后——中国继续面临违反世贸组织义务的指控，包括违反世贸组织义务征收反倾销和反补贴关税和提供补贴。自从加入世贸组织以来，中国已经在31起世贸组织争端解决案件中作为被告；过去一年中，世贸组织在三起美国诉中国的案件中裁定美国胜诉，另外还在一起欧盟诉中国的案件中裁定欧盟胜诉。\n\n• 在过去一年中，中国政府继续采取步骤增强知识产权（IPR）保护，但是，由于保护措施和执法不力及其他原因，继续造成对知识财产的盗窃。在过去一年中，盗窃商业机密的情况持续存在，据报道在有些案件中盗窃系受到政府的授权，其中一个案件涉及人民解放军下属的一个组织，该组织窃取了大量数据。另外，中国官员继续以技术转让作为市场准入的先决条件。\n\n• 在过去一年中，商务部公布了两个新的规章草案供公众评议：《经营者集中附加限制性条件的规定（征求意见稿）》和《关于经营者集中简易案件适用标准的暂行规定（征求意见稿）》。据报道，这两个文件旨在澄清和精简企业合并审批程序，但专家评论员对其在实际应用中能否取得这种效果表示怀疑。\n\n• 在过去一年中，中国各地继续发生食品安全丑闻，有害和非法中国产品继续得以出口。在三个月期间，中国当局拘留了904名据信涉嫌以老鼠、貂和狐狸肉假冒羊肉出售的人员。在六个星期内，香港当局拘留了879名据信涉嫌从香港往中国大陆走私配方奶的人员，因为消费者对中国大陆的配方奶仍然感到不无疑虑。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n制定和支持一个项目，调查中国的产业政策对中国经济的影响，包括这些政策的制定及其对中国经济的指导作用如何影响透明度、法治、以及中国履行其国际承诺的状况。\n把商业领域的法治、投资补贴和对行使法律权利者实施报复等问题纳入美中战略与经济对话及与中国进行的其他商务对话、谈判和交流。通过美国财政部、美国金融监管机构和小企业局扩大与中国在金融行业改革问题上的对话，例如为小企业提供资金、腐败、补贴和纳税人问责。另外，必要时继续通过世贸组织机制行使美国的权利。就中国提供补贴一事（包括未能报告补贴情况）向世贸组织提交反通知。\n通过美国贸易代表和美国商务部为一方、中国商务部、国家发展与改革委员会和国有资产监督管理委员会为另一方的双边对话，了解在美国的中国投资（不包括金融产品）的详细数额——包括这些投资在不同经济部门之间的分布——中国当局审批此类投资时参照的标准、以及此类投资的资金来源。\n支持能力建设项目，帮助中国知识产权监管人员了解美国在知识产权保护方面的最佳规范。向中国官员了解中国政府当前改革知识产权法律法规以及制止知识产权盗窃（包括网上盗窃）的措施，包括其总体目标和时间表。支持一个对中国知识产权盗窃为美国经济造成的损失进行定量分析的项目，更加有力地调查中国境内的具体公司、组织和实体与盗窃美国知识财产的具体事件之间的联系。在项目执行过程中注意保护公司的隐私权和机密，并提供激励机制，以鼓励这些公司参与其中。\n加强和扩大能力建设项目，帮助中国食品安全监管人员了解美国在食品安全方面的最佳规范。通过立法授权美国食品和药物管理局在中国增设办事处和增派检查员；支持美国检查员、生产者和食品安全专家在中国举办的培训项目；确保从中国出口至美国的受监管产品经过中国有关部门的认证。\n\n## 司法公正\n\n### 调查结果\n\n• 据报道，在2013年1月的一次会议上，中共中央政法委员会新任书记宣布了改革司法部门、劳动教养（RTL）、信访和户口制度的方案。在2013报告年度，公众要求改革劳教制度的呼声特别强烈，但是，观察人士担心任何改变只是名义上的改变。\n\n• 在2013报告年度，据委员会观察，中国政府和共产党在党的第十八次全国代表大会之前和会议期间广泛采用了“维稳”措施。据报道，党政官员下令把维权人士、上访人员和法轮功修炼者——包括毛恒凤、裴富贵、崔福芳、童国菁、沈永梅、沈连满和秦尉 ——送往劳教，以实现“零上访”，防止在此期间在北京发生抗议活动。\n\n• 和往年一样，维权律师继续受到骚扰，中国政府采用了多种措施恐吓律师，包括吊销执照、监视和非法拘留。知名维权人士高智晟和倪玉兰仍在服刑，对他们的量刑十分严厉；2013年8月，当局逮捕了维权人士许志永，此前的几个月他一直被“软禁”和刑事拘留。\n\n• 官方来源报告说，中国在2012年接受法律援助的人员超过一百万，比2011年增加了21％。多年来，中国政府稳步增加了法律援助资金，据报道2012年的增幅接近10％。修订后的《刑事诉讼法》和相关条例扩大了可接受法律援助的刑事嫌疑人和被告的范围和资格，不过学者们担心是否有足够的人力、资金和机构资源来支持增多的法律援助案件。\n\n• 在2013报告年度，官员们继续骚扰维权人士和政治活动人士的家人。中国当局采用多种方法对付家庭成员，限制了他们自由迁徙、表达和谋生的权利。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n反对继续骚扰维权人士。呼吁释放因捍卫和促进中国公民权利而身陷囹圄的律师、活动人士和被“失踪”、羁押、在家中非法软禁或以其他形式法外拘留的其他人士，包括许志永、高智晟、倪玉兰以及本报告和委员会政治犯数据库中提及的其他人士。对于因承办被官员视为“敏感”的案件在2013年和以往年份中被拒绝更新执照的律师事务所和律师，敦促中国政府更新其专业执照。\n追踪中国政府已经申明的改革劳教和信访制度的计划，向中国官员询问改革的实质内容、时间表和评估进展的标杆。建立独立评估机制，以便公民社会代表、维权人士和公共利益律师参与。\n对持续骚扰和虐待上访人员和维权人士的家人表示反对。呼吁停止剥夺他们的权利（包括拒发护照）、施加暴力和拘留这些家庭成员，例如诺贝尔和平奖得主刘晓波的妻子刘霞、知名法律倡导者陈光诚的侄子陈克贵、维吾尔维权人士热比娅·卡德尔的儿子阿不力克木·阿布都热依木。\n加强支持美国国务院的国际访问者领导力项目及其他类似双边交流项目，邀请中国的人权律师、公共利益倡导者和学者前来美国参加学习和对话。进一步支持非政府组织和学术界与中国人权律师和公共利益法律组织开展法律研究和交流项目以及与中国官方司法机构开展的旨在促进司法独立的技术交流和培训项目。\n鼓励中国政府（特别是司法部和教育部）拨出更多资金用于地方律师协会和法律诊所开展的法律教育项目，为法律和公共利益打下较为坚实的基础，加强法律培训，为残疾人、上访人员、因遭受家庭暴力而寻求法律保护的人员（包括儿童）以及其他面临风险的群体提供法律援助服务。\n\n## 新疆\n\n### 调查结果\n\n• 2013年春季和夏季在该地区各地发生的冲突导致大批人员死亡，据报道死亡总人数为几十人至一百人，甚至更多，令人对新疆维吾尔自治区（简称“新疆”）的民族政策未能触及地区的动荡根源感到关切。海外媒体和人权组织报告说，在一些事件中安全部队对维吾尔人群开枪，造成人员伤亡。在一些事件中，据报道新疆的维吾尔居民袭击了安全部队、社区工作者和其他人员并造成死亡。\n\n• 据报道，当局为了“维稳”在整个地区对居民住所进行了广泛的搜查，并且针对维吾尔人以和平方式表达宗教信仰进行压制。维权人士声称，大范围的安全检查加剧了该地区的紧张局势。\n\n• 新疆当局继续对该地区(特别是伊斯兰教)进行严密的宗教控制，为维吾尔人寻求在国家控制之外从事宗教信仰活动造成困难。当局继续对维吾尔人的和平宗教活动严加限制，并针对某些教徒进行监视。\n\n• 在委员会的2013报告年度，国家主导的开发活动加快进行，吸引了大量国家和私营投资，增加了前往新疆的移民。令人关切的是，开发项目为维吾尔人和该地区的其他少数民族带来的经济、社会和文化机会相对较少，并且开发活动对少数民族的文化和语言造成不利影响。\n\n• 据报道，近年来进入新疆的移民增加，导致在某些地方民族之间更加对立，维吾尔居民对土地权利和就业机会感到担忧。在过去一年中，地区性开发计划使更多汉人移民至新疆，国家主导的项目为移民和来自其他省份的工人提供协助，常常是在以往由维吾尔人和其他少数民族居住的南疆地区。\n\n• 在过去一年中，新疆政府扩大了该地区侧重汉语的“双语教育”，新疆的一些维吾尔学生担心该政策旨在使维吾尔族年轻人融入汉族社会，使他们丧失维吾尔族的特征。在“双语教育”环境中，课堂教学主要用汉语普通话，大体上取代了少数民族语言教学。近年来，一些维吾尔学生和教师对该地区强制推行“双语”课程和维吾尔年轻人丧失维吾尔语言能力表达了关切。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持通过立法增加美国政府提供的资源，提高人们对新疆维吾尔自治区人权状况的意识，保护维吾尔族文化，增加维吾尔人保护自己的人权的途径。\n呼吁中国政府重新审视针对新疆少数民族的官方政策的有效性，停止依赖加强安全措施来解决该地区的冲突。呼吁中国政府以透明方式报告该地区的冲突。\n呼吁中国政府停止在新疆各地对维吾尔居民区的住所进行的广泛搜查，维权人士说这种做法加剧了该地区的紧张局势。\n呼吁中国政府遵守其保证宗教信仰自由的国内法律法规以及保证宗教活动免受国家限制的国际准则。\n呼吁中国政府在新疆受地方开发计划影响的社区支持促进民主决策程序的政策。呼吁中央政府和新疆当局确保平等发展，不仅促进经济增长，还尊重新疆居民的总体公民和政治权利，让这些社区参与民主决策。\n呼吁中国政府在受到开发影响的地区确保少数民族权利，以便他们保护财产和享有平等就业机会。呼吁中央政府和新疆当局制定计划，在移民增加的情况下积极主动地保持和维护维吾尔人和其他少数民族的文化和生计。\n呼吁中国政府就新疆学校（从幼儿园直至大学）要求的教学语言向非汉族家长、教师和学生咨询。呼吁中国官员按照中国宪法第4条和《中华人民共和国民族区域自治法》（简称《自治法》）第10条要求允许家长和学生选择用维吾尔语和新疆通行的汉语之外的其他语言授课。敦促中国官员支持开发维吾尔语和其他非汉语教学材料。\n\n## 西藏\n\n### 调查结果\n\n• 自从2010年1月第九轮对话以来，达赖喇嘛的代表与中国共产党和政府官员之间的正式对话已经停止，这是自从2002年恢复对话以来最长的一次中断。在2013报告年度，委员会没有看到任何迹象表明中方有意恢复对话以探讨中国藏族自治地区藏人的关切。\n\n• 在过去一年中，共产党和政府未能以建设性的方式对藏人的不满作出回应或对藏人拒绝接受官方政策承担任何责任。在委员会的2013报告年度，出于政治和宗教原因的藏人自焚事件更加频繁地发生，在10月至11月——即中国共产党第十八次全国代表大会之前和会议期间——达到高峰，这两个月共有38人自焚。从2012年9月至2013年7月，共有66名藏民自焚（60人死亡）。随着自焚事件日增，当局加强了镇压措施，侵犯了藏人的言论、结社和迁徙自由，限制了他们相互联络和分享信息的能力。自焚趋势也发生了变化。最初，自焚事件主要发生于四川省，大多数事件涉及现在或以往的僧侣，且频率较低，后来的自焚事件日益频繁，大多数发生于四川省之外，大多数自焚者是一般信徒。\n\n• 在过去一年中，自焚的藏人继续呼吁允许达赖喇嘛回归——通过自杀式抗议表达的这一要求可能意味着对中国政府和共产党干预藏传佛教事务的强烈不满。在保持现有压制性政策的前提下，共产党和政府继续采取新的和前所未有的手段控制藏传佛教。从2012年12月起，国家措施要求藏传佛教寺院的老师每五年一次接受党和政府控制的佛教协会的重新评估。评估标准包括热爱中国、拥护党的领导和接受党政机关的指导。重新任命的老师必须签订协议，承认上述义务。官员们把此类政策的结果称为藏传佛教的“正常秩序”。\n\n• 在过去一年中，据报道一些藏人在自焚时呼吁更多使用藏族语言——显然一些藏人认为官方政策对藏族文化的活力和生存能力构成重大威胁。在青海省，数千藏族高校学生举行抗议，抗议的问题包括政府的语言政策，此前当局曾要求学生们学习一份官方手册，而一些学生认为该手册“贬低”藏语和促进使用汉语普通话。一所法院把其中八名学生判处监禁。据报道，在青海、甘肃和四川诸省出现了一些藏人通过民间方式促进藏语的倡议。\n\n• 官员们继续强调经济发展是取得“社会稳定”的关键，即使一些项目引发了抗议或被指控为对当地社区造成损害。一位西藏自治区官员说，拉萨－日喀则铁路到2014年年底通车。官方媒体报道说，从2006年至2012年，西藏自治区政府已经安置（或重新安置）“近210万”藏族农民和牧民，到2013年年底，西藏自治区“所有农民和牧民”都将获得安置。据新闻媒体报道，一座金矿发生山体滑坡灾难；另外，环境污染妨碍了藏人种田和放牧的能力。政府沿着西藏的主要河流修建水电站的计划吸引了媒体和分析家的关注。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n敦促中国政府与达赖喇嘛或其代表无先决条件地进行对话。对话的目的应当包括在西藏自治区（TAR）和青海、甘肃、四川、云南的多个藏族自治州、县保护藏族文化、语言、宗教和传统。随着藏族地区的紧张局势继续升级以及藏人表达对达赖喇嘛的敬仰，中国政府如决定开展对话可能导致对中国政府和藏人双方均有益的长期 结果，并将在今后几十年中增进地方和地区安全。\n敦促中国政府考虑政府监管措施和党的政策在藏人自焚浪潮中的作用。向中国官员指出，如果政府和党以建设性的方法化解藏人的不满情绪，结果可能会对国家安全和社会稳定有利；另向中国政府官员指出，强化使藏人感到不满 的措施和政策不大可能促进“社会稳定”或“和谐社会”。\n告诉中国政府不要扩大干涉藏人宗教事务的管理方法和法律措施，停止侵犯和压制藏传佛教徒的宗教自由权利，向中国政府指出这样做的紧迫性和重要性。向中国政府官员指出，政府通过定期审查和重新任命藏传佛教老师实施控制，并要求他们拥护共产党的领导和接受党政机关的指导，这与国家尊重“宗教信仰自由”的政策不一致；同时指出，通过强力推行监管措施、“爱国”和“法律”教育以及反对达赖喇嘛的运动对藏传佛教徒施加更大的压力可能只会危害“社会稳定”，而不会保持社会稳定。敦促中国政府尊重藏传佛教徒按照藏人自己的方式和传统挑选和教育宗教导师的权利。\n西藏自治区政府主席2010年声称，达赖喇嘛1995年确认的班禅喇嘛更登确吉尼玛（Gedun Choekyi Nyima）当时正在与自己的家人在西藏自治区作为“普通公民”生活，请中国政府就此提供进一步信息。敦促中国政府邀请一个国际组织的代表与更登确吉尼玛会面，以便更登确吉尼玛向该国际组织代表表达自己有关隐私权的愿望；让国际代表与更登确吉尼玛在一起合照；并发布更登确吉尼玛的声明和该照片。\n向中国政府表达尊重和保护西藏文化和语言的重要性。敦促中国官员尊重中国宪法中的言论、结社、集会和宗教自由条款，不要利用安全部门、法院和法律侵犯和禁止藏人行使此类权利，从而增强西藏文化的活力。敦促官员们尊重藏人的愿望，允许在讲授现代学科时使用藏语和汉语两种语言，而不是通过终止现代学科的藏语教学使藏语处于劣等地位。\n鼓励中国政府在规划中国藏族地区的基础设施、自然资源开发以及定居或迁居项目时使充分考虑藏人的观点和意愿。鼓励中国政府聘请相关专家参与评估此类项目的影响，并就此类项目的实施和进展状况向中国政府提出建议。\n增加对美国非政府组织的支持，以制定项目，协助藏人提高和平地保护和发展自己的文化、语言和传统的能力；帮助改善居住在中国藏族地区的藏人的教育、经济、健康和环保状况；给藏人带来可持续的益处，而不要鼓励藏人之外的其他族裔大量涌入这些地区。\n敦促中国政府避免动用安全和司法机构恐吓藏族社区，包括起诉和监禁据称与自焚者有联系或传播自焚信息的藏人。继续向中国政府表达把和平的藏人抗议者和骚乱者区别开来的重要性；谴责利用治安运动压制人权的行为；请求中国政府提供以涉及抗议的罪名和与自焚相关的“犯罪”被拘留、指控或判刑的藏人的详细信息。在与中国官员会谈和通信时，继续提出以和平方式行使人权而遭受监禁的藏人的案例，其中具有代表性的案例包括：僧侣曲因克珠（因印刷传单被判处无期徒刑）、晋美旦增尼玛（被藏传佛教徒视为转世喇嘛，因“煽动分裂主义”被判处无期徒刑，后减为18年）和牧民荣吉阿扎（因在公共庆祝活动中呼喊政治口号被判处八年刑期）。\n\n## 香港和澳门的发展\n\n### 调查结果\n\n• 香港和澳门的《基本法》确认，《公民权利和政治权利国际公约》（ICCPR）适用于这两个地区。香港《基本法》明确规定了普选权，但澳门《基本法》对此未作规定。\n\n• 公众日益要求为普选产生香港特区行政长官（简称“特首”）制定更加具体的计划，下届特首选举定于2017年举行。2013年7月，香港现任特首梁振英拒绝了就选举改革提前进行公众谘询的呼吁。中国大陆的官员和专家们继续劝说澳门不要寻求普选。\n\n• 人们对中央政府可能在普选中干预特首候选人提名日益感到关切，中国大陆的官员们排除了由选民广泛参与的提名程序，声称候选人必须得到中央政府的信任。\n\n• 这一年发生的两起事件凸显了香港的司法和执法独立持续面临挑战。在一个涉及外籍家庭佣工申请香港永久居留权的案件中，香港当局请求香港最高法院就一个关键问题向全国人民代表大会常务委员会咨询。在另一起事件中，尽管美国请求临时逮捕前美国国家安全局合同工爱德华·斯诺登，但他依然获准离开特区。这起事件引发的关切是这一决定是否在中央政府的请求下作出。果真如此，则可解释为中央政府干涉了本来纯属于香港内部的执法事项。\n\n• 香港政府在保持透明度方面取得了曲折的进展。政府搁置了一项可能从监管文件中删除有关公司董事的重要识别信息的议案。\n\n• 虽然澳门放弃了一项富有争议的设立“新闻监管委员会”的计划，但新闻记者的自我审查以及一些媒体与中国大陆的密切关系继续威胁到香港和澳门的新闻自由。\n\n• 据报道，澳门的博彩业涉及广泛的腐败以及利用来自中国大陆的大量资金洗钱。据报道，中国政府和澳门当局加强了对澳门博彩业的监管，以配合更大规模的反腐败运动。\n\n### 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n在与香港和中央政府官员会晤时，敦促在现实许可的情况下尽早由香港当局制定一份包括具体时间表的明确计划，以便在2017年特首选举时采用符合《公民权利和政治权利国际公约》（ICCPR）要求的普选方式，并且在制订计划的过程中允许公众全面参与。在到中国大陆访问时尽量在香港和澳门停留。美国政府代表团在香港举行的会晤应当包括与香港立法会成员、香港政府行政官员、司法机构成员和新闻记者组织代表的会晤。在澳门，代表团应当与澳门立法会成员（特别是直选成员）、澳门政府行政官员及政府之外的领导人会晤。\n支持和鼓励澳门的机构和组织探索追踪和加强民主实践、新闻自由和法治的项目。\n赞扬香港最近在制定公开档案法律的措施中和允许公众查询公司董事识别信息的问题上坚守其透明度承诺，强调透明度在保持公众对企业的信心方面以及美港关系至关重要。\n敦促澳门建立打击洗钱的执法机制，例如冻结可疑资产的机制，制定来访者现金申报要求，降低赌场提交交易报告的最低数额，加强对赌场顾客进行审查的法律要求。"
		},
		{
			"post_id": 12,
			"title": "CECC 2012年中国人权报告摘要",
			"date_published": 1520838564.218,
			"body": "2012 Annual Report Executive Summary Chinese Translation\n\n(2012年年度报告执行摘要中文翻译)\n\n## 概述\n\n过去一年里，两种截然相反的趋势集中反映了中国在人权与法治方面的变化。一方面，委员会注意到中国人民常常冒着很大的风险行使其理应享有的基本自由权利，并要求政府领导人承认这些权利。这一变化并非来自外力，而是源于中国人民自发的行动，它不仅见于为数不多的维权人士的行动，而且在社会各阶层都有显著的表现。与此同时，委员会也看到，在中国人民不断增多的要求和政府满足这些要求的能力及意愿之间存在一个日益加深的断层。在这一年里，重大的内部政治丑闻和领导层的更迭引人瞩目，中国官员似乎更关心‘‘维稳’’和保持现状，而不是回应中国各地基层民众要求改革的呼声。\n\n* * *\n\n公民针对缺乏基本自由和官员滥用权力而举行的抗议活动广泛涉及委员会追踪的各类不同问题，在某些情况下创下了前所未有的先例。2011年末和2012年初，身处困境的中国工人继续举行罢工，并组织起来，要求增加工资和改善工作条件。据报道，爆发了自2010年夏季以来影响最大的一系列示威活动。据委员会记录，在这一阶段内至少有10个省级行政区的多个产业中发生了示威活动。在西藏高原的不同地点发生了多起前所未有的自焚悲剧，反映了共产党和政府进一步压制文化和宗教的做法导致更大的失望。在委员会2012报告年度内，据报有45名藏人因政治和宗教原因自焚（39人死亡），而自2009年2月起总共有50名藏人自焚。在四月、六月和七月，内蒙古自治区的蒙古族人举行了一系列抗议活动，抗议政府和私人开发项目强行占用草场。大批示威者走上街头，抗议强占土地、污染环境和大规模能源项目。从七月至九月，数以万计的香港居民举行抗议活动，抗议一项有争议但受到北京支持的国民教育政策，迫使香港特首梁振英作出重大让步。据报道，自2005年以来，中国发生的群体事件增加了一倍。\n\n中国公民要求信息自由流动，能够不受阻碍地表达批评意见和质疑政府政策，这一愿望继续以强有力的方式在互联网上得到表达。中国的互联网用户人数继续迅速增加，在2012年6月达到5.38亿人。至2012年4月，据报道中国有超过10亿个手机账户。由于政府控制的媒体对某些重大事件不予报道，并对这些事件的消息进行严格审查，大批公民涌向互联网，特别是利用中国广受欢迎的微博服务，以便自由分享和获取有关公众关心的重要事件的消息。此类事件包括涉及被罢黜的前政治局委员兼重庆市委书记薄熙来的丑闻和7月在北京发生的大规模洪灾。看到互联网上广泛流传的令人难以目睹的照片之后，中国各地的公民对冯建梅事件表达了极大的愤慨。她被地方官员强行绑架，并被逼迫做堕胎，这一事件揭露了中国强制性计划生育政策的运作。陈卫和陈西等倡导民主的人士由于在互联网上发表自己的观点而被判处重刑。\n\n中国公民还寻求利用和加强中国微弱的政治和法律机构。政府官员继续严格控制地方人大选举，但这种做法并未能阻碍大批独立候选人尝试参加过去一年中在全国各地举行的选举。毫不奇怪，其中许多候选人遭受巨大的压力和骚扰，许多人在实际选举之前就被删除。关心公益的公民继续援引中国的政府信息公开法律索取信息，希望能够提高中国政府机构的透明度。在政府官员考虑修改中国的某些法律和法规时，公民寻求就立法草案发表意见。例如，他们支持《中华人民共和国刑事诉讼法》修正版中能够更好地保护被告权利的条款。\n\n中国政府和共产党未能跟上公民日益增加的需求。在许多地方，官员们以敷衍了事的措施应对，并没有彻底解决公民提出的问题，在某些情况下甚至增强了政府滥用职权的能力。就《中华人民共和国刑事诉讼法》进行了许多讨论，政府在三月通过的重大修正条款虽然比原来的法律有一些改善，但也使多种形式的秘密拘留合法化，而此类拘留可能导致公民遭受酷刑和虐待，并且过去曾被用来对付异议人士。从1月起，某些地区的政府官员开始发布有关微小污染颗粒（PM2.5）的信息，有限地提高了环境方面的透明度，但与此同时，也打算对独立监测环境的做法设置障碍。二月，政府官员发布了一份通知，阐述了旨在改革中国户口制度的政策，户口制度限制了中国公民自由选择永久居住地的权利。中国学者和媒体对拟议的政策提出批评，认为这些政策不够明确，且范围有限。政府继续为更多民众使用互联网提供便利，但采取了旨在消除‘‘谣传’’和防止匿名发帖的措施，而这些措施可能造成寒蝉效应，对自由表达产生严重不利影响。政府初步表示有意让政府批准的宗教团体参加公民社会中某些领域的活动，但宗教事务局加强了对宗教团体内部事务的干涉。家庭教会和法轮功等未经政府批准的宗教团体继续受到压制，[中国]与罗马教廷的关系恶化。当局继续以从事‘‘非法宗教活动’’的名义监禁和拘留维吾尔族穆斯林并对他们处以罚款。\n\n在其他一些领域，改革和进步嘎然而止。在《公民权利和政治权利国际公约》(ICCPR)问题上，政府的立场并无改变，尽管多年来中国官员一直表示有意批准该公约。六月，政府发布了《国家人权行动计划(2012－2015年)》，声称完成了某些‘‘行政和司法改革’’，以便在未来某个日期批准《公民权利和政治权利国际公约》——这一说法比政府在2009–2010国家人权行动计划中的类似提法更加模糊。同样令人忧虑的是，2012–2015行动计划删除了2009–2010行动计划中有关《公民权利和政治权利国际公约》和《世界人权宣言》是制订该行动计划时所遵循的‘‘基本原则’’的文字。在公民社会方面，政府继续推迟提出旨在为公民社会组织登记清除障碍的国家法规修正条款，而代之以在地方上进行的小修小补的试验。与达赖喇嘛的代表所进行的谈判没有恢复，这是自2002年重新对话以来时间最长的一次中断。\n\n在此期间，严重违反人权的事件继续发生，政府试图加强压制能力。政府继续拘留北韩难民并将其遣返朝鲜民主主义人民共和国（DPRK），尽管这些难民被遣返后会受到严厉处罚。任意拘留活动人士的情况依然屡见不鲜，当局对撰写政治评论、参加民主活动和上访人员判处重刑。知名人权律师高智晟已经失踪多年，中国官员声称他在五年缓刑期结束的前一周违反了假释条件，这意味着他必须服满原来的三年刑期。\n\n面临藏族自治地区和新疆等中国少数民族自治地区的抗议活动，当局继续以既定政策应对，预期这些政策只会进一步破坏对语言、文化和宗教的保护，并阻碍中国宪法和法律应当予以保护的地方自治。新疆官员扩大了‘‘双语教育’’政策的实施范围，这种政策推动在学校中使用汉语授课，减少了对维吾尔语及其他‘‘少数民族’’语言的使用。在青海省，藏族学生抗议有关部门试图以汉语课本取代藏语课本的做法。在2012年2月，中央统战部副部长朱维群在他的一篇文章中对进一步同化少数民族表示支持，这一政策变化几乎肯定会进一步削弱对少数民族语言、文化和宗教的保护。朱维群在少数民族事务上很有影响力，其表态预示着政府和党可能考虑实行更加事与愿违的政策。一场旨在清除法轮功并‘‘转变’’其修炼者的运动进入了第三个年头。党和政府以‘‘社会管理’’的名义扩大了对社会的控制，对倡导民主的人士和维权人士及全体公民都加强了监视。\n\n委员会注意到，过去一年里也出现了一些给人希望的新情况。据官方报告，采矿业死亡人数下降，中国政府颁布的一些措施要求奖励举报职业安全危险和掩盖工伤事故行为的员工。新近修订的《中华人民共和国刑事诉讼法》在获取刑事辩护、保留审讯记录、更细致的案件讨论、保障申诉权、更严格的司法审查等方面有所改善。政府继续增加法律援助资金，并使更多人能够利用这项重要的服务。全国人民代表大会常务委员会正在审议中国第一部精神卫生法律草案，其中包含的一些条款可能限制官员滥用强制精神科治疗的手段，不过该草案没有规定对最初诊断进行复核，并缺乏限制强制住院时间之类的保障机制。在口头上，中国官员继续作出很好的承诺，例如废除摘取死囚犯的器官以及不歧视希望登记注册的政治和人权组织。如往常一样，温家宝总理继续在最高领导层中独自公开表示他对政治改革的支持——不过是在一党统治的框架内——并呼吁限制党和政府的权力。但是，这些令人鼓舞的表态以及法律和政策进展似乎作用有限，其原因可能是缺乏具体的实施计划，也可能是它们未能涉及根本问题：中国公民依然未能享有中国法律和国际法赋予的基本权利。\n\n委员会注意到，中国政府内部继续存在不同的声音，包括对某些改革举措的支持。2012年2月，国务院发展研究中心和世界银行发布了一份报告，题为《2030年的中国：建设现代、和谐、有创造力的高收入社会》。报告认为，过去三十年中国经济取得了成功，但‘‘中国已经到达另一个转折点，需要再一次进行根本性战略转变’’。报告呼吁对中国的国有企业进行改革，这一部门是贸易冲突的一个重要来源。报告还呼吁加快户口制度的改革，使中国人民享有更大的迁徙和居住自由。报告说，必须允许公众在更大程度上参与，增强中国公民的权能，这样他们才能为国家的发展和生活水平的提高作出贡献。报告说：‘‘政府应当主动满足这些需求，通过鼓励广泛参与的明确规则赋予个人、家庭、企业、社区、学术机构及其他非政府组织权利’’。最后，报告强有力地论证了在中国加强法治的重要性。报告认为，中国‘‘需要作出改变，建立一个精益、廉洁、透明、高效、在法治下运作的现代政府’’。报告强调了委员会追踪的人权和法治问题与中国长期经济稳定之间的密切相关性。\n\n根据立法所定的任务，委员会的工作包括追踪中国对人权法律和公约的执行状况，特别是《公民权利和政治权利国际公约》和《世界人权宣言》包含的内容，并追踪中国法治建设的状况。作为其任务之一，委员会每年十月发布一份年度报告，其内容涵盖此前十二个月，并就美国可以采取的立法或行政措施提出建议。下文列出了委员会向美国国会议员和行政部门官员提出的主要建议，以及更具体的调查结果和就本报告中的19个问题领域逐一提出的建议。\n\n## 主要建议\n\n国际法和基本自由。美国国会议员和行政部门官员应当敦促中国官员立即批准和立法实施《公民权利和政治权利国际公约》（ICCPR）。中国于1998年签署该公约，并多次承诺予以批准。对于中国政府继续普遍拒绝给予公民的许多自由（如本报告所记载），包括言论、宗教、结社和迁徙等方面的自由，《公民权利和政治权利国际公约》是一个重要的基础。工人不能成立独立工会。各种宗教信仰者——包括佛教徒、天主教徒、法轮功修炼者、穆斯林、基督教徒和道教教徒——以及公民社会团体不能自由结社，并受到政府的严密监管。超过五亿中国互联网用户不能在互联网上自由分享信息，中国的新闻媒体继续受到严密审查。异议人士不能自由旅行。\n政治犯和维权人士。美国国会议员和行政部门官员应当敦促中国官员立即释放并停止骚扰和虐待行使国际公认的人权的中国公民，包括诺贝尔和平奖获得者、身陷囹圄的政治活动人士刘晓波、房产维权律师倪玉兰、人权律师高智晟、藏族牧民荣吉阿扎（Ronggye Adrag，音译）、天主教主教苏志民、维吾尔族记者海来特•尼亚孜（Gheyret Niyaz）、民主倡导者陈卫、选举专家姚立法、知名艺术家和维权人士艾未未、以及本报告中提及的其他人士。\n法治。美国国会议员和行政部门官员应当敦促中国官员在各个领域加强法治。应当鼓励他们考虑《2030年的中国》报告中提出的建议，包括建立一个‘‘高效的、在法治下运作的现代政府’’。为了实现这一目标，应当敦促官员们结束不公正贸易行为，例如操纵货币、产业政策、以及使用配额和补贴，并确保中国完全履行其作为世界贸易组织成员的承诺。应当鼓励中国官员废除助长违反法治的行为和机制，例如导致地方官员强制执行堕胎和绝育的配额和奖励。还应当鼓励官员们通过去除共产党的影响来确保司法独立。陈光诚一案集中反映了中国在法治方面面临的挑战，应当鼓励官员们履行承诺，对陈光诚及其家人遭受的虐待进行调查，并根据中国法律给予施虐者公正的处罚。只有在各个领域——不仅是经济领域——改善法治，中国才能实现《2030年的中国》报告中描述的经济发展目标。\n少数民族政策。鉴于西藏高原各处发生的前所未有并且正在持续的自焚事件，少数民族政策的变化似乎特别令人担忧。美国国会议员和行政部门官员应当敦促中国官员保障少数民族的基本权利，立即并显著增加对话，并且公开接触所有少数民族社区及其代表，包括达赖喇嘛的代表，而不附加先决条件。\n透明度。本报告发现，在许多不同的问题领域中存在一个共同的问题，即中国政府显著缺少透明度。从对互联网的审查到发布环境污染数据，中国官员经常偏重于保密，而不注重透明度。应当鼓励中国官员确保政府和党的行为及信息——包括决策程序和司法程序、政府数据和统计资料、意见和指令——具有广泛的透明度，并允许公众提出建议和参与其中。具体而言，政府应当鼓励中国公民利用2008年颁布的《政府信息公开条例》，并就政府部门发布信息建立更强的奖励机制。\n委员会中来自行政部门的成员参与并支持了委员会的工作。本年度报告的内容——包括其调查结果、观点和建议——不一定反映具体行政部门成员的看法或行政部门的政策。\n\n委员会以19:0的表决结果通过了这份报告。\n\n# 具体调查结果和建议\n\n言论自由 | 工人权利 | 刑法 | 宗教自由 | 少数民族权利 | 计划生育 | 居住和迁徙自由 | 妇女的状况 | 人口拐卖 | 在中国的北韩难民 | 公共卫生 | 环境 | 公民社会 | 民主治理机构 | 商业领域的法治 | 司法公正 | 新疆 | 西藏 | 香港和澳门的发展\n\n下文中本年度报告的每一部分均对具体调查结果作了概述，其内容涵盖了委员会追踪的各个领域。在每一个领域中，委员会均列举了需要在下一年度关注的一组问题，并且根据法律对委员会的要求，提出了一组建议，以便总统和国会采取立法和行政措施。\n\n* * *\n\n# 言论自由\n\n## 调查结果\n\n在委员会的2012报告年度，中国官员继续对言论自由保持广泛的限制，这些限制违反了国际人权准则，包括《公民权利和政治权利国际公约》第19条和《世界人权宣言》第19条和第29条。为了保障国家安全和公共秩序等利益，这些准则允许国家在有限的情况下限制言论，但中国的限制涵盖了远为广泛的活动，包括以和平方式发表不同意见和对共产党提出批评。\n据负责互联网事务的行政机构中国互联网络信息中心发布的数据，截至2012年6月底 中国共有超过5.38亿互联网用户，比上一年度增加5300万人。中国政府承诺让更多人能够使用移动技术和互联网，以促进经济发展和扩大政府宣传。\n在本报告年度内，中国类似推特的微型博客（微博）网站继续强劲增长，成为互联网用户就富有争议的话题表达不满意见、组织集体行动和发表独立新闻报道的主要场所。中国的微博网站——包括中国最受欢迎的微博网站新浪微博——的用户大幅度增加，至2011年底已经有2.5亿个登记账户，而2010年底还只有6300万个登记账户。\n虽然国际和国内观察家继续看到中国互联网和手机的使用十分普遍和活跃，政府和党的官员并无放松政治控制的迹象。过去一年里，中国当局继续试图屏蔽和过滤被认为政治上敏感的内容，其具体做法包括大规模删除内容、实行登记实名制、强行关闭网站、下达审查指令、实施拘留等。\n官员们继续任意限制言论，其手段为滥用模糊不清的刑法条款和覆盖面极广的法规条例以及针对记者、出版社、新闻媒体和互联网的登记要求。批评政府的公民被指控犯有危害国家安全的罪行，例如‘‘煽动颠覆’’。以反腐败名义进行的培训和监管记者的大规模官方活动继续大量灌输政治教条。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n对中国政府继续坚持认为其对言论自由的限制符合国际准则表达关切，并吸引国际社会对此进一步关注。中国官员声称，此类措施旨在保障国家安全和公共秩序，但能够获得的信息表明，许多措施的目的在于迫使对共产党提出反对意见的人士噤声或屏蔽与敏感的政治议题有关的自由流动信息。\n强调中国政府的立场违反了有关言论自由的国际人权准则，特别是《公民权利和政治权利国际公约》第19条和《世界人权宣言》第19条和第29条包含的内容。\n向中国官员强调共产党和政府对互联网和新闻媒体的审查将减弱公众对媒体和政府的信任，可能导致不稳定。\n与中国政府官员对话和沟通，讨论政府如何以最佳方式确保对言论自由的限制不被滥用，不致于超出保护国家安全、未成年人和公共秩序所必需的范围。强调程序保障的重要性，例如公众参与制定有关言论自由的限制条款、在实施此类限制时保持透明度、以及对此类限制进行独立核查。\n强调中国官员自己就在立法过程中提高透明度和公众参与而发出的呼吁。此类讨论可以作为更广泛的讨论的一项内容，而更广泛的讨论可以侧重于美中两国政府能够怎样合作，以确保互联网上的共同利益受到保护，包括保护未成年人、计算机安全和隐私权。\n承认中国政府为增加互联网和手机用户所作的努力，特别是在农村地区的努力，同时继续敦促官员们遵守国际准则。为有关技术研发提供支持，帮助中国公民获取和分享根据国际人权准则他们理应能够获取和分享的政治和宗教内容。就具体做法、中文工具和培训材料提供支持，帮助中国公民以确保其安全和隐私的方式获取和分享内容。\n在互联网上传播中文信息，特别要利用广受欢迎的中国社交网站，以帮助中国公民了解根据国际准则他们所应当享有的权利和自由。\n对中国官员把法律——包括模糊不清的妨害国家安全罪名——用作压制公民自由权利的工具，质疑此类做法是否符合‘‘法治’’精神。\n对骚扰外国记者的行为表示更严重的关切。过去一年里，一些外国记者遭受殴打或驱逐。据报道，当局一再推迟或拒绝批准某些记者的签证申请，对此亦应当表示关切。\n\n# 工人权利\n\n## 调查结果\n\n无论在法律中还是在实际操作层面，中国工人根据国际准则应当享有的全部权利——包括组织独立工会的权利——都没有得到保障。共产党领导下的官方工会中华全国总工会 （ACFTU）是中国唯一的合法工会组织。所有基层工会必须是中华全国总工会的附属。\n地方工会必须对党和政府保持忠诚，并不始终如一或一致地增进工人的权利。据报道，中华全国总工会的分会继续在劳工关系中优先强调‘‘和谐’’与‘‘稳定’’，牺牲了工人的权益。过去一年里，工会代表寻求尽快结束纠纷，有时并没有解决工人提出的问题。\n由于担心工人的行动对 ‘‘和谐’’与‘‘稳定’’产生的影响，官员们有时动员武力对付或拘留示威工人，并寻求制止工人示威。例如，在2011年10月，湖南省邵阳市的官员下令把煤矿工人赵足英行政拘留10天，此前, 赵足英和另外18名矿工曾聚集在邵阳市的一个公共广场，就一些劳工问题表达不满。据委员会记录，在以下地点发生的事件中官员曾动员武力对付示威工人：广东省东莞市、上海市、浙江省湖州市、四川省成都市。\n2012年1月，《企业劳动争议协商调解规定》（简称‘‘规定’’）生效，要求所有大中型企业设立负责调解工作场所争议的委员会。‘‘规定’’对个人权利提供了一些有限的保护，但并未解决中国工人组织独立工会的权利没有保障的问题，从而使政府、共产党和雇主在争议解决的过程中享有较大的发言权。\n流动工人依然是在工作场所特别容易遭受剥削的群体。过去一年里，流动工人继续面临拖欠工资、缺乏有效的投诉程序、资方虐待等问题。随着中国流动工人的数量不断增加，城市化程度提高，新一代流动工人更年轻、受教育程度更高、权利意识更强，一些地方政府采取了若干步骤帮助流动工人融入城市地区。\n2012年初，为了改善富士康工厂的工作条件，苹果公司和富士康同意采取一组措施，包括到2013年7月1日在工作时间方面全面执行中国法律。一些观察家认为，这些措施如果能够按照计划实施，可能促进中国的其他雇主为工人改善条件。目前对建议的措施之效果进行评估还为时过早，但设在香港的非政府组织大学师生监察无良企业行动（Students and Scholars Against Corporate Misbehavior）在2012年5月报告说富士康工厂中依然存在工作条件问题。\n中国工人，特别是煤矿工人，继续面临职业安全与健康风险。过去几年里，死亡人数稳步下降，但与此同时官方报告的矿工职业病发病率上升。有报道说，一些矿主和地方官员试图隐瞒矿井事故信息。2012年5月，国家安全生产监督管理总局和财政部发布了《安全生产举报奖励办法》，对敢于举报职业安全危险的人士颁发现金奖励并依法提供保护。2011年12月，《中华人民共和国职业病防治法》（下称《职业病防治法》）修正案生效。该修正案包含的条款可能帮助工人获得就与工作相关的疾病领取赔偿金所需要的证书，但工人在获得赔偿方面继续面临障碍，包括难以获得诊断和证明与雇主有雇佣关系，这些都是领取证书的必需步骤。\n关于中国使用童工的范围并不清楚了，部分原因是政府不发布童工数据，尽管美国政府、其他国家政府和国际组织一再提出要求。虽然存在一个解决该问题的国家级法律框架，执行方面的系统性问题削弱了这些法律措施的有效性。在本报告年度内，仍然有使用童工的报道。例如，2012年2月，据报道苏州当局在当地一家生产电子设备的工厂发现超过10名童工。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持推动改革中国劳工法律法规的项目，以反映国际公认的劳工准则。制定重点项目，不仅重视法律法规的起草和制定，而且对实施情况进行分析，按照国际公认的劳工准则在车间一级评估进展。\n在集体谈判取得成功的地方，与政府官员、工人和工会负责人进行对话；寻找宣传这些进展的途径；在集体谈判取得较少成功的地方，把这些进展告诉政府官员和工会。在有可能的地方，重点支持明显具有集体谈判能力的项目，即使工厂中并没有官方工会。\n表达对直接选举工会代表的支持。与政府官员和地方工会负责人进行对话，寻找机会宣传直接选举工会代表的成功经验。\n鼓励扩大美国集体谈判方面的人员与中国非政府组织中的劳工维权人士、律师协会、学术界和官方工会之间的交流。重点支持强调与从事实际工作的人员和培训教员进行面对面会谈的项目。\n鼓励对导致劳工法律法规实施不一致的因素进行研究。此类研究可包括编集和分析中国劳工纠纷诉讼和仲裁案例以及省级和省级以下的基层法院发布或接收的指导文件，并在此基础上出版中文案例汇编，供工人、仲裁人、法官、律师、雇主、工会负责人和中国的法学院使用。\n支持能力建设项目以加强维护工人权利的中国劳工和法律援助团体。鼓励地方上的中国官员与国内外劳工组织建立、保持和深化关系，邀请这些组织为中国提供更多培训项目。支持工人培训项目，帮助他们在工厂一级发现问题，掌握解决问题的能力，以便他们有效地向雇主表达自己的关切。\n适当时向中国官员介绍目前美国通过法律法规或非政府途径保护工人权利的经验和做法。增加实地考察和其他交流活动，帮助中国官员了解美国劳工维权组织、律师、美国劳工部（USDOL）及美国政府中负责劳工事务的各级监管部门的做法并与之交流想法。\n支持美国劳工部与中华人民共和国人力资源和社会保障部（MOHRSS）之间在下列问题上的交流：制定和实施最低工资标准；加强社会保障；改善就业统计；就改善工作场所安全和工人健康与中国国家安全生产监督管理总局（SAWS）进行对话与交流。支持美国劳工部2010年与中国启动的年度劳工对话及其建立安全对话的计划。支持美国劳工部与中国国家安监总局就工作场所安全与健康开展的技术合作项目，把对话内容从矿业生产扩大至总体职业安全与健康领域。支持通过政府与民间伙伴关系解决工作场所安全与健康问题的试点项目。\n\n* * *\n\n# 刑法\n\n## 调查结果\n\n在委员会的2012报告年度，中国政府官员承诺在控制犯罪和保护人之间取得平衡。3月，全国人民代表大会审议并通过了自从1996年以来对《中华人民共和国刑事诉讼法》（CPL，简称《刑诉法》）的第一次重大修订。2012年6月，国务院新闻办公室发布了新的《国家人权行动计划（2012-2015年）》。就公平、合法地对待刑事嫌疑人和被告而言，这些改革措施似乎包含了一些令人鼓舞的政策目标。\n执法部门在行使治安权力时采取的一些行动可能阻碍近期的改革，反映了[政府]继续侧重于‘‘维护社会稳定’’以及党的绝对控制高于一切。在2012报告年度中，地方当局的权力继续扩大，却没有建立问责机制，最终导致前政治局委员兼重庆市委书记薄熙来下台。据报道，薄熙来授权在重庆非法‘‘打黑’’，16位前党的官员谴责说，‘‘打黑’’只是一种‘‘幌子’’，其实质是折磨和迫害批评人士和维权人士。\n中国官员继续骚扰和恐吓作家、艺术家、互联网博客作者、律师、倡导改革者、以及维护自身权利或他人权利的普通公民。这些人士遭到各种形式的非法拘留，包括强迫失踪、关‘‘黑监狱’’和没有足够医学根据的情况下强迫入住精神病院。新修订的《刑诉法》第73条（新增条款）为执法部门滥用这些手段并使之合法化提供了便利。\n中国的被告在充分获取辩护方面继续面临障碍。虽然新修订的《刑诉法》有可能改善许多被拘押者获得法律帮助的机会，涉及‘‘危害国家安全’’和其他政治敏感罪名的人士依然面临障碍。另外，《中华人民共和国刑法》第306条规定，强迫或诱使证人改变证词或伪造证据的律师须承担刑事责任，妨碍了律师在刑事案件中进行有效的辩护。\n在以和平方式维护其合法权利的公民和被指控违反刑法的其他公民之间似乎存在双重标准。最近的改革承诺为后者提供保护，却把压制和虐待前者的行为合法化。在这种体制下，公民活动人士无法享有《世界人权宣言》和《公民权利和政治权利国际公约》以及《刑事诉讼法》和中国的《宪法》所保障的全部权利。\n在2012报告年度中出现了一些积极的变化。由于发生了一系列拘留中非正常死亡事件，政府颁布了新法规，禁止侮辱、体罚或虐待看守所、监狱和劳动教养设施中的人员，并规定在某些情况下违规者须承担刑事责任。另外，中国政府还采取步骤提高透明度，改进量刑审判的复审标准，包括对死刑案件的审判。有关处决的信息依然被视作国家机密，但政府披露，从死刑犯身上摘取的器官占中国器官移植总数的三分之二，包括肝、肾、心脏、肺和角膜。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n呼吁中国政府遵循国际人权准则确保刑事嫌疑人和被告的权利，并就批准《公民权利和政治权利国际公约》向国际社会提出具体的时间表，中国政府于1998年签署了该公约，但至今没有批准。\n明确表示国际社会赞赏中国政府在《国家人权行动计划（2012-2015年）》中对公平审批权利和被拘留者权利作出的承诺。请求中国政府提供把此等承诺正式变成法律法规的信息以及当局将采取哪些步骤确保其成功实施。支持促进此等努力的双边和多边合作与对话。\n鼓励中国政府履行通过修订《刑事诉讼法》作出的承诺，废除双重对待的做法，例如第73条对公民活动人士和所有其他公民的区别对待。向中国政府施加压力，要求立即释放因行使合法权利而被监禁或拘留的维权人士，遵守公正审判准则，在案件涉及容易被滥用的概念（如‘‘危害国际安全’’）时确保程序上的保护。\n向中国政府施加压力，要求采纳联合国禁止酷刑委员会的建议，调查和披露‘‘黑监狱’’及其他秘密拘留设施的情况，作为废除此类法外拘留的第一个步骤。促请中国政府邀请联合国任意拘留问题工作组访问中国。\n支持在中国省级执法部门和美国州级执法部门之间建立交流机制，以了解治安、取证、囚犯权利、以及中国正在进行的其他刑法改革。\n\n# 宗教自由\n\n## 调查结果\n\n在这个报告年度中，中国政府继续限制中国公民的宗教自由。中国的《宪法》保证‘‘宗教信仰自由’’，但把对宗教活动的保护局限于‘‘正常的宗教活动’’，此一概念的实施方式违反了有关宗教自由的国际人权保护准则。政府依然仅仅承认五种宗教——佛教、天主教、伊斯兰教、基督教和道教——并要求属于这些宗教的团体在政府登记。登记的团体就其宗教活动获得某些法律保护，但继续受到政府控制。无论是登记团体还是未登记团体的成员，只要被视作违反了国家的宗教规定，就可能受到骚扰、拘留和其他不公平对待。有些未登记的团体享有从事其宗教活动的空间，但这种有限的容忍并不等于官方承认其权利。当局还取缔了有些未登记团体的活动，并继续禁止另外一些宗教或信仰团体（包括法轮功）的存在。[有关新疆和西藏的宗教自由方面的调查结果和建议，请分别参阅新疆和西藏部分。]\n政府继续用法律控制中国的宗教活动，而不是保护全体中国公民的宗教自由，在这一报告年度中，政府继续修改或制定法规条例。与近年来制定的宗教法规一样，新近颁布的法规是对2005年开始实施的《宗教事务管理条例》（RRA）条款的扩充。近期的法规使《宗教事务管理条例》的现有条款趋于一致，但也加强了已经十分严格的控制。\n当局继续确保佛教教义和活动符合党和政府的目标。\n在遴选中国主教及从事其他信仰活动方面，当局继续拒绝赋予天主教会承认罗马教廷权威的自由。当局继续骚扰、拘留和监视一些未登记的神父和主教，并强迫一些主教参加罗马教廷视为不合教规的、由政府控制的教会活动。\n中国各地的地方政府继续禁止穆斯林在国家规定的范围之外从事宗教外展活动和布道活动。\n对基督教徒持续的骚扰和拘留、禁止业主向家庭教会出租房屋的压力、信息收集、以及宗教事务局官员与未登记团体增多的接触都显示出当局迫使家庭教会隶属于政府支持的‘‘三自爱国会’’的决心。\n当局继续控制道教活动，并敦促道教‘‘现代化’’。\n为了迫使法轮功修炼者放弃其信仰和活动，当局推行的为期三年的运动可能会延续。该运动是一场范围更广、已经延续了十多年的运动的一部分，后者则是一场广泛的、系统的、在某些情况下使用暴力的运动。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n呼吁中国政府遵循《世界人权宣言》第18条保证全体公民的宗教自由，拆除政府建立的仅仅承认某些宗教团体并给予有限保护的框架。向中国当局强调宗教自由包括从事宗教活动的权利以及保持宗教信仰的权利，说明中国对‘‘正常的宗教活动’’的有限保护不符合国际人权准则中保护宗教自由的定义。呼吁官员把保护宗教自由的措施变成在中国改善人权的实施计划。向中国政府强调宗教自由权利包括：佛教徒不受国家对宗教的控制在寺庙中从事活动的权利、藏传佛教徒公开表达对藏传佛教老师——包括达赖喇嘛——的尊重和忠诚的权利、天主教徒在任命主教及其他信仰活动中承认罗马教廷权威的权利、法轮功修炼者在中国自由修炼法轮功的权利、穆斯林在国家规定的范围之外从事宗教外展活动和布道活动而不受以‘‘维稳’’名义对国际上受保护的宗教自由进行限制的权利、基督教徒不受政府对教义的控制而自由礼拜和在未登记教会中礼拜、不受骚扰、拘留和其他虐待的权利、道教徒不受政府指导诠释其教义的权利。\n呼吁释放因追求宗教自由权利（包括持有和实践其精神信仰的权利）而被限制行动自由、拘留或监禁的中国公民。此类被监禁者包括：索郎拉措(Sonam Lhatso，音译)（藏传佛教尼姑，2009年被判处10年监禁，原因是她和另外一些尼姑举行抗议活动，呼吁西藏独立、祝达赖喇嘛长寿并返回西藏）；苏志民（未登记天主教会的主教，于1996年被警察拘留后失踪）；王志文（法轮功修炼者，因在1999年组织法轮功修炼者进行和平抗议被判处16年监禁）；努尔泰•买买提（Nurtay Memet）（穆斯林，因从事与其宗教相关的‘‘迷信’’活动被判处5年监禁）；范亚峰（法学专家、宗教自由倡导者和家庭教会领导人。就在一场广泛镇压维权人士的运动正在进行时，范挺身维护未登记基督教团体的权利而从2010年11月起被软禁在家中）；以及本报告中提及和委员会政治犯数据库中的其他人士。\n呼吁当局允许中国律师自由地为有宗教信仰的公民代理法律事务，对法律、法规、裁决或官员、警察、检察官和法院针对宗教活动采取的行动之合法性提出质疑。\n呼吁政府官员们废除针对宗教和精神运动实施的刑事和行政处罚，这些手段一直被用于处罚行使宗教自由权利的中国公民。特别是要呼吁政府废除《中华人民共和国刑法》第300条（关于使用‘‘邪教’’妨碍国家法律实施的规定）和《中华人民共和国治安管理处罚法》第27条（对组织或煽动他人从事‘‘邪教’’活动或利用‘‘邪教’’或‘‘冒用宗教名义’’扰乱社会秩序或损害他人身体健康者处以拘留或罚款）。\n促进法律交流活动，安排中国专家访问美国和美国专家访问中国，以增进对国际人权准则的了解，保护宗教自由，包括有宗教信仰的公民、团体和基于宗教信仰的慈善机构的权利。支持非政府组织在中国收集有关宗教自由状况的信息，帮助中国公民了解如何捍卫其宗教自由权利，防止政府滥用职权。支持有关组织帮助因行使宗教自由权利而被判处监禁或劳教的人士提出上诉；对政府没收财产的做法提出争议；并且对与宗教信仰相关的就业歧视提出争议。\n\n# 少数民族权利\n\n## 调查结果\n\n在委员会的2012报告年度中，中国的少数民族在维护中国法律和国际法规定的权利时继续面临独特的挑战。《公民权利和政治权利国际公约》规定，一个国家中的少数民族及宗教和语言方面的少数群体 ‘‘不得否认这种少数人同他们的集团中的其他成员共同享有自己的文化、信奉和实行自己的宗教或使用自己的语言的权利’’。《中华人民共和国民族区域自治法》为少数民族的权利提供了某些保护，建立了在指定地区实行区域自治的制度。但是，对政府政策内容及实施方式的限制妨碍了少数民族按照国际准则充分享有其权利和实行实质性自治。\n在当局认为其权威受到最大威胁的地区——包括西藏自治区和藏族自治的其他地区、新疆维吾尔自治区和内蒙古自治区——政府控制最为严厉。[请参见有关新疆和西藏的调查结果和建议。]政府当局继续拘留和法外拘留试图促进自身权利或被视为挑战国家权力的蒙古族人士。\n一批重要的政府官员和学者更加热烈地讨论在少数民族地区减少民族自治和促进同化政策的建议。一份共产党刊物中的一篇文章以及国家民族事务委员会主办的网站上的评论都探讨了在中华人民共和国各地统一实施政策和放弃少数民族政策的建议。\n中国政府继续实施自上而下的发展政策，此类政策在经济上带来了某些改善，但削弱了区域自治，限制了少数民族保持其独特文化、语言和谋生方式的权利。政府继续实施已经长期奉行的草原政策，禁止放牧，并要求牧民从草原上迁移至其他地方，放弃游牧生活方式。这些政策的实施影响到蒙古族人、藏人、哈萨克人和中国的其他一些少数民族。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持法治项目和提高意识的交流项目，帮助中国领导人了解不同的治理模式，根据中国法律和国际人权准则保护少数民族权利，使他们以具有实质意义的方式实行自治。\n支持在中国促进经济发展模式的项目，包括允许少数民族社区参与决策。呼吁中国政府审查现有草原政策在治理环境退化方面的有效性，采取步骤确保牧民权利也受到保护。\n支持为中国少数民族改善人权状况的非政府组织，使它们能够继续进行研究，并制定项目帮助少数民族增强其维护自身权利的能力。鼓励此类组织制定下列项目：通过鼓励少数民族社区参与决策而促进经济发展的培训项目；保护少数民族语言、文化和谋生方式的项目；在内蒙古自治区、新疆维吾尔自治区、西藏自治区及其他少数民族地区记录违反人权事件并从事有关研究的项目。\n鼓励在中国运作的人权和法治项目在其活动中帮助解决对中国少数民族有影响的问题。\n呼吁中国政府释放因维护少数民族权利而被拘留、监禁或以其他方式关押的人士，包括蒙古族维权人士哈达（Hada）（他的15年刑期在2010年12月届满，但在并无明显法律根据的情况下继续被关押）以及本报告中提及和委员会政治犯数据库中的其他人士。\n\n* * *\n\n# 计划生育\n\n## 调查结果\n\n中国政府官员继续实施干涉和控制其公民——特别是妇女——生殖活动的计划生育政策。官员们采用罚款、取消政府福利和许可证、威胁赶出或拆除住宅、强制节育、强制流产、任意拘留等各种方法处罚违反政策的人。\n委员会在2012报告年度注意到，地方政府继续执行针对流动人口的计划生育政策和措施。\n《中华人民共和国人口与计划生育法》不符合1995年《北京宣言》和1994年开罗国际人口与发展会议《行动纲领》的准则。强加给中国妇女及其家庭的控制以及该制度所带来的其他滥用职权行为——从强制堕胎到针对‘‘计划外’’儿童的歧视性政策——也违反了《儿童权利公约》和《经济、社会、文化权利国际公约》的准则。中国是这些条约的缔约国，理应遵守其条款。\n中国法律禁止官员在执行计划生育政策时侵犯公民的权利和利益，但并没有定义什么是公民的权利和利益。中国法律对要求或实施强制堕胎的官员并无处罚规定。在中国的31个省级行政区中，至少有18个颁布了明确支持把强制堕胎（经常称为‘‘补救措施’’）作为官方政策工具的计划生育条例。\n在本报告年度内，中国官员有限地放宽了地方上的计划生育政策，但继续排除近期对全国性计划生育政策进行重大改革甚至废除的可能性。在这一年里，有更多公民呼吁进行计划生育政策改革。\n中国政府的计划生育政策继续使中国面临的人口挑战加剧，这包括人口老龄化、劳动力减少、性别比例失调等。\n陈光诚是一位自学成才的法律维权人士，他在2005年公开了计划生育领域中存在的迫害行为后一直受到官方的骚扰和虐待。他于2012年4月从非法软禁中逃脱，并于5月和家人一道抵达美国。陈对中国政府未能调查官员对其本人及其家人的迫害表示沮丧，并对留在山东的家人继续遭受严厉的对待感到关切。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n敦促中国政府官员停止以强制方式执行计划生育政策，并敦促中国政府废除强制性的计划生育手段，采用基于人权的方式，在生育和隐私权方面为全体公民特别是妇女提供更大的自由。\n敦促中国官员重新评估《中华人民共和国人口与计划生育法》，使之符合1995年《北京宣言》和1994年开罗国际人口与发展会议《行动纲领》阐明的国际准则以及《儿童权利公约》和《经济、社会、文化权利国际公约》。\n敦促中国的中央和地方政府强有力地执行中国法律中的有关条款，对在实施计划生育政策过程中侵犯公民权利的官员和个人予以处罚，并明确界定此等权利的范围。敦促中国政府针对官员和一些个人的强制堕胎和强制节育等违反人权的行为——此类行为在中国继续发生——制定具体的处罚措施，包括追究刑事责任和罚款。敦促中国政府禁止以物质、金钱及晋升为奖励机制驱使官员们在实施计划生育政策时采用强制或非法手段。\n支持制定法律援助和培训项目，加强国际合作，帮助公民就官员们在实施计划生育政策过程中的违反人权行为所造成的伤害根据《中华人民共和国国家赔偿法》向政府寻求赔偿和其他补偿。\n敦促中国政府停止对与陈光诚有关联的人士的各种形式的报复，彻底调查在官员纵容下对其本人及其家人的迫害。\n\n# 居住和迁徙自由\n\n## 调查结果\n\n中国政府实行的户口制度继续限制中国公民自由选择永久居住地的权利，妨碍了公民接受社会福利。户口规定把居民身份作为享有合法权利和接受社会福利的前提，导致对前来城市寻求就业机会的农村人口的歧视。此类规定的歧视性后果在教育领域中特别明显。\n中国当局继续放宽某些户口限制，这与此前采取的一些做法一致。此类改革措施的关键内容在于允许符合某些标准的农村人口把户口转至城市。尽管有这些放宽户口标准的有限努力，大部分改革措施依然把大多数流动人口排除在外。\n中国政府颁布了户口改革的新指南，这些指南反映了逐步地、有控制地进行户口改革的做法。一些值得一提的改革措施包括禁止以城市户口为交换强行征用农村人口的土地和禁止未来的政策把户口用作接受社会福利的先决条件。不过，中国学者和媒体批评这些措施不够具体和存在局限性，因此有人质疑它们最终是否能够产生效果。\n中国政府继续对公民的行动自由施加限制，这些限制不符合《世界人权宣言》和《公民权利和政治权利国际公约》。在委员会的2012报告年度中，中国当局继续任意阻碍维权人士、社会活动家和批评人士离开中国。\n中国政府还继续对公民在中国境内的行动自由施加限制，以惩罚和控制维权人士、社会活动家和批评人士。这些限制显然违反了国际法标准，在政治敏感期间特别严厉。当局采用多种手段，包括部署便衣警察或雇用其他人监视维权人士的住宅，强迫他们与安全人员‘‘喝茶’’，把他们从家中转移至不明地点或监禁。\n在本报告期内，中国当局使用了特别具有强制性的方法恐吓和控制维权人士的家属和支持者。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持与中国决策者以及从事流动工人研究和外展的学术机构相关的项目、组织和交流 ，以促进为流动工人提供法律援助的项目，鼓励有关户口制度的政策辩论。\n鼓励美国学术和公共政策机构向委员会咨询，探讨如何接触参加户口制度改革政策辩论的中国学术界人士和公共政策人物。\n向中国政府官员强调在行动自由方面不符合国际协议将导致外界对中国政府在总体上执行国际准则的承诺失去信心。\n呼吁中国政府修订《中华人民共和国出境入境管理法》和《中华人民共和国护照法》，分别澄清第12(5) 款和第13(7) 款中危害国家安全或对国家利益造成损失的定义和范围。\n特别提出中国当局对维权人士、社会活动家和批评人士的行动自由的限制，此类人士包括诺贝尔和平奖获得者刘晓波的妻子刘霞、维护房产权利人士和律师倪玉兰的女儿董璇、以及自学成才的法律维权人士陈光诚的家人和支持者。\n\n# 妇女的状况\n\n## 调查结果\n\n中国官员继续推动执行旨在保护妇女权利的现有法律，包括经修订的《中华人民共和国妇女权益保障法》和经修订的《中华人民共和国婚姻法》；但是，中央政府立法中的模糊之处和缺少明确界定的责任限制了在保护妇女权利方面取得的进展。\n通过其国内法律和政策以及批准《消除对妇女一切形式歧视公约》（CEDAW），中国政府承诺确保妇女在政府中的代表性。在2012报告年度中，妇女在各级政府中的任职比例似乎没有重大进展。\n2011年8月，最高人民法院发布了对《中华人民共和国婚姻法》的新解释，有人认为，该文件未能保护妇女拥有财产的权利。\n2012年6月，深圳市第五届人民代表大会常务委员会通过了《深圳经济特区性别平等促进条例》，这是中国第一部以性别平等为主要内容的法规。\n根据《消除对妇女一切形式歧视公约》，中国承诺采取‘‘一切适当措施，消除在就业方面对妇女的歧视’’。虽然中国的现有法律——例如《中华人民共和国劳动法》、 经修订的《中华人民共和国妇女权益保障法》和《中华人民共和国就业促进法》——禁止性别歧视，妇女在聘用、晋升、工资和退休等方面继续遭受普遍的歧视。\n经修订的《中华人民共和国妇女权益保障法》（LPWRI）和经修订的《中华人民共和国婚姻法》禁止家庭暴力。被指控犯有家庭暴力罪的人应当依据《中华人民共和国刑法》予以处罚。然而，由于这些国家及法律条款没有给出家庭暴力的定义或阐明政府部门在预防、处罚和处理方面的具体责任，致使许多遭受家庭暴力的人没有受到保护。据报道，家庭暴力依然普遍存在，受害者包括男人、妇女和儿童。中国经修订的《中华人民共和国妇女权益保障法》还禁止性骚扰，并为受害者提供了寻求救助的途径。但是，该法律没有明确定义性骚扰，也没有就预防和处罚提出具体标准和程序，使受害者在保护自身权利时面临困难。调研表明，性骚扰现象在中国依然十分普遍。\n在性别比例失调方面，近年来发布的统计数字和研究分析结果显示，基于性别选择的堕胎依然普遍，特别是在农村地区，尽管政府努力通过立法和政策加以阻止。一些观察人士——包括中国的国营新闻媒体——认为中国的性别比例失调与强迫卖淫、强迫婚姻及其他形式的人口拐卖活动增加有关。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n通过美中交流活动和国际会议支持中国加强妇女领导力培训的项目。支持促进妇女土地所有权——特别是在农村地区——的交流和法律项目，敦促高层政府部门对村委会加强监督，确保地方上的规则和规定符合国家法律和政策，并确保妇女权益受到充分保护。\n敦促中国政府采取步骤忠实地实施《中华人民共和国劳动法》、经修订的《中华人民共和国妇女权益保障法》和《中华人民共和国就业促进法》中禁止性别歧视的条款。敦促中国官员重点解决聘用、晋升、工资和退休等方面的性别歧视问题。支持帮助妇女了解在工作场所中如何保护和争取其自身权益的培训项目。\n敦促中国政府落实其申明的计划，在国家一级制定全面的法律，明确界定家庭暴力，规定政府和公民社会组织在消除该现象方面所承担的责任，阐明对施暴者的处罚。敦促官员们把此类立法的草案交与公众评议。敦促中国政府进一步修订 《中华人民共和国妇女权益保障法》或在国家一级制定新的内容全面的法律，明确界定性骚扰，并阐明预防和处罚方面的具体标准和程序。支持帮助司法和执法人员深入了解家庭暴力和性骚扰问题的培训项目。\n\n# 人口拐卖\n\n## 调查结果\n\n在人口拐卖方面（包括男人、妇女和儿童），中国依然是一个来源地、中转地和目的地。大部分人口拐卖案件属于国内拐卖，其目的是性剥削、强迫劳动和强迫婚姻。关于中国的强迫劳动现象的普遍性并不明了。\n中国政府在2009年12月加入了《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》（UN TIP Protocol） ，但是，中国国内的立法仍然未能完全符合该议定书。\n由于中国法律把人口偷渡、非法收养和拐骗儿童与人口拐卖归为同一范畴，在本报告年度内没有关于中国政府调查和起诉的人口拐卖案件的准确官方统计数字。中国当局与非政府组织及国际组织合作，采取了有限的步骤改善预防措施以及为人口拐卖受害者提供的服务和照顾，但依然侧重于关注妇女和儿童。\n对于人口拐卖的外国受害者，中国政府在法律上并没有就递解出境提供替代措施，并继续以‘‘经济移民’’的名义驱逐北韩难民，而不考虑他们是否是人口拐卖的受害者。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n敦促中国政府遵守其基于《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》作出的承诺；使反人口拐卖法律与国际准则一致。特别要敦促中国政府从法律上把人口偷渡、非法收养和拐骗儿童与人口拐卖区别开来，并扩大人口拐卖的现有定义，以包括各种形式的拐卖，包括对成年男性受害者的犯罪、某些形式的非暴力强迫、以及出于商业目的迫使儿童卖淫。\n呼吁中国政府为人口拐卖受害者提供更多保护服务。支持扩大为执法人员和庇护所管理者提供的培训项目，以提高意识，改进识别、保护、协助拐卖受害者的程序。支持既帮助人口拐卖的外国受害者又帮助中国受害者的法律援助项目。\n反对继续以‘‘经济移民’’的名义驱逐北韩的人口拐卖受害者。敦促中国政府履行1951年《关于难民地位的公约》和根据该公约制定的1967年关于北韩人口拐卖受害者的《议定书》，从法律上提供遣返的替代措施。\n\n# 在中国的北韩难民\n\n## 调查结果\n\n在委员会的2012报告年度中，尽管朝鲜民主主义人民共和国（DPRK）的人道主义危机和政治上的不稳定引起更大的关切，中国中央和地方当局继续执行把所有在中国的北韩难民归类为‘‘非法’’经济移民并予以强迫遣返的政策。\n中国政府继续拒绝让联合国难民事务高级专员（UNHCR）前往中国与北韩的边界地区和看望在中国东北的北韩难民。由于无法接触寻求在中国避难的北韩人，难民办事处和人权组织难以就北韩难民及事实上无国籍人士的数目得到准确的信息，亦无法了解北韩人出逃的原因以及北韩难民对强迫遣返的担忧。\n在中国的北韩妇女继续被拐卖，遭受强迫婚姻和出于商业目的的性剥削。中国政府遣返被拐卖的北韩妇女的做法违反了1951年《关于难民地位的公约》（简称《1951年公约》）和根据该公约制定的1967年《难民地位的议定书》（简称《议定书》）以及《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》（UN TIP Protocol）第7条。中国政府未能采取有效措施防止北韩妇女被拐卖，亦未能为北韩人口拐卖受害者提供保护，违反了《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》第9条和《消除对妇女一切形式歧视公约》（CEDAW）第6条规定的义务。\n在本报告年度内，中国当局以强制拘留、酷刑、驱逐等手段对待试图帮助在中国的北韩难民的人士，包括外国援助人员和参与人权组织工作的人员。\n在临近北韩的边界地区，地方当局继续拒绝给与中国公民结婚的北韩妇女生育的子女登记户口。由于没有户口，这些孩子们生活在一个没有国籍的两难境地中，不能上学或享受其他社会福利。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持联合国难民事务高级专员办事处（UNHCR）的努力，以便办事处人员及其实施伙伴在不受阻碍的情况下接触在中国的北韩难民以及事实上无国籍的人口，首先是在中国出生的父母一方为北韩人的儿童。鼓励中国政府与联合国难民事务高级专员办事处合作，制定和实施全国性的避难法律，以履行中国根据《1951年公约》及其《议定书》所承担的义务。敦促中国政府立即停止拘留和遣返在中国的北韩人。\n敦促中国的中央和地方政府官员履行《联合国打击跨国有组织犯罪公约关于预防、禁止和惩治贩运人口特别是妇女和儿童行为的补充议定书》第9条和《消除对妇女一切形式歧视公约》第6条规定的义务，起诉中国东北以及靠近朝鲜民主主义人民共和国边界地区的人贩子。\n敦促中国官员为与中国公民结婚的北韩人提供居民身份和有关社会福利，并为其子女提供同样的身份和福利。特别要敦促中国地方政府官员允许这些孩子们按照《中华人民共和国国籍法》（第4条）和《中华人民共和国义务教育法》（第5条）接受教育。敦促中国政府为更多北韩难民提供庇护所和安全的中转途径，直至他们抵达第三国。\n支持美国政府机构与中国安全官员围绕人口拐卖、避难审批、移民和边境管制等议题进行交流。\n\n# 公共卫生\n\n## 调查结果\n\n在委员会的2012报告年度中，公共卫生领域的倡导者继续面临政府骚扰，其倡导工作受到干预。中央政府在1998年和2009年对非政府组织（NGO）登记和捐款所规定的限制依然有效，据报道被用于监视、控制和限制非政府组织的活动。在委员会的2012报告年度中，为残疾人提供住房与服务的非政府组织北京慧灵在寻求登记时继续面临障碍，可能影响到其运作。\n中国政府的国内立法明文禁止在就业方面进行歧视，作为《经济、社会、文化权利国际公约》的缔约国，中国政府承诺消除就业和教育领域中对残疾人或传染病患者的歧视。就业和教育领域中基于健康状况的歧视屡见不鲜，那些寻求法律救济的人士面临障碍。一些报道显示，基于艾滋病毒携带者的歧视依然妨碍许多人获得有效的医疗服务。\n2011年10月和2012年8月，中国政府审议了第一部国家《精神卫生法》修订草案。如果能够落实，草案包含的某些修订条款可能进一步限制官员们通过强迫收住精神病院压制或惩罚异议人士的滥用职权行为。尽管有此类改进的可能，人们对修订草案是否能够符合中国已经签署并批准的联合国《残疾人权利国际公约》继续感到关切。\n2012年3月，一位中国高级卫生官员宣布了在未来三至五年‘‘取消’’从死囚身上摘取器官的做法。这一宣布反映了近年来政府就人体器官移植颁布的法规不断增加，据今年的报道已经发生无数起非法移植器官的案件。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n呼吁中国政府停止压制公共卫生倡导者，为与中国非政府组织合作解决公共卫生问题的美国组织提供更多支持。\n敦促中国官员重视有效实施《中华人民共和国就业促进法》及相关条例，禁止在就业、教育和医疗保健领域歧视艾滋病患者/艾滋病毒携带者、乙肝病毒携带者、以及患有其他疾病或残障的人士。支持中国非政府组织在某些有健康和医疗需求的人口中提高权利意识的项目。\n敦促中国政府消除一些个人和非政府组织对最新《精神卫生法》草案表达的关切。敦促中国官员及时通过《精神卫生法》，并确保该法律在不同地区得到一致的实施。\n敦促中国政府弥补2007年《人体器官移植条例》中的漏洞，目前有人利用这些漏洞进行非法器官贩卖。敦促中国官员采取果断措施实现政府已经申明的目标，在未来三至五年‘‘取消’’从死囚身上摘取器官的做法。\n\n# 环境\n\n## 调查结果\n\n尽管取得了一些进展，但污染问题依然很严重，特别是在农村地区，污染造成的经济代价不断增大。除迁移污染工业外，污染事件和因环境问题引发的抗议依然构成长期挑战。当局继续通过完善一个监管框架来解决这些环境问题，不过有些努力似乎遭遇重大阻力。当局发布了《环境保护法》（EPL）修订草案，请求公众评议。草案包含一些鼓励提高透明度和增强政府机构问责性的机制，但没有包含较早文本中有关更加有力地支持公众参与的语言。就公众参与环境影响评估制定行政指南的工作似乎没有进展。在一项具有积极意义的进展中，《中华人民共和国刑法》2011年修正本扩大了环境刑事犯罪定义的范围。在该领域中实行法治仍然面临重大挑战，包括执法不力以及不遵守环境法律法规的行为。\n尽管在公共利益法律方面可能取得进展，但通过正式途径寻求法律救济依然困难重重。2011年10月，云南省的一个环保审判庭受理了一项环境公共利益诉讼，该诉讼由非政府组织和一个地方环保局联合提出。但是，普通公民在提出环境诉讼方面继续面临障碍，包括法官不愿意受理此类案件。\n在本报告年度内，当局还继续骚扰并在某些情况下拘留环保人士，包括刘福堂、吴立红和张长建。2012年2月，四川省当局拘留了道孚县环境保护协会的三位环保人士。另外，在许多案例中，公民由于投诉环境污染问题而受到官员的报复。\n污染引发的抗议正在增加，常常被公民用作寻求公正或减轻环境危害的最后手段。据报道，官方和学术界报告说，抗议次数的年度增幅在20-30%，但学术界的报告说实际数目被保密。在某些案例中，抗议者造成破坏，当局殴打、拘留抗议者，甚至把抗议者判刑。\n一些地方当局采取步骤在某些方面提高环境信息透明度，但在另外一些地方鲜有进展。有一份报告突出表明，透明度较高的东部沿海地区和西部及中部地区的信息公开差距日益增大。一些媒体报道凸显了环境事故不透明现象。另外，中央政府官员正在修订一条法规，如果当前的修订本获得通过，该法规将能够加强政府对环境质量监测与报告的严格控制。但是，在本报告年度内，中央政府的环境部门制定了逐步提高空气质量信息透明度的措施。另外，公民在索取环境数据方面也更加积极主动，不过在获取信息方面依然存在障碍。\n在本报告年度内，国务院发布了《‘‘十二五’’控制温室气体排放工作方案》和一份气候变化白皮书，阐明了减轻和应对气候变化的多项行动和计划。中国领导人承诺提高数据的可靠性和透明度，包括能耗和气候变化数据以及与国际温室气体减排项目相关的基线数据。然而，有报告详细描述了这方面的挑战。\n据报道，某些水力发电大坝项目继续强制居民迁移，并存在任意拘留现象。另据报道，在当局为了治理草原退化和实现畜牧业现代化的项目中也曾出现强制牧民迁移的情况。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n呼吁中国政府停止惩罚从事草根环保活动的公民或利用官方和正式渠道就环境问题提出投诉或寻求保护自身权利的公民。支持中国团体和在中国的美国团体提高公民环境权利意识的努力以及促进对此类权利加以保护的努力。把环境法律问题纳入中美人权对话和中美法律专家对话。\n支持就环境法规的执行和实施工具进行多边交流，此类工具包括环境保险、市场机制、对严重违反环境法律者追究刑事责任、公共利益诉讼机制等。鼓励中国领导人加强环境影响评估程序以及公民对此类程序的参与。与寻求为污染受害者制定公平赔偿制度的中国官员和其他人士接触。\n支持在中国继续扩大环境信息公开范围。介绍美国政府通过‘‘有毒物质排放清单项目’’（Toxics Release Inventory Program）和其他旨在提高环境透明度的项目所积累的经验。支持帮助中国公民了解中国的政府信息公开系统的项目。另外，继续美国政府与有关个人和组织的接触，帮助中国增强能力，改进战略与方法，可靠地测量、报告、发布、核查减排信息。\n鼓励中国环保领域非政府组织的发展，包括在双边项目中鼓励美中两国的非政府组织共同参与。支持加强中国环保领域非政府组织技术和运作能力的努力。\n敦促中国当局终止强迫牧民迁移的做法，根据国际科学与人权规范执行迁移项目。在这方面，敦促当局考虑下列文件中提出的建议：《2012年食物权问题特别报告员提交的报告》；《向联合国人权事务高级专员办事处提交的有关对中国访问的报告，增编》。\n\n# 公民社会\n\n## 调查结果\n\n中国公民社会组织的数目继续增加，它们从事有价值的教育、社会服务和专题倡导工作。但是，由于政府监管方面的制约，独立公民社会的发展受到限制。官方政策旨在控制公民社会的发展，促进中国政府和共产党的目标的组织获准扩大，但须受政府的控制；寻求更独立的运作的团体则被边缘化。\n政府广泛限制公民成立组织的能力违反了《公民权利和政治权利国际公约》第22条保证的结社自由权利，而中国已经签署该公约，并宣布有意批准。\n中国法律承认三大类公民社会组织—— 社会团体（SOs）、民办非企业组织（NGNCE）、基金会。这些组织必须有获得政府批准的业务主管单位，并在民政部或省或地方民政局登记。政府严格限制同一领域中的组织数目，对人员和资金也有最低要求。登记后，一个组织每年还须通过政府审查，并受到主管单位监督。未经登记而试图独立从事活动的组织则被视为非法组织。国家外汇管理局2009年发布的一份通知对外国资金的申报和兑换作了限制，当局对外来资金资助的组织继续持怀疑态度。\n中国官员、学者、政府控制的媒体以及非政府组织领导人继续批评当前的体制。他们指出，许多组织由于找不到业务主管单位而无法登记，而获准登记的组织增加的速度太慢。未登记组织和作为商业实体登记的组织不享受某些税收优惠，不得承包政府项目，不能通过合法途径募集捐款，并随时面临被关闭的风险。官方打击未登记组织的运动依然持续。\n过去一年里，在政府和党认为具有政治敏感性的问题上从事倡导活动的非政府组织继续受到骚扰。据报道，从2012年上半年开始，在广东省的制造业基地展开了对为工人代言的非政府组织的镇压，并在整个夏季持续进行。\n中国官员继续寻求在地方上和省一级简化登记程序，但没有从根本上改变政府在审批和监督所有组织方面承担的角色。过去一年里，委员会注意到在深圳经济特区及云南和广东省出现了此类发展。在国家一级，据说此类建议被搁置。2012年7月，民政部颁布了基金会管理条例，以增进慈善捐款的透明度和问责性。\n据报道，民政部说非政府政治组织和人权组织在登记管理上与其他组织享有平等待遇，但重申在总体上政府有权决定谁有资格成立组织。政府和党还发布了一份意见书，对宗教界参与公众服务进行‘‘鼓励和规范’’，包括要求在成立慈善机构方面给予宗教组织‘‘平等对待。’’但是，该意见书强调必须符合党在宗教方面的基本政策。\n全国人民代表大会常务委员会2012年8月通过了《民事诉讼法》修订本，根据该修订本，法律定义的‘‘有关组织’’有权为维护公共利益向法院提出诉讼，这包括有关环境保护和消费者权益的问题。目前尚不明了这一总体规定在何种程度上包括非政府组织。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n请中国官员就地方政府最近在下列方面推行的改革措施提供最新信息：非政府组织登记、非政府组织通过国内基金会获得的资金和通过政府机构的采购服务获得的支持、非政府组织在公共利益诉讼方面的作用、以及涉及公民事务的其他信息。鼓励这些官员扩大改革范围，放宽对非政府组织的限制，并通过制定全国性法律法规把这些做法向中国其他地方推广。\n促请中国政府不要通过不一致或限制性执法的手段威吓被视为从事敏感工作的团体。请中国政府重新审议国家外汇管理局最近颁布的有关海外向中国组织捐款的通知。强调非政府组织（无论是国内组织还是国际组织）是公民表达不满和寻求救助的渠道，有助于维护社会稳定。反之，指出对公民社会组织更严格的控制可能失去一个可能很有益处的社会‘‘安全阀’’，从而导致不稳定来源增加。与中国官员讨论时，提及清华大学的一份报告，该报告说，尽管政府增加了公共安全支出并加强了对公民社会的控制，社会冲突的发生频率依然在上升。\n采取措施促进作为非政府组织成员的中国公民参加有关国际会议和论坛，支持在美国提供培训机会，帮助他们增强在非营利组织管理、公共政策、公共利益法律维权、战略规划、媒体关系等方面的领导能力。\n\n# 民主治理机构\n\n## 调查结果\n\n在2012报告年度里，共产党继续通过由党委会和党支部组成的网络控制政治事务，这些党的组织存在于各级政府、立法和司法机关、以及企业、大型社会团体（包括工会）、军队和大部分居民社区。党的官员加强了扩大党组织的努力，重点在大学、非国有企业、社会组织和军队中进行党的建设和鼓励效忠党的活动。\n中国的政治体制不符合《公民权利和政治权利国际公约》第25条定义的准则，虽然中国领导人已经签署该公约并宣称有意批准。中国的政治体制亦不符合《世界人权宣言》所陈述的准则。在本报告年度内，至少有一位中央领导公开谈论‘‘政治体制改革’’。但是，其谈话缺乏细节，并且任何建议的改革措施仍然是在一党控制的框架内。地方政府采取的措施旨在增进官僚机构的效率和加强公众对党的信任。\n对于依照中国宪法和国际人权准则行使集会、言论、示威、结社自由权利的民主人士，当局继续予以拘留和逮捕，并判处徒刑。在本报告年度内，当局对此类人士的量刑特别严厉，被判刑的人士包括、陈卫、陈西、李铁、朱虞夫和薛明凯。过去四年里被判处长期监禁的其他民主人士仍然身系囹圄，其中包括刘晓波、刘贤斌、郭泉、周永军、谢长发和黄成城。\n党继续以‘‘社会管理’’和维持‘‘社会稳定’’的名义通过各级机构进一步深入公民的社会生活，以加强党的合法性及对政治领域的控制。党和政府领导人计划在党的领导下建立由政府、社会组织和公众参与的‘‘社会管理体制’’。群众组织、居民委员会、工作人员、学生和普通公民将协助完成社会管理任务，包括监视公民。\n在本报告年度内，乡镇和县两级继续举行地方人民代表大会代表的选举。党的领导机构通过派往基层的督查组影响选举，这些督查组承担控制和监督任务。在有些地方，督查组采取行动‘‘优化’’候选人名单。官员们还采取其他多种措施干预地方人大选举，防止独立候选人被提名或当选为代表。\n‘‘村委会’’选举在中国已经普及；但是，实施过程依然存在问题。持续发生的问题包括贿选、一人投多张票、取消选举、乡镇官员干预、缺乏透明度、上层官员‘‘优化’’村委会的人员组合。\n据报道，中央领导机构鼓励加强政府信息公开（OGI）程序和政策，并澄清了信息公开的条件。主动公开信息的情况依然少见。公民继续积极主动地索取公开政府信息。然而，公民在获取信息和就违反公开政府信息的做法向法院提起诉讼方面依然面临挑战。\n中央和省级领导机构鼓励增强政府问责性的政策。但是，缺乏问责的问题依然存在。一家官方媒体在2011年10月报道说，在某些地区，基层领导实行‘‘选择性治理’’的现象很普遍。王立军、薄熙来和谷开来的案件反映了政府机构缺乏问责、滥用职权和不透明等问题。\n据报道，腐败现象依然很普遍，中国当局采取了监管步骤以解决这个问题。国有企业和事业单位的腐败增加。为举报者提供的保护依然不足，当局仍旧不允许政府之外的其他方介入反腐败的措施。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持旨在揭示中国共产党结构、功能和发展的美国研究项目，包括对党在政府机构内部、非国有企业和社会组织中的作用进行研究的项目。敦促中国官员进一步提高党的事务的透明度。支持美国公民进行的旨在理解中国向‘‘社会管理’’转移的研究。询问最近党政官员小组‘‘下农村’’的运动。\n呼吁中国政府释放因行使公民权利要求在中国实行政治改革而被拘留或监禁的人士以及本报告中提到和收录于委员会政治犯数据库中的其他良心犯，包括陈卫、陈西、李铁、朱虞夫、薛明凯、周永军、刘晓波、刘贤斌、郭泉、谢长发和黄成城。\n支持美国国会与全国人民代表大会及中国人民政治协商会议成员之间的实质性交流，特别侧重于国会的监督职能以及回应公民要求的职能。支持美国公民进行的关于中国基层政治和社会发展的研究。增设中国各地的领事馆，以增进对中国的理解。\n支持美国或中国团体进行的有关中国村委会和地方人大选举的研究，并为从事下列活动的项目提供支持：扩大国内选举监督系统、培训中国国内选举监督人员、美中联合开展的选举监督活动。\n支持寻求与中国地方政府合作提高透明度和问责性的美国或中国组织，特别侧重于扩大和改进中国政府公开信息计划的努力。此类项目可能包括在地方上更好地宣传《政府信息公开条例》的联合行动以及为公民和团体提供的有关索取公开政府信息的培训。\n支持协助地方政府、学术界和非营利组织增加透明和公开的听证会及公民参与决策程序渠道的项目。此类项目可能包括在中国进行的一些试点，把公民就法律、法规或政策草案对当局提出的建议向公众公开。\n\n# 商业领域的法治\n\n## 调查结果\n\n2011年12月11日是中国加入世贸组织（WTO）十周年。中国加入世界贸易组织的支持者们曾经希望中国获得该组织的成员资格会在中国带来变革，因为当时中国似乎正在发展市场经济。但是，中国政府违反了世贸组织规则，并且‘‘利用了该系统’’。在过去五年中，中国政府发展了与世贸组织不一致的国家资本主义体系，并且加强了国家对经济的干预。\n自从加入世贸组织以来，中国曾涉及数起世贸组织案件。2012年3月，美国经与欧盟和日本协调在一个限制稀土、钨和钼出口的案件中要求与中国谘商，7月，世贸组织成立了一个专家小组处理这起争议。美国还在另外两个有关汽车工业的案件中向世贸组织投诉。第一个案件于七月提出，质疑中国向某些来自美国的汽车征收反倾销税和反补贴税。2012年9月，美国在第二个案件中要求谘商，质疑中国为汽车和汽车配件制造商提供某些出口补贴。\n据报道，中国政府恐吓某些对中国未能遵守世贸组织规则表示关切的外国公司，威胁说‘‘如果外国公司批评有争议的中国政策或被认为与其本国政府合作对此等政策提出质疑，就拒绝给它们颁发必要的许可或对它们采取其他报复措施’’。这使得其他世贸组织成员难以在该组织对中国进行投诉。\n进入中国的外商投资必须经过政府审批，以确保符合中国的经济增长政策。2012年，中国政府修改了外商投资产业指导目录，列出了鼓励、限制或禁止投资的产业。允许对未列出的产业进行投资。中国当局于1995年首次发布外商投资产业指导目录，此后作了五次修订，包括2012年进行的修订。2012年的修订本反映了2011年3月通过的‘‘国民经济和社会发展十二五规划纲要’’中阐述的政策，包括有关发展七个‘‘战略性新兴产业’’的政策。\n境外中资持续增加，投资形式为合并与并购，涉及的行业主要有采矿、制造、交通运输、电力、以及零售和批发。与外商对中国的投资类似，境外中资也受到严格地监管。\n据美国财政部发布的数字，从2010年6月至2012年5月15日，人民币相对美元升值约8%，但人民币估值依然偏低。然而，中国采取了多项措施放宽对跨境资本流动的管制，以便使人民币走向国际化。\n在2012报告年度内，中国继续面临严重的食品安全问题，影响到中国和其他国家（包括美国）的消费者。虽然中国采取了若干监管措施及其他措施解决食品安全问题，此类措施的有效性有限；当局很难控制中国分散的小型食品生产者。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n制定和支持一个项目，基于世贸组织的要求调查中国的产业政策对中国经济的影响，包括这些政策的制定及其对中国经济的指导作用如何影响透明度、法治、以及中国履行其国际承诺的状况。\n通过美国贸易代表办公室、国际贸易执法中心或其他渠道进行一项全面的研究，了解中国当局如何恐吓或报复批评中国政府政策或行动的美国公司。支持美国贸易代表制定或加强一项战略，对中国当局借以恐吓或报复美国公司的监管程序——包括批准程序及其他行政许可程序——提出质疑。\n通过美国贸易代表和美国商务部为一方、中国商务部、国家发展与改革委员会和国有资产监督管理委员会为另一方的双边对话，了解境外中资（不包括金融产品）的详细数额、中国当局审批此类投资时参照的标准、以及此类投资的资金来源。\n实施能力建设项目，帮助中国食品安全监管人员了解美国在食品安全方面的最佳规范。通过立法授权美国食品和药物管理局在中国增设办事处和增派检查员；支持美国检查员、生产者和食品安全专家在中国举办的培训项目；确保从中国出口至美国的受监管产品经过中国有关部门的认证。\n\n# 司法公正\n\n## 调查结果\n\n在委员会的2012报告年度中，中国公民在就不公正待遇提出投诉方面依然面临重大困难。当局继续促进有中国特色的‘‘和谐’’社会主义社会。过去一年中的重大政策和法规反映了党对处理社会冲突和维持稳定继续而感到担忧。\n党和政府官员继续限制司法独立，并对法院和法官进行政治控制。尽管《中华人民共和国宪法》第126条专门提出保证司法‘‘不受行政机关、社会团体和个人的干涉’’，中国的司法部门依然受到许多内部和外部的控制——从政法委到官员的干预——显著削弱了司法部门独立裁决的能力。\n在本报告年度内，中国公民继续以请愿的形式申诉冤屈。‘‘信访制度’’（常常译为‘‘信函与访问’’）是在正式司法程序外提供的一种渠道，公民可借以申诉冤屈，请求对政府、法院和共产党作出的决定重新裁决。\n通过信访申诉冤屈的公民继续面临主要是来自地方政府的报复、骚扰、暴力和拘留，这种情况与拦截上访的奖惩机制相关。在这一年中，一些中国媒体报道说，公民‘‘信访不信法’’。\n在2012报告年度内，政府和党的官员继续推动把‘‘人民调解’’用作维护社会稳定的工具。最高人民法院院长王胜俊在对全国人民代表大会提交的工作报告中强调了调解在解决纠纷中的作用，并重点指出2011年有67.3%的民事案件成功调解或撤诉。\n在本报告年度内，官方宣布增加了法律援助资金，并扩大法律援助的方案。2012年2月，司法部报告说接受法律援助的案件显著增加。2011年，地方法律援助机构总共办理了844,624起案件，比2010年的统计数字上升16.1%。在这一年里，中央政府为法律援助拨款2亿元（3140万美元），比前一年度的一亿元（1570万美元）明显增加。2011年，中央专项彩票公益金为法律援助提供的资金增加至一亿元，2010年该项资金为5000万元（780万美元）。\n各级政府官员继续遏阻、恐吓和拘留就‘‘敏感’’问题、案件和客户提供代理服务的人权律师。官员们采取多种手段，包括派出警察监视维权人士的住宅；迫使他们前往未知地区或与安全官员会见并‘‘喝茶’’,以及监禁他们。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持美国国务院的国际访问者领导力项目以及其他双边交流项目，请中国人权律师、维权人士和学者前来美国学习和对话。支持与中国人权律师和非营利法律组织合作的非政府组织和学术机构举办的类似项目。\n支持与中国的刑法辩护律师、法律专业人员和法学院进行交流，开展法律援助方面的教育和培训活动。\n继续追踪中国政府把调解作为解决纠纷的优先方法的政策。清楚地了解这种方法对中国公民寻求法律公正的帮助以及中国政府执行国际准则的状况。\n就寻求申诉冤屈的上访人员受到的待遇向中国当局表达关切，鼓励中国领导人重新审议导致在地方一级虐待他们的奖惩机制。\n对继续骚扰人权律师和维权人士表示反对。呼吁释放由于为中国公民辩护和促进其权利而被在家中非法软禁、‘‘失踪’’或受到官员骚扰的律师和活动人士。\n\n# 新疆\n\n## 调查结果\n\n中国政府和共产党领导机构继续在新疆维吾尔自治区（XUAR）严重侵犯人权。新疆维吾尔自治区当局利用安全政策压制和平表达与异议活动，尤其是在维吾尔人中。当局使用‘‘三股势力’’标签（恐怖主义、分裂主义和宗教极端主义）来对付和平表达政治异议的活动和不受官方控制的宗教活动，同时以有限和相互矛盾的信息作为恐怖主义或分裂主义威胁指控的佐证。中国政府继续掩盖与2009年7月乌鲁木齐市发生的示威和骚乱相关的受审人士的信息。2011年新疆维吾尔自治区因危害国家安全罪（中国当局用于处罚公民活动人士和异议人士的一种罪名）受审的人数超过2010年的人数。\n在委员会的2012年报告年度内，中央政府领导的开发项目（近年来当局加强了此类开发项目）削弱了维吾尔人和其他非汉族群体维护自己的文化、语言和谋生方式的权利。当局加强了2010年中央政府和党的领导人在北京召开的新疆工作座谈会宣布的地区发展目标。新疆维吾尔自治区当局加强了将农民和牧民迁移出草原和定居的做法。\n在本报告年度内，当局加强了反对‘‘非法宗教活动’’的力度，并对新疆维吾尔自治区的宗教活动保持严厉的法律限制。当局继续利用‘‘宗教极端主义’’这一令人恐惧的罪名对伊斯兰教活动实施控制，继续将‘‘宗教极端主义’’视为威胁该地区稳定的‘‘三股势力’’之一，并在安全工作中以宗教活动为防范目标。一些穆斯林继续因与宗教信仰相关的活动被监禁。根据委员会的观察，本报告年度内关于阻止男人留‘‘大胡须’’和妇女披面纱或被视为是有宗教意义的衣服的官方运动的报道增多。政府官员要求新疆维吾尔自治区一些接受社会福利的人同意不披面纱或留大胡须。政府官员还继续对伊斯兰教斋月假期的活动进行控制。\n新疆维吾尔自治区的一些政府和私营雇主继续歧视非汉族（即‘‘少数民族’’）求职者。当局还继续推行‘‘将过剩的农村地区劳动力’’转移到其家庭所在地之外的计划，该计划以非汉族青年男女为对象。\n中国政府的开发政策继续阻止维吾尔人保持自己的文化传统。作为2009年开始的五年项目的一部分，当局继续拆毁和重建喀什噶尔老城区。该项目要求老城区的22万名居民搬迁，并对文化遗产保护造成损失，因而受到维吾尔族居民和其他观察家的反对。政府媒体还报道了在新疆维吾尔自治区各地的传统维吾尔族社区展开的拆迁活动。新疆维吾尔自治区当局声称，截至2015年整个自治区将‘‘重建’’150万套住宅。\n过去一年里，西方媒体报道说中国当局将2009年从柬埔寨遣返中国的寻求政治避难的20名维吾尔人中的16名分别判处了16年监禁至无期徒刑。中国政府官员此前曾将一些寻求政治避难的人与恐怖主义联系在一起，但这些人受到的实际指控不明。受中国影响的邻国对于寻求政治避难者的遣返引起了关切。人们担心，由于中国的影响力及其无视国际法的做法，寻求政治避难的维吾尔人在被遣返后可能面临不公正审判、酷刑和其他类型的虐待。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n支持通过立法增加美国政府提供的资源，提高人们对新疆维吾尔自治区人权状况的意识，保护维吾尔族文化，增加维吾尔人保护自己的人权的途径。\n就新疆维吾尔自治区的人权状况向中国政府官员表达关切，谴责利用治安管理运动压制人权的做法。呼吁中国政府释放因倡导自身权利或个人与维权人士有关联而被监禁的人士，包括海来特•尼亚孜（Gheyret Niyaz）（2010年因接受外国媒体采访后以‘‘泄露国家机密’’的罪名被判处15年监禁）；努尔买买提•亚森（Nurmemet Yasin，音译）（2005年因写作一篇短篇小说以所谓‘‘煽动民族仇恨或歧视’’或‘‘煽动分裂主义’’的罪名被判处10年监禁）；阿里木•阿布都热依木和阿不力克木•阿布都热依木（Alim and Ablikim Abdureyim，音译）（活动人士热比娅•卡德尔（Rebiya Kadeer）的成年儿子，于2006年和2007年因所谓的经济犯罪和‘‘分裂主义’’罪行分别被判处七年和九年监禁）；以及本报告中提及和列入委员会政治犯数据库中的其他人士。\n呼吁中国政府提供与2009年7月新疆维吾尔自治区示威和骚乱相关的每一名被拘留、指控、审理或判刑人士的详细情况，包括每一个人的姓名、对每一个人提出的指控（如有）、检察院名称和地点、审理每个案件的法院以及关押或监禁此等人士的每个设施的名称。呼吁中国政府确保与2009年7月事件相关的犯罪嫌疑人能够聘请一位律师，依照《中华人民共和国刑事诉讼法》第33条和96条的规定行使聘请法律辩护人的权利，并确保犯罪嫌疑人能够自己选择法律辩护人。\n支持关注新疆维吾尔自治区人权问题的非政府组织，使他们能够继续搜集有关该地区状况的信息，并制定计划帮助维吾尔人增强维护自身权利及保护自己的文化、语言和传统的能力。支持致力于对新疆维吾尔自治区播音并从该地区采集新闻的媒体机构，以增强其对该地区进行报道的能力，为自治区居民提供未经审查的信息。向拥有维吾尔语藏书的图书馆提供支持，以便提高此类图书馆搜集和保存新疆维吾尔自治区书籍和期刊的能力。支持能够开展对于新疆维吾尔自治区的研究和采取措施来保护维吾尔有形和无形文化遗产的组织。\n呼吁中国政府支持在新疆维吾尔自治区制定促进广泛保护自治区居民权利的政策，并允许自治区政府在作出开发决定时行使地区自主权。呼吁中央政府和自治区当局确保均衡的开发，不仅促进经济增长，而且广泛尊重自治区居民的公民和政治权利，并使这些社区能参与决策。\n对于喀什噶尔老城区的拆除以及在新疆维吾尔自治区各地的传统维吾尔族社区进行的拆迁活动表达关切。 呼吁当局确保开发项目考虑到非汉族的具体需求和意见。由于自上而下的开发政策，他们在保护自身权利方面面临独特的挑战，并且没有成为该地区经济增长的受益者。呼吁当局确保居民能够对迁移计划发表意见，并获得足够的迁移赔偿。呼吁当局采取措施保障牧民保护其文化和生活方式的权利。\n呼吁中国政府确保政府与私人雇主遵守禁止基于民族归属进行歧视的法律条款，停止在人员招聘时为汉族人保留职位的做法。呼吁当局追踪为非汉族人促进就业机会的地方指令的执行状况，非汉族群体在就业市场中依然面临歧视。有报道说在把非汉族农村男人和妇女转移至中国其他地区就业的过程中存在强迫劳动和剥削现象，呼吁中国当局对此展开调查。\n呼吁中国政府说明2009年12月从柬埔寨遣返中国的寻求政治避难的维吾尔人的下落及其当前所处的法律状态。与中国官员、国际难民机构官员以及维吾尔难民的过境国和目的地国官员讨论维吾尔难民与寻求政治避难者的状况。呼吁中国官员以及过境国和目的地国官员尊重寻求政治避难者以及联合国难民事务高级专员办事处指定的难民身份和其他国家指定的难民和公民身份。呼吁维吾尔寻求政治避难者、难民和移民的过境国和目的地国遵守1951年《关于难民地位的公约》和《反酷刑公约》对遣返作出的规定。\n\n# 西藏\n\n## 调查结果\n\n自从2010年1月第九轮对话以来，达赖喇嘛的代表与中国共产党和政府官员之间的正式对话已经停止，这是自从2002年恢复对话以来终止时间最长的一次。在委员会2012报告年度内，中国官员重申了阻止藏人寻求保护自身文化、语言、宗教和环境的立场，同时力图迫使达赖喇嘛支持共产党在西藏历史以及中国和台湾关系上的立场。达赖喇嘛的代表——他的特使和使节——在2012年6月1日辞职，给出的理由之一是‘‘鉴于2008年以来藏区局势持续恶化，导致藏人自焚事件越来越多。’’\n在过去一年里，藏人自焚事件急剧增加，并从四川省扩大到青海省、甘肃省和西藏自治区（TAR）。据报道，从2011年10月（委员会报告年度起始月份）到2012年8月27日期间，有45名藏人自焚（39人死亡）。另据报道，在自焚者要求西藏自由和达赖喇嘛返回的同时，中国政府和共产党加强采用法律手段镇压和控制西藏文化的核心要素，中国政府与达赖喇嘛的对话没有任何取得进展的迹象。党和政府并未表现出任何以积极的态度考虑藏人的不满意见的意愿，亦无意对藏人拒绝接受中国政府的政策承担责任，反而将出现的危机视为对国家安全和社会稳定的威胁，并不是视为政策的失败。\n西藏佛教徒的宗教自由状况急剧恶化。中国政府和共产党采取了前所未有的措施，进一步加强对藏传佛教和寺院机构的控制，力图将它们改造成忠于共产党和热爱中国的实体，同时试图彻底消除达赖喇嘛对藏人的影响。中国官员在西藏自治区开设了一所 ‘‘藏传佛教综合学校’’，党期望通过这所学校建立与目前党和政府的目标保持一致的宗教‘‘正常秩序’’。党在西藏自治区的所有寺院和尼姑庵内成立了管理委员会，管理委员会的成员是党和政府官员。达赖喇嘛在一份签名的声明中拒绝接受共产党试图利用历史扭曲和政府规章对藏传佛教徒遵奉的老师传承转世制度进行前所未有的控制。\n对于藏人保存自身文化和语言及其长久性和生命力的愿望，党和政府加大了压力和干预力度。一名对西藏政策很有影响力的资深共产党官员表示赞成民族同化和结束或改变一些可能使少数民族文化受益的政策，例如用少数民族语言开设教育课程。如果此类观点被实施，可能对藏人的文化和语言特性造成不利影响，并进一步加深对中国政府的不满情绪。共产党对西藏自治区的每一个村派驻了众多的干部，以便加强党对基层的控制。第一批派出的人员至少会延续到2014年年底。公安人员继续拘留藏族作家、艺人和文化倡导者；藏族学生继续抗议语言政策。\n党和政府继续强力推行‘‘坚持走有中国特色、西藏特点的发展路子’’，这是中共中央政治局于2010年制定的一项政策，该项政策要求藏族文化和藏人的理想从属于党的经济、社会和政治目标。一位对西藏政策很有影响力的资深共产党官员要求少数民族地区的发展策略‘‘巩固国家统一和中央权威’’，并在各民族中促进和建立不可逆转的‘‘混居’’。西藏自治区官员呼吁加快铁路建设；中央政府发布的一份意见书要求至2015年‘‘基本’’实现全国（包括西藏高原）所有游牧民的定居工作。官员们继续拘留认为开发计划对环境有害并进行抗议的藏人。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n敦促中国政府与达赖喇嘛或其代表无先决条件地进行实质性对话，议题包括在西藏自治区（TAR）、藏族自治州和青海、甘肃、四川、云南的多个县保护藏族文化、语言、宗教和传统。随着藏族地区的紧张局势继续升级以及藏人表达对达赖喇嘛的敬仰，中国政府如决定开展对话可能导致对中国政府和藏人双方均有益的持久结果，并将改善今后几十年的地方和地区安全展望。\n敦促中国政府考虑政府监管措施和党的政策在藏人自焚浪潮中的作用。向中国官员指出，如果政府和党以建设性的方法化解藏人的冤屈，结果可能会对国家安全和社会稳定有利；另向中国政府官员指出，强化使得藏人最愤怒的措施和政策不可能导致被视为与‘‘社会稳定’’或‘‘和谐社会’’一致的状况。\n建议中国政府停止建立干涉藏人自主权的管理委员会，并停止推行侵犯和压制藏传佛教徒宗教自由权利的法律措施，向中国政府指出这样做的紧迫性和重要性。向中国政府官员指出，政府和党领导的建立藏传佛教新‘‘秩序’’的运动与国家尊重‘‘宗教信仰自由’’的政策不一致；同时指出，通过强力推行监管措施、‘‘爱国’’和‘‘法律’’教育以及反对达赖喇嘛的运动对藏传佛教徒施加更大的压力可能会危害‘‘社会稳定’’，而不会保持社会稳定。敦促中国政府尊重藏传佛教徒按照藏人自己的方式和传统挑选和教育宗教导师的权利。\n西藏自治区政府主席2010年声称，达赖喇嘛1995年确认的班禅喇嘛更登确吉尼玛（Gedun Choekyi Nyima）当时正在与自己的家人在西藏自治区作为‘‘普通公民’’生活，请中国政府就此提供进一步信息。敦促中国政府邀请一个国际组织的代表与更登确吉尼玛会面，以便更登确吉尼玛向该国际组织代表表达自己有关隐私权的愿望；让国际代表与更登确吉尼玛在一起合照；并发布更登确吉尼玛的声明和该照片。\n向中国政府表达尊重和保护西藏文化和语言的重要性。敦促中国官员尊重中国宪法中的言论、结社、集会和宗教自由条款，不要利用安全部门、法院和法律侵犯和禁止藏人行使此类权利，从而增强西藏文化的活力。敦促官员们尊重藏人的愿望，允许在讲授现代学科时使用藏语和汉语两种语言，而不是通过终止现代学科的藏语教学使藏语处于劣等地位。\n鼓励中国政府在规划中国藏族地区的基础设施、自然资源开发以及定居或迁居项目时使充分考虑藏人的观点和意愿。鼓励中国政府聘请适当专家参与评估此类项目的影响，并就此类项目的实施和进展状况向中国政府提出建议。\n增加对美国非政府组织的支持，以制定项目，协助藏人提高和平地保护和发展自己的文化、语言和传统的能力；帮助改善居住在中国藏族地区的藏人的教育、经济、健康和环保状况；给藏人带来可持续的益处，而不要鼓励藏人之外的其他族裔大量涌入这些地区。\n继续向中国政府表达把和平的藏人抗议者和骚乱者区别开来的重要性；谴责利用治安运动压制人权的行为；请求中国政府提供以涉及抗议的罪名被拘留、指控或判刑的藏人的详细信息。在与中国官员会谈和通信时，继续提出以和平方式行使人权而遭受监禁的藏人的案例，其中具有代表性的案例包括：前西藏僧侣晋美嘉措（Jigme Gyatso，音译）（因印刷传单、分发海报和后来在狱中呼喊亲达赖喇嘛的口号共被判处18年的延长刑期）；僧侣曲因克珠（Choeying Khedrub，音译）（因印刷传单被判处无期徒刑）；晋美丹增尼玛（Bangri Chogtrul，音译）（被藏传佛教徒视为转世喇嘛，因‘‘煽动分裂主义’’被判处无期徒刑，后减至18年刑期）；以及牧民荣吉阿扎（Ronggye Adrag，音译）（因在公共庆祝活动中大声呼喊政治口号被判处8年刑期）。\n鼓励中国政府尊重在国内旅行的藏人的自由行动权，包括为访问西藏经济、文化和宗教中心（包括拉萨）的旅行；向藏人提供合理途径以便他们申请和收到合法国际旅行所需要的文件；尊重中国藏族公民在国外旅行后重新进入中国的权利；允许外国记者、非政府组织代表、联合国代表和美国政府官员进入藏族自治区域。\n\n# 香港和澳门的发展\n\n## 调查结果\n\n在委员会2012报告年度内，香港举行了自从立法会（LegCo）于2011年通过实施选举改革的立法以来的首次选举，但选举改革未达到香港的《基本法》有关普选条款的要求。2012年3月，由1200名成员组成的选举委员会以本质上不具民主性的程序选举了香港的行政长官。选举在很大程度上受到大陆政府的干涉，漠视了‘‘一国两制’’的原则。\n2012年9月9日，香港举行了自从2011年选举改革以来的首次立法会选举。民主人士获得了根据选举改革设立的五个新议员席位中的三个席位，并保留了阻止对香港法律作出‘‘重大变更’’所需的三分之一议员，这对立法会审议有关2017年选举的立法可能至关重要。但是，亲北京派掌控的席位也有所增加，因此可能导致立法僵局。\n在立法会选举前的一段时间，成千上万的人参加了反对富有争议的香港‘‘国民教育计划’’的示威游行，一些香港学生和老师为抗议该项计划开展了绝食活动。面对示威游行，香港行政长官梁振英撤销了到2015年学校开始教授北京支持的课程的要求。此项计划由前行政长官曾荫权于2010年提出，《人民日报》辩解说它与其他国家的‘‘爱国主义教育’’无异。但是，在《纽约时报》的一篇专题文章中，曾于2012年7月参加反对该计划游行示威的一位香港家长指出该新课程是‘‘片面的、对共产党统治绝对正面的描述……’’\n一个新闻记者组织认为，2011年香港的新闻自由状况恶化，致使香港的国际排名从前一年的第34位下降为第54位。另一个组织将香港的新闻界归入‘‘部分自由’’的类别。香港的新闻记者报道说新闻自由状况恶化，其中一位知名的代表列举了多种原因，其中包括政府对信息的管制、粗暴对待新闻记者、拒绝媒体对一些活动进行报道、限制记者在政府办公机构周围的行动、自我审查和媒体机构审查，其中很多媒体机构的业主在中国拥有商业利益。\n澳门政府提议对其选举系统进行改革，并向大陆的全国人民代表大会常务委员会征询有关改革程序的意见，还进行了两轮咨询活动。第一轮咨询活动包括八次会议，其中只有一次会议允许公众参加；第二轮咨询活动包括十次会议，其中只有三次会议允许公众参加。最终的改革幅度很小。一些民间组织认为咨询活动被操纵，以便‘‘编造’’公众意见。全国人民代表大会常务委员会于六月批准了提议的改革，规定在立法会中增加两个直选席位和两个非直选议员，并将行政长官选举委员会的人数从300人增加为400人。澳门立法会于八月通过了提议的改动，此前一名立法会议员将这次改动称为‘‘民主的倒退’’。\n\n## 建议\n\n委员会鼓励美国国会议员和行政部门官员：\n\n在到中国大陆访问时，继续尽最大努力访问香港。美国政府代表团在香港举行的会晤应当包括与香港立法会成员、香港政府行政官员、司法机构成员和新闻记者组织代表的会晤。此类会晤显示美国对基于‘‘一国两制’’在香港实现高度自治和法制的支持。\n在与中国政府官员会晤时，敦促他们允许香港人享受《基本法》和《中英联合声明》中阐明的高度自治，尤其是在涉及普选产生的问题上，并在遵循香港人民意愿的基础上允许实行‘‘一人一票’’的普选。\n在到中国大陆或香港访问时尽量访问澳门。在澳门与立法会议员（尤其是直选议员）、澳门政府行政官员和政府之外的领导人会晤。\n支持和鼓励各类机构和组织制定适当项目，在澳门支持民主发展、加强民主实践和法治。"
		},
		{
			"post_id": 11,
			"title": "CECC 简介",
			"date_published": 1520837708.764,
			"body": "美国国会及行政当局中国委员会（Congressional-Executive Commission on China，简称CECC）是美国国会于2000年10月成立的独立委员会，通过H.R.4444号法案成立，被赋予的法律职能是“监察中国法治发展和人权”，并于每年向美国总统和美国国会提交一份年度报告。\n\n* * *\n\n## 职能\n\nH.R.4444号法案中规定委员会的职能是：\n\n监督中华人民共和国国内符合或违反人权的行为，包括但不限于《公民权利和政治权利国际公约》和《世界人权宣言》中的各种具体权利。\n列出所有可能由于追求以上权利而被中华人民共和国政府囚禁、拘留、软禁、折磨或起诉的人的名单。\n监督中华人民共和国法治进展。\n监督并促进美国政府和私有组织发展有利于增进中美两国人员和思想交流或扩展中美两国人权法治方面合作的计划项目和活动。\n联络非政府组织：包括以适当的方式寻找特定的非政府组织并与其建立、保持联络，接受后者的报告与更新并对其进行评估。\n与美国国务院西藏事务特别协调官合作。\n每隔12个月，向美国总统和美国国会提交一份年度报告，介绍上一年中第1至3项工作方面的进展和发现。报告可以包括对立法和行政上的建议。\n在年度报告提交后的30天内，美国众议院国际关系委员会应当就报告中内容和建议举行听证会，以向众议院提出进一步的相关建议。\n向美国总统和美国国会提交年度报告的补充报告。\n\n## 工作\n\n2002年至2012年，国会及行政部门中国问题委员会共计提交了11份年度报告，包括对国会在与中国外交方面的多个建议。2002年的报告中提出的建议包括：\n\n美国总统、政府高级官员和国会成员访问中国时提起人权问题。\n国会和行政当局扩大政府通过电台、电视和互联网向中国传播人权、劳工权和法治相关信息的努力。\n国会拨款至大学和非政府组织中，大力专门培养和中国有联系的美国宗教组织和其他机构的人员，以便帮助相关宗教领袖维护其宗教活动的自由。\n国会拨款非政府组织，以改善西藏少数民族的卫生、文化、教育情况。\n国会拨款非政府组织，以促进维吾尔文化保存和完善的项目。\n国会和行政当局向相关的法律事务所提供帮助，以便在和劳工权利相关的案子中增大获得法律代理的可能性。\n美国政府努力促成在特定地区和行业有共同生意的美国公司、中国公司与第三国公司参加的会议，共同寻找劳工权利侵犯的情况。\n国会拨款于合适的非政府机构，以培训中国的刑事辩护律师，促进中美刑事辩护律师的交流。\n\n## 经费\n\n委员会的活动经费由美国国会拨款，委员会必须就其在每一个税务年中的支出向国会提交报告。\n\n* * *\n\n> 以上内容来自维基百科，内容严重滞后，以下为博主补充：\n\n该组织自2002年起每年十月发布年度报告，自2012年起补充发布《年度报告执行摘要中文翻译》\n\n博主将搬运这部分并称之为《XX年CECC人权报告摘要》"
		},
		{
			"post_id": 10,
			"title": "人权观察 (HRW) 简介",
			"date_published": 1520837223.164,
			"body": "人权观察（Human Rights Watch，简称HRW）是一个美国创立的非政府的国际组织，总部设在美国纽约，在阿姆斯特丹，贝鲁特，柏林，布鲁塞尔，芝加哥，日内瓦，约翰内斯堡，伦敦，洛杉矶，莫斯科，内罗毕，巴黎，旧金山，悉尼，东京，多伦多，华盛顿特区和苏黎世设有办事处。以调查、促进人权问题为主旨。\n\n* * *\n\n## 简介\n\n人权观察根据世界人权宣言等广为接受的人权标准，撰写国际人权违反状况的研究报告。通过国际社会对暴行的关注，进而促进政府和国际组织的改革。研究者针对可疑的境况进行取证调查，并在本地和国际媒体上刊登报道。人权观察的报告中，凸现的问题包括种族歧视、性别歧视、刑讯逼供、童兵、政治腐败、以及司法公正问题。人权观察记录和报告对战争法和国际人权准则的违反情况。\n\n该组织于1978年成立，当时名为赫尔辛基观察，为了监视苏联对赫尔辛基协议的执行情况。日益壮大后，该组织又以“观察委员会”的名义涉及到世界上的其他地区。1998年，所有委员会在人权观察的旗帜下统一起来。Robert L. Bernstein是该组织的创建者之一，并担任主席。\n\n1998年，人权观察作为六个国际非政府组织之一，参与创建了制止使用童兵联盟。该组织还是国际反地雷组织的联合主席，这个国际小组联盟的成功游说促成了渥太华条约的诞生，渥太华条约明文禁止杀伤性地雷。\n\n每年，人权观察对世界各地的那些需要财政援助，并且受迫害的作家提供补助金。这项援助由剧作家丽莲·海尔曼的遗产进行拨款，以海尔曼及其长期伴侣、小说家达许·汉密特的名字命名“海尔曼/汉密特”（Hellman/Hammett）。除了财政支持，海尔曼/汉密特援助还试图提升公众对审查制度的关注。[1]\n\n根据世界人权宣言，人权观察反对基本人权的侵犯，包括死刑、歧视同性恋。人权观察鼓励将自由与基本的人权相联系，比如宗教自由、新闻自由。\n\n人权观察是国际言论自由交流会（International Freedom of Expression eXchange, IFEX）的创始成员。IFEX是一个非政府组织构成的一个全球网络，主要对世界范围内的检查制度进行监督。\n\n人权观察有233名雇员，年预算为2600万美元。[2]\n\n1993年以来，肯尼思·罗斯（Kenneth Roth）一直担任人权观察的执行董事。Roth毕业于耶鲁法学院以及布朗大学，他的父亲于1938年逃离纳粹德国。1981年，波兰颁布戒严令后，Roth开始从事人权工作，而后又忙于海地问题。[3]\n\n## 问题与运动\n\n轻兵器的运输\n地雷\n堕胎权\n同性恋权利\n艾滋病病人的权利\n女权\n战争中平民的安全，反对使用集束炸弹\n童工\n童兵\n流浪儿童\n种族灭绝、战争罪以及反人类罪\n刑讯逼供\n私刑、绑架\n侵犯人权的诉讼\n贩卖妇女及贩卖儿童\n关于乙肝歧视\n\n## 近况\n\n人权观察批评约旦政府逮捕当选官员，仅因为这些官员在纪念伊拉克基地组织领导人阿布·穆萨布·扎卡维死亡的仪式上对其表示赞扬。人权观察还高调抗议在伊拉克领导人萨达姆·侯赛因统治时期发生的屠杀以及政府导致的饥荒。[4]\n\n2007年7月26日，人权观察通报，在西班牙的加那利群岛有数百名移民儿童，状况拥挤肮脏，有可能遭管理者及其他儿童虐待。管理这些机构的加那利群岛政府发表回应声明称[5]，该报告不够严谨，内部调查未能证实人权观察的发现。\n\n## 出版\n\n人权观察对数个主题发布报告，[6]并编译成年度报告，以展现世界各地的人权状况。\n\n人权观察还对1994年的卢旺达大屠杀[7]以及刚果民主共和国的冲突[8]作了深度报告。\n\n## 与国际特赦组织的比较\n\n人权观察和国际特赦组织是仅有的两个全球范围的人权组织，反对压迫与虐待。尽管两者角色相近，却有互相补充的作用，主要不同在于组织结构以及改进措施。\n\n国际特赦组织拥有大量成员，该组织的主要行动通过动员成员来实施。人权观察的主要贡献是其针对人权危机的研究以及长篇报告。国际特赦组织除了进行游说和发表详细的个案报告外，主要通过大量会员写信要求释放良心犯。人权观察则鼓励其他政府对侵犯人权者采取行动，包括公布涉嫌者名单或对某国采取制裁措施。人权观察号召对苏丹总统巴希尔进行惩罚，因为其涉及达尔富尔冲突的人道灾难。\n\n人权观察的文档，通常包括当地冲突地区的政治、历史背景分析，有些甚至发表在学术期刊上。而国际特赦组织的报告分析较少，直接关注于侵犯人权的个案。\n\n## 批评\n\n主条目：en:Criticism of Human Rights Watch\n部分人士批评人权观察政治性的反西方、反中或反伊斯兰，而还有一部分人士则批评人权观察支持西方、支持伊斯兰。一份埃及出版物的报告中提到，“政府经常指责：人权组织（包括人权观察）引入西方日程表，从而冒犯了当地的宗教、文化价值观。”[9]\n\n中华人民共和国政府认为，人权观察在介绍中国事务时过于偏颇、以至于有某种\"政治偏见\"：例如人权观察曾发表对西藏的言论，批评称政府劝诱藏民从“贫穷而稳定”的生活转向现代经济条件下的不稳定生活，称政府诱使西藏人进入水泥房居住，虽然有些人得到了好处，但还是得到人权组织(包括人权观察)的强烈抨击，这种批评带有明显的政治偏见[10][11]。人权观察表示，大规模强制迁移多方面严重违反人权，包括违反居民意愿、补偿过低、新屋质量太差、对错误缺乏上诉管道、藏人对强制迁移政策没有发言权。[12]\n\n2008年，人权观察公布一份报告《查韦斯执政的十年》（A Decade Under Chávez）抨击委内瑞拉在乌戈·查韦斯统治下的人权状况，上百名学者专家连署抗议报告内容充满扭曲与丑化，连署者包括被称为“美国良心”的诺姆·杭士基。[13]\n\n2014年5月，阿道弗·佩雷斯·埃斯基维尔与梅里德·科雷根·麦奎尔寄了一封抗议信《关闭给美国政府的旋转门》（Close Your Revolving Door to U.S. Government）给人权观察，这封抗议信一共获得131名学者专家连署，批评人权观察成员与美国政府之间有着复杂且密切的关系，且批评人权观察对于各国的人权标准经常与美国政府的外交政策及外交利益保持一致，认为这些现象已经损害人权观察的独立性与公信力[14]。2014年6月3日，人权观察网站刊登执行董事肯尼思·罗斯的公开信，条列了人权观察近年来针对美国所撰写的十余项人权报告，内容包括谴责美国中央情报局、批评反恐战争、关心囚犯人权等等，表示人权观察同样关注美国政府侵害人权的行径，并未偏袒美国；但罗斯承认，人权观察董事会成员34人及咨询委员200多人中，确实有部分人士曾经任职于美国政府，但人权观察谨慎确保成员过去的工作关系不影响人权观察的工作内容，以维护人权观察的公正性[15]。\n\n2014年5月，人权观察公布一份报告《惩罚抗议》（Punished for Protesting），报告指委内瑞拉的反政府抗议者正面临政府“系统性的侵权行为”，并认为委内瑞拉的安全部队涉嫌对抗议人士刑求，并认为委内瑞拉的司法体系忽略并容许这些现象存在。2014年6月26日，数十名人权行动者在纽约发起一场小规模抗议，从《纽约时报》办公室前游行到人权观察总部门口抗议，抨击《纽约时报》与人权观察长期自甘于担任美国政府及美国中央情报局的工具，特别是近年来扮演攻击与抹黑委内瑞拉政府的角色，不谴责美国政府涉入程度不一的2004年海地政变、2009年洪都拉斯军事政变等侵害人权的重大事件；人权观察拒绝派员接受抗议者递交的抗议信[16]。\n\n* * *\n\n以上内容摘自 [Wikipedia-人权观察](https://zh.wikipedia.org/zh-cn/人权观察)"
		},
		{
			"post_id": 9,
			"title": "HRW 2010年人权报告：中国",
			"date_published": 1520832590.712,
			"body": "在2009年，中国政府担心一系列\"敏感\"纪念日（如天安门屠杀20周年和中国建国60周年）会引起社会活动，继续实施2008年为奥运会所制定的限制。官方阻挠民间社会组织（包括那些协助2008年5月四川地震灾民的团体和个人），扩大对维吾尔族和藏族的控制，并加强了对律师和维权者的限制。\n\n中国共产党继续保持政治权力的垄断，尽管法律制度有所改革，中共要求司法机构严守其党的路线。公民的言论自由、结社自由以及宗教自由严重受到限制；政府广泛监视和审查互联网通信。虽然中国的国际姿态和经济影响力不断增长，其不优先考虑公民权利和政治权利的外交政策也日益引起国际社会的监督。\n\n* * *\n\n**言论自由**\n\n中国的记者、博客和大约3.38亿互联网用户都任国家检查员独断支配。\n\n中国的言论自由倡导者在2009年6月30日获得一次罕见胜利。中国政府要强迫电脑制造商在中国销售的个人电脑中预先安装互联网过滤软件\"绿坝·花季护航\"，但经过几个星期的激烈批评反对后，决定推迟该计划。批评来自超过3亿的中国网民，外国电脑制造商和国际商业协会也作出前所未有的反对，美国贸易代表和商务部长更声称绿坝·花季护航可能成为对世界贸易组织的挑战。\n\n在此文写作时, 至少有28名中国记者因 \"煽动颠覆\"和\"泄露国家机密\"等不明确的罪名，目前在监狱中服刑刑期。2009年5月, 广东省当局要求国家媒体减少对政府官员和公众抗议的\"负面\"报道，以及其他事件的类似报道。8月31日，广东省南部的东莞市政府雇用的两个私人保安袭击广州日报记者刘满园。记者本想要拍案发现场照片,结果遭到保安殴打，造成他临时住院。\n\n2009年2月13日，中国政府颁布了新\"行为准则\"。准则对外国通讯记者雇用的中国新闻助手构成威胁：他们面临被解雇的可能性，也能因\"做独立报道\"而失去其鉴定合格。外国通讯记者也注意到，在2009年内，特别是临近2008年5月12日四川大地震得一周年时，对新闻来源的报复增加了。例如，在2009年4月6日, 四川省什邡市安全部队暂时扣留了一个因学校倒塌,丧失孩子的父亲。扣留目的是为防止他与德国电视台的工作人员谈话。\n\n在中国的外国通讯记者仍然受到限制，也无法自由出入西藏。在2009年7月5至7日，继乌鲁木齐发生致命暴乱以后, 中国政府批准外国媒体到那，批准的人数与西藏2008年3月开始暴乱时相比, 来得更多。但政府对媒体到乌鲁木齐以外地区-特别是喀什市-实施更多限制。在2009年7月10日，喀什政府当局强迫美联社摄影记者伊丽莎白•达齐尔 (Elizabeth Dalziel) 和《环球时报》、《邮报》的通讯记者马克•麦京农(Mark Mackinnon)离开该城市，原因是未说明的\"安全\"威胁。9月4日, 在乌鲁木齐报道和平公众抗议的三名香港电视新闻记者遭到准军事警察拳打脚踢。9月18日, 一伙不明身份的人袭击来自日本共同社的3名记者，记者当时在北京报道为10月1日国庆阅兵而进行的彩排。\n\n活跃人士也因为代表2008年四川地震灾民而面临迫害。资深活跃人士和[www.64tianwang.com](http://www.64tianwang.com/) (此网站致力于宣传中国的侵犯人权行为) 创始人黄琦，在2009年8月5日受审一天。他因为调查有关劣质建筑造成地震灾区学校倒塌的声称，被指控犯了\"泄露国家机密\"和\"颠覆\"其罪名。谭作人因编纂地震中死亡的儿童这一名单，被控犯\"煽动颠覆国家\"其罪，在8月12日受审。谭据称还企图组织1989天安门大屠杀20周年公众纪念。著名中国建筑师艾未未开始在博客里张贴地震的学生受害者名字后，当局封锁了其博客。在2009年8月12日，警察半夜闯进艾未未在四川省会成都一家酒店住的房间。一名警察向艾的脸挥拳，然后拘留他11个小时，使得他不能在谭的审讯中作证。\n\n**司法改革**\n\n权利意识和司法专业化的进展缓慢，但党政体关继续主宰法律制度。最高人民法院的新院长王胜俊，继续执行2008年\"三高\"运动，强调共产党对司法工作的中心地位。司法人员必须把社会稳定和为消除对党的挑战当先，把法律需求当作次要.\n\n据官方估计,2008年有10万起事件,比1994年的8000件增加了许多。由于日益关注全国内越来越多的公共抗议，最高人民法院在2009年9月宣布了一个培训法官的项目。项目目的是教法官如何处理风起云涌的抗议案件和所谓的\"群体性案件\"；计划声称 \"敌对势力将会利用我国经济社会发展中的暂时困难，内外勾联，煽动制造事端.\"\n\n政府还宣布了对《中华人民共和国保守国家秘密法》的修订，一个人们期待已久的改变。此规则妨碍透明度和媒体自由，而且往往是用来对付人权活跃分子、记者和持不同政见者。提议的修订预计将在2010年采用，其修订对\"国家秘密\"的范围没有多大限制，允许有追溯效力地把资料分类为 \"秘密\", 并将该定义扩大至互联网和电子信息。\n\n刑事司法系统仍然有以下弊端: 警察严刑逼供嫌疑人，缺乏正当程序, 严格限制法律代表。官方指出中国不会在2011年前改革其有严重缺陷的刑事程序法。政府曾作出承诺，允许律师未经警方批准可以会见被拘留的客户，这也仍未兑现。\n\n在一起引起网上激烈辩论的案件中，云南一家拘留所的官员试图向24岁犯人李乔明的家人解释李的死亡原因是_因为_玩_\"**躲猫猫**\"_。后来东窗事发，原来李是因为被持续殴打而死亡，之后官员被解雇。\n\n不过,在2009年8月，新闻报道称当局在起草法案使法庭不接受严刑逼供得到的证词,这是人权组织和中国法律专家的长久要求。\n\n尽管官方政策要减少每年处决囚犯的数目，中国在这方面仍然是世界领先。根据不同的估计, 中国每年处决的人数在3000至一万之间。当局声称，最高人民法院自2007年重获审核这类案件的权力后，驳回的死刑判处有百分之15。\n\n在2009年4月13日，政府发布了第一个《国家人权行动计划》。该计划被描述为政府\"坚定不移地推进中国人权事业\"的证据,却根本没讨论到中国严重和持续的侵犯人权行为,也没有提供策略以结束侵犯行为、惩罚肇事者和协助受害者。\n\n**人权捍卫者**\n\n中国的维权活跃人士与日俱增。在2009年，他们为了继续推进更多的民权和人权，付出高昂的代价。警方监视和监督非政府组织、关键知识分子、持不同政见者和维权律师，并经常对他们做出威胁、警告或软禁，这些行为继续有增无减。政府对数名高知名度的活跃人士采取了前所未有的严厉措施, 而之前， 政府一向对他们的行为都没有如此严厉对待。\n\n在5月下旬,北京司法当局在没有给予任何理由的情况下,拒绝更新中国十几名最著名的民权律师的专业执照,使他们无法行业。对专业执照每年更换的控制仍是中国法律行业独立性的主要障碍之一，但在批准更新执照这方面，北京官员一向来被视为蛮通融的。忆通律师事务所显然是其中一个被针对的对象。事务所里的一些合作伙伴质疑政府控制的北京律师协会的选举方式后，在6月中被判停职半年。\n\n中国最著名的持不同政见者刘晓波被任意拘留6个月后，在6月23日被正式逮捕。刘曾助起草《零八宪章》，此宪章呼吁逐步发展法治和民主。警察是在2008年12月8日逮捕他，这显然是为了防止在国际人权日12月10日发布宪章。数位诺贝尔奖得奖者写信致胡锦涛主席, 呼吁他释放刘。但在6月，新华社宣布刘被指控\"煽动颠覆国家政权\"，其控名是通常用来对付政府的批评者。\n\n7月中旬，政府关闭了公盟，一个新颖的法律援助和研究非政府组织，其创始人许志永和另一名工作人员因涉嫌\"逃税\"被拘留三个星期。北京当局控告许和公盟从耶鲁大学获得资助但没有纳税，并取消其组织的注册。国内和国际社会的谴责可能帮助徐获释，但中国领先的公共利益法非政府组织仍然被关闭。\n\n被当局逮捕的其他重要活跃人士包括谢长发，他试图建立一个中国民主党湖南分支,被判13年徒刑。还有高智晟，自从2009年2月被国家安全人员逮捕后，一直下落不明，官方也继续否认他仍然被拘留。\n\n**流动人口和劳工权利**\n\n中国禁止独立工会，这使得全中国工会联合会成为工人的唯一合法代表。\n\n自2008年全球金融危机以来，估计有2300万人失业，其中大部分是内部流动人口。在2009年有几件案子是因为官员要减少社会动荡风险,所以派出调解员,并支付遣散费。例如, 在2009年1月下旬，深圳市政府官员用政府基金支付拖欠的2100名下岗家具厂工人的工资。其家具厂管理人员在没有支付1000万元 (146万美元）的情况下已潜逃了。\n\n家庭登记，或户籍系统，以一个人的出生地为基础，继续有效地使国内大量流动人口无法获得公共福利,包括医疗保健和子女教育。 2009年3月，广州市政府宣布，将给予流动工人以前只给有户口的居民的权利，其权利包括能获社会保险、职业培训和法律援助。2009年6月，上海市政府推出一项计划：满足严格的教育、计划生育和纳税历史条件的流动人口能获得永久居民身份。但是，这计划只适用于上海600万流动人口总数的一小部分。\n\n**性倾向和性别认同**\n\n在2009年6月,上海举行了中国第一个同性恋节，然后举行了7天的以同性恋、双性恋及跨性别者为主题的电影节。尽管同性恋在中国不再是犯罪行为，警方关闭了两个电影放映会和一个话剧。\n\n警方突击搜查一连串的公园里的男同性恋者聚会场所后,在 2009年8月25日,约100名男同性恋者在广州人民公园举行抗议。警方把抗议领导人带到公园的公安部,盘问了几个小时。这起同性恋维权抗议被称为中国同性恋、双性恋及跨性别者权利组织的里程碑。\n\n**妇女和女童权利**\n\n中国女性仍然是根深蒂固的性别歧视和暴力的受害者。农村地区妇女特别容易受到虐待，这包括：性别歧视、不能平等地获得服务和就业、遭受性贩卖和暴力。在2009年5 月10日，21岁的修趾甲师邓玉娇刺死所称企图强奸她的湖北巴东地方官员。这案件立即引起公众广泛注意和关注中国的性暴力状况。\n\n**艾滋病毒****/****艾滋病**\n\n中国安全部队继续对艾滋病毒/艾滋病活跃组织施压，要他们在公共保持低调。中国警方强迫著名艾滋病毒/艾滋病活跃人士万延海在六四天安门周年之前, 离开北京去北部城市长春, 以避免他们所称的 \"可能发生的冲突\" 。\n\n一个新的反毒品法在2008年6月生效。但此法并没有解决对注射毒品者的虐待行为,这些虐待与艾滋病毒/艾滋病传播有关。该法禁止用中国臭名昭著的\"劳动教养\"系统关押注射毒品者，取而代之的是定义模糊的\"社区康复\"，使人们担心虐待会以新的名称继续。\n\n**宗教自由**\n\n中国宪法保障宗教信仰自由，但政府将宗教体现的自由限制于政府注册的庙宇、寺院、清真寺和教堂。政府审查宗教人员、神学院申请和宗教出版物，并定期审查宗教机构的活动、财务记录、成员和雇员。中国政府把所有未登记的宗教组织定为违法的，这包括基督教的\"家庭教会\"；成员冒罚款和刑事起诉风险。政府还继续把一些群体，如法轮功，规划为 \"邪教\"，并定期严厉镇压其信徒。在国家批准的渠道外实践宗教活动而服刑刑期或受劳动教养的人数,并没有公共数据。\n\n**西藏**\n\n2008年3月西藏发生的暴乱已过去很久,但西藏自治区和毗邻的青海、四川、甘肃、云南等地区里的情势仍然紧张，这些地区依然遭到密切监测，依然布满部队。2009年，两名藏人因参与2008年的抗议活动被处决。在此文写作时，外国人进入西藏仍然受到严格限制。\n\n数百名被控参与抗议的藏人下落不明。举行了的一些审判却已被高度政治化了。2009年,在国际媒体报道了当局的酷刑和不正当的司法程序后,对四川藏族宗教领袖仁波切的审讯和对顿堵望城(他在2008年因未经批准拍摄纪录片被捕)的审讯被无限期推迟。\n\n在拉萨,当局增加了警察行动,目的是识别和拘留妨碍政府反分裂活动的人,或计划参加2009年3月达赖喇嘛逃到印度50周年预备阶段抗议的人。其中包括前政治犯及其家属，未成年罪犯和临时游客。\n\n政府继续逮捕，拘留和判决抗议者和所有藏族地区内被涉嫌是民族统一同情者。当局强迫数千名僧侣和尼姑遵循政治说教，有时通过强制手段来强迫他们，例如在没有标识的设施进行集体关押。\n\n2009年10月, 中国官员表示，如果达赖喇嘛停止与各个世界领导人会见的话，中国政府将恢复与达赖喇嘛代表的会谈。\n\n**新疆**\n\n2009年7月, 新疆发生了中国几十年来最严重的种族暴力事件之一，之后又发生大规模的部队部署和严厉打击。骚乱始于7月5日，当时乌鲁木齐维吾尔人抗议广东玩具厂里的维吾尔工人被杀害。防暴警察试图驱散他们并抓获了70人后,抗议变成暴力。晚上，在乌鲁木齐南部，大群维吾尔族青年对汉族居民野蛮袭击，造成多人死亡或受伤，数十个建筑物和汽车着火。一些汉族暴徒为报复，攻击了维吾尔人。直到7月6日早晨，安全部队才得以控制那些地区。 7月7日，他们试图防止乌鲁木齐汉族居民的报复性袭击，但还是有一些维吾尔人受害。官方数字显示抗议死亡人数是197人，其中大多数是汉族。超过1600人受伤。维吾尔团体继续质问官方死亡人数，声称它大大低估了维吾尔受害者人数。\n\n在骚乱发生后，中国警察，武装警察和军队进行过多次较大规模的清扫行动,地点在乌鲁木齐的两个维吾尔族聚居区:二道桥和赛马场。据目击者说，安全部队封锁了整个街区，搜索维吾尔青年男子和男孩。除了大规模的扫荡，安全部队在有针对性的袭击中还扣押了数目不详的人，通常是小群警察或士兵将维吾尔人从家中,工作场所，医院，或街道带走。在某些情况下，安全部队似乎是按以前被拘留者提供的信息行动。这些突击搜查一直持续，至少到8月中旬。人权观察组织记录的失踪受害者都是年轻维吾尔族男子,大多数是20来岁；最年轻的受害者是14岁。\n\n中国当局很快地指责动荡是由各种外部势力策划和赞助。他们特别指责热比娅•卡德尔策划和组织抗议；卡德尔是一个新疆活跃人士和前政治犯,目前在美国流亡生活。当局没有提供支持这些说法的证据，而许多分析家都认为抗议活动大都是对中国长期对维吾尔少数民族歧视性政策所做出的反应。\n\n中国当局还封锁了未经审查的信息渠道，这包括互联网、国际电话线和短信；仅有被鉴定合格的外国记者可使用这些信息渠道。同时，中国政府使用官方媒体和其他大众宣传手法，在国内和国外宣传其对事件的说法。\n\n11月9日, 国家媒体报道, 8名维吾尔族男子和1名汉族人已因为参与骚乱被处决。所有的审讯之前没有进行公告；审讯过程都不到一天；审讯都没有达到最基本的国际标准。\n\n**香港特别行政区**\n\n香港当局还没有为完全民主选举行政长官和立法会所有成员这一转向提出明确的计划，让人担心当局会冲淡香港《基本法》的\"普选\"规定。\n\n移民当局几次决定拒绝批评中国人权纪录的人入境香港，这使人担忧香港的自治权利被削弱。在2008年9月30日, 一名前持不同政见者试图用借来的护照从澳门进入香港, 香港当局将此人移交给内地当局处理。\n\n**主要国际角色**\n\n中国政府继续向滥用权力的国家提供外交和财政援助，其国家包括缅甸，苏丹和津巴布韦。但在2009年7月,它一反常态地接受了联合国安理会对15名朝鲜官员的制裁。中国当局声称，它的援助项目和对外关系注重的是经济发展，但其外交政策因为无视人权,引人关注。在2009年10月,几内亚军队枪杀手无寸铁的亲民主示威者几个星期后, 中国公布在几内亚投资几十亿美元, 这又引起人们关注。\n\n在2009年7月,中国检察官出人意外地以咄咄逼人的姿态，逮捕矿业巨头力拓的一名澳洲高级管理人员，控名是他违反了国家机密。这引起了国际商业社会关注。政府还严厉批评澳洲政府允许墨尔本电影节放映关于维吾尔族活跃人士热比娅•卡德尔的纪录片，也批评德国政府允许法兰克福图书节邀请批评中国政府的中国作家出席。\n\n一些国家的政府就中国的人权纪录似乎采取了较柔和的立场。欧盟屈服于中国的压力, 在2009年的\"欧盟-中国人权研讨会\"中的两轮会议，限制非政府组织的参与，其中包括在欧洲举行的会议。在2009年2月，去北京的途中,美国国务卿希拉里•克林顿（Hillary Clinton）称，人权 \"不应该干涉\"中美关系，而奥巴马总统在11月访问北京前,决定不会见达赖喇嘛。奥巴马在中国做出的公开声明中广泛地提到人权，但没有直接讨论这些迫切问题:言论自由、宗教少数群体、取消公民权利律师资格和在新疆和西藏持续进行的镇压。\n\n2009年2月，作为联合国普遍定期审议的一部分, 中国政府首次在联合国人权理事会前亮相。它应该慎重考虑过程中所提出的建议，但却决定对它们置之不理。在普遍定期审议的\"结果报告\"中,中国政府拒绝了所有的建议，包括关于言论和结社自由、律师和维权者、死刑、\"劳动教养\"和酷刑的建议。相反地，政府表示：\"国内没有审查\"，\"没有任何个人或媒体因发表他们的意见或看法被处罚，\"和\"执法机关没有用国家秘密(起诉)来压制维权者。\""
		},
		{
			"post_id": 8,
			"title": "HRW 2011年人权报告：中国",
			"date_published": 1520832430.18,
			"body": "2010年10月，正在服刑的异议人士刘晓波当选为2010年的诺贝尔和平奖得主，是中国人权运动的特定时刻。将全球聚焦中国侵犯人权的程度，以及中国如何崛起成为世界大国的同时，保留尚未改革的专制政治制度。\n\n中国政府试图在国内审查该获奖的新闻，并立即软禁刘晓波的妻子刘霞，还对众多维权人士和支持刘晓波的人展开镇压行动。随后，中国政府试图描述刘晓波得奖是\"西方阴谋\"的一部分，并坚持中国公民不重视公民和政治自由。\n\n接下来一周流传的公开信反驳了政府这个说法；一群中国共产党的老干部联名发表公开信，要求中国实施政治改革，以捍卫宪法保障的言论和新闻自由。信中举例说，温家宝总理10月在纽约表示\"人民对民主自由的诉求是不可抗拒的\"，却在本国内遭到审查。几家报纸居然采取前所未有的行动，隔天刊登温家宝的评论，公然挑战审查指示。\n\n诺贝尔和平奖及公开信强调，中国主流社会、共党和政府日益重视\"普世价值\" 的讨论。具有里程碑意义的文件《零八宪章》同样倡导这些想法，呼吁中国政府渐进实现政治制度改革。刘晓波就是因为起草该宪章，于2008年被逮捕，2009年被判处11年有期徒刑。\n\n* * *\n\n**言论自由**\n\n中国政府继续限制记者、博客和大约3.84亿互联网用户的权利和自由，违反中国法律保障的新闻和言论自由。政府要求国营媒体和互联网搜索公司审查各种问题的相关信息、从 1989年6月天安门大屠杀事件至2010年诺贝尔和平奖。\n\n2010年1月12日，美国搜索引擎公司谷歌宣布要停止对中国互联网用户的搜索结果进行自我审查，将为此寻求与中国政府达成协议。谷歌接受审查，部分是因为要遵守中国政府的规定。谷歌的要求被政府拒绝。2010年3月22日，谷歌在[http://www.google.cn](http://www.google.cn/)网站上停止审查搜索结果，开始将中国用户转往香港不受审查的网站。\n\n2010年4月22日，政府通过了《保守国家秘密法》修订草案。经修改后，该法规定互联网及其他公共信息网络营运商、服务商\"应当配合公安机关、国家安全机关[以及] 检察官\"对泄密案件进行调查。\n\n至少有24名中国记者以\"煽动颠覆国家政权\"、\"泄露国家机密\"等模糊罪名被判有期徒刑，其中包括维吾尔族记者、网站编辑海莱提·尼亚孜（Gheyret Niyaz）。今年6月，法院以\"危害国家安全罪\"判处他15年徒刑，原因是他在2009年7月新疆发生示威抗议后接受外国媒体的采访。在同一周内，新疆法院以同样的罪名判处三名维吾尔族博客有期徒刑。地亚尔网（Diyarim）网主兼管理员迪力夏提·帕尔哈提（Dilshat Perhat）、彩丽肯网（Salkinm）管理员努尔艾力（Nureli）和沙南网（Shabnam）管理员尼加提·阿扎提（Nijat Azat）分别被判处五年、三年和十年徒刑。\n\n记者对审查指示的越界继续面临官方的报复打击。2010年3月1日，13家报纸共同发表社论倡导中国废除户口制度，社论的作者之一张宏被解除《经济观察网》副总编辑的职位。《中国经济时报》总编辑包月阳签发山西疫苗报道，披露接种疫苗导致4名儿童死亡、至少74儿童患病。报道于2010年3月17日刊登，包月阳5月被免去社长、总编辑的职务，显然是遭到官方报复打击。\n\n中国记者依然因报道\"敏感\"问题而遭受身体上的暴力。2010年4月20日，《新京报》记者杨杰拍摄强制拆迁工地时，遭10名身份不明的袭击者攻击。在场的警方拘留袭击者不久便释放他们，声称那是\"一场误会\"。2010年9月8日，三名吉林电视台、长春电视台记者欲报道吉林建工学院城建学院火灾，遭保安追打。\n\n尽管中国政府2008年10月已取消诸多对外国派驻中国的记者的限制，如无需官方批准在国内自由行动、自由访问中国公民。外国通讯记者仍然受到限制，其中包括外国记者被禁止自由访问西藏\n\n**司法****改革**\n\n中国公民的法律意识和司法改革依然缓慢改进，虽然中国政府公然敌视真正的司法独立，削弱了立法上的进展。也损害逐步削减共党对各司法机构、机制的权威的努力、也因政府的态度而受到打击。\n\n今年颁布了两项具有潜在重大性的改革，却未被政府实行。今年5月，最高人民法院、最高人民检察院（国家起诉机关）、公安部、国家安全部和司法部发布两项规定，强调排除采用刑讯逼供手段取得的证据。这包括国内常用来定案的被告人证词和证人口供。\n\n樊奇杭案件却未遵循这些新规定。樊奇杭在其律师公开的视频中，阐述被羁押六个月期间每天遭受酷刑，审判时屡次想撤回在刑讯逼供下作出的供词,却不得要领。最高人民法院拒绝调查樊奇杭曾遭到虐待的指控，还维持死刑判决。\n\n中国政府今年8月宣布，中国刑法修正案草案拟将取消13个\"经济性非暴力犯罪\"的死刑。立法机关的法律事务委员会的资深成员却于9月宣布，政府将不会奉行这项倡议。中国每年处决5，000至8，000人，居世界之首。\n\n**维权者**\n\n绝大多数的人权倡导者、维权者和维权组织都在某重程度上受到警察和国家安全机构的监视、骚扰或镇压。在过去三年，已有几位著名的维权人士被判入狱，几家非政府组织被迫结束营运或受到限制。尽管如此，中国遵守其自身法律的要求与日俱增，国内的\"维权运动\"--一个由律师、活跃人士、异议人士、记者、普通公民、农民和工人组织的非正式运动，也不断扩大。\n\n尽管国家审查无处不在，维权者还是成功地在公共和媒体领域中，为各种问题制造舆论。问题包括：政府营运非法拘留所（意指所谓的\"黑监狱\"）以羁押进京申诉的访民；被拘留者非正常死亡；刑讯逼供的广泛使用；使用精神病院扣押异议人士；对新疆少数民族的社会经济歧视；强制拆迁的相关侵权行为。\n\n活跃人士为了取得这些进展，付出了沉重的代价。除了经常被骚扰，他们还遭到警察监视、非法软禁、通讯被切断、警告和威胁、屡次被传唤与公安 \"喝茶\"以及短时期拘留。\n\n人权律师高智晟已经失踪两年。在他初次失踪的第一年，官方一直对他的下落含糊其辞。2010年4月初，高智晟在北京出现，还告知记者和支持者，警察羁押他时多次虐待他。不到几天，高智晟又消失了。他哥哥10月欲报案寻弟弟却遭警方拒绝受理。\n\n盲人法律维权者陈光诚9月出狱后，一直与全家大小被软禁在家乡里；陈光诚服刑时患病，现在出狱了还是无法就医。当地警方指示不明身份男子威胁和暴力阻拦前往访问他的记者和维权者。\n\n毒奶致肾结石受害孩童的父亲赵连海，因为号召毒奶受害者组织协会，以联合进行维权诉讼，于11月10日被控\"寻衅滋事罪\"被判刑两年半。\n\n**移民和劳工权利**\n\n由于中国严禁独立工会，中华全国总工会至今还是国内唯一的合法工人代表。2010年夏天，广东省南部几家外资工厂的工人（主要是民工）罢工反对该禁令，日本本田公司（Honda）和日本电装株式会社（Denso Corporation）随后提高生产员工的工资，并改善他们的待遇。中华全国总工会于8月颁布新的改制措施，加强企业工会主席产生的民主选举程序，却也坚称\"工会政治方向不偏离[中共领导]\"，这表示独立工会活动将继续受限制。\n\n长期以来，中国政府仍未兑现废除户口制度的承诺。中国公民获取教育、医疗等公共福利的能力，基于其出生地，导致国内230万民工人迁移到中国其它地方时，无法获取这些服务。\n\n长期以来，中国政府仍未兑现废除户口制度的承诺。中国公民能获取的教育、医疗等公共福利与出生地有一定的关联，导致国内230万民工迁移到中国其它地方时，无法获取这些福利。\n\n2010年6月，中国内阁国务院宣布以\"居民户口\"系统取代户籍制度的建议，以便中国城市的移民获取公共福利。然而，建议书未对取消户口制度提出时限和经济范围。\n\n**性倾向和性别认同**\n\n继1997年同性恋合法化后，2001年政府决定不再将同性恋统化为病态，但仍未允许同性婚姻。2010年3月，前任卫生部副部长王陇德对国营媒体说，中国政府要有效打击国内艾滋病毒/艾滋病的流行，就需终止对同性恋者的歧视。\n\n尽管种种进步的迹象，社会和官方对同性恋、双性恋和变性人根深蒂固的歧视，使这些群体面临实现基本言论权和结社权的限制。 2010年1月，北京警方未经解释，强迫主办当局取消中国的首届同性恋选美赛\"彩虹先生\"。2010年9月，北京警方突查位于海淀区的公园，将数百名同性恋男子带走拘留，显然是要骚扰和恐吓同性恋者。据称，男子出示身份证件和接受血液检测后才得以获释。\n\n**妇女权利**\n\n中国妇女仍然遭受根深蒂固的性别歧视和暴力行为。农村地区的男女不平等问题尤其严重， 因性别而获取服务和就业机会不平等、人口贩卖妇女受害者被强迫卖淫和针对妇女的暴力事件都比城市的更为普遍。2001年6月，非政府组织中国法学会反对家庭暴力网络（简称反家暴_网络_）呼吁政府修改《婚姻法》的家庭暴力有关规定。反家暴_网络_批评现行的《婚姻法》对家庭暴力受害者需提供长期身体虐待证据的要求过高。\n\n警方时常强迫女性性工作者游街示众，这样的做法侵犯她们的隐私权和获取正当程序的权利。2010年6月，警方逼两名涉嫌从事性工作的妇女被绳子牵着、赤着脚在东莞游街，引起公众剧烈的批评。2010年7月27日，国营媒体宣布官方禁止游街示众的做法，禁令是否会被执行，情况不明。\n\n**健康**\n\n2010年，为了保护艾滋病毒/艾滋病感染者的权利，中国政府采取一连串步骤。2010年4月27日，中国政府解除外籍艾滋病毒感染者入境禁令，禁令在此之前已维持20年。2010年8月30日，安徽省法院受理中国首例艾滋病病毒感染者就业歧视诉讼案。11月，省法院宣布被告败诉。\n\n可是，艾滋病毒/艾滋病活跃人士和非政府倡导组织继续遭受政府的骚扰。2010年5月，中国领先的艾滋病毒/艾滋病活跃人士万延海，因其非政府组织爱知行研究所受官方骚扰，被迫逃到美国。资深艾滋病毒/艾滋病维权人士田喜在过去几年协助河南省因输血感染艾滋病病毒的受害者向国家寻求赔偿。2010年8月16日，他因为在一家医院发生了小冲突，被河南警方以\"故意毁坏财物\"罪羁押、起诉。如果罪名成立，刑期可能长达三年。\n\n政府官员和安全部队继续未经审判或司法监督，将涉嫌使用非法毒品的人关押在戒毒拘留中心。根据中国2008年6月通过的《禁毒法》，关押时期可长达六年。在押人员在戒毒拘留中心里惨遭广泛的人权侵犯，其中包括任意拘留、强迫劳动、肢体暴力、剥夺循证_药物依赖_性_治疗_、艾滋病毒/艾滋病治疗等医疗服务。\n\n中国经济的快速增长导致广泛的工业污染。中国政府未能解决因严重环境退化而造成的公众健康危机。中国有成千上万的儿童遭到铅中毒，其中许多人遭到永久性的身体和精神残疾。尽管中国法律和国际法旨在保护人们免受环境污染和危害，据人权观察研究显示，中国各地的地方政府将隐瞒铅中毒问题置为优先事项，要医院拒绝给儿童就医、拒绝测血铅、拒绝公布检测结果、伪造检测结果。人权观察将于明年公布该报告。\n\n**宗教自由**\n\n虽然中国宪法保障宗教自由，但政府将宗教体现的自由限制于政府注册的教堂、清真寺、寺院和庙宇。政府审查宗教人员、神学院申请和宗教出版物，并定期审查宗教机构的活动、财务记录、成员和雇员。中国政府把所有未登记的宗教组织定为违法的，这包括基督教 的\"家庭教会\"；其成员冒罚款和刑事起诉的风险。政府还继续把一些群体，如法轮功，规划为 \"\"邪教\"，并骚扰和恐吓其信徒。\n\n2010年3月11日，河南方城县基督家庭教会举行法律及神学培训时，遭警方和政府官员突查，三名培训人员被暂时扣留。2010年5月9日，广州警方阻止一个家庭教会在当地公园举行户外敬拜，还将教会领袖暂时拘留讯问。2010年10月10日，北京首都国际机场移民官员拦截五名基督教家庭教会领导人登机前往在南非举行的世界福音大会。\n\n**西藏**\n\n在西藏自治区及周边自治区--青海、四川、甘肃和云南省，情势依然紧张。中国政府并未表明将会依西藏人的愿望， 即使只是在少数民族区域自治法的狭窄范围内也不给予更多自主权 。虽然2010年未重复2008年春季抗议事件后的大规模逮捕行动情形，政府却在西藏高原各地保留大量的安全部队人员，并严格限制外人进入多数藏区。\n\n涉嫌批评国家的政治、宗教、文化或经济政策的藏人皆是迫害的对象。2010年6月，知名艺术商人、环保人士嘎玛桑珠（Karma Sandrup）因莫须有的\"盗墓\"罪行被判处15年有期徒刑，显示政府不愿支持和帮助务成功、拒绝从事政治事业的藏族精英。在嘎玛桑珠案中，证据显示嫌犯和各证人遭到酷刑等其它违反正当程序的侵犯，破坏了审判过程。\n\n2010年7月，人权观察组织发布一份指出中国处理2008年抗议时触犯国际法的全面报告，中国政府拒绝了报告的调查结果。报告的资料摘自目击者的证词，并详细记载安全部队在抗议发生时及事后所进行的虐待，其中包括：镇压抗议时过度使用暴力、向手无寸铁的抗议者开枪、进行大规模的任意逮捕行动、暴力对待在押人员以及向在押嫌犯施行酷刑。\n\n中国政府指责人权观察\"编造纵容反华势力、误导公众、污蔑中国政府的材料\"，对报告提出的实质性指控却未予于任何回应。\n\n**新疆**\n\n2009年7月乌鲁木齐发生的骚乱事件是中国历代以来最为致命的种族骚乱事件，至今新疆维吾尔族自治区的发展持续受到此事件蒙上的阴影的影响。骚乱后数百人被拘留，政府仍未解释他们当今的下落。在国外生活的难民和受害者的亲属作出证词，称在押人员遭到酷刑和虐待，政府也未就此严重的指控进行调查。一些骚乱嫌犯的审判难得得到宣传，却遭破坏，原因包括：司法代表受限制、司法过程被高度政治化、审判未被公布以及未依法举行真正公开的审判。\n\n针对维吾尔族和其他少数民族的民族歧视依然无处不在。同样的，宗教和文化的表达自由还是受到严格限制，出于政治动机的逮捕行动以\"反恐\"和\"反分裂\"行动为藉进行。\n\n4月，北京委任张春贤为自治区的新领导人，由他管理一项雄心勃勃的经济改革计划。5月首次举行国家性新疆工作座谈会上，宣布了无数新措施。措施可能将新疆迅速转化成经济中心，但也能进一步边缘化少数民族、加快汉人移居到该地区。\n\n到了2011年底，维吾尔古城喀什里的传统街区有80%将被夷为平地。如今已有许多维吾尔居民被强行驱逐和迁移，以迎接新的、或以汉族人口为主的城市。\n\n**主要国际角色**\n\n中国政府愈发大胆地扭曲国际准则和意见。2009年12月下旬，经中国政府施压，柬埔寨将20名维吾尔寻求庇护者强行遣返回中国，尽管中国对维吾尔人有施加酷刑的纪录，而美国等国家反对柬埔寨这样做。由于柬埔寨违反《1951年联合国难民公约》，美国几个月后决定暂停向柬埔寨运送卡车和拖车，但不到几个星期中国便援助提供一批军车。\n\n中国政府继续阻挠捍卫人权的国际努力。要求就缅甸的战争罪和反人道罪行展开调查委员会的国际呼声与日俱增，却遭到中国政府反击。中国驻联合国的代表团也反对联合国颁布一份报告，该报告记载在着当联合国对达尔富尔进行武器禁运时，来自中国的军火曾经在当地被使用。继西藏和新疆发生抗议事件后，联合国人权事务高级专员和六位联合国特别报告员要求访问地区，却仍未被中国政府批准。\n\n虽然十几个国家相继寻求与中国政府进行人权对话，讨论内容不为透明，而只有少许的为2010年带来有意义的结果。这些国家政府当中有许多大力支持诺贝尔委员会选择将和平奖授予刘晓波，但还有许多国家政府未能抓紧其它契机，与中国政府讨论人权问题，例如到中国进行高调访问、与中国高级中国官员会晤等。"
		},
		{
			"post_id": 7,
			"title": "HRW 2012年人权报告：中国",
			"date_published": 1520830761.42,
			"body": "中国在快速的社会经济变化和现代化的背景下，仍为一党专政国家。政府严厉钳制言论、结社和宗教自由；公开拒绝司法独立及新闻自由；任意且经常动用法外手段以限制、压制维权人士及组织。\n\n中国政府还审查互联网；在西藏、新疆和内蒙古等少数民族区域保持高度镇压性的政策；除在极少数情况下，都以“社会稳定”的名义系统纵容滥用公权的行为；国内外人士及组织评核其人权纪录，政府却称之为使中国不稳定、强加“西方价值观”于本国而予以否定。敌视自由化和司法改革的安全机关，自2008年北京奥运以来权力似乎有稳步增多的趋势。中国“维稳”预算如今已高于国防预算了。\n\n* * *\n\n与此同时，中国公民的权利意识日益提高，他们为民生问题、强征土地、强制拆迁、腐败滥权、歧视和经济不平等各种问题，向当局提出质疑。据官方和学术统计估计，中国每日平均发生250至500起抗议事件，每次抗议参与人数从一万到数万不等。尽管面临诸多风险，互联网用户及倾向于改革的媒体还是不停倡导法治及透明度、揭露官方错行、呼吁政府进行改革，从而积极推进审查界限。\n\n民间组织的法律地位岌岌可危，还受到当局监控，但其坚持努力扩大工作范围，与国际非政府组织接触也日益增多。尽管面临着警方监控、拘留、抓捕、强迫失踪和酷刑等系统压制，维权运动的维权人士——为数不多而敬业的一群人仍坚持不懈地揭露各种人权侵犯行为。\n\n**维权人士**\n\n2011年2月，因“阿拉伯之春”民主运动的关系，2012年10月中国又将进行领导层换届，中国政府感到焦虑不安，对维权人士、活跃人士和批评人士展开了十年以来规模最大的打压行动。当局还加强互联网、新闻审查力度，对多位异议人士及批评人士施以监控，限制他们的活动，还采取空前的步骤：抓捕30余最直言不讳的批评人士，将之强迫失踪几个星期。\n\n当代艺术家、直言不讳的政府评论人士艾未未4月3日被逮捕、秘密拘留，关押期间不能联系律师，这引起了国际社会的强烈抗议，促成艾未未得以于6月22日取保候审。11月1日税务机关通知他，其妻子名下的公司需补缴税款、滞纳金和罚款240万美元。大部分其他活跃人士最终也都获释，但因惧怕被失踪、逮捕、虐待，不得不比以往低调得多。2011年被拘留的几位律师，包括刘士辉，后来叙述了被审问、虐待、恐吓的经历；并表示是签字“认罪”，答应不用推特且不与媒体、人权组织及外交官员讨论拘留事件，才得以获释。\n\n中国政府继续对异己强加软禁。正在服刑的诺贝尔和平奖得主刘晓波之妻刘霞，已自2010年12月失踪至今，相信是为阻止她替先生进行倡导游说而将她软禁。2011年2月，她与朋友在网上短暂交流时，描述他们一家人都成了“人质”，自己感到很无助。她每个月可探访刘晓波一次，但须经监狱当局批准。\n\n2010年9月刑满出狱的盲人法律维权人士陈光诚，自2011年以来一直处于软禁状态。2月公布了关于他一家人被软禁的视频后，与妻子遭到安全人员殴打。知名维权人士胡佳6月服满三年半的刑期出狱后，和同为活跃人士的妻子曾金燕及女儿一直被软禁在北京。2009年9月被当局“失踪”的律师高智晟，2010年短暂出现时详述遭到严重且持续不断的酷刑虐待，4月再度失踪，其现状仍让外界高度重视。\n\n2011年6月12日，尽管中国人权环境每况愈下，中国政府宣布已全面落实《国家人权行动计划（2009-2010年）》规定的“目标任务”。\n\n**司法改革**\n\n虽然中国公民的法律意识不断提高，但政府对真正的司法独立持着公开敌视的态度，削弱了司法改革进程，损害了限制中国共产党控制所有司法机构及机制的努力。\n\n公安机关支配的刑事司法体系过度依赖被告供述。薄弱的法院和被严厉限制的辩护权，意味着刑讯逼供仍为普遍现象，司法不公事件屡见不鲜。为减少此种案例以及改善司法工作，中国政府于2011年8月公布排除使用非法收集证据的新办法，并在《刑事诉讼法修案（草案）》加强程序上的辩护权。草案很可能将于2012年3月得到通过。\n\n然而，修正草案还包括一令人震惊的条款允许警察秘密拘留“国家安全、恐怖主义和重大贪污腐败”犯罪嫌疑人长达六个月，从而有效地让强迫失踪合法化。嫌疑人处于被虐待的风险将为极大，政府往后也得以借此措施对异议人士及活跃人士予以“失踪”。维权律师、活跃人士及部分法律界透过中国媒体激烈批评该项措施。条款若被通过，将显著偏离中国之前要与国际执法准则（如1997年签署但尚未批准的《公民及政治权利国际公约》）逐步接轨的立场。\n\n中国在2011年仍是执行死刑最多的国家。具体数字仍属国家机密，但据估计每年约有5千至8千人被处决。\n\n## **言论自由**\n\n2011年，中国政府继续对博客作家、记者及逾5亿互联网用户实施限制，违反了国内外保障新闻自由、言论自由的法规。政府规定互联网搜索公司和国营媒体审查“敏感”议题，并禁止使用脸书、推特、YouTube等外国网站。尽管中国审查机关严格过滤内容，中国社交网络的崛起——尤其是拥有2亿用户的新浪微博，却为公民建设表达言论的新平台，挑战当局对言论自由的官方限制。\n\n当局关注埃及发生的反政府抗议活动，于1月30日封锁有关“埃及”的信息搜索。2月20日，网上盛传中国各地将举行“茉莉花革命”的流言，有关“茉莉花”的信息搜索即被屏蔽。8月份，网上出现一系列激烈评语，批评政府处理7月23日温州动车事故的做法，政府便警告说，那些发布不实或误导性信息的博客作家，将被处以新处罚措施，包括微博账户被暂停。\n\n含糊的“煽动颠覆国家政权罪”和“泄露国家机密”之法律法规，使至少34名中国记者被判监禁。其中的齐崇怀，在揭露原籍山东政府腐败情况后，被控犯有“敲诈勒索罪”2008年8月被判四年有期徒刑，今年6月被同一法院以漏罪为由，以“敲诈勒索罪”和“职务侵占罪”加刑8年。\n\n不按官方准则报道的记者依旧受到威胁。《南方都市报》编辑宋志标因批评中国政府2008年四川地震的救灾工作，今年5月遭到官方报复打击而被降级。6月份，政府提出威胁，表示要将那些报道食品安全丑闻时“误导公众”的记者纳入黑名单。《中国经济时报》则于7月解散调查部，显然是因为勇于报道公务人员渎职真相而遭到官方施加压力。\n\n针对报道“敏感”议题的记者的暴力行为，在2011年仍是个问题。6月1日，两名《京华时报》记者不肯删除在砍伤事件案发现场拍摄的照片，被北京便衣警察殴打致伤。两名涉案警官后被停职。9月19日，河南洛阳电视台记者李翔遇刺身亡，被大众广泛推测是因为揭露当地食品安全丑闻而招致报复打击。警方已逮捕两名犯罪嫌疑人，并坚称李翔是抢劫遇害的。\n\n2月27日，北京一处被传将举行反政府抗议活动，警方在场故意针对外国记者施暴。在场的一名视频记者遭一群看似便衣安全人员的男子殴打，脸部被多次拳打脚踢，受到严重挫伤，可能有内伤，必须接受治疗。在场的还有其他十几位外国记者被警方粗暴对待、拘留、限制自由。\n\n中国政府及安全机关不允许两年一次的北京酷儿影展在北京西城区举行。影展后来被迫在各社区场所秘密举行。\n\n**宗教自由**\n\n尽管中国宪法保证宗教自由，中国政府限制只能在官方许可的寺庙、教堂和清真寺做礼拜。宗教组织必须定期将有关数据——包括财务记录、活动信息和雇员资料提交当局审查。政府也会审查神学院申请书及宗教出版品，所有宗教人事亦须获取政府许可。新教“家庭教会”和其他未登记注册的精神组织被列为非法组织，当局还对成员加以起诉和罚款。法轮功与其他被视为“邪教”的团体，其成员面临被恐吓威胁、骚扰和逮捕的风险。\n\n4月，政府向拥有一千名成员的“北京守望教会”的房东施压，要求其将教会逐出租给教会的一家北京餐吧。守望教会在4月至5月期间的至少五个星期日，在户外举行主日崇拜活动，引起警方注意，造成100多名成员被暂时拘留。\n\n政府以维持安全为由，持续在少数民族地区严格限制宗教活动。请参阅以下关于西藏和新疆的内容。\n\n**卫生**\n\n8月2日，中国政府宣布关闭583家涉及广泛铅中毒事件的电池回收企业。但政府并未实质性地承认和处理其他相关流弊，例如人权观察在2011年6月发表，关于河南、云南、陕西和湖南的铅中毒问题的报告，载列政府如何拒绝为铅中毒儿童提供医疗、对寻求司法救济的家长进行骚扰等。\n\n艾滋病毒/艾滋病感染者继续受到歧视。9月份，广东省一名患有艾滋病毒女子深度烧伤，因受到歧视到了三家医院求医不果。贵州省政府4月3日拒绝聘请的一名患有艾滋病毒的教师，于9月8日以解雇不当提出了诉讼。\n\n**残疾人权利**\n\n尽管中国政府批准了《残疾人权利国际公约》，并且即将受条约监督机构的审查，但实质仍未充分保障残疾人士的权利。\n\n一群残疾兼职教师在9月提请中国教育部解除20个城市和省份对残疾教师施加的限制。9月7日，河南官员从省内多处**黑砖****窑**解救被绑架、贩卖为奴的30名智障人士。2007年陕西曾出现类似丑闻，如今却又发生此事，令人质疑当局对结束此类侵权行为的努力。\n\n8月10日，中国政府就外界期待已久的精神卫生法草案公开征求意见。国内法律专家警告说，草案包含对精神残疾人士具潜在严重风险的内容，包括非自愿收治、强制治疗以及法律能力被剥夺。\n\n**民工和劳工权利**\n\n在2011年仍欠缺有意义的工会代表，阻挠工资和工作条件得到系统性的改善。由于中国政府严禁设立独立工会，中国劳工唯一法定代表即为官方的中华全国总工会。官方统计显示，在今年前三个月期间，全国职位空缺比待业人数高出5%，不断变化的人口比例造成劳力短缺持续不断，因此媒体不时报道有工资上涨、福利改善的一些现象。\n\n1月份，一项就民工的中国政府调查显示，户口（户籍）制度继续使外来人口处于有系统歧视。受访者指责政府一再承诺要废除的户口制度，说制度不公平地限制他们获取住房、医疗服务和教育。2011年8月，北京市政府勒令关停24所民工子弟学校。大多数的学生已安排在新学校就读，但约有10％到20％的儿童因父母无法在北京另觅合适且负担得起的的学校，被迫离开父母返回原籍。\n\n## **妇女权利**\n\n2011年，中国计划生育法规依然使妇女生育权利被严重剥夺。农村妇女，乃至城市和工业区的女性民工，继续被施以行政处分、罚款和强制堕胎手段，尽管实施情况并无规律。而手段应用范围日益扩至西藏、新疆等少数民族地区。这些政策造成人口性别比例失衡（2010年人口普查数据显示，男女性别比例为118.08:100），进而助长人口贩卖及卖淫现象。\n\n中国政府强硬的政策及定期进行的打击运动，导致为数400万至1000万的性工作者依旧是特别弱势的群体。\n\n虽然中国政府承认家庭暴力、就业歧视、歧视性的社会态度仍是严重且普遍存在的问题，\n\n继续阻碍独立妇女权利团体发展，并阻止公众为公共利益提出诉讼。最高人民法院今年8月就《婚姻法》出台的新司法解释或将进一步加剧性别财富差距问题。根据新解释，离婚时房产归登记者所有，而登记者多数为男方。\n\n**非法收养儿童和贩卖儿童**\n\n8月16日，中国政府宣布将紧缩法规，以助防止非法收养和贩卖儿童。《中国公民收养子女登记办法》修改后预期将于2011年底公布。新办法将禁止任何通过福利院以外（如医院等机构）的渠道收养儿童，而修改原因为2011年5月，曝光了湖南计生部门的计生官员在2002至2005年期间拐卖至少15个婴儿，以每名3000美元外销给美国和荷兰的夫妇。尽管受害家长作证坚称孩子是被拐卖到国外，但警方经侦查声称未有非法人口贩运活动。\n\n**性取向和性别认同**\n\n中国政府于1997年将同性恋行为非刑事化，自2001年起不再将同性恋列为精神病。\n\n但警方还是持续查抄受欢迎的同性恋活动场所，活跃人士均认为这是故意骚扰行为。中国法律不承认同性关系，不给同性恋者收养权，也没有关于性取向歧视的法规。2011年4月4日，上海警方称一家受欢迎的同性恋场所Q吧涉嫌进行色情表演，进行突击检查。警方拘留了60余人，其中包括客人和酒吧工作人员，当天予以释放。对于同性恋者、双性恋者和变性者面临来自社会和官方的歧视，民众高调支持抵制这些歧视性态度的现象日益普遍。7月5日，一名中央电视台新闻节目主持人批评著名中国女演员发布反同性恋言论，并敦促大众尊重同性恋者、双性恋者和变性者社群。\n\n## **西藏**\n\n2008年，一系列民众抗议活动席卷了西藏高原，以致当局进行一场大规模镇压行动，而到了2011年，西藏自治区和邻近的西藏、青海、四川、甘肃和云南等省份的局势仍处于紧张状态。各地区仍有大量中国安全部队人员，当局继续严格限制外界——尤其是记者和外国游客进入藏族地区。政府以“分裂主义”罪名专门针对涉嫌批判中国政治、宗教、文化或经济政策的藏人进行打击。\n\n中国政府继续为建设社会主义新农村”，将高达80％的西藏自治区人口——包括所有牧民及游牧民迁至他处。\n\n尚未有任何迹象表明中国政府将提供藏人所冀望的更多自主权，即使是在有限的民族自治制度的少数民族区域之内。政府拒绝与西藏流亡政府新当选领袖洛桑•桑盖协商，并威胁说将挑选达赖喇嘛继承人。\n\n继格尔登寺一名藏传佛教喇嘛3月自焚抗议之后，四川当局控告另外三名僧人协助自焚，8月对他们判重刑。截至11月中旬已有另外十名藏族僧人及一名尼姑自焚，他们均表示是因缺乏宗教自由而深感绝望。\n\n## **新疆**\n\n中国近代历史死亡人数最多的民族骚乱事件——乌鲁木齐2009年7月的暴动，继续让新疆维吾尔自治区的发展蒙上阴影。数百人在暴动后被拘捕，但政府尚未为他们的下落提供说法；在国外居住的难民及被拘留者亲属指称被拘留者遭到酷刑及虐待，但政府也迟迟未调查这些严重的指控。只有少数涉嫌为示威者的人员公开审判，然而法律代理受限制、审判进程明显政治化、政府未印发关于审判的通知以及未能依照法律公开审判等因素均损害了他们的审判。\n\n新疆今年发生了几起暴力事件，但还不清楚罪责何方。7月18日，中国政府指出当天和田市一派出所被维吾尔族人袭击，几名人质被劫持，其中14名袭击者当场被击毙。7月30日至31日，喀什发生了一系列砍伤和炸弹袭击事件。政府指责是伊斯兰极端分子犯下上述袭击事件，并于8月中旬开展一场为期两个月的“严打”专项行动，以“严厉打击暴力恐怖犯罪”，“确保全区社会稳定”。\n\n政府假借反恐和反分裂的名义，保持对维吾尔族等少数民族广泛歧视的制度，还加以严格限制宗教及文化表现自由，进行出于政治动机的逮捕。\n\n2010年首次举行新疆工作会议，会上提出的经济措施或将带来收入增长，但可能也使少数民族更被边缘化。以维族人口居多的喀什古城，有80%的传统街区到了2011年底就会被夷为平地。为了建设一个很可能以汉人居多的新城市，许多当地的维族居民被强制搬迁。\n\n## **香港**\n\n2011年，香港入境事务处拒绝批准一些批判中国政府人权纪录的人士入境香港，让外界关注香港自治权利正被削弱。中国国家领导人9月访问香港期间，当地学生和媒体被处以严格限制，让人也日益关注香港警方权力范围。\n\n香港法院9月裁决，排除移民家庭用工申请居留权的条文违反宪法，加强了这些工人的权利。然而香港政府表示将向北京提出上诉，进一步削弱了香港的司法自主权。\n\n**主要国际角色**\n对于移交利比亚问题至国际刑事法院的安全理事会决议，中国政府2月投了赞成票，尽管如此，政府继续无视或损害国际人权准则和机构。国际刑事法庭指控巴希尔犯有战争罪、反人类罪和种族屠杀罪，已向其发出通缉令，而中国政府却在激烈的反对声浪中，于6月接待巴希尔。2011年，政府对中亚和东南亚地区的各国政府显著增加压力，要求其强制遣返维族难民，致使至少20人被遣返。10月又向南非政府施压，要求该政府不批准达赖喇嘛的签证，达赖喇嘛是为了出席德斯蒙德·图图大主教生日庆祝活动而申办入境南非。政府同月在安理会上与俄罗斯一起投否决票，使谴责叙利亚严重侵犯人权的一项决议不得通过。\n\n即使十几个国家政府出席了2010年诺贝尔和平奖仪式，向刘晓波致敬，但今年为中国人权状况进行有效倡导游说的国家政府相对较少。美国政府在胡锦涛1月到华盛顿进行国事访问时强调了人权问题，但美国政府—以及他国政府的重视在阿拉伯之春开始后便急剧下降，使中国政府更容易压制反对意见。少数国家政府继续大声疾呼释放刘晓波等人。\n\n缅甸政府9月间出人意料地宣布搁置主要由中国承建、备受争议的密松大坝项目。此举可能显露了主流民意反对侵权性的中资项目日益增大，而可发挥的影响力。在赞比亚，反对党爱国阵线（Patriotic Front）当选后，中国国有矿企突然宣布将提高工资。爱国阵线竞选时曾誓言要争取最低工资保障。"
		},
		{
			"post_id": 6,
			"title": "HRW 2013年人权报告：中国",
			"date_published": 1520830085.077,
			"body": "中国的新领导团队，由7名政治局常委组成，已在2012年11月的中共十八大会议上接掌政权，结束了胡锦涛与温家宝的十年领导。胡温执政期间，中国经济持续高増长、都市化，崛起为全球大国，但在人权方面鲜有改进。面对日益动荡的社会，包括西藏和新疆爆发数十年来最严重的族群冲突，中国政府在司法保护人权方面有所退步，维稳机器的权力大大膨胀。\n\n* * *\n\n在新任领导人的选择过程中，中国人民没有发言权，凸显该国虽然历经三十年的高速现代化，其政府仍为一党专政的威权体系，不仅恣意钳制言论、结社、宗教自由，禁止独立的工会与人权组织，并且继续由行政权掌控司法机关。该国政府还对新闻媒体、互联网和出版业进行内容审查，并在西藏、新疆和内蒙古等少数民族地区实行高压统治。\n\n在此同时，公民已日渐敢于在重大民生议题上对政府提出质疑，例如土地征收、强迫拆迁、腐官滥权、歧视和经济不平等。根据执法机关报告中引述的官方和学术统计，中国每天发生大约250到500件抗议事件（官方术语称为“群体性事件”），参与人数在一万到数万之间。即使面临风险，网民和具有改革倾向的新闻媒体仍然藉著倡导法治与透明化、揭发政府㢢端、呼吁政治改革，努力推挤官方审查的底线，以扩展言论空间。\n\n虽然法律地位不明确，又受到当局严密监控，公民社会团体也不断尝试推展他们的作为。在遍及全国的维权运动旗帜下，维权人士已结成无形但细致的网络，持续监测和纪录人权案件。然而，这些维权人士面临著国家各种形式的镇压措施。\n\n中国政府在其2012-2015年《国家人权行动计划》中，提出一种新㯋但定义含糊的“务实推进原则”，藉以重新诠释其国际法上的人权义务，此举偏离了该政府以往对于人权普世性原则的表面承诺。这个新的原则显然是以另一种形式重申中国政府的惯常说法，即中国的“国情”不适合参与式的政治体制。\n\n## 人权捍卫者\n\n中国的人权捍卫者经常面临警方骚扰、软禁、短期拘留、“劳动教养”、强迫接受精神治疗、或以刑事罪名判刑入狱，其理由通常是为了维护国家安全或公共秩序。\n\n诺贝尔和平奖得主刘晓波以煽动颠覆国家政权罪被判11年徒刑，正在黑龙江省的监狱服刑。其妻刘霞自从2010年12月即告失踪。据信她现被软禁在北京家中，以防她为丈夫进行倡导游说。\n\n李铁，湖北武汉的作家与异见人士，于1月18日以颠覆国家政权罪被判刑10年。在阿拉伯之春以后，已有好几位资深民运人士被判重刑，李铁是最近一个案例。\n\n被拘留一年后，长期从事维权工作的倪玉兰和董继勤夫妇于4月10日分别被判刑2年8个月和2年，罪名是“寻衅滋事”。上诉后，倪玉兰的刑期于7月被法院减少2个月。\n\n4月下旬，视障维权人士陈光诚从山东省家中逃出。他曾因不公正的审判而被以“故意破坏财产和聚众扰乱交通罪”判刑。2010年9月刑满出狱后，他和全家人遭到非法软禁。在维权人士网络的协助下，陈光诚逃进美国驻北京大使馆寻求庇护。经过中美两国长达数星期的尖锐谈判，陈光诚最后获准于5月19日偕同家人赴美留学，中国中央政府的代表并承诺将对其遭非法拘禁之事进行调查。陈光诚的侄子陈克贵则因打伤数名发现陈光诚逃跑后于半夜闯进家中搜查的警方看守人员，被以杀人罪起诉。地方司法当局以已经为他指派法律援助律师为由，不准陈克贵自己聘请的律师出庭辩护。\n\n7月25日，湖南维权人士朱承志以“煽动颠覆国家政权罪”遭正式逮捕，实际上是因为他披露资深异见人士李旺阳命案的诸多疑点。在监狱度过大半生的李旺阳，于6月6日被发现陈尸在湖南邵阳一家医院的病房中，但他的双脚踩在地板上。这宗可疑命案立刻引起全国维权人士透过互联网发出怒吼，并引发香港市民多次大规模示威抗议。许多李旺阳的家属和支持者都被软禁在家，以阻止他们质疑地方党委对该案的二度调查。李的支持者们认为，官方的调查只是为了掩盖真相。\n\n8月13日，北京警方拘捕了十几位维权人士，另一位维权人士彭兰岚则在湖南被捕。这些维权人士向国务院施压，要求公开政府信息，说明甫于6月公布的第二份《国家人权行动计划》相关信息。\n\n## 司法改革\n\n虽然司法改革在胡温执政下停滞不前，且当局拒绝司法独立，法律人社群在民间法律意识及维权行动日益高张的鼓励下，大都扮演推动改革的力量。中共依然控制所有司法机关与机制，透过政法委协调司法机关的运作。其中，公安部门（即警察）仍握有最大权力。刑讯逼供仍相当普遍，法院的弱势和刑事辩护权利受到严格限制经常导致司法不公。\n\n2012年3月，为了减少此种案例和改善司法工作，政府通过了《刑事诉讼法》的大幅修正。然而，新法仍然允许警察秘密拘留“国家安全、恐怖主义和重大贪污腐败”犯罪嫌疑人长达六个月。这些措施造成嫌疑人面临刑求的危险，并且让政府有理由对异议人士及维权活动者予以“失踪”。\n\n国内对于“劳动教养”行政拘留制度的批评，因为一宗全国关注的案件而升高。劳动教养经常被用来对付上访者，在此案中，一名妇女因11岁女儿遭性侵而投诉警察渎职，结果竟被警方处分劳教18个月，引起全国公愤。因此，这位妇女在被拘留近一周后即获释。\n\n中国在2012年处决死刑犯的人数继续领先全球。确切的数字仍是国家机密，专家估计中国每年处决人数在5千到8千人之间。\n\n## 言论自由\n\n中国政府对于新闻记者、博客作家以及估计约5亿3千8百万互联网用户的各种限制，继续违反国内法和国际法对于新闻与言论自由的保障。新浪微博作为中国最大的社交媒体微博服务商，在一定程度上，为其3亿用户提供了前所未有的表达意见和抒发不满的空间。但是，如同其他网络内容一样，微博仍然受到中国网络审查机构的严密监视和操纵，目的是确保网上讨论内容不违反政府的政策。另类的社交媒体服务，包括推特、YouTube和脸书，仍然遭到屏蔽。\n\n6月中旬，当伊利婴儿奶粉因汞含量超标而全面下架后，网络审查机构屏蔽了所有相关的网络信息检索。官方审查机构还删除了《南方周末》对于7月21-22日北京洪水导致广大地区财产损失及交通设施瘫痪的八页报导。9月12日，审查机构禁止有关“近平“的信息搜索，因为当时国家副主席习近平长达两星期未露面，也未出现在官方媒体报导，引发民间热议。他事后恢复公开活动，但官方从未说明内情。\n\n2012年，至少有27位中国记者因“泄露国家机密”或“煽动颠覆国家政权”等含糊罪名在狱中服刑。记者还冒著被认为违反言论审查规定的风险。《南方都市报》编辑喻尘被迫离职，只因他所主管的该报微博转发了一则讽刺中共掌控军队的短信。《西安晚报》记者石俊荣于7月2日遭无限期停职，因为他在6月27日撰写报导揭露地方党委成员使用名贵香烟。石俊荣至本文写作为止迄未复职。\n\n在2012年，新闻记者依旧可能因为报导敏感议题而遭受暴力行为。其中一件显著案例发生在8月10日，香港亚视记者雷钊河在安徽合肥采访警方拘留示威者时，被2名男子拳打脚踢。在场其他记者指认施暴者是便服警察。\n\n2012年也创下1998年以来外国记者遭驱逐首例。5月7日，中国政府撤销半岛电视台（Al Jazeera）特派员陈嘉韵（Melissa Chan）的记者证，但并未说明她违犯何种法规。8月21日，香港、中国和上海的外国记者协会发布联合声明，对于7月28日到8月12日之间有7名外国记者在4宗事件中遭到“威胁、骚扰甚至殴打”表示“严重关切”。该声明指出，在这些事件中“有官方安全部队成员及相关分子涉入”。\n\n中国政府还试图将其对言论自由的严密控制延伸到海外，其事例至少有下列两件。3月，中国政府成功施压英国书展，自其官方贵宾名单中排除所有持不同政见或流亡海外的中国作家。9月，中国驻旧金山总领事馆试图游说奥瑞冈州柯华利斯市（Corvallis, Oregon）的市长，移除一栋私人建筑上支持西藏与台湾独立的壁画，但未成功。\n\n## 宗教自由\n\n尽管中国宪法保障宗教自由，中国政府限制只能在官方许可的清真寺、教堂、庙宇或寺院进行宗教活动。宗教组织的活动信息、人事资料和财务记录都必须提交政府审查。宗教人事任命、宗教出版和申请就读宗教学校，亦须获取政府许可。\n\n基督教“家庭教会”和其他未登记注册的信仰团体都被视为非法组织，其成员面临政府的罚款或起诉。法轮功（1999年7月被查禁的气功及信仰团体）被政府列为“邪教”，其成员常遭政府逮捕、骚扰和威胁。\n\n2月，湖南省武冈市宗教管理部门要求家长签署抵制“邪教”的保证书，否则不准其子女就读公立学校。在春节期间进行的这项签名活动，是地方政府打击法轮功和基督教家庭教会的措施之一。\n\n8月22日，上海市政府命令该市天主教佘山修院无限期延迟开学。此举是为报复新任辅理主教马达钦神父在7月7日宣布退出官方爱国教会的一切职务，马神父自当天即遭软禁至今。\n\n中国政府继续以国家安全之名，在少数民族地区严格限制宗教活动。详见后文有关西藏和新疆部分。\n\n## 卫生和残疾人权利\n\n政府仍然敌视1990年代河南省血液㢢案受害者要求赔偿的行动。8月27日，在位于郑州市的河南省政府门前进行抗议的大约3百名艾滋病毒／艾滋病感染者遭到镇暴警察镇压，数名成员被打伤。1990年代河南地方政府主办的大规模血浆交易，造成这些人受到病毒感染。他们抗议政府拒绝给予赔偿。\n\n中国政府在6月11日发布的《国家人权行动计划（2012-2015）》中宣示，将加强保护人民不受重金属污染危害。但截至本文写作时，对于近年来在河南、云南、陜西和湖南等地遭受铅中毒的儿童，政府仍未给予具体的救济或医疗协助。\n\n作为联合国《残疾人权利公约》的缔约国，中国对于残疾人权利的保护却仍不足。在9月18-19日中国首次接受联合国残疾人权利委员会审查期间，政府官员基本上否认残疾人的权利受到侵害，也否认政府未能提供残疾人充分的信息、司法和基本服务。\n\n10月26日，中国政府终于完成历时20多年的精神卫生法立法工作。然而，这项新法存在许多问题，包括缺乏适当的机制保护人民不被强迫关押在精神医疗机构。\n\n## 妇女权利\n\n妇女的生育权和享有生殖健康服务的权利，在中国现行的计划生育法规下，仍然受到严重剥夺。政府持续采取行政处分、罚款、和包括强制堕胎在内的压迫性措施。近年来，强制节育政策日渐延伸到西藏和新疆等少数民族地区。这些政策造成人口性别比例失衡（根据2010年人口普查，男女性别比例为118.08：100），进而助长强迫结婚和人口贩卖等侵犯人权的行为。\n\n政府不定期的严厉扫黄，经常导致中国高达4百万到1千万性工作者遭受严重暴力和性侵，提高他们染患性病的风险，而且难以寻求司法救济。\n\n政府虽然明知家庭暴力、就业歧视和社会刻板印象是普遍严重的问题，却仍限制民间女权组织的活动，并阻挠相关的公益诉讼。\n\n## 移民与劳工权利\n\n中国劳工日益积极主动地要求改善工资和劳动条件，虽然没有真正的工会做为代表。由于法律禁止成立独立的工会，官方的全国总工会仍是唯一合法代表劳工的组织。\n\n在广东省出口加工区从事保护移民工权利的劳工非政府组织，在2012年不断遭到政府官员和安全部队的打压。在这一年内，政府当局或受到地方政府压力的房东，针对至少12个移民工维权组织，强逼他们迁离当地。8月30日，显然受官方指使的二十多名便衣暴徒闯入深圳小小草工友家园，砸毁门窗予以威胁。\n\n6月，中华全国妇女联合会和广东省司法单位合作的一项调查显示，数以千计因户口制度限制而被外出打工的父母留在农村的儿童，成为性暴力受害者。虽然政府曾经承诺要废除户口制度，但中国的2亿2千万移民工迄今仍然在它的限制之下，无法公平地享有教育、医疗服务和住房权。\n\n## 性倾向与性别认同\n\n中国政府继1997年将同性性行为除罪化后，又于2001年将同性恋排除于精神疾病分类。2012年6月，80多名女男同性恋、双性恋和跨性别（LGBT）维权人士齐聚北京，出席了中国首次性别人权会议。但是，相关人士仍持续遭到官员恣意骚扰，包括警方经常临检知名的同性恋活动场所。中国缺少关于性倾向的反歧视立法，国家也不承认同性伴侣关系或同志收养小孩的权利。\n\n9月，同性恋者的父母抗议浙江杭州教育局授权出版的小册子将同性恋描述为“偏差性行为”，并建议家长加以“预防”。后来，出版社宣布将在该书于10月再版时删除这些内容。\n\n5月，北京同志中心连续第二年遭到逼迁。房东认为同性恋“太敏感”，要求他们搬走。该机构现已迁址。\n\n## 西藏\n\n在西藏自治区和清海、四川、甘肃、云南各省藏族自治地区，情势仍然紧张。2008年发生遍及整个高原的民间抗议之后，中国政府大举镇压，并且为了加强控制，在每一座寺院均派遣官员常驻。\n\n尙未有迹象显示中国政府将正视西藏人民要求更大自主权的愿望，即使只在该国少数民族自治法规的有限范围内。截至本文写作时，已有85名藏人自焚，其中首例发生于2009年2月27日，光在2012一年内就发生72起。至少69名自焚者死亡。\n\n中国政府持续在藏区部署大量安全部队，并严格限制进入藏区旅游，尤其是记者和外国访客。被怀疑不认同国家政治、宗教、文化或经济政策的藏人，遭到当局有系统地以“分裂祖国”罪名法办。6月18日，四川法院判处藏族僧侣云登嘉措（Yonten Gyatso）7年徒刑，理由是他与国外人权组织联系，传播藏区自焚信息。\n\n秘密逮捕和刑讯逼供仍然十分普遍。6月，甘孜（藏语Kardze）一位36岁藏族僧侣噶旺（Karwang）在被警方拘留期间遭疲劳侦讯致死。他是因为张贴主张西藏独立的海报，而在5月中旬被捕。\n\n基于在西藏高原打造“社会主义新农村”的政策，政府持续推行大规模开发项目，预计80％乡村居民都要迁移或改建房屋。与中国官方说法不同的是，迁移政策没有可行的替代方案可供居民选择，没有真正谘询受影响者的意见，也缺乏明确、适度的赔偿机制。牧民们被剥夺传统生计，生活水准下降，更加依赖政府救济。\n\n## 新疆\n\n中国政府藉口反恐或“反分裂”，持续在新疆维吾尔族自治区实行歧视维吾尔人和其他少数民族的政策，并且严厉钳制宗教与文化表达的自由。基于政治理由的逮捕时有所闻。\n\n维吾尔人所感受到的普遍恐惧气氛，导致族群对立不断升高。造成这种紧张态势的原因，包括无所不在的秘密警察、近来不断发生的强迫失踪、以及显然受到政治操纵的司法体系。\n\n族群对立的另一原因，是2009年7月乌鲁木齐暴动的后续影响。此一事件是中国近年来最严重的族群冲突。中国政府迄未说明暴动后被捕数百人的下落，也没有调查海外难民或当事人亲属对于狱中刑求虐待的控诉、或者公布暴动中被杀害者（多属汉族）的人数和姓名。\n\n对于有关宗教与文化言论的加强限制，已引发数起暴力事件。最严重者发生在2月28日，一群维吾尔人在汉人聚居的叶城街道（维语Kargilik）上攻击行人，刺死至少12人。政府宣称此案是由一位激进的地下神职人员马木提（Abdudukeremu Mamut）所领导，此人已在3月26日被判死刑。\n\n中国政府在2010年提出一项全面发展政策，其目标原本是要降低社经落差，提升少数民族地区的生活水平，并有助“打击分裂势力”，但这项政策目前最具体的表现，是拆除维吾尔人传统街区、将居民重新安置或强迫搬迁，以及将新疆大部分游牧民和牧民定居化。\n\n## 香港\n\n公民团体与社会大众已就人权议题向香港政府提出质疑。香港当局显然不愿太过偏离支持北京的立场，因此一直未能遵照基本法的规定提出朝向全民普选的改革措施，也没有积极维护特区的自主权、公民与政治权利、以及法治。\n\n9月中，香港政府屈服于民间压力，宣布暂缓推行旨在培养向中国共产党効忠的爱国主义教材。民间日益疑虑警方过分限制集会游行的措施，以及入境事务处恣意阻挡批评北京人士。民间也担忧大陆安全人员或其线民渗透特区、监视或威胁批评北京人士的现象日益增多，而港府却无法加以适当的调查。\n\n7月间，有两名内地上访者因到香港参加七一民主游行而在家乡江西省被判处14个月劳教。这是外界已知首例。\n\n## 主要国际角色\n\n虽然宣称要“以不懈的努力”追求叙利亚的和平，中国政府却与俄罗斯联手否决向叙利亚政府施压的三项决议案。此外，中国还漠视国际法，将至少7千名逃到云南省的克钦族难民遣回缅甸北方战乱地区，坚决否认他们具有难民身分。\n\n美国协助陈光诚一家固然值得赞扬，但包括美国在内的各国政府都未曾试图改变或改进它们和中国政府之间几乎毫无成效的双边人权对话机制。这些对话机制很少纳入公民社会团体的有意义参与。\n\n4月初，日本国会极不寻常地通过一项关于西藏的决议，呼吁中国政府恢复与达赖喇嘛之间的谈判。北京也被迫对南韩媒体批评其遣返北韩难民的报导做出回应，并且因而允许少数逃进南韩驻中国领事馆的北韩人民被送往首尔。"
		},
		{
			"post_id": 5,
			"title": "HRW 2014年人权报告：中国",
			"date_published": 1520829949.365,
			"body": "随著社会经济快速变迁，中国对于基本权利的某些限制慢慢放宽，但政府仍是威权主义的一党制国家。它任意勒束表达、结社、集会和宗教自由；禁止成立独立工会和人权组织；并且维持政党对所有司法机关的控制。\n\n* * *\n\n政府审查新闻、互联网、印刷出版品和学术研究，并且将人权侵犯合理化为维护“社会稳定”的必要手段。它在西藏、新疆和内蒙古等少数民族区域实施强压性政策和大规模非自愿性的人口迁移和住房改建。尽管初等教育入学率和基本识字率相当高，但中国教育制度歧视残疾儿童和年轻人。中国政府阻挠国内外人士审查其人权纪录，坚称他们意图破坏国家稳定。\n\n在此同时，针对一触即发的民生议题，公民日益有能力向当局发出质疑，例如圈地、强迫拆迁、环境恶化、司法不公、贪官滥权、歧视和贫富差距。官方和学者依据执法机关的报告统计发现，平均每天有300到500次参与人数介于十人到一千人之间的群体性事件发生。即便存在风险，互联网用户和倾向改革的媒体仍不断冲撞官方审查的红线，倡导法治和透明化、揭发官员弊端、呼吁政治改革。\n\n公民社会团体和倡导者持续在危险的处境中缓步推进工作，维权人士已建无形但坚靭的网络，对人权案件进行监测与纪录，形成非组织性的全国“维权”运动。这些维权人士经常面临警方的监控、拘押、逮捕、强迫失踪和酷刑。\n\n习近平政府于三月正式掌权后，陆续宣示将改革某些行之有年的政策，包括废除名为劳动教养的一种行政拘押制度，以及修改户籍登记制度。它并且对重大贪腐案件发动调查，即便对象多为政敌。但它同时也高唱保守论调，反对宪政、新闻自由和“西方式的”法治，并且紧缩对异见人士的限制，包括发出两份司法文件，使维权人士和互联网批评言论更容易受到刑事检控。\n\n一度是政治明日之星的薄熙来，9月被判处无期徒刑，他的庭审有如公开展演，吸引了大众目光，但却不符合公正审判的标准，他在重庆主政期间的广泛滥权行为也遭到忽视。\n\n**人权捍卫者**\n\n中国维权人士经常面临判刑、拘押、酷刑、关进精神治疗机构、软禁和恐吓。\n\n近年来对维权人士最严重的镇压发生在2013年，从2月到10月之间，有50多名维权人士遭到刑事拘留。这些人权捍卫者因为组织和参与公开的集体行动，被控“寻衅滋事”、“煽动颠覆”等定义模糊的罪名。7月，当局拘押许志永，他在思想上领导著“新公民运动”──一个维权人士的非组织性网络，其从事的行动包括在全国鼓吹要求官员公示财产。\n\n9月，北京维权人士曹顺利在登机前往日内瓦前遭到拘捕。当时中国正准备在10月22日于日内瓦接受联合国人权理事会的审查。曹顺利要求中国政府在起草提交人权理事会普遍定期审查（Universal Periodic Review, UPR）的国家报告时，必须谘询独立公民社会的意见。8月获释的另一位维权人士彭兰兰，就因为参与曹顺利发起的抗争而以“妨害公务罪”入狱一年。\n\n被判刑11年的诺贝尔奖得主刘晓波，仍在北方的辽宁省服刑。其妻刘霞则持续遭到非法监禁。8月，刘晓波的妻舅刘辉以诈骗罪名被重判11年；外界普遍认为刘辉是因身为刘晓波家人而受株连。\n\n**法律改革**\n\n尽管中国政府拒绝司法独立、禁止律师成立独立公会，进步的律师和法学家仍努力推动变革，促使大众的法律意识和维权行动日益增进。\n\n中国共产党仍然维持对所有司法机关的掌控，并且透过政法委员会协调司法系统的工作。公安局，或称警察，在刑事司法系统中仍然掌握最大权力。刑讯逼供普遍常见，法院相对弱势加上被告权利限缩，因此经常导致司法不公。\n\n11月，中国政府宣布将废止劳动教养制度，这种行政拘押制度授权警察不经审判即可关押人民最长四年。2013年初，全国约350座劳教所总共关押约16万人，但因警方不再裁处劳教，人数已迅速下滑。然而据官方媒体报导，某些劳教所已改名为戒毒所， 这是另一种形式的行政拘押。截至本文撰写时，仍不清楚中国政府是要彻底废除用行政拘押手段对付轻微罪犯，或是打算在另一种替代制度下继续容许不经审判的拘押。\n\n中国执行死刑的次数持续领先全球。精确的数目仍是国家机密，但专家估计处决人数已大幅减少，从十年前每年约1万人到最近每年低于4千人。\n\n**表意自由**\n\n表达意见的自由在2013年进一步恶化，特别是在政府全面整顿微博之后。政府和党对所有媒体和出版维持多重的控制。\n\n互联网审查者引导网上舆论，并且用“防火长城”阻挡中国网民接收外来信息。尽管有重重限制，互联网，尤其是称为“微博”的微网志服务和其他社交媒体工具，由于提供了相对自由的空间而广受欢迎，中国的5亿3千8百万网络用户借此互相联系或申诉寃情。然而，一旦触犯敏感禁忌，用户的身份将迅速被锁定，并遭到删帖或销号；有些人因此被拘押或判刑。\n\n1月，一份以调查报导挑战言论边界闻名的广州报刊《南方周末》陷入新闻审查争议之中，因为该报编辑发现新年特刊的献词在审查者命令下遭到改写，并且未经编辑同意就印刷出刊。该篇新年献词的原稿呼吁政治改革和尊重宪法保障的公民权利，但刊出的版本却变成赞颂中国共产党。该报员工于是公开批评广东省最高审查者，要求他辞职下台，并为此发动罢工；一周后，该报恢复正常出刊。\n\n5月，据媒体报导，中国共产党中央办公厅发出封口令，要求各大学不得讨论一些禁忌话题，人称“七不讲”，包括“普世价值”、党的历史错误等等。\n\n8月起，当局发动打击“网络谣言”的攻势。这项行动指向有影响力的网络意见领袖乃至普通网民。当局将数百名互联网用户拘押数天，关闭一百多个由公民记者建立的“非法”新闻网站，并拘捕了知名网上自由派评论者薛蛮子（Charles Xue）。\n\n同样在8月，中国政府主管互联网事务的官员警告网络用户不得触犯“七个底线”，包括中国的“社会主义制度”、“国家利益”和“公共秩序”等。9月，最高人民法院和最高人民检察院联合公布一则新的司法解释，将刑法四项条款适用到互联网言论，为检控互联网用户提供了更明确的法律依据。\n\n**宗教自由**\n\n尽管宪法保障宗教自由，实际上中国政府限制宗教活动只能由官方承认的五个宗教团体举办，并在官方认可的清真寺、教堂、寺庙和修道院中进行。一切宗教组织的活动、人事和财务纪录都必须接受官方审核，神职人员的任命、宗教出版品和宗教教育机构的开办都受到官方控制。\n\n未注册的信仰团体，例如基督教“家庭教会”，被视为非法且经常遭到搜索和查封；许多成员受到骚扰，领导人遭到拘押甚至判刑。\n\n中国政府将法轮功──1999年遭到查禁的一个气功信仰团体──列为“邪教”，逮捕、骚扰和恐吓其成员。电影导演及摄影师杜斌因为发表纪录片，揭露一间劳教所监禁法轮功学员并施予酷刑的状况，于5月遭到拘留五周后获释。\n\n4月，河南法院将七名家庭教会领袖以“利用邪教破坏法律实施罪”判刑三年到七年；证据显示他们仅是企图参加聚会和宣传教会活动。\n\n**健康权和残疾人权利**\n\n中国政府制定多项法规和行动计划，旨在降低严重的环境污染及其对公共卫生的威胁，但这方面的政策常常并未充分落实。\n\n2月，一位律师依据《政府信息公开法》要求公布土壤污染数据遭到拒绝；有关当局的说法是，这类数据属于“国家机密”。同样在2月，环境保护部在长年否认和不作为之后，终于承认有一些癌症不正常高发的“癌症村”存在。受害者多年来持续争取司法正义和赔偿，国内媒体也对此一议题做过广泛报导。\n\n尽管曾在2012年接受《残疾人权利公约》审查，中国对于残疾人权利的保护仍然不足。残疾人士在就业和教育方面遭到严重歧视，政府的某些政策则使歧视制度化。\n\n2月，国务院法制办公室公布1994年《残疾人教育条例》的修订草案。虽然值得赞许，这份修订草案并未确保残疾学生可以就读普通学校，或要求适当调整教学环境以提供“便利”（“accommodations”），使他们能在普通学校中充分参与。\n\n5月，中国首部《精神卫生法》正式实施。该法填补了重要的法律真空，但没有封死漏洞，政府官员和家庭仍可能违反当事人意愿将其关进精神病院。7月，该法实施后，访民辜湘紅即因向政府当局申诉寃屈而被关进北京一间精神病院。\n\n**妇女权利**\n\n女性的生殖权和取得生殖健康服务的机会仍因中国的计划生育法规而受到严重限制。尽管中国政府在11月宣布配偶其中一人为独生子女的家庭可生育第二胎，此一措施仍未根本改变中国政府强迫性的计生政策，包括使用法律和其他强制手段──例如行政处罚、罚款和强迫人工流产等强制措施──以控制生育选择。\n\n中国政府对性工作的惩罚性打压经常导致严重侵权，包括肢体暴力和性侵、染病风险增高以及造成中国估计4百万到1千万名性工作者──多数为女性──难以通过司法寻求正义。性工作者也指证许多公共卫生机构的侵权行为，例如强制性的艾滋病毒筛检、侵犯隐私和卫生官员的不当对待。\n\n1月，最高人民法院批准李彦的死刑，该名妇女因不堪长期被殴打而谋杀她的丈夫。在司法案件中，家庭暴力不被视为减刑条件。\n\n5月，中国最著名的性工作者维权人士叶海燕被警方拘留数天，此前她因揭发广西当地妓院的虐待情况而在住家遭到攻击。\n\n尽管中国政府了解家庭暴力、就业歧视和性别偏见相当普遍，却仍限制独立妇女维权组织为这些议题进行活动，包括在这些组织注册时加以刁难、监控其活动、讯问其工作人员和禁止部分活动。\n\n**移民和劳工权利**\n\n官方的中华全国总工会仍旧是工人的唯一合法代表；独立的工会被禁止成立。\n\n即便有上述限制，全国各地工人已日渐敢于发声和以行动争取改善工作条件，包括发动示威和罢工。9月，深圳码头工人为要求提高工资和改善工作条件而罢工。十天后，工人们接受政府协调的解决方案，满足了他们的部分诉求。\n\n5月，官方的中华全国妇女联合会发布新报告，说明移民工子女的人数，包括随同父母居住在城市以及“留守”农村的儿童，截至2010年已高达1亿人。移民工仍然无法取得城市的居住许可，因此无法获得教育等社会服务。许多移民工进城打工时只好把子女留在乡下家中，以便孩子能上学，这使有些孩子容易受到侵犯。\n\n虽然中国已有许多工作场所安全法规，但执行不力，尤其是在地方层级。举例而言，6月，吉林省一家禽类屠宰场失火，造成121名工人丧生。事后调查发现，当地消防部门在火灾发生前几天才刚通过该屠宰场的安全抽检，即使该场并不符合安全标准。\n\n**性倾向和性别认同**\n\n中国政府一直到2001年都将同性恋列为一种精神疾病。到目前都没有法律保护人民免于性倾向或性别认同的歧视，这种歧视仍极常见，尤其在工作场所。\n\n同性伴侣和同性婚姻都不受现行中国法律承认。2月份，一对女同性恋伴侣到北京结婚登记处申请注册，但她们的申请遭到拒绝。\n\n5月17日，国际反恐同日当天，长沙市当局拘捕了同性恋游行的组织者向小寒，以组织“非法游行”罪名将他行政拘留12天。在中国，示威游行必须事先申请，很少得到许可。\n\n**西藏**\n\n中国政府以打击所谓分裂主义情绪为名，在西藏系统性地打压政治、文化、宗教和社会经济权利，包括以非暴力手段要求西藏独立、达赖喇嘛返乡和反对政府政策。截至本文撰稿为止，已有123位藏人自焚抗议中国政策，其中有纪录的最早案例发生于2009年2月。\n\n任意逮捕和监禁依然常见，拘押期间酷刑和虐待也很普遍。公正审判的可能性不存在，因为司法系统受到政治操控，且公然被赋与打击分裂主义的任务。\n\n警察系统性打压任何未经许可的聚会。7月6日，道孚县尼措区（藏语：Nyitso, Dawu）警方向在乡间集会庆祝达赖喇嘛生日的群众开枪。数人受伤。政府限制媒体报导此一事件。\n\n为了避免像2008年一样的民众抗议再度发生，中国政府在2013年继续维持当年残暴镇压抗争运动時实施的许多措施──以武警为主的大量安全部队进驻、严厉限制藏人在西藏高原地区的迁徙、加强对寺院的控制以及禁止除官方采访团以外的外国记者进入西藏自治区。中国政府并采取重要步骤，按照计划在西藏自治区增派2万名党政干部，包括进驻每一座村庄，监视所有居民的政治观点。\n\n中国政府还针对数百万藏人执行大规模住房改造和安置政策，剧烈改变藏人的生计和生活方式，有时导致他们陷于贫困或依赖政府补助，居民却无权置啄。2006年起，西藏自治区逾两百万藏人，包括农民和牧民，已遭非自愿“住房改造”──由官方强制翻修旧房或重建新房；西藏高原东部成千上万游牧民已被重新安置或定居在“社会主义新农村”。\n\n**新疆**\n\n中国政府借口“打击分裂主义、宗教极端主义和恐怖主义”，合理化普遍的族群歧视、严重的宗教压迫和日增的文化压抑，持续刺激新疆维吾尔族自治区的紧张情势升高。\n\n2013年，包括维族、汉族和其他民族，共有一百多人在该区各地不同冲突事件中丧生，这是自2009年7月乌鲁木齐抗争以来死亡人数最多的一次。之所以死伤惨重，在某些地方似乎是因为官方以军事手段攻击预谋暴动的团体，例如4月23日在巴楚县，以及6月26日在吐鲁番市。但在其他地方，安全部队显然是对无武装的示威群众使用了致命武力。\n\n6月28日，和田市警方为阻止民众向市政府游行，抗议任意关闭一间清真寺并逮捕该寺依玛目，最后开枪打伤了数十名示威者。8月8日，阿克苏市警察部队为了档住涌向附近清真寺庆祝宗教节日的村民，发射实弹打伤数人。在每次事件见报后，政府照例指责“分裂 主义、宗教极端主义和恐怖主义势力”，同时阻挠独立调查。\n\n被认定为分裂分子者经常遭到任意逮捕、酷刑和“失踪”，在居民之间造成切肤的恐惧感。7月，北京中央民族大学维族教授伊力哈木・土赫堤（Ilham Tohti）发表致政府公开信，要求调查他记录到的34件失踪案。伊力哈木曾遭数度软禁，并被限制出境。\n\n中国政府持续拆除维族传统街区，将居民迁移到官方规划的安置区内居住，这是2010年开始实施的全面开发政策的一部分。中国政府说，该政策旨在促进新疆城市化及发展。\n\n**香港**\n\n尽管事实上香港持续享有独立的司法系统、新闻自由和活跃的公民社会，但1997年主权回归中国以来，香港的新闻和集会自由仍日益受到威胁。原本期待特区行政长官选举自2017年起具有真正竞争性，但在北京表明唯有不“与中央对抗”的候选人才能参选之后，这种期望可能落空。\n\n近年来，香港的法治逐渐遭到侵蚀，其徵象包括警察对集会游行的管制日益加严，以及入境事务处任意禁止批评北京者入境，例如法轮功成员和被流放的八九民运异议人士。\n\n**中国外交政策**\n\n尽管中国持续崛起为全球强国，并且在2013年完成领导层交接，任命了新的外交部长，但其长期建立的外交政策观点和实践仍维持相对一贯。\n\n中国与联合国各种机制的交往已更为密切，但遵循国际人权标准的程度仍未见显著改善，也没有著力促进其他国家的人权保护。值得注意的例外发生在11月，当选联合国人权理事会成员国不久之后，中国公开敦促斯里兰卡“努力保护和促进人权”。\n\n即便面对叙利亚的死亡人数直线上升，以及叙利亚在2013年8月对平民使用化学武器获得证实，北京仍继续反对安理会采取任何重大措施，以加强对阿塞德政权和残虐的叛乱团体施压。中国反对将叙利亚情势提交国际刑事法院（ICC），也反对禁运武器给广泛违反人权或战争法的武装部队。中国同时还掣肘安全理事会，使其无法迅速将急需的人道援助穿越边界送往叛军控制下的叙利亚北部地区。\n\n中国当局对朝鲜的外交战术有些微调──也或许反映长期的战略变迁──不论公开或私下都更常加以批评，尤其是当平壤在为因应朝鲜核武计划而召开的六方会谈成员国之间采取升高紧张的动作之后。\n\n中国的国有和私营企业继续维持外国直接投资首要来源的地位，特别是在发展中国家，但在某些情况下却不愿或不能遵守国际劳动标准。\n\n**关键国际行动者**\n\n大多数与中国政府保持双边人权对话的各国政府，包括美国、欧洲联盟和澳大利亚，在2013年都至少与中国举行了一轮会谈；大多数认为这样的对话对于促进中国内部实质变迁的作用有限。\n\n这些国家中有几个政府曾公开表达关切某些个案，例如许志永或刘辉，或关切当前的趋势，例如对民间反贪活动的诸多限制。美国和澳大利亚的驻华大使，以及欧盟人权事务特别代表，曾获准访问西藏自治区或藏区其他地方。\n\n针对中国人民在2012到2013年领导换届期间被剥夺参政权，上述各国政府没有做出任何评论，只有极少数政府成功地将人权关注整合到他们与中国资深官员的会议中。\n\n中国接受了联合国残疾人权利委员会──职司监督缔约国实施《残疾人权利公约》的国际条约机构──对其遵行条约情况的审查，以及联合国人权理事会就其整体人权纪录的审查，但是在酷刑、任意拘押和限制言论自由方面，中国并未提供必要信息，或仅提供极端误导的信息。已有八位联合国特别报告员要求到中国视查却未能获得邀请，在中国境内运作的联合国机构仍然受到严格限制，他们的活动遭当局密切监视。\n\n**更正启事：**\n2014年度世界人权报告中国篇第328页：原文写道在“7月6日，道孚县尼措区（藏语：Nyitso, Dawu）警方向在乡间集会庆祝达赖喇嘛生日的群众开枪”事件中“造成两人死亡，数人受伤”。后续报道指出该事件并无人员死亡，数人受伤。"
		},
		{
			"post_id": 4,
			"title": "HRW 2015年人权报告：中国",
			"date_published": 1520568175.57,
			"body": "中国仍是威权主义国家，对于包括表达、结社、集会和宗教自由在内的基本人权，凡被认为威胁一党专政，便予以有系统的限制。自2013年3月新领导班子掌权以来，有关当局已在某些领域采取正面措施，包括废除名为劳动教养的任意拘押制度，宣布有限度改革造成移民工无法取得社会服务的户籍登记制度，以及略微放宽身心障碍者参加高等学校招生考试的机会。\n\n* * *\n\n但在同一时期，有关当局也对基本人权和维权人士发动了一波猛烈程度为近年罕见的攻击──因为现任领导人可能掌权到2023年，此举令人尤其担忧。从2013年中开始，中国政府和执政的中国共产党向党员、大学教师、学生、研究人员和新闻工作者发出坚持“正确”思想的指示。这些文件要求他们警惕“普世价值”和人权观念的危害，并强调支持政府和支持中共的重要性。\n\n中国政府非但不把律师、作家和告密者视为有效处理社会动荡的盟友，反而持续敌视批评声音。中国政府针对维权人士及其家属加以骚扰、任意拘押、没有法律依据的监禁、酷刑和剥夺适当医疗。它还大幅收紧新闻媒体和互联网的空间，更加限缩公民推动迫切改革的机会。\n\n中国政府对维权人士的公然敌视，悲剧性地反映在草根维权人士曹顺利于3月死亡的事件。曹顺利试图参与在日内瓦举行的2013年联合国人权理事会对中国人权纪录的普遍定期审议，因此遭到拘押。有关当局无视她身患重病，长达数月不让她接受适当医疗照护，直到2014年3月她过世前几天，当局才终于将她由看守所转送到医院。\n\n中国政府持续其反腐运动，目标既有高官，例如曾经独揽治安大权的周永康，也包括低层官员。但运动使用的方法却进一步破坏法治：涉案官员被非法拘押，基本法律保障尽遭剥夺，且常受刑讯逼供；称为“新公民运动”的民间网络致力倡导官员财产公示以打击贪腐，却遭到特别严酷的报复。\n\n中国政府8月31日否决在香港实施真普选的决定，引起学生发动罢课和示威活动。警方起初试图使用胡椒喷雾和催泪瓦斯驱散一些示威民众，反而激起成千上万市民加入抗议，占据多处交通要道。\n\n港府高官一度不情愿地和学生领袖会面，但没有就选举程序提出任何修正。数百“占中”群众持续留守三处占领区，直到11月法院对某些区域发出不得阻塞道路的禁制令后，港府随即使用过当武力逮捕抗议领袖，并再度有攻击性地使用胡椒喷雾。\n\n抗议者持续坚守其它区域，部分学生领袖开始以绝食呼吁港府重启对话，其他抗议领袖则主动向警方自首，凸显公民不服从的意义。目前街头抗争虽渐趋平息，由于背后的政治议题悬而未决，随时可能再度爆发。\n\n**人权捍卫者**\n\n维权人士日益面临任意拘押、监禁、送入精神病院或软禁。殴打、骚扰和恐吓则是家常便饭。\n\n中国政府已将九名新公民运动参与者定罪判刑──包括发起人、知名法律学者许志永──罪名多为文义模糊的扰乱公共秩序等罪名。著名律师浦志强和记者高瑜等人在2014年6月天安门屠杀25周年前后被捕。许多维权人士持续在押候审，其中律师常伯阳和郭飞雄等人的律师申请会见一再受阻。他们被控的罪名几乎都较往年从事同样活动的维权人士更重。刑事拘留的案件有所增加，可能与劳动教养制度于2013年底被废除有关。\n\n中国约有50万个注册非政府组织（NGOs），其中许多实际上由政府营运。估计另有150万个NGO没有适当注册，因为注册标准虽经近年逐渐放宽仍相当严苛。中国政府仍旧对NGO抱持疑虑，并有迹象显示有关当局在2014年对某些民间组织加强监控。\n\n6月，有一中国网站贴出国家安全委员会内部文件，通令全面清查在华境外非政府组织及其国内合作伙伴。此后，一批民间组织据报被要求答覆问卷，说明工作内容和经费来源，并有警察上门访查。6月到7月，反歧视组织益仁平因该组织一名律师的维权活动而被警方冻结银行帐户及抄查办公室。\n\n**新疆**\n\n中国政府以 “打击分裂主义、宗教极端主义和恐怖主义” 为借口，把普遍的民族歧视、严重的宗教打压和日益加强的文化压迫合理化，持续对新疆维吾尔自治区不断升高的紧张情势火上添油。\n\n3月，数名维族凶徒在云南昆明火车站持刀砍杀民众，至少30人丧命。5月，乌鲁木齐一处繁忙市场遭引爆炸弹，31人被炸死。8月，据官方媒体报导，凶徒攻击新疆莎车（叶尔羌）警察派出所、政府办公室和马路上来往车辆，造成近百人死亡。中国政府指控“恐怖组织”应为这几起事件负责。\n\n乌鲁木齐爆炸案后，中国政府宣布在新疆展开为期一年的反恐专项行动。仅在第一个月内，警方就以涉恐罪名逮捕380馀名嫌犯，审讯300馀人。有关当局并组织上千人参加其中数十名被告的公开宣判活动。8月，有关当局处决3名策划2013年10月天安门广场袭击行动的维族人士。由于缺乏关于上述案件的独立信息来源、中国政府坚持速审速结、中国法律容许涉恐案件嫌疑人拘押期间可禁止会见律师长达数月，加上中国警方滥用酷刑的纪录，公正审判权仍深值忧虑。\n\n尽管中国政府有充分理由打击暴力犯罪，但歧视和压迫少数民族的政策只会让问题恶化。2014年1月，经常直言批评中国政府新疆政策的中央民族大学维族教授伊力哈木・土赫提遭警方拘留，其后被控“分裂国家罪”，并可能被判处无期徒刑。8月，维族语言学家阿不都外力・阿尤普（Abduweli Ayup）因为筹款经营母语学校而以“非法集资”罪名被判处18个月徒刑。\n\n**西藏**\n\n藏人为抗议中国政府压迫的连串自焚行动，自2014年初以来似已渐趋缓和。有关当局以自焚者的家属和社区涉嫌煽动或参与抗议为由，对他们处以监禁、巨额罚款和限制行动等惩罚。\n\n有关当局对藏人和平抗议毫不容忍，不论是反对在被认为是圣地的土地上采矿或抗议拘押当地藏人领袖，一概予以殴打、逮捕等强烈反应。据媒体报导，6月，云南省西南部藏人抗议开采铜矿，遭警方殴打、拘押。8月，四川省甘孜自治州无武装的群众示威抗议当局拘押村中领袖，遭警方开枪镇压。同在6月，秘密拍摄藏区纪录片被判刑六年的顿珠旺青刑满出狱。\n\n中国的大规模迁移安置政策已剧烈改变藏人生活方式和生计，有些藏人因此陷入贫穷或依赖政府救济。2006年起，西藏自治区超过2百万藏族农牧人口被迫接受“安置”──ˉ 即依政府命令改建或新建住房；青藏高原东部则有数十万游牧民被迁移或定居在“社会主义新农村”。\n\n**香港**\n\n2013年1月，香港教授戴耀廷首倡“用爱与和平占领中环”运动，借以施压北京依据《基本法》──即香港的准宪法，其中规定《公民及政治权利国际公约》（公政公约）继续在香港适用──给予香港真正民主。公政公约规定，人民应有平等的投票权和参选权。2014年6月，近80万人在和平占中举办的“模拟公投”中投票支持民主；7月，至少51万人参加争取民主的游行。\n\n8月31日，中国最高立法机关宣布要强加一个严格筛选机制以禁止不受中央政府欢迎的人士被提名为特区行政长官候选人。作为回应，学生于9月下旬罢课，并在政府总部前进行小规模和平抗议。警方以胡椒喷雾驱散学生，并加以拘捕。\n\n警方的手段激起数十万人加入学生行列。占中运动组织者宣布将正式启动其示威计划，与学生并肩抗议。9月28日，香港警察宣布抗议行动不合法，并在政府总部外围设下封锁线。此一决定促使更多抗议者聚集在政总周边，要求警方重新开放该区域。被警方封锁线围困在政总的抗议者，和封锁线外的支持者，最后一齐走上阻隔双方的大马路，并占领了附近几条道路。\n\n抗议群众最后占领了香港几个位于主要商业和政治中心的地点。警方数度滥用武力对付普遍和平的抗议人士，包括有攻击性地使用胡椒喷雾和几次殴打均被摄进镜头，此后政府暂采被动立场，待民间团体申请法院禁制令获准后再进行清场，策略是等待民意转向反对示威者。\n\n法院发出禁制令后，警方陆续清除两个占领区，并成功阻止民众堵塞政府办公室出入口；另外两处较小区域直至本文撰稿时仍被占领，但学生正考虑是否要放弃以“占领”为手段。\n\n占中背后的政治议题尚未解决，中国和香港有关当局仍一致力挺北京8月31日的决定。戴耀廷和其他占中领袖曾主动到警局自首，凸显其尊重法治和公民不服从的立场；部分学生领袖则发动绝食，试图劝说政府重启对话。\n\n尽管媒体在香港享有较中国其它地区更多的自由，但记者和媒体业主，尤其是批评北京者，在2014年受到比以往更大的压力。2月，著名报社编辑刘进图遭不明暴徒以刀刺伤；7月，广受欢迎、支持香港争取民主的独立新闻网站《主场新闻》关闭，其创办人自称是因为恐惧政治报复；2014全年，黎智英及其以批评中国著名的新闻媒体，均不断受到威胁。\n\n**表达自由**\n\n中国政府于2014年有针对性地加强对互联网和新闻媒体的限制。所有媒体都已普遍受到控制和审查。政府持续以涵盖全国的互联网防火墙排除在政治上不可接受的信息。\n\n2013年8月起，中国政府把矛头指向日益流行的即时通讯应用程序“微信（WeChat）”，关闭某些报导和评论时事且较受欢迎的“公众号”。另有2千万个帐号因涉及“招揽嫖妓”而被封停。有关当局还颁发新规则，要求微信新用户实名登记。2014年7月到8月，中国政府暂停包括Kakao Talk在内的外国即时通讯服务，指称这些服务软件被用来“散播恐怖主义相关信息。”\n\n有关当局同时加强限制新闻。国家新闻出版广电总局于7月发出通知，要求中国所有记者签署协议，承诺在未经所属单位允许前，不得发布未公开的信息，并规定记者必须通过政治思想考试才能领取官方记者证。\n\n7月，中共中央纪委指出中国社会科学院研究人员“遭境外势力渗透”，每逢敏感时期进行“不法勾连”活动。中共随即发布新规则，使意识形态成为社科院考核属下研究员的首要标准；凡违反政治纪律者可予免职。\n\n**宗教自由**\n\n虽然宗教自由受宪法保障，但中国政府限制宗教活动只能由官方认可的五大宗教组织，在官方许可的清真寺、教堂、寺院和宫观举办；任何被国家认为“不正常”的宗教活动均予禁止。政府考核宗教团体的活动内容、人员聘用和财务纪录，并且控制宗教人员的任命、宗教出版物和神学院的设立。2014年，中国政府进一步提升对宗教的控制，尤以基督教会为重点。\n\n2013年底到2014年7月初之间，中国政府在基督教会特别集中的浙江省拆除了150座教堂的十字架。7月，基督教会牧师张少杰被判处12年重刑。同月，珠海当局未出示任何法律依据，搜查佛教领袖吴泽恒的住所并拘押他和至少十几名信徒。据媒体报导，中国政府还驱逐数百名外籍传教士；对于教宗方济各8月中表示希望梵蒂冈“与中国建立全面关系”的声明，中国政府亦未予公开回应。\n\n中国政府将许多在其控制以外的宗教团体均归为“邪教”。以气功煅炼为主的法轮功信仰团体自1999年7月起遭到查禁，并持续受到政府迫害。6月，内蒙古有关当局拘押另一“邪教”团体“门徒会”的15名成员，因为他们公开以舞蹈形式“蛊惑”民众加入。\n\n**妇女权利**\n\n中国妇女的生殖权利和获取生殖健康服务的机会因计划生育政策受到严重限制。该政策包括利用司法和其它强制措施，如行政处罚、罚款，以及强制安装子宫环和强制堕胎等强制措施，控制生育决定。\n\n9月到10月，香港女性示威者称遭袭击者性侵，而附近的警察却未积极干预。\n\n中国于10月接受《消除对妇女一切形式歧视公约（CEDAW）》审查。委员会表示关切的事项包括司法独立和女性寻求司法救济管道不足，以及女权维权人士遭报复等等。中国有关当局阻止两名维权人士出席上述审查会：中国著名性工作者维权人士叶海燕遭行政拘留；爱滋病维权人士王秋云则被没收护照。\n\n11月，中国政府发布等待已久的反家庭暴力法草案，征求各界意见。尽管方向正确，但草案内容未达国际标准和较佳实践。有关家庭暴力的定义过于狭隘；妇女能够申请的人身安全保护令不足，且与受害人是否之后会对加害人向法院提起诉讼的决定捆绑在一起。\n\n**身心障碍者权利**\n\n尽管中国已于2008年6月批准《身心障碍者权利公约》（或称《残疾人权利公约》），身心障碍者仍面临各种阻碍，包括教育机会不足和强迫收容（包括做为一种处罚形式）。\n\n在中国，四分之一的身心障碍儿童因歧视和排斥而无法入学。官方指导原则甚至允许各大学拒绝某些障碍考生报考特定学科。4月，中国教育部宣布允许高校招生考试使用盲文或电子试卷，但在一起指标性案件中，盲人维权人士李金生拿到的不是他所需要的电子试卷，而是他不善阅读的盲文版试卷。李案凸显身心障碍人士不易享有合理便利（reasonable accommodation）的权利，该权利尚未获得中国法律承认。2013年公布的《残疾人教育条例》修正草案并未在2014年通过。\n\n2013年生效的《精神卫生法》规定，精神障碍者的治疗和住院应基于自愿原则，除非患者被诊断有严重精神障碍且有危险或已经伤害自己或他人。在11月发生的一起重要案件中，上海一名已被实施住院治疗的患者引用该法起诉精神病院侵害其人身自由。据维权网（CHRD）报导，中央政府向各地官员下达政策指标，“重性精神疾病患者”检出率不得低于当地常住人口的千分之二。\n\n**性倾向与性别认同**\n\n同性恋于1997年已去犯罪化，但直至2001年为止仍被列为精神疾病。迄今没有任何法律保护人民免于性倾向或性别认同的歧视。同性伴侣关系尚未获法律承认。\n\n尽管缺乏法律保护，许多个人和组织仍持续向法院起诉，为自己的权利争取更好的保障。2月，一名维权人士控告政府，因为河南省民政厅拒绝他的组织办理注册。该组织关注女男同性恋、双性恋和跨性别（LGBT）议题，但当地政府认为同性恋违背中国传统文化和“精神文明建设”。法院认定政府并未侵犯同性恋名誉而于3月决定不予立案。\n\nLGBT团体持续纪录“转化治疗”现象，即部分诊所提供“治疗” 同性恋的服务。2014年3月，一名化名小振的男子状告重庆一家诊所曾对他实施电击疗程。此案为中国法院受理的第一件“转化治疗”案例。\n\n11月，深圳有一名男子提起性倾向歧视诉讼；该案若得到法院受理，将为中国首开先例。\n\n在10月中国接受CEDAW审查期间，一名官方代表曾表示：“所有中国公民的权利都受到法律保护，不论其性倾向为何。”\n\n**主要国际行为者**\n\n即便习近平上台后中国人权大步倒退，大多数外国政府却对其人权纪录保持沉默，选择以经济和安全议题为优先，或试图争取中国在气候变迁等议题上的合作。仅有少数双边人权对话在2014年举行；在以这种对话为其人权策略核心的各国政府之中，少见研拟出其它有效的长期策略，例如加强与中国公民社会的交往。\n\n同时，各国政府大都没有纪念天安门屠杀25周年，或当中国拒绝在香港实施真正普选时发声抗议；只有少数几个外国政府关注著名维权人士被判重刑，以及高智晟出狱后继续受到监控的问题。南非有关当局近年来第三次表示不会发入境签证给达赖喇嘛。\n\n同样，联合国秘书长潘基文也未能在8月访问中国时对其人权纪录恶化发出批评，反而赞扬该国“对促进人权有所贡献”。\n\n**外交政策**\n\n中国2013年的领导班子交接并未对其外交政策造成显著改变，不过它更加积极在亚洲部分地区推进其领土主权的主张。\n\n虽然中国参与各种联合国机制，但它并未显著提升对国际人权标准的遵循程度，也没有在朝鲜等其它国家促进人权保护。有八位联合国特别报告员发出要求到中国视察但迄未获准；派驻中国境内的联合国各机构仍被牢牢限制，其活动受到有关当局密切监视。\n\n做为联合国人权理事会成员国，中国一贯投票反对审查世界各国的重大侵犯人权事件。2014年，中国曾投票否决关注朝鲜、伊朗、斯里兰卡、白俄罗斯、乌克兰和叙利亚等国人权侵犯的决议案。\n\n中国在2014年反覆呼吁对叙利亚、苏丹和南苏丹问题寻求“政治解决”，同时却在这三个国家采取有助延续人权危机的措施。尤其值得注意的是，中国在安全理事会动用否决权，使叙利亚情势无法提交国际刑事法院。自2011年以来，这已是中国第四次与俄罗斯一同动用否决权，反对安理会采取行动处理叙利亚侵犯人权问题。\n\n不过，2014年9月有一名中国驻朱巴（Juba）使馆官员宣称，中国已暂停对南苏丹出售武器；这项政策改变迄本文撰写时止尚未获得独立证实。中国还持续施压各国政府，要求强制遣返中国籍寻求庇护者，并且拒发签证给中国政府不喜欢的人士，例如达赖喇嘛。"
		},
		{
			"post_id": 3,
			"title": "HRW 2016年人权报告：中国",
			"date_published": 1520567634.162,
			"body": "![2016-wr-china.jpg (832x468)](data/img/post_3_2016-wr-china.jpg)\n\n一名民警守在走廊，不准由官方组织来参访北京市第一看守所的新闻记者进入。2012年10月25日\n\nAlexander F. Yuan／美联社\n\n* * *\n\n受中国共产党统治逾六十年，中国仍是一个威权主义国家，广泛并有系统地压制基本人权，包括表达、结社、集会和宗教自由在内。尽管2015年有稍许正面发展──例如，当局将可判死刑的罪名由55项减至46项，并下令保障身心障碍学生在高校考试获得“合理便利”──但在国家主席习近平治下，人权显然持续趋向负面发展。\n\n自觉权力受到威胁的中国高层领导人，现已公然拒斥人权普世性，将这种观念说成是“外国渗透”，并以刑罚加于推动这种观念的人士。本来已饱受限制的表达和宗教自由，因多项新增的限制措施而在2015年遭到特别严重的打压。\n\n过去十年积极维护人权的许多个人和团体，在这波针对和平异见人士的猛烈打压中受伤惨重，他们受到的对待与习近平主席推动“法治”的诺言背道而驰。在7月到9月之间，全国各地约有280名人权律师和维权人士遭到短暂拘留或传唤，其中约40人仍然在押，且大都被关在秘密地点，无法联系律师或家属，有些人已超过合法拘押时限；他们大多被控参与“严重扰乱公共秩序”的“重大犯罪团伙”。政府关闭多个非政府组织或拘押其工作人员，并逮捕、监禁许多维权人士。\n\n政府并提出或已通过多部有关国家安全、网络安全和管理境外非政府组织的法律；这些法律将和平批评政府的言论与国家安全威胁混为一谈。例如，《境外非政府组织管理法》草案第二版对这类组织的人事和运营施加沉重的监管框架和限制，并增加公安对它们的工作加以许可和监督的权力。尽管中国政府向来将和平批评视为威胁国家政权，因此严密监控非政府组织似乎不足为奇，但以更多法律为这种干预提供依据，无疑将使官员在威慑或惩罚维权人士时如虎添翼。\n\n习近平主席的反贪行动普获国内民众支持，但相关案件仍旧经常违反公正审判权。6月，前安全首脑周永康经长达数月的违法秘密羁押及闭门审理后，被判处无期徒刑。与此同时，法律学者许志永及其他新公民运动反贪腐维权人士仍在狱中煎熬。\n\n## 人权捍卫者<a data-cke-saved-name=\"866135\" name=\"866135\"></a>\n\n维权人士在习近平治下面临激烈报复，不时因人权工作而遭当局任意拘押、强迫失踪、政治审判和酷刑。\n\n许多不同的非政府组织遭虚假指控而被关闭或拘押工作人员。2014年下半，当局拘押北京着名政策思想库传知行研究所的主任郭玉闪和行政主管何正军，指控他们涉嫌“非法经营罪”；两人于2015年9月取保释放。6月，与着名的北京反歧视机构益仁平有关的郑州益仁平两名前主任被押。他们虽然获释，但政府发言人仍指益仁平“涉嫌违法”而扬言将予“处罚”。其他非政府组织，连一些较不知名或从事非政治敏感业务的机构，例如专门救助流浪者的深圳基督教关爱中心，也难逃关闭和逮捕。\n\n除了2015年对全国近280名律师和维权人士的围捕，人权律师还日益成为肉体攻击的目标，包括被法院人员施暴。8月，律师张凯为浙江省反抗当局强拆十字架的基督教徒提供法律意见而被捕。律师浦志强与唐荆陵则因不同案件自2014年5月被捕，羁押至今尚未宣判。\n\n政府日益习于利用模糊的公共秩序罪名压制维权人士发声。截至本文撰稿时，着名广东维权人士郭飞雄在2014年11月因“聚众扰乱社会秩序罪”出庭受审后仍在等候判决。\n\n多名维权人士，包括年长记者高瑜、律师浦志强、维族学者伊力哈木・土赫提和反贪腐人士刘萍，持续在羁押或服刑中得不到适当医疗照护。\n\n## 表达自由<a data-cke-saved-name=\"30df93\" name=\"30df93\"></a>\n\n中国政府透过审查和处罚严密限制表达自由。虽然互联网提供了相对自由的空间，但政府以“防火长城”等方式审查政治上不为其所接受的信息。媒体审查下，仍时有少数记者和编辑冲撞言论界线。\n\n2015年，国家互联网信息办公室等政府机关新出台多项指令，包括加强限制用户名称和代号的使用，要求网络文学作者实名注册等。政府并关闭或限制使用虚拟专用网络（VPN），许多用户依靠这种工具浏览在国内被屏蔽的网络内容。\n\n3月，当局部署新式网络攻击武器“大炮”（Great Cannon），干扰反制中国网络审查组织GreatFire.org的服务。7月，政府公布网络安全法草案，要求国内和国外互联网公司执行内容审查、用户实名注册、本地存储数据和协助政府监控。8月，政府宣布将在大型互联网公司派驻警察单位，以有效防止网络“传播谣言”。\n\n2015年1月，教育部长袁贵仁下令各大学严禁采用传播西方价值的教材和在课堂上发表“攻击毁谤党的领导”的言论。\n\n4月，着名记者高瑜被控泄露一份要求加强审查自由主义和政治改革理念的中共党内文件而被判处七年徒刑。她被强迫认罪，并在刑事侦查尚在开始阶段即透过国营电视台播出她认罪的视频。\n\n财经报导通常不似政治新闻易引争议。但政府在8月采取警告行动，拘押财经记者王晓璐，因其报导当局考虑取消在6月到7月股市大跌后推出的稳定措施。\n\n同在8月，乌鲁木齐政府以国家安全罪名审判美国自由亚洲电台记者肖克来提・吾守（Shohret Hoshur）的两名亲兄弟；他们可能因为吾守批评新疆情势的报导而遭到惩罚。新疆是中国西部少数民族敏感地区。9月，一名电脑工程师因为在电视画面中置入反共标语而被判刑12年。\n\n## 妇女权利<a data-cke-saved-name=\"9e7657\" name=\"9e7657\"></a>\n\n虽然中共表面上宣扬性别平等，却因不尊重人权而令妇女从就业到性骚扰各方面均持续面临系统性的歧视。家庭计划政策控制人民生育子女的数目和间隔，使妇女的生殖权利持续受到严重限制。10月，当局宣布废止数十年来的“一孩”政策；每对夫妻现可生育两名子女。\n\n3月，至少十名女权运动人士因策划在中国三个城市张贴和散发反性骚扰传单而遭警方拘押。其中五人迅速获释，其他人则被控“寻衅滋事”而羁押37天，引发国际舆论哗然。这五人虽已取保释放，但行动仍受限制，相关组织杭州蔚之鸣妇女中心也因警方骚扰而被迫自行关闭。\n\n3月，最高人民法院等机关联合发布法律意见，要求法官将家庭暴力列为受害人涉及刑案的减刑条件。8月，中国立法机关对搁置已久的《反家庭暴力法》草案进行审议。虽然方向正确，该草案仍未达到国际标准，特别是在家庭暴力的定义方面。地方政府当局未适当处置家庭暴力案件的事件仍经常发生，令人忧虑。举例而言，7月有一名妇女竟在派出所进行调解时遭丈夫杀死。\n\n## 宗教自由<a data-cke-saved-name=\"41c84a\" name=\"41c84a\"></a>\n\n政府限制宗教活动只能由官方认可的五大宗教，在官方许可的宗教场所进行。政府考核宗教团体的活动内容、人员聘用和财务纪录，并且保留对教职人员任命、宗教出版物和申设宗教院校的控制。\n\n2015年，当局持续在中国基督教重镇浙江省推行拆除教堂十字架的行动，有时连教堂都被整个拆毁。这项行动对外说法是拆除违反城乡规划的“违法建筑”，但根据一项省级内部指示，其目的在降低基督教在当地的影响力。\n\n据报自2014年初拆除行动开始至今，起码有一百名基督徒因抵抗强拆而被短暂拘押。至少有一名教会领导人，黄益梓，因抗议拆除而被控“聚众扰乱社会秩序罪”并于3月遭判监一年。\n\n6月，一名中共中央领导人指示宗教界领袖警惕“敌对势力”利用宗教向中国渗透，并要求他们坚持“宗教中国化”以确保宗教为祖国统一服务。\n\n政府将许多不受其控制的宗教团体归类为“邪教”，例如法轮功，只要加入就可能遭到判刑和法外处罚。另一团体，华藏宗门，也被当做逮捕目标，其领导人吴泽衡以“利用邪教组织破坏法律实施”、诈骗等多项罪名于10月被判处无期徒刑。\n\n8月，全国人民代表大会通过修正《刑法》第300条组织、利用邪教罪条文，将该罪量刑上限加重至无期徒刑。\n\n## 身心障碍者权利<a data-cke-saved-name=\"19a15f\" name=\"19a15f\"></a>\n\n中国于2008年批准《残疾人权利公约》，但身心障碍人士持续面临阻碍和歧视，包括缺乏受教育机会。\n\n随着教育部在2014年开放盲文和电子试卷，今年已见到更多视障学生参加普通高等学校招生全国统一考试（简称“高考”）。4月，教育部又颁布新规定，要求各级教育考试机构提供“一种或几种”的“合理便利”，例如为参加高考的身心障碍学生延长考试时间、提供手语翻译服务等等。由于中国法律法规从未明定教育机构必须提供这类学生符合残权公约定义的“合理便利”，4月的这项决定不失为一大进步。\n\n2013年公布的身心障碍者教育条例草案迄未完成立法。官方指导原则仍旧允许各大学拒绝特定障别的考生就读特定专业。因此，虽然更多身心障碍学生有机会参加高考，但许多大学仍然不让他们进入自己选择的研究领域，或根本不让他们就读该校。\n\n2013年施行的《精神卫生法》规定，住院治疗应基于自愿，除非经确诊为严重精神障碍患者，并已发生伤害自己或危害他人安全的行为或有此危险。然而在4月，首宗病患引用该法控告强制住院的案件却遭上海法院宣判败诉。该案原告徐伟（化名）因精神分裂症而被强制住院超过十年。\n\n## 性倾向与性别认同<a data-cke-saved-name=\"978e4b\" name=\"978e4b\"></a>\n\n同性恋已于1997年去罪刑化，并自2001年起不再列入官方认定的精神疾病。不过，迄今尚无法律保护个人免于性倾向或性别认同的歧视，同性伴侣关系也尚未得到法律承认。\n\n2014年由中国女同性恋、男同性恋、双性恋和跨性别（LGBT）组织发布的报告指出，中国教科书很少用客观且不歧视的词汇来描述LGBT人士。\n\n做为社会可能日渐接纳同性伴侣关系的一个象征，今年6月美国最高法院做出支持同性婚姻合法化判决后在中国社交媒体点燃了对此议题的讨论与争辩。7月，一名广州中山大学学生身被彩虹旗出席毕业典礼，获得校长表态支持；此事并获得官方媒体广泛报导。\n\nLGBT团体和个人持续提起反歧视诉讼。4月，深圳一名男性控告雇主看到他的出柜影片在网上疯传后将他解雇。8月，广东省一名大学生举报获该省教育厅认可的大学教材将同性恋描述成一种疾病。\n\n## 西藏<a data-cke-saved-name=\"4fed9f\" name=\"4fed9f\"></a>\n\n第六次西藏工作座谈会于8月下旬召开，会中决定未来数年政府对该地区的大政方针，强调必须维护西藏安全与“稳定”，但当局未能正视族群与宗教遭系统性歧视与限制问题，或藏人被迫参与大规模住房重建与安置计划对当地社会经济造成剧烈变迁问题。\n\n中央政府各有关当局持续在乡村和寺院派驻官员干部，将监控机制向草根阶层延伸，此一发展似乎导致当地社区领袖、环境运动者、参加社会文化活动的村民和发表敏感创作的作家、歌手更常遭到逮捕。\n\n7月，丹增德勒仁波切──西藏最着名政治犯之一──于狱中圆寂。当局违反相关规定，拒绝将其遗体交还亲属或进行死因鉴定。同在7月，2014年5月因涉及反采矿抗争而入狱的村民领袖洛桑益西也在传出受虐后死于狱中。另一着名囚犯，年轻的拉萨NGO工作者丹增曲扎死于去年12月，就在他突然被提前释放后两天。\n\n尽管受到地方政府当局威胁，抗议仍然此起彼落，尤其是针对采矿和土地征收。安全部队殴打逮捕和平示威者的事件，4月发生在昌都，6月发生在甘南。青海一保护区在2014年发生反对采矿的群众抗争后，采矿作业据报已经停止，不过具体原因不明。在高校入学考试弊案引发公众强烈抗议后，西藏自治区和青海当局制定了更严格的规定并查办违法人士。\n\n2015年又有至少七名藏人自焚，使2009年以来自焚总人数增加到143人。\n\n## 新疆<a data-cke-saved-name=\"045243\" name=\"045243\"></a>\n\n近千万维吾尔人居住的新疆地区，仍然普遍存在歧视、压迫和对基本人权的限制。对中央和地方政策的不满，既表现在和平抗议，也透过炸弹攻击等暴力事件，不过无论抗议或暴力活动的细节都不为外界所知，因为当局持续严密控制有关新疆的信息。\n\n中国当局在2015年持续推动自2014年中展开的新疆反恐行动，在当地部署更多安全部队，并实施多项新的法律和条例，加强对异议的刑事惩罚，限制当地维吾尔族穆斯林人口的宗教活动。2014年中迄今，被警方指控涉嫌非法或恐怖主义活动而遭当局拘押、逮捕或杀害的维族人士日益增加，但当局做出的指控均无法独立核实。6月，一群人以土制炸弹和匕首攻击喀什一处警方交通检查站。据报有18到28人死亡，包括15名被警方击毙的嫌疑犯以及数名路人。\n\n新疆自治区自1月起实施全面性但文义含糊的宗教事务新条例。其内容包括禁止穿着“宗教极端服饰”和进行“损害公民身心健康的活动”。近年来，当局利用各种正式和非正式的命令劝阻甚至禁止公务员、教师和学生在穆斯林斋戒月禁食。3月，和田市法院判决25名维族人触犯“危害国家安全罪”，因为他们参加“非法”宗教研习──在该案中实际是指私人开办的宗教课程。\n\n## 香港<a data-cke-saved-name=\"aa8f3f\" name=\"aa8f3f\"></a>\n\n尽管香港对除外交与国防以外的一切事务应享自治权，并拥有独立的司法体系和其他公民自由，但北京似乎正在干预当地的政治参与、表达和集会自由权。\n\n6月，香港立法会否决了北京支持的特区行政长官选举改革方案。该方案虽扩大选举权但允许北京主导的提名委员会筛除其不满意的候选人，因而遭到许多香港居民反对，并在2014年引发长达数月的“雨伞运动”抗争。\n\n约有一千人因涉及“雨伞运动”被捕，尽管大多已无罪释放。当局以“非法集会和煽动他人参与非法集会”等罪名起诉学生领袖黄之锋等人，但相关法律并不符合集会自由的国际标准。独立监察警方处理投诉委员会表示已收到159件该会认为“应予调查”的投诉，指示威者遭到警方攻击和虐待，但截至本文撰稿时，只有被影片拍到围殴民主派示威者曾健超的一名警察已被逮捕。\n\n香港表达自由持续令人忧虑，特别是被认为对北京持批判立场的媒体。1月，亲民主派媒体业主黎智英的住家外面被人扔掷汽油弹。无人受伤，但也无人被捕。8月，攻击前明报总编辑刘进图的两名暴徒被判刑；其中一人承认收钱行刺“教训一下”刘进图。\n\n7月，邬小鹤牧师在深圳被宗教局传唤，警告他不得对来到香港的大陆人士进行传道活动。\n\n## 主要国际行为者<a data-cke-saved-name=\"6b67c4\" name=\"6b67c4\"></a>\n\n各国政府鲜少对中国人权纪录在2015年持续恶化的情况施加任何实质压力，反而在与中国政府的双边人权对话中自我设限，并减少应景式的公开关切。\n\n有些政府，例如英国，甚至进而规劝香港立法会议员接受北京不民主的选制方案，声言“少得总比全无好”。新任欧洲联盟外交与安全政策高级代表费代丽卡・莫盖里尼（Federica Mogherini）未能在5月与中国领导人举行峰会时公开提出人权侵犯问题，美国总统欧巴马9月接待赴美国事访问的习近平时亦复如是。\n\n引人注意的是，在中国的境外非政府组织管理法草案二次审议稿于5月公布后，众多国家政府、商贸协会、高教机构和其他国际组织均以声明和向中国全国人大提交意见的方式表达了高度关切。\n\n8月，国际奥林匹克委员会选择由北京主办2022年冬季奥运会，不顾中国正在打压人权，而且对2008年北京夏季奥运会筹备过程中发生并主要受其助长的人权侵害毫无问责。\n\n## 对外政策<a data-cke-saved-name=\"40c722\" name=\"40c722\"></a>\n\n在习近平领导下，中国持续在亚洲积极推进领土主张，其在南海扩建岛礁可能便于驻军的行动尤其招致警觉。在联合国安理会，中国曾联合俄罗斯于2014年5月否决将叙利亚情势移交国际刑事法院的决议；12月，中国又试图阻挠讨论朝鲜人权情势。\n\n中国持续在允许联合国报告员访问一事上采取高度选择性的做法；宗教自由、和平集会与结社自由、人权捍卫者、健康权、法外处决、法官与律师独立性以及免于酷刑自由等特别报告员都已申请访问但仍持续等候答覆。中国虽未在联合国人权理事会扮演枱面上的积极角色，但持续采取搅局动作，阻挡对白俄罗斯、伊朗、朝鲜、叙利亚和乌克兰等国加强审查其人权情势。\n\n对参与联合国程序的中国公民进行报复的问题，持续引发关切。联合国秘书长注意到中国仍未就维权人士曹顺利被拘押死亡的来文做出回应；曹氏生前积极推动公民社会参与联合国普遍定期审查，而联合国消除对妇女歧视委员会和禁止酷刑委员会都曾关切中国限制公民社会参与条约机构审查的做法。中国官员在11月接受禁止酷刑委员会审查时也鲜少给出有意义的答覆。\n\n中国政府在北京以盛大游行纪念二次大战终结70周年。遭国际刑事法院以种族灭绝罪、战争罪和危害人类罪通缉的苏丹总统奥马尔・巴希尔（Omar al-Bashir）却是北京的座上嘉宾。\n\n北京加强施压他国政府将涉嫌贪污官员遣返中国；至少有十二个司法高度政治化的国家在2015年与中国合作，遣返了数十人。中国并向各邻国施压，将难民强迫遣返中国。7月，泰国政府允许近170名已被拘押年馀的维吾尔妇孺前往土耳其之后，随即强迫近100名维族男性返回中国，使他们面临监禁和酷刑的重大危险。"
		},
		{
			"post_id": 2,
			"title": "HRW 2017年人权报告: 中国",
			"date_published": 1520566845.821,
			"body": "![rtscatk_0.jpg (1200x759)](data/img/post_2_rtscatk_0.jpg)\n\n2016年3月26日，一名男子在上海街头走过挂有中国主席习近平海报的外墙。\n\n© 2016 Aly Song/路透社\n\n* * *\n\n誓言“改革开放”三十多年后，中国共产党仍没有改变其威权统治的迹象。国家主席习近平将掌权到2022年甚至更久，在其领导下，包括言论表达、集会结社和宗教信仰自由等基本人权的前景依然黯淡。\n\n2016年，中国在少数领域略有进步，包括2月制定的审判规则可望降低审前羁押率，最高人民法院持续重审死刑寃案，以及各地法院受理LGBT（女同性恋、男同性恋、双性恋和跨性别）人士的反歧视诉讼。但上述正面发展都不足以掩饰政府系统性打压独立公民社会声音，制定多部侵犯人权的新法，以及高度政治化的反腐败运动对原本脆弱的司法系统造成进一步伤害。\n\n超过16名人权律师和维权人士──在2015年7月针对人权倡导者的全国大逮捕中被拘押至今──成为当局敌视独立公民社会的最知名受害者。他们大多遭到秘密关押，不能与家属或自己选择的律师联系。家属、律师和支持者试图追查下落或营救他们时，往往也成为当局打击的目标。\n\n这些人多以长期投入捍卫人权行动而闻名，当局一方面将他们秘密关押，另一方面却通过官方媒体大篇幅报导加以污蔑。这种公然宣传的手法，迥异于过去政治案件（例如2009年的刘晓波案）的处理方式，目的显然是要惩罚维权人士，同时秉承国家主席习近平的意志，将独立公民社会抹黑成国家安全威胁。\n\n中国当局2016年在香港和其他国家对异见人士实行强迫失踪，引发全球关切。北京11月决定为一起政治案件干涉香港司法审判，使司法独立和一国两制遭受重创。在新疆和西藏等少数民族自治区，北京持续高压统治，不仅禁止政治活动，民族与宗教认同的和平表达也经常受限。\n\n当局也进一步限制言论表达自由。11月，政府通过钳制网络自由与匿名性的《网络安全法》，同时加强整肃报导偏离党路线的媒体单位。多年来，互联网在检查与监控下做为相对自由的公共空间而被寄予厚望，但当局在过去一年颁布多项办法，对网络实施更严密的控制。\n\n中国政府在处决人数方面继续领先全球，现有46种罪名可以判处死刑。中国学者9月表示，处决人数在2005年已“降低六成”到“只有几千人”，但官方统计数据仍为国家秘密。\n\n## 人权护卫者\n\n如前所述，超过16名人权律师与维权人士在2015年7月起对人权倡导者的全国大抓捕中遭到拘押。官方媒体播放其中部分人士被强迫认罪的视频，以报纸头版“揭露”其私生活，并污蔑他们的工作是意图“破坏社会稳定”的“重大犯罪团伙”，而且有“境外势力”撑腰。当局刻意挑选立场亲北京的四家港媒和一家台媒采访庭审过程，不让其他外媒进入法庭。\n\n2016年8月，经过四天闭门审判，天津法院对北京锋锐律师所主任周世锋和资深民运人士胡石根判处重刑，其他两名维权人士则获缓刑。部分在押人士已交保获释，包括律师王宇及其丈夫、公民代理人包龙军在内，但他们的律师和好友至今无法和他们联系。本文撰写时，前述16人大多仍被羁押候审。\n\n当局对人权倡导者的敌意在2016年达到新高。有些维权人士以往可以开展倡导工作，现在却被打入监牢。6月，从2012年起记录中国各地群体事件的卢昱宇和李婷玉被捕，罪名是“寻衅滋事”。劳工维权人士孟晗、曾飞洋被控“聚众扰乱公共秩序”、“聚众扰乱社会秩序”等模糊罪名，没有可靠证据即被定罪。孟晗被判处有期徒刑21个月，曾飞洋则获缓刑四年。据官媒报导，他们都曾“接受境外资助”“煽动工人罢工”。\n\n除了比较严重的“颠覆”等政治罪名外，当局日益常用“寻衅滋事”、“扰乱社会秩序”等模糊的公共秩序罪名对付维权人士。一个令人忧虑的趋势是，过去专门用来起诉公开反对中国共产党的“颠覆”罪名，近来被扩及并未直接挑战共党的律师和维权人士，北京锋锐律所案即为一例。\n\n1月，维权人士张海涛以“煽动颠覆国家政权”和“为境外刺探并非法提供情报”等罪被判有期徒刑19年。6月，民运人士吕耿松、陈树庆也以“颠覆”罪被重判10年。\n\n1月，推动非暴力不合作运动的广州律师唐荆陵被法院判刑五年。9月，北京人权律师夏霖被编造诈骗罪名，判刑12年。官方律师协会1月注销山东律师刘书庆的执业资格，5月又拒绝更新北京律师刘晓原的执业证。这两名律师都曾参与营救2015年7月大抓捕中被捕的同业。\n\n当局持续收紧对独立民间组织的管控。1月，一名为人权律师提供资助的瑞典籍非政府组织（NGO）负责人彼得・达林（Peter Dahlin）被拘留23天，并在被迫上电视认错之后遭驱逐出境。4月，全国人大通过《境外非政府组织境内活动管理法》，授予公安机关前所未有的权力，限制境外组织在中国的工作，也限制国内组织获取国外资助、与外国机构合作的能力。8月，当局发布关于国内公民社会组织管理制度的新文件，要求“加强”党对社会组织的“领导”。9月，新制定的《慈善法》正式实施，可能使公民社会筹募资金的限制更多、受到国家管控更严密。\n\n## 言论自由\n\n言论自由原本已因检查和惩罚而极度受限，2016年又遭遇特别严重的打压。环保人士雷洋5月遭警拘捕死亡后不久，公安部发布新规定要求警员执行某些勤务必须录像。仅有少数媒体突破官方检查，发布引发全国议论或政策改变的报导。\n\n2月，国家主席习近平巡视三大官媒，指示各媒体必须对党绝对効忠。同月，当局关闭拥有三千五百万追随者的网络名人任志强微博账号，因为他批评习近平巡视媒体之举。\n\n3月，一则呼吁习近平辞职下台的匿名信被张贴在无界新闻网，公安部门为此传讯约20人。同在3月，广西公安拘捕以出版政治主题书籍闻名的广西师范大学出版社集团董事长何林夏；他在5月以“受贿”罪名遭批捕。5月，国家新闻出版广电总局（“广电总局”）据报与网络视频公司会谈，要求各公司向政府出售部分股权，以利加强内容管控。\n\n6月，国家互联网信息办公室（“国家网信办”）发布新规定，要求移动互联网应用程序（app）提供者保存用户日志信息60天，以减少“非法信息”传播。国家网信办并下令各新闻网站“清理”跟帖评论，扫除被政府禁止的观点。广电总局也发布新规定，要求移动游戏开发者的作品须经政府审核通过才能上线。\n\n7月，当局将腾讯网两名编辑主管撤职，因为该网一则新闻标题误植，辱及国家主席习近平。同月，北京网信办关闭分属搜狐、新浪、网易和凤凰网的七个网络新闻频道栏目。同样在7月，中共中央统战部成立第八局，负责拉拢在新媒体上具有影响力的人士来支持中共。也在同月，北京当局将《炎黄春秋》杂志社的编辑撤职或降级，导致这份立场温和、深获党内自由派耆老支持的历史评论类杂志走向关门。\n\n8月，国家网信办对全国网站提出多项要求，包括工作人员24小时轮班审查网上内容；广电总局则发布通知，责令所有媒体不得在综艺节目中“追捧西方生活方式”或“恶搞优秀传统”。\n\n10月，当局以“传播错误思想”为由，关闭在知识分子中富有影响力的《共识网》（21ccom.cn）。11月，国家网信办对网络直播平台发出新规定，要求业者审核用户内容是否涉及危害国家安全。\n\n## 香港\n\n根据《基本法》，香港在外交与国防以外的所有事务上均应享有自主权，并可保有独立的司法系统和其他公民自由。实际上，北京却日益干涉特区的政治参与、言论与集会权利。\n\n从2015年10月到12月，香港铜锣湾书店的五名员工陆续失踪。该书店以出版、销售中国政治书籍闻名。其中一人是瑞典公民桂敏海，在泰国失踪。另一人李波是英国公民，在香港失踪但护照还留在家中。3月，五名失踪者中的四人在中国电视频道上承认走私禁书后获释。瑞典公民桂敏海则继续被拘押在不明地点，断绝与外界联络。6月，获释四人之一的林荣基，突破逮捕机关的命令，向媒体揭露他被拘押在中国大陆的情形。中国中央政府至今仍未说明，内地安全单位是否、以及在何种情况下到特区执法，港府也没有积极要求中央作出说明。\n\n7月，王健民和呙中校被深圳法院以“非法经营罪”分别判刑5年和2年。这两人都定居内地，同时在香港出版和销售评论中国政治的杂志。辩护律师表示，既然该杂志是在香港销售，他们的行为并不违反中国法律。\n\n同样在7月，香港法院依据香港《公安条例》判决学生领袖黄之锋、周永康“非法集会”、罗冠聪“煽惑他人参与非法集会”罪名成立。他们因为在2014年发起的一次和平静坐而被检控，其行动引发长达79天争取民主的“雨伞运动”。虽然法院仅对三人判处社区服务等轻微惩罚，但他们遭到检控即足以令人忧虑，因为过去香港和平抗议的领导人很少遭到起诉。\n\n7月，香港选举管理委员会宣布新规定，立法会参选人必须正式声明承认香港是中华人民共和国“不可分离的部分”。此后，有六名参选人因和平倡导香港独立而遭选务官员取消提名资格。8月，教育局发言人警告教师不得在校园鼓吹港独，否则可能失去教师资格。9月，立法会选举投票率创新高，六名支持香港自决人士当选议员。\n\n11月，中国全国人大对《基本法》（香港实质宪法）有关议员宣誓的条文做出解释，似有意迫使香港高等法院阻止两名主张港独的议员当选人就职。这是中国当局首度针对进行中的香港司法案件做出《基本法》释法。\n\n## 新疆\n\n当局在2016年没有采取任何措施，放松对新疆基本人权的限制，以及遏止当地普遍的民族与宗教歧视。新疆自治区是一千万维吾尔族人的故乡，他们大多是穆斯林；同时汉族移民的人数则在不断增加。对中央和地方政府政策的不满，既表现在和平抗议活动，也导致炸弹攻击和其他暴力事件。中国政府宣称该地区存在恐怖主义威胁，因此在当地大力反恐。然而，由于当地鲜有独立信息来源，外界难以得知有关抗议、暴力、恐怖主义与反恐行动的详情。\n\n6月，据媒体报导，伊犁公安局宣布护照申请人必须交验基因血样、指纹、声纹和“三维成像”等信息。新疆居民出境旅行原本就受严格限制，新规定更加高门槛。在穆斯林斋月期间，地方政府当局再度禁止公务员和学校师生封斋，并下令餐厅照常营业。\n\n8月，新疆当局发布《反恐法》实施办法；该法于2016年1月生效实施，内容侵犯人权。6月，就读广州市七十五中学的十名维族学生据报涉嫌恐怖活动被捕，截至本文撰写时未有进一步消息。\n\n维族经济学者伊力哈木・土赫提因和平批评政府新疆政策，被安上毫无根据的分裂罪名判处终身监禁。10月，他获颁年度马丁・恩纳尔斯人权奖。\n\n## 西藏\n\n藏人的言论、集会与迁徙等基本自由持续面临常规性剥夺。2016年，当局在没有明确威胁下重点推动侵犯人权的“反分裂”与“维稳”斗争，并且禁止几乎所有西藏自治区居民到境外旅游。\n\n8月，中共汉族干部吴英杰被任命为西藏自治区新任党委书记，预料将延续前任陈全国的铁腕统治和社会控制政策。依据2016年展开的十三五规划，西藏自治区设定了宏大目标，包括大量基础建设工程和城市开发；青海和四川藏区也计划大规模开采矿产。许多外界报导的公众抗议都以农村圈地为起因，包括5月在甘肃发生的一场抗议曾遭安全部队镇压。\n\n宗教自由持续受限，包括针对四川色达喇荣五明佛学院的强拆和逼迁计划，将使这个世界最大藏传佛教社群由2016年的一万人以上，在2017年9月前减少到五千人以内。笔名雪江（Shokjang）和鲁米（Lomik）的藏族作家分别被判刑三年和七年半；因计划出书被捕的鲁贡确嘉措（Lu Konchok Gyatso）和接受《纽约时报》采访藏语教学式微而被捕的札西文色（Tashi Wangchuk）于本文撰写时均仍在押。\n\n截至本文撰写时，2016年又有两名藏人自焚，地点都在四川。至少四名藏人据信在狱中死亡，包括2008年被捕失踪至今的甘孜寺比丘尼益西拉东（Yeshe Lhakdron）。\n\n## 宗教自由\n\n政府限制人民只能信仰五种官方认可的宗教，且一切宗教活动必须在政府许可的场所进行。各宗教的教职人员任命、出版、财产和设立宗教院校均受到政府管控。不受政府管控的宗教团体则被归类为“邪教”。以气功修炼为主的法轮功信仰团体于1999年7月被查禁，遭受国家迫害至今。\n\n浙江省被称为中国“基督教中心地带”，2015年为抵抗省府拆除教堂十字架而被捕的人士部分已经获释。2月，浙江官媒播出人权律师张凯被强迫认罪的视频，他因向抗拆十字架基督徒提供法律意见而被秘密拘押禁与外界联系，直到3月获释。但金华市牧师包国华、邢文香夫妇则被分别判处14年和12年有期徒刑，该案普遍被视为对他们反对拆十的报复。\n\n4月，国家主席习近平对宗教问题发表重要讲话，要求抵御“境外利用宗教进行渗透”，呼吁各宗教坚持“中国化”方向、适应“中国特色”。\n\n8月，天津法院将资深民运人士及基督徒胡石根判处七年半有期徒刑。根据起诉书描述，胡石根的罪状包括“以非法宗教活动作为平台...散布颠覆国家政权思想”。\n\n9月，中国政府发布《宗教事务条例》的修订草案，该条例制定于2005年，包含侵犯人权的规定。修订草案规定，各宗教应“维护国家安全”，禁止未经登记为宗教团体的个人和组织到境外出席宗教会议。\n\n贵州当局自2015年12月起拘押活石教会牧师仰华（原名李国志），同时将拥有500名成员的活石教会宣布为非法，令其关闭。\n\n## 性取向与性别认同\n\n中国没有保障人们免于性取向或性别认同歧视的法律，同性伴侣关系也不被法律承认。或许因其抗争行动不被国家视为威胁，LGBT人士在2016年成功推动了一些维权诉讼。\n\n1月，河南法院开庭审理孙文林（化名）诉当地民政局不受理其与同性伴侣婚姻登记案，虽然法院4月判决孙文林败诉，但他的案件──中国法院首次立案的同性婚姻诉讼案──吸引到媒体广泛关注。6月，河南法院立案审理余虎（化名）诉精神病院强制其接受19天同性恋“扭转治疗”案。同样在6月，广东大学生秋白（化名）因教科书将同性恋称为疾病而起诉教育部。秋白曾在2015年为同一议题控告教育部，因教育部表示将予回应而撤诉。后因当局迟不回复，她决定再次提告。\n\n6月，针对联合国设立独立专家，致力防范基于性取向和性别认同的暴力与歧视问题的决议，中国投下反对票。\n\n## 妇女权利\n\n中国妇女在高等教育和就业方面遭受系统性歧视，并且面临家庭暴力和性骚扰。政府表面提倡性别平等，却未尽力解决上述侵权问题。\n\n当局日益敌视公民社会，并在2016年扩及女权人士。1月，北京众泽妇女法律谘询服务中心因创办人郭建梅受到官方压力而关闭。\n\n4月，广州法院做出指标性判决，一名妇女控告两家公司召聘歧视获判胜诉。但法院仅判赔人民币两千元（约合300美元），遭女权人士批评处罚过轻。\n\n## 障碍者权利\n\n虽然中国已于2008年批准《残疾人权利公约》，身心障碍者仍在求学、求职等各方面遭遇阻碍与歧视。政府仍然会将维权人士关进精神病院。\n\n2013年草拟的残疾人教育法迄未通过。官方指导原则依然允许高校拒绝某些障碍考生录取特定专业。7月，河南考生宋奕辰因视障遭天津中医药大学退档事件，引发媒体高度关注。\n\n有关召聘公务员的官方指导原则，仍然歧视特定障碍人士。8月，河南视障人士谭劲松应征当地法制办，却以笔试第一名成绩被淘汰。\n\n## 关键国际行为者\n\n2月，联合国人权事务高级专员对中国持续任意拘押和侦讯律师，骚扰及恐吓批评政府人士与NGO工作者，以及新定境外NGO管理法对基本人权的负面效应表示关切。\n\n2016年2月，欧洲联盟通过强烈谴责中国侵犯人权的决议；3月，由美国领衔的十二国政府史无前例地在联合国人权理事会上联名谴责中国“人权纪录不断恶化”。加拿大、欧盟、德国和美国等多国政府都曾在2016年发布声明，就公民社会遭打压、香港书商被强迫失踪、以及境外NGO管理法等议题向中国表达关切。然而，没有任何国家因为北京人权纪录持续恶化而对其实施更具体的制裁。\n\n联合国秘书长潘基文7月进行任内倒数第二次访华时，终于对公民社会遭打压表示关切，并敦促中国当局“让公民在自己国家的政治生活中享有充分表意及参与角色”。美国总统欧巴马9月进行任内最后一次访华时，没有公开发表任何有关人权的谈话。G20成员国9月在杭州开会时，不仅没有谴责中国的人权纪录，连杭州当地因此次会议而产生的侵权情况，例如当地维权人士被拘留，或中国对独立公民社会组织参与G20会议所加诸的各种限制，也没有加以谴责。\n\n## 外交政策\n\n7月，国际常设仲裁法院驳斥中国对南海大部分区域的主权声索，认定北京的主张缺乏法律效力。中国则否定该法庭的合法性，并表示不会执行仲裁结果。\n\n2016年，中国没有动用其在联合国安理会享有的否决权。然而，中国曾在2015年12月动用程序否决权，试图阻止有关朝鲜人权情势的讨论。中国也对增派维和部队前往南苏丹和增派联合国警察前往布隆迪等决议案投下弃权票。在联合国非政府组织委员会和联合国经社理事会，中国代表团均拒绝对普受国际肯定的保护记者委员会（Committee to Protect Journalists）授予联合国认证。\n\n8月，中国同意联合国赤贫问题特别报告员奥斯顿（Philip Alston）访问。但就像过去做法一样，当局限制奥斯顿的行动与会见，这名特别报告员在离华记者会上肯定中国在经济方面有所进展，但对“公民社会空间日益紧缩”提出抨击。\n\n中国2015年成立的亚洲基础设施投资银行（“亚投行”）于6月在北京召开首届理事会。与会各国政府均未推动亚投行制定人权保障政策，以要求该行查明并解决融资项目中的人权风险。亚投行并未公开说明该行是否将谘询非政府组织意见，特别是在不欢迎独立监察者的国家。\n\n在一个令人不安的趋势中，北京施压亚美尼亚、柬埔寨和肯尼亚等国政府，将台湾公民遣送中国大陆。这些人涉嫌诈骗大陆民众，但显然没有机会就遣送决定向各国合格法院提出申诉。\n\n中国当局声称，截至9月追回500名“外逃经济罪犯”，使“天网行动”执行两年来总共追回人数接近2,000人。截至本文撰写时，还不清楚这些人回国候审时能否会见家属或自己选择的律师，也不清楚各国在将他们遣返前是否要求中国做出任何保证。"
		},
		{
			"post_id": 1,
			"title": "联合国《世界人权宣言》",
			"date_published": 1433033779.604,
			"body": "《世界人权宣言》是人权史上具有里程碑意义的文件。它由来自世界各个地区不同法律和文化背景的代表起草，于1948年12月10日在巴黎召开的大会会议上以第217A(III)号决议通过。《世界人权宣言》作为所有国家和所有人民的共同成就，第一次规定了基本人权应得到普遍保护。《世界人权宣言》已被翻译成近500种语言。\n\n* * *\n\n#### 序言\n\n**鉴于**对人类家庭所有成员的固有尊严及其平等的和不移的权利的承认，乃是世界自由、正义与和平的基础，\n\n**鉴于**对人权的无视和侮蔑已发展为野蛮暴行，这些暴行玷污了人类的良心，而一个人人享有言论和信仰自由并免予恐惧和匮乏的世界的来临，已被宣布为普通人民的最高愿望，\n\n**鉴于**为使人类不致迫不得已铤而走险对暴政和压迫进行反叛，有必要使人权受法治的保护，\n\n**鉴于**有必要促进各国间友好关系的发展，\n\n**鉴于**各联合国国家的人民已在联合国宪章中重申他们对基本人权、人格尊严和价值以及男女平等权利的信念，并决心促成较大自由中的社会进步和生活水平的改善，\n\n**鉴于**各会员国业已誓愿同联合国合作以促进对人权和基本自由的普遍尊重和遵行，\n\n**鉴于**对这些权利和自由的普遍了解对于这个誓愿的充分实现具有很大的重要性，\n\n**因此现在，**\n\n**大会，**\n\n**发布这一世界人权宣言**，作为所有人民和所有国家努力实现的共同标准，以期每一个人和社会机构经常铭念本宣言，努力通过教诲和教育促进对权利和自由的尊重，并通过国家的和国际的渐进措施，使这些权利和自由在各会员国本身人民及在其管辖下领土的人民中得到普遍和有效的承认和遵行；\n\n#### 第一条\n\n人人生而自由，在尊严和权利上一律平等。他们赋有理性和良心，并应以兄弟关系的精神相对待。\n\n#### 第二条\n\n人人有资格享有本宣言所载的一切权利和自由，不分种族、肤色、性别、语言、宗教、政治或其他见解、国籍或社会出身、财产、出生或其他身分等任何区别。 并且不得因一人所属的国家或领土的政治的、行政的或者国际的地位之不同而有所区别，无论该领土是独立领土、托管领土、非自治领土或者处于其他任何主权受限制的情况之下。\n\n#### 第三条\n\n人人有权享有生命、自由和人身安全。\n\n#### 第四条\n\n任何人不得使为奴隶或奴役；一切形式的奴隶制度和奴隶买卖，均应予以禁止。\n\n#### 第五条\n\n任何人不得加以酷刑，或施以残忍的、不人道的或侮辱性的待遇或刑罚。\n\n#### 第六条\n\n人人在任何地方有权被承认在法律前的人格。\n\n#### 第七条\n\n法律之前人人平等，并有权享受法律的平等保护，不受任何歧视。人人有权享受平等保护，以免受违反本宣言的任何歧视行为以及煽动这种歧视的任何行为之害。\n\n#### 第八条\n\n任何人当宪法或法律所赋予他的基本权利遭受侵害时，有权由合格的国家法庭对这种侵害行为作有效的补救。\n\n#### 第九条\n\n任何人不得加以任意逮捕、拘禁或放逐。\n\n#### 第十条\n\n人人完全平等地有权由一个独立而无偏倚的法庭进行公正的和公开的审讯，以确定他的权利和义务并判定对他提出的任何刑事指控。\n\n#### 第十一条\n\n㈠ 凡受刑事控告者，在未经获得辩护上所需的一切保证的公开审判而依法证实有罪以前，有权被视为无罪。\n　　㈡ 任何人的任何行为或不行为，在其发生时依国家法或国际法均不构成刑事罪者，不得被判为犯有刑事罪。刑罚不得重于犯罪时适用的法律规定。\n\n#### 第十二条\n\n任何人的私生活、家庭、住宅和通信不得任意干涉，他的荣誉和名誉不得加以攻击。人人有权享受法律保护，以免受这种干涉或攻击。\n\n#### 第十三条\n\n㈠ 人人在各国境内有权自由迁徙和居住。\n　　㈡ 人人有权离开任何国家，包括其本国在内，并有权返回他的国家。\n\n#### 第十四条\n\n㈠ 人人有权在其他国家寻求和享受庇护以避免迫害。\n　　㈡ 在真正由于非政治性的罪行或违背联合国的宗旨和原则的行为而被起诉的情况下，不得援用此种权利。\n\n#### 第十五条\n\n㈠ 人人有权享有国籍。\n　　㈡ 任何人的国籍不得任意剥夺，亦不得否认其改变国籍的权利。\n\n#### 第十六条\n\n㈠ 成年男女，不受种族、国籍或宗教的任何限制有权婚嫁和成立家庭。他们在婚姻方面，在结婚期间和在解除婚约时，应有平等的权利。\n　　㈡ 只有经男女双方的自由和完全的同意，才能缔婚。\n　　㈢ 家庭是天然的和基本的社会单元，并应受社会和国家的保护。\n\n#### 第十七条\n\n㈠ 人人得有单独的财产所有权以及同他人合有的所有权。\n　　㈡ 任何人的财产不得任意剥夺。\n\n#### 第十八条\n\n人人有思想、良心和宗教自由的权利；此项权利包括改变他的宗教或信仰的自由，以及单独或集体、公开或秘密地以教义、实践、礼拜和戒律表示他的宗教或信仰的自由。\n\n#### 第十九条\n\n人人有权享有主张和发表意见的自由；此项权利包括持有主张而不受干涉的自由，和通过任何媒介和不论国界寻求、接受和传递消息和思想的自由。\n\n#### 第二十条\n\n㈠ 人人有权享有和平集会和结社的自由。\n　　㈡ 任何人不得迫使隶属于某一团体。\n\n#### 第二十一条\n\n㈠ 人人有直接或通过自由选择的代表参与治理本国的权利。\n　　㈡ 人人有平等机会参加本国公务的权利。\n　　㈢ 人民的意志是政府权力的基础；这一意志应以定期的和真正的选举予以表现，而选举应依据普遍和平等的投票权，并以不记名投票或相当的自由投票程序进行。\n\n#### 第二十二条\n\n每个人，作为社会的一员，有权享受社会保障，并有权享受他的个人尊严和人格的自由发展所必需的经济、社会和文化方面各种权利的实现，这种实现是通过国家努力和国际合作并依照各国的组织和资源情况。\n\n#### 第二十三条\n\n㈠ 人人有权工作、自由选择职业、享受公正和合适的工作条件并享受免于失业的保障。\n　　㈡ 人人有同工同酬的权利，不受任何歧视。\n　　㈢ 每一个工作的人，有权享受公正和合适的报酬，保证使他本人和家属有一个符合人的尊严的生活条件，必要时并辅以其他方式的社会保障。\n　　㈣ 人人有为维护其利益而组织和参加工会的权利。\n\n#### 第二十四条\n\n人人有享有休息和闲暇的权利，包括工作时间有合理限制和定期给薪休假的权利。\n\n#### 第二十五条\n\n㈠ 人人有权享受为维持他本人和家属的健康和福利所需的生活水准，包括食物、衣着、住房、医疗和必要的社会服务；在遭到失业、疾病、残废、守寡、衰老或在其他不能控制的情况下丧失谋生能力时，有权享受保障。\n　　㈡ 母亲和儿童有权享受特别照顾和协助。一切儿童，无论婚生或非婚生，都应享受同样的社会保护。\n\n#### 第二十六条\n\n㈠ 人人都有受教育的权利，教育应当免费，至少在初级和基本阶段应如此。初级教育应属义务性质。技术和职业教育应普遍设立。高等教育应根据成绩而对一切人平等开放。\n　　㈡ 教育的目的在于充分发展人的个性并加强对人权和基本自由的尊重。教育应促进各国、各种族或各宗教集团间的了解、容忍和友谊，并应促进联合国维护和平的各项活动。\n　　㈢ 父母对其子女所应受的教育的种类，有优先选择的权利。\n\n#### 第二十七条\n\n㈠ 人人有权自由参加社会的文化生活，享受艺术，并分享科学进步及其产生的福利。\n　　㈡ 人人对由于他所创作的任何科学、文学或美术作品而产生的精神的和物质的利益，有享受保护的权利。\n\n#### 第二十八条\n\n人人有权要求一种社会的和国际的秩序，在这种秩序中，本宣言所载的权利和自由能获得充分实现。\n\n#### 第二十九条\n\n㈠ 人人对社会负有义务，因为只有在社会中他的个性才可能得到自由和充分的发展。\n　　㈡ 人人在行使他的权利和自由时，只受法律所确定的限制，确定此种限制的唯一目的在于保证对旁人的权利和自由给予应有的承认和尊重，并在一个民主的社会中适应道德、公共秩序和普遍福利的正当需要。\n　　㈢ 这些权利和自由的行使，无论在任何情形下均不得违背联合国的宗旨和原则。\n\n#### 第三十条\n\n本宣言的任何条文，不得解释为默许任何国家、集团或个人有权进行任何旨在破坏本宣言所载的任何权利和自由的活动或行为。"
		}
	]
}