{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Что на самом деле представляет собой биткоин",
			"body": "Уверен, что вы слышали о криптовалюти или о биткоине.\nЗдесь я буду искать закономерности, и вдаваться в подробности для чего на самом деле его создали.\n\nЧто бы узнать о биткоин я его просто скачал со всеми блоками и начал изучать возможности программы.\nСамое интересное, что я там нашёл эта функция шифрования сообщений, вначале я не уделил этому особого внимания.\nПодумал очередное шифрования ничего особенного, но на деле это не просто шифрования.\nКак оказалось это почти военная технология, похожая на шифровальную машинку энигма.\nЕсли в крации фашисты использовали ее для передачи информации, что бы взломать переписку, нужно было получить бумагу с кодом дешифровки.\nИ то эта бумага работала не больше месяца, после чего нужно было заново находить источник для дешифровки.\n\n\nТак вот в основном большинство методов шифрования рассчитаны, что злоумышленник не сможет производить подмену сообщения, а только наблюдать.\n\n\nПример:\nАлиса отправляет ключ Бобу, Боб отправляет ключ Алисе, Ева может видеть только закрытые ключи.\nСтандартный механизм шифрования Ева никогда не получит ключ для дешифровки.\n\n\nТеперь что если Eва может не только наблюдать но и изменять и подменять информацию.\n\n\nПример и как это выглядит:\nАлиса отправляет ключ Еве а Ева отправляет свой ключ Бобу и Алисе, Боб отправляет ключ Еве а Ева отправляет ключ Алисе и Бобу.\nНа выходе Ева полностью контролирует все и может читать и изменять переписку.\n\n\nТак вот вернемся к биткоину, весь механизм биткоина реализован так что транзакцию почти невозможно подменить или копировать.\nЕдинственный способ перехватить данные это использовать атаку 51% что почти не возможно и не выгодно.\nВ итоге мы получаем интересный механизм отправки сообщений без страха что его могут, прочитать, подменить или перехватить.\n\n\nВопрос для чего нужна такая защита, ведь сообщения идет очень долго и кому это нужно.\nНачнем с прошлого, биткоин стал популярным благодаря наркобаронам и тем кто продавал оружие, вероятней всего это и есть их детище.\nВ нем изначально был заложен механизм обмена информации с функцией шифрования и оплаты.\n\n\nЧто касается сказок про создателя сатоши накамото это все брехня для верующих майнеров, которые хотели легких денег и при этом ничего не давать в замен.\n\n\nВ таком бизнесе где за информацию могут убить или зарезать всю семью очень важно не наложать.\nБиткоин как раз и был создан для этого.\n\n\nИменно поэтому они не могут отключить поддержку асиков им нельзя что бы биткоин даже на 1 день оказался под атакой 51%.\n\n\nПодводя итоги, я считаю что биткоин это не совсем криптовалюта а целая шифровальная система которая скорее всего оптимизирована под закрытым репозиторием у наркодилеров или банкиров.\n\n\nОни даже сейчас отправляют сообщения друг другу каждую секунду.",
			"added": 1561127218
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}