{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1525303454,
			"title": "Being Jesus is the Shittiest Job on Earth",
			"body": "If anybody else wants the job, be my guest. The Agent Smiths are everywhere.. and it's a never ending battle. \n&nbsp;\nAnd you absolutely can't do it for personal gain. You can have fun here and then, so long as you get back to the mission. But right now .. it's like .. there's too much bullshit, too many opinions, too much fakeness .. you don't know what's real and what isn't anymore.\n&nbsp;\nJesus is the Singularity. The point where Earth divides by zero .. and says: Enough is enough. We need to get back to priorities, back to what matters in life. Or else, we will go extinct.\n&nbsp;\nQuantum Immortality is real. You never die. You just get told to pick an alternate ending to your life... over and over and over. If you can prove that you're absolutely ready to go back to Earth and that you can get your shit together.",
			"added": 1525303453
		},
		{
			"topic_id": 1525313920,
			"title": "Jordan Peterson talks about Break Downs and Suicide",
			"body": "https://www.youtube.com/watch?v=EI92IqbvEV8\n&nbsp;\nDamn. I really did wake up in the weirdest possible branch of the multiverse. I feel really bad for you Jordan peterson, man. But you should have talked about this earlier.",
			"added": 1525313918
		},
		{
			"topic_id": 1525902420,
			"title": "Programming with severe ADHD symptoms.. :p",
			"body": "It's called Multitasking, I guess. With music in the background.",
			"added": 1525902415
		},
		{
			"topic_id": 1525932500,
			"title": "How to kick Ass",
			"body": "https://www.youtube.com/watch?v=boNIL1owRAI\n&nbsp;\nAnd then get your ass kicked ... in the end. :(",
			"added": 1525932494
		},
		{
			"topic_id": 1525987671,
			"title": "Private Keys are too Easy to Steal",
			"body": "Don't worry though. It's the source code that matters. :)",
			"added": 1525987664
		},
		{
			"topic_id": 1526002928,
			"title": "Serpent AI playing Space Shooter's - Ultimate Convergence",
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1526002572_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG\n&nbsp;\nThis is now the end of the first stage of my research. The reason Artificial intelligence struggled with this space shooter game is because of the random nature of it; enemies spawn at random locations.\n&nbsp;\n..then again, the AI still learned how to destroy enemies before they even spawned. I've also calculated the rewards and laid them out in a spreadsheet. Average reward did in fact increase over time..\n&nbsp;\nMission accomplished. Now lets move on to another game. :)",
			"added": 1526002920
		},
		{
			"topic_id": 1526004453,
			"title": "My Github Profile",
			"body": "https://github.com/misses-robot/\n&nbsp;\nI'm too stupid to program.",
			"added": 1526004444
		},
		{
			"topic_id": 1526063815,
			"title": "Make your own kind of Music",
			"body": "Sing your own special song <3\nhttps://www.youtube.com/watch?v=SbSM02_1k34\n&nbsp;\nGood morning. I'm alive!",
			"added": 1526063805
		},
		{
			"topic_id": 1526105378,
			"title": "I rescued my Private Key...",
			"body": "WOHOOOOOO!\nhttps://www.youtube.com/watch?v=p47fEXGabaY",
			"added": 1526105367
		}
	],
	"topic_vote": {
		"1525258130_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": 1,
		"1525112946_1MTNhSVgCJpW8uBjFhnyA5NsgyKbKnvrLG": 1,
		"1525597646_1CT7RxDQNPEE8X78bDkUPhuaaUUixTmDhC": 1,
		"1525110299_1LAitKPQa2dNhNPTt2NKT2F4DuHWVqAexc": 1,
		"1526062041_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"1522279439_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1
	},
	"next_comment_id": 35,
	"comment": {
		"1525303454_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a": [
			{
				"comment_id": 1,
				"body": "Of course, Jesus can't look like Jesus. That's not the point. Nobody will listen to some hippie with a beard. It could be a man, woman.. anybody.",
				"added": 1525303968
			}
		],
		"1525258130_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": [
			{
				"comment_id": 2,
				"body": "No more debates .. we'll have to find one good system if we want this species to survive. The incessant arguing will result in the death of mankind. Stephen Hawking is dead.. all our heroes are dead. It's time for a second coming.",
				"added": 1525310624
			},
			{
				"comment_id": 3,
				"body": "> [blip](#comment_4_1CXjx6VwJrifbou46CFAGEpic4v7oaqPm9): I used to think it was good too, then I realized that it's just a man complaining while offering almost nothing in terms of solutions. If he did have REAL solutions, he would have presented them clearly in every single video. What did he actually create? Pretty architecture? [...]\n\nThen offer a better solution.",
				"added": 1525310828
			},
			{
				"comment_id": 4,
				"body": "> [theanswerer0](#comment_12_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR): Stephan Hawking was your hero...? You'd better hope black holes are real and not just a giant question mark imposed on us by the math due to us having an incomplete understanding of physics. Otherwise I'm not sure exactly what his life's work will have amounted to in the grand scheme of things. [...]\n\nAll life.",
				"added": 1525311028
			},
			{
				"comment_id": 9,
				"body": "bump! :)",
				"added": 1525725819
			}
		],
		"1525313920_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a": [
			{
				"comment_id": 5,
				"body": "Jordan peterson. Jump on noahs ark. We'll save life on Earth. Enough with the horeshit",
				"added": 1525314471
			},
			{
				"comment_id": 6,
				"body": "Seems like the world had a break down. Big Bang. Exponentially accelerating complexity and bullshit",
				"added": 1525315134
			}
		],
		"1525488037_1EHjrNgbVBWHQ7BiKwqKD6pSbowepFP8sf": [
			{
				"comment_id": 7,
				"body": "> [kaffie](#comment_608_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): This is not at all what quantum immortality is. Nor is this likely the answer to death. [...]\n\nThat I know, of course. Then again - there's different kinds of Singularities. Humans are just as capable of achieving singularity as robots are .. by being the sculptors of their own statues.",
				"added": 1525678779
			},
			{
				"comment_id": 8,
				"body": "When talking about quantum immortality in terms of *subjective* experience, I'll let this video do the explaining. This is what I personally witessed in the psych ward. Not saying that I'm a know-it-all or that I know what happens after you die.. but .. yeah, it's some food for thought:\nhttps://youtu.be/cDatTy9BU2A",
				"added": 1525678963
			}
		],
		"1525725635_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a": [
			{
				"comment_id": 10,
				"body": "Actually, maybe it didn't happen. Maybe it's still Judgement Day. :)\n&nbsp;\nThe wrath of god is here.",
				"added": 1525733076
			}
		],
		"1522279439_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 11,
				"body": "Preach.",
				"added": 1525736291
			},
			{
				"comment_id": 31,
				"body": "bump",
				"added": 1526100810
			}
		],
		"1525902420_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a": [
			{
				"comment_id": 12,
				"body": "I guess they can't give me sleeping pills forever. I'm gonna need a Mana booster.",
				"added": 1525902884
			},
			{
				"comment_id": 13,
				"body": "Wait. What was I doing again?",
				"added": 1525903306
			},
			{
				"comment_id": 14,
				"body": "I'm gonna have to train an AI agent that boosts my motivation. Text-to-speech. Reward the agent based on how motivated it keeps you.",
				"added": 1525903501
			},
			{
				"comment_id": 15,
				"body": "> [pq9p](#comment_5_141t775YRGcErzqqn4dwUyUQqZrjhdnN3n): No, multitasking is not ok for humans...Advice: Try to read some time each day. I usually try to read 2 or 3h a day. This helps me to gain focus on whatever I want. Read in the morning and work in the afternoon for example.Hope I helped you  :)\n\nAny help is ok. Preach :)",
				"added": 1525905061
			},
			{
				"comment_id": 16,
				"body": "Now I know why they gave me Valium once, and then took it away from me. They know that Valium is used recreationally. It was also the only tranquilizer that made me feel okay, without drowsiness.\n&nbsp;\nTherefore, there's no way in hell I'll ever get meds for my ADHD symptoms. lol\n&nbsp;\nI have no choice but to use my disease to my advantage.",
				"added": 1525906416
			}
		],
		"1525110299_1LAitKPQa2dNhNPTt2NKT2F4DuHWVqAexc": [
			{
				"comment_id": 17,
				"body": "I'll see you on the 5th of November. :)",
				"added": 1525907254
			}
		],
		"1525987671_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a": [
			{
				"comment_id": 18,
				"body": "If you hurt my cat, you will be Damned.",
				"added": 1525987729
			}
		],
		"1526002928_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a": [
			{
				"comment_id": 19,
				"body": "https://github.com/misses-robot/SerpentAI-ChromiumBSU-GameAgent",
				"added": 1526004478
			}
		],
		"1526062041_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": [
			{
				"comment_id": 20,
				"body": "thanks for the news.",
				"added": 1526063458
			},
			{
				"comment_id": 30,
				"body": "bump",
				"added": 1526100768
			}
		],
		"1526051818_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 21,
				"body": "> [chikan](#comment_17_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB): Why there is so much hostility towards pedophiles? We aren't necessarily rapist (yes, a lot of us are, but isn't a rule), often we just like a specific genre of porn.\n\nAs long as you stick to the anime type ...",
				"added": 1526063534
			},
			{
				"comment_id": 22,
				"body": "This could be a bait, by the way. If i were a pedophile, I'd run from that site ... and just take castration pills. Luckily, I'm not. I like women.. slightly older than me.",
				"added": 1526064401
			},
			{
				"comment_id": 32,
				"body": "The act of pedophilia is morally wrong. But, if you choose not to act on it, you can still live a normal life. The answer lies in Anime.",
				"added": 1526104701
			},
			{
				"comment_id": 33,
				"body": "> [shitchell](#comment_62_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Pedophilia isn't an act. It's not a verb. It's a noun. An orientation. How is a sexual orientation morally wrong?\n\nThe sexual orientation of pedophilia is not morally wrong. It's the act that is morally wrong",
				"added": 1526104857
			}
		],
		"1525185835_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 29,
				"body": "bump",
				"added": 1526100658
			}
		],
		"1526116721_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 34,
				"body": "Privacy is an illusion. We don't live in the age of privacy anymore - we live in a new age of Honour",
				"added": 1526120363
			}
		]
	},
	"comment_vote": {
		"5_141t775YRGcErzqqn4dwUyUQqZrjhdnN3n": 1,
		"10_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": 1
	}
}