{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1553642587_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"1553596906_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": 1,
		"1553360735_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": 1,
		"1552823531_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1542488436_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 1,
				"body": "> [styromaniac](#comment_316_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Files aren't re-signed if they're unchanged. I notice only new large files slowing down the next signing, proportional to a new file's size, so adding a new file later isn't last stretch of time + signing new file(s) stretch of time. It's only going to sign large static files once each. [...]\n\nI believe time to sign is not related to total size, but is related to number of files. Would have to test this though. Files are signed independently and shouldn't be signed again unless changed, but the sha's have to be aggregated afterwards somehow to show these are the valid files according to the zite owner. If I'm not mistaken this would mean a lot of small files will be slower to sign than a couple of big files, if only one of them is changed. Would like some input from someone more experienced though.",
				"added": 1542531880
			}
		],
		"1553642587_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 2,
				"body": "Anyone know this song?\n[Planned obsolescence \"Limited Lives\" - Official Music Video - Jayme Gutierrez](https://www.youtube.com/watch?v=hoI1Y4MlRew)",
				"added": 1553674853
			}
		],
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": [
			{
				"comment_id": 3,
				"body": "> [krystof](#comment_9_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX): I feel ZeroNet is about to get a whole lotta more popular with no extra marketing.\n\nYou guys need marketing. Yes, there will be a natural influx, but if you do some marketing on top of that you could make the influx even bigger.\n\nI learned about ZeroNet from a friend who's really engaged with the whole Article 13 thing, and he tells me most activists engaged with that fight didn't even know about any of these technologies until he mentioned it. I don't really know where you should be marketing, but I hear there's some reddit communities concerned with the law change. If anyone has an account there maybe they could mention it?",
				"added": 1553698137
			}
		],
		"1554465360_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 4,
				"body": "Solid could solve this i.e. have a single standard to store comments, likes, etc. Then let people use their preferred frontend to make sense of this data.",
				"added": 1554550000
			}
		],
		"1554688664_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 5,
				"body": "didn't ivanq also create the ZeroMail to POP3/SMTP script? also worth mentioning",
				"added": 1554801847
			}
		]
	},
	"comment_vote": {}
}