{
	"title": "TugaTechZN",
	"description": "Tecnologia em Português",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1514633473,
	"post": [
		{
			"post_id": 3,
			"title": "Amazon e Apple negoceiam entrada na Arábia Saudita",
			"date_published": 1514633271.099,
			"body": "Depois de dar a cidadania a Sophia, o robot humanoide, e do príncipe herdeiro, Mohammed bin Salman, anunciar os planos para construir, a partir do zero, uma nova cidade, na costa Norte do país, próxima do Mar Vermelho, um projeto denominado “Vision 2030”, a Arábia Saudita pode estar a preparar-se para abrir “as portas” às duas tecnológicas.\n\nA notícia, adiantada pela Reuters, refere que que a Apple estaria em negociações com a SAGIA, autoridade de investimento estrangeiro da Arábia Saudita, estando prevista para 2019 a instalação da primeira loja da marca da maçã naquele país.\n\nDo lado da Amazon, as conversações estão a ser levadas a cabo pela  plataforma de serviços de computação em nuvem, Amazon Web Services (AWS), não havendo ainda uma data específica para os investimentos.\n\nApesar de ambas as empresas venderem os seus produtos na Arábia Saudita através de terceiros, nem elas ou outros gigantes tecnológicos estabeleceram ainda uma presença direta no país."
		},
		{
			"post_id": 2,
			"title": "Facebook e Universal Music Group selam acordo global",
			"date_published": 1514235851.163,
			"body": "O Facebook e a Universal Music Group anunciaram esta quinta-feira, dia 21 de dezembro, a celebração de um acordo global que vai permitir a todos os utilizadores daquela rede social que carreguem vídeos com música lançada pela discográfica sem se sujeitaram a restrições de direitos de autor.\n\nO anúncio surge numa altura em que a empresa de Mark Zuckerberg está a estimular a criação e o upload de vídeos para o Facebook, como forma de manter os utilizadores no site e de atrair novos anunciantes.\n\nRecentemente o YouTube celebrou um acordo semelhante com a Universal e a Sony Music Entertainment, pelo que este negócio pode estar intimamente relacionado com a necessidade de manter o Facebook competitivo no segmento dos vídeos.\n\nNa prática, isto faz com que vloggers e outros criativos possam utilizar livremente músicas licenciadas pela Universal nos seus vídeos. Antes os conteúdos ficavam sujeitos a restrições impostas pelos direitos de autor, que podiam resultar na eliminação do vídeo.\n\nin [tek.sapo](https://tek.sapo.pt/noticias/negocios/artigos/facebook-e-universal-music-group-selam-acordo-global)"
		},
		{
			"post_id": 1,
			"title": "Criptomoedas podem precipitar uma nova crise financeira",
			"date_published": 1514073600,
			"body": "Em considerações à[ Business Insider](http://www.businessinsider.com/bitcoin-could-trigger-financial-crisis-2017-12?utm_source=feedly&amp;utm_medium=referral), Garrick Hileman afirmou que, com o aumento consecutivo do valor de criptomoedas como a Bitcoin ou a Ethereum, também cresceu o interesse e a preocupação de investidores e executivos financeiros.\n\nEsses receios são também partilhados pelo Reino Unido e por[ outros governos da UE](https://tek.sapo.pt/noticias/negocios/artigos/franca-quer-por-g20-a-discutir-regulacao-para-a-bitcoin)  que planeiam, no próximo ano, regulamentar a criptografia em consonância com a legislação contra o branqueamento de capitais e contra o terrorismo, aumentando a transparência.\n\nUm dos grandes motivos para essa “desconfiança”, é o facto de se tratar de um ativo altamente volátil, como tem sido demonstrado esta semana. Depois de já ter valorizado mais de 1600% este ano, a Bitcoin perdeu esta semana 27% do seu valor, registando a pior semana desde 2015.\n\nEssa volatilidade tem originado vários avisos, entre os quais o de Paul Krugman, vencedor do prémio Nobel da economia que afirmou, numa entrevista ao Business Insider, tratar-se de uma bolha, ainda mais óbvia do que “a bolha imobiliária”.\n\nE, para Garrick Hileman, apesar de ainda “não haver pessoas suficientes ou instituições financeiras a deter criptomoeda”, estas podem tornar-se “sistemicamente importantes”, possibilitando o aparecimento de novos investimentos, como um mercado de futuros em bitcoin, o que, por consequência pode desencadear “uma próxima crise”.\n\nHileman acredita que, apesar da criptomoeda ainda não apresentar, para já, esse risco, a sua integração com os mercados financeiros mais tradicionais, para além de “exacerbar” uma possível crise, também será factor de instabilidade financeira.\n\nin [tek.sapo.pt](https://tek.sapo.pt/noticias/internet/artigos/criptomoedas-podem-precipitar-uma-nova-crise-financeira)"
		}
	]
}