{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1593644510,
			"title": "Кто знает хорошие разоблачающие фильмы?",
			"body": "Такие как Хозяева денег, Разменная монета, Дух времени и т.д.\nПосоветуйте, что интересного посмотреть.",
			"added": 1593644509
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1591036220_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 1,
				"body": "> [zombibi](#comment_34_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): в riot есть голосовые сообщения?\nда, и видеозвонки (вроде jitsi прикрутили просто). Только сервер лучше недефолтный использовать т.к. там отключены статусы  (онлайн/оффлайн) из-за количества пользователей.",
				"added": 1593638379
			},
			{
				"comment_id": 2,
				"body": "инструменты для приватности можно  смотреть здесь:\nprivacytools.io ( http://privacy2zbidut4m4jyj3ksdqidzkw3uoip2vhvhbvwxbqux5xy5obyd.onion )\nprivacytools.ru\nprism-break.org/ru/\nСобственно лучшие месенджеры уже перечислили:\nRiot\nConversations\nJami\nBriar",
				"added": 1593638611
			}
		],
		"1589484353_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 3,
				"body": "Lock step от Rockfeller Foundation см ютуб там есть ссылка на pdf",
				"added": 1593642708
			},
			{
				"comment_id": 4,
				"body": "см много фильмов про такое явление как сионизм\nВкратце: 1) много людей больше не нужно т.к. \"постиндустриальная эпоха\", роботы, компьютеры и т.д.\nбольшое количество людей трудно держать в рабстве долго, т.к. они начинают догадываться и не хотят быть рабами (появляется риск потери власти и накопленных богатств) 2) капиталистическая система себя изжила, кризис перепроизводства, расширяться больше некуда, т.е. единственный вариант переход на другой вид экономики, при этом имеющуюся власть хочется сохранить, поэтому выбран авторитарный режим и ставка на \"цифровую экономику\", т.е. неофеодализм (рабовладельческий строй).",
				"added": 1593643135
			},
			{
				"comment_id": 5,
				"body": "из сионизма растут следующие явления: во многих странах одни евреи у власти, и поведение их ебанутое на максимум (особенно в россии/украине ХАБАД).",
				"added": 1593643258
			},
			{
				"comment_id": 6,
				"body": "заключение: коронавирус нужен был провести акцию id2020, чтобы вставить всем чипы, убрать наличку, вернуть рабовладельческий строй. Далее сокращение численности населения (скорее всего через стерилизацию).",
				"added": 1593643373
			},
			{
				"comment_id": 7,
				"body": "covid-20 видимо будет, т.к. у них другого выхода нет (особенно в рф), а стадо баранов показало себя как стадо баранов.",
				"added": 1593643446
			}
		],
		"1590350740_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 8,
				"body": "В данной ситуации плохо. Вас ещё не прикончили (а сионисты давно ведут политику очистки терротории рф от коренных народов), т.к. 0,5% населения активно сопротивляется. Если оставить только банк. карты, то недовольных властью можно легко отключить от системы. см \"Враг государтсва\" и интервью+фильм с Аароном Руссо на ютубе.",
				"added": 1593643808
			}
		],
		"1586594582_1JzkNnKvtbyhws9GwvYSjAx8oHRHevmksn": [
			{
				"comment_id": 9,
				"body": "см на ютубе либо битчуте фильмы Выйти из тени и особенно Крах заговора. pizzagate не конспирология, а реальность.",
				"added": 1593644250
			},
			{
				"comment_id": 10,
				"body": "Эпштейн в тюрьме, Вайнштейн тоже в тюрьме. см открытие золотого глобуса в этом году и слушайте внимательно",
				"added": 1593644333
			},
			{
				"comment_id": 11,
				"body": "про католических священиков-педофилов уже даже фильмы сняты полнометражные, например \"В центре внимания\"",
				"added": 1593644387
			}
		],
		"1585388893_149RCNaRcGLevbZcMLdhsixwQarCZga6WT": [
			{
				"comment_id": 12,
				"body": "необходимо начать с того, что объединиться для начала хотя бы адекватным людям, чтобы действовать сообща (взаимопомощь, взаимовыручка), и вести информационную пропаганду среди стадов населения",
				"added": 1593645254
			}
		]
	},
	"comment_vote": {}
}