{
	"next_topic_id": 21,
	"topic": [
		{
			"topic_id": 1630038466,
			"title": "have the jewish supremacists yet tried to eliminate the Chinese Hans using...",
			"body": "like they do to the white chistians in europe and usa? black mails and bribes on politicians to get their laws passed, control of the medias with their printing presses, constant psywarfare, mass imigration? \n\nI don't think they will dare, as long as vigiliance level is maintenained and as long as the scoot or human spike proteins they will send to attack (money concentrators, funny people, etc, you know tip of the spears) are found, killed and send in pig blood sauces back... \n\nit's the centrality of the running war.",
			"added": 1630038465
		},
		{
			"topic_id": 1630039466,
			"title": "honestly, do milley, austin and co realize how ashtray they have gone?",
			"body": "wokism? from gay bathroom and period woman on front line? go shit on the airport... before 5000 marines girls... do it or change your tampons...\ngayism? sorry boys, but no gays on board, at least don't tell don't ask don't care, if you pussy shit, gone.\nwhite supremacism? this is the worst, as CPC said, no to chauvisnism doesn't mean to have to negate Han identity as for any tribe or ethny of china. be proud of you ancestors, isn't denigrading those of others.\nelection fraud... you have the data telecos, could have arrested the \"dominion\" etc... it was the biggest attack on american integrity ever, bigger than pedogate and 911.\nnato... those europeans don't have the same culture and way of life. look at basic thing like freespeech.. words... the nazi scotish dog? you see...",
			"added": 1630039464
		},
		{
			"topic_id": 1630039559,
			"title": "how many of those killed in duty in afg were jewish?",
			"body": "or blacks etc? I am curious of the real stat... the death stats... just to know... and the whole campaign?",
			"added": 1630039556
		},
		{
			"topic_id": 1630039670,
			"title": "for me the liberation of france and usa, are the same...",
			"body": "english is totally a different thing (give us the prince) and we move on...\n\na controlled media.\nisraeli / jewish capture.\nnative dominated and invaded and subjugated by the psy and force agents of a few printers of fiat...\nI mean this is the strategic failure. by design etc...",
			"added": 1630039666
		},
		{
			"topic_id": 1630040040,
			"title": "how contaminated is south korea by the zio masso pedo aristo satanists?",
			"body": "I ask... I guess the \"antifa aka marxist brown shirts are hunted down and killed military style\"? logic isn't it\n\nbut the rest of the gang? free masson penetration? gayism from christianism? pedophiliac? and aristocracy opposed to meritocracy? \n\nI never been to south korea... what is the injection status?\n\nand I guess there is no risk of japanese (japan as a servant of the zio masso pedo aristo satanists) penetration risks?\n\nmy little fear is with \"el northe\"... would be nice to reach with PRC and DPRK an \"alliance\" or at least a total non aggression principle. to not get at each others throwt once japan is activated for the westerner plan... \n\nit's sad this capture of japan... and I guess it's more some crazy japanese, who rather than want to enjoy peace and life, pretend to let themselve capture by the west when in reality they use this capture to achieve this strange obessession to want to invade china... I guess fondamentally those in japan wishing and planning that have a profound hate for japan, maybe they had some social problems?\n\nare technocratic societies socially equilibrated? I mean mind body psych?",
			"added": 1630040035
		},
		{
			"topic_id": 1630040425,
			"title": "at which rank american soldiers must swear alliegance to united nation laws?",
			"body": "and promise to not abide by the us constitution? general? below? but I am pretty sure there is a club at the top : the International law club... who don't give a shit about the republic...\n\nmattis was a good example of this, as is austin...\n\nin china I would call that treason.",
			"added": 1630040419
		},
		{
			"topic_id": 1630045205,
			"title": "who was the last american congressman arrested for corruption? 1800? or never",
			"body": "I ask...  or when did they realized the take over to morph into their current aristocratic form?",
			"added": 1630045198
		},
		{
			"topic_id": 1630045530,
			"title": "Great about China executive system, accute description of france/usa",
			"body": "https://www.globaltimes.cn/page/202108/1232611.shtml\n\nTo understand the profound transformations of the modern China, one must understand the Communist Party of China (CPC). The CPC: Its Mission and Contributions, a key publication released on Thursday by the Publicity Department of the CPC Central Committee, is of great significance for the world to understand the CPC objectively and accurately.\n\nThe historic mission of the CPC is to achieve the great rejuvenation of the Chinese nation, and the Party's fundamental goal is to work wholeheartedly for the well-being of the Chinese people. These two fundamental developments have converged in the process of the founding of the People's Republic of China and the realization of stunning achievements during China's national development. The CPC has been leading its people to create miracles. This is what all outside forces can feel regardless of their values.\n\nHowever, some Western forces take geopolitical interests as the starting point of their narrative about China and the CPC. They discredit the CPC, disregarding the basic facts. Therefore, their lies have to be backed up by strong nationalist sentiments and some of their remaining advantages in economic and social development. But China's growth will exert more and more pressure to disintegrate their lies, until their lies collapse.\n\nThe newly released document is down-to-earth, consistent with historical facts, corresponding to the feelings of the vast majority of Chinese people, and it has responded the concerns of the international community. The strength of the CPC lies in its rooting deeply among the Chinese people, the largest group of population in the world. Its goals are consistent with the needs and long-term dreams of the Chinese people. It has boosted China's liberation and development and is integrated into this grand process. That being said, whoever wants to overthrow the CPC needs to overthrow the Chinese people and the historical trend. Obviously no power in the world is able to do it.\n\nWestern political parties serve the interests of the group first and foremost. Their ways of embedding in the Western society and their relationship with their national interests are fundamentally different from that of the CPC. Hence, many Western elites simply do not understand the CPC. Once in power, Western political parties will certainly take the opportunity to seek interests for their parties, which to a certain extent is the legal bonus of the ruling parties. Thus, they speculate that the CPC's longtime governance is an \"autocracy\" seeking selfish gains. They can hardly imagine that a ruling party would genuinely \"serve the people,\" because in the West, \"the people\" need to be coaxed only during the election campaigns. Politics in the West is \"politics for elections,\" where there is a systematic political deception that voters can do nothing about.\n\nThe CPC must speak with its governing achievements and must meet the people's growing expectation for a better life. History has chosen the CPC to lead the country in the long run. Therefore, the CPC must be fully responsible for China's progress and must shoulder the primary responsibility for the country's mistakes.  The CPC's spirit of seeking truth from facts is deeply rooted. It spares no effort to pursue the right path. Its self-correction ability must be fully guaranteed. All this will be tested repeatedly in practice, permitting not a slightest bit of dishonesty. \n\nThis makes it very hard for Western parties to compete with the CPC in governance capability. They are not in the same dimension with the CPC, to be precise. China's institutional advantage is made stronger by the Party's constant self-improvement. Western elites dare not face the increasingly obvious difference between China and the West. But the emergence of the super facts one after another is not affected by their will. \n\nChina develops rapidly with great momentum. Moreover, China has taken the absolute lead while leaving many other countries far behind in the fight against the COVID-19 pandemic, a highly comparable governance race across the globe. Public opinions in the US and some other Western counties can only maintain their value judgment of \"freedom outweighs lives\" purely by telling lies and smearing China. History will eventually hold them accountable for their deception. \n\nThe light of truth is shining on the world through cracks in Western public opinion's iron curtain. \n\nWho is the CPC? The answer will become increasingly clear and definite as the fact of China's peaceful rise continues to expand. No one can cover up facts. Therefore, no power can discredit the CPC eventually. The document released on Thursday comes at a perfect time. It reveals the profound logic behind the vivid reality and provides doors and windows for people to see the truth.",
			"added": 1630045522
		},
		{
			"topic_id": 1630047329,
			"title": "how to reverse the posting order?",
			"body": "why isn't the box to write answers below the last line and why it goes up?\nbecause to create disincentive to use zn... classical cia.",
			"added": 1630047320
		},
		{
			"topic_id": 1630052062,
			"title": "bear hands, a normal man can't beat a cat...",
			"body": "how do you catch it? as soon as it gets that you are after it... it's too fast... too lacerious... too fucking strong... people don't realize... a mini tiger, and when it's starts to tornado... it's move faster than human... even in a boxed ring... open space? impossible... the thing is a missile... and it has a tail... a man can't jump 4-5. maybe 6 time it's lenght... at least a normal cat... not some fat indoor lard who doesn't want to fight.\n\nI am curious how some people believe they can beat an elephant bear hands... darwin award... next they will take on giant squid... or go challenge the hippo... \n\nthanks for the laught... what an idea... and the grizzli bear? seriously?people have never seen two adult grizzli bear settle peaceful a physical different... they don't seek the kill... but when they against a man? ahahahah... I believe when a polar bear jumps on you, and a bite your heads, the skull is simply crushed under his theets in a one swoop... the thing is made to hunt wallruss... \n\nit's safer to defeat the zmpas than engage the wild, because while you fight the cat, a tiger may see you... \n\nfor me the easiest to beat is the dog... or wolf... 1... when they pack, it's done.",
			"added": 1630052052
		},
		{
			"topic_id": 1630052797,
			"title": "Bee status update?",
			"body": "I was recently censored (again) for mentionning bee status in north america, I had heard there was a population collpase in the north east usa... true or false? I advanced 5g, emf pollutions... and gone... not co2 narrative compatible.",
			"added": 1630052786
		},
		{
			"topic_id": 1630082443,
			"title": "Countdown to The murder of the first child of justin trudeau...",
			"body": "trucided /on",
			"added": 1630082431
		},
		{
			"topic_id": 1630082809,
			"title": "Mega countdown to wiping of all western vaxxnazis children...",
			"body": "roam through the world... one by one, clip by clip who knows... but countdown /on...\n\nwill see like for Dr. Judith...\n\nehhehehe",
			"added": 1630082796
		},
		{
			"topic_id": 1630084537,
			"title": "how would you kill a child of justin trudeau?",
			"body": "Personnally, I would say stabbing, or simple the classical rocks smashed with speed on their heads... you get the kill easily... and as seen in afghanistan once a minister start to go down, even better their children, the victory nears... it's life, they play though guy and fold like bitch :)",
			"added": 1630084523
		},
		{
			"topic_id": 1630085169,
			"title": "2 peers opponents to crush the americans ???",
			"body": "no boys... the world want them dead ! \n\nyou have no idea...\n\nyou ain't alone china russia\n\nahahah...",
			"added": 1630085154
		},
		{
			"topic_id": 1630085187,
			"title": "www.rt.com",
			"body": "",
			"added": 1630085171
		},
		{
			"topic_id": 1630085775,
			"title": "the Electoral commission concept... they want to rule? get \"naked\"",
			"body": "this is something very powerful, if transparent... to fully analyse a candidate in representative democracy... for example is he corrupt, does he knows the constitution, does he has mental, or medical issues...\n\nto have real candidates... worthy I mean\n\nand not some sub trash working for the nwo...\n\nagain fully public\n\nnothing secret\n\nthey want to rule? get naked\n\nlike a big brother show..",
			"added": 1630085758
		},
		{
			"topic_id": 1630085865,
			"title": "Wow Zheng Shuang : surrogate baby abandonned in usa...",
			"body": "woooo...",
			"added": 1630085847
		},
		{
			"topic_id": 1630087437,
			"title": "wow germs warfare in korean war...",
			"body": "wow... I guess I still have no idea how hardcore it was... but what ms yeonimi park said about dear leader, I was a bit shocked, the pharaonic stuff... boff bofff...",
			"added": 1630087418
		},
		{
			"topic_id": 1630087520,
			"title": "woow the nazi israeli want to attack iran...",
			"body": "woot woot... it's gonna get hot in tel aviv....",
			"added": 1630087500
		}
	],
	"topic_vote": {},
	"next_comment_id": 127,
	"comment": {
		"1630038466_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 1,
				"body": "how to read soft bank (japan) hiring pedohandlers from mossad in this context? which cites allowed to be nuked in japan?",
				"added": 1630038819
			}
		],
		"1629910533_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 2,
				"body": "the real goal of jones is to deflect from jewish domination and capture of the usa. and that's why it's so truthfull... but on this.\n\nvoltaire said it best... those you can't critize are those ruling over you. and don't forget don't think like a goyim, for those, killing 90% of the israeli population is no problem has long as they achieve their goal.\n\nnow they have a problem, specially if christendom wakes up, and drops israel... \n\nno need to even fight them... just dropped. then a few real ABMS for the neighbors and interceptors, and  everything necessary to wage and win a ABC war, and it's gone.\n\nbut again the zealots... captured.\n\nwe can only realistically do business in china...\n\nno freemasson capture\nno jewish capture\nno evangelist capture\n\n\"paradise\" market...",
				"added": 1630039116
			},
			{
				"comment_id": 35,
				"body": "an argument that alex jones infowars are controlled opposition, and or part of the nwo take over, has he ever supported a single p2p open source software? never... (Ex once btc), but in general, he talks about freedom and liberty to always trap his audience into censored software and platforms or soon to be... from gab to what ever runbler or what ever shit the americans people themselves are building to get a captive audience.\n\nnever p2p torrent his videos (which would save him yuge costs)... that's the best illustration of how stupid he is... and you know p2p torrent can be live streamed too... so it's totally moronic... he could just have a single server to seed what's not popular and be done with it... the rest would 100% p2p networked... but no...\n\nsame for everything emails, censoreable unreliable system, satphone same shit... never anything really liberating or moving forward... his webiste on v3 torrents? nope... purely zio stooge... ahhh they that's what are evangelists after all... people who pretend to be christians and go kill irakis children for nothing... I would even say for fun... or afghan children... \n\nbig lie, but well constructed.\nplan b of the cia?\nI am curious how others see that?\nand that illustrate how done the msn is...\n\nbecause even if rant and critize here... few can reach that... the rest is so normie censored and really unwatcheable (constant breaks)... I mean... it's fucked up.",
				"added": 1630051359
			},
			{
				"comment_id": 41,
				"body": "What I don't get is if the guy is using the nwo as a vehicule to become the next roger ailes, but real and independent or is really interested in defeating it? because frankly his mission is like waking up nazi citizens accross the reich... I find it way easier to pulverize the reich forces and sees what's left after ward... \n\nbut I understand fully and respect his liberty, I just find sad, that it's among the best there is... I mean that he isn't up to the mission, and still does it better than all combined... \n\nyou can say what ever you want about my constant critism, but it's from a frequent viewer perspective... and I don't want this so called international liberal world order... no way... \n\nI think with PLA / MSS / CPC, the islamic crews (shias, sunnis), the russians and even the little people with little hat, and the peaceful chaos of india, there is little chance for those nwoers to establish their grand project... good luck for example in pakistan to remove the quran... \n\nand so I watch the entire christendom or western heritage civilization legacy, being trashed away to full fill the dreams of control and submission of men like rotschild, rockfeller or even a modest mortal like sorros... I find it pathetic. this lack of self defense, awarness, how entire intelligence and military agencies in the west in 10's of country have been taken over by those ghools...",
				"added": 1630056069
			},
			{
				"comment_id": 42,
				"body": "I would be born and raised in china, I wouldn't give a fuck, and laugh rarely thinking about it... what is this crap, no border, no laws, child rape, toxic food, no justice and the list goes on... a corporation stronger than Xi? imagine, a chinese corporation banning Xi? insanity... completly crazy... wanna die... rightly so ! \n\nand in west... you can't even ask how bees population are going... I mean madness... you say an illegal alien / refuggees / economic migrant rapes a young boy in a swimming pool and it's an \"urge\"?  imagine the madness... you get killed in pakistan, ksa, quatar, dubai, oman, karthoom, or maroco for such shit... insta kill.. what the fuck? \n\nand in the \"west\" captured by all those groups (zmaps), they would even tell the rapists is the victim... \n\nno one in PRC is happy to hear about the terrible ordeal of ms park, if she could say who, he  will certainly get executed, without much worry... one less... more to go.\n\nand I think those like alex jones or tucker carlson or all those fakers don't get...",
				"added": 1630056339
			},
			{
				"comment_id": 44,
				"body": "and what shocks me is the collective surrender and individual surrender of each country... from denmark to france to usa... total betrayal, nwo... international... obey... no ivermectine, no zinc, no vit c... \nI guess the swedes has such an hyper high opinion of the temselves they said always yes yes to nwo shit but did their own shit anyway... \n\nI am dumb founded...",
				"added": 1630056659
			},
			{
				"comment_id": 57,
				"body": "marek is bad for chikun... old... it was 2 weeks ago or something... very bad... but not affecting free range modest size chicken farm... again terrain theory...\nshitty water, shitty food, sick fish > morons ask for vaccines (germ theory)\nsmarties change water... 101.",
				"added": 1630083204
			},
			{
				"comment_id": 108,
				"body": "wooa mr stew ! your costume suits you handsomely #nohomo of course :)",
				"added": 1630091479
			},
			{
				"comment_id": 109,
				"body": "the other, the canadian, his nack tatoo? cia camera integrated? mossad agent? who knows... #bettersafethansorry militias always in the shades...",
				"added": 1630091534
			},
			{
				"comment_id": 110,
				"body": "go taliban/cartel on the justice minister of canada children if you wanted it to stop... ez,.... pffff buffoooons.",
				"added": 1630091575
			},
			{
				"comment_id": 111,
				"body": "you kill 200 children of top canadian gov officials, game over.",
				"added": 1630091597
			},
			{
				"comment_id": 112,
				"body": "1 night",
				"added": 1630091601
			},
			{
				"comment_id": 113,
				"body": "you are so pathetic men... you dont' give a shit what the sheeple do... you farm the enslaver / herders / shepards... sheeps are free... they saw nothing, still understand nothing... you are facing an uphill battle...",
				"added": 1630091669
			},
			{
				"comment_id": 114,
				"body": "look day one, when they started this injection scam, kill 200 children of canadian official,s hospital administrators etc etc... 2000 kids dead. how many saved? same logic as they use, but for liberty.",
				"added": 1630091714
			},
			{
				"comment_id": 115,
				"body": "you have to up the ante little boys... because your masters, seek to use you again to fight IRAN this time...",
				"added": 1630091780
			},
			{
				"comment_id": 116,
				"body": "they are though cookies there...",
				"added": 1630091794
			},
			{
				"comment_id": 117,
				"body": "their opposition to the sunnah? old...",
				"added": 1630091806
			},
			{
				"comment_id": 118,
				"body": "in your opinion should unrestricted bio ABC warfare legal on kuffar forces?",
				"added": 1630091840
			},
			{
				"comment_id": 119,
				"body": "I would say... YES ! organic droids attacking iran... so not humans. so okay.",
				"added": 1630091862
			},
			{
				"comment_id": 120,
				"body": "you want to suck jew cock infowars, you don't get how nasty it's gonna be... listen how the saudis call the iranians...",
				"added": 1630091901
			},
			{
				"comment_id": 121,
				"body": "personally i believe when PLA / Russian forces gears will land in iran... it's gonna blast for the boys... iranians... you field them and it's /on... they go hapilly ! and it will just legal djhad for them... defensive war... totally holly.",
				"added": 1630092005
			},
			{
				"comment_id": 122,
				"body": "on their turffs... + their own gears...",
				"added": 1630092020
			},
			{
				"comment_id": 123,
				"body": "and in my opinion quite quickly sunnis forces, will join the iranians... not necessary for the iranians, as said when the gates of heavens open, not jumping would be shirk (is the right word, right?)",
				"added": 1630092069
			},
			{
				"comment_id": 124,
				"body": "personally in coutner war I supprt fully bio release, real, on all american campuses... is rex at school alex?",
				"added": 1630092107
			},
			{
				"comment_id": 125,
				"body": "remember marbles alex? in one, enough to kill a city... self replicating... unrestricted... wanna play? with joe?",
				"added": 1630092150
			},
			{
				"comment_id": 126,
				"body": "or \"don\"",
				"added": 1630092160
			}
		],
		"1630040040_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 3,
				"body": "and my current fear with \"el northe\" is an accident, misunderstanding, and it exponentialize to yuge damage very fast for  many sides... and not really wanted, but sometimes, a match is enough...",
				"added": 1630040277
			}
		],
		"1630040425_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 4,
				"body": "but often I get confused between \"international law\" or international agreement on specific issues, and the one world gov emerging to enforce those laws... \n\nI hope this one gov fails and those laws aren't specific enough for each situations... \n\na good example is  the reaction of the WHO with the pLandemic, ivermectin, C, zinc...I mean... the proof is in the pudding.",
				"added": 1630040620
			},
			{
				"comment_id": 5,
				"body": "and here we speak about a lot of lives... but no...\nthe agendas or global law is : vaxx them all...\nokay... \nand if there are better options?\ndenied, censored, burried, made illegal.\nokay...\nsmart...\nno but profitable?",
				"added": 1630040670
			},
			{
				"comment_id": 6,
				"body": "to reframe, no one will exterminate or replace or genocide the Hans as the Mewmews or even an ethnie with less than 800 people all in in the world. btw those little people may seem weak, only 800 in the whole world... error... they are not alone... \n\nin west everything is being sacrificed for nwo and enjoyment of those like sorros...\n\nwe will kill alexander sorros, it's a marker or signal of liberation...",
				"added": 1630040798
			},
			{
				"comment_id": 7,
				"body": "the key concept is once liberation /on is to chain all the children of all those who were part of this nwo... but the daughter of nancy... \n\nshe will be able to tell who were chelsea clinton or the one of mike pence... or the one of donald trump but not the youngest... same shit...\n\nthey wanted war, to sell us out, to pimp on their yachts etc...\n\nthey will lose their children.\n\nfair.\n\nand if tucker carlson oppose, his kids... until he agrees, like for jones.\n\nweaklets... or perfect tools...\n\nin china I would flag jones and carlson as enemies enablers by weakening the homefront...\n\nhow in hell can you win a war without killing the children of the other side?\n\nmadness to even contemplate that...\n\nI don't say to have to go to farm each one once their front lines collapse, but to give them \"immunities\" you have to be sick, or a moron...  aka placing beliefs before reality---",
				"added": 1630041041
			},
			{
				"comment_id": 8,
				"body": "we will just need a dna test for sasha and masha... other wise this killing batch will mostly be white... \n\nand it's simple : placing UNO law above us laws = treason.",
				"added": 1630041117
			},
			{
				"comment_id": 9,
				"body": "placing israel interests above usa one = treason",
				"added": 1630041131
			},
			{
				"comment_id": 10,
				"body": "placing allaince interests (canada, japan, australia, new zealand, england) above usa one = treason",
				"added": 1630041164
			},
			{
				"comment_id": 11,
				"body": "did the american founders so beyond the risk of foreign entanglement, foreign capture? meaning the republic being captured by foreigners and use for their aims?",
				"added": 1630041235
			},
			{
				"comment_id": 12,
				"body": "example : what the fuck is the usa doing with Taiwan? why not hainan? it's madness...",
				"added": 1630041265
			},
			{
				"comment_id": 13,
				"body": "this story of island chain is such a lie... china doesn't sail ming boats anymore...",
				"added": 1630041284
			}
		],
		"1630045530_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 14,
				"body": ">Western political parties serve the interests of the group first and foremost. Their ways of embedding in the Western society and their relationship with their national interests are fundamentally different from that of the CPC. Hence, many Western elites simply do not understand the CPC. Once in power, Western political parties will certainly take the opportunity to seek interests for their parties, which to a certain extent is the legal bonus of the ruling parties. Thus, they speculate that the CPC's longtime governance is an \"autocracy\" seeking selfish gains. They can hardly imagine that a ruling party would genuinely \"serve the people,\" because in the West, \"the people\" need to be coaxed only during the election campaigns. Politics in the West is \"politics for elections,\" where there is a systematic political deception that voters can do nothing about.\n\nthis part in particular... add the \"dual citizen layer\" and how to even have hope?\n\n>The CPC must speak with its governing achievements and must meet the people's growing expectation for a better life. History has chosen the CPC to lead the country in the long run. Therefore, the CPC must be fully responsible for China's progress and must shoulder the primary responsibility for the country's mistakes. The CPC's spirit of seeking truth from facts is deeply rooted. It spares no effort to pursue the right path. Its self-correction ability must be fully guaranteed. All this will be tested repeatedly in practice, permitting not a slightest bit of dishonesty.\n\n>This makes it very hard for Western parties to compete with the CPC in governance capability. They are not in the same dimension with the CPC, to be precise. China's institutional advantage is made stronger by the Party's constant self-improvement. Western elites dare not face the increasingly obvious difference between China and the West. But the emergence of the super facts one after another is not affected by their will. \n\nFYI once upon a time Chrisendom was great, but then it was captured... sniff sniff...",
				"added": 1630045688
			},
			{
				"comment_id": 15,
				"body": "a good example, is most old people are deficient in zinc and vit d, c, in the west... cost? compared to a single hour in intensive care? you see, it's even irrational, and there are men like alex jones who spew constant lies... or resaid, don't say certain things and infer others...\nintelligence agencies who have betrayed\narmies and police who protect criminals.\nI mean... \nis that I don't see a way out !\n\nthat's it.\n\nand I am not speaking on a daily or quarterly basis... but what's the future of christendom under captivity? will there be a liberation? do things really need to get bad for a wake up to happen? anyway...\n\nwasting time here or anywhere won't improve things, so becoming like an autist waiting for the walls of rome to collapse? stupid. and it wouldn't cost much, in blood, tears and hardship to turn this ship around... \n\nbut jews... jeeeewwwwssss... and I am not speaking of \"jews\"... no... the fucking \"zio\", those behind this rockfeller one world crap, those pedo wasps, those fucking massons global western shadow org, those fucking aristo and wannabe aristo, even the super low micro bourgeoisie, the little fuck who get's just a little more and believe to be part of the power structure, the total apathy, the lack of modernization, and I don't mean that by adding EMF producing cell towers or mRNA injection, but things like digital democracy? never heard about it, me neither... or anything about social, and not toilets for transgayfemales... \n\nyou note that I don't rant against BLM... 2.5 millions people captives in usa... what the fuck... but europe isn't usa. africans have no rights to live in europe.",
				"added": 1630046210
			},
			{
				"comment_id": 16,
				"body": "this constant manipulation by the zio masso pedo aristo satanists make even any form of conversation impossible... the true break of social cohesion or even social interactions... \n\nsuper the cia and co put the west in trance... so what? you have mcmansion and you cia neigh boors with swimming pools? and you don't see the country around? many in the ending of chinese dynasties did the same mistakes...",
				"added": 1630046298
			},
			{
				"comment_id": 17,
				"body": "and what's even more impressive is the complicity from the press with this zmpas (zmpas=zio masso pedos aristo satanist), I guess infiltrated and manipulated too... enemy of the people...\n\nand what the moron trump do? arrest anyone? no... never. nothing , all lies. all deceits...",
				"added": 1630046418
			},
			{
				"comment_id": 18,
				"body": "and digital social networks? I mean it's a shame... treason. treason. simply.",
				"added": 1630046470
			},
			{
				"comment_id": 19,
				"body": "and the deviants and problematc people like alex jones say China china china... fuck you, china isn't ruling facebook, nor twitter, nor anything like youtube. it's fucking jewish bolshevicks... and those overlords marxists all serving the zmpas plan... an aristocracy imbeded in marxism to cement their rule over the people... to become not only rich by financial but by legal... absolute take over... the feodalization and worst the transformation of western people into organic droids... this is so \"hellish\" and again morons low iq like jones with their all theological interpretation... \nit's so fucked.",
				"added": 1630046601
			},
			{
				"comment_id": 20,
				"body": "christendom has been hacked.\nfact.\nconclusion don't get hacked dear CCP :).",
				"added": 1630046688
			},
			{
				"comment_id": 21,
				"body": "or social reverse engineered and take over, captured, farmed and even brainwashed to accept slavery as life... (farm animal concept).",
				"added": 1630046737
			},
			{
				"comment_id": 22,
				"body": "and then they want alexander sorros, ivanka trump, chelsea clinton to rule my life or the son of mr ron paul... you see? \n\ncontrary example I have nothing aginst the family of teh honorable blankfein or the \"emperor of all state debts\"... \n\nin short captured nervous system (press, information, intellignece, internet)\nleading to paralyisation of muscle mass (cops, miltary etc)\nleading to a weakening of the bone structure (instutional coherence, social cohesion, institutional trust)\nleading to the death of the civilization...\n\nimagine the last phirao.. his sister wanting to be queen...\n\nand him and his men, facing the Real ROME...\n\ndied and gone. not even a fight... \n\nand civilization ended.\n\nto never be reborn again.",
				"added": 1630046955
			},
			{
				"comment_id": 23,
				"body": "that's what I am speaking about in formerly known area as christendom...\nthe civilizational collapse.",
				"added": 1630047011
			},
			{
				"comment_id": 24,
				"body": "on the scale of the fall of ancient egypt...",
				"added": 1630047034
			},
			{
				"comment_id": 25,
				"body": "at least is mr rotschild and the others fundation happy?",
				"added": 1630047084
			},
			{
				"comment_id": 26,
				"body": "for example to punish macron of france, every single currently employeed worlwide of all rotschild controlled entity get killed.",
				"added": 1630047149
			},
			{
				"comment_id": 27,
				"body": "that's called dissuassion by extermination.",
				"added": 1630047161
			},
			{
				"comment_id": 28,
				"body": "come on next player...",
				"added": 1630047171
			},
			{
				"comment_id": 29,
				"body": "cd is unavoidable.",
				"added": 1630047190
			},
			{
				"comment_id": 30,
				"body": "as is ff",
				"added": 1630047203
			},
			{
				"comment_id": 31,
				"body": "in war",
				"added": 1630047207
			},
			{
				"comment_id": 37,
				"body": "for me a major problem is escapees from north korea, I refer to yeonmi park in epoch time article. \n\nproblem : no interference in foreign affairs. food short age in nk, pharaonic inspired regime, and then the sex/slave trade... \n\nsolution,  even if they are illegal aliens in china, the sex slaves trade, and specially of north korean children should be fought harder. those chineses doing that don't deserve to live imho.\n\nproblem ressource allocation, china isn't the police state that some portray it to be... but it's a shame that it happen still in PRC...",
				"added": 1630052954
			}
		],
		"1630047329_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 32,
				"body": "I mean of course new post go up",
				"added": 1630047335
			},
			{
				"comment_id": 33,
				"body": "but when writting a reply this box should be below?",
				"added": 1630047351
			},
			{
				"comment_id": 34,
				"body": "work flow... something unknow to eastern europeans...",
				"added": 1630047371
			},
			{
				"comment_id": 38,
				"body": "it's an argument...",
				"added": 1630055535
			},
			{
				"comment_id": 39,
				"body": "it works... maybe a dual view option?",
				"added": 1630055553
			},
			{
				"comment_id": 40,
				"body": "it's just order after all... not so complex... for example I want to follow a whole conversation I would start top down or inversely just reply to myself... using top down.\n\nI dont' think the ui designer have to make choices for the users... this is domestication > pussyficiation > organic droidism. I really believe that some ui designers beyond trying to make their work relevants by always fucking the design, have a conspiracy to domesticate user... to plow them at their will... in the grand organic droid strategy.",
				"added": 1630055690
			},
			{
				"comment_id": 43,
				"body": "and I mean the reply box should be below too :) you read all then reply, and not only the op or last...",
				"added": 1630056472
			}
		],
		"1630052062_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 36,
				"body": "anyway, I am the biggest idiot in believing a man saying that he believes he could beat an elephant...",
				"added": 1630052712
			}
		],
		"1630082443_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 45,
				"body": "And it has nothing to do with meng.... you who will stand in our way, will you get killed.",
				"added": 1630082461
			},
			{
				"comment_id": 46,
				"body": "spread to 2nd",
				"added": 1630082558
			},
			{
				"comment_id": 47,
				"body": "spread to 3rd",
				"added": 1630082566
			},
			{
				"comment_id": 48,
				"body": "way of death",
				"added": 1630082575
			},
			{
				"comment_id": 49,
				"body": "in order",
				"added": 1630082579
			},
			{
				"comment_id": 50,
				"body": "countdown to murder of children of David Vigneault /on",
				"added": 1630082624
			},
			{
				"comment_id": 51,
				"body": "see you soon...",
				"added": 1630082631
			},
			{
				"comment_id": 52,
				"body": "you wanted us slave... will see... countdown on... will love to be in taiwan, it's old tradition...",
				"added": 1630082669
			},
			{
				"comment_id": 53,
				"body": "hide, make it fun... we have eternity. we have only hate and love for war.",
				"added": 1630082698
			},
			{
				"comment_id": 55,
				"body": "and just to be clear suckers, I won't do anything nor preparing nor thinking nor waning to do to mr trudeau... and specially his children. they did nothing to me, however, I know he has more enemies than he can realize in his media buble... and that they will get killed,... ahahahhaha....\n\nI just find very laughable to come back here in a while, and laugh at their funerals... ahahahhahaahah\n\nfuck you",
				"added": 1630083048
			}
		],
		"1630052797_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 54,
				"body": "yeah bets, neonicotinoids... but 5g not fun for the swarm, remember they knew. kill their children future survivors.",
				"added": 1630082853
			}
		],
		"1630082809_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 56,
				"body": "and just to be clear suckers, I won't do anything nor preparing nor thinking nor waning to do to vaxxnazi... and specially their children. they did nothing to me, however, I know they have more enemies than they can realize in their media buble... and that they will get killed,... ahahahhaha....\n\nI just find very laughable to come back here in a while, and laugh at their funerals... ahahahhahaahah\n\nfuck you",
				"added": 1630083119
			}
		],
		"1630084537_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 58,
				"body": "find the child, take a rock, a big but not too big, in your hand, run behind jump and with the speed smash the rock still in your hand against the skull... it breaks... at least it get down, then finish... max 5 sec and the kill is down. cost 0 risk depending 0... so yes, it's how it's done, but only free men understand that their enemies children must die.",
				"added": 1630084618
			}
		],
		"1629863121_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 59,
				"body": "28? omg... \ndo they go to janah? I understood it was clearer in the djhad combat phaze, there they had a strange role... they protected kuffars... I am sorry to say it. I ask,... learning together, cultural exchange... \n\nsecond point... when will this defense minister be killed? I guess he is the biggest beneficiary in this?\n\ncia with their fake director from a fundation?... nope...\n\nisis? what's that? \n\nso who benefits the most?\n\nor this defense minister or the israelis... but seriously... the second? I don't know... they are being hunted by their own gov an will end to die as vaxxed cattles... so you know the motivation may not be there...\n\nmaybe crazy dudes who found some explosives...\n\nbut 28 liberators of afghanistan to the other side... in kabul...\n\nanyway... \n\nwhat can we do...\n\nso they are already funeraled? right...\n\nand their families will be taken care of if they had any...\n\nso yeah this former defense minister...",
				"added": 1630084846
			}
		],
		"1630085187_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 60,
				"body": "yeah I like the sentence, and meaning 2 peers opponents... ahahhaha",
				"added": 1630085190
			},
			{
				"comment_id": 61,
				"body": "what I want is to frag beyond the american organic military droids, those behind them... because in itself those military organic droids, are like nazi soldiers... totally brainwashed... maybe not human anymore... but those beyind...\n\nfor example victoria nuland... once dod is gone... her? I hope who ever leads the russian people will track and kill her or her offsrings...",
				"added": 1630085271
			},
			{
				"comment_id": 62,
				"body": "or the fucker trudeau... he will pay and all members of his gov... their grand grand children...",
				"added": 1630085288
			},
			{
				"comment_id": 63,
				"body": "the day a little ant complaint to the dragon... and dragon said : one day...\n\nand so the ant knew that it's vengance queued in the dragon path...",
				"added": 1630085323
			},
			{
				"comment_id": 64,
				"body": "china socialism... you don't get it... when the great Chairman died, in 1997... it wasn't an asian financial crisis, but an hommage...",
				"added": 1630085372
			},
			{
				"comment_id": 65,
				"body": "zelensky? back to the motherland?",
				"added": 1630085394
			},
			{
				"comment_id": 66,
				"body": "who is lisa shaw? from person of interests?",
				"added": 1630085412
			},
			{
				"comment_id": 67,
				"body": "quite poor now :)",
				"added": 1630085437
			},
			{
				"comment_id": 68,
				"body": "me for the reintegration of ukraine, I would ask all the pedo, all the zio involved in sextrade, lives... simply.",
				"added": 1630085499
			},
			{
				"comment_id": 69,
				"body": "it has a dark side to ask for integration corpses... but I find it cool... it shows if they are worth it, and capable... they want or not?",
				"added": 1630085548
			}
		],
		"1630085865_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 70,
				"body": "okay the tax fraud is super bad already... what an arrogance some little pricks believe to have... that's another difficulty, how to not get trick by beauty, when it hides a monster...",
				"added": 1630085881
			},
			{
				"comment_id": 71,
				"body": "it's a good test... only kung fu men can pass it... easy for kung fu girls...",
				"added": 1630085899
			},
			{
				"comment_id": 72,
				"body": "pop culture... nefarious...",
				"added": 1630085914
			},
			{
				"comment_id": 73,
				"body": "there is a bug in this market...",
				"added": 1630085929
			},
			{
				"comment_id": 74,
				"body": "why they make so much money? that's the core issue...",
				"added": 1630085955
			},
			{
				"comment_id": 75,
				"body": "there is a problem in the market structure in relation to the pay out of the art performers...",
				"added": 1630085987
			},
			{
				"comment_id": 76,
				"body": "a lack of competitiveness in market entry... I don't know... how to prevent the star system?",
				"added": 1630086033
			},
			{
				"comment_id": 77,
				"body": "why this girl and not this one?",
				"added": 1630086053
			},
			{
				"comment_id": 78,
				"body": "specially in recorded business... live is different... but if you can record...",
				"added": 1630086092
			},
			{
				"comment_id": 79,
				"body": "a good example is a mini dwarf in france who makes 250k euros per show... scandale.",
				"added": 1630086112
			},
			{
				"comment_id": 80,
				"body": "and it's almost 1 per week... I exegarate maybe... but a lot... I mean a lot.",
				"added": 1630086162
			},
			{
				"comment_id": 81,
				"body": "a good crackdown !",
				"added": 1630086182
			},
			{
				"comment_id": 82,
				"body": "that's for sure.",
				"added": 1630086187
			},
			{
				"comment_id": 83,
				"body": "as you see I don't discuss the surrogate issue... so violent.",
				"added": 1630086233
			},
			{
				"comment_id": 84,
				"body": "there is a lack of connection.",
				"added": 1630086240
			},
			{
				"comment_id": 85,
				"body": "in short this situation proves that the world is moving to china... only place where wasting time on this will produce concret return... in west, only lies, deceit, treason, betrayal and exploitation...",
				"added": 1630086313
			},
			{
				"comment_id": 86,
				"body": "however I was quite insulted to be treated of \"antivaxx fanatick\"... medical freedom medical liberty, my body my choice, shefu has immunity training program too... don't interfer...",
				"added": 1630086390
			},
			{
				"comment_id": 87,
				"body": "and little caligraph bows.",
				"added": 1630086399
			},
			{
				"comment_id": 88,
				"body": "plow",
				"added": 1630086404
			},
			{
				"comment_id": 89,
				"body": "an opinion... the star system foster the me me me... rather than the we... I guess the fandom wicked their minds... furthermore none in the west took a stand for medical liberty, I despise them all...\n\nso the idea is : taxation , the performer and the coporations involved... progressive... let's say it made more than 70m Yuans, and then it gets exponential for the performer and corporation, which will incite both to hire new ones ! and spread the talent...",
				"added": 1630087020
			},
			{
				"comment_id": 90,
				"body": "70m for the performer... and then, once reached, if hired both him and corps get exponential taxing... which disincentives... or it's the love of the art...",
				"added": 1630087081
			},
			{
				"comment_id": 91,
				"body": "but I want impecable behavior ! as everyone, no more, no less.",
				"added": 1630087117
			},
			{
				"comment_id": 92,
				"body": "but the surrogate issue, that's terrible, I understand that some females, specially I guess those vaxxed with the western jabs will need them... I guess it will even move to artificial whombs to make even more money to the tech industry (by design).... bad future...",
				"added": 1630087183
			},
			{
				"comment_id": 93,
				"body": "me think, a baby needs his mother.",
				"added": 1630087195
			},
			{
				"comment_id": 94,
				"body": "and you see the perversion propaganda with the kardishians...",
				"added": 1630087218
			},
			{
				"comment_id": 95,
				"body": "for me it shouldn't be allowed without medical approval...",
				"added": 1630087244
			},
			{
				"comment_id": 96,
				"body": "for \"confort\"... terrorism.",
				"added": 1630087256
			},
			{
				"comment_id": 97,
				"body": "for me...",
				"added": 1630087263
			}
		],
		"1630087520_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 98,
				"body": "I wouldn't be surprised that the removal of trump had something to do with it... at first I was thinking he wanted the war, and as such was removed by wise generals, but maybe it's the contrary...",
				"added": 1630087567
			},
			{
				"comment_id": 99,
				"body": "iranians aren't gays...",
				"added": 1630087582
			},
			{
				"comment_id": 100,
				"body": "irak+afgh+korea+vietnam combined...",
				"added": 1630087610
			},
			{
				"comment_id": 101,
				"body": "less the jungle...",
				"added": 1630087618
			},
			{
				"comment_id": 102,
				"body": "time to get long body bags :)",
				"added": 1630087631
			},
			{
				"comment_id": 103,
				"body": "The gates to heavens open...",
				"added": 1630087679
			},
			{
				"comment_id": 104,
				"body": "that''s what many don't get...",
				"added": 1630087689
			},
			{
				"comment_id": 105,
				"body": "which side will the talibies side with? iran or the kuffars?",
				"added": 1630087718
			},
			{
				"comment_id": 106,
				"body": "> [tomer](#comment_51_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): lol i dont see any problem\n\nbefore it became a vaxxnazi site, I always wanted to visit the little colony of the jews in the middle east ! specially the beach of tel aviv... but as it's now ausviv or telavitsch... hmmm no thank you.\n\nyou think it will be easy war for iran? or end of time war?",
				"added": 1630091258
			},
			{
				"comment_id": 107,
				"body": "frankly we have everything\nmark of the beast\narrows in the sky\ngreat wealth in the ground...\nice men (russian next door)\namericans too...\n\nhmmm doesn't smell good... imho... but again who knows...",
				"added": 1630091349
			}
		]
	},
	"comment_vote": {}
}