{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1557232331,
			"title": "Bomby w placówkach szkolnych",
			"body": "Jak myślicie ... wina uczniów (bo nie chcą matury) czy wina nauczycieli (bo strajk nie dał nic)..... Ciekaw jestem opinii",
			"added": 1557232330
		},
		{
			"topic_id": 1557820868,
			"title": "Oto co dzieje się z księdzem gdy nabroi",
			"body": "Wszystko można zobaczyć na tym filmie, który wciąż Youtube udostępnia, oby jak najdłużej. https://www.youtube.com/watch?v=BrUvQ3W3nV4",
			"added": 1557820866
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1551813352_17UY7McN5WAMD6dqnxLCFBwHYLXY9HmDuV": [
			{
				"comment_id": 1,
				"body": "test komenta",
				"added": 1551873091
			}
		],
		"1557820868_15C1QHgbZtqgBQm8DY9MLkftgND9CZbbNY": [
			{
				"comment_id": 2,
				"body": "> [tomasz21](#comment_112_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Jedno słowo'; Makabryczne.Oglądałem inną wersję, tego filmu. Inaczej trochę poukładane. Ale materiał jest ten sam. Powinni wieszać za jaja. Zresztą, bóg z betlejem, i jego wyznawcy zrobili wiele zła na ziemi. A dzisiejsi nauczyciele, dalej czynią zło i krzywdzą ludzi i dzieci. To jest wpisane w ich rytuał. Pod tym kontem tam się dobiera ludzi. Kiedyś spotkałem takiego księdza. Dopiero po czasie zrozumiałem o co tam biegało, po lekcji religii, poprosił paru chłopaków aby coś tam mu pomóc . Poszliśmy całą paczką, to był jego błąd; a nasze wybawienie. To nie są pojedyncze przypadki. Większość spraw nigdy nie ujrzała światła dziennego.\n\nJak sam pokazujesz , jest tego zła za dużo (współczuję) ... Kościoły powinny ucinać jaja każdemu księdzu przed przystąpieniem do ślubowań. Wtedy mniej by już ich było :D :D",
				"added": 1557837177
			},
			{
				"comment_id": 3,
				"body": "> [tomasz21](#comment_113_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Jest jeszcze jedna opcja; można ograniczyć, korzystanie z ich usług. Ale ludzie, niestety jak ćma do świeczki. Wleci i zostanie spalona. Może kiedyś zrozumieją? Albo nie zrozumieją. Watykan pomału się kończy. Jego dni są policzone. A u nas to , jeszcze będzie długo kultywowane.Pozdr.\n\nDobrze to ująłeś .... ciemnota w Polsce jest potężna . Na tym zeruje kościół i zarabia za razem.",
				"added": 1557896547
			},
			{
				"comment_id": 4,
				"body": "> [nooneimportant](#comment_1_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b): A ja od dzisiaj będę pomagał pedofilom\n\nRozumiem że jesteś dziecio lubem , chłopco lubem i pedo lubem .... przykre",
				"added": 1557982131
			}
		]
	},
	"comment_vote": {
		"112_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"113_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1
	}
}