{
	"next_comment_id": 16,
	"comment": [
		{
			"comment_id": 1,
			"body": "Я экспериментировал с автоматическим запросом на добавление зайта с файлами (тем более, что на ZeroUp минимум 10Мб, так что много интересного туда не заливается). В общем, почти добился, хотя были косяки в самой ZN, которые потом, вроде, исправили, но я не тестировал ещё :)\n\nhttp://127.0.0.1:43110/Me.Mkg20001.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1513511944\n\n(ссылка на ZeroMe Reloaded, а то у меня ZeroMe не работает ни на одном десктопе :D )",
			"post_id": 3,
			"date_added": 1522689083
		},
		{
			"comment_id": 2,
			"body": "> [geekless](#comment_2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Благодарю.\n> Если я правильно понял, с последними фиксами достаточно добавить просто page.cmd(\"corsPermission\", [\"1MyZeroUpClone\"]);\n\nМожет быть, ещё не проверял :)",
			"post_id": 3,
			"date_added": 1522725574
		},
		{
			"comment_id": 3,
			"body": "> [calmaquesse](#comment_2_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Так а как сам язык? Удобный?\n\nЯ пока совсем поверхностно на него смотрел. Но вообще не понял, нафига его придумали :) Ну, разве что как попытка отказаться от фигурных скобок в пользу питоновских отступов. Выглядит отвратительно, после JS — шило на мыло. Не менее (или даже более) внутренне не логичен, масса идентичных, но отличающихся конструкций. Мне показалось, что он впитал в себя недостатки JS, Python и Ruby :D\n\nНо это ХО, конечно. И я давно привык пользоваться тем, что дают, так что придётся на нём писать :)",
			"post_id": 11,
			"date_added": 1525372080
		},
		{
			"comment_id": 4,
			"body": "> [x86128](#comment_3_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Я раньше тоже думал что Python это верх лаконичности пока не увидел Ruby\n\nPerl всё равно лаконичнее :D\n\nОдна беда — лаконичность языка с какого-то момента часто обратно пропорциональна читаемости. Поэтому Perl (и во много — Ruby) — write-only языки :) Впрочем, как и Java и JavaScript — с другой. Там перекос в другую сторону.",
			"post_id": 18,
			"date_added": 1525938992
		},
		{
			"comment_id": 5,
			"body": "> [geekless](#comment_10_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если всем этим не злоупотреблять, язык хорошо читабелен.\n\nЕсли не злоупотреблять, то _любой_ язык (ну, кроме, может, Брейнфака и Уайтспейса :)) хорошо читабелен. Но человек слаб. И если язык позволяет писать грязно, то люди чаще всего так и пишут :)",
			"post_id": 18,
			"date_added": 1526015443
		},
		{
			"comment_id": 6,
			"body": "> [x86128](#comment_5_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Самое страшное, что такой код невозможно отлаживать в пошаговом режиме.\n\nИМХО, сильно зависит от концепции программирования. Например, Форт, в принципе, позволяет отлаживать код пошагово. Но этим почти никто никогда не пользуется. Т.е. один из принципов _Thinking Forth_ — использование очень коротких слов (так там называются синтаксические элементы — процедуры, функции, литералы, операторы и т.п.), состоящих из 7±2 составляющих слов. И такие слова очень просто отлаживать в интерактивном режиме. Подал на вход параметры, посмотрел результат. В итоге скорость разработки, по сравнению с ровесниками Форта без спец. IDE возрастала на порядок :) И надёжность получалась очень высокой, так как хорошим тоном считалось не использовать глобальные переменные, а всё передавать в параметрах.",
			"post_id": 18,
			"date_added": 1526015712
		},
		{
			"comment_id": 7,
			"body": "> [geekless](#comment_11_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Зато в то же время я кодил и на Ruby, и вот после Ruby жаваскрипт был реально боль.\n\nИМХО, JS боль после почти любого языка :D Я тут второй день по основной работе активно на низкоуровневом JS фронтенд пилю, задолбался крутить в циклах массивы, клонировать объекты и т.п. :)",
			"post_id": 18,
			"date_added": 1526015844
		},
		{
			"comment_id": 8,
			"body": "> [gitcenter](#comment_4_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Пытался когда-то что-то делать на Ruby, мозг сломал от обилия спецсимволов.\n\nВот я тоже с некоторых пор очень настороженно стал относиться к языкам с закорючками :) Хотя лет 25 назад был фанатом. Но длительная поддержка кода с такими языками становится болью, очень легко что-то зевнуть.\n\n…\n\nНо я на Ruby хотя бы ничего не пишу, не считая мелких правок. Вот на чём пишу и что иногда вводит в состояние изумления в плохом смысле слова — это Lua :D Вот тут немного концентрата на русском — http://ndtimofeev.github.io/ru/posts/2014-06-18-about-lua.html",
			"post_id": 18,
			"date_added": 1526016249
		},
		{
			"comment_id": 9,
			"body": "> [x86128](#comment_6_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Поэтому там пошагово отлаживать можно.\n\nТак и я пишу, что можно :) Но на практике с таким никогда не сталкивался. Ибо при обычных паттернах программирования оно не нужно. Слова в 5-9 других слов легко «отлаживаются в уме» :)\n\n> Если в одной функции беда, то портится стэк и программа ведет себя дальше не предсказуемо.\n\nДа. Но вероятность того, что после тестирования одного небольшого слова окажется, что оно в каких-то условиях не работает, очень мала.\n\n> но согласитесь чужой код там нечитаемый.\n\nЕсли это «Thinkig Forth», то не просто читаемый, а самодокументируемый :)\n\n> И если вдруг рефакторинг, то там этот ребус разгадывать крайне нудно.\n\nИ рефакторинг обычно выражается в простом переносе строк из одного файла в другой :D Это же кто-то из Форт-монстров (то ли Мур, то ли Броуди) сказал, что в редакторе настоящего программиста должна отсутствовать функция копирования текста :)\n\n> Цепочку map -> filter -> reduce пошагово не отладишь, я вот что имел ввиду, это в любом языке так.\n\nВ любом языке можно сделать пошаговую отладку, они же все в итоге на императивных CPU работают :) Но, конечно, функциональные языки отлаживать пошагово намного сложнее.",
			"post_id": 18,
			"date_added": 1526099138
		},
		{
			"comment_id": 10,
			"body": "> [x86128](#comment_7_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Я так понял на форте Вы много писали\n\nВ основном — в середине 1990-х :)\n\n> где то видел на форуме что движок (или часть) игры написана на форте?\n\nВ MMORPG Lineage II в нашей версии сервера скриптописание было на Форте. Я под это дело реализовал Java-версию, JBForth.\n\n> И как оно? Какие профиты были?\n\nТам главной причиной, по которой я вспомнил про Форт, было внутриигровое скриптописание. Т.е. часто возникала задача прямо внутри программы клиента в чате набросать или поправить какой-то скрипт. А это — исключительно одна строка текста :) Форт тут оказался просто незаменим. Ну а потом он много где в том проекте в качестве скриптового использовался, удобным инструментом оказался.",
			"post_id": 18,
			"date_added": 1526109420
		},
		{
			"comment_id": 11,
			"body": "Есть такое замечательное расширение: [The Great Suspender](https://chrome.google.com/webstore/detail/the-great-suspender/klbibkeccnjlkjkiokjodocebajanakg/)\n\nОна может через заданное время менять страницы на их скриншоты. Таб остаётся, изображение часто кривое получается, но обычно понятно, что там. Но памяти жрёт сразу в разы меньше :) При клике — открывает оригинал.",
			"post_id": 20,
			"date_added": 1526875358
		},
		{
			"comment_id": 12,
			"body": "> когда пользоваться торрентом стало реально опасно. \n\nСабж что, анонимен?",
			"post_id": 30,
			"date_added": 1535558728
		},
		{
			"comment_id": 13,
			"body": "> [geekless](#comment_24_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вообще я сегодня наверное плохо мысли выражаю\n\nОк, теперь мысль понял :) Но, вообще, анонимный торрент есть, называется RetroShare :) Но анонимность ОЧЕНЬ сильно ударяет по скорости. Откат в прошлое на 15 лет, когда надо сутки ждать, чтобы хороший фильм скачать :D",
			"post_id": 30,
			"date_added": 1535563057
		},
		{
			"comment_id": 14,
			"body": "> [anotherneko](#comment_6_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Вроде торрент, который встроен в i2p пошустрей будет. Или там тоже проблемы с анонимностью?\n\ni2p считается самым анонимным. Скорость у RS и i2p, ИМХО, одного порядка. Главная разница, что i2p — только транспорт. Хоть и с торрентами. Прочие фишки крайне кривы и почти не работают. А в RS почти полноценная социальная система — нормально работающие форумы, каналы, файловые публикации. Только что блогов нет, хотя в некоторой степени эту роль могут форумы выполнять :)",
			"post_id": 30,
			"date_added": 1535729955
		},
		{
			"comment_id": 15,
			"body": "У меня дочка на планшет ставила четырёхзначный пароль. И, ведь, не хитрый какой-то, ибо в 6 лет придумала. Пару лет планшетом пользовалась, потом год планшет валялся без дела, потом его решили сыну отдать, как раз подрос. Пароль так и не вспомнили :) Сброс до заводских настроек не работает ни в одном из описанных вариантов. Так теперь планшет и валяется кирпичом :)\n\nКопеечный китай, конечно (iRULU какой-то), но всё равно…",
			"post_id": 34,
			"date_added": 1539240347
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}