{"next_paste_id":1,"next_comment_id":0,"paste":[{"paste_id":0,"description":"65 Ensinamentos de Sun Tzu no Livro ‘A Arte da Guerra’","body":"1. A guerra é um assunto de importância vital para o Estado, o reino da vida ou da morte, o caminho para a sobrevivência ou a ruína. É indispensável estudá-la profundamente.\n\n2. Informação é crucial. Nunca vá para a batalha sem saber o que pode estar contra você.\n\n3. Aquele que conhece o inimigo e a si mesmo lutará cem batalhas sem perder; para aquele que não conhece o inimigo, mas conhece a si mesmo, as chances para a vitória ou derrota serão iguais; aquele que não conhece nem o inimigo e nem a si próprio será derrotado em todas as batalhas.\n\n4. Um líder lidera pelo exemplo, não pela força.\n\n5. Trate seus homens como filhos e eles o seguirão aos vales mais escuros. Trate-os como filhos queridos e eles o defenderão com a própria morte.\n\n6. A invencibilidade está na defesa; a possibilidade de vitória, no ataque. Quem se defende mostra que sua força é inadequada; quem ataca, mostra que ela é abundante.\n\n7. A vitória está reservada àqueles que estão dispostos a pagar o preço.\n\n8. Toda guerra é baseada em dissimulação. Por isso, quando capaz, finja ser incapaz; quando pronto, finja grande desespero; quando perto, finja estar longe; quando longe, faça acreditar que está próximo.\n\n9. A suprema arte da guerra é derrotar o inimigo sem lutar.\n\n10. Guerreiros vitoriosos vencem primeiro e, em seguida, vão para a guerra, enquanto guerreiros derrotados vão à guerra em primeiro lugar para depois buscarem a vitória.\n\n11. Existem cinco perigos que podem afetar um general: imprudência, que leva à destruição; covardia, que leva à captura; temperamento precipitado, que pode ser provocado por insultos; senso cego de honra, que é sensível à vergonha; excesso de solicitude para com seus homens, que os expõem a preocupação e angústia.\n\n12. Existem três maneiras de um governante trazer infortúnio à guerra: comandar o exército para avançar ou recuar ignorando o fato que não podem obedecer, e assim denegrir o exército; tentar governar o exército da mesma forma como administra o reino ignorando as condições para obtê-lo, e assim causar inquietação na mente dos soldados; empregar os oficiais do exército sem discriminação ignorando os princípios básicos de adaptação das circunstâncias, e assim abalar a confiança dos soldados.\n\n13. O combatente inteligente olha para o efeito combinado de energia e não necessita de tantos indivíduos assim. Daí sua capacidade de escolher os homens certos e utilizar da mesma energia combinada.\n\n14. Quando os soldados ficam muito encostados em suas lanças, estão fracos por falta de comida. Se aqueles que são enviados para pegar água bebem-na, o exército está sofrendo de sede.\n\n15. Estude cuidadosamente o bem-estar de seus homens, não os sobrecarregue. Concentre sua energia e acumule sua força. Mantenha seu exército continuamente em movimento, elabore planos insondáveis.\n\n16. Se você for indulgente, mas inábil para validar sua autoridade; bondoso, mas impotente para fazer valer os seus comandos; e incapaz, além disso, de lidar com a desordem, seus soldados podem ser comparados a crianças mimadas e serão inúteis para qualquer finalidade prática.\n\n17. Quando o general é fraco e sem autoridade, quando suas ordens não são claras e coesas, quando não existem regras fixas aos seus oficiais e quando as fileiras de homens são formadas de forma casual e desleixada, a consequência é a total desorganização.\n\n18. Quando os soldados comuns são demasiadamente fortes e os seus oficiais superiores muitos fracos, o resultado é insubordinação. Quando os oficiais superiores são muito fortes e os soldados comuns fracos demais, o resultado é colapso. Quando os oficiais superiores estão com raiva, insubordinados e atendem à batalha contra o inimigo por sua própria conta e risco a partir de um sentimento de ressentimento, antes que o comandante-chefe diga se estão ou não em condições de lutar, o resultado inevitável é a ruína.\n\n19. Existem cinco fatores que permitem que se preveja qual dos oponentes sairá vencedor: aquele que sabe quando deve ou não lutar; aquele que sabe como adotar a arte militar apropriada de acordo com a superioridade ou inferioridade de suas forças frente ao inimigo; aquele que sabe como manter seus superiores e subordinados unidos de acordo com suas propostas; aquele que está bem preparado e enfrenta um inimigo desprevenido e aquele que é um general sábio e capaz, em cujas decisões o soberano não interfere.\n\n20. Dos cinco elementos, nenhum é predominante. Das quatro estações, nenhuma dura para sempre. Os dias, uns são longos, outros curtos. A Lua enche e míngua. Também são assim os períodos de uma guerra.\n\n21. A água não tem forma constante. Na guerra também não há condições constantes. Por isso, é divino aquele que obtém uma vitória alterando as suas táticas em conformidade com a situação do inimigo.\n\n22. Se o seu oponente é de temperamento colérico, procure irritá-lo. Finja ser fraco, que ele vai se mostrar arrogante, e vulnerável.\n\n23. Há estradas que não devem ser seguidas, exércitos que não devem ser atacados, cidades que não devem ser sitiadas, posições que não devem ser contestadas e comandos do soberano que não devem ser obedecidos.\n\n24. O estrategista hábil é comparado a uma serpente encontrada nas montanhas. Ataque a cabeça e você será atacado por sua cauda; ataque a cauda e será atacado pela cabeça; ataque o meio e será atacado por ambos.\n\n25. Não basta fazer algo pelo simples bem de algo: certifique-se de que isso o ajude. Se é para a sua vantagem, faça um movimento para frente; se não, fique onde está.\n\n26. Não devemos fazer alianças com aqueles que estão familiarizados com nossos métodos.\n\n27. Não há mais de cinco notas musicais, mas as combinações destas cinco originam mais melodias do que pode ser ouvido. Não há mais de cinco cores primárias, mas em combinação elas produzem mais cores do que pode ser visto. Há não mais de cinco gostos palatáveis, ainda que suas combinações produzam mais sabores do que pode ser provado.\n\n28. Seremos incapazes de transformar vantagens naturais para uso a menos que façamos uso de guias locais.\n\n29. O governante esclarecido estabelece planos a seguir, e o bom general cultiva seus recursos.\n\n30. Em caso de perturbação no acampamento, a autoridade do general se mostra fraca. Se as faixas e bandeiras são deslocadas, sedição está acontecendo. Quando servos e ajudantes estão com raiva, isso significa que os soldados estão cansados.\n\n31. O general habilidoso conduz seu exército apenas como se estivesse levando um único homem, quer queira quer não, pela mão. Tal general também deve conceder recompensas sem precisar se pronunciar, e emitir ordens sem levar em conta os anteriores acordos.\n\n32. O verdadeiro método, quando se tem homens sob as nossas ordens, consiste em utilizar o avaro e o tolo, o sábio e o corajoso, e em dar a cada um a responsabilidade adequada.\n\n33. A habilidade de alcançar a vitória mudando e adaptando-se de acordo com o inimigo é chamada de genialidade.\n\n34. As oportunidades multiplicam-se à medida que são agarradas.\n\n35. Não estamos preparados para lidar com um exército em marcha a não ser que estejamos familiarizados com a geografia do local; suas montanhas e florestas, armadilhas e precipícios, pântanos e brejos.\n\n36. Seja sutil. Use seus espiões para cada tipo de negócio. Mas veja, tais espiões não podem ser geridos sem benevolência e frontalidade, pois sem ingenuidade mental não se pode ter certeza da veracidade de seus relatórios.\n\n37. Compare prudentemente o exército inimigo com o seu próprio, de modo que você possa saber onde a força é superabundante e onde é deficiente.\n\n38. Não ataque alguém só por estar magoado. Um general não deve colocar suas tropas em campo apenas para satisfazer seu próprio esplendor.\n\n39. Um bom comandante é benevolente e despreocupado com a fama.\n\n40. A qualidade da decisão é como a rusga de um falcão que lhe permite atacar e destruir sua vítima.\n\n41. No meio do caos há sempre uma oportunidade.\n\n42. Energia é o que tensiona o arco, decisão é o que solta a flecha.\n\n43. Comandar muitos é o mesmo que comandar poucos. Tudo é uma questão de organização.\n\n44. A arte da guerra nos ensina a não confiar na probabilidade de o inimigo não estar vindo, mas sim na nossa própria prontidão para recebê-lo; não sobre a possibilidade de ser atacado, mas sim no fato de que fizemos a nossa posição inatacável.\n\n45. Velocidade é a essência da guerra. Tire proveito do despreparo do seu inimigo, transforme seu caminho em rotas desesperadas e ataque nos sinais de descuido.\n\n46. Para conhecer o seu inimigo você deve tornar-se seu inimigo.\n\n47. O medo é o verdadeiro e único inimigo.\n\n48. Lembre-se: você é seu próprio general. Então, tome agora a iniciativa, planeje e marche decidido para a vitória.\n\n49. Para cada vitória sofremos uma derrota.\n\n50. A estratégia sem tática é o caminho mais lento para a vitória. Tática sem estratégia é o ruído antes da derrota.\n\n51. A vantagem estratégica desenvolvida por bons guerreiros é como o movimento de uma pedra rolando por uma montanha com 500 metros de altura. A força necessária é insignificante; o resultado, espetacular.\n\n52. Se numericamente és mais fraco, procura a retirada.\n\n53. Um general não deve empreender uma guerra num ataque de ira, nem deve enviar suas tropas num momento de indignação. Entenda que um homem que está enfurecido voltará a ser feliz, e aquele que está indignado voltará a ser honrado, mas um Estado que pereceu nunca poderá ser reavivado, nem um homem que morreu poderá ser ressuscitado.\n\n54. Deixe seus planos serem escuros e impenetráveis ​​como a noite e, quando você se mover, caia como um raio.\n\n55. Quando cercar o inimigo, deixe uma saída para ele, caso contrário, ele lutará até a morte.\n\n56. Não é preciso ter olhos abertos para ver o sol, nem ter ouvidos afiados para ouvir o trovão. Para ser vitorioso você deve enxergar o que não está visível.\n\n57. Se quisermos que a glória e o sucesso acompanhem nossas armas, jamais devemos perder de vista os seguintes fatores: a doutrina, o tempo, o espaço, o comando, a disciplina.\n\n58. Se não é vantajoso, nunca envie suas tropas; se não lhe rende ganhos, nunca utilize seus homens; se não é uma situação perigosa, nunca lute uma batalha precipitada.\n\n59. A água escolhe o seu percurso de acordo com o terreno que atravessa. O guerreiro busca a vitória de acordo com o inimigo que enfrenta.\n\n60. Concentre-se nos pontos fortes, reconheça as fraquezas, agarre as oportunidades e proteja-se contra as ameaças.\n\n61. Derrotar o inimigo em cem batalhas não é a excelência suprema; a excelência suprema consiste em vencer o inimigo sem ser preciso lutar.\n\n62. Não há exemplos de uma nação beneficiando-se da guerra prolongada.\n\n63. Só mudando a si mesmo o homem pode mudar o que está a sua volta. Se o pensamento não muda, o que vemos é o que temos visto pelo mundo afora: um império substituindo o outro, e um opressor sentando no trono sangrento de outro opressor. Enquanto o homem não muda a si mesmo, o que vemos é apenas escuridão e ranger de dentes.\n\n64. Evitar guerras é muito mais gratificante do que vencer mil batalhas.\n\n65. A vitória é o principal objetivo na guerra, mas o verdadeiro propósito da guerra é a paz.","language":"text/plain","encrypted":false,"added":1560308004}],"comment":[]}