{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1552575038,
			"title": "ShareTube Project",
			"body": "Just took another YouTube Clone to make my own version of a video sharing and broadcasting site. Feel free to comment and ask for \"stuff\".\n\n[ShareTube](/1Share3xUeAF71KTqcvFyfDu516kNDETx/)\n\nEvery suggestion is welcome as well as if anyone wishes to contribute with suggested pieces of code, images and icons.\n\nUpdate:\nJustifying the ad and donation unit: I intend to put work in this website, and if anyone wishes to contribute with a \"cup of coffee\" worth of donations or getting a couple dollars by ad income, it improves my morale and gives me a stronger desire to improve.\n\nAnd don't worry. I am not going to abuse users by overflowing the interface with ads or mining scripts. You can all state any objection here and if I find merit I act upon it.",
			"added": 1552575037
		},
		{
			"topic_id": 1557261503,
			"title": "Developing another 9Gag look-alike from scratch to learn more about ZeroNet coding",
			"body": "As some people might be aware, I've already attempted to adapt other webzites for my tastes but now I've decided to create one from scratch to develop skills in Zeronet programming.\n\n[ZeroFun](/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C/);\n\n# TODO:\n\n1. Delete button for comments\n1. Delete button for already downloaded posts\n1. trending session\n1. like/dislike buttons for comments\n1. subdivide into categories.\n1. page for individual users\n1. make a better looking layout.\n1. meme generator.\n\n# DONE(but with a couple bugs):\n\n1. Make optional to preload images and/or videos.\n1. delete button\n1. like/dislike counter\n1. Markdown compatible comment sections\n1. Hot Session\n1. Rewrite URL on Omnibox on Javascript navigation.\n1. restrict loaded posts per scroll.\n1. Give uploader option to tick \"Loop video\" on upload.\n1. Newsfeed integrated to posts.\n1. Prevent files from autodownloading\n\nI welcome any suggestion regarding layout.",
			"added": 1557261500
		},
		{
			"topic_id": 1557431373,
			"title": "Can someone with expertise in Firefox/Chrome plugins develop a URL rewriter?",
			"body": "I don't think it might be too difficult as it poses no security threat or uses excessively complicated coding. The only thing I would like it to do is to name the protocol in the place of the IP/Port of the localhost HTTP server.\n\nExample:\nMy webzite that happens to be\n\n[http://127.0.0.1:43110/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C](http://127.0.0.1:43110/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C) \n\nwould become just \n\n[zero://1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C](/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C).\n\nIt is actually not that useful as it would be just for esthetic purposes.\n\n### From a Reply:\nAnother suggestion would be to call it ``zap://`` instead of ``zero://``, as being the acronym to *Zeronet Access Protocol*.\n\nOther options can be ``zhttp://``, ``httpz://``, ``zw://``(*zeroweb*), ``zwap://``(*Zeronet Web Access Protocol*), etc...",
			"added": 1557431369
		}
	],
	"topic_vote": {
		"1552495966_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"1552623438_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"1554477808_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1555419112_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": 1,
		"1555468864_15goYtrPd2KrFgP91i8ZH88gbjYfQB7n9L": 1,
		"1555519409_1GPcQGyxZgHrA7mBwgPSGqSgBVRJmvRdi2": 1,
		"1556106580_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1563945520_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565296763_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX": 1,
		"1565731313_1B7S39qDssqWy7EJiKzhRboCyLGg2Auj4F": 1,
		"1566943829_16d7z17EBBMxJGH51mdT51jwrHtCLsLNeo": 1,
		"1568656823_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"1570196788_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1572423224_1K6oaTYB17miXmrQJQFFKss1Qg4mBox1Lr": 1
	},
	"next_comment_id": 78,
	"comment": {
		"1552575038_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_708_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): what is ur zite address? what kind of stuff you are going to post on it? Why not post it directly on Youtube zite to get better exposure?\n\n1 - http://127.0.0.1:43110/1Share3xUeAF71KTqcvFyfDu516kNDETx/\n2 - I'll allow anything people wish to post on it.\n3 - There are thing I didn't like regarding the YouTube Zite so I want to make an experiment regarding improvements I could make on it.",
				"added": 1552581495
			},
			{
				"comment_id": 2,
				"body": "> [robione](#comment_189_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Dark mode is nice, but the top bar must go dark too.The next issue is the animated gif, it is so distracting, it needs to go.\n\nThe distracting GIF is going away now. I hated it too, but I was trying to find a way to get a thumbnail from the beginning of the video instead of using a \"default image\";\n\nTop Bar going dark in a few minutes.",
				"added": 1552593582
			},
			{
				"comment_id": 3,
				"body": "> [robione](#comment_192_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): When in dark mode, the thumbs can't be bright white either. Need to shade them heavily or some other transformation that keeps them useful but not a needle in your eye.\n\nDone.",
				"added": 1552656558
			},
			{
				"comment_id": 5,
				"body": "> [klu9](#comment_99_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Doesn't work for me in Vivaldi or Firefox (which says \"No video with supported format and MIME type found.\") [...]\n\n1 - Strange. It works in Firefox here.\n2 - Working on it.\n3 - It was the first I got. But I am taking parts of KopyKate as well.",
				"added": 1552657414
			},
			{
				"comment_id": 6,
				"body": "> [lavaphox](#comment_10_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): vid Moloch works here on firefox, but the dark mode is pure black :P cant see a thing, maybe cause i like white mode more, yesterday it were more like grey +1 for that.\n\nStrange. Just looked into it on Firefox and played fine here. It might be unrefreshed code. Try to refresh the page. If it keeps happening, tell me.",
				"added": 1552662048
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Please convert the SVG icons to data URI or base64. [...]\n\nWill do it soon. Thank you for reporting.",
				"added": 1552682341
			},
			{
				"comment_id": 8,
				"body": "> [robione](#comment_195_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): there is 1 more flickering youtube image.. any reason?\n\nRemoved that GIF from the default thumbnail, but that video was uploaded before that. I'm going to soon remove definitely as I get my thumbnail maker ready.",
				"added": 1552691850
			},
			{
				"comment_id": 9,
				"body": "> [klu9](#comment_101_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Feature request: uploader- or user-generated tags / categories: e.g. film, TV show, news, clip, home video etc.\n\nIs already on my list.",
				"added": 1552691875
			},
			{
				"comment_id": 10,
				"body": "> [ssdifnskdjfnsdjk](#comment_714_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @sharer: regarding thumbnail creator - i am not a coder, but here are two pages that seem to contain relevant info.:https://usefulangle.com/post/46/javascript-get-video-thumbnail-image-jpeg-pnghttps://stackoverflow.com/questions/23640869/create-thumbnail-from-video-file-via-file-input\n\nAlready tried the * **canvas** to **img** capture*. Didn't work. I guess it might be due to the  multiple **iframe**s in zeronet's HTMLs. I managed to capture the frame to the **canvas**, but not from **canvas** to **img**. It might be because it captures the **canvas** frame before it is loaded in place by the previous step. I am looking for an event in *javascript* that could be triggered only after the **canvas** has the frame fully loaded.",
				"added": 1552830228
			},
			{
				"comment_id": 11,
				"body": "> [ssdifnskdjfnsdjk](#comment_714_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @sharer: regarding thumbnail creator - i am not a coder, but here are two pages that seem to contain relevant info.:https://usefulangle.com/post/46/javascript-get-video-thumbnail-image-jpeg-pnghttps://stackoverflow.com/questions/23640869/create-thumbnail-from-video-file-via-file-input\n\nI am not being able to do that due to CORS permissions.",
				"added": 1552940028
			},
			{
				"comment_id": 12,
				"body": "Right now I am redoing some stuff in order to improve the website as I learn more about Zeronet development.\nI intend to later create many more resources, like the possibility to auto-download all videos once you subscribe to someone.",
				"added": 1553022629
			},
			{
				"comment_id": 13,
				"body": "> [krixano](#comment_674_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Right - I didn't say he wasn't, and I already know he is (putting in effort) and I'm definitely happy that he's not just copying KopyKate. I was just saying the cloning credit should go to KopyKate, not to YouTube. [...]\n\nGood to see you guys are enjoying my effort to create a better video hosting website. I have a lot of ideas but I am too newbie in Zeronet matters so I am learning how to do so while I improve the website.\n\nI intend to better organize Sharetube libraries so people can get things they want.\n\nSorry for eventual misspellings as English is not my firs language and I just drank over 1 liter of red wine.",
				"added": 1553401808
			},
			{
				"comment_id": 14,
				"body": "> [passive](#comment_2_1Kxk87x9mZTtjmQuF1ptMfcjvCp6Y4oTEv): I'm surprised that I didn't notice the disclaimer. Thank you for the quick response.\n\nIt is an optional feature for those who wish to make a small donation in the future as a gratitude gesture. It remains off if you don't click the \"START\" button.",
				"added": 1553490578
			},
			{
				"comment_id": 15,
				"body": "> [robione](#comment_205_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Ugh, the russian video still has that flickering thumbnail.  [...]\n\nDone.",
				"added": 1553696074
			},
			{
				"comment_id": 17,
				"body": "Just finished database to video evaluation. Going to put a subtitle editor as well.",
				"added": 1554235578
			},
			{
				"comment_id": 18,
				"body": "> [nickwa](#comment_81_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): If you cannot handle dissenting opinions, either block me, or get off ZeroNet. I will not be the last to criticize your zite. Even just having the words \"please disable adblock\", will raise eyebrows from other people.\n\nI have no problem with criticism when it is fair. But you are complaining about something that it is **OPTIONAL** as in I don't force people to donate CPU time and the frame is disabled by default until you click the \"**START**\" button. And it stops automatically every time the user changes the page. Your complaint sounds like I mine *XMR* in a hidden way, such criticism is unfair as it is disclosed in the *Minero* frame with the *start* button that happens to be disabled by default.\n\nAnd why do you thing I can't handle dissenting opinions by just pointing out your criticism is **BULLSHIT**? I can handle bullshit and I have the same right to point out your criticism as unfair as you have to criticize me.",
				"added": 1554291942
			},
			{
				"comment_id": 19,
				"body": "After considering what happens when some untrusting stranger visits this zite, I decided to put the whole script to load with the button instead of loading the .js with the zite. So there will be not even the mining script ready until the user pushes the donation button.",
				"added": 1554292789
			},
			{
				"comment_id": 21,
				"body": "> [nickwa2](#comment_1_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84): (Had to create another user, since I hit my limit, just for this) Look im sorry if I ever attacked you in anyway, I am just iffy on any \"mining\" js file, unless its a offical company or organization. You are probably not mischievous, but what if someone else is? It is why I jumped the gun. Also, I did some assumptions on you not wanting to take criticism.\n\n[https://i.imgur.com/vEu0Uqp.gif](https://i.imgur.com/vEu0Uqp.gif)\n\nAlso, if you like to contribute with a couple pennies, here are the addresses:\n\nBTC(obviously): [1Share3xUeAF71KTqcvFyfDu516kNDETx](https://www.blockchain.com/btc/address/1Share3xUeAF71KTqcvFyfDu516kNDETx)\n\nXMR: 46QXkwCizqYYo7VsyHNs37GtDBDTs48pCRMtSNa34ojhRv21tWKbTBzKDBadDtaGAFggyRWvk9zbzKMFqkapG23QM6mqdJw\n\nPS: Donations in BTC should come with a memo requesting a feature you wish on this website and criticism/suggestions.",
				"added": 1554315214
			},
			{
				"comment_id": 22,
				"body": "> [nickwa2](#comment_4_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84): (That meme was funny by the way) Also, alright.\n\nHere is something you might enjoy according to the people you seem to follow on Minds.com: [Antifas...](http://127.0.0.1:43110/1Share3xUeAF71KTqcvFyfDu516kNDETx/?watch=1554229659_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P)",
				"added": 1554316079
			},
			{
				"comment_id": 23,
				"body": "managed to put the mining script back to be also loaded by the user's wishes.",
				"added": 1554395667
			},
			{
				"comment_id": 24,
				"body": "Guys. Guys. There is no need to argue further about the subject as despite what happened,. @nickwa pointed out a real issue with the \"donate CPU\" button as it wouldn't be neither first nor last to trigger security software.\n\nIf I could forgive the man who took half my face and broke my jaw in 3 places I can forgive the misunderstanding that happened here this week(don't ask more details as it would jeopardize my anonymity here).\n\nBy the way, I would like for more people to point out flaws with this zite so I can know what is wrong with it.",
				"added": 1554398764
			},
			{
				"comment_id": 25,
				"body": "> [krixano](#comment_726_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I'd like to point out that the point I was trying to make wasn't about the validity of the issue, but rather how that issue was expressed.\n\nThank you for acting in defense of this project, my friend.\n\nI agree with you that it was very wrong by @nickwa to go on full-attack-mode as soon as he saw the mining script. But he later retracted himself and apologized for his misjudgement by his own initiative.",
				"added": 1554407147
			},
			{
				"comment_id": 27,
				"body": "Made some good steps towards subtitles today in the \"[transanime](http://127.0.0.1:43110/1Share3xUeAF71KTqcvFyfDu516kNDETx/?watch=1554235724_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P)\" video.\n\nI'll try to create also a subtitle editing tool that allows other users to suggest their own versions to be approved by the OP.",
				"added": 1554907092
			},
			{
				"comment_id": 35,
				"body": "> [quantumworld](#comment_395_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I cant upload any videos. It Crashes the tab.\n\nI took most code from other webzites and adapted to learn how to do proper Zeronet programming. Right now I am studying Zeronet coding with a webzite I created from **Zero**(*net?*).\n\nI think the issue might have to do with the hashing calculation I thought was important back when I started. Going to remove it as soon as I can.",
				"added": 1557147500
			},
			{
				"comment_id": 36,
				"body": "> [quantumworld](#comment_406_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): sharer: I really like the look of your site. Really good color combinations that pop out. Just the back end is a little messed up. The kaffie video site is really good but that 25k thumbnail size limit is a pain in the ass to make. Somewhere some one has a thumbnail generating script file that works on everything that will auto generate thumbnails. This sounds so trivial but my average video upload I waste more time making a dam thumbnail than the video upload. Portions of Zeronet remind me of the early days of Linux. Before there was a gui for Linux. Remember everyone here is on the ground floor of a super huge p2p network that is currently expanding. There will be a demand for web developers here on Zeronet by companies from around the world. I actually like Zeronet more than the regular web. Zeronet is 30+ gig strong and growing daily.\n\nActually the Thumbnail generator I had to do from scratch and still found it to be too basic. I also made a version where it generates 5 thumbnails from 10 seconds apart interval frames(or less if the video is too short) and switch the thumbnails every 5 seconds for every video.\n\nI am trying to create a profitable free-of-charge service here, so I am also trying to find a way to either advertise using a-ads or play a >10% CPU mining script under consent of the user.\n\nAlso, I am currently working more on my [other website](/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C/) that I am using to learn more about Zeronet coding as I am developing it all from scratch instead of just modifying another website.",
				"added": 1557168926
			}
		],
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 4,
				"body": "As evil as it can be, I still defend the right to information:\n\nhttp://127.0.0.1:43110/1Share3xUeAF71KTqcvFyfDu516kNDETx/?watch=1552627778_1HUrXNQjRheQouoqpwcxoxokEBTyvFeq1M",
				"added": 1552656969
			}
		],
		"1554128617_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 16,
				"body": "Right now I am developing a video hosting website with a small ad banner: [ShareTube](/1Share3xUeAF71KTqcvFyfDu516kNDETx/).",
				"added": 1554144324
			}
		],
		"1554309286_15xzQzPrA8KgEdqhVBnNvhtL6cWPaDTttG": [
			{
				"comment_id": 20,
				"body": "Feel free to post it [here](/1Share3xUeAF71KTqcvFyfDu516kNDETx/) as well.",
				"added": 1554313899
			}
		],
		"1554718004_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 26,
				"body": "Is Zeronet a blockchain?",
				"added": 1554730382
			}
		],
		"1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w": [
			{
				"comment_id": 28,
				"body": "You can create your own site and put the files there.\nIs a little hard in the beginning, but you soon learn a lot about Javascript in the process.",
				"added": 1555523923
			}
		],
		"1556106580_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 29,
				"body": "> [moor](#comment_118_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): On your zite click and drag to the left the zeronet button, there's an option to rebuild your database. i'm not sure if that's what you asking though =D\n\nActually, no. My issue is with the database not updating automatically after it's creation \n\n> [glightstar](#comment_112_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): You need to add a file called dbschema.json to your zite's root, on which documentation can be found here (zeronet.io/docs).If this file is not present, then the database will not be populated. [...]\n\nAlready checked my dbschema but couldn't find what's wrong with it.\n\nThe zite creates the Database at first according to dbschema rules and links but then it doesn't update it when I post something as user, forcing me to rebuild the whole database to see new posts.",
				"added": 1556111586
			},
			{
				"comment_id": 31,
				"body": "> [gitcenter](#comment_429_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): How do you update the database? Do you update the data.json file?\n\nyes\n\n> If you do, do you sign it then?\n\nI think so\n```\nreturn page.cmd(\"fileWrite\", [inner_path, fileEncode(res)], function (res) {\n                return page.cmd(\"siteSign\", {\n                    inner_path: inner_path,\n                    privatekey : null\n                }, function (res) {\n                    console.log(res);\n                    return cb();\n                });\n            });\n```\n\n> If you do sign it, do you sign it correctly with null privatekey (the default value is not null)? If you do, is the correct auth provider mentioned in data/users/content.json?\n\n```\n \"user_contents\": {\n  \"cert_signers\": {\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]\n  },...\n```",
				"added": 1556131421
			},
			{
				"comment_id": 32,
				"body": "> [kxobot](#comment_1_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): I know I have had a problem before when either not making sure I change the schema_changed fields after modifying the dbschema file, or using 0 for schema_changed. Not sure if that's what your problem is though.\n\nDid a \"trick\" by incrementing the value every time I post something as a user. This way makes the database work, but is not a functional solution.",
				"added": 1556198522
			},
			{
				"comment_id": 34,
				"body": "> [gitcenter](#comment_438_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ZeroMail should work, maybe it just haven't completely downloaded yet.\n\nThanks for everything, but I found it and it was indeed a misspelled column on my dbschema file. I will delete this topic soon.",
				"added": 1556283276
			}
		],
		"1557278450_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 38,
				"body": "> [kxobot@kxoid.bit](#comment_35_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): YouTube is a clone of KopyKate BIG. KopyKate Big is the original and more established here.Anyways, neither are being developed afaik. [...]\n\nThanks for mentioning [ShareTube](/1Share3xUeAF71KTqcvFyfDu516kNDETx/), I am also currently working on [a multiblog](/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C/) where you can post memes and stuff.",
				"added": 1557316222
			}
		],
		"1556966006_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 39,
				"body": "There is a thumbnail maker in the source code of [ShareTube](/1Share3xUeAF71KTqcvFyfDu516kNDETx/). More specifically in the line 448 of the [selector.js](/1Share3xUeAF71KTqcvFyfDu516kNDETx/js/selector.js) file. Sorry for the mess my source code is. I'm still learning how to Zeronet.",
				"added": 1557316470
			}
		],
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 40,
				"body": "> [fantoski](#comment_22_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Well now you've got some stuff to read lol, you're welcome.\n\nDon't forget to also share your own.",
				"added": 1557375402
			},
			{
				"comment_id": 41,
				"body": "Just added an income source for small revenue. Going to put 2 more tops in places that will not jump over the user.",
				"added": 1557430500
			},
			{
				"comment_id": 44,
				"body": "> [ssdifnskdjfnsdjk](#comment_830_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): kxoid = Content publish failed\n\nI am currently using zeroid only, but I'm going to add more soon.",
				"added": 1557491228
			},
			{
				"comment_id": 46,
				"body": "> [klu9](#comment_164_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Not sure how hard these would be but:Feature requests [...]\n\n> *when uploading a video, give uploader the option to tick \"Loop video\".*\nYour suggestion just went to the list.\n\n> *\"Follow\" option for ZeroFun as a whole and/or individual posts (e.g. see if a comment has been made on a post)*\nIt is exactly what I am researching right now. But will put it on the list as well\n\n> *Make it stand out more when a post has comments (not sure how: maybe bolding, colours, a star or something)*\nAlready creating a \"most commented\" session, although I might insert most commented in the \"*hot*\" query. Already put timestamp there, making older posts with more likes stand out more than newer ones with fewer likes.\n\nFor now the formula I'm using is ``posting_day + (likes - 5*dislikes)``, which means a post from 2 days ago with 3 likes will be shown over a post made today with zero likes. As it is unusual for people to dislike, as seems to be done only when a post is seriously awful, i put it in a factor to multiply dislikes by 5. I am thinking about decrease to 2 and add comments to the formula, making it ``posting_day + (likes - 2*dislikes) + 2 * sum(comments_with_positive_ratio)``, as I intend to also put like/dislike buttons on comments.",
				"added": 1557513886
			},
			{
				"comment_id": 47,
				"body": "> [klu9](#comment_164_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Make it stand out more when a post has comments (not sure how: maybe bolding, colours, a star or something)\n\nDONE: ``posting_day + (2*likes - 5*dislikes) + 4 * sum(comments_with_positive_ratio)``.",
				"added": 1557515193
			},
			{
				"comment_id": 48,
				"body": "> [klu9](#comment_164_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): when uploading a video, give uploader the option to tick \"Loop video\".\n\nDone.",
				"added": 1557519203
			},
			{
				"comment_id": 49,
				"body": "> [klu9](#comment_167_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): I just got an unspecified \"Not Implemented\" message when posting a comment here. Maybe it was because I put asterisks around a word to emphasize it?\n\nSorry. Forgot to remove this message.",
				"added": 1557774151
			},
			{
				"comment_id": 50,
				"body": "Newsfeed installed for posts. Working on comments and mentions.",
				"added": 1557938610
			},
			{
				"comment_id": 53,
				"body": "Made download optional. Now let's refine the process to allow autodownload for those wishing to do so.",
				"added": 1558120593
			},
			{
				"comment_id": 58,
				"body": "> [kropptyler](#comment_12_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr): @klu9 I was thinking that perhaps banning would be useful. On another note, they would also be downvoted more if they take forever to load for people, getting down-ranked, and filesizes could be shown before opting to download (when implemented). So while I think banning is an option, there are others, too.\n\nInstead of banning, just downvote. As I putted before, a downvote will worth at least 5 times an upvote as people don't downvote slightly bad stuff, but mostly outrageous things.",
				"added": 1558375591
			},
			{
				"comment_id": 59,
				"body": "Created a mining machine that doesn't autoload scripts. I intend to make a small profit by donations and share with other creators when the project gets finished according to criteria I will still establish.",
				"added": 1558729356
			},
			{
				"comment_id": 60,
				"body": "> [quantumworld](#comment_462_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): My problem with mining is that it steals to much cpu time on older equipment that is running Zeronet. Several times I have seen some Zeronet site that was just sucking up 100% cpu time on here. I have to block sites like that on my end. Also Zeronet mining on the phone app would be very bad on cell phone processors as well. Its just something to think about when you design your site. I like the idea of mining but hate the implementation of it on old systems.\n\nThat's the reason why the \"Mining Machine\" only loads when asked to.",
				"added": 1558896899
			},
			{
				"comment_id": 61,
				"body": "> [quantumworld](#comment_472_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Thats cool. I have already removed 30+ mining sites that have sucked over 99% of my cpu usage and put on my ban list. I have a 4 core system here and I just wont put up with a cpu sucker being shared from my system to others. An option to use it is fine. I need a 64 core system with minimum of 128 gig of ram for the stuff I am trying to do now.\n\nThe problem is not with mining as replacement to ads, but to mining being abused. I once thought about putting a warning before loading the website on the regular Internet regarding mining scripts running in the back of the website, putting it to use no more than 10% of 1 core and single stance(that means only one miner can be working at anytime regardless of how many open tabs you have).\n\nToo bad abusers began to inject full-force mining script on their websites in a way that annoys visitors and without warnings  or opt-outs.\n\nI wish there were some variation of Cryptonight algorithm that would \"*force*\" the \"*single thread 90% idle CPU*\" so we would have some sort of alternative to ads and donations. Cryptonight was already created with the intention of making dedicated mining hardware useless against CPU mining.",
				"added": 1559054618
			},
			{
				"comment_id": 67,
				"body": "> [ssdifnskdjfnsdjk](#comment_864_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @sharer: sorry if this was asked already. when i loaded your site a new, i found only top menu bar was loading, no content, then later content appeared, but no images appears. I have to click \"Download Content\" link and i think the site should automaticaly load the images..\n\nWorking on it",
				"added": 1568810638
			},
			{
				"comment_id": 68,
				"body": "Making some tests with Dark Mode now",
				"added": 1568919194
			},
			{
				"comment_id": 73,
				"body": "> [ssdifnskdjfnsdjk](#comment_932_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @sharer@zeroid.bit: i see the dark mode. Background is dark, text is black (i hardly can see the text in the top menu).\n\nFixed(I think).\n\n> The web browser developer console shows errors:unreachable code after return statement - page.js:4:8\n\nJust ignore it. I put it there to do an \"*uncommented commented code*\" to the stuff after it.",
				"added": 1570017464
			},
			{
				"comment_id": 75,
				"body": "> [ssdifnskdjfnsdjk](#comment_943_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @sharer:Someone added many \"spam\" posts:No TitlePosted by alfao@zeroid.bitwondering how the site can deal with this. Ideas:A) If post gets 2 downvotes and no upvotes (score: -2) it gets hidden for all users (kind of community moderation)B) next to each posts on the list of posts are button to hide post or hide all posts of a userC) work around is to mute user on all zeronet sites (not ideal solution)\n\nGood ideas.\nAs soon as I have some sparer time I'll implement it.\n\nI would go further and add a few changes\n\nPost is hidden under the conditions:\n- Over 10 downvotes\n- Downvotes over 10 times upvotes or no upvotes.\n\n\nOr I can create a flag button and set the rule for 2 flags and no upvote. I'll think about it a little bit more.",
				"added": 1574301458
			}
		],
		"1557431373_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 42,
				"body": "> [duende](#comment_45_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, retard.\n\nAfter you",
				"added": 1557491026
			},
			{
				"comment_id": 43,
				"body": "> [anonymouslogin](#comment_282_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): There is another way to think about this. If Mozilla realized a security threat and need to take this action to protect users......I think Mozilla didn't \"lose\" to Google. They are fighting the good fight. Give time.\n\nThat's what I hope.",
				"added": 1557491046
			},
			{
				"comment_id": 45,
				"body": "> [filips](#comment_20_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Currently, there is no such plugin. And this is currently better. So, is someone is building such plugin please wait until it would be standard by ZeroNet. [...]\n\nAnother suggestion would be to call it ``zap://`` instead of ``zero://``, as being the acronym to *Zeronet Access Protocol*.\n\nOther options can be ``zhttp://``, ``httpz://``, ``zw://``(*zeroweb*), ``zwap://``(*Zeronet Web Access Protocol*), etc...",
				"added": 1557505885
			}
		],
		"1557968684_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 51,
				"body": "Do you like [mine](/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C/)?",
				"added": 1557969405
			},
			{
				"comment_id": 52,
				"body": "As [I told](/Talk.ZeroNetwork.bit/?Topic:1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P/Developing+another+9Gag+look+alike+from+scratch+to+learn+more+about+ZeroNet+coding) it's a work under development. Loading on-demand is one of the things I'm working on right now.",
				"added": 1557969851
			},
			{
				"comment_id": 54,
				"body": "> [duck0](#comment_68_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Awesome, ping me when that gets implemented and I might be interested.  [...]\n\nDone.\n\n> [anal](#comment_3_1DSnM3xHWxHbkHCADMTfhvXMfZDE34vwQJ): WTF there are ads on it ? What kindda server cost do you need to cover ??\n\nIt is a small personal profit as I am the one doing the maintenance of this zite, fixing bugs and stuff. Only a clock works for free in this world.\n\nZeronet needs to be profitable to be widely adopted, otherwise we will for ever depend on people who develop applications over this platform \"for love\".\n\nAnyone can have a webzite here as a hobby, but I see potential here for something that can make me dedicate my skills as full time work and not only as pastime.",
				"added": 1558121403
			},
			{
				"comment_id": 55,
				"body": "> [bananon](#comment_13_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW): I haven't spotted the adds before because of my add and script blockers.  [...]\n\nOK then. Next time I update it I'll set a mining script to be included by Javascript if the user wishes to contribute and remove those ads. When I tried the optional mining script for donations on my ShareTube Project, I've been accused of spreading malwares even though the script was engaged only if the user clicks in \"donate CPU\" at the bottom-left corner of the page.",
				"added": 1558226307
			},
			{
				"comment_id": 57,
				"body": "> [duck0](#comment_70_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Fork and remove ads :^]\n\nAds removed.",
				"added": 1558357073
			}
		],
		"1558282143_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 56,
				"body": "This could be a good thing for advanced conversions in video hosting websites but is an open door to malwares.",
				"added": 1558356969
			}
		],
		"1559768099_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 62,
				"body": "> [install](#comment_29_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN): Done\n\nSorry I am not updating my zites lately. I am not very well right now in my health.",
				"added": 1560049121
			}
		],
		"1568118783_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF": [
			{
				"comment_id": 63,
				"body": "I rather ignore trolls than mute them. I don't like muting people.",
				"added": 1568121889
			}
		],
		"1568070326_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 64,
				"body": "It only uses BitCoin wallet signature to validate webzites. It has no blockchain attached.",
				"added": 1568122606
			}
		],
		"1568656823_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 65,
				"body": "I created a WebZite called [ZeroFun](/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C/) with the intention of be a place for meme sharing and other stuff. Tried to set A-Ads banners, but I was criticized because no matter how anonymous is the A-Ads, they can always start tracking people. So I set a Monero Mining Machine, but this was also a no-no even though the user had to manually activate it the first time. Now the Monero Mining Machine is still there, but it only gets added to the page by the user request as well as start mining. This makes it possible to avoid getting put on black-lists since the mining script is not there to be detected and only gets there if the user requests it.",
				"added": 1568660212
			},
			{
				"comment_id": 66,
				"body": "> [filips](#comment_198_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I personally think that mining script is more user and privacy friendly than ads, if it is opt-in by user and configurable how much CPU does it use.\n\nJust take a look on my  [ZeroFun](/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C/) Zite. It is pretty incomplete, but that's because I did it just to learn how to create a Zite from Zero.\n\nThe mining machine is in the *Hamburger Button*.",
				"added": 1568661718
			}
		],
		"1569297597_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 69,
				"body": "About China: watch the final video of [this Zite](/1TechgqQHqAjmKKQunAJqaritGH9mWNQS/).",
				"added": 1569334556
			}
		],
		"1567252307_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [],
		"1569427205_1A1k72VXvb6h2eST6JV2kLS55PeEB6X5Eh": [
			{
				"comment_id": 71,
				"body": "Hello 1231412421345213.\n[Visit my WebZite](/1ZGagD38ypjSoUrpNEGaPFmAMKFcdud7C/) if you want to.",
				"added": 1569430478
			}
		],
		"1569810770_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 72,
				"body": "[Just take a look on this.](/1TechgqQHqAjmKKQunAJqaritGH9mWNQS/)",
				"added": 1569846188
			}
		],
		"1570177598_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 74,
				"body": "> Do you love women feet?\nNo",
				"added": 1570210232
			}
		],
		"1574289293_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 76,
				"body": "https://www.youtube.com/watch?v=P-1xHglORp0",
				"added": 1574345042
			},
			{
				"comment_id": 77,
				"body": "[1TechgqQHqAjmKKQunAJqaritGH9mWNQS](/1TechgqQHqAjmKKQunAJqaritGH9mWNQS/)",
				"added": 1574353602
			}
		]
	},
	"comment_vote": {
		"19_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"579_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"189_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"190_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"192_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"99_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"709_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"10_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"728_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"733_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"673_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"615_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"674_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"205_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"3_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"828_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"734_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"4_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"1_13YSmU87abZ76qH9YFgJtWeGYwiRaCnUqz": 1,
		"125_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"103_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"395_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"16_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"19_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"282_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"20_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"119_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"165_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"12_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr": 1,
		"838_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"864_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"20_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL": 1,
		"194_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1_1J2neYJNrzJ1chRDErZ9fUeKQJJmKcApDh": 1,
		"41_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"21_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"1065_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1CfLMRZ18c2Xq3RXVvrfEHE1oE3KkPvbRa": 1,
		"29_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"73_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"932_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"933_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"943_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}