{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565671836_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1
	},
	"next_comment_id": 3,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "tank about it",
				"added": 1565590925
			}
		],
		"1565677132_19ouxiGbVPzjqbCeAWLx4udeggoUsfEhdV": [
			{
				"comment_id": 2,
				"body": "Not sure which Freenet you are referring to, but if the original one you used a modem to connect to before you could Telnet to it (it was not on the Internet originally), this is a little more advanced.  lol\n\nYet, there is a lot about ZN that reminds me of the early Internet days, when everyone had a public static IP, people were migrating from an individual hosting \"P2P/Mesh\" community (BBS/Fidonet), everyone shared code by default to help people out (no lawyers or corporations), and everyone felt part of innovation, a contributor.  It probably didn't hurt that a lot of the population connected through colleges.  \n\nIn many ways, as the Internet advanced, it also regressed from it's original purpose.  While I like NAT for ease of security management, that has always created hurdles too high for the average Internet user to learn how to host, resulting in large central dependencies.  While there has clearly been innovation (e.g., Google Apps), we can only wonder how innovation would of looked like if that culture of everyone hosting and joining and building on community infrastructure.  \n\n**NetZero is a potential rebirth of that early Internet culture!**  \n\nHistorical regressions putting centralization over individual contribution include:\n\n- DHCP instead of Static via ISP (harder to host servers)\n- asymmetric Internet (limiting upload bandwidth)\n- ISP Terms of Service (when Google first release Gigabit Internet in Kansas City, which was symmetric, everyone thought the limitations were finally removed.  Then they had a prohibition on running servers in their TOS.  Soon as that got to slashdot.org, it became a public relations nitemare, and they removed it)\n- ISP port blocking\n\nSo while tech companies continued to innovate, P2P has been put on hold until people like @nofish and other creators of ZeroNet could create something smart enough to empower the individual and remove the friction created.",
				"added": 1565679628
			}
		]
	},
	"comment_vote": {}
}