{
	"title": "彩虹之家",
	"description": "彩虹之家包括生活随笔、建站心得和基层工作总结！",
	"links": "<a href=\"http://caihongzhijia.com/\"target=\"_blank\">免zeronet访问彩虹之家</a>",
	"next_post_id": 33,
	"demo": false,
	"modified": 1467208923,
	"post": [
		{
			"post_id": 32,
			"title": "日本岛国的妹子眼中，什么样的行为算劈腿 ",
			"date_published": 1467208884.986,
			"body": "劈腿！一个让所有的妹子都觉得憎恶的词汇。最近国内明星们的劈腿事件也挺热闹，就不点名了。劈腿固然是不好的行为，我们严厉抵制男人的劈腿行为。 \n\n日本妹子生活在水深火热之中，按理说也不用我们操心，只是她们分析出的“男人出轨行为”多少有些参考价值： \n\n来自日本网站对1038位年轻女性展开问卷调查，总结出了“劈腿行为排行榜”，排名前3位的分别是： \n\n1、嘿嘿完就撤， \n\n2、不告诉对方自己住址， \n\n3、有好几部手机 \n\n第一名：拔吊无情，完事就跑 \n\n“睡完就跑”的男人斩获了劈腿指数第一名。这种提裤子不认人，完全不考虑女性感受的渣男引来了大量妹子的声讨。只会用下半身思考的男人让妹子们恨的牙痒。退一万步说，就算没有劈腿，完事儿就跑在女性眼中也是很恶劣的行为，所以毫无悬念当选第一。 \n\n第二名：住址保密 \n\n从不说自己住哪儿的男人，旅馆是首要战场。这类男人从不邀请女伴回自己家，一问及住址就转移话题，摆明了心里有鬼。甚至很大几率是个已经结婚的劈腿男。 \n\n（所以碰到不肯告诉你住址的男人，姑娘们一定打起12分精神，因为你可能已经被小三了。） \n\n第三名：拥有多部手机 \n\n虽然现在流行工作和私生活各用一台手机，拥有两部以上手机的人也不少，但话又说回来，有些兄弟的“工作机”在明显不该有公事的时候响个不停，这TM就尴尬了。 \n\n岛国妹子眼中，什么样的行为算劈腿.jpg \n\n所以说，男人越是想掩饰，女人就越是容易怀疑。 \n\n有前三名行为特征的兄弟，即便你没干啥坏事，女人也同样会怀疑你是不是出轨了，所以有这些小毛病的兄弟还是趁早改吧！ \n\n最后附上榜单第4~10名： \n\n4、约会时间永远得听他安排； \n\n5、总是玩手机，不知到底在干嘛； \n\n6、总是在女方家里见面 \n\n7、圣诞节、情人节等节日不会一直陪着你； \n\n8、不告诉你他平时都在干嘛； \n\n9、女方提出约会时总用工作推脱； \n\n10、不带你去见他朋友。 \n"
		},
		{
			"post_id": 31,
			"title": "网络公司的那些猫腻",
			"date_published": 1466164201.366,
			"body": "在曾今我也是一位菜鸟级别的人物，对于建站常识也是十窍通了九窍—一窍不通。那时候我出社会不久，在一家建筑公司上班，公司要做一个企业门户网站，用来宣传公司的企业形象。由于对网络不了解，只知道简单的建站理论，不会自己做网站找模板，所以就和老板商量找了网络公司建站。\n\n怎么找一家可靠的网络公司呢？这事难倒了我们，我们在网上找了一天都没有觉得好的网络公司。百度满屏的都是网络公司的竞价广告，根本不知道哪家好！由于我们公司在上海，离苏州很近，和一家苏州公司联系了一下，觉得还可以，就让苏州的网络公司的业务人员来公司详谈，那时候公司也不是很信任我的能力，所以谈判我自然不在场。后面的谈判结果就是网络公司帮我们公司制作一个自认为高大上的企业网站，包括域名、空间等等所有的一起6800元，免费帮助备案，以后维护费每年3000元。\n\n一个月以后网站才见到雏形，网站用的是建站公司的内部程序做的，也就是闭源程序，网络公司美其名曰为了安全。然后就要我们公司自己开始添加内容，添加数据。这样忙活了一周的时候，网站总算看起来比较充实了。\n\n网站建好以后，网络公司直接给了一个后台管理员的账号和密码给我们，之后再也没有给我们其他的东西。半年以后突然发现公司网站被挂了很多的广告，还有黑彩链接。很可能是被黑客攻击了。联系网络公司，网络公司直接说网站被黑了，数据被污染了无法修复，要么就重做要么就放弃。这不是同一条路吗？总之就是网站报废了啊！我们就用合同和他们谈说：不到一年的时间重做也要网络公司负责啊，网络公司无奈又改口说可以修复。好吧，修复就修复吧。经过一周的时间，网站内的广告才算没有了，但是被百度收录的黑彩页面一直都有，在百度上搜索公司的相关关键词根本找不到我们公司的网站，就这样过了一年，网站莫名其妙的关闭了，网络公司给我们的回复是合同到期了，需要开通网站就要继续续费3500一年，说好的3000呢？网络公司又一次食言了。\n\n第二年我们出于对上次的教训，决定找一家本地的网络公司重新建站，很快老板通过朋友的关系也找到了一家网络公司，刚开始和前面的一样的，过了半个月才见到网站的真身，不过网站上缺少了一个完美需要的核心转盘板块，和网络公司联系的结果是他们的内部程序做不了这个东西。最后这个东西就变成了几张带有链接的图片而已。给我们的时候还是只有一个管理员账号，而且是普通的管理员账号，说超级管理员不给是怕我们误操作对网站造成影响。这个网站花了8800元，合同续费每年4500元。网络公司说这个价格是包括免费seo的钱，可是我在过了半年以后搜索我们公司的网站关键词都在前面两页找不到我们公司，我感觉被骗了。但是我没有和老板说这个问题，毕竟那是他朋友找来的建站公司。\n\n后来我对网络越来越了解，就私下和网络公司的人开玩笑说觉得公司的网站速度太慢了，能不能我们自己买阿里云的服务器，把网站搬迁到阿里云，没想到网络公司一口否决了，说网络公司建站就要用他们的空间和域名服务，不能用别家爱的空间域名。网络公司对公司网站拥有所有权，公司只对网站拥有使用权。听这话我感觉这网站好像不是我们公司的一样。我默默地关闭了和网络公司业务人员的对话框。\n\n后来我自己慢慢的摸索，也能建立比较美观的网站了，可惜公司一直不信任我，所以没有去给公司做网站，再后来我跳槽了，在一个新的公司，老板对我挺信任的，我给公司做了2个企业站帮助宣传公司，老板也能通过网站接到各种电话，老板觉得我做的网站还是有效果的。现在我虽然离开了原来的公司，但是依然是公司网站的管理员，公司每年依然要付我一点维护费用，我的任务则是保证公司网站的安全稳定的运行，偶尔更新一些公司发过来的网站信息。经过这些年我发现做网站并不是一件特别困哪的事情，关键是看你愿不愿意去学习，而如果公司要做一个企业网站最好不要找建站网络公司，网络公司多数都是忽悠人的，纯属骗钱而已，那么网络公司建站都有哪些猫腻和不好之处呢？\n\n1：服务态度不好，拿到钱都变脸\n\n这点在很多的行业都存在，在没有签合同拿到钱之前客户说什么他都满口答应，等到拿到钱以后完全像变了一个人似的，立马你叫他做什么都不答应。在他们的世界里面客户就是一个被宰割的羔羊而已，只要剩余价值没有了他们就选择离开了。而客户只有默默受伤的结果。\n\n2：捆绑销售，最大限度的榨取客户的剩余价值\n\n我们都知道域名、空间这些东西都是可以单独购买的，但是网络公司做网站多数都不允许客户自己在别的平台购买空间和域名，特别是空间。网络公司多数自己建有服务器和自己的网络建站捆绑销售，但是价格要比市场价高很多，有的甚至高几倍的都有，有点良性的网络公司还可以让客户选择域名，没有良性的客户直接使用原来的客户丢弃的域名和空间给你使用，他们节省了成本的同时还影响了你的网站的权重和排名。\n\n3：客户对网站没有实权，不能进行最高权限操作\n\n这点在90%以上的网络公司都存在，很多的网络公司都是在建好网站以后直接只给客户一个后台的管理员密码或者直接给一个编辑的账号和密码，根本没有最高权限，而且还美其名曰是为了网站的安全着想。更不要说域名的管理密码、转移密码、空间的管理密码、ftp用户和密码、数据库密码之类的这些资料了。客户完全的不能掌握自己的网站，网络公司想在你网站上做点什么手脚都是轻而易举的事情，而你付了钱的反而什么都不做不了，最多就能写写文章上传几张图片而已。\n\n4：客户只有使用权，没有所有权\n\n这点在签合同的时候很容易被忽视，很多企业在后来发现这个问题以后只能哑巴吃黄连，有苦难言。简单的企业网站还算好，大不了重新做一个，复杂的网站就不好办了，再做一个成本太高，不重做一个的话又不能掌握自己的命运，很可能在你网络事业最高峰的时候网络公司给你来一点岔子。那样你的网络事业就被毁于一旦了。\n\n5：收费不做事，事前收费\n\n这个主要表现在年费维护费这笔费用上，很多的网络公司都是在收了客户的维护费以后根本不管客户的网站，一般的企业网站确实不是很容易出现问题，但是不怕万一就怕一万，哪天出了问题的话你就哭吧。网络公司收钱以后很可能一年都不会打开你的网站看一下，不会对你的网站进行杀毒排除。而一旦客户发现自己的网站被挂马的话，网络公司会不断的推脱自己的责任，反而怪罪客户自己不注意，甚至直接叫客户出钱重做一个网站再次榨取客户的剩余价值。\n\n6：可能在你的网站上挂广告和木马病毒帮助他们赚钱\n\n这个只是个别想象，可能是我的猜想而已吧，但是不排除有这样的垃圾公司会在客户的网站上挂上自己的广告，为什么做宣传或者是挂上联盟广告，为什么赚取广告费，更有黑心商家或直接挂上木马病毒的也有可能。\n\n做网站不易，做一个好一点的网站更加不容易，对于不懂建站的人来说要找一家靠谱的建站公司真的很难，那怎么样才能找到好的建站服务对象呢？我觉得首先应该往下面这几点方向上努力。\n\n1：自己刻苦学习建站，这点不用多说，大家都懂，自己做出来的事情绝对靠谱。\n\n2:找一些私人接单的技术宅做，有的人会说技术宅做的站靠谱吗？技术能过关吗？这点我觉得没必要担心。网络公司业务繁忙，一个网站花的时间可能就是一两天时间，而技术宅是个人接单，单子比较少，自然会花更多的时间给你做站，而且有的网络公司的技术员的技术还不一定有这些技术宅的技术好，再说哪个技术宅不是在网络公司上班的？更重要的是技术宅单子少就想留住客户发展长期客户，所以技术宅都会有非常好的服务态度力保你的网站稳定安全放心，他们就是希望你的能满意，能够成为他们永远的朋友。\n\n说了这么多，其实还有很多想说的，但是时间问题就先到这里吧，过几天我将来重点讲讲找私人建站的好处。\n\n鉴于本人学习网站建设多年，技术比较成熟，完全可以帮助大家建站了，所以本人也偶尔承接建站业务，如有需要请联系彩虹之家博客本人QQ：717058319欢迎大家和我成为朋友，共同探讨建站常识。"
		},
		{
			"post_id": 30,
			"title": "我遇到过的那些电话诈骗",
			"date_published": 1465028917.957,
			"body": "现在这个社会，诈骗行为是越来越多了，我这里就来8一8我自己经历过的咋骗行为吧，不过我都没有上当哦。\n\n第一次接触到诈骗是在高中高一，那时有人发信息给我妈妈，说我除车祸了，住院了，急需1500块钱，当时我妈妈看到这条短信就信以为真，好在那个时候博主已经有一个tcl蓝屏的手机了，哈哈哈。。。妈妈打电话来，我是相安无事在学校的，这个时候我突然醒悟，这个是一种诈骗行为，想骗我妈妈的钱啊！\n\n再后来，我妈妈和家里也经常受到这样类似的短信，有的说我出车祸了，有的说我在外面乱搞进警察局了，有的说我赌博欠债被打了，反正都是一些不好的情况，在这里，我真的想骂那些诈骗的人，你们他妈的就希望老子死是吧！最该死的其实就是这些诈骗的了！再说了我家里人还不了解我吗，我会嫖娼赌博吗！去你妈的，真想骂人。\n\n上了大学，又出新的诈骗行为了，记得我同学有一次收到一条短信，说自己在建设银行办的行用卡恶意透支了，要到公安局接受调查，叫他打一个什么公安局的电话，明显电话是一个南昌的电话，但是不是公安局的，我同学打过去，就问我同学是不是恶意透支，我同学自己连信用卡都没有办，怎么来的透支啊！后来又说要打另外一个电话，搞来搞去，好在后来我同学留心，知道了是诈骗行为，直接打电话说，你们这些诈骗的人就等着死吧，没有想到那边直接把电话挂掉了！哈哈哈，后来记得我同学还报警了！\n\n还有一次我同学接到一个电话，电话明显是一个系统程序的声音，说我同学有一个国外的包裹在过境的时候被查出有毒品，我靠，我同学哪里有国外的包裹啊！明显的诈骗，果断求证啊！打公安局电话110问一下，110说这样的诈骗行为很多，千万不要相信！\n\n今天我女朋友又遇到了这样的诈骗了，一个系统打电话说我在网上买的东西邮寄的地址不详细，无法寄到，我果断上网问了一下昨天晚上我买的东西是不是真的邮寄不到，卖家回复一切正常，靠。。。。差点上当。。。现在的诈骗也是无孔不入了啊 ！\n\n电话诈骗这样猖獗，网络诈骗也是一样的，记得我在做淘宝的时候，经常可以收到：您好，我昨天看上了您的XX商品，今天怎么限制了，后面就是一个看起来像淘宝或者阿里巴巴的链接，打开就是一个受限制的页面，再仔细看一下，根本不是淘宝的网站，就是一个钓鱼网站，意图套取我们的用户名，密码和支付宝账号来骗钱！\n\n关于钓鱼网站问题，这几天我同事也遇到了一个卖点卡的假冒网站，好在被识破了，我推荐他去举报这个网站，果然举报后过了两天公安局就来回访了！具体的工作进程这里就不多说了！\n\n以上所说的诈骗行为只是我遇到的一些而已，还有很多我没有遇到的诈骗行为，这里希望大家将普遍的一些诈骗行为说出来，让更多的人不要再受骗了！"
		},
		{
			"post_id": 29,
			"title": "爱情就是有利可图",
			"date_published": 1464750015.635,
			"body": "今天和一个刚上大学的女孩聊天，我问了一个问题：上大学准备找男朋友吗？ 女孩斩钉截铁的说：怎么说也要找一个可以给我打饭 的吧！我顿时哑口无言，现在的女孩是怎么了，这找男友的目的竟然简单到了为了有人替自己打饭，男人的用处已经到了跑腿这样的 具体化了！顿觉现代社会的爱情都是在互相利用罢了！\n\n其实，两性的结合都是建立在有利可图的目的之上。爱情其实都是大家有利互图的：我迷恋你的美貌，你贪恋我的财富。我要定你的 年轻单纯，你选定我的成熟稳重。我看重你的肩膀，你迷恋我的身材。我醉倒在你的似水温柔里，你忘不了我的旷世激情。你相信我 会一直照顾你，我相信你在我跌倒的时候你会过来扶我一把。我的孩子会叫你做妈妈，你的孩子会叫我做爸爸。夫妻最浪漫的事就是 大家一起慢慢变老，到最后大家还可以埋在一起。 男女的结合，不管从哪一种层面上理解，都存在着各种各样的目的，而所有的目 的又是相辅相成，相互依存的；一方有目的，另一方可以让其目的得到满足，便是所谓的圆满，一旦目的得不到满足，或是丧失了最 初的目的，感情便像是被截流，必将日渐枯竭。\n\n有人会说：爱情是不求回报的，的确，这句话说得大家好像心服口服，但是你真的不求回报吗？你爱那个人，就希望得到他的回应， 他的回应就是对你的回报，难道不是吗？你爱一个人呢，你就愿意去为他做很多事，打饭，陪逛街，帮拿东西，买礼物。你一个人的 时候你有这样对过自己吗？你有这样的对个一个陌生人吗？没有吧！只有你对你爱的那个人才会表现的那样的殷勤吧！那你为什么会 那样呢！因为你希望得到她（他）的回应，哪怕是一点点对你比以前的更进步！爱情是两情相悦，爱情是甘心情愿，爱情是一个愿打 一个愿挨，在爱情里，有各种各样的目的与需求，有人的目的是美貌，有人的目的是金钱，有人的目的是性欲，有人的目的是柏拉图 式的精神爱恋；即便只是单纯的想得到所谓爱情，又何尝不是一种目的，希望这种爱情能够天长地久，便是更为迫切的目的，任何一 种目的，只要有人愿意满足你，便是相爱；而这种满足若能细水长流，便是一种天长地久。而一种目的，别人有条件满足，却不愿给 予，便又为苦行者铺就了一条修行的苦路。这就是爱情，看清了，不过就是各种目的周而复始的轮回，再无其他，差别在于在爱情路 上的人的不同罢了！"
		},
		{
			"post_id": 28,
			"title": "国内域名转入转出的痛心内幕",
			"date_published": 1464682357.513,
			"body": "在国际上来说最大的域名注册商是Godaddy，在国内最大的域名注册商无疑就是万网了，纵观国际国内的域名注册商都有一个普遍的现象，那就是域名注册持有人要是想从一个注册商那里转出一个域名转入另一个域名主持商的话，转出注册商的手续比转入手续要复杂得多。\n\n我们先来打个比方吧：假如你买了一辆车，停在停车场里，想把车开走时，停车场找你索要各种复杂的手续以证明这辆车是你的，并且要求你多交一年或几年的停车费，甚至压根儿就以各种理由不让你开走车，你一定会觉得荒诞无比吧？但是在国内的域名注册市场里面这样的事情就已经是一种公开的秘密了。为什么域名转入转出的区别会那样大？这其中有什么内幕？\n\n**域名代理商良莠不齐**\n\n目前在国内大陆有域名注册资格的注册商只有10多家，但是能注册域名的公司网站却很多，这些就是所谓的“域名代理商”。想成为一个域名代理商很简单，只要在域名注册商缴纳一定的预付款就行，代理分成很多级别，有金牌代理，银牌代理，铜牌代理等，缴纳的预付款越多，级别越高，拿到的产品价格就越低，代理是可以层层发展的，就像传销组织一样发展自己的下线，所以在国内要做一个域名代理商只要网上转账即可，甚至比客户购买一个域名还要简单！\n\n域名代理商的出现带来了这些问题，首先成为域名代理商不需要审核，所以代理商人人品就造成了良莠不齐的局面，代理商有着自主定价的的权利，一些大型的信誉好的代理商还好，但是有一些小代理商、无良代理商就不一样了，为了控制域名的续费权，代理商牢牢的控制住域名的转入转出权限，而有的代理商甚至还在偷偷续费即将删除掉的域名而据为己有。\n\n按照国际域名注册管理机构的要求，域名持有人是可以再域名注册商那里直接获取管理密码和转移密码的，但是域名注册商为了保护代理商的权利，往往域名注册商注册的价格比代理商注册的价格要高出2倍左右，代理商的价格一般在45-75之间，但是在注册商注册的话一般在100-200之间，而作为个人或公司来说，就域名本身而言，他们之间没有本质上的区别，所以在国内大多数的草根站长都选择了代理商处注册域名，以便于节省开支，开源节流！\n\n**代理商私设门槛控制用户**\n\n在各大域名注册代理商网站上面基本上都在显眼的地方标出了域名转入的方法和流程，而却没有标出域名转出的流程和方法，作为用户，注册了一个域名，就成为了域名的持有人，对该域名就有持有权和管理权，而代理商最常见的就是不提供转移密码和域名解锁，只给你一个域名管理密码，而没有转移密码和域名解锁，你的域名就无法转入转出到其他的顶级域名注册机构管理。\n\n除了上面的情况以外，代理商还会私自设立域名转入转出的手续，一般的做法是域名转入很简单，只要有转移密码直接填写在线提交就行，但是转出的门槛就不一样了，多数都是要持有人提供公司的营业执照，个人的身份证明，还要缴纳一定的转移费用，更让人抓狂的是，只要在这其中稍微有一点点错误就会借口不让转移。\n\n实际上代理商和注册商都是没有权利设置门槛来控制域名的转入转出的，只是大多数用户都不明就里，才能被那些代理商忽悠到。\n\n对于域名注册商或者是代理商不提供转移密码和解锁，私自设立高门槛的情况，实际上我们可以通过向国际域名管理机构投诉来解决，如果原注册商擅自限制或拒绝域名转出，域名持有者可以按照以下方式进行投诉；\n\n国际域名投诉地址：http://reports.internic.net/cgi/registrars/problem-report.cgi\n\n国内域名投诉方式： 投诉邮箱为supervise@cnnic.cn，投诉电话为010-58813000；\n\n**域名知识扩展**\n\n*谁管理域名注册商*\n\n包括.com/.net/.org/.biz/.mobi等25类国际域名的注册商，它们需要向ICANN授权取得注册商资格，而后向相应的“注册局”申请域名注册端口。因此ICANN是英文域名类别域名（gTLD）注册商管理者。根据WTO条款及行政法规，销售这些类别域名（gTLD）注册商必须向信息产业部（MII）备案，否则属于违法经营。\n\n而英文国家与地区域名（ccTLD）注册商，就是各个国家的域名后缀，如.CN、.CC、.TV、.TM等，由所在国家与地区自行管理。CNNIC就是我国cn域名的管理机构。注册商同gTLD一样必须向信息产业部（MII）备案。目前国内有注册资格的域名注册商共有九家（表）。在这些网站之外注册的域名均为下级代理。\n\n实际上信息产业部管理的范围有限，对域名的归属纠纷也无法裁定。而国外的管理机构更是鞭长莫及。\n\n*如何验明域名归属*\n\n很多站长在交易或者转出域名时，才猛然发现自己并没有域名的控制权；一些企业用户也因为网站是委托公司制作，大多没有域名的直接管理权限。实际上这是一个普遍存在的问题，甚至比代理扣域名还要危险，因为无法证明域名为自己所有。如果域名代理商出现问题，企业的网站可能就要面临关闭的窘境。\n\n我们可以通过查询域名的Whois来确定域名的所有人及管理者和注册商等信息。在 [http://www.whois.sc](http://www.whois.sc) 可以查询国际域名，在 [http:/www.cnnic.cn](http:/www.cnnic.cn)则可查询国内CN域名。\n\n如果你的域名并非从域名顶级注册商直接申请注册，而是从下级代理商注册的，要验证域名是否为自己所有，首先需要确定的就是注册人邮件是不是自己的邮件。然后查看注册人的姓名是否正确。如果cn是以个人名义注册的，也应该及时向注册机构提交更名申请。"
		},
		{
			"post_id": 27,
			"title": "地方政府何以害怕用事实说话",
			"date_published": 1464665294.653,
			"body": "从去年开始，这个地方的松树就不断的死亡，经过调查发现是感染了松线虫病。\n\n松线虫病是一种靠天牛等有害生物传染的松树疾病，被称作松树的“癌症”。有多可怕大家应该就知道了。\n\n最近全县上下都在抓这项工作，那就是消灭宋线虫病。不过县林业局和政府均否认是感染了松线虫病，而是用“松材重大有害生物危险源”这样一个叫法。\n\n在开展这项工作的时候，拍了几张照片，发到了朋友圈，说明是这样写的“松线虫病感染很严重，今天消灭了2000KG干柴，不知道杀灭了多少松线虫？”刚刚发出去不到2小时，就有领导打我电话，要我删除这段文字和动态，理由是不能发布松线虫病，不能让上级领导知道，否则地方政府领导者都要遭殃撤职。\n\n国家政府的事情真的很复杂，就实话实说感染松线虫病有什么问题吗？言论自由有问题吗？这也不危害国家，不危害政府的，为什么要限制我的言论自由呢？"
		},
		{
			"post_id": 26,
			"title": "接到这样的电话马上挂断！否则你的财产有危险了",
			"date_published": 1464260548.628,
			"body": "**近日，家住洛阳的马女士遭遇了一件蹊跷事：5月11日，一个归属地为广东深圳的电话给她打来电话，称她在网上一个“5173游戏平台”购买了130292元的QQ币，一听对方说的事跟钱有关，马女士随即挂断电话，通话时长仅为28秒，可接下来，马女士的手机接连收到了多条银行卡转账信息，顿时吓出一身冷汗**。\n\n*接连收到银行卡转账信息，差点被盗刷*\n\n马女士的那张银行卡是磁条卡，在邮政储蓄银行办理的，卡上有十几万存款。当时，她挂断那个电话后，就收到了7条银行客服电话发来的转账信息，转账信息显示，其银行卡中的130292元被“转走”，银行卡内余额成了0.46元。\n\n马女士意识到可能是遭遇电信诈骗，慌忙返家取出那张银行卡，就近选择了一台ATM机故意输错3次密码，把该卡账户冻结。\n\n“这个过程中，那个归属地为广东深圳的电话仍不停的给我打电话，但我一直没接。”马女士说，冻结账户后，她又拨通110报警。\n\n接下来，警方和银行方面的解释让马女士感到既幸运又无语。\n\n当晚，邮政储蓄银行相关单位负责人查询马女士那个银行账户后说，那笔钱并未被不法分子转走，仍在她的账户内。\n\n不过，这笔钱确实被人操作了，从活期存款变成了定期（定期金额不会在查询中显示，也不会有短信提醒），不过，由于账户已冻结，卡上资金应该没被盗刷。\n\n随后，马女士产生了一系列的疑问：\n\n#### 1、为何卡内活期存款不经本人操作就能转定期？\n\n据民警介绍，银行方面的解释是：马女士那张银行卡开通有电话银行业务，她通过拨打客服电话95580，提供账号、密码后，就能实现银行卡账户金额转定期或活期。\n\n“银行工作人员曾说，我遇到的这种情况，可能是手机中了木马病毒，个人银行卡信息已被不法分子掌握。”马女士说，对此，她并不认同，她怀疑银行相关系统可能有问题，让骗子有空可钻，能先把活期存款变定期，而后，给下一步诈骗做铺垫。\n\n#### 2、“如果骗子已盗取了我银行卡账户、密码，为何不直接把钱盗刷走，而绕一大圈把钱先变定期存款？”\n\n对这一疑问， 银行方暂未给予明确答复。\n\n目前，马女士的银行卡已经解冻，被不法分子“转走”的钱也回到了马女士的口袋。警方正对此案做进一步调查。\n\n友情建议\n\n1、接到陌生电话，不管对方是谁，只要一谈到银行卡，一律挂掉。\n\n2、只要一谈到”中奖了“，一律挂掉电话。\n\n3、只要对方自称是公、检、法、税务或”我是你领导”的一律挂掉。\n\n4、所有短信，凡是让点击链接的，一律删掉。\n\n5、微信不认识的人发来的链接，一律不点。\n\n6、170开头的电话能不接则不接（170号段为虚拟运营商号段）"
		},
		{
			"post_id": 24,
			"title": "抓嫖创收经验谈",
			"date_published": 1463978391.563,
			"body": "雷洋一案，经过多方的努力，真相已逐渐明朗。究其根源，乃警察为创收而抓嫖所致。自1991年全国人大《关于严禁卖淫嫖娼的决定》出台之后，其中对卖淫嫖娼处以罚款的诸多规定，成为警方扫黄的巨大动力。二十多年来，警察在打击卖淫嫖娼的同时，不知制造了多少冤案、惨案。2003年，孙志刚之死使施行了二十多年的《城市流浪乞讨人员收容遣送办法》（此法为1982年制定）得以废止，不知雷洋之死，是否可以使立法机构对《关于严禁卖淫嫖娼的决定》中种种罚款的规定进行修改或废除。桑榆先生可以断言，如果抓嫖创收仍然是警方一大财源，雷洋就绝不是最后一位受害者!\n\n  雷洋之死，使我想起这篇旧作，现在看来，仍不过时。故从电脑中搜出贴之。\n《抓嫖创收经验谈》\n\n唉，老弟呀，别怪我说你，以前我一直以为你是个有能力、有魄力的人，想不到你竟会为这样那样的经费问题发愁，这真是身在宝山不知富，拿着金库的钥匙找不着门。也难怪，新官上任嘛，火烧得虽大，经验方面总是缺乏一些。你多到别的单位走走，向同行们取取经，这个问题早就死缋儿当快刀——迎刃而解了。根据我的经验，要想解决经费不足的问题，就要搞创收，而要想搞创收，最好的办法就是“抓嫖”。你别把两眼瞪得像牛蛋似的，我可不是跟你说笑话、胡扯淡。\n\n　　抓嫖创收，光靠每年一次的扫黄，当然不行。那种兴师动众、咋咋唬唬，像搞运动似地抓小姐、逮嫖客，大多是声势大，收益小。要想收入不断，就要把抓嫖作为一项长期的工作来干。而要想节省警力，不放空枪，就要充分发动群众，利用一切可以利用的力量，多管齐下，才能收益大增。\n\n　　我首先把我们管区的饭店、歌厅的老板发动起来，让他们及时举报嫖客，说好每抓到一个嫖客，将罚款的十分之一作为他们的提成。这些场所都有数量不等的三陪女在进行陪侍活动，并且设有包间。许多男人很难满足于陪酒陪歌陪舞的服务，三陪两陪，就被陪得欲火难耐，要进入实质性阶段。而两人一旦入港，老板就打电话向我们报告，我们立即出警，将进行性交易的男女当场抓获。我的另一招是叫出租司机跟我们合作。许多嫖客光顾暗娼的住处或从歌厅发郎带走小姐，都要打的，出租车司机如能向我们报告他们的行踪，就等于为我们充当“眼线”。当然我们也要给他们一定的提成。这样一来，我们就等于撒下一面大网，凡是打的的嫖客绝大部分成了我们的网中之鱼。而那些嫖客被抓后，只怪自己“倒点”，一般不会怀疑到是出租司机放的水。这样我们就可以长期合作下去。出租司机发动起来之后，我又重点物色了一帮姿色出众的小姐，让她们配合我们的工作。我给她们布置了任务，并且每人发了一部手机，让她们勾引那些意志不坚定的男人，猎物一旦上勾，立即找机会打电话向我们报告。每勾引一个嫖客，我们就发给她300元奖金。当然，羊毛出在羊身上，这个钱也是从罚款中出。小姐又收嫖资又拿奖金，一下子等于有了双份的收入，并且得到我们的保护，积极性十分高涨。这下可好了，我们每天晚上都要坐在办公室审嫖客、收罚款，忙得不亦乐乎。\n\n　　当然，我们除了利用眼线和鱼饵之外，也经常主动出击。我们把重点放在那些歌厅三陪女、发廊妹，以及餐馆服务员身上。那些一起住旅馆、逛马路的行迹可疑的男女，也在抓嫖的范围之内。这些人有的胆子小，抓来后，吓唬几声就招出了嫖客，或是三五个，或是七八个，或是十几个，于是我们就把她放了，然后忙着去抓嫖客，以平均一人招出五个嫖客，每个嫖客罚款3000算（当然，我是照低说的，最高可以罚5000），每抓一个小姐能罚它个一两万。当然也有嘴硬的，我们就希望抓到这样的小姐。审讯这样的小妞真是一种精神上的享受。咱们是哥们，又都是男人，跟你说说那种感受也没啥。你想想，一个皮白肉嫩，如花似玉，年龄只有二十上下的小妞，任你打骂折磨，那是多么刺激。你可以用电警棍电她，用棍子捅她、抽打，就像猫戏老鼠，可以尽情玩弄，反正她们又不是什么好东西，只要不强奸她，怎么整都不为过。她那种痛苦的模样，你平时上哪里看到，穿着一条薄薄的裙子，身上鼓鼓凹凹，曲线分明，那张泪水直流的脸，就像带雨的梨花，她的尖声叫喊和低声哀求，让你听了心醉。用电警棍击她时，那一身肉直哆嗦，叫你不由得不心动。用木棍敲打她时更刺激，你可以捅她的胸、抽她的屁股，打她的大腿根，能感觉到她那身嫩肉的弹性，真叫你心里热浪直翻，恨不得犯上一回罪。除了整这些女人，你不可能在别的女人，包括你的老婆身上寻找这种非常的刺激。哥们遇到这样的小妞，都争着审，后来我们干脆轮流享受这种一般人无法享受的快乐。这些人毕竟不是江姐，经过一番大刑伺候，没有不招供的。而她们出去后，一般都不敢声张，一是她们害怕丢人，二是她们也明白，民告官，而且是告公安，是告不赢的。\n\n　　当然，有些兄弟单位碰巧遇上了硬骨头、真清白的姑娘，闹出了纰漏。她们有的誓死不承认自己卖淫，或是当场受不了苦，招了供，出去立即翻供，把刑讯逼供的哥们告上法庭。并且到医院检验，以“处女膜完好”证明清白之身。再遇上那些好事的王八旦记者，在报上一曝光，麻烦也就来了。不过，你也不用怕，因这事倒霉的只是极少数。现在年轻人的观念都很开放，二十来岁的姑娘，没有与男人发生过性关系的已经罕见，你没听说人说，现在“处长要比处女多”吗？她过不了医院“处检”这一关，也就无法证明她不是卖淫女，当然也就告不倒我们。其实即使她是个处女，也没什么大不了的，前年山西有个叫麻旦旦姑娘，不是有医院证明，说她还是个处女吗，结果法院只判决赔偿她经济损失费74.6元。这点钱还不够咱喝两杯五粮液的。这就是说，在咱中国，咱执法的人整一个老百姓，整就整了，整错了也没啥，顶多赔他点钱。别说是70多元，就是7000多元，不就是抓两个嫖客的罚款吗？至于什么处理搞刑讯逼供的人，就更好办，只要找两治安员顶罪就得了。我接受兄弟单位的教训，吩咐手下的人抓小姐嫖客和审讯时一定要穿便服，不能让受审的人记住咱的警号。万一惹了麻烦，那被整的男女也不知是谁整的。\n\n　　今天我跟你说了这么多，把底都亮给你啦。你照老兄说的大胆去干，保你财源滚滚，最之不竭，用之不尽。不过，老弟你尝到甜头之后，可别忘了给我一笔传经费呀。"
		},
		{
			"post_id": 23,
			"title": "中国老百姓最渴望政府解决六个问题",
			"date_published": 1463978146.584,
			"body": "### 一是妥善解决就医难的问题。\n\n中国医疗问题是困扰老百姓的一个最大问题。就医是老百姓最担心、最忧虑、最害怕、最不放心的一件事。民间流传着这样一句谚语，辛辛苦苦几十年，一场大病又返贫。就医难，难就医，大病等死，小病拖着，成为许多贫困家庭的无奈选择。不用说普通的老百姓，也不用说弱势群体，更不用说那些特困家庭，就是那些底层公务员家庭、一般职工家庭对就医问题都心存恐惧。\n\n不敢奢想全民免费医疗，只要能够规范医保，规范医疗，规范服务，规范医德，让老百姓看病不再难，不再为病无所医，病被敲诈而发愁，就是社会巨大的进步了。\n      \n### 二是妥善解决就学难的问题。\n\n中国老百姓对孩子上学有着十二分的关心。因为孩子是一个家庭的希望，是改变命运的唯一出路。但就学难已经成为当今中国的一个大问题，主要表现在三个方面。其一是户口问题制约孩子不能就近上学，导致有的孩子只能成为留守儿童。其二是学费沉重。\n\n中国名义上是九年义务教育，实际上根本不是那么一回事，孩子从上幼儿园开始就不断地缴费，各种各样名目繁多的收费，让许多老百姓不堪重负，尤其是易地就读的儿童，动辄上万的借读费、学费、杂费，加重了老百姓的负担。就是如此，那些家长们还要千恩万谢，还要低头哈腰。\n\n至于从高中开始，学费就更加沉重，步步攀高。老百姓辛辛苦苦一年的收入，一大部分都交给了学校。他们在用自己的血汗钱为国家培养栋梁之才，营造未来的中国梦。\n      \n### 三是妥善解决养老难的问题。\n\n政府要积极解决老百姓养老难问题，积极解决老百姓养老中存在的问题，要大规模、高标准建立养老院，要制定相关的制度、规则，要成立相关的机构、组织，要纳入市场竞争机制，不如良性运行轨道。\n\n另外，对于年龄在60岁以上、没有收入的老人，政府要加大照顾力度，发放足够的生活费用，让所有的中国老人都过上老有所养的好日子。\n     \n### 四是妥善解决环境食品问题。\n\n中国老百姓希望能够经常看见蓝蓝的天空，白白的云；希望能够经常看见清澈透明的小河水；希望空气清新、水质良好。雾霾问题、水质问题、交通拥堵问题、食品问题，已经严重困扰中国老百姓的幸福感。食品问题、环境问题已经上升到执政者生死存亡的高度，已经上升到执政能力的高度，已经上升到人民满意不满意的高度。中国的环保局，食药局为什么不能充分发挥作用？\n\n中国的《环境保护法》，《食品卫生法》为什么不能执行到位？饺子不再有毒，面粉不再有吊白块，食用油不再是地沟油，奶粉里面不再有三聚氰胺。这是最基本的生存需要，而不是高标准的要求。中国老百姓越来越希望吃得放心，用的安心，行的舒心。\n      \n### 五是妥善解决执法不公问题。\n\n有法不依、执法不公、执法不严、办人情案、关系案、金钱案、权力案、逼供信，时有发生。中国法律不能谓之少，但真正能够落实的不多。比如，《劳动合同法》《森林法》《水法》《环境保护法》《物价法》《食品安全法》，等等，在落实上大打折扣。\n\n其实，有法不依，执法不公，就是偏袒了违法的一方，就是压制了正义的一方，就是和黑社会沆瀣一气，就是破坏了社会的公平、公正，就是对政府和人民打耳光。但是，这个问题谁来解决，怎么解决，是不是真心解决，很是一个问题。\n\n如果今天你在位子上，你就可以操纵法律，那么明天你下台了，别人就可以操纵法律收拾你和你的儿孙。这种变态的循环，无论如何都不能给老百姓一个安全的法制环境。我们的法制不能建立在权力的沙滩上，更不能建立在个人的好恶上，因为，我们的国家和人民需要的是公平、正义。没有新闻自由，没有监督自由，没有一整套的司法改革，这些能够实现吗？\n      \n### 六是妥善解决社会风气问题。\n\n中国的社会风气是由各级官员带坏的。当前中国社会风气不良，竞争手段恶劣，底层人之间互相倾轧，互相敌视。部分群众见死不救，麻木不仁，黑白不分，是非不辨，明哲保身。\n\n整个社会对腐败、黑恶、流氓不是持一种蔑视、鄙视、轻视的态度，而是持一种追求，一种羡慕，一种向往的心态。社会倡导的，宣传的，支持的，就连那些倡导者，宣传者，自己也大多不太相信，不执行。他们上午还在讲道德、讲良心，下午摇身一变就去赌博、嫖娼、行贿受贿。社会上普遍流行着双面人、三面人、四面人。中国人在传统文化中更多的是吸取了圆滑、世故、虚伪、中庸，而恰恰没有公平、公正，没有法制和人性。每个人都谴责腐败，一转身就去送礼。每个人都诅咒贪官，但自己没有机会贪就苦恼万分。\n\n每个人都谩骂小姐，一到深夜就想到那种地方消遣。每个人都是道德的化身，又都是道德的破坏者，因为他们根本不知道什么是道德。他们以为儒、释、道就是道德，以为说漂亮话就是道德，以为唯唯诺诺、压制人性、欺软怕硬就是道德。\n\n十八大以来，中央高调反腐，中纪委出台了八项规定，但就是在这种情况下，社会风气依然没有从根本上扭转。"
		},
		{
			"post_id": 22,
			"title": "女贪官升迁史：与40位官员性交易  狱中放倒看守",
			"date_published": 1463644652.789,
			"body": "贪官的“追求”、情人的“愿意”、惩处的“忽略”、职能部门的“装聋”、整个社会的“作哑”，为“桃色贪官”的生存和发展开出了五张“通行证”，为贪官桃色新闻的产生准备了足够的土壤和条件。\n　　\n有中国“政坛新星”之称的原国家统计局局长邱晓华因腐败落马!与其他贪官落马不同的是，邱晓华的腐败不仅涉嫌贪贿、生活腐化，还涉嫌重婚罪。在腐败官员名录里，省部级高官涉嫌重婚罪被追究的，邱晓华可谓第一人。\n　　\n有人笑了，说这是“高级官员”犯下的“低级错误”;可更多的人没笑，他们严肃认真地说，在邱晓华之前，这样的“低级错误”绝大多数贪官都犯了，而在他之后，许多贪官还在犯。于是，一年365天，天天都有人在谈论层出不穷的贪官和他们层出不穷的桃色新闻。\n\n### 形形色色的“桃色贪官”\n　　\n在海南查处的贪官中，有5个“色贪”各具特色：“痴”者有原海南国际投资公司董事长李耀祺、原农行琼山支行科长韩新。前者年过六旬，疯狂敛财7000万元，供比其小30多岁的“佳丽”任意挥霍;后者风华正茂，也贪贿1497万元，用以献媚情妇。两人最终皆被执行死刑，但他们都觉得“死而无憾”，大有“牡丹花下死，做鬼也风流”的“痴情”。“猛”者如原临高县城监大队队长邓善红，一口气包养了6个情妇，而且个个都为他生下孩子，绰号“情妇队长”。“慨”者有原海南省工商局局长马招德、原海南省农业机械进出口总公司总经理冯戈宁，在单位他们都是“一言堂”、“吝啬鬼”，可在情妇面前，他们又言听计从、挥金如土，都以千万黑金买得美人笑。\n　　\n如果编制一份“色贪榜”，上述5名贪官的“桃色业绩”虽然不错，但排名肯定靠后，不仅在原江苏省建设厅厅长徐其耀包养140多个情妇的“超级纪录”面前黯然失色，与被称为“五毒书记”的原湖北省天门市委书记张二江的“床上一百单八将”相比不值一提，甚至还要远远落到以拥有“金陵十三钗”而“自豪”的原南京市车管所所长查金贵和敢于长期包养一个16岁女孩的原四川省乐山市副市长李玉书等人之后。\n　　\n如果说上述这些贪官花了钱得到了“肉弹”的话，那么，原北京市交通局副局长毕玉玺的“大手笔”说出来就会吓你一跳：他找一个小姐给他捏脚，小姐说她想买房子正缺钱，老毕一出手就甩给小姐20万元。毕玉玺之流满足的是“美女捏脚”，而孟庆平、王建业之辈满足的则是误把奸情当作了真情。原河北省副省长孟庆平，是个“花省长”，东窗事发后，他的数个情妇早已跑得无影无踪，他老先生却还在“老实”地“交代”说：“她们跟我都是真感情。”原深圳市计划局财贸处处长王建业与情妇史燕青共同贪贿近千万元，王建业逃到了国外还想着史燕青并设法“救她”，可史燕青一落网，就为了保命把王建业给“卖”了。事发前，王建业的哥们还提醒他对史燕青别太“死心眼”，可王建业教训他们说：“什么事都是旁观者清，感情的事就是旁观者不清!”\n　　\n与男贪官不同，女贪官进行的权色交易又是另一番风景。原安徽省卫生厅副厅长尚军，原本只是一家县食品厂的普通女工，却凭着自己的身体“本钱”一路“高升”，尤其是成了原安徽省委副书记王昭耀、原安徽省副省长王怀忠的情妇后，她的升迁更是一帆风顺，最终坐上了厅级官位，可让人难以置信的是，检察机关在查处尚军贪贿案时，说尚军并不存在“以色谋权”的问题。而原湖南省六建公司党委书记兼副总经理蒋艳萍，不仅通过与40多个官员的性交易，从一个仓库保管员爬上了副厅级高官的宝座，而且即使最终身陷囹圄了，还能用“肉弹”把看守所副所长放倒，得以“绝处逢生”，简直就是一个“桃色传奇”。\n　　\n还有，原安徽省宣城市委副书记杨枫用MBA原理管理“情妇团队”、原福建省周宁县委书记林龙飞将诸位情妇召集起来一起“联谊”摆“群芳宴”、原中国对外建设总公司深圳分公司总经理姚传锐“双规”时被情妇组织人马成功“营救”……形形色色的“桃色贪官”制造的桃色新闻，不仅形形色色，而且数不胜数。\n　　\n权威统计表明：被查处的贪官中，95%都有情人，而在广州、深圳、珠海公布的贪官腐败案中，有权色交易的几乎达到了100%!贪官的桃色新闻如此之多，而且各有千秋，我们无法一“文”打尽。有一句名言叫“一千个读者有一千个哈姆雷特”;套用一下，“100个贪官至少有95种桃色新闻”。\n\n### “桃色贪官”的5张“通行证”\n　　\n在中国传统和主流的道德价值体系里，“生活作风”问题无论对于平民百姓还是达官贵人来说，都不是件体面的事，但如果“贪官”和“桃色”连在一起，其情形就大不一样了。简单地考察一下两者能够结成“玫瑰之约”的原因，至少有五大因素我们不能忽略。\n　　\n从情人本身看，他们“愿意”。给贪官当情人，是“发财升官”的一条“捷径”，因为情色的价值成本和损失成本不可量化，法律没有也无法规定，可塑性太强了，不仅值得挖掘的“潜力”很大，而且承担的法律风险又很小。这样，双方一结合，就都找到了风险小、成本低、收益大的最佳方式，都能实现各自利益的最大化。于是，坊间有了“裤头一拉，票子一沓”、“看得开就划得来”等等的民谣。于是，在湖北天门，尽管不少人都知道张二江是个“五毒书记”，可仍然有少数女干部心甘情愿去“送菜上门”，因为在赢得张二江欢心的女干部中，有7人得到了提拔，两人的丈夫得到了升迁，老百姓讥之曰：“一夜春梦，终生受益。”于是，在深圳罗湖，尽管不少人都知道女公安局长安惠君喜欢单独带年轻英俊的男下属“出差”并索取其性贿赂，但仍然有少数男警员渴望带上自己，因为一路上如果“侍候得好”，说不定一回来就会得到提拔，甚至有可能“连升三级”。\n　　\n从查处贪官的结果看，一般“忽略”。这一点毋庸赘述，无数的惩贪案例已经证实，除非贪官因为乱搞男女关系闹出了人命官司，否则这些“生活细节”问题统统可以装入“生活作风”甚至“个人隐私”这个大筐里，加以掩护甚至保护起来，一般不会列为惩处的依据。且不说调查难取证难这些技术难题一时还解决不了，单从“保护干部”的角度看，有人也会有一种很“人性化”的解释：“这是一个可以原谅的错误。”\n　　\n从职能部门的监管看，基本“装聋”。关于生活作风问题，建国以来一直到改革开放前夕，一直是党员干部的“高压线”、“政治生命线”，如果发现哪一位官员有这方面的问题，那他一生的前程就基本玩完。随着改革开放的不断深入，少数官员的观念意识也来了个偏离正确人生观、价值观的“改革开放”，原先那种为人不齿的生活作风腐败问题，渐渐在他们眼中“香”了起来。这样的“干部基础”一厚，作为专事监管官员的纪检监察部门就有了自己的难处，况且他们中的一部人也是这样的“干部”，监管的难度就更大了。同时，一些纪检监察部门也片面地认为，我们反腐败主要是针对经济问题，只要不贪污受贿，不在经济问题上犯错误，生活作风问题那是“小节”，不会影响到“大局”。渐渐地，一些纪检监察部门对官员的桃色新闻就见怪不怪了，就麻痹了，就基本“装聋”了。原海南省临高县城监大队队长邓善红包养6个情妇“全城皆知”，时间长达10年，可就在这样一个小小的县城，就是这样一个“整个临城人都知道”的“桃色贪官”，当地纪检监察部门却从来没有“过问”一下。\n　　\n从整个社会的心态看，大多“作哑”。贪官的桃色新闻，坊间流传，官场并非不知道，而且有可能先知道。但对贪官的桃色新闻，整个社会大多采取“看客”态度，“作哑”了事。对民众而言，当地有了贪官的桃色新闻，不管是查出来还是没查出来，都能只作为饭后茶余的谈资，说说笑笑而已;对官场而言，饭后茶余谈论一下也无妨，但一到正规场合，一到负责任的场合，全都会避而不谈，全都会“不知道”、“没听说”;只有几家“不太听话”的媒体嚷嚷几句，但又大多是战战兢兢，大多是谨小慎微地“据传”、“据说”、“有人反映”等等什么的，而且大多报道本地以外的贪官的“花花事”。\n　　\n贪官的“追求”、情人的“愿意”、惩处的“忽略”、职能部门的“装聋”、整个社会的“作哑”，为“桃色贪官”的生存和发展开出了五张“通行证”，为贪官桃色新闻的产生准备了足够的土壤和条件。这不能不让我们反思和深思，也不能不让我们开出“药方”加以“救治”!\n　　\n从贪官本身看，他们“追求”。古往今来的贪官，所贪不外财色两宗，但钱财不是最终的消费品，人最终的消费还是感官的满足，于是“饱暖思淫欲”，美色能满足贪官的性需求，而且贪官的钱财是贪来的，花起来更不心疼，所以贪官追逐“桃色”就一点也不奇怪了。如果他们用无耻告别了羞耻，他们就会自甘堕落，没有了道德标准，追求美色，也就成了他们的“荣耀”。原南京奶业集团公司副厅级总经理金维芝曾大言不惭地说：“像我这样级别的领导干部谁没有几个情人?这不仅是生理的需要，更是身份的象征。否则，别人会打心眼里瞧不起你。”而原云南省省长李嘉廷的情妇徐福英的话，则从另一面印证了金维芝的观点：“我和李嘉廷常常一起出去玩。每次出去，陪着李嘉廷去的不少领导干部也大多带着女人，那些女人基本不是他们的老婆，而是情妇。大家一起吃喝玩乐习以为常了，并没有什么回避和尴尬的意思……” "
		},
		{
			"post_id": 21,
			"title": "【揭秘车模行业惊人内幕】曾一日被10次潜规则",
			"date_published": 1463644500.472,
			"body": "### 摄影师性侵 要求扭下体\n　　\n一名16岁女模透露，在拍照期间，被一名全球顶尖摄影师性侵犯，她当时吓得动也不动，不敢出声。可惜，这名女模因怕事业受阻，在纪录片纽约首映前夕改变主意，要求删去她的片段。\n　\n女模切赫到另一著名摄影师处试镜时，中途被要求脱衣，她照办后摄影师也开始脱衣。随后，高档时装试镜变成色情杂志拍摄场地，她被要求性感地抓住他的下体用力扭。齐夫说，差不多所有曾与她接触的女模都有类似经历。说到此时，切赫耸耸肩，对着镜头承认她当时照做了，翌日即获取录，但她婉拒了。\n　　\n齐夫拍纪录片并非要向业界报复，只是在反思：为Calvin Klein拍内衣照，与当脱衣舞娘有何分别？你明显在伤害自己，到底我愿以何处作底线？我为了丰厚酬劳，究竟能愿意脱到甚么程度？\n　　\n### 每日工作20小时 无暇进食\n　　\n片中纪录了齐夫如何受模特界摧残，由一个健康自信的18岁少女，变成疲惫不堪、满脸雀斑的20来岁女模。她与一般模特儿一样减了磅，但女模减磅的一个原因，是工时太长，如在时装展季节，一天要工作20小时，根本无暇进食。\n　　\n齐夫14岁入行，当学者的父母知道后大感错愕。天生长相出众的她透露，年少时已不止一次在街上被星探截停，游说当模特儿。直至有一次，她遇上一个手抱婴儿的女星探，觉得比较可以接受，这才入行。最近英国两名模特儿设立工会，齐夫认为这能替年纪轻模特儿提供保障。\n　　\n文文说，在武汉有很多参加小姐的模特比赛，有很多参赛选手最后都被富商包养了，这个圈子本身收入都不高，在武汉也很难成名，所以有的同行选择了这条路。文文说：有的模特自身素质也不高，没有学历，没有文化，又想过虚荣的生活，走上这条路也不奇怪。但是，最后她们还是会后悔的，我就是不愿意悔恨终身，所以才边做模特边用功读书。\n　　\n目前，武汉市基本没有正规的模特公司，模特大多是一些大中专院校中相关专业的学生，也有一些社会上做兼职模特的，他们自发地组成了一些模特表演队。武汉的模特，就犹如北京的北漂，没有固定的公司，没有固定的收入，没有固定的活可以接，连他们自己都笑称自己是汉漂。\n\n### 全国拿了名次又如何\n　　\n1.75的身材，她是江城模特圈子里闪耀的一颗新星。去年一举夺下第九届CCTV模特大赛湖北赛区的冠军、全国季军，傲人的成绩让其他模特望尘莫及。但是，她并没有像大家想象的那样在江城一举成名，而是依然在学校过着一个普通学生的生活。\n　　\n文文坦言，模特们有时候为了生存，会迫不得已去参加一些应酬。有些只是让你陪店里的客人跳跳舞，撑撑场面。有的就比较过分，有一次我去参加一个饭局，饭后，那个客户硬拉着我去陪他们唱歌。坐到我身边就开始吹嘘可以如何如何包装我们，可以让我们接到怎样的代言，说着就开始动手动脚。当时有其他几个女模特，在那里很卖力地跳舞讨好客人。后来我听说她们后来都跟客人去开房了，当时我就在想，在这个圈里生存，难道真的需要这样放下尊严吗？\n　　\n文文告诉记者，做模特这一行，潜规则、性骚扰都已经司空见惯。有一次，为武汉某杂志拍片，有一个摄影师，竟然强硬地要求她全裸上身拍片。她想拒接，但是摄影师却说这是片子效果的要求，当时她刚入这一行，无奈之下就答应了摄影师的要求。虽然我脱衣服的时候他清场了，但是当我捂着胸前出来的时候，面对他我依然觉得很难堪，而且最后也没有用上这样的照片。我之后才知道，真正优秀的摄影师都不会干这样的事。文文说。\n　　\n带着冠军的头衔回来，晓玉已经是名副其实的A类模特（模特界分为A、B两级，拿过全国前三的为A类）。但是，生活似乎变化不大。除了原来帮助过她的朋友邀请她去参加一些活动以外，基本接不到别的活。以前她没有拿冠军之前，每次一场秀都只有300元，没想到拿了冠军后，出场依然是300元。\n\n但是，只要晓玉出现在北京或者上海的T台上，最少一场都是2000元。久而久之，晓玉也不想参加武汉的活动了。很多人认为是因为晓玉个子太高，而且过分大气，不适合武汉的市场。但也有人认为，因为武汉的市场请不起A类模特，所以晓玉的市场并不乐观。\n　　\n而拍摄杂志的费用在1000-2000元/天，至于模特收入中占最大比例的广告收入，对于武汉男模来说则几乎为零。在周雷鸣最辉煌的阶段，一天能接三场的服装秀，但是即使这样，一个月也只能赚上4000多块。所以一些男模兼职干别的工作，比如摄影助理、健身教练、模特经纪人等工作，再就是像他这样当上体育老师。\n\n### 女模遭遇潜规则\n　　\n与其他模特不同，文文在模特圈里混得似乎更加悠闲。名牌高校研究生在读，模特只是她业余生活的点缀。遇到喜欢的比赛就去参加，想拍片的时候就去拍。虽然个子不高，但是极具个性的她受到各大杂志的热烈追捧。\n　　\n### 男模比女模更艰难\n　　\n身高1.90、外形出众的周雷鸣曾经是武汉模特圈里炙手可热的人物，也是武汉为数不多的A级男模之一。现在的他却在广州一所学校里担任体育老师，问及模特行业的感觉，周雷鸣惋惜地说：在武汉，男模太难混了。\n　　\n周雷鸣告诉记者，和女模一样，在武汉，男模也是无法签到正儿八经的经纪公司，是没有底薪保障的。每名男模平均每场秀的出场价约300-500元，去武展参加一次车展，辛辛苦苦站一整天的收入也只有500-800元，而且还没扣除模特公司的佣金。"
		},
		{
			"post_id": 20,
			"title": "应该选择喜欢你的还是你喜欢的人？—《性交配策略论》",
			"date_published": 1463584918.136,
			"body": "我们的喜欢总是充满误导的，我们喜欢的人往往并不是最适合与我们交配的人，但这样的事情每天都在发生着，这就是我们所有情感问题发生的根源。\n\n所有的感情以至于在男女情感的发展中我们都必须面对一个问题，那就是感情主导方在谁手上？也就是说，谁喜欢谁更多一些，就占据了感情的主导地位，说的这里有些女孩可能会提出反对意见，就不能互相平衡的喜欢吗？这并不是绝无可能，但数量实在无法成为主流导向，否则这篇文章的意义就不在了。反过来说，如果我们都遇到了美好的爱情，双方一见钟情，互相爱慕，这种情况真的就会美好吗？未必，让我们往下看。\n\n为什么人们，或者说大多数人们无法互相一见钟情的喜欢呢？为什么我喜欢你就不能像你喜欢我一样多呢？这或许是很多人在内心中抱有一种美好愿望提出的一个疑问？我可以负责任的告诉你，如果每个人都一见钟情，先不说这种事情几率有多高，那么爱情来的快速那么速度也会，如果每个人见面都双方都非常喜欢，那么炙热的瞬间被点燃，爆发的能量很大，但是随着时间的推移，后续的能量却会越来越小。如果双方都很爱对方，就会产生相互的占有，个人的自由会被极大摧毁，刚开始热恋还好，但长久下去就不难说不出现问题，另一方面，当你开始喜欢一个人，特别是得到后生活在一起，渐渐发现对方的毛病，美好的生活期望会渐渐消磨，转变成痛苦，特别是肉体的欢愉后的新鲜感消失，矛盾就好越发严重，性后的爱比爱后的性对维持长久的感情更加重要。\n\n爱情第一定律：爱情来的速度与去的速度成正比。\n\n那有没有维持长久相爱对方，永不变心的方法呢？或许日本性爱大师渡边淳一在失乐园里给了终极答案，那就是在双方都相爱的时候共同结束生命，将瞬间的美好永存，这也是日本信仰的东西，短暂的美好才是永驻的，而不是中国人信仰的宁可苟活也不勇死。\n\n说到这里有点跑题了，让我们继续回到主题，既然双方平衡的爱太难太难，如果太互相爱很容易占有对方而早早夭折。所以，人类为了得到长久的感情发展，心理的调节机制就会变成男女不同的交配策略，达到一个不完全失衡的失态状态，这就是有一方或多或少的大于或者少于对方的喜欢，来达换取一个长久的情感维系，一个人喜欢一个人得到情感的新鲜感，而被喜欢的一方得到生活上的照顾与支配权，感情就此维持加长。\n\n爱情定律：人类为了得到长久的感情发展，心理的调节机制就会变成男女不同的交配策略，达到一个不完全失衡的失态状态来换取情感的长久维系，这种机制作用在所有的两性关系中，无论是情侣、爱人、炮友，都会有主导一方与被主导一方。\n\n既然我们了解了这种机制的根源，固然我们希望每个人都能找到一见钟情的爱人，可在这种作用机制下，这实在是很难做到的一件事情，在实际中，男性一般成为追求者的一方，女性成为被动一方，但背后的作用原理却是相反，男性是弱势一方，在合同中是承包工程的乙方，她们向甲方女性来展示自己多么的优秀，自己完全可以将你的幸福生活或者性福生活构建的很美好，最后由具有性资源的甲方的女性来拍板要不要和你在一起。看似男性为主动的一方，在情感的地位中却是弱势。\n\n一般男方主动女性被动的，是因为造物主对男女性别上生物定位决定的，这方面可看《性交配策略》的另一篇文章，我们不在这过多獒述，但我们要提出的问题是，有男性成为追求者，选择一个你喜欢的人，和作为女性选择一个追求你的人，这种策略对吗？我们大多数的情感问题，出轨、不幸福、吵架等等是不是都和这种错误的交配策略有关？当然，这就是我要说的，我们因为错误的交配策略正是我们不幸福的源泉！\n\n首先，我们来分析男性，男性喜欢寻花问柳，喜欢追求自己喜欢的姑娘，但是却忽略喜欢你的姑娘，这本来就是一种危险。男性固然可以通过真情感动一个女人，或者通过富有的物质生活得到一个女人，可如果这个女人是被你追过来，男人就很难长久的忍受住家庭弱势的地位。\n\n男性在选择性对象方面要比女性更加包容，范围更广，即使不十分喜欢的女孩，他们也会毫不犹豫的与之发生性关系，这就给女性追求男性留下了机会，因为你很可能通过性在以后的日子里温柔的对他而让他慢慢对你的好感，男性大多是柔软的。最重要的是，做为女生的你喜欢他就有耐心去照顾他，反而女孩照顾自己喜欢的男生而有愉悦感觉（给喜欢的男生做饭，打扫卫生，洗衣服等）。这种牺牲自我的方式是很难在你不喜欢人身上去实现的。如果男生去给女性主动洗衣服、做饭，开始或许会活得好感，但是日子久了只会让女性更加瞧不起，认为你只是个没用的家庭妇男，有本事的男人都在外面赚钱，而你只会做女人做的洗衣服做饭。所以男生不可以经常的做家务或者做饭，只需要时不时的做一次给女生看我还有温柔的一面，让女生崇拜你就好了。\n\n而女人不同，女人是崇拜式爱情，就算通过真情打动的女孩，会因为日子越来越平淡而慢慢分心，她只是被你感动而不是被你的魅力臣服，通过物质获得的女孩更加脆弱，她们喜欢的是你的物质，当物质满足后，精神的空虚就更加凸显。要想获得一个女人的喜爱，就必须得到一个女人的仰慕与崇拜，女人的爱有点类似追星的感觉，她们必须对爱的目标有一种明星似的崇拜感才会对你死心塌地。否则感动与物质只能得到她们的身体得不到她们的心，为她们以后的出轨埋下伏笔。\n\n而作为男性选择喜欢你的女孩就不一样了，女孩喜欢你本身就是对你身上的某种特质所吸引，大多数是相貌，也有一部分是才华。她们其实对金钱并不是很感冒，但是因为贫穷与外貌的丑陋往往会让男性产生心理上的自卑，这种自卑会缺失人格魅力，让女性无法崇拜你，我说过，女人如果不崇拜你，无论你有什么都是白搭。所以其实女人之所以选择有钱人是因为有钱人更加开朗自信，这种自信对于女人是十分性感的，所以归根到底女人并不是要太有钱（当然太穷那就另说了），还记得大力哥说过的话吗？——男人泡妞就靠两点，嘴和胆量，其实这里的胆量就是自信，女人不喜欢和失败者站在一起，这从生物的繁殖秩序上来看也是一样的，我们都是从亿万个蝌蚪中跑的最快的那个才能与软子结合。\n（其实就我个人来说，我更喜欢用弱势泡妞法，恰恰与自信泡妞法截然相反，我更喜欢从弱势的角度切入到女生的内心世界，不知不觉夺取她们的情感，当然这是我多年总结的一套独有理论，我自己可以驾驭，普通人还是自信阳光法更主流啦。）\n\n反过来讲，作为女性，直接的追求只会让她们觉的你是个loser，女性的喜欢是崇拜型喜欢，她们喜欢仰慕一个人的安全感（我不知道用什么词形容好，她们就是必须要有一个崇拜的偶像，来帮助内心的美好期望得到释放）如果李敏镐死皮赖脸去追求一个不喜欢她的女孩，她的fans们也会大跌眼镜，我的镐镐怎么会这样，这个女人怎么能配的上镐镐，在攻击她人的时候，其实就是内心美好期望崩溃带来的愤怒。明星就应该摆在那里等肉下锅，这叫做范儿，如果你主动追求一个女性，她们会潜在以为你是一个没有魅力的人，没有人喜欢你，缺乏魅力，本来还对你充满期许，但你一旦过快的掀出底牌，她们也就不在对你充满兴趣，感觉你与凡人无异。\n\n这种女孩我经历很多，她们就是这样，开始对我和我的工作充满好奇，总是发一下充满挑逗的话，我对她们保持距离，她们就越发迷恋，可如果我提出交往，她们就纷纷离去，甚至有的女孩直接就说喜欢虐心，就是忽冷忽热的对待她们，其实就是暗示，我不缺乏女孩喜欢，因为我是充满魅力的，如果我那天光顾你，是你的运气。（可我不行，我是诗人，诗人必须真诚，所以我装不出来，哈哈）\n\n所以，综合上所述，每个人在两性相处时都会有弱势和强势一方，只是或多或少的问题，无论是夫妻还是情侣还是炮友，都会有一方喜欢对方多一些，一方喜欢对方少一些，只要没有超过一个界限，就不会影响双方感情，反而这种微弱的不平衡恰恰是感情长久的一个生存机制。\n\n而我们现在生活的却恰恰相反，这就是为什么有那么多分手与出轨不幸福的原因了。男性喜欢做主动追求者，不仅要花费大量的人力物力，还要冒着“对不起我们不合适分手吧”的风险，即使追到，在双方感情中也处于劣势，要哄她照顾她，这并无可厚非，但是最可怕的是你一担失败，女孩就会拿别人说事，你看看那个谁每个月赚多少多少钱，人家买的什么什么车，可我还得和你过穷日子等等，这种比较是男人最受不了的事情。\n\n而选择喜欢你喜欢的女孩就没有那么多了事情，她会温柔的理解你宽慰你，鼓励你。虽然你现在不喜欢她，但在未来建立起来的肉体记忆中，逐渐让你产生依赖感，发现她的优点。因为开始的失望，后来就都是惊喜了。而男人包容式的选择伴侣倾向也会让这种策略行得通。\n\n女孩也应该选择自己喜欢的男人，因为女人对爱情太过执着，眼睛里揉不进沙中，你不喜欢的就真的是不喜欢，真的不能像男生那样包容，所以选择一个你喜欢的，无论日子过的多穷，但是就是喜欢，一切都可以忍受起来，如果不喜欢的，日子过的多富有，女人也就会感情寂寞冷，这就是女性的天质，无法改变！ \n总结：\n所以，在选择自己喜欢和不喜欢获得最大幸福方面来看，我个人的建议是男性应该选择一个喜欢你的女孩，而女孩则应该选择一个你喜欢的男孩。这是因为男性更注重义气，如果你能持久的对他好下去，他也容易被感动，而作为男人应该将目光放置在那些喜欢你女孩身上，感情投资才会更稳妥；而女孩选择自己喜欢的，而不要被物质或其他左右，因为如果不能获得你的崇拜，你也会陷入感情的纠结当中去，在好的物质生活也会空虚寂寞起来。\n\n以上是从性交配策略方面分析问题，只希望给你一种新的启发，最终决定事物的是人类自由意志。"
		},
		{
			"post_id": 19,
			"title": "成功注册chzj.bit为本站域名，感谢@domains4free支持",
			"date_published": 1463181048,
			"body": "之前我给domains4free发了好几次注册域名caihong.bit的申请，都没有得到回信。原来是我要注册的caihong.bit已经被人注册了，而我写信之前没有去查询是否已经被注册。\n\n昨天特意去查了一下chzj.bit没有被注册，赶紧给domains4free发了邮件，今天下午收到了回信：\nHi\n\nI have just registered your domain. It should be online within 24 hours.\n\nHave a nice day.\n\n意思是我要的域名已经被他注册下来了，域名生效的时候预计需要24小时，最后祝我有一个美好的一天。\n\n我查了一下现在已经可以正常通过http://127.0.0.1:43110/chzj.bit   来访问我的网站了。总算也是有自己在zeronet里面的一个域名了。这里感谢domains4free提供的无私帮助和支持。\n\n注册免费的bit域名的方法见东先生的博客文章《在ZeroNet注册一个免费的.bit域名》http://127.0.0.1:43110/mydf.bit/?Post:47 这里就不再赘述了。\n\n最后欢迎大家以后用http://127.0.0.1:43110/chzj.bit   来访问本站哈。。。\n"
		},
		{
			"post_id": 18,
			"title": "和留学生约与和国人女约的区别",
			"date_published": 1463393791.322,
			"body": "近日，本尊与几位出国留学生的妞约了几次不亦乐乎啊，被她们整体的高素质所深深折服，再回想一下约了10多年的国内妞，深感从素质上到技术上都全面落后，遂写下此文于诸君共勉，希望能帮助国人妞提高水平，早日与国际接轨。\n\n留学生与国人女的区别一、直抒达意 不扭捏做作\n\n先不说身材那种国际妞的大妞范儿，那是先天因素咱比不了，没事儿，今天就单说说素质，首先国外留学生不仅仅是直截了当，这一点很重要，大家都是出来玩的有必要扭扭捏捏？我还的哄着你，我这是找女朋友还是找啪友呢？所以没啥可害臊的，都是正常生理需要，不要彼此耽误彼此的时间。\n\n但重要的还不是她们直接，更重要的她们很知道需要什么，很能明确的告诉男性她们想要的东西，这一点非常重要，很多国内女孩喜欢暧昧含糊其辞，这让目的性思维的男性很头疼，琢磨不透，下面我们举个例子，比如留学女会直接说我喜欢什么体位，需要多长尺寸，别废话，直接上照片，而国内女就比比比半天也不知道她想要什么。\n\n区别二、心灵开放 自我保护意识弱\n\n国人女在约的时候自我保护意识特别强，不会刚认识就给你发裸照，这也导致效率低很多，需要一段时间的了解，这种原因其实也不能怪女性，主要还是男性素质低下导致，但留过学的人就比较直接，她们直接发裸照你看我行不，行就约，不行就算，但你也的给我看看你的尺寸，别废话，我需要什么直接提出，能满足就来，满足不了就滚，ilike！\n\n导致这一区别的另一个原因在于心态，很多国人女会说，没有感情怎么行呢？只是也的了解一段时间，培养一些熟悉感，其实这还是一种思想上的差别。\n\n之所以熟悉聊天还是要给心理更多的安全感，但留学生妞就不太在意这种虚无的安全感，因为聊天可以伪装，特别是通过打字等，与其通过那种不确定的自我安慰，不如通过实战了解，她们不需要充满技术型的泡妞达人，她们需要的是有趣的男人，与其闭去揣测，不如大胆冒险去尝试，能舒服就来不舒服就走，展现了女性独立自主精神。\n\n区别三、放的开 主动服务型\n\n最重要的一点就是在床上留学妞放的开，不矜持，不像国内妞房都开了，还要矜持一下，这不让碰，那不给弄的，逼逼事儿很多，有的甚至往那一趟，大有点鸭的感觉，我去，我是和你啪啪啊，还是给你点的鸭子啊，一点乐趣都没有。（我给姑娘舔背的故事就不多说啦）\n\n反观留学妞，积极主动，服务意识强，会配合，会搅动，没有拒绝的体位，就是喜欢往丁丁上吐口水让我有点恶心，不过也是我的问题，不符合欧美主流价值观。恩恩，我多改正。\n\n\n总而言之吧，和留学生约很舒服，沟通很通畅，不会出现某些小细节的停顿与对持，也不需要处心积虑讨好对方，对方有啥就说啥，重要的是受美式幽默的影响，我们的笑点都很一样，互相黑对方也不会让对方不高兴，反而觉得对方是很有趣的一个人呢。"
		},
		{
			"post_id": 17,
			"title": "不啪处女的男人是什么心理",
			"date_published": 1463275681.483,
			"body": "问：哎呀皮皮老师，最近遇到一件棘手的事儿。想听听你的见解。我这边没遇到过相同的情况所以实在没法给盆友支招。\n窝有一个女同事，是处女。最近喜欢上单位一个已婚的小领导。俩人最开始搞暧昧，还聊骚，后来发展到去旅馆约炮。那男人的情况这妞儿都清楚，而且她也很直白滴对对方说：1、自己爱慕对方；2、知道对方有家庭，给不了承诺，但是没关系；3、纯粹是想第一次给一个自己爱慕的人。\n结果那小领导一听我盆友是处女立刻就停了。说第一次对女孩太重要了，生理或者心理都会起很大变化，所以不想轻易要。而且他还说以后都不会继续了。\n我的感觉是，这爷们儿只是想玩玩，没打算负责，但是我盆友完全是知道对方的情况的，也明确告知对方自己会独自承担后果了。所以我就实在不知道这爷们儿心里是咋想的了。故此来请教皮皮老师：这男人的心理状态到底是啥？\n我也是没招了，想给盆友分析下，又不知道从何下手。拜谢……\n\nPS：比较奇怪的一点是。妞儿被拒之后，男的还是想和她亲亲摸摸一下，俩人抱了一会儿，男的硬了，问是不是可以把手伸到妞儿的衣服里。妞儿当时因为紧张，又加之被拒，因此说那还是算了吧。这男的就另开了一间房睡去了。第二天开车送姑娘回家的时候，说以后不会再尝试和她约炮了。\n\n答：你想知道什么呢？我看完了，但我不知道你想知道什么？你想知道这个男人心里怎么想的又有什么意义呢？我觉得这个男人挺好，因为这是对一个女孩以后的幸福负责，也有一个心理就是怕负责任，因为破处女对男人来说很麻烦，第一次就会在女孩的生命中留下不可磨灭的记忆，很可能女孩会赖上自己，这是一种恶意的猜测。\n婚姻久了，都会有麻木，通过上面情况看，男性只是想玩玩，把你同事当做一个调剂品，不想惹大事，给草就草，不给草也有草的，不缺草，所以男孩就是一个不想惹事的心理。太麻烦，人老了就怕两个字——麻烦。\n\n所以，往好了想就是负责任，往坏了想就是怕麻烦，但无论怎么想我都觉得你和你女同事想这个问题都是没事找事，因为性是双方自愿的，有一方不同意就不成，那是强奸。无论什么原因，人家不愿意就应该尊重，再找别人就是，好男人多得是，实在不行介绍给我，我给她破也是棒棒哒，回答完毕！"
		},
		{
			"post_id": 16,
			"title": "记自己被骗的经历，警醒他人。纯文字",
			"date_published": 1463181048.448,
			"body": "这是一篇在某论坛上看到的帖子，感觉有教育意义，复制下来给大家看看！\n\n去年，公司要求我们职业技能提升，给我的任务是：一年内需要取得会计证。\n\n我还认真的从网上开始学习，做习题，但效果不好，测试时都达还到要求，离考试还有一个月了。心中肯定着急。考不上，是要扣钱的。\n\n这个时候，我的QQ邮箱内收到一封邮件，打开后，内容大约是，能通过考试系统能在考试前三天可以取得试题。头脑一发热。加了对方的QQ。和对方联系了。\n\n联系的过程，不多说了，总之是对方让你相信他们有门路，他们能查出我的准考证号及密码。这也是我相信他们的主要原因。\n\n按照他们的要求，付了1440元。考试三天前果然收到了邮件。我急忙打开。查看。切------有密码。\n立即和对方联系，对方说为防止我向有关部门举报，须付500元保证金，考试后退回给我。我这时认为，对方可能是骗子了。没有付款，直接去考试了。\n\n肯定没有过。考完后，在考场楼下，看到、听到好多考生在议论，被骗了，全部是假的。我打听了一下，原来，好多人买了题库，且付了保证金，题库里全部是假的，没有此次考试的内容。\n\n告诫自己：不要走捷径，还需自己努力。\n\n但最后还是要说一下：我国的会计报名系统肯定有问题，并且是内部问题，不然骗子怎么知道我们的准考证号和密码的？ "
		},
		{
			"post_id": 15,
			"title": "泡不到妞竟然是因为这样。。。",
			"date_published": 1463180615.891,
			"body": "应某人的要求，我分享一下我的泡妞经验，（以下内容纯属个人意见，所以泡妞有风险，实战需谨慎）\n\n首先要合眼缘，女友虽然不是跟你一辈子，但如果相处得好，可能会升级为老婆，所以，要自己合眼缘，眼睛作为人的第一觉，当然要先过关。\n\n眼缘过关了就要有自信，没自信就连带着没胆量，然后就没有然后了，平常做人也要有自信，泡妞不是罪，大不了少了个对象。\n\n在这里我要对大家说，泡妞不要以啪啪为前提，不然好妹子会留不住的，我的建议就是‘‘走心’’。年轻的女孩子都以走心交男友为多，一旦加了扣扣，微信什么的先不要急着暗示啪啪啪之类的，多说些幽默的事，问问她今天过得怎么样，开不开心，为什么开心，为什么不开心。\n\n很多人都说暖男注定要拿好人卡，但拿坏人卡的爱情就会长久吗？疼过才懂得珍惜，暖男才是女孩子幸福的依靠，我前面失败的爱情就不说了。\n\n下面我说说我成功的亲身经历。\n\n我跟女友就读高中的时候认识~那时候自己害羞不敢谈恋爱也没心思，彼此就知道班上有这个人罢了。\n\n几年后在一个培训班上，我跟她重逢了，那时候我俩住的地方隔得远，但我还是不辞劳苦的接她上下课，我不时的关心她，有时候下课后会带她到附近逛街，直到有一次载她回家的路上，她靠着我的背睡着了，我就顺势将她放在我腰的手拉到肚子前，就这样一直抱着我到家，就这样捕获了野生妹子一只。\n\n关键是要给妹子安全感，让妹子对你的戒心放下来，不要让她觉得你对她好只是为了得到她的人。女孩子一旦对你放下戒心就会变得主动，这时就是你出手的好时机了。\n\n所以，还在对着屏幕的撸射们，别埋怨妹子难泡~是你不够努力而已，该出手时就出手。"
		},
		{
			"post_id": 14,
			"title": "無法忍受男友看成人网站",
			"date_published": 1463149536.718,
			"body": "同居后，他们把各自的东西搬到了一起。一天早上燕燕突然发现自己的电脑页面设置上出现了很多成人网站的广告和图片，想起来萧玄头天晚上说要加班，半夜起来，用瞭她的电脑。燕燕索性去查看萧玄的电脑，收藏夹裡，竟那麽多类似的网站。\n\n再看他上网的历史，几乎天天都看。燕燕对照几组时间，想想那时他会说有工作还没有做完，有时甚至是两人做完爱没有多久，他再次爬起来。\n\n燕燕感到极不舒服，萧玄从床上下来，立刻就能去看别的女人搔首弄姿，究竟是对性的不满足，还是对她的不满意呢？越想越气愤，有被萧玄敷衍的感觉，她决定向恋爱审判庭上诉，控诉男友萧玄背著她看成人网站。\n\n控罪：背著女友看成人网站。\n\n原告：王燕燕，27岁\n\n被告：萧玄，27岁\n\n法官：现在先传召原告人上庭，由控方律师首先发问。\n\n控方律师：原告人，你先向大家讲述一下被告的犯罪事实。\n\n原告人：我们恋爱九个月后，就发生瞭性关系。我对他说过，我曾有过性经历，他则含糊其辞，没有告诉我他的经历。但我能感觉到他的老练和经验，说老实话，我对这个并不是很在意。关键是我们很和谐，没有一点点压力，也很尽兴。但我没有想到，同居后，他竟然还看成人网站，尤其有时候还发生在我们刚做完爱的时候。\n\n控方律师：你知道后是怎样的心情？\n\n原告人：很憋屈。我觉得两个人的性，应该是和感情一样，要互相坦诚相见。背著我看别的女人搔首弄姿，某种类程度上讲，就是背著我在向往著别的女人。我讨厌这样的感觉。如果是我背著他看色情片，他会怎麽想呢？\n\n法官：现在，请辩方律师向原告人发问。\n\n辩方律师：你曾浏览过类似的网站吗？\n\n原告人：有过，但这个性质不同。他在这样一个狭小私密的空间裡，背著我看，本身就是一件不能摆在桌面上说的事情。否则，他为什麽要一直隐瞒著我呢？\n\n辩方律师：你觉得被告很爱你吗？\n\n原告人：应该是爱我的吧。\n\n辩方律师：那你感觉到他看成人网站后，对你们平时的生活有什麽影响吗？\n\n原告人：不知道前，并没有什麽感觉。但知道后，心裡就开始别扭。再有性生活时，我总觉得有压力，有阴影。我讨厌他这样撒谎，感觉我们的爱情被玷污瞭。\n\n辩方律师：那麽他有什麽变化吗？\n\n原告人：有，我觉得他不是从前的他瞭。\n\n辩方律师：法官大人，我问完瞭。\n\n法官：现在传召被告，由控方律师首先盘问。\n\n控方律师：为什麽你要背著女友看成人网站，是单纯的好奇还是对她的表现不满足？\n\n被告：都不是吧。好奇的阶段已经过瞭，和燕燕在床上也一直都很和谐。\n\n控方律师：那你为什麽那麽爱看呢，特别是刚刚下瞭床的时候。\n\n被告：刚下瞭床，很多时候，确实是因为有工作要做。我的收藏夹裡，放著这样的网站，思路进行不下去时，会忍不住点开来看看。未必真的就是很认真地在看，或者是内心有什麽龌龊的念头。和很多人一样，也是一种放松吧。\n\n控方律师：每个人做任何事情，都有它背后深刻的原因的，你是否愿意讲讲你对成人网站感兴趣的始末呢？\n\n被告：我是二十岁那年，开始看这些网站的。当时还在大学读书，我的性格是男生裡比较懦的那种，自小家教又特别的严格，父母亲从来不会跟我谈性的事儿。我呢，又不大会讨女孩子喜欢。等上瞭大学，眼界大开，仿佛突然让我进入瞭另一个世界。我们班那时已男生女生在外面租房住瞭，卖避孕套的自动机就放在学校的大门口。有次几个有男生聊天，我说我还是处男，立刻引来哄堂大笑。\n\n这事让我无比地自卑，我不大再敢跟人说性方面的话题瞭。从那后，开始有意识地找这方面的网站看，确实很刺激，有段时间甚至上瞭瘾，耽误瞭学习和生活，很危险。后来觉得不谈个女朋友不行瞭，要解决生理问题，同时也有心理问题。说老实话，这事我做得有点卑鄙，那个女孩子，我并不是很爱她，她长得太平淡瞭，又不是我喜欢的类型。\n\n碰到燕燕，是我的幸运，我们在这方面很和谐。\n\n至于我浏览那些网站，说穿瞭，和别的男人没有什麽区别，就是两个原因：一，就是放松，有点取乐的意思。二，很希望自己能更老练一些，带给燕燕更多的快乐。算是学习吧。\n\n控方律师：背著女友看别的女人，并以此而激发性欲，不说道德，但至少是一件不够体面的事儿。法官大人，我问完瞭。\n\n法官：现在，请辩方律师向被告发问。\n\n辩方律师：请问女友知道瞭这事后，你是怎麽跟她做的解释？\n\n被告：我说我很爱她。\n\n辩方律师：告诉过她你刚才说过的那段故事吗？\n\n被告：没有说。\n\n辩方律师：为什麽？\n\n被告：总觉得那些琐碎的感觉，都不够光明正大，不知道怎麽理直气壮地讲出来，也不知道这能否算是理由。\n\n辩方律师：如果没有这些能轻而易举就进入的成人网站，你会专门去买类似的书籍看吗？\n\n被告：不会。\n\n法官：现在，由双方律师作结案陈词。\n\n控方律师：被告说因为爱女友，才去成人网站，这是一个谎言。爱完全可以正大光明地表达，他如果觉得自己做得理直气壮，为什麽要背著女友呢？可见在他的内心深处，也觉得这是不妥的，所以，被告的行为事实，已经对原告造成瞭心灵的伤害。我恳请各位陪审团判被告罪名成立！\n\n辩方律师：浏览成人网站，对每个成年人来说，并不构成任何犯罪或破坏行为。所以，我恳请各位陪审团，判被告罪名不成立！\n\n法官：陪审团，有瞭裁判结果没有？\n\n首席陪审员：法官大人，我们5对2通过判被告罪名成立。\n\n法官：本席宣判，被告背著女友看成人网站罪名成立。本官认为原因有二：一，对相爱的男女来说，性生活更是爱情的一部分，不管每个人成长背景或深层欲望有什麽特别，作为亲密配偶的对方，都有权利瞭解你的性取向和性爱好，并有义务一起为和谐高质量的性生活创造条件。任何给对方的性心理带来不安不快甚至恐慌的行为，都是严重违背爱的初衷的行为。二：目前国际上成人网站对婚姻家庭的影响都越来越严重，就是因为缺乏交流，加重瞭嫉妒、不满、厌烦等等问题。对很多男人来说，这是舒缓压力的方法。但不能否认，网上的此类生活一样会影响到当事人离线后的活动，至少会降低当事人自控自律的标准。\n\n所以，本官判决如下：以后被告如需要看成人网站时，应该和原告一起看。同时鉴于目前成人网站法律界定不够明确、且常有色情犯罪背景的情况下，电脑应装载自动过滤器。"
		},
		{
			"post_id": 13,
			"title": "瞎花钱丨花12万，报17个培训班，3年后，学霸儿子竟成了学渣",
			"date_published": 1463149373.336,
			"body": "“望子成龙”、“望女成凤”都是家长的夙愿。为了实现这个愿望，许多家长从小就把孩子送进各种培训班。3年前，湖北武汉一妈妈砸12万为5岁的儿子报了17项培优班，3年过去了，当时自信的妈妈如今在朋友圈哀叹，当初的“学霸”儿子竟变成了“学渣”！\n\n## 花12万报17个培训班为5岁儿子培优\n\n2013年7月6日，武汉市孩子刚放暑假第一天。在武汉水果湖某幼儿园就读的5岁半男孩Jerry在培优机构组织的小托福考试中得了全国前三名。Jerry的妈妈徐女士特别骄傲：“我的辛苦没有白费。”\n\n从半岁到5岁，Jerry已受过英语、数学、识字、声乐、钢琴、围棋、画画、表演等17项培优，5岁的他已经学完了小学二年级的全部课程。每周只有半天休息，每晚都到9点才回家，徐女士算了一笔账，5年来，累计投入了近12万元培优费，“投进去一套房子的首付了，周围也有很多人质疑我，不过我丝毫不后悔。”\n\n徐女士当时“特别想孩子从小就比别人优秀”，“我不想让儿子输在起跑线上……”徐女士想通过培优让孩子从小养成自觉学习的习惯，到了中学，就不再需要再去安排他的生活。她认为培优会让孩子的学习成为一种条件反射的状态。等他上初中、上高中了根本不需要操心。\n\n## 一年级时儿子觉得同学都是笨蛋\n\n然而，三年过去了，让徐女士万万没想到的是自己曾经的“学霸”儿子怎么就会变成“学渣”了？！\n\n徐女士说，Jerry刚读小学一年级时，学习成绩还是非常优秀的。可是，慢慢的Jerry觉得厌倦了，因为老师讲的课本知识自己都会，这让他觉得老师讲的东西太简单，其他同学都是笨蛋。无奈之下，徐女士只好继续给Jerry报了数学和英语培优班。\n\n## 二年级时学霸儿子变成了学渣！\n\n这样又过了一年，今年读二年级的Jerry学习成绩开始慢慢下降，从前的尖子生变成了中等生。“他变得厌学、上课不听讲、课后作业不好好完成。”如果不盯着他学习，他完全就不“好好搞”。这让徐女士非常担忧：“跟我当年预想的完全不一样……培优也根本不会让孩子的学习变成一种条件反射的现象。”\n\n同时，更令徐女士头痛的是Jerry马上要上小学三年级，学习任务开始慢慢加重，孩子的老师也多次劝说自己要改变Jerry目前的学习状况，必须停下所有培优班，跟着班级的进度来，重新培养学习习惯。\n\n## 妈妈反思：孩子就该在适当的时候做最适当的事\n\n面对如今孩子的现状，徐女士进行了反思，自己太早开发了孩子的学习能力，孩子就应该在适当的年龄做最适当的事情。幼儿园时期本该是孩子玩耍，培养良好生活习惯的时候，自己却让孩子把全部的时间用在了培优上，导致孩子的生活和学习习惯都有所欠缺。\n\n徐女士称自己的经验真的是“血泪经验”，她希望身边的父母别再犯同样的错误了！\n\n那么问题来了，孩子学前应该get哪些能力呢?\n\n学语言：在孩子0-6岁，培养孩子语音敏感性很重要，但这不是指让孩子多识字、写字，而是要让孩子听到各种声音、各种语言，鼓励孩子唱诵歌谣、复述故事，培养孩子的语音意识和正确发音能力，培养孩子对语言理解的能力，特别是听说方面的能力。\n\n激发好奇心：好奇心强的幼儿接触新事物时注意力集中、爱提问、爱探索。面对孩子提出的问题，父母应采用合适的方式实事求是地回答，满足孩子主动探索的心理，鼓励孩子对新异事物和未知事物的好奇与关注。\n\n树立独立性：3-5岁是儿童行为独立性快速发展，为今后其情感独立和认知独立的发展奠定基础，所以在这个时候要积极培养孩子的独立性，减少孩子对父母的过分依赖。\n\n所以，家长可以依据孩子的独立性发展特点，创立宽松的环境氛围，让其愉快地玩耍，自由地交流，自己做主，做力所能及的事情，独立思考解决问题。\n\n培养行为习惯：良好的习惯对幼儿身心的健康、知识的获得、能力的培养、品德的陶冶、个性的形成都是至关重要的。学前家庭教育要有意识促进孩子的生活、学习、思维、人际交往等行为习惯的养成。\n\n有研究发现，入学后，没有朋友比成绩差更糟糕，被拒绝的孩子容易出现社会适应不良、心理失调、学习成绩不佳等现象。因此，入学准备很重要，需要引起家长的关注与重视。"
		},
		{
			"post_id": 12,
			"title": "背上“嫖娼之名”的雷洋死了，何以迟迟不还事实以真相？",
			"date_published": 1462938243.915,
			"body": "## 刚为人父的人大硕士，为何①小时内离奇死亡？\n\n雷洋，湖南澧县人，从山村走出的中国人民大学环境学院本科生和硕士生。TA.于2012年以优异的成绩毕业，任职于中国循环经济协会，成为我国环境经济和循环经济领域的专家，曾参与了多个工业园规划，生态文明规划，污染物处理规划和循环经济规划的编制工作，在中国最著名的③个环境保护期刊《环境保护》，《环境科学》，《环境工程》上面都发表过论文，是我国环境保护事业中不可多得的青年才俊。\n\n如今，TA.的尸体却躺在医院冰冷的太平间，遍体鳞伤。而TA.的女儿，刚刚出生两周，还没足月。\n中间到底发生了什么？以下是我们所有同学在律师的指导下，根据事实整理的说明。\n\n<关于人民大学雷洋同学意外身亡的情况说明>\n\n雷洋，系中国人民大学2005级环境学院的本科及硕士研究生，任职于中国循环经济协会。现于2016年5月7日晚离奇死亡，我们作为同学经过与亲属初步沟通了解，现知道的主要情况如下：\n\n## 1· 事件大致过程：\n\n由于雷洋在4月24日刚和老婆生下①个可爱的女孩，TA.的亲属要过来探望，所以TA.于2016年5月7日晚21时左右从家里出门去首都机场接TA.的亲属（航班预计到达时间23点30分）；之后就失去联系。\n\n从晚上23:30至第②天凌晨1点，其妻子和亲属不间断打电话，但手机①直处于无人接听状态。直到凌晨1点电话有人接听，接听人自称来自昌平区东小口镇派出所，并告知亲属需要去派出所，亲属于1:30左右达到派出所。派出所告知的大意是：雷洋因涉嫌嫖娼，在警车带往派出所的途中因心脏病突发死亡。根据昌平区中西医结合医院给出信息，雷洋达到医院时间为2016年5月7日晚22点09分，到达时已经死亡。\n\n凌晨4:30左右，亲属随警察来到医院，见到雷洋手臂和头部都有明显淤血，与警察交涉，警察给出答复为路途中雷洋反抗强烈，跳车头部着地所致。亲属要求对遗体拍照留存被禁止。\n\n## 2·我们的疑问：\n\n根据我们了解到的情况，我们产生了①系列疑问：\n\n1） 雷洋几乎每周都会踢足球，全年无休，据了解亲属也没有心脏病史，为何会突发心脏病？\n\n2） 手臂和头部的淤血如果为跳车所致，应有明显外伤，可是据家属观察无明显外伤。按照东小口镇派出所所述，执法后已被制服并招供，为何还会尝试并成功做到跳车？\n\n3） 医院给出的雷洋死亡时间为22点09分（达到医院时间），可是在之后长达近两个小时的时间，为何派出所不联系亲属，并且亲属①直打电话也无人接听？\n\n4） 亲属交涉后发现，雷洋手机中死亡前几日的通话记录，微信朋友圈里面关于孩子和家庭的信息，手机里面的位置记录都被部分删除，这是何人所为？为什么需要这样做？\n\n## 3·现在的情况；\n\n我们是雷洋人大的同学，在今天上午听到此事后都非常震惊，完全不敢相信此事会发生在我们身边。我们无比痛惜①个刚出生2周多的孩子就这样失去了父亲，我们无比痛惜①个刚生产完的妻子就这样失去了挚爱，我们无比痛惜其年迈的父母就这样失去了年轻而前途光明的儿子。\n\n所以，我们需要了解更多，我们需要我们的疑问得到解答，我们需要社会各界的帮助和支持，支持我们为①个逝去的年轻生命还原真实过程，给其悲痛的亲属①个交代。\n\n上述说明，已经被朋友圈，天涯，水木等网站和论坛删除。\n\n雷洋的朋友圈里，全部是TA.参加会议，讨论和研究的消息，而TA.的头像，是TA.的女儿握着TA.的手指。\n\n我知道，我的力量很小，我的声音很弱。但我愿意相信，关注我们的知友们，是了解我的真诚的。我更愿意相信，在中国，在北京，在互联网上，是有公道的，有正义的！\n\n根据上述说明信息，雷洋手机中的信息存在被破坏的可能性。我们非常担心还会有别有用心的人破坏证据，阻挠调查。因此在目前这个阶段，这篇文章的主要诉求就是希望将这个悲剧和相关的说明通过各位知友的努力扩散出去，以舆论的力量遏制这些人破坏证据的行为，以公众的力量保障程序的正义！"
		},
		{
			"post_id": 11,
			"title": "念佛吃斋后收贿赂，佛龛下藏淫秽光盘",
			"date_published": 1462937950.536,
			"body": "1. “河北第一秘”李真28岁即成为河北省委第一秘书，34岁就成为全国最年轻的正厅级国税局局长，2000年因受贿上千万元被执行注射死刑。据媒体公开报道，在李真在仕途升迁过程中，曾多次找“大师”算命，卜问仕途，高兴时候还会给予大笔钱财奖励。 在获悉中纪委要对他实行“双规”前，他就做好了半夜里出逃的准备，李真事先征求“大师”的意见：我近日有灾祸吗？大师答：“没事，你有贵人相助的”。李真信以为真，第二天就接到通知，让他下午到省委“开会”，从此一去不复返了。\n\n2.山东省泰安市原市委书记胡建学经常请“大师”来替自己测算“前途”。一次一个“大师”说，胡有当副总理的命，只是还缺一座“桥”。欣喜若狂的胡建学绞尽脑汁，终于想出了一个增加一座桥的办法，下令本已按计划施工的国道改线，莫名其妙地穿越一座水库，最后在水库上修起一座大桥，以完成“功德”。大桥建成后，胡建学将其命名为“岱湖桥”。不过，他事发入狱后，老百姓给大桥改了个名字：“逮胡桥”。\n\n3.原湖南省政府副秘书长唐见奎，为求不断升迁，经常找“大师”问计。他最崇拜的“大师”是南岳衡山一座小庙里的一名和尚，因为这名和尚曾“算准”了他职务升迁过程中的几件大事。为此，他大笔一挥，拨出200万元的财政专款，修了一条通往这座小庙的水泥路。\n\n4.1996年，河北省原省委常委、常务副省长丛福奎到河北任职后，因认为仕途已到顶点而产生了心理不平衡。在“大师”殷凤珍的鼓动下，丛福奎在家里设了佛堂和道台，每月初一、十五都要烧香、念经、打坐、拜佛。为了得到神的“保佑”，他还在被褥下铺了五道佛令，在枕头下压了五道道符。“布阵”完毕后，他与殷凤珍狼狈为奸，打着做佛事、善事的幌子，多次向私企老板收取钱财，累计多达1700余万元人民币。\n\n5.内蒙古自治区政府原副秘书长兼法制办主任武志忠把家里一间屋子专门装修成佛堂，供奉了近百尊大大小小的佛龛、佛像、佛塔、佛画，把念经拜佛当作每天必修功课。但在供奉佛像的柜子下面，竟存放着近百张不堪入目的黄色淫秽光盘。\n\n6.深圳原市委常委、政法委书记蒋尊玉涉嫌贪腐过亿。办案人员发现，蒋尊玉家里专门有一间佛堂，供奉着十几尊佛像，但书柜里不见一本书，摆的全是烟酒、玉器、古董、字画。\n\n7. 江西省政协前副主席、省委统战部前部长宋晨光与王林私交甚笃。媒体报道称，王林不仅是宋晨光在问神算卦方面的“大师”，更是其高级顾问。宋晨光在官场事务和人事任免方面都要征求“大师”的意见。据悉，宋晨光仕途上能一路高升并获“带病”提拔，他自认为跟极力推崇鬼神之说及风水玄学有很大关系。\n\n8.2013年7月8日，刘志军受贿、滥用职权案一审宣判，刘志军被判处死刑，缓期二年执行。起诉书中提到，刘志军是一个迷信的人，这也已成为铁路系统圈内公开的秘密。为求“平安”，刘志军长期在家烧香拜佛，还在办公室里布置了“靠山石”。一些项目的开工竣工，刘志军都会请“大师”选择黄道吉日。北京市海淀区复兴路10号院，原铁道部大院门前有一对石狮子，据称也是刘志军在2008年4月28日之后将它安放在门口的，目的是驱邪震祟。\n\n9.徐国元在担任赤峰市委副书记、市长期间，利用职务之便,单独或伙同妻子李敏杰，先后收受钱物折合人民币1048万余元。堕入腐败深渊后,他试图靠祈求神灵保佑,来获得心理上的安慰。他在家中常年供奉神龛,日日烧香拜佛,每次收到钱款,都要在神龛下面放一段时间,祈求不要被发现。他隐匿赃物的箱包也极为讲究——四角各放一捆钞票,中间放一尊金佛或菩萨塑像,以求“四平八稳”。\n\n10. 深圳市社保局原局长邱其海，在1994年上任后的四年时间内，先后收受人民币79.999万元、港币2万元的贿赂。据透露，邱其海自从收受第一笔贿赂后，就开始求神拜佛，只要见到庙宇，就会进去烧香磕头。而且，每次听到警笛声，他都会赶紧念叨几句“菩萨保佑”。\n\n11.被查处的海南省屯昌县工商局原局长吴岩，先后6次向原海南省工商局局长马招德行贿20余万元，而他对求神拜佛也情有独钟。为了方便参拜，他在家里布置了两个佛堂，每个月都要领着亲信，一道虔诚地参拜菩萨，祈求自己的腐败罪行不要曝光。"
		},
		{
			"post_id": 10,
			"title": "如果是你，你会怎样？",
			"date_published": 1462756564.263,
			"body": "　 一个青年刚刚大学毕业，凭借着自己的能力，他找到了一份人人羡慕的高薪工作，在一个海上油田钻井队里做技术员。\n\n　　工作的第一天，领班要求青年在限定的时间内登上几十米高的钻井架，把一个包装好的漂亮盒子拿给在井架顶层的主管。\n\n　　青年对这第一个任务信心百倍，他拿着盒子，快步登上狭窄的舷梯，登舷梯是十分累人的，当青年气喘吁吁、满头大汗地登上顶层，把盒子交给主管时，主管只在盒子上面签下自己的名字，又让他送回去。于是，青年按照吩咐又快步走下舷梯，把盒子交给领班，而领班也是同样在盒子上面签下自己的名字，让他再次送给主管。\n\n　　青年此时有些耐烦了，他觉得这项工作一点意义也没有。可是领导的命令不得不执行，于是青年又转身登上舷梯。当他第二次登上井架的顶层时，已经浑身是汗，两条腿抖得厉害。主管和上次一样，只是在盒子上签下名字，又让他把盒子送下去。年轻人擦了擦脸上的汗水，转身走下舷梯，把盒子送下来，然而，领班还是在签完字以后让他再送上去。\n\n　　青年有些生气了，他觉得主管和领班是在跟他开玩笑。他长长地叹了一口气，尽力忍着不发作，擦了擦满脸的汗水，抬头看着那已经爬上爬下了数次的舷梯，拿起盒子，步履艰难地往上爬。当他上到顶层时，浑身上下都被汗水浸透了，汗水顺着脸颊往下淌。他第三次把盒子递给主管，主管看着他慢条斯理地说：“请你把盒子打开。”\n\n　　青年于是打开了盒子——里面竟然是两个玻璃罐：一罐是咖啡，另一罐是咖啡伴侣。年轻人终于无法克制心头的怒火，把愤怒的目光射向主管。主管接着对他说：“请你把咖啡冲上。”这时，青年将所有的愤怒和不满全部发泄了出来，他“啪”地一声把盒子扔在地上，大声地说：“我不干了！”\n\n此时，主管摇了摇头，对青年说：“很遗憾，如果你再忍耐一下，你就可以通过这个考验了。刚才我们所做的是一种‘承受极限训练’，因为我们在海上作业，随时会遇到危险，这就要求队员们有极强的承受力，承受各种危险的考验，只有这样才能成功地完成海上作业任务。你已经通过了前面三次，只差最后一关，你没有喝到自己冲的胜利的咖啡。因此，对不起，您不能在这里工作了。”\n## 人生感悟\n\n**“骐骥一跃，不能十步，驽马十驾，功在不舍。”忍耐，对于每个人来说都是痛苦的，因为忍耐压抑了人性。但是，成功往往就是在你忍耐了常人所无法承受的痛苦之后，才出现在你面前的。当困难来临时，请再坚持一下，千万不要只差那么一点点就放弃了。**"
		},
		{
			"post_id": 9,
			"title": "北大教授：中国医改是一群脑子不好的人在开特奥会",
			"date_published": 1462755214.762,
			"body": "## 导  语\n*21岁青年魏则西之死，把医院再次推上了风口浪尖，看病难，看病贵，挂个号都要找关系，甚至医院被莆田人承包，院长收黑心钱。不仅是今天，肇始于2003年那场空前严重的“非典”危机，很少有人注意到，新一轮医改已然走过了十多年历程。在北大教授李玲眼里，医改问题多多。比如“**民营资本也不是傻子，没有一家愿意自己办医院，都是想去牟利的。把公立医院这最后一块蛋糕分了，能解决老百姓看病的问题吗？**”*\n\n“我们这几年的改革仅仅是在基层，占总体医疗服务不到20%。在创收趋利的大环境下，基层那点小芝麻虽然洗白了，可西瓜还在吃着膨胀剂拼命生长。”4月26日，在北大朗润园举办的“中国经济观察”论坛上，北大国发院教授李玲回应了许多人的失落。**李玲和她的同行们曾开玩笑，中国医改是“特奥会”，一群脑子不好的人在开特奥会，发令枪一响，四下乱跑，参与但不负责任**。\n\n## “我是中国派”\n\n十年相与，缘分匪浅。也正是在2003年，李玲抛弃马里兰大学终身教职的金饭碗，成为新医改坚定的研究者与推动者。\n\n医改十年，且争议且前行。作为政府主导医改模式的坚定支持者，李玲主张医疗卫生的定位是公益事业，“稍微有点良心的人，都不应该把医疗作为一个赚钱的行业”。援引英国、日本等国际主流医疗体系模式，李玲直言由于国内经济界“唯市场派”的影响，中国医改闹过不少国际笑话。截至目前，这种笑话仍在继续，将民间资本引入公立医院改革即是一例。\n\n“如果说吸引民营资本扩大供给，就去办医院好了，倒腾现有医院干什么？**民营资本也不是傻子，没有一家愿意自己办医院，都是想去牟利的。把公立医院这最后一块蛋糕分了，能解决老百姓看病的问题吗？**”\n\n即使民营资本自愿创办医院，医疗卫生资源也应严格规划。“过度更可怕，在卫生经济上叫供给诱导需求，有多少医生就会有多少病人，小病可以大治，没病可以整出病来。”\n\n在李玲看来，从安徽和三明模式的成功尝试出发，新一轮医改必须强调综合治理，重建包含一系列政策的新制度。在此意义上，医改为未来总体改革探路，关乎千载难逢的中国机遇能否把握。\n\n事实上，李玲的认识与视野也伴随着她的研究对象不断推进，社会治理与民主探索亦成为题中之义。\n\n当记者说她应该算左派知识分子时，李玲笑了。\n\n“我到美国参加学术会议，同行都批我右，现在像我这种人变成左的了，可见我们中国人实在是右到极端了。”\n\n顿了顿，她说“我觉得我是中国派”。\n\n## 回归医疗公益属性\n\n“‘非典’的发生，可能也是个必然，我们的医疗卫生体系到了非改不可的地步。”\n\n李玲做了一组数据对比。1978年时，医疗卫生的定位是福利事业，个人支付不到20%，政府支付三分之一，社会支付剩余部分。到2000年，个人支付超过60%，政府与社会支付双双下降，其中政府支付仅为15%。中国的医疗公平排在全球倒数第四，从当年好的榜样一下子变成坏的榜样。\n\n在确定如何改革之前，李玲认为应该首先弄清现代医疗的问题。\n　　\n作为工业革命之后现代文明的产物，以西医为主的现代医疗突飞猛进，可弊端亦不断滋生，忽略生命的整体性与自愈能力，“完全靠外部的力量，靠仪器、靠设备、靠药物，靠手术”。造成医疗费用越来越贵，到达经济难以支撑的程度。\n　　\n“美国是最典型的例子，人均年医疗费用高达近9000美元，18.5%的GDP投入到医疗领域，1/3的人因为看病破产。奥巴马为什么要推动医改？不改，人力成本太高，企业没有竞争力，国家失去竞争力。”\n\n在美国看病为什么这么贵？在李玲看来，恰恰因为美国比较多地利用市场机制，各种新药、新仪器、新设备、新的检查不停刺激，而且大量费用发生在生命最后阶段，完全没有效率。\n　　\n医疗卫生体系的设计，应该更好地遏制现代医学所谓高精尖的肆意膨胀，要能够承担得起，要加强人口健康的宏观治理。公益体系与市场体系，前者效率差一点，可后者费用太高，“最后要把国家搞垮”。\n　　\n医疗最大的特殊性在于，“你的医疗，医生做主”。关键在于给予医生什么样的激励，与市场化激励不同，“在公立医疗体系中，给医生的激励就是让他怎样以最少的钱给老百姓看好病”。与许多同行看法一致，李玲认为，公立医疗体系的选择实属“两害相权取其轻”。\n　　\n李玲经常拿英国举例。作为老牌市场经济国家，英国采用去市场化的公立医疗体系，人均费用只有美国1/3，人均预期寿命却比美国高得多。英国人以此为傲，还特意在2012年伦敦奥运会上向全球展示。日本则立法禁止盈利性的医疗机构，人均预期寿命世界领先。\n　　\n李玲认为，不能单纯将微观效率作为判断医疗体系的评判标准。现在所讲效率多指医疗机构的微观效率，更应关注宏观效率，即一国如何用较少的钱，保障老百姓的健康。\n　　\n国内一些“唯市场派”经济学家不了解卫生经济的特性，将医疗类比餐饮业，闹出不少笑话。\n　　\n2007年，全球医改专家汇聚北京，评审中国医改方案。听完上半场一些中国经济学家的“市场论”后，外国专家们坐不住了。在休息期间，他们自动站到一起，讨论完后，找到当时的医改领导小组组长马凯，“下半场开始可否给我们10分钟，我们有几点共识跟大家分享”。基本的共识是，医疗是市场严重失灵领域，不能靠市场机制来解决；医疗保险也是市场严重失灵领域，靠商业保险从来解决不了全民覆盖的问题；药品是商品，不是普通商品，没有一个国家靠市场来解决药品的问题，必须严格监管……。\n　　\n“好比一记耳光，可打完了仍继续讲”，李玲有些无奈，一些大谈医改的专家连最基本的卫生经济学的文章都没有读过。\n　　\n让她欣慰的是，2009年4月6日正式出台的医改方案，最终确定政府主导的模式，明确了医疗卫生的公益属性。\n　　\n李玲并非反对医疗体系中的市场因素，**在她看来，应该首先保障医疗领域的国家队，解决多数人的看病问题。事实上，国内医疗领域一直对市场放开，私立医疗机构的数量已超过公立医院。**\n　　\n“世行的专家来中国考察一个多月后，得出的结论是，**中国根本没有真正意义上的公立医院，一家都没有。”正因为在中国全是盈利性的医院，医患关系才变得如此紧张。**\n　　\n新一轮轮改革的重点在公立医院，可改革的方向并不是将它们卖给民间资本。如果这样，在李玲看来，可能会带来中国式的次贷危机，需要引导的应该是那些真正做慈善的民营资本。\n　　\n“宿迁模式已经证明是失败的。**当年宿迁市政府将当地最好的人民医院以7000万元卖掉，现在却要花近20亿元重办公立医院，一进一出多大成本？”**\n\n## 改革需要宏观治理\n\n2009年出台的医改方案，是唯一做过顶层设计的改革，由16个相关部委共同签发。只是，这一方案的可操作性并不强，只是定了目标、原则和方向。\n　　\n**李玲和她的同行们曾开玩笑，中国医改是“特奥会”，一群脑子不好的人在开特奥会，发令枪一响，四下乱跑，参与但不负责任。**\n　　\n然而，改革路径却可能孕育其中。\n　　\n在李玲看来，从基层医疗着手的安徽模式，破除了“以药养医”的旧制度，创立了一套包括政府办医制度、人事制度、分配制度、药品招标采购制度、财政投入制度的新制度，是综合改革，也是宏观治理，“像扳道岔一样，从旧制度扳到新制度”。\n　　\n**这套制度中最为核心的是，明确政府办医机制。**不仅解决事业编制与财政投入，还要定标准，定规矩，做好医疗卫生资源规划。\n　　\n**其次是人事制度，改变过去“大锅饭”的人事制度，实行竞争性人事制度，定编定岗不定人，和医生签订合约，干得好才能续约。**\n　　\n分配制度则设立了一套选出好医生的综合考评体系，优劳优得，看他是不是为老百姓提供服务，是不是有比较好的医术，是不是有比较高尚的医德。\n　　\n**过去的药品招标采购其实是假招标，“一种药有几百家中标，只招一个虚价，而不给量的保障，这些厂家只得跑到医院、医生那公关。”**\n　　\n安徽采用“双信封”模式，第一个信封实行综合打分，先把质量不好的药品筛掉，第二个信封则选择低价药品。“一种药只招一家，以市场换量，你还去搞什么公关？”这样就把药品流通领域虚的成分挤掉了。\n　　\n财政投入机制，通过一套复杂的激励机制，建立了一套“好医院”的标准。“相当于设置了一个方盒子，在政府设定的框架里，既要给医院积极性，也不能让它瞎积极。”\n　　\n由于实施效果良好，安徽模式很快引起高层注意，在2011年被推向全国。推广的效果也非常好，“根据2012年做的一个全国农村的评估，85%以上的农民都满意”。\n　　\n面对运行中的问题与质疑，李玲认为，评判一项改革，主要看大方向对不对，不是看枝节，一个制度的建立、巩固和完善，需要相当长的时间。\n　　\n三明模式是针对县级以上公立医院的改革，同样是一整套宏观治理。改革的亮点集中于药品零差率、三保统一、院长医师年薪制。所谓“三保统一”，即全市实现城镇职工基本医疗保险、城镇居民医疗保险、新农合医疗保险三类经办机构的合一。\n　　\n改革一年后，三明市财政负担并未加重，省出了7亿多元的医药费，医患冲突大大缓解，“病人给医生送土特产，送锦旗”。\n　　\n在李玲看来，政府应该为老百姓的医疗兜底，事实证明也不难。**在三明那样要啥没啥的穷地方，人均只要花1000元钱，就解决了老百姓看病的问题。**\n　　\n李玲有个信念，在与美国未来的竞争中，中国最大的优势在医疗卫生。\n　　\n目前，奥巴马的医改已基本偃旗息鼓，趋利机制依然存在，在老龄化的夹击下，医疗将拖垮美国。与之相比，中国曾创立好的体系，而且这套体系的根基还在。\n　　\n“现在全世界都病了，治疗世界病需要中医的方法，中医背后中国文化的特点就是全面系统综合。”\n　　\n李玲认为，应该综合配合，传播养生文化与健康生活方式。除了2009年医改方案所设计的，在中央台开设健康频道，为什么不在微信开设健康教育的公共平台？\n　　\n**一次会上，李玲还批评了卫计委的领导，“习主席出去吃包子，你们为什么不派营养师去提建议？让他吃5个肉包子，还吃一碗炒肝，现在还变成习套餐，全是高脂肪，多不健康啊！”**\n　　\n李玲认为，中国最大的希望，在于大一统的社会制度+互联网+中国文化，如果能对三者集成创新，将带来最大的制度创新。\n　　\n包含医改在内的社会保障制度改革，是未来改革的重要抓手。\n　　\n**以户籍制度改革为例，李玲认为，户籍制度本身不是问题，问题在于背后所涉及的医疗、教育、养老等保障制度。未来随着改革，统筹层面越来越高，全国都一样了，户籍又有什么关系？**\n　　\n一旦这样，中国社会支离破碎、一盘散沙的现状将得以改变，人心得以凝聚，社会得以重建。\n　　\n在李玲看来，中国赶上了前所未有的发展机遇。\n　　\n“十年前，当小布什将目标对准中国的时候，一场911，给中国解套。去年奥巴马宣布重回亚洲，又将所有目标对准中国，现在来场乌克兰危机，再次给中国解套。”\n　　\n机遇目前，最大的风险在于中国顽固的习惯势力。\n　　\n“凡是西方的都是对的，凡是市场的都是对的，已经变成新‘两个凡是’了。”如果在上世纪80年代，中国需要一场市场的启蒙，现在则需要另一场新的启蒙。\n　　\n一位中国派的再认识3月26日，在省部级干部医改座谈会上，国务院副总理刘延东表示要将县级公立医院的改革试点扩大到1000个。在李玲看来，试点成功的关键在于，改革的主导者应为地方政府，而不应是医院。\n　　\n对新一轮改革，李玲仍存忧虑。医改是综合改革，需要一个总的指挥部负责统筹。过去两年，“就是在折腾民营资本，把医改办这个指挥部给灭了，弄到了卫计委”，好消息是，指挥部又快回来了，但“折腾了一大圈，这是什么代价？”\n　　\n“把深化医改领导小组与习主席担任组长的全面深化改革小组挂钩，那样才能真正理顺关系。如果那样，医改小菜一碟。”\n　　\n“真的，小菜一碟”，李玲的语气充满坚定的期盼。\n\n## 中国的天赐良机\n\n>作为一名受理想主义教育长大的60后，李玲的许多选择并非从个人最优出发，而是从国家需要与社会最优所做的选择。但回过头看，她认为这种选择事实上帮她实现了个人最优选择。\n\n>上大学前，李玲是个文学青年。1978年高考的时候，国家号召有志青年“科技救国”，于是她学了物理。9年物理学习，为她奠定认知世界的全新能力。后来发现国家最缺的是经济管理人才，她转学经济，又从宏观经济转到卫生经济，恰好赶上中国新一轮医改。\n\n>去国16年，2003年，李玲决定回国时，最难抉择的却是14岁女儿的适应能力。对她那一代人来说，“还是跟受的教育有关系，无论学物理学经济，包括出国留学，一个理念就是希望能为中国做一些事”。而对美国出生长大的孩子，为她做选择很难。幸运的是她女儿回国不仅很快适应国内学习，而且和中国共成长，她从国内考上哈佛大学，本科和研究生毕业后就回国，现已在国内工作近两年了。\n\n>回国10年，李玲笑称确实挺受折磨，折旧很快，可成就感很强。一方面尽了最大能力推动社会发展，另一方面，由于长期在基层调研，李玲觉得自己的认知能力已经超越医改，对世界、社会的认知都达到了一个新的高度。\n\n>这种认识上的升华体现为对中国、西方和经济学的再认识。\n\n>中国三十年的发展奇迹，无法单纯用市场解释。中国的工业化是一种集成创新，靠着丰富的人力资本，一代人受了两代人的苦。对中国“泛市场化”的现状，应跳出三十年来不断的洗脑，从历史、国际和现实的维度真正客观公正地认识历史，认识世界，认识当今中国。\n\n>在李玲看来，西方式民主正经历着自身的危机。民主虽然是必由之路，但对素来缺乏民主基因的中国人，可以探索出一条新路：“选事”的协商民主。未来中国治理体系的目标是，有为的政府，有效的市场，有机的社会三者之间的有机融合。\n\n>在李玲眼里，西方经济学日渐变成象牙塔里的数学游戏，对现实的指导意义很弱，堪称“庸俗经济学”。中国的实践已走在理论前面，亟需形成本土的经济学派。\n\n>“我们应该摒弃那种左、右意识形态之争，以长远发展为重，抓住中华民族的天赐良机，否则将是历史的罪人”，这大概是这位中国派的最大心声。"
		},
		{
			"post_id": 8,
			"title": "亲历电视台选秀肮脏内幕！千万不要让你女儿去娱乐圈",
			"date_published": 1462545315.917,
			"body": "自从中央电视台的星光大道节目和湖南电视台的快乐女声节目火爆之后，选秀节目也在全国各地火爆起来。\n\n我知道有很多姐妹很喜欢这些节目，甚至有些家长也希望自己的女儿通过这样的节目一举成名。我自己是亲身经历过这种选秀节目的，把自己的亲身经历说出来，或许能够给这些姐妹和家长一个警醒。\n\n我本来是在北京海淀五道口服装批发市场做服装销售，卖儿童服装。我很喜欢看着那些小孩子从我这里买到漂亮衣服的时候，那种欢天喜地的样子。但这个工作很累，一天下来，要站十几个小时。收入虽然不算低，但离自己梦想的生活，还差得远。那个时候，我一直没有谈恋爱，我内心的想法是，我相貌不错，我的未来还没有展开，我一定要通过自己的努力，过上比较富足的生活。\n\n当时远在内蒙古老家的爸爸给我打电话，鼓励我去参加当地的电视选秀节目，并且帮我在当地电视台报了名。他说得很直接：这辈子靠一次唱歌就能改变命运，为什么不尝试一下？再说，我从小还学过古筝、小提琴，也算有才艺的。\n\n我当时就暂时辞掉了工作，回到内蒙古老家。我也很渴望改变命运，因为我们家并不富裕，父亲是当地一所农业技校的退休老师，母亲没有工作，他们的生活也要指望我才有机会改变。\n\n第一轮遴选比较简单，每个人只有五分钟的时间，只是唱唱歌、跳跳舞，只要没什么太大的问题，就通过了。听说报名的有两三千人，通过第一轮遴选剩下八百人。第一轮遴选的报名费只有一百元，但是第二轮遴选就很贵了，要一千五百元。我有些犹豫，但爸爸听说之后，毫不犹豫地给了我报名费，还另外花钱去商场给我买了几身比较名贵的衣服。\n\n妈妈就在我们小区到处透露这个消息，说我已经通过了第一轮遴选，十分有希望上电视。邻居们都很羡慕她，奉承她。于是这件事就成了妈妈的一个大事，她几乎每天都盯着电视机看，什么事也不干，就等着第二轮比赛。\n\n交上报名费之后，不久就通知我去参加面谈，我自己不敢去，就让爸爸陪我去。一个自称是评委的人在办公室里接待了我们，他先夸奖了我如何有才艺，有感觉，有很大的天分，也有很大的把握。然后他又含蓄地说，现在是经济社会，评委们都很辛苦什么的。\n\n说了半天，爸爸就听明白了。他拍着胸脯说：“我们全家都支持女儿参加这种有价值的节目，请评委老师多费心。”下午回去之后，爸妈商量，当即就去银行取了一万多块钱，然后晚上去大酒店请那个评委吃了一顿，花了一千多，然后悄悄塞给那个评委一万块钱的红包。那个喝的醉醺醺的评委拍了拍我的肩膀，很暧昧的样子。后来我听参加节目的其他人说，红包几乎每个人都送了，有的是几千，有的是几万，甚至还有更多的.\n\n### 外面是风光 里面是色情\n\n第二轮遴选真是让我目瞪口呆！\n\n电视观众从电视里看到的是我们在台上的表演：每个人有七分钟的自我介绍和表演时间。自我介绍要幽默风趣，落落大方，然后是才艺表演，要有相当的专长。最后呢，由主持人出一些比较刁钻的问题，让你为难，考验你的机智应变能力。然后，台上的七个评委根据你的舞台表现分别打分。最高十分，最低零分。最后你的得分就是去掉最高分和最低分之后的平均值。\n\n这只是电视观众能够看到的。\n在第二轮遴选结束后，大概又淘汰了一大半，还剩下二百多人。然后就有人通知我们进行“小范围遴选”。地址不是在电视台的演播大厅，而是在一个郊区的度假村。按照通知，到一个商场门口集合，然后坐一辆大客车就走了。而且，通知还特别强调，不带亲友团，只是单独前往。\n\n到了度假村之后，我就发现其实这个度假村都被完整的包租下来了，除了我们这个选秀节目的人，没有别的客人。晚上，我们都领到了一套泳装和很暴露的衣服，参加小范围遴选就是要穿这个的。\n\n其实几乎都不能说什么遴选。没有评委，也没有人打分，来参加的也不光是评委，还有些企业家，有的显然是当官的，具体是什么人我们也不知道，只知道上面坐了一群人，都很光鲜，很有钱的样子。而且很明显，其中有一些都喝醉了。\n\n先是走模特步，然后是泳装表演。表演结束后，评委们就会问一些非常露骨的问题，名义上是考验你的应变能力。比如说，你谈过男朋友吗？有性经验吗？性格开放吗？能开放到什么程度？你希望成名吗？你愿意为成名付出什么代价？……\n\n天呐！最后这个问题算是问到点子上了！当我在台下的时候，听到有些女孩坦然地说出“为了成名，我愿意付出任何代价”的时候，我脊梁骨都凉飕飕的。后来场面越来越混乱，当评委要求“考验一下你的开放程度”的时候，有的女孩当场做出了十分不堪的举动。吹口哨的人，起哄的人，大笑的人，现场一片狼藉。\n\n我上台的时候脑子里已经完全糊涂了。我不知道自己是来到了电视台的选秀节目，还是来到了一个魔鬼世界。为什么那些令人尊敬的评委老师突然变得没有廉耻了。所以当我被问到任何问题的时候，脑子里一片空白。评委的脸都拉了下来，冷冷地说，你下去吧。\n\n### 先出卖廉耻，再出卖才艺\n\n第二天回家之后，我没敢跟父母说经历了什么。只是说，就是一个小范围的遴选。我倒头就睡，心里一片茫然。父母看出我情绪不对，反复追问。我就只好说了个大概，父母听了，面面相觑。\n\n晚饭的时候，父母跟我谈了一次话。父亲觉得很气愤，说要去投诉他们。我说：“你投诉什么呀？一个愿打，一个愿挨。人家也没强迫你参加节目。再说，现场也没有录像，也没有记录，你有什么凭据呀？”\n\n母亲则有不同的意见，她说：“现在整个大院都知道咱家闺女要上电视台了，全家的面子可都在这上面系着呢，不要搞砸了，让邻居看不起，以后可怎么做人啊？”\n\n我一听就来气了：“这分明就是个火坑，你知道不知道啊？”母亲说：“你想的太严重了吧，怎么可以这样说那些评委老师呢？人家可都是电视台的人啊，知识分子，有素质的。”\n\n过了几天，那个收了我们家红包的评委突然给我爸打电话了，说：“孩子表现其实还是不错的，只是现在竞争很激烈。”然后又暗示说：“现在包装要花很多钱的，但这可是一本万利的买卖。一旦你闺女成名了，这点钱其实算不了什么。只要是能够通过第二轮遴选，进入决赛，立即就成为全市的大名人。”\n\n最后一句话很重要，他举了个例子，说上一届的亚军，挺普通的女孩子，比你们家闺女差远了，但因为赢了亚军，就被一个市委领导的儿子看上了，现在已经是那个领导的儿媳妇了。\n\n很明显，妈妈被这个例子给弄魔怔了。这天晚上，她像着魔了一样，要死要活地命令我一定要去找那个评委，想办法进入决赛。说不管花多少钱，家里就算卖房子卖地，也一定给我最大的支持。否则，全家的脸就会丢尽了。最后这句话说得很重，我就默默地点头答应了。\n\n我约那个评委老师谈一谈，他说办公室不方便，就约我去一个咖啡厅。喝咖啡的时候，他除了夸奖我有天分之外，就是谈他的婚姻很不幸，然后又夸耀他有多大的权力，认识多少局长书记。喝完咖啡，他又拉我去卡拉OK唱歌，一直唱到凌晨。他说累了，要不就在旁边酒店住下吧。我坚持说要回去，他带着醉意，但一脸正经地说：“佛教说，空即是色，色即是空嘛。何必那么在意。”我不管他空啊色的，总之，我要回家。他看不好勉强我，就说：“你知道吗，我现在是给你很大的机会，你自己放弃了，可不要后悔，想找我的女孩子多了去了。你不愿意留下睡，没关系。你回去让你家里凑钱吧，现在，你有个当官的爸爸，就能拼爹。如果你没有一个当官的爸爸，那你就只有拼钱了。”\n\n\n### 莫把亲生女送到泥沼里\n\n但是，最让我伤心的，倒并不是我在选秀节目中遭遇的这一切，而是父母的态度。很明显，母亲十分相信那个评委说的故事，如果能够在选秀中脱颖而出，就能够被大官的公子看中，就能嫁入豪门，全家都能挣到面子。父亲虽然没说什么，但并不反对母亲的观点。\n\n我有一种被卖去当童养媳的感觉。母亲说，如果我一旦放弃，那么，私底下送的好几万块钱的礼，就都收不回来了，全家人的脸面也都丢尽了。我这才知道，原来他们背着我，又悄悄去给那个评委送过几次红包。但我仍然决心放弃，不仅如此，我还决心离开这个家庭。\n\n真是想死的心都有。但一想，我死了，谁会伤心呢？\n\n黯然地收拾行李，离开了内蒙古，又回到了北京，又回到了五道口那个熙熙攘攘的服装批发市场。每天迎送顾客，看着繁华似锦的都市生活，突然觉得格外的空虚、无助和悲凉。\n\n倒是那个恬不知耻的评委的话给了我启发。我不明白，佛经里说的那句话是什么意思，什么是“空即是色，色即是空”？因为好奇，也因为自己内心的痛苦无法排遣，我就是这样走近了佛法。每个周末我都到北京居士林去听一堂佛教课程，越听，觉得自己活的越明白了。甚至，也明白了父母为什么那么狠心，竟然以“爱”的名义死活要把我往火坑里推，因为他们被自己的业障迷住了眼睛，看不到真相。我也不得不接受了这样一个认识：所谓父母和子女，在爱与被爱的背后，的确还有一个更深的业力和因果关系。\n\n跟我同住在一个屋里的还有很多女孩，我路过电影制片厂门口的时候，每天也能看见很多女孩在那里聚集，她们每天都做着“愿意付出一切代价”进入娱乐圈的迷梦。我想告诉她们，也告诉天下的父母，名也虚，利也虚，唯有因果不虚。你真的付出代价，换来了大红大紫，或许你并不知道，你付出的代价，绝对不是你看见的那些。因为我们自己造的业，迟早要自己来还的。或许你更不知道的是，即便你“愿意付出任何代价”，你所换来的也未必就是大红大紫，而可能只是一场闹剧，甚至一场羞辱。\n\n过了半年多，我一直没回家，渐渐地把这件事忘记了。突然有一天，妈妈打电话跟我说：“你知道吗，那个收了咱家钱的评委，因为涉嫌强奸，被人告了，但他很有门路，竟然没什么事就被释放了。你说，这个世界还有天理吗？”我因为当时正在工作，很忙，就没理这件事。又过一段时间，妈妈又给我打电话，欢快地说：“你知道吗？那个评委开着宝马，在停车场停车的时候，跟人发生了争吵，结果两个小伙子一下车就用砍刀把他脊背砍了，人已经瘫痪了。凶手早就跑了，一点线索都没有。”\n\n唉，我说什么呢？我只是无言地挂了电话，这个世界真有因果报应。"
		},
		{
			"post_id": 7,
			"title": "百度的原罪—封杀Google的黑内幕",
			"date_published": 1462531578.794,
			"body": "这是一篇2002年的文章，那一年对于搜索引擎界是重要的一年，因为自从那一年后，Google就再也“不好用”了，搜索的时候经常出现“本页无法访问”，然后就会暂时无法连接Google，Google的网页快照功能更被封锁至今仍然无法使用，无奈之中，人们只好选择了和Google“最象”的Baidu搜索引擎，然而，大多数人可能不知道的事实是，国内封杀限制Google其实前后均由搜索引擎公司百度在幕后操作。\n\n　　去年底回国了一次，跟几个圈内的朋友聊了聊，其中有百度的员工，虽然所得不多，但初步证实了我由来已久关于Google在国内被封是有公司在背后操作的猜测，非常巧的是新年后在硅谷接待了一位老同学一家，我这位老同学的先生在政府相关部门工作，恰恰了解Google被封这个事，从他那里证实了国内搜索引擎公司百度（baidu.com）前前后后暗中操作Google被封及Google使用功能受限的一些传言。\n\n　　我最早怀疑百度的理由非常简单：一是百度公司是Google被封唯一的受益者，Google被封之时，也刚好是国内主要门户更换搜索引擎服务商的时间段，这个事件后，门户网站视Google如洪水猛兽，网易、新浪、雅虎中国、搜狐这样的公司不得不选择了百度的产品，百度从中获利近两百万美元。二是百度作为国内搜索引擎界的知名公司，恐怕没有人比他们更了解Google，对于Google中有些什么有害信息，或者对Google的一些功能进行限制的技术实现手段上，百度是专家。整个Google事件，百度有动机，有条件。\n\n　　根据我前后接触四五个与这件事有关的朋友的说法，大概整理出百度操作Google事件的经过：\n\n　　2001年中，百度的一个副总即开始与政府有关部门谈Google中“有害信息”的问题，但当时百度接触的人级别比较低，百度的想法也只是想通过政府向使用Google的一些中文网站施加压力，另一方面有关官员也认为Google的服务器在国外，同时在国内影响不大，所以也只是根据百度的举报抽查过用Google服务的网易一两次，并没有什么大的风波。\n\n　　2002年的时候百度最为害怕Goolge，因为这时传言Google的Founder将访华，Google也准备在年底正式进入中国市场，同时百度最大的客户新浪、搜狐也正在和Google接触，有在年内与百度的合同结束后换用Google的意向。面对这种情况，有点像是对百度宣判了死刑，所以百度开始变得疯狂，专门制定了一个针对Google的计划。\n\n　　根据朋友的说法，从公司层面，百度分三类整理了Google含有所谓政治问题、宗教问题、情色问题的材料，每一类材料多达数百页A4纸，定期向有关部门提交，百度并提供数据证明中国网民经常在查找这些东西。虽然人们在使用Google时，可能不足几万分之一的情况是search这些“不良信息”，但由于百度是国内最大的搜索引擎公司，他们提供的数据却说明中国网民有多达近10个百分点的比例在经常搜索“不良信息”，这样的数据给政府有关部门造成了很大的影响，觉得Google中的“不良信息”对中国网民危害巨大。\n\n　　从用户层面，百度也动用了非常多的人力和财力操作这个事，包括组织一些员工和兼职进行信函举报，即以用户身份给有关部门写信投诉Google“危害社会”，“危害中国互联网”，“危害青少年身心健康”，从我在政府部门工作的朋友所称，这一招是非常有效的，对最后有关部门的决策起到了重要作用。\n\n　　从高层路线，经过一年的打基础，百度的CEO和VP开始能接触到有一定级别的官员，并适机的传递一些Google中众所周知的特别要害的“有害信息”情况，这也是后来Google被封时民间传言Google所含有特别要害的“有害信息”到达政府一定级别官员的一个重要途径之一。\n\n　　2002年9月，中国5600万网民的不幸，历时一年多的阴谋策划后，百度的计划得逞了，有关部门封杀了Google.虽然这一事件前前后后网上传言众多，但可以肯定的是，没有搜索引擎公司百度的幕后操作，就不会有封杀全球最伟大的搜索引擎Google.Google假如进入中国市场，对百度的打击是毁灭性的，但一个精心策划的阴谋使得百度公司不仅逃过一劫，还能长治久安，并且当年就通过向本来可能是Google客户的Sohu、Sina、网易、中国雅虎卖自己的搜索引擎服务获利近两百万美元。\n\n　　更为让人吃惊的是，据有人称，Google被封杀后，篡改GoogleDNS指向的人中即有百度。这一推测其实也很容易成立：虽然篡改DNS违反中国法律，但百度在当时特定情况下断定政府不会追查此事，所以在整死Google后还分Google的残骸，篡改DNS，把访问Google的用户引到百度网站，为了分散网民的注意，又把其它如北大天网、ENet等一些不相干的网站拉下水。其实有聪明的用户稍加分析就可以明白，中国提供搜索引擎的网站那么多，但Google被篡改的DNS后指向的网站为什么只有百度一个是真正概念上的搜索引擎呢？而没有比较知名的搜索网站sohu、sina、yahoo？\n\n　　虽然Google被封杀已成昨日烟云，但今天的Google中文的使用仍然在国内受到很多网络技术的限制。在Google的Keywords、Cache、Spider等程序服务中，Google中文网站受到一套相当完善的技术限制，有朋友称，百度的几名核心程序员参与了这一套Google限制技术的开发和技术支持。Google已经成为互联网上搜索引擎的代名词时，只有中国不能真正的使用他，而这套技术的创意与提供，却正是中国的搜索引擎公司百度。\n\n　　因为一个公司的私利、中国5600万网民不能方便的得用互联网查询资料，因为一个公司的阴谋，整个中国互联网的信息利用向后退了一大步。我前后接触了几个与事件相关的人物，通过私下交流中获得一些信息，把事实与内幕记录下来，只是想澄清中国互联网发展史上的一个令人震惊的事实，让众人明白一个问题：是谁在为中国的搜索引擎服务做贡献，是谁在残害中国的搜索引擎服务。（文/Tubleaqis，来源：文学城）"
		},
		{
			"post_id": 6,
			"title": "用Markdown 优雅的在 ZeroNet 上写文章",
			"date_published": 1461652258.297,
			"body": "许多小白第一次玩 ZeroNet 发现了不知如何排版，其实在 ZeroNnet也是可以把把版排得很漂亮的，得用 Markdown 语法，这里收集一份 Markdown 简明语法手册 ，方便朋友们学习，其实很简单的，怎么用自己去搜索好了！\n1. 斜体和粗体\n使用` *` 和` **`表示斜体和粗体。\n\n示例：这是*斜体*，**这是 粗体**。\n\n实现： 这是 `*斜体*`，这是` **粗体**`。\n\n2. 分级标题\n首加井号表示不同级别的标题 (H1-H6)，例如：# H1, ## H2, ### H3，#### H4。\n\n3. 外链接\n使用` [描述](链接地址)` 为文字增加外链接\n\n示例：这是去往` [彩虹之家](127.0.0.1:43110/17uKkK8a1J1fQP4nPvexpSAWUT8wd4Rtdo/) `的链接。\n\n实现：这是去往 [彩虹之家](127.0.0.1:43110/17uKkK8a1J1fQP4nPvexpSAWUT8wd4Rtdo/) 的链接。\n\n4. 无序列表\n示例：\n- 无序列表项 一\n- 无序列表项 二\n实现：\n`- 无序列表项 一`\n`- 无序列表项 二`\n\n6. 文字引用\n使用 > 表示文字引用。\n\n示例：\n\n>念念不忘，必有回响。\n\n实现：`> 念念不忘，必有回响。`\n\n7. 行内代码块\n使用 `html` 表示行内代码块。\n\n示例：让我们聊聊` html`。\n\n8. 插入图像\n使用` ![描述](图片链接地址)` 插入图像。\n\n9. 删除线\n使用 ~~ 表示删除线。\n\n示例：~~我是一只小小鸟！~~\n\n实现：`~~我是一只小小鸟！~~`\n\n10. 设置字体，字号，字体颜色和背景\n原文地址：http://blog.csdn.net/qinyushuang/article/details/48976627\n示例：\n<font color=Green>譬如设置某段字体为绿色</font>\n<font face=\"STCAIYUN\">我是华文彩云</font>\n<font color=gray size=5>color=gray</font>\n<font color=#0099ff size=5 face=\"黑体\">color=#0099ff size=5 face=\"黑体\"</font>\n<table><tr><td bgcolor=#FF4500>这里的背景色是：OrangeRed， 十六进制颜色值：#FF4500， rgb(255, 69, 0)</td></tr></table>\n实现方式：\n\n`<font color=Green>譬如设置某段字体为绿色</font>`\n\n`<font face=\"STCAIYUN\">我是华文彩云</font>`\n\n`<font color=gray size=5>color=gray</font>`\n\n`<font color=#0099ff size=5 face=\"黑体\">color=#0099ff size=5 face=\"黑体\"</font>`\n\n`<table><tr><td bgcolor=#FF4500>这里的背景色是：OrangeRed， 十六进制颜色值：#FF4500， rgb(255, 69, 0)</td></tr></table>`\n\nSize：规定文本的尺寸大小。可能的值：从 1 到 7 的数字。浏览器默认值是 3。\n\ncolor：颜色名称和代码可参考 http://www.5tu.cn/colors/yansezhongwenming.html\n\nface：字体用英文名称，可参考 http://www.xwbetter.com/font-family/"
		},
		{
			"post_id": 5,
			"title": "聊聊 ZeroNet 会对这个世界产生什么样的影响？",
			"date_published": 1461651174.726,
			"body": "互联网技术圈子里最近又有大事发生。一个 Web 领域的全新分布式网络兴起了。ZeroNet 打算创造一个去中心化，匿名，不受任何组织影响的网络世界。\n\nZeroNet 结合了 BitCoin 和 BitTorrent 两项技术，在网络中建立了另一个网络。在 ZeroNet 里，你只需要一对非对称密钥，就能发布自己的站点。所有人可以通过你公布出的私钥在 P2P 网络中找到你的电脑，直接从你自己的电脑中下载站点的数据。越来越多人访问后，你的站点就会被多台电脑保存，并开始为你的站点做种子，站点的内容就这样获得了永生。\n\n修改和更新站点数据的技术和比特币非常类似，只有拥有私钥的人才能对之前签名过的站点提交更新。私钥代替了用户名和密码，让所有数据可以公开，也不用担心会被篡改。\n\n这东西到底有什么用呢？\n\n我并不想聊它有什么用。通过有用去看待新生事物，往往是功利的，狭隘的，类比的。大多数人并不擅长洞察未来。网络，Web，在最初极少有人想到对人类社会有如此巨大的影响。\n\n现在我们看到的网络世界，未来会一直如此吗？很有可能变化会超出所有人的想象。如果说网络技术是一个生物，现在它成年它才刚刚出生而已，技术仍在不断进化。\n\nInternet 当初由美国政府军方支持，计划研发一套不容易被破坏的通讯网络，于是设计了无中心、分包多路传输的路由网络，结果是现在已经没有人可以关闭的互联网诞生。\n\n最开始的 Web 价值观是开放、平等、民主和自由，而现在的网络正好相反，变成了现实世界的映射，人类所有的欲望在网络中被不断放大。我们所有的数据，连接，隐私掌握在少数几个公司组织手中。用户流量和数据是免费的代价，用户成为了商品。\n\n想想看，如果你决定说点什么，只要发布在这个网络中，任何人都无法删除和修改它，它不存在于这些大公司组织的服务器中，它只属于你，甚至你也可以选择放弃能删除它的可能性。仿佛回到了 Web 刚开始的年代，在技术层面我们又一次获得了自由。\n\n可以想象最开始在这个网络上建立的内容一定是长期被控制，被压抑的东西。无论内容是好是坏，至少给了每个人发声的权利。\n\n现在没有人会否认网络对人类社会带来了巨大的改变，新的技术的运用是推动这些改变的原动力。越来越成熟的去中心化技术可能在未来的某个时刻，又回如何影响这个世界呢？我们拭目以待。"
		},
		{
			"post_id": 4,
			"title": "Zeronet博客如何设置新页面打开链接",
			"date_published": 1461640399.984,
			"body": "声明：新手教程，老鸟勿喷。\n\n我们知道，在Markdown 中的链接语法是这样的：`[文本](链接)`。为了网站的流量和优化，用户体验等等的问题，有时候我们想链接在新页面打开，但Markdown 的链接都只能在当前页面打开，这样非常不方便，在原生的 Markdown 中要实现链接在新页面打开基本是没有办法了。\n\n我测试了下 ZeroNet ，发Zeroblog(博客）不但支持 Markdown 还支持 HTML 的部分功能（ZeroTalk论坛不支持!），这其中就有html的链接标记，这下就好办了。\nMarkdown 的`[文本](链接)`就相当于 HTML 中的`<a href=\"链接\">文本</a> `， 如果要在 HTML 中实现新页面打开链接加target=\"_blan”就行了，下面我们看看怎么弄：\n\n实例：`<a href=\"http://127.0.0.1:43110/17uKkK8a1J1fQP4nPvexpSAWUT8wd4Rtdo/?Home\"target=\"_blank\">点开看看效果</a>`\n实现：<a href=\"http://127.0.0.1:43110/17uKkK8a1J1fQP4nPvexpSAWUT8wd4Rtdo/?Home\"target=\"_blank\">点开看看效果</a>\n\n不知道大家看懂了什么意思吗？也就是说可以直接用html语言来写链接的代码，不需要用Markdown标记语言。"
		},
		{
			"post_id": 3,
			"title": "ZeroBlog 新手指导(1)",
			"date_published": 1461629599.197,
			"body": "### 很多新人可能不知道的ZeroNet几个小技巧\n1. 鼠标移到帖子/博文/标题的上方，左边出现铅笔的图标，点击铅笔图标以后能够编辑帖子/博文/标题，还可以删除帖子/博文。编辑的时候页面下方有个问号，点击它会出现markdown格式的帮助信息（有关markdown更详细的用法看[这里](http://127.0.0.1:43110/cryptonbits.bit/?Post:6:Zeronet+Markdown+Cheatsheet)和[这里](http://127.0.0.1:43110/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw/?Post:10:%D0%BF%D0%BE%D0%B4%D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B0+%D0%B4%D0%BB%D1%8F+Markdown)），能够很简单地写出像本文那样排版~~优美~~的帖子/博文（本文markdown源码在[这里](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_7)，欢迎参考、传播）\n- 每个页面的右上角有个0图标，用鼠标按住它，向左拖拽，就会出现很多关于该页面的很多信息，还能做很多设置，还不赶快试一下！\n- 在ZeroID注册好帐号后，记得在ZeroMail里点Create my mailbox，否则别人不能给你发加密邮件。\n- ZeroNet上有哪些站？请看[ZeroNet站点集合 & 搜索引擎](http://127.0.0.1:43110/1Nse6WcodQ5Mj6ZwvZvuyCVvQESwuxbCUy/?Topic:2_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/ZeroNet)\n- “关注”功能（加好友、互粉）：网站如果有`关注`或`Follow`字样的按钮，点击后会弹出一个菜单，默认情况帖子/博文/Posts是打勾的，就是已经关注了这个站的帖子。点击菜单里的评论/Comments，同时关注帖子/博文的评论。关注以后，就会在你的ZeroHello首页的Newsfeed里看到你关注的内容更新。进版块后还要点“关注”，你在才能信息流收到该版块的新帖。取消关注就是以上的逆操作。图示看[这里](http://127.0.0.1:43110/zeroblog.bit/?Post:66:How+to+find+people,+add+friends+)\n- **创建**自己博客/论坛/...的**超简单**方法见**[建站教程（包括深入配置教程）](http://127.0.0.1:43110/1Nse6WcodQ5Mj6ZwvZvuyCVvQESwuxbCUy/?Topic:18_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/)**\n- 备份你的ZeroNet帐号/私钥：ZeroBundle\\ZeroNet\\data\\users.json这个文件相当于你的比特币钱包，这个文件丢失/损坏而你又没备份的话，你就无法操作你的帐号/网站了。所以把这个文件备份出来很重要。恢复/重新安装/迁移ZeroNet只需把这个文件放到原位覆盖即可。\n- 升级ZeroNet的方法见[这里](http://127.0.0.1:43110/1Nse6WcodQ5Mj6ZwvZvuyCVvQESwuxbCUy/?Topic:10_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/+ZeroNet+0+3+7)\n- 代理设置方法：添加参数`--proxy 127.0.0.1:1080 --disable_udp`（端口设成自己的）来启动ZeroNet，添加方法见下文`匿名相关`一节里的`使用运行参数自动打开Tor always模式`（如果你想设置Tor为代理，也请看那一节）\n- **匿名**相关：是否有需要匿名，要看你发布什么东西，请看**[匿名设置和相关知识](http://127.0.0.1:43110/1Nse6WcodQ5Mj6ZwvZvuyCVvQESwuxbCUy/?Topic:17_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/ZeroNet)**\n- 希望帮助ZeroNet发展的朋友，请考虑捐款给作者（不是捐给我），谢谢！捐款方式中文说明见[这里](http://127.0.0.1:43110/1Nse6WcodQ5Mj6ZwvZvuyCVvQESwuxbCUy/?Topic:21_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/+ZeroNet)"
		},
		{
			"post_id": 2,
			"title": "又一个互联网的法外之地：ZeroNet分布式P2P网络",
			"date_published": 1461577801.343,
			"body": "文章来自《西半球最著名的中文博客[土木坛子](http://127.0.0.1:43110/1D41D7ybgaDypUV3wJ12NHRdJSL35kLiSJ/)》和《[月光博客](http://www.williamlong.info/)》内容有删改！\n\n我们都知道暗网是这个世界上的互联网的法外之地，在暗网上各种非法内容不计其数，没有人能够找出这些内容的真实的地址，也行美国的互联网特工可以！\n现在又出现了一个新的东西，和暗网差不多，ZeroNet分布式P2P网络。\n什么是ZeroNet\nZeroNet是一个去中心化的类似于Internet的网络，由匈牙利的开发者使用Python制作，完全开源。网站由特殊的\"ZeroNet URL\"可以被使用一般的浏览器通过ZeroNet程序浏览，就像访问本地主机一样。ZeroNet默认并「不」匿名，但是用户可以通过内置的Tor功能进行匿名化。ZeroNet使用Bitcoin加密算法及BitTorrent网络。\n简单地说，ZeroNet就是一个P2P为基础的HTTP分布式互联网世界，网址形式为127.0.0.1后面跟一个比特币钱包地址一样的34位长度字符串，比如：http://127.0.0.1:43110/17uKkK8a1J1fQP4nPvexpSAWUT8wd4Rtdo/虽然没有HTTPS，但我猜测内容本身已经加密，就像比特币的网络系统一样。\n与我们平时访问的互联网相比，最大的不同点就在于ZeroNet是去中心化，不需要中心服务器，每个访客都是一个节点，承担存储内容和传输带宽，第三方自然也无法审查删除内容。从这一点上来讲，ZeroNet比CDN式的分布式网络更彻底，CDN不过是把原来的一个中心分散成更多的中心，ZeroNet把内容分布在每一个访客节点上。\n听起来和暗网或深网类似，又是一个互联网的法外之地？的确，ZeroNet类似的P2P网络与神秘的暗网一样，它不受政府管制，除非把整个网络摧毁——比特币也是如此。从这个意义上来讲，它能成为技术上保持中立的传播工具。至于人类利用它来干坏事还是好事，那完全是另外的话题——我们只谈技术。\n不过，暗网依然需要中心服务器，只不过外界无法知道服务器的具体地址在哪里——也许美国NSA有这个能力，暗网本身并不依赖P2P技术。ZeroNet上的内容发布以后，只要有一定数量的节点存活，发布者节点关闭与否都不再重要，内容已经永久存活在网上，永远可以访问，就像用BT发布内容一样，只要种子成活后，内容就理论上存活在互联网上。\nZeroNet有一个与BitTorrent发布内容不一样的地方，ZeroNet发布的内容可以修改，就像我们现在用的普通网站一样，随时可以修改内容，与之连接的节点也会自动更新。而BT发布后的内容就无法修改了。\n易用性方面，ZeroNet和暗网相比不相上下，暗网需要TOR来浏览，要访问ZeroNet网络，直接下载ZeroNet软件，解压后点击即可运行使用，就像VPN一样，运行它后并不影响现行的网络连接，唯独多了一个访问ZeroNet的P2P网络世界功能，并且是全局访问，无论用哪个浏览器都可以访问ZeroNet世界里的网站。\n对中国大陆用户来讲，可能还有一点其它的意义，它是一个真正意义上不受监控的网络，配合加密，GFW可能很难对付。ZeroNet虽然依赖于现行的IP地址系统，但它完全与现行的网络平行，也就是说，现行网络上的内容需要有人转移到ZeroNet网络上，ZeroNet上目前的内容很少。ZeroNet也有相应的搜索收录引擎：http://zeroexpose.com/，目前收录的内容很少。\n防DMCA Take down\n由于ZeroNet去中心化的原因，国外有人制作了一个ZeroNet版本的海盗湾——Play，这个网站可让版权所有者头疼啦...一般的网站服务器都有IP地址，不抗投诉的ISP收到了向IP WHOIS滥用信箱发送的DMCA投诉信的话，你就要和你的网站说再见了..(俗称 DMCA Take down)，可用了ZeroNet后，并没有一台服务器是真实的服务器，任何访客都有可能成为服务器，还有些访客使用了Tor，更找不到真正的。\n好了，说点有用的：\n1.可以建自己的网站，你基本上不用做什么。\n2.基于p2p原理，你只要建好并有人浏览过，即使你自己关机，你的网站依然在全球存在。别人想关你站，没门。\n3.基于p2p原理，支付内网穿透，也就是说你在内网也没关系，手机也没问题。\n4.基于比特币原理，账号很安全，谁也不知道你是谁，谁也盗不去。\n5.不需要域名，任何人访问都使用http://127.0.0.1:43110/字符串   来访问。\n6.不用gg fb和tt你就能浏览全世界\n项目地址：该项目的官方网址为: https://github.com/hellozeronet/zeronet\n下载地址：https://github.com/HelloZeroNet/ZeroBundle/releases/download/0.1.1/ZeroBundle-v0.1.1.zip\nzendnet安装时需要vs2008运行环境，很多ghost精简系统没有。没有的话运行zeronet.cmd后一闪而过，闪退。\n安装后你唯一要做的，是注册一个id。\nhttp://127.0.0.1:43110/zeroid.bit  \n福利：\n海盗湾种子站：http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\nMSDN资源区：http://127.0.0.1:43110/1AJB5rtjfB9imjDGVk5vtRtZp3zgYizbpG/\nKindle电子书：http://127.0.0.1:43110/1KHCBG6dmbKXTZNenfwhWZ5x3oDyYyHSD4\n中文导航：http://127.0.0.1:43110/1NzWeweqJ32aRVdM5UzFnYCszuvG5xV3vS\nZeronet搜索引擎：http://zeroexpose.com/\n新手上路，怎样创建自己的论坛和博客：http://127.0.0.1:43110/1Nse6WcodQ5Mj6ZwvZvuyCVvQESwuxbCUy/?Topic:1_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/+ZeroNet+4+11+Update+markdown+mac"
		},
		{
			"post_id": 1,
			"title": "在Zeronet安了家了",
			"date_published": 1433033779.604,
			"body": "这是彩虹之家在Zeronet这个开放的网络世界里面的第一篇文章，其实我已经有N年的网龄了，但是看到Zeronet这个东西的时候还是被它所震撼，所以打算在以后的日子里面逐步的了解并使用Zeronet这个程序。\n彩虹之家，有你更精彩！\n![Zeronet](img/news1.jpg)"
		}
	]
}