{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1545594088,
			"title": "Polskie forum",
			"body": "Cześć,\nPoprzednia osoba zajmująca się polską strefą w ZeroNet przekazała mi klucze do serwisów. Jako że był problem z niepasującymi plikami i bazą danych (długa przerwa w synchronizacji i błędy dysku twardego), to finalnie puste profile nadpisały istniejące po próbie uwierzytelnienia klucza, dlatego wszystko na forum poznikało (tematy, komentarze i polubienia). Musiałem w sumie postawić forum na czysto, mimo że była baza użytkowników, ale jak zauważyliście, każdy profil jest niestety pusty z tych starych. Jako że mam na stałe włączony komputer i udostępnianie plików, to nie będzie ponownie takiej sytuacji.\nPostawiłem na nowo chat, bo poprzedni zniknął (nie było osób udostępniających pliki), więc oprócz braku rozmów, to i baza użytkowników musi powstać na nowo.\nZeroPolskaID nie ruszałem kodu (dodałem jedynie na górze belkę z odnośnikami do innych serwisów).\nNie dostałem plików do naszej Wiki, ani tłumaczeń czy artykułów (wiem że parę było zaczętych), więc stwierdziłem że póki nie znajdzie ktoś na to czasu i chęci, to lepiej będzie podpiąć się pod oficjalną dokumentację i tam zrobić tłumaczenie (przynajmniej nigdy by to nie zniknęło, skoro dba o to Nofish).\nNie wiem co się dzieje z hubem do ZeroMe. Nie widzę tam żadnych plików, nawet kont użytkowników. Nie używam i nie zamierzam używać ZeroMe, więc nie ruszam tego (jeśli ktoś chce zrobić hub dla polskiej społeczności w ZeroMe, może to zrobić śmiało i dodam odnośnik na górnej belce).\nCo do ZeroPolska (kopii ZeroVoat), to nie wiem czy mam takie umiejętności i wiedzę jak poprzednia osoba która przy tym grzebała (tu też jest wszystko wyczyszczone, więc musiałbym stawiać to na nowo).\nUdostępnianie forum i reszty serwisów mam na stałe, ale do ZN zaglądam co jakiś czas (może nie będę pisał czy komentował, ale będę dbał o aktualizację skryptów czy naprawę czegoś, jeśli się popsuje), więc jeślibym nie odpisywał, albo nie dawał znać, to nie znaczy że zniknąłem, a raczej jestem zajęty, ale ZeroTalk Polska, ZeroChat Polska itd., zawsze się zajmę i po aktualizuję czy przypilnuję.\nNiestety, ale jedyne co, to otrzymałem klucze i nie mam kontaktu z poprzednią osobą która się tym zajmowała, więc nie jestem w stanie odpowiedzieć na rzeczy które chcielibyście jemu zadać, albo zadawaliście jemu i nie odpowiedział.",
			"added": 1545594087
		},
		{
			"topic_id": 1550958676,
			"title": "Drobne wieści",
			"body": "Cześć, pisałem to pod jednym z wpisów, ale stwierdziłem że może napiszę to by innym było łatwiej znaleźć:\n\"Problemy z ZeroPolska, to błędy kodu oryginalnego ZeroVoat, na którym zrobiony jest ZeroPolska. Osoba która wcześniej dbała o polską strefę w 0net, starała się poprawiać kod, ale autor czasami zmieniał coś i wtedy poprawki nie działały i zaczynała się zabawa od nowa. Z tego też powodu istnieje to forum, a nie tylko ZeroPolska (były plany usunięcia forum i zostawienia tylko ZeroPolska, ale to było jeszcze zanim odkryłem ZeroNet i udało mi się skontaktować z poprzednim administratorem tego forum) - skrypt ZeroVoat ma wiele błędów i często działa dziwnie - raz udaje się dodać obrazek czy filmik, raz wyrzyguje błędy. Np. tak jak jest ustawiona baza ZV Cluster 0 mi się w PLN Cluster nie udało ustawić w sekcji optional files, bo ZeroNet zmienił konstrukcję plików content.json, w związku z tym ja musiałem to trochę wykastrować, by w ogóle działało. 0net mocno się rozwija, a wraz z przepisaniem na Pythona 3, będą pewne zmiany w kodzie, że część stron, które mają skrypty pythonowe, będzie znowu złamana kompatybilność. Autor ZeroVoat aktualnie znowu nie pracuje nad poprawkami kodu, a dzięki temu że podpiął się pod clustery PFSa i ma podpisany ZV cluster w starszej wersji 0net, to działa to w oryginale lepiej niż u nas. Planowałem nauczyć się pythona i przerobić część kodu, tak by wywalić to automatyczne robienie kont anonimowych, tylko wybór i poprawić stabilność, ale finalnie wyszło tak że rzadko jestem w domu. Mój poprzednik zaczął przymiarki, ale to było na tyle dawno, ze ten kod już nie pasuje do niczego, a ja sam nie mam na tyle czasu by to wszystko samemu zrobić, więc ZeroPolska funkcjonuje bardziej jako portal, który mam nadzieję kiedyś będzie w pełni funkcjonalny i by mógł zastąpić to forum. Póki co zaktualizowałem skrypt forum do tego najnowszego, z jakiego korzysta oficjalne angielskie forum. Co do chatu, bo wiem ze część z was narzekała. Poprzedni administrator postawił chat na skrypcie ThunderWave, choć jest on zabugowaną kaszaną, dlatego bo nie było innego skryptu, oprócz ZeroBoard, który łączy się z zewnętrzną bazą, przez co każdy piszący czy chyba nawet wchodzący na ZeroBoard, jest \"wystawiany na świat zewnętrzny\", co jest mało anonimowe, jeśli ktoś dba o to. Jeśli znacie jakiś lepszy skrypt do chatu, to dajcie znać, a wymienię go, bo wiem ze ThunderWave jest bardzo kapryśny.\"\n\nPodsumowując:\n- Nasza wersja ZeroTalk działa poprawnie, ale sam skrypt forum nie jest skomplikowany a i nie pozwala na zbyt wiele (mamy bardzo ograniczone możliwości)\n- Że ZeroPolska działa słabo wiem i niestety, na razie nie da się nic z tym zrobić\n- Skrypt chatu działa też słabo i losowo i o tym też wiem - jeśli znacie lepszy, dajcie znać, a wymienię go\n- Nie korzystam z ZeroMe, bo mi się nie podoba, ale zrobiłem próbny hub. Nie wiem czy jest sens go promować. Chcielibyście coś w stylu PolskiHub? Podobno kiedyś coś takiego było.",
			"added": 1550958674
		},
		{
			"topic_id": 1555178290,
			"title": "ZeroPolska",
			"body": "Hej,\n\nDostałem trochę wiadomości że ZeroPolska nie działa wam jak powinna albo że cenzuruję tutaj treści, poprzez ich kasowanie.\n\nPrzez ostatnie tygodnie prawie nie wchodziłem do 0net, a jeśli już to i tak robiłem to przez instancję bez profilu. Nie jestem za kasowaniem czegokolwiek, nawet bardzo negatywnego. Problem leży w tym że skrypt ZeroVoat jest dziurawy jak ser szwajcarski. Do tego cluster ZeroVoat został przygotowany pod wersję 0.5.6 Zeronet i jego składnia nie jest akceptowana przez aktualną wersję sieci i klienta Zeronet. O ile cluster ZeroVoat działa bo był podpisany jeszcze w starej wersji, tak nasz cluster ma ten problem że musiałem część funkcji usunąć w wgrywaniu plików by w ogóle ten skrypt działał. Nie ma tutaj części rzeczy i jestem tego świadom. Sek w tym że jeśli je dodam, to musiałbym wywalić inne, a autor oryginału nie zrobi póki co poprawionej wersji clustera, więc jest impas. Sam skrypt serwisu też wymaga wiele poprawek. Wgrałem dziś najnowszą wersję, która poprawia część rzeczy, ale to nie zmienia tego że z upośledzonym clusterem, serwis nie ma pełni możliwości. Remedium na to jest takie, że albo autor oryginału to poprawi, ja się nauczę Pythona i Javascriptu albo ktoś inny zrobi coś lepszego.\n\nIdeą ZeroPolska było zastąpienie polskiego forum w 0net, na wzór Reddita, tak by móc tworzyć kanały, wgrywać obrazki, filmiki, móc zagnieżdżać komentarze i by był to serwis pełną gębą. Nie ma aktualnie w Zeronet lepszego skryptu (mimo że ten ma swoje bolączki). Problem jest też taki że sa rzeczy które u nas działają, a w ZeroVoat nie i odwrotnie...\n\nJeśli ktoś jest wstanie poprawić skrypt albo napisać serwis od zera, to nie mam nic przeciwko by przenieść ZeroPolska na niego.\n\nPS. Jak na początku wspominałem, pełnię rolę deus otiosus - aktualizuję wszystko, staram się podnieść jeśli coś się wywali i ew. dodawać odnośniki, jeśli ktoś zrobi jakiś serwis dla nas (jak np. było z IRC, które lepiej działa niż skrypt chatu od ThunderWave).",
			"added": 1555178287
		},
		{
			"topic_id": 1578775053,
			"title": "Drobne aktualizacje",
			"body": "Hej,\n\nZaktualizowałem skrypt forum, czatu beta oraz ZeroPolska (jest teraz ciemny motyw)",
			"added": 1578775049
		}
	],
	"topic_vote": {
		"1550966772_1At298vUijuhjA2GtqXEydC8csRnhETzdH": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1550690083_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 1,
				"body": "Hej. To są błędy kodu oryginalnego ZeroVoat, na którym zrobiony jest ZeroPolska. Osoba która wcześniej dbała o polską strefę w 0net, starała się poprawiać kod, ale autor czasami zmieniał coś i wtedy poprawki nie działały i zaczynała się zabawa od nowa. Z tego też powodu istnieje to forum, a nie tylko ZeroPolska (były plany usunięcia forum i zostawienia tylko ZeroPolska, ale to było jeszcze zanim odkryłem ZeroNet i udało mi się skontaktować z poprzednim administratorem tego forum) - skrypt ZeroVoat ma wiele błędów i często działa dziwnie - raz udaje się dodać obrazek czy filmik, raz wyrzyguje błędy. Np. tak jak jest ustawiona baza ZV Cluster 0 mi się w PLN Cluster nie udało ustawić w sekcji optional files, bo ZeroNet zmienił konstrukcję plików content.json, w związku z tym ja musiałem to trochę wykastrować, by w ogóle działało. 0net mocno się rozwija, a wraz z przepisaniem na Pythona 3, będą pewne zmiany w kodzie, że część stron, które mają skrypty pythonowe, będzie znowu złamana kompatybilność. Autor ZeroVoat aktualnie znowu nie pracuje nad poprawkami kodu, a dzięki temu że podpiął się pod clustery PFSa i ma podpisany ZV cluster w starszej wersji 0net, to działa to w oryginale lepiej niż u nas. Planowałem nauczyć się pythona i przerobić część kodu, tak by wywalić to automatyczne robienie kont anonimowych, tylko wybór i poprawić stabilność, ale finalnie wyszło tak że rzadko jestem w domu. Mój poprzednik zaczął przymiarki, ale to było na tyle dawno, ze ten kod już nie pasuje do niczego, a ja sam nie mam na tyle czasu by to wszystko samemu zrobić, więc ZeroPolska funkcjonuje bardziej jako portal, który mam nadzieję kiedyś będzie w pełni funkcjonalny i by mógł zastąpić to forum. Póki co zaktualizowałem skrypt forum do tego najnowszego, z jakiego korzysta oficjalne angielskie forum. Co do chatu, bo wiem ze część z was narzekała. Poprzedni administrator postawił chat na skrypcie ThunderWave, choć jest on zabugowaną kaszaną, dlatego bo nie było innego skryptu, oprócz ZeroBoard, który łączy się z zewnętrzną bazą, przez co każdy piszący czy chyba nawet wchodzący na ZeroBoard, jest \"wystawiany na świat zewnętrzny\", co jest mało anonimowe, jeśli ktoś dba o to. Jeśli znacie jakiś lepszy skrypt do chatu, to dajcie znać, a wymienię go, bo wiem ze ThunderWave jest bardzo kapryśny.",
				"added": 1550956953
			}
		],
		"1550958676_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": [
			{
				"comment_id": 2,
				"body": "Dla ciekawych:\nhttp://127.0.0.1:43110/1JgSJagUWea1UijnHXtUVBoMeyJ7eyUekU/\nUtworzyłem konto, edytowałem automatyczny wpis, jak dotąd działa w porządku.",
				"added": 1550966127
			}
		],
		"1550966772_1At298vUijuhjA2GtqXEydC8csRnhETzdH": [
			{
				"comment_id": 3,
				"body": "Z tego co widzę po plikach, to on korzysta jak ThunderWave ze swojej bazy danych i tworzy profile użytkownika, a nie wysyła to na zewnątrz jak ZeroBoard. Jeśli nikt nie będzie miał nic przeciwko, to może wymieniłbym go za aktualny chat, który ma swoje humorki.",
				"added": 1550968685
			},
			{
				"comment_id": 4,
				"body": "Wygląda w porządku, więc dodałem go do paska na górze. Chat na ThunderWave oznaczyłem jako beta.",
				"added": 1551028209
			}
		]
	},
	"comment_vote": {
		"11_17UY7McN5WAMD6dqnxLCFBwHYLXY9HmDuV": 1
	}
}