{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"8_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": 1,
		"1_14x4EC7s5TqvtShMQy22xpj8ouVSmSNZY8": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1LRn9jRPNZbecjPWSSSEx2YictbhzdAG1y": [
			{
				"comment_id": 1,
				"body": "Acredito que um problema seja o MySQL que o Joomla cobra. Também não faço ideia de como solucionar este problema porém.",
				"added": 1466120396
			}
		],
		"8_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": [
			{
				"comment_id": 2,
				"body": "Ola pessoal",
				"added": 1472166993
			},
			{
				"comment_id": 3,
				"body": "> [bitbit2](#comment_3_1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y): alguem sabe o que significa GAAP? tem umas historias de gente se matando e deixando isso escrito...\n\nGaap é o nome de um dos presidentes do inferno (fucking crazy people with their religions dude...)\nBusca por Lemegeton ou A Chave Menor de Salomão para sacar mais da parada... Aviso que é conteúdo inútil ocupando uma parte do seu cérebro (a não ser que você curta satanismo e tal, dai acho que não é né...)",
				"added": 1472167173
			}
		],
		"1_14x4EC7s5TqvtShMQy22xpj8ouVSmSNZY8": [
			{
				"comment_id": 4,
				"body": "Se souber de alguém que tenha Salvia Divinorum, tenho conhecido procurando igual doido, provaram faz anos mas com a proibição eles não acham mais.",
				"added": 1472167242
			}
		],
		"1_1CpD9pJGi6NgHTJvp9ag9HtmvXow5XHebE": [
			{
				"comment_id": 5,
				"body": "Eu uso muito usenet para baixar torrent, também uso o 1337x.to as vezes... São sites decentes... Recomendo caso tenha tempo, baixar os dumps de base de dados de link magnet desses sites, assim você fica com uma cópia local dos links mesmo que os sites sejam tirados do ar... Não atualiza automático, mas pelo menos você tem acesso ao acervo antigo...",
				"added": 1472167841
			}
		],
		"2_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": [
			{
				"comment_id": 6,
				"body": "minha recomendação é você salvar sempre os arquivos soltos que ficam dentro de ZeroBundle/ZeroNet/Data para poder restaurar seu usuário único. Os arquivos que você tem que salvar são estes\n/home/jerry/ZeroBundle/ZeroNet/data/cert-rsa.pem\n/home/jerry/ZeroBundle/ZeroNet/data/GeoLite2-City.mmdb\n/home/jerry/ZeroBundle/ZeroNet/data/key-rsa.pem\n/home/jerry/ZeroBundle/ZeroNet/data/sites.json\n/home/jerry/ZeroBundle/ZeroNet/data/users.json",
				"added": 1472168056
			}
		]
	},
	"comment_vote": {
		"3_1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y": 1
	}
}