{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Send me your stuff, guys! I guarantee that I will not mention your name for the submission at all!",
			"post_id": 2,
			"date_added": 1458790223
		},
		{
			"comment_id": 2,
			"body": "> [antifa](#comment_1_18rFd7W9y5QGQEVXaCoJV7jyt7D8aN156h): i'm halfway thorough it. it's really not very good writing. i love boing boing though! the main kid is such a mary sue\n\nI think the writing here is just as great as in Boing Boing. Ok, perhaps not exactly because Doctorow's nonfiction stuff is really out of this world, but that doesn't make this book a bad one. I do agree, though, that Marcus is kind of a pussy.\n\n> [klauszimmermann](#comment_1_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT): Great book! I'm looking forward to reading his other one: Pirate Cinema\n> Any thoughts about it?\n\nI have yet to read that one. From the blurb it looks good, though.",
			"post_id": 3,
			"date_added": 1459100547
		},
		{
			"comment_id": 3,
			"body": "Thank you for the interest, Aesalon P!\n\n> [aesalonperegrin](#comment_1_1LBhKyyGMziBDhnBribnydQjUm6PcpGD2d): \n> most of my ebooks are in .pdf and djvu format\n\nThat's not always a problem! I prefer epub above pretty much anything because it's the most flexible format, but that doesn't mean that I don't appreciate a good PDF that is well adapted for reading in small screens. \n\nSee, the problem isn't so much the PDF format itself, but rather that most of them are made for print, in A4 size, so they don't scale well down to a phone or tablet screen - even in landscape. PDFs in B5 format are much better, but also much harder to find. If you have them in B5, that's awesome already!\n\n> I am a Mac user. How can I send you text file?\n\nI'm not sure if Macs have the `base64` command available in the shell (which is `bash` for newer Macs), but if they don't, there's still a workaround you can do in python. Copy the following code into a file and save it as `b64converter`. Use it like this:\n\n    python b64converter mybook.pdf\n\nThe file `mybook.pdf.txt` is produced. Copy its contents and paste them into a ZeroMail to me, and that's it!\n\n```python\n#!/usr/bin/env python\n# -*- coding: utf-8 -*-\n#\n# This base64 converter script is released to the public domain.\n#\n\nimport sys\nimport base64\n\ndef encode(token):\n    with file(token, 'rb') as infile:\n        with file(\"%s.txt\" % token, 'w') as outfile:\n            base64.encode(infile, outfile)\n\ndef decode(token):\n    with file(token, 'rb') as infile:\n        with file(\"%s.new\" % token, 'w') as outfile:\n            base64.decode(infile, outfile)\n\nif __name__ == \"__main__\":\n    encoding = True\n    if len(sys.argv) == 1:\n        print \"USAGE: b64encoder [-d] FILE\"\n        print \"where '-d' decodes instead of encoding\"\n        sys.exit(1)\n\n    if \"-d\" in sys.argv:\n        encoding = False\n\n    if encoding:\n        if len(sys.argv) != 2:\n            print \"USAGE: b64encoder [-d] FILE\"\n            print \"where '-d' decodes instead of encoding\"\n            sys.exit(1)\n        else:\n            encode(sys.argv[1])\n    else:\n        if len(sys.argv) != 3:\n            print \"USAGE: b64encoder [-d] FILE\"\n            print \"where '-d' decodes instead of encoding\"\n            sys.exit(1)\n        else:\n            decode(sys.argv[2])\n```",
			"post_id": 2,
			"date_added": 1459214896
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}