{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1
	},
	"next_comment_id": 8,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#CÍRCULO DE FOGO\nVasily Zaitsev (Jude Law) é um jovem atirador russo que, convencido por um companheiro político (Joseph Fiennes), torna-se o ícone da propaganda russa em plena 2ª Guerra Mundial. A fama de Vasily o torna uma lenda viva para o exército russo e desperta também a atenção do exército nazista, que envia seu melhor atirador de elite (Ed Harris) com o objetivo de matar aquele que se tornou a esperança de toda a Rússia.\n\n- https://ok.ru/video/1443679963664",
				"added": 1543363083
			},
			{
				"comment_id": 2,
				"body": "#Até o Último Homem\nDurante a Segunda Guerra Mundial, o médico do exército Desmond T. Doss (Andrew Garfield) se recusa a pegar em uma arma e matar pessoas, porém, durante a Batalha de Okinawa ele trabalha na ala médica e salva mais de 75 homens, sendo condecorado. O que faz de Doss o primeiro Opositor Consciente da história norte-americana a receber a Medalha de Honra do Congresso.\n- http://thevid.net/v/y1wls2g6dn60nv5q5wd2e/",
				"added": 1543363268
			},
			{
				"comment_id": 5,
				"body": "#ENTREVISTA COM DEUS\nPaul (Brenton Thwaites) é um jornalista ambicioso em busca de sucesso profissional através de alguma grande matéria. Depois de uma extensa procura, ele topa de frente com um homem que pode lhe dar a melhor entrevista de vida: ele diz ser Deus e promete responder a qualquer pergunta de Paul em uma conversa única.\n- https://ok.ru/video/894668573353",
				"added": 1543369059
			},
			{
				"comment_id": 6,
				"body": "#O FILHO DE DEUS\nVindo de uma pescaria fracassada, Pedro (Darwin Shaw) encontra Jesus Cristo (Diogo Morgado), que o convence a segui-lo. Logo Cristo reunirá 12 apóstolos que têm por missão espalhar seus ideais pela Terra. Entretanto, por mais que pregue o amor ao próximo e a compaixão, sua crescente popularidade desperta a ira de pessoas importantes de Jerusalém, que não desejam que o status quo seja alterado. A traição de um de seus apóstolos, Judas (Joe Wredden), faz com que Cristo seja capturado e levado a julgamento.\n\n- https://ok.ru/video/524404328976",
				"added": 1543374950
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 3,
				"body": "#Eclesiastes 8\n\n\n1 Quem é como o sábio?\nQuem sabe interpretar as coisas?\nA sabedoria de um homem\nalcança o favor do rei\ne muda o seu semblante carregado.\n\n2 Este é o meu conselho: obedeça às ordens do rei porque você fez um juramento diante de Deus.\n\n3 Não se apresse em deixar a presença do rei, nem se levante em favor de uma causa errada, visto que o rei faz o que bem entende.\n\n4 Pois a palavra do rei é soberana, e ninguém lhe pode perguntar: \"O que estás fazendo?\"\n\n5 Quem obedece às suas ordens\nnão sofrerá mal algum,\npois o coração sábio saberá a hora\ne a maneira certa de agir.\n\n6 Porquanto há uma hora certa\ne também uma maneira certa de agir\npara cada situação.\nO sofrimento de um homem, no entanto,\npesa muito sobre ele,\n\n7 visto que ninguém conhece o futuro.\nQuem lhe poderá dizer\no que vai acontecer?\n\n8 Ninguém tem o poder\nde dominar o próprio espírito;\ntampouco tem poder\nsobre o dia da sua morte\ne de escapar dos efeitos da guerra;\nnem mesmo a maldade\nlivra aqueles que a praticam.\n\n9 Tudo isso vi quando me pus a refletir em tudo o que se faz debaixo do sol. Há ocasiões em que um homem domina sobre outros para a sua própria infelicidade.\n\n10 Nessas ocasiões, vi ímpi­os serem sepultados e gente indo e vindo do lugar onde eles foram enterrados. Todavia, os que haviam praticado o bem foram esquecidos na cidade. Isso também não faz sentido.\n\n11 Quando os crimes não são castigados logo, o coração do homem se enche de planos para fazer o mal.\n\n12 O ímpio pode cometer uma cente­na de crimes e, apesar disso, ter vida longa, mas sei muito bem que as coisas serão melhores para os que temem a Deus, para os que mostram respeito diante dele.\n\n13 Para os ­ímpios, no entanto, nada irá bem, porque não temem a Deus, e os seus dias, como sombras, serão poucos.\n\n14 Há mais uma coisa sem sentido na terra: justos que recebem o que os ímpios merecem, e ímpios que recebem o que os justos merecem. Isto também, penso eu, não faz sentido.\n\n15 Por isso recomendo que se desfrute a vida, porque debaixo do sol não há nada melhor para o ho­mem do que comer, beber e alegrar-se. Sejam esses os seus companheiros no seu duro trabalho durante todos os dias da vida que Deus lhe der debaixo do sol!\n\n16 Quando voltei a mente para conhecer a sabedoria e observar as atividades do homem sobre a terra, daquele cujos olhos não veem sono nem de dia nem de noite,\n\n17 percebi tudo o que Deus tem feito. Ninguém é capaz de enten­der o que se faz debaixo do sol. Por mais que se esforce para descobrir o sentido das coisas, o homem não o encontrará. O sábio pode até afirmar que entende, mas, na realidade, não o consegue encontrar.",
				"added": 1543366946
			},
			{
				"comment_id": 4,
				"body": "#Palavra forte e impactante com Marconei Lessa.\n- https://youtu.be/u1OebpQsV1k",
				"added": 1543367074
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 7,
				"body": "#A QUESTÃO DO NADA EM HEIDEGGER E SARTRE \n- https://web.archive.org/web/20181128025144/http://www.marilia.unesp.br/Home/RevistasEletronicas/Kinesis/AquestaodonadaemHeidegger.pdf",
				"added": 1543375015
			}
		]
	},
	"comment_vote": {
		"3_1A7pFGKjBjGLQcGxfwiv1Lpu7QXx1utZUU": 1,
		"21_1BFnE9JXxnjKUSXmyrSE4fi7JwbcSBGAfx": 1,
		"11_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1
	}
}