{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 1,
				"body": "IMHO:\n\nillegal text content:\n\nNot much to deal with in this department since anything anyone says at any time is considered hate-speech somewhere everywhere by someone. \n\nIllegal images/video:\n\nOne possible solution is by only being able to share images/videos that have been posted in the centralized web. That way no illegal content is ever directly uploaded to the network and any video/images seen/shared are hosted in the centralized eco-system. \n\nYou want to share an image? Instead of uploading the image from your hard drive, you share a link from one of the approved image sharing sites (imgur/reddit/whatever).  Similarly, you want to share a video in ZeroNet, you share a link to said video from the approved video sites (youtube/bitchute/whatever). \n\nThe issue with this option is that it gives power to the centralized internet, but I think it would be a good first step in the right direction. Particularly since most of these sites are so enormous that it can be relatively easy to fly under the radar with this sort of setup. \n\nOn a more philosophical note \"illegal\" content is only an issue because the government says if you are caught with it YOU go to jail, not the person that created or distributed it. If the government didn't throw you in prison for merely seeing illegal content, it would be dealt the same way it is dealt in other places. Moderators, filters, blocking widgets etc.\n\nI browse /pol in 4chan and those asshole are always spamming porn and I find that content pretty offensive. But I just block it and/or deletes the content if it goes against the guidelines.",
				"added": 1565331009
			}
		],
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 2,
				"body": "He cute",
				"added": 1565331451
			}
		],
		"1565148747_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 3,
				"body": "I've been checking ZeroNet every day and so far I like it. The topics are a bit random but the tech works for better or worse and I have a good feeling about this tech.",
				"added": 1565332006
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 4,
				"body": "based and redpilled.\n\nThough they are not that bad. You have to put them in (((perspective)))",
				"added": 1565827541
			},
			{
				"comment_id": 5,
				"body": "> [wejehteman2](#comment_16_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P):The Jews are hard working and almost all of them are successful.  [...]\n\nThis literally doesn't matter. Jews rape kids. Non-jewish kids, YOUR kids if they could. They have starved people that look like you to death in the hundreds of millions. And they have laughed about it, they are even proud of it. They want to have YOU as a filthy slave and kill you if you dare defend yourself because in their eyes you are not human, you are cattle. It literally makes no difference whatsoever if they are the hardest workers in the world. They are pure unadulterated vile disgusting creatures that should be hated above all others, second to none. You can blame niggers for being low intelligence (fair enough, and not even all of them mind you). But their worse individuals are the way they are as a combination of low intelligence, dysfunction and some instincts. They don't have a culture that says YOU deserve to be a filthy slave, or your children deserve to be raped. Even in south africa they don't want to enslave whites, they want them out of their country.  And for all of their faults, SOME blacks have shown the ability to feel compassion, kindness to their neighbor. You literally can't say that about 99% of jews who ruthlessly want to do harm to the outsider.  Niggers and jews in the hate-o-meter should be in two completely different levels, to the thinking man. Is not even close. Being dumb is not a sin. Being a power hungry beast that wants to enslave others is a sin.\n\n> [wejehteman2](#comment_16_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P):Honestly, the only real criticism I have of them is that they rely of deceit, trickery and destruction to reach their ends rather than hard work, creation and honest face to face challenge. While the white man will challenge you to a duel at high noon the jew will poison you in your sleep.[...]\n\nIt's almost like you don't know the meaning of your own words. Objectively, every criticism that you have listed above is precisely why Jews are more disgusting and deserving of hate than any nigger you could think off. The only way you could have listed all of those criticism of the jew and still find niggers more hate worthy is if your own heart is dark or if your mind is dull. You subconsciously have implied that you find niggers more \"vile\" because they offend your own sophistication for evil, unlike the jew, who you admire at some level and although he will literally starve your whole family if he felt like it without much remorse (look at Palestine, or ukraine, and in some ways Germany). At least he is not simple minded and sinister-lite like the nigger who sags his pants and robs people right? Maybe if niggers had ambitions of enslaving your family and/or mentally poisoning your children with sex and porn you wouldn't hate them as much right? \n\n> [wejehteman2](#comment_16_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P):If they get anywhere NEAR your property you have to sell and move before its value implodes.[...]\n\nI don't want to resort to calling you names, but this is really low intelligence. Even if what you said it's true, its a dumb, vain excuse to hate them, let alone hate them more than jews. At least they don't fucking want you to be their slave buddy! If jews had it their way you wouldn't even be allowed to own ANY property ANYWHERE for the crime to be an ANIMAL in their eyes. The jews you admire think this way, yet to you they are worse than niggers? Gosh man. I only get triggered because there are too many people that think at your base level. I am not that intelligent and this is as clear as water. Think.hierarchically.please! \n\n> [wejehteman2](#comment_16_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P):Jews aren't beautiful, but they don't look like fucking monkies. They don't go months without washing their hair. [...]\n\nThis is such a vain, dumb and revealing comment. So as long as the persons that want to enslave you,  that wants to send your kids to die in wars, or rape/molest/kill your children looks physically acceptable, you harbor for them less hate than you do for niggers because niggers are ugly and stinky? Truly revealing not only your intelligence but your heart. After reading some of what you have wrote, among niggers and jews you would be find yourself in great company. One group has your intelligence and the other your whacked out moral gauge.",
				"added": 1565847979
			},
			{
				"comment_id": 6,
				"body": "> [wejehteman2](#comment_22_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): I'm a true reactionary. I don't fundamentally oppose society having elites. I don't oppose the strong dominating the weak. They want me to be their slave? I'm not that offended by that because I also want them to be my slave. They starved to death hundreds of millions? Yea that's pretty shitty. I don't know if I could do the same to them. But I have the wherewithal to recognize that that's probably weakness on my part. [...]\n\nI like the honesty, you have essentially described what it means to be a coward. In essence you can't even bring yourself to hate jews (funny how when it comes to jews you can't even use the word \"hate\") even if they objectively cause you more harm. Since they are stronger than you, and in your world view you submit to strength you roll over and show them your belly with pleasure. No hate towards an enemy who wishes to do harm to you and your family because as you put it they are strong and if you were strong like them maybe you would do the same thing right?. On the other hand you will harbor hate against a weaker enemy like the joke that is niggers because it's easy and carries no risks. You don't hate niggers because they are the most evil, or the most destructive, or the biggest threat,  but because they are weaker than you, and hating niggers is safe, comfortable.\n\nNow, I don't pretend to tell you what to do, but for someone whose wold-view puts an emphasis on admiring strength, there is nothing more weak and pathetic than picking on a weaker enemy because you are too cowardly to pick on someone your own size. It is the equivalent of getting picked on at school only to go home and pick on your little brother because you don't have the balls to channel your rage against your real bullies. I would reconsider my beliefs if  i was in your position.",
				"added": 1565914680
			}
		]
	},
	"comment_vote": {
		"19_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"5_1DgsQGyxp1NPfxDHSUs3Efj8jPvfrGsYyd": 1,
		"6_1DgsQGyxp1NPfxDHSUs3Efj8jPvfrGsYyd": 1,
		"13_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": 1
	}
}