{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1567521662,
			"title": "First release of ZeroFrameJS v1.0.0 - WebSocket API for JavaScript",
			"body": "I'm not the dev.\n\nhttps://github.com/filips123/ZeroFrameJS/releases/tag/v1.0.0",
			"added": 1567521661
		}
	],
	"topic_vote": {
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1567461575_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": 1,
		"1567521662_17ezFE1pdnXf9sFsoGvzZqxsZhX6DiQg4J": 1,
		"1567515898_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1568783263_1Q5f5jQxn2duHpJCCdWhYCkeM8pGagUDdp": 1,
		"1568826985_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": 1,
		"1569608915_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": 1,
		"1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1,
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "> [gitcenter](#comment_921_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): By a thumbnail, I mean something like what ZeroMe shows. It takes just a few dozens of bytes and I think separating thumbnails to separate files would be nonsense. [...]\n\nI also would prefer to have an option to disable any download of any images, \"even thumbnails\".\nThis until I choose to click one of them, and only after this, it will start to download it only (the one that I clicked)\n\nCurrently I'm worried that somehow Zeronet will start to download on my system some illicit pictures. I want to avoid this.",
				"added": 1567456406
			},
			{
				"comment_id": 2,
				"body": "> [gitcenter](#comment_932_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Again: the thumbnails are about 100 bytes each. Splitting all of them to separate files is costly, at least because of an additional 100 byte entry in content.json (i.e. if you've uploaded 100 images, the thumbnails would be 10kb in total, but content.json will also be about 10kb). Do you really want to spoil that much space? [...]I don't want them on my system, I don't want that neither I or anyone else will find some illicit pictures.\n\nI think that it is more important my freedom or my security than the bandwidth that I'll use or the space on my harddrive.\n\nHiding them to the user, while instead Zeronet is download them, it is even worse to me.\n\nIt the same issue here: https://github.com/HelloZeroNet/ZeroNet/issues/2133\n\nMy doing this way, blocking even the download of thumbnails, my opinion is that you will get many more users on your product, because they will feel safer then on others.",
				"added": 1567459110
			},
			{
				"comment_id": 3,
				"body": "> [gitcenter](#comment_933_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Again, images and even small videos can be embed directly to text files, e.g. by simply posting a hex-encoded image. Now how does removing thumbnails help this?\n\nAs I understand, this can happen everywhere, even on clearnet websites.\n\nThe difference that I see here it is that with a thumbnails downloaded to my system, a common user, like my girlfriend or someone else even just a little more expert, can easily find them.\n\nHow will I explain to them (not expert users) that I wasn't looking at some illicit pictures but I was just looking at a political discussion (just an example), where a troll just posted some cp images?\n\nIf there are some pictures hidden on some text files, ok this can't be avoided, but still those files will not be easy to be found on my computer.\n\nAnd ... because of this also, \"difficult to be spotted by random people\", like my \"girlfriend\", there will not be even big incentives to add/post/hide them by trolls or else.",
				"added": 1567460800
			},
			{
				"comment_id": 5,
				"body": "> [gitcenter](#comment_935_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Huh, if thumbnails are stored as base64-encoded strings in data.json, others won't be able to easily decode them. Now what?\n\nThis is a good thing :)\nIt is a good idea.",
				"added": 1567504609
			},
			{
				"comment_id": 6,
				"body": "Are there any news? :)",
				"added": 1583638481
			}
		],
		"1567461575_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": [
			{
				"comment_id": 4,
				"body": "Waiting to see something like this on android, even outside of the market :)",
				"added": 1567462881
			}
		]
	},
	"comment_vote": {
		"18_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"2_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"945_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"180_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"204_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1042_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"15_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1882_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"29_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": 1
	}
}