{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Confissões de um Assassino Econômico - John Perkins",
			"body": "Assassinos econômicos, de acordo com o autor, são profissionais altamente remunerados cujo trabalho é lesar países ao redor do mundo em golpes de trilhões de dólares. \n\n- https://bittube.tv/post/4b594f1e-2c98-4400-9173-975b7dd8922b",
			"added": 1586468525
		}
	],
	"topic_vote": {
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"1_1MwwTJRv96yifi4KwRtDRjFHQjtxz7kPcr": 1
	},
	"next_comment_id": 16,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#O Homem que Viu o Infinito\n- https://gateway.pinata.cloud/ipfs/QmaVohSEsresT3kUr3FM8TZWQrhdvvk5VepVCo1Rbq3xjq\n\nUma verdadeira história de amizade que mudou a matemática para sempre. Em 1913, Ramanujan, um gênio da matemática autodidata da Índia viaja para a o Colégio Trinity, na Universidade de Cambridge, onde ele se aproxima do seu mentor, o excêntrico professor GH Hardy, e luta para mostrar ao mundo a brilhantia de sua mente.",
				"added": 1586450394
			},
			{
				"comment_id": 2,
				"body": "#Mãos Talentosas – A História de Ben Carson\n- https://gateway.pinata.cloud/ipfs/QmaKLZ7NU3mmswroqBq87qZe4E3CJAtJMopQNJK8ZsXqdW\n\nBen Carson (Cuba Gooding Jr.), menino pobre de Detroit, sempre levou uma vida desmotivada, já que tirava notas baixas e não tinha perspectivas de um grande futuro. O que ele e os que estavam ao redor não esperavam era que ele se tornaria um neurocirurgião de fama mundial.",
				"added": 1586450415
			},
			{
				"comment_id": 3,
				"body": "#Quase Deuses\n- https://gateway.pinata.cloud/ipfs/QmXWBqpuCTCmPoLvLSsfcMBh96FweeYHjhhPJJBVS5nBto\n\nNashville, 1930. Vivien Thomas (Mos Def) é um hábil marceneiro, que tinha um nome feminino pois sua mãe achava que teria uma menina e, quando veio um garoto, não quis mudar o nome escolhido. Ele é demitido quando chega a Grande Depressão, pois estavam dando preferência para quem tinha uma família para sustentar. A Depressão o atinge duplamente, pois sumiram as economias de 7 anos, que ele guardou com sacrifício para fazer a faculdade de medicina, pois o banco faliu. Thomas consegue emprego de faxineiro, trabalhando para Alfred Blalock (Alan Rickman), um médico pesquisador que logo descobre que ele tem uma inteligência privilegiada e que poderia ser melhor aproveitado. Blalock acaba se tornando o cirurgião-chefe na Universidade Johns Hopkins, onde está pesquisando novas técnicas para a cirurgia do coração. Os dois acabam fazendo um parceria incomum e às vezes conflitante, pois Thomas nem sempre era lembrado quando conseguiam criar uma técnica, já que não era médico.",
				"added": 1586450434
			},
			{
				"comment_id": 5,
				"body": "#O Jogo Da Imitação\n- https://open.lbry.com/O-Jogo-Da-Imitação:3\n\n\n Durante a Segunda Guerra Mundial, o governo britânico monta uma equipe que tem por objetivo quebrar o Enigma, o famoso código que os alemães usam para enviar mensagens aos submarinos. Um de seus integrantes é Alan Turing (Benedict Cumberbatch), um matemático de 27 anos estritamente lógico e focado no trabalho, que tem problemas de relacionamento com praticamente todos à sua volta. Não demora muito para que Turing, apesar de sua intransigência, lidere a equipe. Seu grande projeto é construir uma máquina que permita analisar todas as possibilidades de codificação do Enigma em apenas 18 horas, de forma que os ingleses conheçam as ordens enviadas antes que elas sejam executadas. Entretanto, para que o projeto dê certo, Turing terá que aprender a trabalhar em equipe e tem Joan Clarke (Keira Knightley) sua grande incentivadora.",
				"added": 1586450587
			},
			{
				"comment_id": 6,
				"body": "#Documentário: O Universo Elegante\n- https://gateway.pinata.cloud/ipfs/QmVkEQDBrxK9ykp5y7Gk5Xfxrk8onGEqShuDdPqo6cWQre\n\nSupercordas, dimensões ocultas e a busca da teoria definitiva, por Brian Greene. Neste Documentário admirável, Brian Greene relata a história científica e a luta humana por detrás da busca desta teoria final. Ideias revolucionárias e excitantes tais como novas dimensões escondidas no tecido do espaço, buracos negros que se transformam em partículas elementares, cortes e furos no contínuo do espaço-tempo, universos gigantes que se trocam com outros minúsculos, e toda uma variedade de outros aspectos que desempenham um papel essencial na compreensão de algumas das questões mais profundas de todos os tempos. Com autoridade e charme, através do uso da metáfora e de analogias, Brian Greene consegue tornar acessíveis alguns dos conceitos mais sofisticados alguma vez pensados, levando-nos mais perto do que nunca a compreender como funciona o universo.",
				"added": 1586450629
			},
			{
				"comment_id": 7,
				"body": "#The Corporation\n- https://gateway.pinata.cloud/ipfs/QmbfmGFR8T2ct8a9KCEtSBokyPgu3f9eRzpA81zUN9n74N\n\n\n A partir da polêmica decisão da Suprema Corte de Justiça americana concluindo que uma corporação, aos olhos da lei, é uma \"pessoa\", são analisados os poderes das grandes corporações no mundo atual. A exploração da mão-de-obra barata no Terceiro Mundo e a devastação do meio ambiente são alguns dos fatos explorados, que entrevistam presidentes de corporações como a Nike, Shell e IBM, além de Noam Chomsky, Milton Friedman e Michael Moore.",
				"added": 1586450663
			},
			{
				"comment_id": 8,
				"body": "#AS TESOURADAS DO COXINHA\n- https://gateway.pinata.cloud/ipfs/QmbWer9qVeNGbEqv8LFYQgF2MYYLCWqjEbvYMSz46VYMRK",
				"added": 1586450777
			},
			{
				"comment_id": 12,
				"body": "#Hitler: A Ascensão do Mal - 2003\n- https://gateway.pinata.cloud/ipfs/QmRe5RSy9hQtXFgktYdwtPGDHJJ7N4ihir8RELnuTVB2Pn",
				"added": 1586451071
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 4,
				"body": "#Os africanos que propuseram ideias iluministas antes de Locke e Kant\n- https://gateway.pinata.cloud/ipfs/QmVk8XqmcowEs9qKVgDxBq96jYocHY93LpuaH4sVPP1uy9\n\nOs ideais mais elevados de Locke, Hume e Kant foram propostos mais de um século antes deles por Zera Yacob, um etíope que viveu numa caverna. O ganês Anton Amo usou noção da filosofia alemã antes de ela ser registrada oficialmente. Autor defende que ambos tenham lugar de destaque em meio aos pensadores iluministas.",
				"added": 1586450564
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 10,
				"body": "#Números: meus amigos que me causam problemas - Paulo Ribenboim\n- https://open.lbry.com/Números_-meus-amigos-que-me-amigos-que-causam-problemas---Paulo-Ribenboim:7\n\nPalestra do Prof. Paulo Ribenboim que dá um panorama sobre a teoria dos números.",
				"added": 1586450909
			},
			{
				"comment_id": 11,
				"body": "#A Música dos Números Primos\n- https://open.lbry.com/A-Música-dos-Números-Primos:b\n\nExcelente documentário sobre a teoria matemática dos números primos.",
				"added": 1586450928
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 13,
				"body": "#Inuyasha filme 1 - Sentimentos Que Transcendem o Tempo\n- https://gateway.pinata.cloud/ipfs/QmdYh4ra3cAsmSykhinMRtWydVs8YZQzx7SegqumW8LGac\n\n#Inuyasha filme 2 - O Castelo Além do Espelho\n- https://gateway.pinata.cloud/ipfs/QmWVqV4yD7LvhYieBWieK1iooZ74sdLMpT1U5N5o6h2Tpy\n\n#Inuyasha filme 3 - A Espada Conquistadora do Mundo\n- https://gateway.pinata.cloud/ipfs/QmW9bNXFkkXHmoKVfMj8hZyNc36qwPURSfogpoM6dSyKSJ\n\n#Inuyasha filme 4 - Fogo na Ilha Mística\n- https://gateway.pinata.cloud/ipfs/QmW5gbs8YCXZV6Jg5aedLVtP3UZ5JYdijUmUTa9H4MZDnz",
				"added": 1586451148
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 15,
				"body": "#Assistir Caminhos do Coração Online\n- https://telegra.ph/Assistir-Caminhos-do-Coração-Online-04-09\n- Capítulo 01 ao 190: https://mega.nz/folder/OaBzzSJB#Ij-_W8g2GwolqDkFNiCP4g/folder/qSgyCAwB\n- Capítulo 191 ao 240: https://mega.nz/folder/LFVi1AwB#1tjYkSgNYWQA4zGl1uyPgQ/folder/DMNgEYgZ\n\n\nJovens com super-poderes estão sendo assassinados a mando de uma chefia.\n\nCaminhos do Coração é uma telenovela brasileira produzida e exibida pela RecordTV entre 28 de agosto de 2007 e 2 de junho de 2008 em 240 capítulos, substituindo Vidas Opostas e sendo substituída por Os Mutantes. Estreou originalmente como “novela das dez”, porém, pelo forte apelo com o público adolescente, a trama passou a ser exibida às 20h30 como “novela das oito” após o terceiro mês no ar, trocando de horário com Amor e Intrigas, que ocupava a faixa então e passou para as 22h.[2] Foi escrita por Tiago Santiago com colaboração de Altenir Silva, Camilo Pellegrini, Gibran Dipp, Maria Cláudia Oliveira, Vívian de Oliveira e Doc Comparato, com direção geral de Alexandre Avancini e produção de Claudio Araújo.Contou com Bianca Rinaldi, Leonardo Vieira, Gabriel Braga Nunes, Felipe Folgosi, Tuca Andrada, Alexandre Barillari, Letícia Medina e Ittala Nandi nos papéis principais.\n\n#Assistir Os Mutantes Caminhos do Coração Online\n- https://telegra.ph/Assistir-Os-Mutantes-Caminhos-do-Coração-Online-04-09-2\n\nAs mutações perigosas continuam a se espalhar pela sociedade, que transformam homens e mulheres em vampiros, felinos, serpentes e lobisomens, atacando nas ruas de São Paulo, além de ter boatos de abduções entre algumas pessoas.\n\nOs Mutantes: Caminhos do Coração é uma telenovela brasileira produzida pela RecordTV, e exibida entre 3 de junho de 2008 e 23 de março de 2009 em 242 capítulos, substituindo Caminhos do Coração e antecedendo Mutantes: Promessas de Amor. Foi escrita por Tiago Santiago, com colaboração de Altenir Silva, Waldir Leite, Gibran Dipp, Maria Cláudia Oliveira, Vívian de Oliveira e Doc Comparato, direção de Vicente Barcellos, Vivianne Jundi, Pollyana Silva, Daniel Ghivelder, Guto Arruda Botelho e Hamsa Wood e direção geral de Alexandre Avancini, com a Produção Executiva de Cláudio Araújo.\n\nContou com Bianca Rinaldi, Leonardo Vieira, Letícia Medina, Ittala Nandi, Gabriel Braga Nunes, Tuca Andrada, Lígia Fagundes, Nanda Ziegler, Giselle Policarpo, Felipe Folgosi, Juan Alba, Petrônio Gontijo, Miriam Freeland, Juliane Trevisol e Babi Xavier nos papéis centrais.\n\n#Assistir Os Mutantes – Promessas de Amor Online\n- https://telegra.ph/Assistir-Os-Mutantes--Promessas-de-Amor-Online-04-09-2\n- https://mega.nz/folder/mzohXA6T#1491xCxmwng1dFutJ_GwKA/folder/KzhhRCBZ\n\nMutantes: Promessas de Amor é uma telenovela brasileira produzida pela RecordTV, e exibida entre 24 de março e 03 de agosto de 2009 em 103 capítulos substituindo Os Mutantes: Caminhos do Coração e antecedendo Bela, a Feia.\n\nFoi escrita por Tiago Santiago, com colaboração de Altenir Silva, Emílio Boechat, Gibran Dipp, Maria Cláudia Oliveira, Maria Mariana, Vívian de Oliveira e Waldir Leite sob direção de Alexandre Avancini, Hamsa Wood, Daniel Ghivelder, Guto Arruda Botelho e Patricia Faloppa com direção geral de Alexandre Avancini. Com a Produção Executiva de Claudio Araujo.\n\nMutantes – Promessas de Amor é a terceira e última novela da Trilogia Caminhos do Coração. No entanto, nesta temporada, o principal foco é o realismo, mas sem deixar de lado o realismo fantástico.\n\nContou com Renata Dominguez, Luciano Szafir, Marcos Pitombo, Maytê Piragibe, Carolina Holanda, Bianca Castanho, Léo Rosa, Juan Alba, Felipe Folgosi, Giselle Policarpo, Rafael Calomeni, Nanda Ziegler, Lígia Fagundes, Mário Frias, Julianne Trevisol, Celso Bernini e Carla Diaz nos papéis principais.\n\nOs Mutantes – Promessas de Amor é a terceira e última parte da Trilogia dos Mutantes",
				"added": 1586465235
			}
		]
	},
	"comment_vote": {
		"14_1MwwTJRv96yifi4KwRtDRjFHQjtxz7kPcr": 1,
		"15_1MwwTJRv96yifi4KwRtDRjFHQjtxz7kPcr": 1
	}
}