{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 3,
			"category": "games",
			"title": "Galapagos: Mendel's Escape",
			"torrent_imdb": "",
			"body": "Help Mendel the polygonal bug escape from the crazy place by manipulating the environment around him, such as popping Mendel over or reversing the rotation of killblades, toggling teleport pads, activating moving platforms, and more.\n\nMount the ISO, then run SETUP.exe.\n\nDuring wizard installation, it will prompt you to install DirectX 5. Somehow, I think you may have a higher version.",
			"magnet": "magnet:?xt=urn:btih:29a38b70884dc1c4845024e618b74211c8690278&dn=GALAPAGOS.iso",
			"torrent_file": "data/users/18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y/GALAPAGOS.iso.torrent",
			"added": 1469074567
		},
		{
			"topic_id": 4,
			"category": "games",
			"title": "NaRCISSIST: Crash Free and CoNTINUUM: Roleplaying in the Yet",
			"torrent_imdb": "",
			"body": "Two games of time travelers, the societies they inhabit, the lies spread by the things they become, and for now, a very small you. And for all that you get pushed around, it is ultimately your choice; have the courage to change something, or die when your time is up?\n\nOn one side, Yrne, the flourishing 'lost' civilization, ruling between twenty and seventeen thousand years BC, claiming the side that yes, you should change something you don't like about history.\n\nOn the other, the massive legions of spanners from the rest of spacetime wanting the world to bend to their one and only story, claiming it to be impossible to even try to help those screaming, when they enforce the bloodshed with dead eyes.\n\nNªRCISSIST: Crash Free and CºNTINUUM: Roleplaying in the Yet, are two games taking place in the same setting, telling two different sides of the same story, each believing to be in the right about how time travel works. Each society has terms for the other, and no one is quite sure who is telling the truth and who isn't.\n\nAll player characters are capable of teleporting throughout time and space, at will, to varying degrees. Physical combat, while present, is not at all the main focus of the games. In CºNTINUUM, mysteries and social motivations are the main draw, while in NªRCISSIST, exploration and a heroic struggle against tyranny are what the player can expect as they crash through other worlds.",
			"magnet": "magnet:?xt=urn:btih:af9f16674b6a1391f8fa1c3fed585aa005494653&dn=N%C2%AARCISSIST",
			"torrent_file": "data/users/18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y/NªRCISSIST.torrent",
			"added": 1469074810
		}
	],
	"topic_vote": {
		"247_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1
	},
	"next_comment_id": 3,
	"comment": {
		"247_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 1,
				"body": "Wundebar! It is good to see that these works of art ( debateable, I know) will live on, despite technology marching ever forwards. Thank you for collating these.",
				"image": "data/users/18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y/",
				"added": 1479411783
			}
		],
		"472_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 2,
				"body": "I can't connect D: I anyone seeding this?",
				"image": "data/users/18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y/",
				"added": 1484426451
			}
		]
	},
	"comment_vote": {}
}