{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "ВООРУЖЕННОЕ ВОССТАНИЕ",
			"body": "Пусть заголовок тебя не пугает, он нужен для привлечения внимания. Итак, публикую инструкцию по дестабилизации ситуации в РФ, по раскачиванию лодки - называй как хочешь.\n\nСуть метода проста: email-терроризм. Если собрать базу адресов силовых структур, чувствительных объектов и важных экономических точек, то можно забросать их угрозами с сообщениями о заложенных бомбах.\n\nИтак, тебе потребуется:\n- Tor browser;\n- Любая почтовая система, в которой можно зарегистрироваться анонимно(например, tormail/cock.li);\n- Картографический сервис(2ГИС/Google карты). Я предпочитаю именно 2ГИС, так как там поподается больше данных;\n\nИНСТРУКЦИЯ:\n0. ВСЁ ДЕЛАЕШЬ ЧЕРЕЗ TOR, ДАЖЕ ПОИСК ОБЪЕКТОВ В 2ГИС.\n1. Заходишь на условный 2ГИС и начинаешь искать в определенном городе: ОВД, городская администрация, банки, суды, бизнес-центры, исправительные колонии  и пр.\n2. Находишь объект - читаешь его описание, обычно там указан номер телефона, сайт и возможно, email.\n3.1 Email выписываешь в текстовый редактор.\n3.2 Заходишь на сайт и ищешь email'ы там, они обычно оказываются внизу страницы или в разделе контактов.\n4. Повторяешь.\n5.1 Когда наберется внушительная база, переходишь на только что созданный(!) почтовыя ящик и начинаешь рассылать письма такого содержания, на которое у тебя хватит фантазии. Можно прикидываться украинскими диверсантами, бойцами ИГ, уставшими от жизни пенсионерами и пр. и красочно описывать, как же ты их ненавидишь и почему скоро они взлетят на воздух. В общем, всё за висит от твоей фантазии.\n5.2 Важно! Рассылай сообщения по одному на каждого адресата. Не нужно рассылать его сразу всем, так как получатель видит список и других получателей.\n\nМожешь отписать прямо в эту тему город, который у тебя в проработке и даже опубликовать свою базу адресов, это наверняка поможет остальным. (не забывать коннектиться в zeronet только через tor)",
			"added": 1552946374
		},
		{
			"topic_id": 2,
			"title": "Квест стигмергия",
			"body": "У нас закончилась краска. Кисти сломались. Нас чуть не поймали менты. Мы испортили пару заборов, здание ВГТРК и только что отреставрированный фасад. \nМы нарезали полдюжины баннеров и стопку ватманов. Нас ненавидят администрация и муниципальные службы.\n\nНо нам этого мало. Поэтому мы присоединяемся к квесту прямого действия Стигмергия. \n\nКоротко о квесте с канала https://t.me/parisburns\n\nЗАКЛАДКИ СО СТИКЕРАМИ: ВОЙДИТЕ В ИГРУ ПРЯМО СЕЙЧАС\n\nСтигмергия или разум роя (swarm intelligence) это способ координации, исключающий необходимость иерархии и лидерства. Стигмергия наблюдается в природе, среди социальных насекомых, птиц и других живых существ, способных сосуществовать в  децентрализованных сообществах.\n\nПрисоединиться к рою несложно: вы ищите закладки, которые мы оставляем для вас в городе. Они достанутся первому, кто с нами свяжется. Внутри чудесных пакетиков - стикеры, материалы для наглядной агитации и задания, для выполнения которых придется научиться работать с городским пространством, путешествовать среди смыслов и незаметно переписывать их (semantic sabotage).\n\nКак играть:\n\nСвяжитесь с нами через бота https://t.me/NotAGameBot мы вышлем вам координаты закладки. Когда вы ее найдете, то получите от нас инструкции и некоторые советы.\nСтикеры достаются вам бесплатно, но с обязательным условием: их нужно распространять (клеить и раздавать друзьям). И соблюдайте правило петли стигмергии (stigmergy loop) - клеите стикер - присылаете фото (они размещаются анонимно и помогают игре оставаться на плаву). Результаты предыдущих игр можно найти по хэштегам #стигмергия и #swarm_challenge \n\nЭто лишь первый шаг. При его прохождении, вы получаете доступ к более сложным и интересным. Не выполняя его (если вы получили координаты и не забрали стикеры или не прислали фото) - попадаете в Чистилище, выбраться из которого можно лишь выполнив другое задание от нас.\n\nДействуйте осторожно, оставайтесь анонимны, используйте средства цифровой самозащиты. И подключайтесь к разуму роя.",
			"added": 1552994145
		}
	],
	"topic_vote": {
		"1_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": 1,
		"1_1KDowLVWPX3uVoksFQ1e9Pw1ZA6xcLTfSX": 1,
		"2_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": [
			{
				"comment_id": 1,
				"body": "> [murzazade4](#comment_34_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp): Про \"бімбу у метрі\" в период мадана мы уже читали... эффект такой-же.\n\nНулевой?",
				"added": 1552978802
			}
		],
		"2_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": [
			{
				"comment_id": 2,
				"body": "> [xrew](#comment_3_1Fhc5yWswf5Rqu6HoCJTesRHoniQLcx7aT): тупые пидорасы только используют telegram https://www.youtube.com/watch?v=Np417D6QpKw\n\nНу я пока не слышал о случаях набутыливания после того как Телеграм выдал данные властям. \n\nК слову, меш намного медленнее, чем распределенная сеть, какую выстроил Telegram. \n\nЭнивей, спорить не хочу, в этом нет никакого смысла.",
				"added": 1552995633
			},
			{
				"comment_id": 3,
				"body": "Ах да, я вынужден использовать телеграм хотя бы потому что там НАМНОГО шире сообщество, чем в том же ZeroNet, которым пользуется полтора гика.",
				"added": 1552995792
			},
			{
				"comment_id": 4,
				"body": "> [revolter](#comment_6_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ): Нет покоя красноперым рустерам.\n\nУ тебя паранойя, готов поспорить, ты даже не открывал эти ссылки",
				"added": 1553069577
			},
			{
				"comment_id": 5,
				"body": "> [satoxyn1](#comment_4_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Как их открыть, если они требуют Telegram?\n\nВопросов нет)",
				"added": 1553071353
			},
			{
				"comment_id": 6,
				"body": "> [intervi](#comment_19_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk): в чём смысл этой мутной хрени?\n\nДля тебя ни в чем, но для других людей в распространении антиправительственной агитации.",
				"added": 1553161524
			},
			{
				"comment_id": 7,
				"body": "Вот несколько фотографий с квеста.\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1KNZU1nJ97KgAzRbkrKNzU2NGzQbqCgtJb:rus:0abc860c-727d-4698-8988-2e379b87da27",
				"added": 1553161951
			}
		]
	},
	"comment_vote": {}
}