{
	"title": "Test Blog for Images and PDFs",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1470929387,
	"post": [
		{
			"post_id": 9,
			"title": "Adding Images and PDFs to a ZeroNet Blog",
			"date_published": 1470929194.795,
			"body": "I'm going to post images of the instructions since if I place the markdown code on the blog, ZeroNet automatically converts it and you will not be able to see what i'm writing.\n\n1. First Image:\n![alt text](http://127.0.0.1:43110/15eqKjfTfECvBGt2fUemQfcn6NMV37t6WT/img/markdown1.jpg \"First Image\")\n\n2. Second Image showing where to place the riffle.pdf:\n![alt text](http://127.0.0.1:43110/15eqKjfTfECvBGt2fUemQfcn6NMV37t6WT/img/markdown.jpg \"Second Image\")"
		},
		{
			"post_id": 8,
			"title": "New blog post",
			"date_published": 1470923293.913,
			"body": "Testing image:\n\n![alt text](http://127.0.0.1:43110/15eqKjfTfECvBGt2fUemQfcn6NMV37t6WT//img/featured.jpg \"random\")\n\nblalblahblah\n\nCopy of PDF:\n[Riffle Secure Anonymous Tor Alternative](riffle.pdf)\n\n![alt text](http://127.0.0.1:43110/15eqKjfTfECvBGt2fUemQfcn6NMV37t6WT/data/riffle.pdf \"Riffle Secure Anonymous Tor Alternative\").."
		},
		{
			"post_id": 6,
			"title": "New blog post",
			"date_published": 1470862587,
			"body": "\nLessons in Small Scale Manufacturing From The Othermill Shop Floor\n31 Comments\n\nby: Gerrit Coetzee \n\n![alt text](https://hackadaycom.files.wordpress.com/2016/07/featured.jpg?w=800 \"Some person doing something\")\n\nAugust 10, 2016\n\nOthermachine Co. is not a big company. Their flagship product, the Othermill, is made in small, careful batches. As we’ve seen with other small hardware companies, the manufacturing process can make or break the company. While we toured their factory in Berkeley California, a few interesting things stood out to us about their process which showed their manufacturing competence.\n\nIt’s not often that small companies share the secrets of their shop floor. Many of us have dreams of selling kits, so any lessons that can be learned from those who have come before is valuable. The goal of any manufacturing process optimization is to reduce cost while simultaneously maintaining or increasing quality. Despite what cynics would like to believe, this is often entirely possible and often embarrassingly easy to accomplish.\n\nLean manufacturing defines seven wastes that can be optimized out of a process.\n\n1. Overproduction: Simply, making more than you currently have demand for. This is a really common mistake for first time producers.\n2. Inventory: Storing more than you need to meet production or demand. Nearly every company I’ve worked for has this problem. There is an art to having just enough. Don’t buy one bulk order of 3,000 screws for six months, order 500 screws every month as needed.\n3. Waiting: Having significant delays between processes. These are things ranging from running out of USB cables to simply having to wait too long for something to arrive on a conveyor belt. Do everything you can to make sure the process is always flowing from one step to another.\n4. Motion: If you have a person walking back and forth between the ends of the factory to complete one step of the manufacturing process, this is wasted motion.\n5. Transport: Different from motion, this is waste in moving the products of each individual process between sections of the assembly.\n6. Rework: Get it right the first time. If your process can’t produce a product that meets specifications, fix the process.\n7. Over-processing: Don’t do more work than is necessary. If your part specifies 1000 hours of runtime don’t buy a million dollar machine to get 2000 hours out of it. If you can find a way to do it with one step, don’t do it with three.\n"
		},
		{
			"post_id": 5,
			"title": "New blog post",
			"date_published": 1470860077.955,
			"body": "New blog video:\n\n[![Morning Dew](https://youtu.be/bUcszN8jRB8)](https://youtu.be/bUcszN8jRB8)"
		},
		{
			"post_id": 4,
			"title": "New blog post",
			"date_published": 1470860055.047,
			"body": "Blog post body"
		},
		{
			"post_id": 3,
			"title": "New blog post",
			"date_published": 1469383760.092,
			"body": "Blog post body"
		},
		{
			"post_id": 2,
			"title": "New blog post",
			"date_published": 1463500588.599,
			"body": "testing this site out. seems good so far\n"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}