{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1512912701,
			"title": "Decentralized technologies",
			"body": "ZeroUP http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/\nZeroSites http://127.0.0.1:43110/Sites.ZeroNetwork.bit/",
			"added": 1512912700
		},
		{
			"topic_id": 1559768099,
			"title": "What do you want to see on YouTube?",
			"body": "http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/\nI'm going to release updates what do you want?\nWhat are you interesting in?",
			"added": 1559768097
		}
	],
	"topic_vote": {
		"1512912701_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": 1,
		"1526414345_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 31,
	"comment": {
		"1512912701_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 1,
				"body": "Thanks for your feedback, htgozn, I'm confident I'll think of something.",
				"added": 1512931656
			},
			{
				"comment_id": 2,
				"body": "zerotube, nekololi, i just copied the text from the wikileaks\nhttps://shop.wikileaks.org/donate",
				"added": 1512942897
			},
			{
				"comment_id": 3,
				"body": "Please, don't take offense kopyjane.\ni will share with you.\nUnfortunately, I cannot often look after the project.",
				"added": 1512944166
			},
			{
				"comment_id": 4,
				"body": "I'm going to make a full copy of the YouTube,  and then I'll start creating Google ZeroNet.",
				"added": 1512945651
			},
			{
				"comment_id": 5,
				"body": "> [htgozn](#comment_9_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): YouTube\n\nAnyone can create a channel with porn on YouTube.\nI do not forbid you to do this. (｡◕‿◕｡)",
				"added": 1512946644
			},
			{
				"comment_id": 6,
				"body": "I think that users can earn money on their channels, perhaps I'm implementing a banner system.",
				"added": 1512946988
			},
			{
				"comment_id": 7,
				"body": "> [buizel](#comment_11_1NVRQ533fwKrZaRyP8joH2kk6gis2G7PVp): Yeah but there has to be something on ZeroNet to be attractive to advertises.\n\nI think that the future network will be very steep.",
				"added": 1512947562
			},
			{
				"comment_id": 8,
				"body": "> [buizel](#comment_12_1NVRQ533fwKrZaRyP8joH2kk6gis2G7PVp): Yeah but it's something worth trying for or waiting for.\n\nWe must do everything as quickly as possible.",
				"added": 1512947895
			},
			{
				"comment_id": 11,
				"body": "> [darkshroud](#comment_17_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni): You should have named it ZeroTube. [...]\n\nYouTube will be similar to the original YouTube in the light of the concept of decentralization.\nThe name does not change.",
				"added": 1513077675
			},
			{
				"comment_id": 12,
				"body": "Changed the design, not to be confused with the original YouTube",
				"added": 1513989431
			},
			{
				"comment_id": 13,
				"body": "> [missesrobot](#comment_58_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB): Good thing you copied all of my old code with all of its bugs. :)\n\nI will fix some errors later.",
				"added": 1513993352
			},
			{
				"comment_id": 17,
				"body": "China joined the project, it's good, the more people, the better will be YouTube :)",
				"added": 1515340598
			}
		],
		"1511856741_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": [
			{
				"comment_id": 14,
				"body": "I think you are moving in the wrong direction, a lot of superfluous functions :)\nYou have a slow download speed. I think this is a bad decision to get away from the ZeroUP code\nAnd why did you delete everything?",
				"added": 1513994321
			},
			{
				"comment_id": 16,
				"body": "Very cool idea with mobile search.\nAs a rule, programmers are poorly versed in design.\nThe idea itself has appeared?",
				"added": 1514117791
			},
			{
				"comment_id": 18,
				"body": "kopyjane you have a good idea initially, why you change your plans.\nSites can be different for everyone, but the code can be updated together.\nWhy do you encrypt the source code, do not update and improve it with ZeroUP and YouTube\nWe were in the line of four sites with one source code, but now there are three of us.",
				"added": 1515342941
			}
		],
		"1520165704_1KG6UMLtakzi7eDDkqCb27nYxa1VGMDcsP": [
			{
				"comment_id": 19,
				"body": "This is very cool than what you do, I can share it with you\nhttps://github.com/CyberBiology/CyberBiology",
				"added": 1527159486
			}
		],
		"1526329577_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 20,
				"body": "YouTube and Fasebook are not artificial intelligence, they are simple scripts.\nWhat we do far exceeds the standard algorithms, if you do something, do not stop.",
				"added": 1527160035
			}
		],
		"1526414345_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 21,
				"body": "There are not only people around us, there are programs that can not do anything.",
				"added": 1527161370
			},
			{
				"comment_id": 22,
				"body": "Quantum immortality is difficult to prove, but you can start to study the resonance of the noise, it unites everyone, any animal, and the planet itself.\nYou are not alone in studying anomalies and super technologies.\nMany people do not understand the meaning of life, but we are a primitive form of life. We are an organism that has evolved, and it's on the verge of doing it again that would recreate a new life form beyond the body. People as a species are obsolete, but the new ones will become Edemom, we will become better, but we will lose our personality.\n\nWhat is unique for you?\nWhat does the personality mean?\nPersonality is created through society.\nMan, it sounds proud, but in practice, very few people can call themselves human.\nPeople have forgotten who they are, they deceive themselves, they think they are smart, but the intellect can not be received from birth, it needs to be created inside of oneself.\n\nYou can not create an Artificial Intelligence without having the experience and representation of who you are and why I live.",
				"added": 1527161485
			},
			{
				"comment_id": 23,
				"body": "Quantum immortality must exist as there is life itself",
				"added": 1527162182
			},
			{
				"comment_id": 24,
				"body": "The effect of Mandela should help to understand whether you died or not.",
				"added": 1527162424
			}
		],
		"1559711646_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": [
			{
				"comment_id": 25,
				"body": "Cryptocurrency will die before the advent of the quantum computer. The reason is the large scalability",
				"added": 1559768627
			}
		],
		"1559768099_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 26,
				"body": "I will not make a firewall. This is a black YouTube specially created where there are no prohibitions and blockages.\nIf you don’t like the idea you can always be on regular YouTube or KopyKate\nhttp://127.0.0.1:43110/big.kopykate.bit/",
				"added": 1559843180
			},
			{
				"comment_id": 27,
				"body": "> [zeronetuser23](#comment_4_1MgPE4CsgBwNtbxHUwyKDugHjp5j5emtWG): Just rename it to PornTube, because that's what it is and will remain.\n\nThere will be not only porn but also murder and drug trafficking.",
				"added": 1559843761
			},
			{
				"comment_id": 29,
				"body": "> [@sharer made a feature to automatically generate thumbnail for the uploaded video. ](#comment_841_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): +1 and [...]\n\n\nDone",
				"added": 1559894124
			},
			{
				"comment_id": 30,
				"body": "> [sharer](#comment_62_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): Sorry I am not updating my zites lately. I am not very well right now in my health.\n\nIt seems the zeronet does not block inaccessible content causing a hang.",
				"added": 1560175861
			}
		]
	},
	"comment_vote": {}
}