{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1614247182,
			"title": "craigslist for zeronet",
			"body": "I would like to see zites by region for classified ads. Is there a base zite to clone or other group page?",
			"added": 1614247181
		},
		{
			"topic_id": 1623644877,
			"title": "Where's all the compost?",
			"body": "Some rich guys got together and bought up all the best soil from our community's landfill! Landscapers sell compost and labor hours and bring back grass clippings, leaves, and cuttings to be processed into next year's nutrients. Capitalism is starving us gardeners! Instead of $20-100 for compost the market is now cornered at $200 per yard for \"professional\" delivery! \n\nPublic access to tax-subsidized neighorhood green waste recycling products has been infringed by deep pockets as our environment suffers dearly from profiteering!",
			"added": 1623644875
		},
		{
			"topic_id": 1623820238,
			"title": "Businesses are sold for too much",
			"body": "\"Entrepreneurs\" love to start businesses and shuffle money through each other's assets then sell companies to close the cooked books full of crony customers.",
			"added": 1623820235
		}
	],
	"topic_vote": {
		"1614627631_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1614247182_1NSyEdCNMmed6Er224HDTUY6iyhdVEeRG2": [
			{
				"comment_id": 1,
				"body": "I get a file write error when I upload an image.",
				"added": 1614312532
			},
			{
				"comment_id": 2,
				"body": "Let's get sellers hosting their own classified ads by cloning a zeronet zite that includes indexing scripts for region and category, then removed when no longer accessible or expired.\n\nCould this concept be applied to decentralized eBay auctions?\n\nps. I like the idea of a zite template library.",
				"added": 1614914352
			}
		],
		"1614627631_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 3,
				"body": "This is excellent. Thank you.",
				"added": 1614915126
			}
		],
		"1623644877_1NSyEdCNMmed6Er224HDTUY6iyhdVEeRG2": [
			{
				"comment_id": 4,
				"body": "The point of creating the property tax-subsidized municipal composting program was to ensure the grass clippings and leaves from the neighorhood could be gathered in large enough quantities to process properly, otherwise there is not enough material to go around when people try composting on their own.\n\nSelling all the compost made from local land to a wholesale monopoly defeats the purpose of collaborating.\n\nNow gardeners must buy compost at $200 instead of $20 and homeowners will spend far more for landscaping services with no benefit to those doing the work, only the middlemen with deep pockets and plenty of land to hoard the publicly-sourced compost.",
				"added": 1623814236
			}
		]
	},
	"comment_vote": {
		"13_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"18_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"32_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1
	}
}