{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": 1
	},
	"next_comment_id": 39,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "#Laboratório de Matemática - UNESP / IBILCE\nhttps://invidio.us/channel/UCYpsP23MxPNrcDG6rqFWT1A",
				"added": 1590949598
			},
			{
				"comment_id": 2,
				"body": "#Conjectura de Collatz e o  DNA dos Números Naturais (N*)\nhttps://web.archive.org/web/20200531182813/https://sites.google.com/view/paulieng/dna",
				"added": 1590949744
			},
			{
				"comment_id": 3,
				"body": "#O algoritmo da divisão para polinômios em várias variáveis\n- https://ipfs.infura.io/ipfs/QmbEh4YaN6bG9BHF36C96Tb9ZGhMiTjUos1LEEe8nXywF7\n\nResumo: Neste trabalho estudamos o anel de polinômios em várias variáveis e ordens monomiais. Mais especificamente, apresentamos os algoritmos da divisão e da pseudo divisão de polinômios em várias variáveis.",
				"added": 1590949917
			},
			{
				"comment_id": 4,
				"body": "#Um Problema Elementar Equivalente à Hipótese de Riemann - [Jeffrey C. Lagarias](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Jeffrey_Lagarias.html)\n- https://ipfs.infura.io/ipfs/QmaS6bnQkQYgCyS1z3MvrCWyGLx8MkeaYPt8196hkQdfYg\n\nEste artigo mostra a equivalência da [hipótese de Riemann](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Riemann_hypothesis.html) a uma sequência de desigualdades elementares envolvendo os [números harmônicos](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Harmonic_number.html) H_n, a soma dos recíprocos dos números inteiros de 1 a n. É uma modificação de um critério devido a Guy Robin.",
				"added": 1590950136
			},
			{
				"comment_id": 5,
				"body": "#Cálculo, 4ª edição - Michael Spivak\n- https://gateway.pinata.cloud/ipfs/QmfLETKAH4gQANxpF1RvaxEP4zRx1bs9FPNfxL54wRcjKr\n\n[Michael David Spivak](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Michael_Spivak.html) é um matemático estadunidense especializado em geometria diferencial, fundador da Publish-or-Perish Press.",
				"added": 1590953243
			},
			{
				"comment_id": 6,
				"body": "#Como Resolver Problemas Matemáticos - Terence Tao\n- https://ipfs.infura.io/ipfs/QmRg5kvkas1dZkiDrWb7ZtrLaEGkcj7DvuKLHqFtjVdfzP\n\nTáticas para resolver problemas. É o que oferece com muita criatividade [Terence Tao](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Terence_Tao.html), vencedor da Medalha Fields, para professores e estudantes a partir dos 14 anos. As questões reunidas, em nível das olimpíadas de matemática, são acompanhadas de modelos de solução. O autor reúne exemplos que envolvem a teoria de números, álgebra, análise, geometria euclidiana e geometria analítica.\n\nEste livro foi escrito por Tao aos 15 anos, depois de ter participado de três olimpíadas internacionais de matemática. Ele organizou quatro capítulos tematicamente. Eles são precedidos por um capítulo com as estratégias de resolução de problemas com níveis de dificuldade variados. Como diz o provérbio de Lao Tzu, selecionado para introduzir o capítulo 1, “a viagem de mil quilômetros começa com um passo”. Assim, para dar as soluções que as questões requerem, é preciso conhecer as táticas e truques que auxiliam o raciocínio.\n\n",
				"added": 1590953484
			},
			{
				"comment_id": 7,
				"body": "#Cálculo\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Calculus.html\n\nO cálculo diferencial e integral, ou simplesmente cálculo, é um ramo importante da matemática, desenvolvido a partir da Álgebra e da Geometria, que se dedica ao estudo de taxas de variação de grandezas e a acumulação de quantidades. Onde há movimento ou crescimento em que forças variáveis agem produzindo aceleração, o cálculo é a matemática a ser empregada. Foi criado como uma ferramenta auxiliar em várias áreas das ciências exatas. Desenvolvido simultaneamente por Gottfried Wilhelm Leibniz e por Isaac Newton, em trabalhos independentes. O cálculo tem inicialmente três \"operações-base\", ou seja, possui áreas iniciais como o cálculo de limites, o cálculo de derivadas de funções e a integral de diferenciais. Com o advento do Teorema Fundamental do Cálculo, estabeleceu-se uma conexão entre os dois ramos do cálculo: o Cálculo Diferencial e o Cálculo Integral.",
				"added": 1590954329
			},
			{
				"comment_id": 8,
				"body": "#A Hora da Matemática: Problemas em aberto envolvendo matemática elementar \nhttps://invidio.us/gqjFLvMi8XY\n\n#Matemática - Problemas de (quase) um milhão de dólares\nhttps://invidio.us/2-9PbEh8cFw\n\n#Palestra: \"Conjecturas e problemas em aberto\"\nhttps://invidio.us/sE7V7F8GOgM\n\n#2018 - Problemas em Aberto em Teoria dos Grafos\nhttps://invidio.us/bQtd1YQXEOo\n\n#A Hora da Matemática - Palestra: “A Conjectura 3x + 1”\nhttps://invidio.us/G-nQAPm9TlQ\n\n#A Hora da Matemática: Conjectura Jacobiana – Uma conjectura aberta\nhttps://invidio.us/kHIjWHFr628",
				"added": 1590955256
			},
			{
				"comment_id": 10,
				"body": "#Indução matemática\n- https://ipfs.infura.io/ipfs/Qmf9siLUgGJUCZpD9JAvst4Meq7aGXeQfjo4jsAetN4a1R\n\n[Indução matemática](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Mathematical_induction.html) é um método de prova matemática usado para demonstrar a verdade de um número infinito de proposições.",
				"added": 1590955766
			},
			{
				"comment_id": 11,
				"body": "#Iniciação a Aritmética\n- https://ipfs.infura.io/ipfs/QmYwX99whuVLXTfKJAMoNDjZ1PECebF1dBCcxYDw53m5Xw\n\nA [aritmética](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Arithmetic.html) é o ramo da matemática que lida com números e com as operações possíveis entre eles. É o ramo mais antigo e mais elementar da matemática, usado por quase todos, seja em tarefas do cotidiano, em cálculos científicos ou de negócios.",
				"added": 1590956150
			},
			{
				"comment_id": 34,
				"body": "#Hipótese de Riemann e física\nhttps://ipfs.infura.io/ipfs/QmVSQZFDyyaW3yoJUtibbvQJsyStAXhT3fkqFgcLZUWkZx",
				"added": 1590983113
			},
			{
				"comment_id": 37,
				"body": "#Neuromatemática, a nova ciência do cérebro\n\n#Pesquisas do NeuroMat buscam construir um quadro conceitual para servir de base à neurociência.\n\nA neurociência ainda não dispõe de um quadro conceitual para interpretar em nível elevado de abstração dados obtidos em experimentos laboratoriais. A situação desta área do saber pode ser diagnosticada, assim, como rica em dados e pobre em teoria. Para sanar esse problema, são necessários novos modelos matemáticos que deem conta dos dados experimentais observados, ou seja, um novo campo da matemática.\n\nEsta nova ciência do cérebro se chama neuromatemática, e é o que estuda o professor Antonio Galves, do Instituto de Matemática e Estatística (IME) da USP. Galves é coordenador do Centro de Pesquisa, Inovação e Difusão (Cepid) em Neuromatemática, o [NeuroMat](https://neuromat.numec.prp.usp.br/), financiado pela Fapesp. A empreitada conta com uma equipe composta por matemáticos de áreas diversas, além de neurocientistas, cientistas da computação e médicos da USP e de instituições nacionais e internacionais. “Trata-se de um centro de matemática pura, inspirado nas questões que a neurobiologia nos coloca”, explica Galves.\n\n#Conexões matemáticas\n\nUma das perguntas que o NeuroMat tenta responder é como nosso cérebro codifica e processa estímulos externos. Ao ver uma árvore, por exemplo, é possível reconhecê-la como árvore ainda que seus galhos estejam se movendo ou que suas folhas tenham caído, indicando a capacidade de reconhecermos padrões naquilo que observamos.\n\nMas este processo é muito mais elaborado do que podemos imaginar em uma primeira análise. Os cientistas suspeitam que o cérebro seja, na verdade, um exímio estatístico. “A ideia é que existe uma regularidade em nível superior do que a simples aparência e essa regularidade é uma regularidade de caráter estatístico”, conta Galves. Esse processo é chamado de seleção estatística de modelos. No exemplo dado, seria a capacidade do cérebro decodificar e processar informações, mesmo variáveis, que fazem com que possamos reconhecer uma árvore. “Procurar regularidades estatísticas através da seleção de modelos é uma ideia revolucionária em neurociência”, afirma o matemático.\n\nUma das experiências realizadas pelo centro de pesquisa para tentar compreender o funcionamento do cérebro registrou a atividade elétrica cerebral de voluntários expostos a três ritmos musicais diferentes. Os ritmos se expressavam a partir de uma sucessão regular de unidades com batidas fortes, fracas, ou intervalos silenciosos. A isso acrescentou-se o apagamento aleatório de batidas fracas, substituídas por unidades silenciosas. O objetivo da pesquisa era obter evidências experimentais corroborando a hipótese de que o cérebro fazia “seleção estatística de modelos”. Em outras palavras, o que se queria saber é se, a partir de longas amostras produzidas com as sequências rítmicas mais o apagamento aleatório, o cérebro identificava as sequências regulares de base, fossem quais fossem as escolhas aleatórias de apagamento.\n\nOs resultados preliminares obtidos dão força à ideia. “Estamos tentando encontrar evidências de que usar a seleção estatística de modelos como paradigma para a atividade cerebral é viável e factível”, diz Galves. O desafio, explica o professor, é construir modelos que deem conta das evoluções temporais obtidas por meio de registros eletrofisiológicos durante a exposição a estímulos diversos, como rítmicos e visuais.\n\n#Banco de dados do cérebro\n\nA atuação dos Cepids financiados pela Fapesp prevê, além da investigação científica, a contribuição com a inovação por meio da transferência tecnológica. No caso do NeuroMat, esse objetivo é embasado nos princípios da ciência aberta: pesquisas financiadas com dinheiro público devem ser acessíveis a todos e beneficiar toda a sociedade. Em especial, no NeuroMat são desenvolvidas ferramentas computacionais que serão disponibilizadas à comunidade científica para uso em pesquisa, propiciando, dessa forma, avanços na saúde pública.\n\nAtualmente, o grupo trabalha na construção de um banco de dados que reunirá informações de experimentos e análises em neurociência, envolvendo pacientes do Instituto de Neurologia Deolindo Couto (INDC) da Universidade Federal do Rio de Janeiro, que sofreram lesões no plexo braquial. Trata-se de pessoas que devido, por exemplo, a um acidente de moto, tiveram o sistema que controla os movimentos e sensações no braço gravemente comprometido. Nesse cenário, o banco de dados tem como principal objetivo descrever e armazenar os dados destes experimentos e análises de forma padronizada, além de promover eficiência e segurança no armazenamento e busca de dados.\n\nA construção do repositório de dados, coordenada pela professora do Departamento de Ciência da Computação do IME Kelly Braghetto, vem sendo desenvolvido junto ao Centro de Competência em Software Livre (CCSL) da USP. A ideia é que o banco de dados hoje desenvolvido para o INDC seja facilmente adaptável, para gerenciar também dados pertencentes a outros campos da neurociência, explica a professora de Ciência da Computação da Universidade Federal de Ouro Preto, Amanda Nascimento, que participa da construção dessas ferramentas computacionais. “Está prevista, também, a construção de um portal para facilitar o acesso a todos os dados resultantes das pesquisas do NeuroMat e apoiar a integração dos pesquisadores e o acesso aos dados”, comenta Amanda.\n\nSegundo o coordenador do NeuroMat, Antonio Galves, a participação de profissionais da computação, incluindo especialistas, pesquisadores e estudantes de graduação, mestrado e doutorado, trouxe um novo olhar às questões abordadas pelo projeto, melhorando a qualidade das reflexões, reforçando a importância da multidisciplinaridade para as atividades do grupo. “O Cepid também tem a função de formação de uma nova geração de pesquisadores”, observa o matemático.\n\n- Fonte: https://www5.usp.br/42539/projeto-liderado-pela-usp-investiga-a-neuromatematica-nova-ciencia-do-cerebro/",
				"added": 1590988337
			},
			{
				"comment_id": 38,
				"body": "#Neuromatemática: tendências de desenvolvimento\nhttps://ipfs.infura.io/ipfs/Qmb5iGq1v1KHTnL27diXk4wC578GuMNZCMFkeDoYaEfPpC",
				"added": 1590988392
			}
		],
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 9,
				"body": "#A Hora da Matemática: Códigos e Criptografia\nhttps://invidio.us/watch?v=DpWUoEb2cdo",
				"added": 1590955400
			}
		],
		"1_1ExYhecdNveJBbZnjsxEyjs6FWq7XDv9dr": [
			{
				"comment_id": 12,
				"body": "#O xadrez e a educação - Prof. Dr. Antônio Villar Marques de Sá\nhttps://ipfs.infura.io/ipfs/QmQixtP9z1ScBrRZRWf92zCZgqTBeSSHLumiX6M8ws5ERy",
				"added": 1590958589
			},
			{
				"comment_id": 13,
				"body": "#Curso Básico de Xadrez\nCurso Básico de Xadrez criado desenvolvido no projeto Xadrez na [UFU](http://www.ufu.br/).\n- https://invidio.us/playlist?list=PLJ77KwBqUmDYZv7196JH2zE5Hz0Zg318F",
				"added": 1590958857
			},
			{
				"comment_id": 14,
				"body": "#Xadrez e Educação: contribuições da ciência para o uso do jogo como instrumento pedagógico.\nhttps://ipfs.infura.io/ipfs/QmXhv5wsqpeuyut9qs3DX6KHYHnPr5aXzyc7vfDmjAkLGm",
				"added": 1590959249
			},
			{
				"comment_id": 16,
				"body": "#Princípios estratégicos do jogo de xadrez\nhttps://gateway.pinata.cloud/ipfs/Qmf99A4xcr5seWnXb3qE8uT6KGYTf8XH4oXoHSYsAHtFWz",
				"added": 1590960497
			}
		],
		"4_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": [
			{
				"comment_id": 15,
				"body": "#Hikaru No Go\n- https://www.superanimes.org/anime/hikaru-no-go\n\nShindou Hikaru, aluno da sexta série, acha um jogo antigo no sótão da casa de seu avô. Vendo manchas de sangue no tabuleiro ele tenta limpá-lo, mas nesse momento um espírito sai de dentro do tabuleiro e une- se a consciência de Hikaru, mas sem subjugá-lo. Fujiwara no Sai, o espírito que vivia no goban (tabuleiro de Go), é o espírito de um excelente jogador de Go que viveu durante a era Heian. Ensinava o imperador na arte do Go, juntamente com um segundo tutor. No entanto, o segundo professor, disse não ser necessário dois mestres para ensinar e então um jogo entre os dois professores foi arranjado, de modo que o perdedor deveria deixar o império. Durante o jogo Sai percebe que seu adversário tentava trapacear, mas este menti dizendo que é Sai quem tenta roubar. Abalado pela trapaça Sai acaba perdendo o jogo e não agüentando a humilhação de ter seu nome manchado ele se suicida, no entanto seu espírito queria continuar jogando Go e acaba possuindo um tabuleiro. Junto com Hikaru, Fujiwara no Sai tenta alcançar o “Kami no itte” (mão de Deus), enquanto ensina Shindou Hikaru a arte do Go",
				"added": 1590959470
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 17,
				"body": "#O Universo tem um Norte e um Sul?\n\n#Leis da física variáveis\n\nO mundo da física, da astrofísica e da cosmologia foi sacudido há alguns anos quando a equipe do professor John Webb, da Universidade de Nova Gales do Sul, na Austrália, apresentou observações de centenas de galáxias que mostravam que as [leis da física parecem variar ao longo do Universo](https://web.archive.org/web/20171113124411/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=leis-fisica-variam-longo-universo&id=010830111103).\n\nO assunto continua na agenda, com os teóricos procurando modelos que possam \"encaixar\" os dados nos modelos cosmológicos mais aceitos, e os astrônomos de campo fazendo mais observações e trabalhando para melhorar os equipamentos que possam reforçar ou corrigir os dados observados até agora.\n\nA equipe do professor Webb também não descansou e, enquanto esperam por telescópios melhores e métodos de análise de dados mais refinados, eles decidiram testar suas observações usando um alvo completamente diferente: Em vez de galáxias, eles fizeram várias medições da luz emitida por um quasar - uma estrela giratória cujos feixes de luz lembram um farol marítimo - localizado a quase 13 bilhões de anos-luz de distância.\n\n\"Os quasares mais distantes que conhecemos estão entre 12 e 13 bilhões de anos-luz de nós,\" explica o professor Webb. \"Então, se você puder estudar a luz de quasares distantes em detalhes, está estudando as propriedades do Universo quando ele era pequeno, com apenas um bilhão de anos. O Universo era muito, muito diferente. Nenhuma galáxia existia, as primeiras estrelas já haviam se formado, mas certamente não havia a mesma população de estrelas que vemos hoje. E não havia planetas.\"\n\nA equipe fez quatro medições da constante fina ao longo da linha de visão desse quasar. Individualmente, as quatro medições não forneceram nenhuma anomalia.\n\nNo entanto, quando elas foram combinadas e confrontadas com muitas outras medições, feitas por outros astrônomos e não relacionadas às observações da equipe, tornaram-se evidentes as mesmas diferenças na constante da estrutura fina que os estudos anteriores haviam mostrado.\n\n#Constante da estrutura fina\n\nA constante da estrutura fina é uma medida do eletromagnetismo - uma das quatro forças fundamentais da natureza (as outras são gravidade, força nuclear fraca e força nuclear forte).\n\n\"A constante da estrutura fina é uma quantidade que os físicos usam como uma medida da intensidade da força eletromagnética. É um número sem dimensão e envolve a velocidade da luz, algo chamado [constante de Planck](https://web.archive.org/web/20171111035525/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=constantes-fundamentais-natureza-mudanca&id=010115110721) e a [carga dos elétrons](https://web.archive.org/web/20181103235407/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=eletron-e-redondo&id=010115181018), sendo uma proporção dessas coisas. É este número que os físicos usam para medir a intensidade da força eletromagnética,\" explicou o professor Webb.\n\nA força eletromagnética mantém os elétrons zunindo em torno de um núcleo em todos os átomos do Universo - sem ela, toda a matéria se esfacelaria. Até recentemente, acreditava-se que ela seria uma força imutável ao longo do tempo e do espaço. Mas, nas últimas duas décadas, dados observacionais começaram a mostrar anomalias na constante da estrutura fina, mais especificamente, a força eletromagnética medida em uma direção específica do Universo parece um pouco diferente dos resultados obtidos quando ela é medida numa direção ligeiramente diferente.\n\n\"Nós descobrimos uma pista de que esse número da constante da estrutura fina era diferente em certas regiões do Universo. Não apenas em função do tempo, mas de fato na direção [espacial] do Universo, o que é realmente bastante estranho se estiver correto... mas foi o que descobrimos,\" disse Webb\n\n#Evidências adicionais da direcionalidade do Universo\n\nE, como acontece frequentemente na ciência, calhou de um trabalho de uma outra equipe, em um campo não relacionado, e publicado quase ao mesmo tempo, vir se somar ao argumento de que o Universo tem uma direcionalidade.\n\nKonstantinos Migkas e seus colegas da Universidade de Bonn, na Alemanha, estavam estudando emissões de raios X de aglomerados de galáxias quando verificaram em seus dados o mesmo indício de que o Universo tem algum tipo de direcionalidade, ou, como eles dizem, que o Universo não é isotrópico.\n\n\"Eu não sabia nada sobre esse artigo até que ele apareceu na literatura,\" comentou Webb. \"E eles não estão testando as leis da física, eles estão testando as propriedades, as propriedades dos raios X das galáxias e dos aglomerados de galáxias e as distâncias cosmológicas da Terra. Eles também descobriram que as propriedades do Universo nesse aspecto não são isotrópicas e que há uma direção preferencial. E eis que a direção deles coincide com a nossa.\"\n\n#Um Universo estranho\n\nAs implicações dessas observações sobre nossa compreensão do Universo são enormes.\n\nO que se pensava ser um mar aleatório de galáxias, quasares, buracos negros, estrelas, nuvens de gás e planetas - com a vida florescendo em pelo menos um pequeno nicho dele -, o Universo de repente parece ter o equivalente a um norte e um sul.\n\n\"O Universo pode não ser isotrópico em suas leis da física - leis que seriam as mesmas, estatisticamente, em todas as direções. Mas, de fato, pode haver alguma direção ou direção preferencial no Universo onde as leis da física mudam, mas não na direção perpendicular. Em outras palavras, o Universo, em certo sentido, possui uma estrutura dipolar.\n\n\"Em uma direção específica, podemos olhar para trás 12 bilhões de anos-luz e medir o eletromagnetismo quando o Universo era muito jovem. Juntando todos os dados, o eletromagnetismo parece aumentar gradualmente quanto mais longe olhamos, enquanto na direção oposta ele diminui gradualmente. Em outras direções no cosmos, a constante de estrutura fina permanece exatamente isso - uma constante. Essas novas medições muito distantes empurraram nossas observações muito além do que jamais foi alcançado antes.\n\n\"Isso é algo que é levado muito a sério e é encarado, muito corretamente com ceticismo, mesmo por mim, mesmo que eu tenha feito o primeiro trabalho com meus alunos. Mas é algo que você precisa testar porque é possível que vivamos em um universo estranho,\" comentou Webb.\n\nA equipe do professor Webb acredita que estes são apenas os primeiros passos de um estudo que deverá avançar muito, com observações de muitas direções do Universo, usando dados provenientes de novos instrumentos nos maiores telescópios do mundo.\n\nAlém disso, novas tecnologias estão surgindo para fornecer dados de maior qualidade e novos métodos de análise de inteligência artificial ajudarão a automatizar as medições e executá-las mais rapidamente e com maior precisão, o que ajudará a esclarecer se as [leis da Física realmente variam ao longo do Universo](https://web.archive.org/web/20171114060953/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=variacao-leis-fisica&id=010830100910) e mesmo se existe um \"fluxo escuro\" pelo qual o [Universo estaria \"vazando\" para uma outra dimensão](https://web.archive.org/web/20171114063317/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=fluxo-escuro&id=010130100405).\n\n#Artigos: https://gateway.pinata.cloud/ipfs/QmPMC9TJzquGEdpZ2fMHzwATL479a86jB1yyMFfYfnrkBp\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=universo-tem-norte-sul&id=010130200515",
				"added": 1590972482
			},
			{
				"comment_id": 18,
				"body": "#Nosso Universo pode estar em uma ponte entre dois outros universos\n\n#Vermes\n\nO nosso universo pode estar situado no interior de um buraco de minhoca (wormhole) - também conhecido como Ponte de Einstein-Rosen - uma espécie de \"cano\" hipotético que une dois universos.\n\nO próprio buraco de minhoca seria parte de um buraco negro que ficaria dentro de um universo muito maior, que contém o nosso como um traço dificilmente detectável por algum cientista \"extra-universal\".\n\nEsse cenário, com cara de ficção científica, no qual nosso universo nasceu dentro um buraco de minhoca, está em um artigo que acaba de ser publicado em uma das mais importantes revistas de Física do mundo.\n\n#Gravidade e expansão acelerada do Universo\n\nTal exercício teórico não nasce da ociosidade: acontece que a física atual se debate há anos com problemas difíceis de resolver. O maior deles é a nossa bem conhecida gravidade.\n\nEmbora seus efeitos possam ser sentidos o tempo todo, ela não se dá com as outras forças conhecidas. Nenhum cientista conseguiu até hoje desenvolver uma teoria que junte a gravidade às forças nucleares fraca e forte e ao eletromagnetismo.\n\nO outro problema é a expansão do Universo. A gravidade deveria estar fazendo com que ele estivesse se contraindo, ou no mínimo, ela deveria estar desacelerando sua expansão. Mas as observações mostram o contrário, o que fez surgir as teorias da [matéria escura](https://web.archive.org/web/20191015052655/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=universo-dentro-buraco-minhoca&id=010130100413) e da [energia escura](https://web.archive.org/web/20191015052705/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=cientistas-criam-primeira--imagem--da-energia-escura&id=010130080526).\n\n#Saindo pelo cano\n\nNikodem Poplawski, da Universidade de Indiana, nos Estados Unidos, acredita que esses problemas podem ser resolvidos se nosso universo tiver nascido quando uma estrela gigante, situada em um universo muito maior e muito mais antigo do que o nosso, colapsou, formando uma ponte para um outro universo.\n\nSe o nosso universo surgiu no meio dessa ponte entre esses dois outros universos, a gravidade pode ser rastreada para antes daquele instante mágico do Big Bang, permitindo sua unificação com as outras forças.\n\nE a expansão acelerada do nosso universo seria explicada pelo simples fato de que estaríamos \"vazando\" pelo buraco de minhoca, atraídos por outro universo.\n\n#Buracos brancos\n\nPoplawski admite que apenas um experimento ou uma observação direta poderiam revelar o movimento de uma \"partícula\" - tão grande quanto o nosso próprio universo - em um buraco negro real.\n\nMas ele também salienta que, como os observadores somente podem ver o lado de fora de um buraco negro, o interior não pode ser vislumbrado a menos que um observador entre no buraco negro ou já more lá.\n\n\"Esta condição seria satisfeita se o nosso universo estiver no interior de um buraco negro existente em um universo maior,\" afirma ele.\n\n\"Como a teoria geral da relatividade de Einstein não escolhe uma [orientação para o tempo](https://web.archive.org/web/20191015052653/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=a-flecha-quantica-tempo-tempo-nao-anda-tras&id=010130100122), se um buraco negro pode se formar a partir do colapso gravitacional de matéria através de um horizonte de eventos no futuro, então o processo inverso também é possível. Um processo assim poderia descrever um buraco branco explodindo: a matéria emergindo de um horizonte de eventos no passado, exatamente como o Universo em expansão,\" explica Poplawski.\n\nUm buraco branco é conectado a um buraco negro por uma ponte de Einstein-Rosen (ou buraco de minhoca) e é, hipoteticamente, a reversão no tempo de um buraco negro.\n\n#Um universo em cada buraco negro\n\nNo artigo, Poplawski sugere que todos os buracos negros astrofísicos - e não apenas os buracos negros Schwarzschild e Einstein-Rosen - podem ter pontes Einstein-Rosen, cada um com um novo universo em seu interior, que se formou simultaneamente com o buraco negro.\n\n\"Do que decorre que o nosso universo poderia ter-se formado dentro de um buraco negro existente dentro de outro universo\", defende ele. Ou, mais especificamente, dentro de um buraco de minhoca que une dois outros universos.\n\nSegundo ele, o conceito de um universo que nasce no interior de um buraco negro de Einstein-Rosen poderia evitar ainda o problema da física atual com o chamado problema da perda de informação dos buracos negros, que afirma que toda e qualquer informação sobre a matéria é perdida quando ela passa pelo horizonte de eventos de um buraco negro - por sua vez, desafiando as leis da física quântica.\n\nPara isso, ele propõe o uso de um sistema de coordenadas euclidianas, chamadas coordenadas isotrópicas, para descrever o campo gravitacional de um buraco negro e para modelar o movimento geodésico radial de uma \"partícula de grande massa\" no interior desse buraco negro.\n\nEm seu trabalho, Poplawski estudou o movimento radial ao longo do horizonte de eventos (a fronteira de um buraco negro) de buracos negros do tipo Schwarzschild e Einstein-Rosen - ambos soluções matematicamente legítimas da Relatividade Geral. Faltaria agora generalizar mais a sua solução.\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmTebMw6mCRzB1qtr7JmZ9b2i1wdPQXdBujvH4x5WKAgWd\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=universo-dentro-buraco-minhoca&id=010130100413",
				"added": 1590973038
			},
			{
				"comment_id": 19,
				"body": "#Matemática além de Einstein descarta buracos negros e Big Bang\n\n#Singularidade dos buracos negros\n\nQuando estrelas grandes colapsam, no fim de suas vidas, elas podem criar buracos negros, que estariam assim por toda parte no Universo.\n\nEsta é a teoria mais difundida, que você lê nos livros-texto e vê nos filmes e programas de divulgação científica na TV.\n\nAcontece é que esta é uma teoria que um número cada vez maior de físicos afirma que não deve ser levada tão a sério.\n\nVários físicos teóricos têm questionado [se as singularidades dos buracos negros realmente existem](https://web.archive.org/web/20191117113603/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=010805070625&id=010805070625). Para isso eles têm usado equações matemáticas complexas, mas têm tido pouco sucesso até agora em convencer a maioria dos seus colegas.\n\nUm trio da Universidade da Louisiana, nos EUA, apresentou agora novas equações matemáticas que vão além da Teoria da Relatividade Geral de Einstein, superando sua principal limitação - a singularidade central dos buracos negros.\n\n#Além da singularidade\n\nUma teoria chamada [Teoria da Gravidade Quântica em Circuito Fechado](https://web.archive.org/web/20191117113557/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=010130070719&id=010130070719), ou modelo LQG, do inglês Loop Quantum Gravity, foi desenvolvida na década de 1990 combinando as leis da física microscópica, ou mecânica quântica, com a gravidade, na tentativa de explicar a dinâmica do espaço e do tempo.\n\nAs novas equações publicadas agora descrevem os buracos negros dentro do arcabouço da gravidade quântica em loop e mostra que a singularidade dos buracos negros simplesmente não existe. Para isso, o trio se fundamenta na [menor unidade possível de espaço](https://web.archive.org/web/20191117113618/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=atomos-de-espaco&id=010130131025).\n\n\"Na teoria de Einstein, o [espaço-tempo é um tecido que pode ser dividido tão pequeno](https://web.archive.org/web/20191117113618/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=atomos-de-espaco&id=010130131025) quanto queiramos. Essa é essencialmente a causa da singularidade, onde o campo gravitacional se torna infinito. Na gravidade quântica em loop, o tecido do espaço-tempo tem uma estrutura parecida com azulejos, que não pode ser dividida além do menor azulejo. Meus colegas e eu mostramos que este é o caso dentro dos buracos negros e, portanto, não há singularidade,\" disse o professor Parampreet Singh.\n\nEm vez da singularidade, a gravidade quântica em loop prevê um funil para outra ramificação do espaço-tempo - outra dimensão, ou outro universo, como queira - por onde escoa tudo o que a gigantesca gravidade do buraco negro suga.\n\nO problema é testar as teorias. Assim como ninguém conseguiu detectar diretamente um buraco negro até agora, é difícil trabalhar com as dimensões envolvidas nos cálculos.\n\n\"Essas unidades de geometria parecidas com ladrilhos - chamadas 'excitações quânticas' -, que resolvem o problema da singularidade, são ordens de magnitude menores do que podemos detectar com a tecnologia de hoje, mas temos equações matemáticas precisas que predizem seu comportamento,\" disse Abhay Ashtekar, que é um dos fundadores da teoria da gravidade quântica em circuito fechado.\n\n#Testar as teorias\n\nA teoria de Einstein falha não apenas no centro dos buracos negros, mas também para [explicar como o Universo foi criado a partir da singularidade do Big Bang](https://web.archive.org/web/20191117113608/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=teoria-dispensa-singularidades-descarta-big-bang&id=010130180413).\n\nA equipe já havia lidado com esse problema, [substituindo o Big Bang por um Big Bounce](https://web.archive.org/web/20191117113557/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=010130070719&id=010130070719) (Grande Salto).\n\n\"Nós temos desenvolvido técnicas computacionais de última geração para extrair as consequências físicas dessas equações físicas usando supercomputadores, ficando cada vez mais perto de testar de forma confiável a gravidade quântica,\" disse Singh.\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmT7xzpTNsXU52eTcotzBw4Wn4ypErbdTqRsmioeERV3fH\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=matematica-alem-einstein-descarta-buracos-negros-big-bang&id=010130190124",
				"added": 1590974174
			},
			{
				"comment_id": 20,
				"body": "#Gráviton Nexus pode explicar energia e matéria escuras\n\n#Quase 100% no escuro\n\nSem novas ideias e sem novos resultados observacionais que possam fundamentar um [novo modelo cosmológico](https://web.archive.org/web/20191019001637/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=orbita-galaxias-contradiz-modelo-cosmologico&id=010130140729), os físicos estão às voltas com a busca por uma teoria quântica da gravitação e de explicações sobre a matéria escura e a energia escura, que tudo indica representam 95% do Universo observável.\n\nCom um mistério tão grande, talvez a solução possa surgir de onde menos se espera. Neste caso, de um físico cubano que atualmente trabalha em Botswana.\n\nO fato é que o trabalho de Stuart Marongwe está chamando a atenção da comunidade científica.\n\n#Universo Nexus\n\nMarongwe propôs uma teoria que ele batizou de Nexus, no sentido de que ela fornece uma conexão entre a Teoria Quântica e a Relatividade Geral.\n\nEsta ligação se manifestaria sob a forma de um \"gráviton Nexus\", uma partícula composta de spin 2 que nada mais é do que uma partícula do espaço-tempo, que emerge naturalmente do processo de unificação entre as duas teorias.\n\nUma característica notável do gráviton Nexus, que o distingue do gráviton hipotético do Modelo Padrão da Cosmologia - que ainda não foi encontrado - é que o gráviton Nexus não é uma partícula \"mensageira\", ou virtual. Ela de fato induz um movimento de rotação constante em qualquer partícula com a qual entre em contato.\n\nAlém disso, o gráviton Nexus também pode ser considerado como um glóbulo de [energia do vácuo](https://web.archive.org/web/20191019001629/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=estrela-neutrons-acordar-vacuo-quantico&id=010130101004), que pode se fundir ou resultar da cisão de outros grávitons, em um processo que se assemelha com a citocinese da biologia celular - a divisão da célula em duas cópias idênticas.\n\n#Partícula de matéria escura\n\nPara Marongwe, o gráviton Nexus é a própria partícula da matéria escura e constitui o espaço-tempo.\n\nE a emissão de um gráviton de menos energia por um gráviton de energia mais alta resulta na expansão do gráviton de energia mais alta conforme ele assume um estado de energia mais baixo, um processo que se manifesta como Energia Escura e que ocorre em toda a extensão do espaço-tempo.\n\nAlém de lançar luzes sobre algumas das principais questões não respondidas da física contemporânea, a teoria de Marongwe inclui uma descrição quântica dos buracos negros que se livra das [singularidades inerentes à relatividade de Einstein](https://web.archive.org/web/20191117113737/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=nova-teoria-cosmologica-descarta-big-bang&id=010130140228) - nas singularidades, a própria física se esfacela.\n\nSe as soluções apresentadas por Marongwe serão aceitas como sinalização de uma nova física agora irá depender da análise de seus colegas e, sobretudo, de se encontrar alguma maneira de testar as muitas conclusões desse novo Nexus.\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmVsEBiEiTAYjw4sQeaoDkHsUQctYWFkKhEXgvdKXbvCbU\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=graviton-nexus-explicar-energia-materia-escura&id=010130150320",
				"added": 1590974866
			},
			{
				"comment_id": 21,
				"body": "#Especial [Matéria Escura](https://en.wikipedia.org/wiki/Dark_matter)\n\nDo que a matéria escura é feita?\n- https://web.archive.org/web/20200421232348/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=do-que-a-materia-escura-e-feita&id=010130160222\n\nNeutrinos estéreis e neutralinos\n- https://web.archive.org/web/20181019212119/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=neutrinos-estereis-neutralinos&id=010130160223\n\nÁtomos de matéria escura\n- https://web.archive.org/web/20170706174716/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=atomos-materia-escura&id=010130160224\n\nAssimetrias e espelhos\n- https://web.archive.org/web/20170706172105/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=materia-escura-assimetrica-espelho&id=010130160225\n\nDimensões extras e mistura de matéria\n- https://web.archive.org/web/20180919130037/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=materia-escura-extradimensional&id=010130160226",
				"added": 1590975350
			},
			{
				"comment_id": 22,
				"body": "#Nova Teoria da Gravidade dispensa Matéria Escura\n\n#Gravidade Emergente\n\nUma nova teoria da gravidade consegue explicar os curiosos movimentos das estrelas nas galáxias sem precisar apelar para a matéria escura.\n\nBatizada de \"gravidade emergente\" por seu autor, a nova teoria prediz exatamente o mesmo desvio de movimentos que o modelo cosmológico padrão explica inserindo a [elusiva e nunca detectada matéria escura](https://web.archive.org/web/20200421232348/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=do-que-a-materia-escura-e-feita&id=010130160222).\n\nO professor Erik Verlinde, da Universidade de Amsterdã, na Holanda, um especialista renomado em Teoria das Cordas, acaba de publicar um artigo no qual ele expande suas visões inovadoras sobre a natureza da gravidade, que ele começou a esboçar em um artigo publicado em 2010.\n\nSegundo Verlinde, a gravidade não é uma força fundamental da natureza, mas um fenômeno emergente. Da mesma forma que a temperatura surge do movimento de partículas microscópicas, a gravidade emerge das mudanças de unidades fundamentais de informação, armazenados na própria estrutura do espaço-tempo.\n\n#Lei de Newton da informação\n\nEm seu artigo de 2010, Verlinde mostrou como a famosa Segunda Lei de Newton - que descreve como as maçãs caem das árvores e os satélites artificiais permanecem em órbita - pode ser derivada desses blocos fundamentais microscópicos. Estendendo seu trabalho anterior, e incorporando melhorias publicadas por outros físicos desde então, Verlinde agora mostra como entender o comportamento das estrelas nas galáxias, que parecem girar rápido demais.\n\nA velocidade das estrelas é tão grande que é necessário haver uma força gravitacional extra para explicar porque elas não são arremessadas para fora das galáxias - a matéria escura é o componente teórico que foi adicionado à teoria para responder por essa \"gravidade faltante\". Contudo, até agora, as supostas partículas de matéria escura nunca foram observadas, apesar de esforços e experimentos milionários para detectá-las.\n\n#\"Não há necessidade de matéria escura\"\n\nDe acordo com o professor Verlinde, não há necessidade de adicionar uma misteriosa partícula de matéria escura à teoria. Sua teoria da gravidade emergente prediz com precisão as velocidades com que as estrelas giram em torno do centro da Via Láctea, bem como o movimento das estrelas dentro de outras galáxias. \"Temos evidências de que esta nova visão da gravidade realmente concorda com as observações,\" defende ele. \"Em grandes escalas, ao que parece, a gravidade simplesmente não se comporta da maneira que a teoria de Einstein prevê\".\n\nÀ primeira vista, a teoria de Verlinde tem características semelhantes a outras teorias modificadas da gravidade, como a [MOND (Modified Newtonian Dynamics, ou Dinâmica Newtoniana Modificada)](https://web.archive.org/web/20170914162544/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=teoria-modificada-gravidade&id=010130110314). No entanto, onde a MOND ajusta a teoria para coincidir com as observações, a teoria de Verlinde começa a partir dos chamados primeiros princípios, sem qualquer necessidade de ajuste.\n\nE seus cálculos batem com as observações mais recentes, publicadas no mês passado, e que também parecem dispensar a necessidade da matéria escura: https://web.archive.org/web/20170914201335/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=dados-dispensam-materia-escura-explicar-universo&id=010130161021\n\n#Princípio holográfico\n\nUm dos ingredientes da teoria de Verlinde é uma adaptação do Princípio Holográfico, introduzido por seu professor Gerard Hooft (Nobel de Física de 1999, Universidade de Utrecht) e Leonard Susskind (Universidade de Stanford). De acordo com o Princípio Holográfico, toda a informação em todo o Universo pode ser descrita sobre uma esfera imaginária gigante ao seu redor.\n\nO professor Verlinde afirma que essa ideia não está totalmente correta: parte da informação em nosso Universo está contida no próprio espaço. Essa informação extra é necessária para descrever aquele outro componente escuro do Universo: a Energia Escura, que é considerada responsável pela expansão acelerada do Universo - outra hipótese que está sob fogo cerrado.\n\nAo estudar os efeitos dessa informação adicional sobre a matéria ordinária, Verlinde chegou a uma conclusão impressionante: Enquanto a gravidade ordinária pode ser codificada usando a informação na esfera imaginária ao redor do Universo, o resultado da informação adicional no volume do espaço é uma força que bate perfeitamente com aquela hoje atribuída à matéria escura.\n\nÀ beira de uma revolução científica\n\nA gravidade está mesmo precisando urgentemente de novas abordagens como a de Verlinde, uma vez que ela não combina com a bem-sucedida física quântica. Ambas as teorias, as joias da coroa da Física, não podem ser verdadeiras ao mesmo tempo, com os problemas emergindo vigorosos em condições extremas: perto de buracos negros, ou durante o Big Bang.\n\n\"Muitos físicos teóricos como eu estão trabalhando em uma revisão da teoria, e alguns grandes avanços vêm sendo feitos. Podemos estar à beira de uma nova revolução científica, que mudará radicalmente nossa visão sobre a própria natureza do espaço, do tempo e da gravidade,\" concluiu Erik Verlinde.\n\n#Artigos: https://gateway.pinata.cloud/ipfs/QmUeEvZR5vbFwmMEtDEuNuFZwQzchbYLzPYdmTyGdkqG7a\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=teoria-gravidade-emergente&id=010130161118",
				"added": 1590976279
			},
			{
				"comment_id": 23,
				"body": "#Teoria Camaleão explica formação de galáxias e expansão do Universo\n\n#Gravidade f(R)\n\nA teoria da Relatividade Geral de Einstein é mundialmente famosa - mas pode não ser a única maneira de explicar como a gravidade funciona e como as galáxias se formam.\n\nFísicos da Universidade de Durham, no Reino Unido usaram supercomputadores para criar enormes simulações do Universo para testar uma dessas teorias alternativas.\n\nEles descobriram que a \"Teoria Camaleão\" - conhecida entre os físicos como gravidade f(R) - também consegue explicar a formação de grandes estruturas no cosmos.\n\nAs simulações mostram que as galáxias espirais, como a nossa Via Láctea, formam-se mesmo quando uma lei de gravidade diferente é aplicada.\n\nOs cientistas já sabiam que a gravidade f(R) consegue reproduzir o sucesso da Relatividade Geral em demonstrar a evolução do nosso Sistema Solar.\n\n\"Mas nossa nova pesquisa agora mostra que essa teoria também pode ser aplicada à formação de galáxias em escalas cosmológicas muito grandes,\" escreveu o trio.\n\n#Evolução do Universo\n\nO resultado dessas simulações não significa que Einstein estava errado.\n\nEm vez disso, as simulações mostram que pode haver mais de uma maneira de explicar o papel da gravidade na evolução do Universo, defende o trio de físicos.\n\nTambém há consequências para o entendimento da expansão acelerada do Universo, que se acredita ser dirigida por uma substância misteriosa chamada energia escura.\n\nOcorre que modelos como a gravidade f(R) também podem explicar o rápido crescimento do Universo, que teria uma origem totalmente geométrica. Na teoria f(R), a aceleração cósmica não vem de uma forma exótica de energia, mas de uma modificação da força gravitacional. A força modificada também afeta a taxa na qual pequenos aglomerados de matéria podem crescer ao longo das eras para se tornarem grandes aglomerados de galáxias, abrindo a possibilidade de um teste da teoria.\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmdM4rLRKaoUwAtDoNErF7wRLcdGqcS7SdTVGzRA4oCQfY\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=teoria-camaleao&id=010130191021",
				"added": 1590977143
			},
			{
				"comment_id": 24,
				"body": "#Eventos acima da velocidade da luz unificam Física Quântica e Relatividade\n\n#Unificação da Mecânica Quântica com a Teoria da Relatividade\n\nPor quase cem anos, a Mecânica Quântica aguarda uma teoria mais profunda para explicar a natureza de seus fenômenos misteriosos. E, sonho de todos os físicos, talvez uma teoria que a unifique com a Teoria da Relatividade.\n\nSe o raciocínio apresentado agora pelos físicos Andrzej Dragan (Universidade de Varsóvia) e Artur Ekert (Universidade de Oxford) resistir ao escrutínio de seus colegas de todo o mundo, a história pode estar muito bem prestes a pregar uma peça cruel em todos esses físicos, de todas as gerações desde Einstein.\n\nA \"teoria desconhecida\" procurada há décadas, explicando a singularidade da Mecânica Quântica - com o perdão do trocadilho -, seria derivada da Teoria da Relatividade, e não o contrário.\n\nHoje, a maioria dos físicos aceita que a descrição da realidade feita pela Mecânica Quântica seria mais fundamental, e que a Teoria da Relatividade teria que ser ajustada a ela.\n\nDragan e Ekert propõem que não, que as características mais importantes do mundo quântico podem resultar da Teoria Especial da Relatividade, que até agora parecia ter pouco a ver com a Mecânica Quântica.\n\n#Velocidade da luz\n\nDesde o início, a Mecânica Quântica surpreende com sua peculiaridade, tão difícil de entender e conciliar com o que estamos acostumados no mundo cotidiano: Por que uma partícula passa por duas fendas simultaneamente? E por que uma partícula \"tunela\", atravessando uma barreira sólida, quando nós sempre damos dolorosamente com a cara na parede?\n\nE o que realmente incomoda os físicos desde a elaboração da Mecânica Quântica e da Teoria da Relatividade é a incompatibilidade desses três conceitos - três, uma vez que existem duas teorias da relatividade: a especial e a geral.\n\nOs dois físicos desenvolveram um modelo no qual eles provam matematicamente que as características da Mecânica Quântica que determinam sua singularidade e seu exotismo não-intuitivo - teoria que é aceita, além do mais, com base em axiomas, que muitos físicos preferem chamar de \"fé\" - podem ser explicadas dentro da estrutura da Teoria Especial da Relatividade, dispensando qualquer fé em pressupostos.\n\nEinstein baseou a Teoria Especial da Relatividade em dois postulados. O primeiro é conhecido como o princípio da relatividade galileano (que, é importante notar, é um caso especial do princípio copernicano). Aquele princípio afirma que a física é a mesma em qualquer sistema inercial, isto é, seja em repouso ou em movimento retilíneo uniforme.\n\nO segundo postulado, que Einstein considerava crucial e que foi formulado com base no famoso experimento Michelson-Morley - aquele que fez com que os físicos deixassem o éter de lado - impôs a exigência de uma velocidade constante da luz em todos os sistemas de referência.\n\n#Causas sem efeitos e efeitos sem causas\n\nA Teoria Especial da Relatividade é uma estrutura coerente que permite três tipos de soluções matematicamente corretas: um mundo de partículas se movendo a velocidades subluminais (abaixo da velocidade da luz), um mundo de partículas se movendo à velocidade da luz e um mundo de partículas se movendo a velocidades superluminais (acima da velocidade da luz).\n\nEsta terceira opção sempre foi rejeitada porque, pela própria teoria, ela não teria nada a ver com a realidade, dado o pressuposto da velocidade máxima permitida no Universo, a da luz - exatos 299.792.458 metros por segundo.\n\n\"Nós nos colocamos a seguinte questão: O que acontece - por enquanto, sem entrar na fisicalidade ou não fisicalidade das soluções - se levarmos a sério não uma parte da Teoria Especial da Relatividade, mas toda ela, incluindo o sistema superluminal? Esperávamos paradoxos de causa-efeito. Em vez disso, o que vimos foram exatamente aqueles efeitos que formam o núcleo mais profundo da Mecânica Quântica,\" escrevem Dragan e Ekert.\n\nInicialmente, os dois físicos consideraram um caso simplificado, como é comum nessa parte da ciência: Um espaço-tempo com todas as três famílias de soluções, mas consistindo em apenas uma dimensão espacial e uma dimensão temporal (1 + 1). Nesse modelo, uma partícula em repouso em um sistema de soluções parece mover-se superluminalmente no outro, o que significa que a própria superluminosidade é relativa nesse quadro ampliado.\n\nEm um continuum espaço-temporal construído dessa maneira, eventos não-determinísticos ocorrem naturalmente. Se, em um sistema no ponto A, houver a geração de uma partícula superluminal, mesmo completamente previsível, emitida em direção ao ponto B, onde simplesmente não há informações sobre os motivos daquela emissão, então, do ponto de vista do observador no segundo sistema, eventos se desenrolam do ponto B ao ponto A, de forma que eles emergem de um evento completamente imprevisível. Acontece que efeitos análogos também aparecem no caso de emissões de partículas subluminais.\n\nOs dois físicos também demonstraram que, quando se levam em conta soluções superluminais, o movimento de uma partícula em múltiplas trajetórias simultâneas surge naturalmente, e uma descrição do curso dos eventos exige que se introduza uma soma de amplitudes de probabilidade combinadas que indicam a existência de [superposição](https://web.archive.org/web/20191109063333/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=recorde-superposicao-quantica-nubla-fronteira-entre-quantico-classico&id=010165190925), um fenômeno até agora associado apenas à Mecânica Quântica, em que uma partícula pode estar em vários lugares ao mesmo tempo.\n\n#Três dimensões do tempo\n\nNo caso do espaço-tempo com três dimensões espaciais e uma dimensão temporal (3 + 1), ou seja, correspondendo à nossa realidade física, a situação é mais complicada. O princípio da Relatividade em sua forma original não é preservado - os sistemas subluminal e superluminal são distinguíveis, sem superposição.\n\nNo entanto, os dois físicos notaram que, quando o princípio da Relatividade é modificado para uma forma definida como \"A capacidade de descrever um evento de maneira local e determinística não deve depender da escolha de um sistema de referência inercial\", então isso limita as soluções àquelas nas quais todas as conclusões da consideração no espaço-tempo (1 + 1) permanecem válidas.\n\n\"Nós notamos, aliás, a possibilidade de uma interpretação interessante do papel das dimensões individuais. No sistema que parece superluminal para o observador, algumas dimensões espaço-temporais parecem mudar seus papéis físicos. Somente uma dimensão da luz superluminal tem um caráter espacial - aquela ao longo do qual a partícula se move. As outras três dimensões parecem ser dimensões do tempo,\" contou Dragan.\n\n#Princípio quântico da Relatividade\n\nUma característica das dimensões espaciais é que uma partícula pode se mover em qualquer direção ou permanecer em repouso, enquanto em uma dimensão temporal ela sempre se propaga em uma direção - é o que chamamos de envelhecimento na linguagem cotidiana.\n\nAssim, três dimensões temporais do sistema superluminal com uma dimensão espacial (1 + 3) significariam que as partículas envelheceriam inevitavelmente três vezes simultaneamente. O processo de envelhecimento de uma partícula em um sistema superluminal (1 + 3), observado a partir de um sistema subluminal (3 + 1), teria a aparência de uma partícula movendo-se como uma onda esférica, levando ao famoso princípio de Huygens (todos os pontos em uma frente de onda podem ser tratados eles próprios como uma fonte de uma nova onda esférica) e ao [dualismo onda-partícula](https://web.archive.org/web/20170922182837/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=funcao-onda-realidade-objetiva&id=010130150213), cernes da teoria quântica.\n\nE isso não é mais estranho do que a própria Mecânica Quântica, dizem os dois físicos.\n\n\"Toda a estranheza que aparece quando consideramos soluções relacionadas a um sistema que parece superluminal acaba por não ser mais estranha do que o que a teoria quântica geralmente aceita e experimentalmente verificada tem dito há muito tempo. Pelo contrário, levando em conta um sistema superluminal, é possível - ao menos teoricamente - derivar alguns dos postulados da Mecânica Quântica a partir da Teoria Especial da Relatividade, que não são geralmente aceitas como resultantes uma da outra, mas de outras razões mais fundamentais,\" concluiu o Dr. Dragan.\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmY9K3sqPKY7D4APa9yhQmAD3Eypf4t2DusCqNyzULH7HQ\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=eventos-acima-velocidade-luz-unificacao-fisica-quantica-relatividade&id=010130200403",
				"added": 1590977605
			},
			{
				"comment_id": 25,
				"body": "#Cientistas brasileiros criam modelo cosmológico que unifica matéria escura, energia escura e inflação cósmica\n\nHoje, a cosmologia demanda grande parte de seus esforços em tentar entender o que seria a matéria escura e a energia escura, pois muito pouco se conhece sobre essas duas quantidades. Além disso, alguns outros problemas do modelo padrão da cosmologia moderna só podem ser resolvidos no âmbito de um universo que passou por uma abrupta expansão cósmica logo após o Big Bang.\n\nA natureza da matéria escura, a qual recebe esse nome por interagir apenas gravitacionalmente, e da energia escura, responsável por impulsionar a expansão acelerada do universo hoje, são desconhecidas, da mesma forma que o agente responsável pela inflação cósmica inicial também é desconhecido.\n\nNesse contexto, pesquisadores da Unesp e do Instituto de Educação, Ciência e Tecnologia do Paraná construíram um modelo cosmológico utilizando um campo físico chamado de “espinor com dimensão de massa um”, o qual é uma partícula exótica que não possui interação com a luz. Em um trabalho publicado no Journal of Cosmology and Astroparticle Physics, principal periódico internacional de cosmologia e astrofísica, os pesquisadores mostraram que esse campo é capaz de realizar a inflação cósmica, depois se transformar em matéria escura e ainda dar origem a energia escura, tudo isso feito de maneira natural.\n\n\nDe acordo com Thiago Guimarães, um dos autores, “O campo MDO, embora seja um férmion, cosmologicamente pode atuar como um campo escalar efetivo, o que nos permite obter um modelo mais rico tanto do ponto de vista matemático quanto do ponto de vista físico, isso nos fez olhar com mais cuidado para esse campo e para como ele poderia atuar em diferentes fases do Universo”.\n\nO modelo proposto pelos pesquisadores, tem se mostrado promissor, pois consegue descrever todas as fases do universo após o Big Bang e ainda oferece uma explicação física para a ocorrência da inflação cósmica. “Nos modelos tradicionais em que um campo escalar é o agente responsável pela inflação, não conseguimos encontrar uma motivação física para esse processo, o campo escalar simplesmente realiza a inflação. Já no modelo em que um campo fermiônico realiza a inflação, o universo é obrigado a expandir de tamanho muito rapidamente para acomodar as partículas desse campo em estados de energia muito próximo do valor mínimo, respeitando o princípio de exclusão de Pauli”, afirma Guimarães.\n\nAs simulações numéricas mostraram que campo MDO atuando cosmologicamente é capaz de levar à densidade correta de matéria observada nos dias de hoje, além de que a expansão do Universo feita por algum tipo de energia escura está em perfeito acordo com os dados observacionais de supernova do tipo 1A. “Nosso modelo consegue guiar a dinâmica do Universo durante a inflação cósmica exatamente como um bom candidato a inflaton [partícula que realiza a inflação], logo após esse período o campo MDO atinge o vácuo do potencial cosmológico ao qual respeita, então passa por um rápido período conhecido como Big Bang Frio e começa a oscilar rapidamente, nesse período o Universo reaquece e nosso campo decai nas demais partículas do modelo padrão, essa parte da história cósmica se chama era da radiação. Uma vez que esse decaimento do campo é incompleto, o que sobra do MDO surge diretamente acoplado com a matéria bariônica após o fim do período da radiação, dando início a era de domínio da matéria escura. Por último, a energia escura nasce naturalmente como energia de vácuo vinda de um termo constante do potencial cosmológico. Assim mostramos que um único campo físico pode ser capaz de guiar toda a história do Universo como conhecemos”, afirmam os pesquisadores\n\nNo presente momento, os autores estão construindo uma teoria de perturbação efetiva, a qual é necessária para conectar o modelo teórico com as perturbações que existem na radiação cósmica de fundo em micro-ondas, que permeia todo o Universo. Guimarães afirma que “(…) em uma primeira análise, nosso modelo parece reproduzir as perturbações cosmológicas necessárias para descrever as inomogeneidades da radiação cósmica de fundo observadas hoje, porém um estudo muito mais cuidadoso deve ser feito devido as características matemáticas dos campos espinoriais. Por agora podemos dizer que nosso modelo parece funcionar muito bem (…)”.\n\nPara que o modelo possa ser provado como verdadeiro é necessário ainda que essa partícula seja encontrada em aceleradores de partículas, como o LHC, por exemplo, e possua as características previstas. Assim, apenas o tempo confirmará o sucesso do modelo que no momento se mostra muito promissor.\n\nAos interessados no assunto, um dos autores fez uma [publicação](https://simetriadegauge.blogspot.com/2019/05/uma-teoria-cosmologica-unificada-que.html) descrevendo detalhadamente a pesquisa em seu blog pessoal.\n\n#Referência: https://gateway.pinata.cloud/ipfs/QmRCWowcU6WKndomBZJQgMGxWjXcyEvbDCgadUKtKeoaAi\n\n- Fonte: https://universoracionalista.org/cientistas-brasileiros-criam-modelo-cosmologico-que-unifica-materia-escura-energia-escura-e-inflacao-cosmica/",
				"added": 1590977882
			},
			{
				"comment_id": 26,
				"body": "#Desculpe, mas você não vai poder voltar no tempo\n\n#Simetria do tempo\n\nSe três ou mais objetos se movimentarem, sejam átomos ou planetas, a história não poderá ser revertida.\n\nEsta é a conclusão de uma equipe internacional de pesquisadores com base em simulações de computador de três buracos negros em uma complexa órbita trinária, contestando outros físicos que garantem que a [viagem no tempo é possível](https://web.archive.org/web/20181118074009/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=viagem-tempo-tardis-matematicamente-possivel&id=010130170519).\n\nA maioria das leis básicas da física não tem problemas com a direção do tempo - elas não tem problemas em ir do passado para o futuro, mas também não se importam de voltarem do futuro rumo ao passado. Elas são, como os cientistas as chamam, simétricas em relação ao tempo ou simétricas no tempo.\n\nNa prática, no entanto, todo mundo sabe que o tempo não pode simplesmente correr para trás. Por exemplo, um copo que cai em cem pedaços realmente não voa de volta para sua mão espontaneamente e sem danos. Até agora, os cientistas explicaram a falta de simetria do tempo em escala macro pela interação estatística entre um grande número de partículas.\n\nAgora, três astrônomos mostraram que apenas três partículas são suficientes para quebrar a simetria do tempo e estabelecer uma via de mão única para a seta do tempo.\n\n#Órbitas de buracos negros\n\nTjarda Boekholt (Universidade de Coimbra, Portugal), Simon Portegies Zwart (Universidade de Leiden, Países Baixos) e Mauri Valtonen (Universidade de Turku, Finlândia) calcularam as órbitas de três buracos negros que se influenciam mutuamente.\n\nIsso foi feito em duas simulações. Na primeira, os buracos negros partem do repouso. Então eles se movem um em direção ao outro e passam um pelo outro em órbitas complicadas. Finalmente, um buraco negro deixa a companhia dos outros dois. A segunda simulação começa com a situação final de dois buracos negros e o terceiro buraco negro que escapou tenta fazer o tempo retroceder para a situação inicial.\n\nAcontece que o tempo não pode ser revertido em 5% dos cálculos, mesmo que o computador use mais de cem casas decimais. Os últimos 5% não são, portanto, uma questão de melhores computadores ou métodos de cálculo mais inteligentes, como se pensava anteriormente.\n\n#Comprimento de Planck\n\nOs pesquisadores explicam a irreversibilidade do tempo usando o conceito de [comprimento de Planck](https://web.archive.org/web/20171105150204/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=gravidade-quantica-testada-laboratorio&id=010130120319), a distância em que os efeitos quânticos se tornam significativos. É um princípio conhecido na física que se aplica a fenômenos no nível atômico e menores, e vale 1,6 x 10-35 metro.\n\n\"O movimento dos três buracos negros pode ser tão caótico que algo tão pequeno quanto o comprimento de Planck influenciará os movimentos. Os distúrbios do tamanho do comprimento de Planck têm um efeito exponencial e quebram a simetria do tempo,\" disse Boekholt.\n\n\"Portanto, não poder voltar no tempo não é mais apenas um argumento estatístico. Ele já está oculto nas leis básicas da natureza. Nem um único sistema de três objetos em movimento, grandes ou pequenos, planetas ou buracos negros, pode escapar da direção do tempo,\" acrescentou Zwart.\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmTBgSi1FbjZobTEhKC9QzrfMD7MSMfCWDcMWShTfPbJ8U\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=voce-nao-vai-poder-voltar-no-tempo&id=010130200327",
				"added": 1590978188
			},
			{
				"comment_id": 27,
				"body": "> [kieroche](#comment_26_166bg3kY3NQeuDm3zbQmYab6RwJGcw53Nr): Desculpe, mas você não vai poder voltar no tempo\n> Simetria do tempo\n> Se três ou mais objetos se movimentarem, sejam átomos ou planetas, a história não poderá ser revertida.\n> Esta é a conclusão de uma equipe internacional de pesquisadores com base em simulações de computador de três buracos negros em uma complexa órbita trinária, contestando outros físicos que garantem que a viagem no tempo é possível.\n> A maioria das leis básicas da física não tem problemas com a direção do tempo - elas não tem problemas em ir do passado para o futuro, mas também não se importam de voltarem do futuro rumo ao passado. Elas são, como os cientistas as chamam, simétricas em relação ao tempo ou simétricas no tempo.\n> Na prática, no entanto, todo mundo sabe que o tempo não pode simplesmente correr para trás. Por exemplo, um copo que cai em cem pedaços realmente não voa de volta para sua mão espontaneamente e sem danos. Até agora, os cientistas explicaram a falta de simetria do tempo em escala macro pela interação estatística entre um grande número de partículas.\n> Agora, três astrônomos mostraram que apenas três partículas são suficientes para quebrar a simetria do tempo e estabelecer uma via de mão única para a seta do tempo.\n> Órbitas de buracos negros\n> Tjarda Boekholt (Universidade de Coimbra, Portugal), Simon Portegies Zwart (Universidade de Leiden, Países Baixos) e Mauri Valtonen (Universidade de Turku, Finlândia) calcularam as órbitas de três buracos negros que se influenciam mutuamente.\n> Isso foi feito em duas simulações. Na primeira, os buracos negros partem do repouso. Então eles se movem um em direção ao outro e passam um pelo outro em órbitas complicadas. Finalmente, um buraco negro deixa a companhia dos outros dois. A segunda simulação começa com a situação final de dois buracos negros e o terceiro buraco negro que escapou tenta fazer o tempo retroceder para a situação inicial.\n> Acontece que o tempo não pode ser revertido em 5% dos cálculos, mesmo que o computador use mais de cem casas decimais. Os últimos 5% não são, portanto, uma questão de melhores computadores ou métodos de cálculo mais inteligentes, como se pensava anteriormente.\n> Comprimento de Planck\n> Os pesquisadores explicam a irreversibilidade do tempo usando o conceito de comprimento de Planck, a distância em que os efeitos quânticos se tornam significativos. É um princípio conhecido na física que se aplica a fenômenos no nível atômico e menores, e vale 1,6 x 10-35 metro.\n> \"O movimento dos três buracos negros pode ser tão caótico que algo tão pequeno quanto o comprimento de Planck influenciará os movimentos. Os distúrbios do tamanho do comprimento de Planck têm um efeito exponencial e quebram a simetria do tempo,\" disse Boekholt.\n> \"Portanto, não poder voltar no tempo não é mais apenas um argumento estatístico. Ele já está oculto nas leis básicas da natureza. Nem um único sistema de três objetos em movimento, grandes ou pequenos, planetas ou buracos negros, pode escapar da direção do tempo,\" acrescentou Zwart.\n> Artigo: https://gateway.pinata.cloud/ipfs/QmTBgSi1FbjZobTEhKC9QzrfMD7MSMfCWDcMWShTfPbJ8U\n> \n> Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=voce-nao-vai-poder-voltar-no-tempo&id=010130200327\n\n#Duas simulações em computador de três buracos negros que se influenciam (Boekholt et al., No MNRAS 2020)\nhttps://gateway.pinata.cloud/ipfs/QmaKrtorhwueDUmHgeaKwzcdwcGk67977TzY6NoPWmqTKw",
				"added": 1590978336
			},
			{
				"comment_id": 28,
				"body": "#Aceleração da expansão do Universo pode dispensar energia escura\n\n#Dúvidas sobre o lado escuro do Universo\n\nEmbora seja largamente aceita na comunidade científica, a ideia de que o Universo está se expandindo, e de que essa expansão está se acelerando, tem sido objeto de dúvida por parte de um número crescente de pesquisadores.\n\nA questão fundamental é: O que impulsiona a expansão e a aceleração da expansão do Universo?\n\nO modelo padrão chama essas \"causas\" de matéria escura e energia escura, mas todas as tentativas de detectar sinais de ambas falharam até agora.\n\nUm trio de físicos da Universidade da Colúmbia Britânica, no Canadá, acaba de oferecer uma nova abordagem que talvez possa livrar os cientistas da necessidade de explicar esse cada vez mais incômodo \"lado escuro\" do Universo.\n\n#Espaço flutuante\n\nA equipe abordou a questão da expansão do Universo encarando de frente uma incompatibilidade entre duas das mais bem-sucedidas teorias que explicam o funcionamento do nosso universo: a mecânica quântica, nas dimensões microscópicas, e a teoria da relatividade geral de Einstein, nas dimensões cósmicas.\n\nOs resultados sugerem que, se déssemos um zoom poderoso o suficiente no Universo, perceberíamos que ele é composto por um espaço e um tempo que \"flutuam\" constantemente - o espaço-tempo se espicha e encolhe o tempo todo.\n\n\"O espaço-tempo não é tão estático quanto parece, ele está constantemente em movimento,\" explicou Qingdi Wang.\n\n\"Esta é uma nova ideia em um campo onde não tem havido muitas novas ideias para tentar abordar esta questão\", acrescentou seu colega Bill Unruh.\n\n#Energia do vácuo\n\nQuando os dados começaram a indicar que o Universo está em uma expansão acelerada - isto foi em 1998 - os astrônomos e físicos sugeriram que o espaço não é vazio, em vez disso estando repleto de uma energia que empurra a matéria - a famosa energia escura.\n\nO candidato mais natural para compor a energia escura é a [energia do vácuo](https://web.archive.org/web/20200421233247/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=confirmado--a-materia-e-resultado-de-flutuacoes-do-vacuo-quantico&id=010130081125). Contudo, quando os físicos aplicam a teoria da mecânica quântica à energia do vácuo, ela prevê que a energia de vácuo tem uma densidade incrivelmente elevada, muito mais do que a energia total de todas as partículas de matéria no Universo. Se isso for verdade, a teoria da relatividade geral sugere que essa energia do vácuo teria um efeito gravitacional descomunal - a maioria dos físicos acredita que os resultados indicam que o Universo deveria simplesmente explodir, e não meramente acelerar.\n\nFelizmente isso não acontece, e o Universo parece se expandir bem devagar. Logo, a teoria não está completa, e há um problema que deve ser resolvido para a física fundamental progredir.\n\n#Expansão líquida\n\nAo contrário das tentativas anteriores, que se concentraram em modificar as teorias da mecânica quântica ou da relatividade geral para resolver a questão, Wang e seus colegas sugerem uma abordagem diferente. Eles levaram a enorme densidade de energia do vácuo prevista pela mecânica quântica a sério e acreditam ter descoberto informações importantes sobre a energia de vácuo que não foram levadas em consideração nos cálculos anteriores.\n\nOs novos resultados fornecem uma imagem física completamente diferente do Universo.\n\nNesta nova imagem, o espaço em que vivemos está flutuando - e flutuando para valer. Em cada ponto, ele oscila entre expansão e contração. À medida que balança para frente e para trás, os dois movimentos quase se cancelam, mas um efeito líquido muito pequeno leva o Universo a se expandir lentamente a uma taxa acelerada.\n\nMas se o espaço e o tempo estão flutuando, por que não podemos sentir isso?\n\n\"Isso acontece em escalas muito pequenas, bilhões e bilhões de vezes menores do que um elétron,\" justifica Wang.\n\n\"É semelhante às ondas que vemos no oceano. Elas não são afetadas pela dança intensa dos átomos individuais que compõem a água em que essas ondas se movimentam,\" disse o professor Unruh.\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmQUZ9dz4urUFuRQAQmx2KaGCiLxsabh37eB5MP9ZwZc18\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=aceleracao-expansao-universo-dispensar-energia-escura&id=010130170918",
				"added": 1590978683
			},
			{
				"comment_id": 29,
				"body": "#A matemática da eternidade prova que o universo deve ter tido um começo\n\nO Big Bang tornou-se parte da cultura popular desde que a frase foi cunhada pelo físico independente Fred Hoyle na década de 1940. Isso não é surpreendente para um evento que representa o nascimento final de tudo.\n\nNo entanto, Hoyle preferia um modelo diferente do cosmos: um universo de estado estacionário sem começo nem fim, que se estende infinitamente ao passado e ao futuro. Essa ideia nunca decolou realmente.\n\nNos últimos anos, no entanto, os cosmólogos começaram a estudar uma série de novas idéias que têm propriedades semelhantes. Curiosamente, essas idéias não estão necessariamente em desacordo com a noção de Big Bang.\n\nPor exemplo, uma ideia é que o universo é cíclico com big bangs seguido de big crunches seguidos por big bangs em um ciclo infinito.\n\nOutra é a noção de inflação eterna, na qual diferentes partes do universo se expandem e se contraem a taxas diferentes. Essas regiões podem ser pensadas como universos diferentes em um multiverso gigante.\n\nPortanto, embora pareçamos viver em um cosmos inflável, outros universos podem ser muito diferentes. E embora nosso universo pareça ter um começo, o multiverso não precisa ter um começo.\n\nDepois, há a idéia de um universo emergente que existe como uma espécie de semente para a eternidade e, de repente, se expande.\n\nPortanto, essas cosmologias modernas sugerem que a evidência observacional de um universo em expansão é consistente com um cosmos sem começo ou fim. Isso pode estar definido para mudar.\n\nHoje, Audrey Mithani e Alexander Vilenkin, da Universidade Tufts, em Massachusetts, dizem que esses modelos são matematicamente incompatíveis com um passado eterno. De fato, suas análises sugerem que esses três modelos do universo devem ter tido um começo também.\n\nO argumento deles se concentra nas propriedades matemáticas da eternidade - um universo sem começo e sem fim. Tal universo deve conter trajetórias que se estendem infinitamente ao passado.\n\nNo entanto, Mithani e Vilenkin apontam para uma prova datada de 2003 de que esse tipo de trajetória passada não pode ser infinita se fizer parte de um universo que se expande de uma maneira específica.\n\nEles continuam mostrando que os universos cíclicos e os universos da inflação eterna se expandem dessa maneira. Portanto, eles não podem ser eternos no passado e, portanto, devem ter tido um começo. \"Embora a inflação possa ser eterna no futuro, ela não pode ser estendida indefinidamente ao passado\", dizem eles.\n\nEles tratam o modelo emergente do universo de maneira diferente, mostrando que, embora possa parecer estável do ponto de vista clássico, é instável do ponto de vista da mecânica quântica. \"Um modelo simples de universo emergente ... não pode escapar do colapso quântico\", dizem eles.\n\nA conclusão é inevitável. “Nenhum desses cenários pode ser eternamente passado”, dizem Mithani e Vilenkin.\n\nComo a evidência observacional é de que nosso universo está se expandindo, também deve ter nascido no passado. Uma conclusão profunda (embora a mesma que levou à idéia do big bang em primeiro lugar).\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmQHagfUN8hZcWAanAWZHstPk3szkwDMmr5tQgh3QMaatB\n\n- Fonte: https://www.technologyreview.com/2012/04/24/186577/mathematics-of-eternity-prove-the-universe-must-have-had-a-beginning/",
				"added": 1590979337
			},
			{
				"comment_id": 32,
				"body": "#Físicos propõem teoria para se livrar da Energia Escura\n\n#Adeus à Energia Escura?\n\nA teoria da Energia Escura, que explicaria a aceleração da expansão do Universo, tem visto seu número de seguidores cair drasticamente.\n\nA queda de popularidade não vem por acaso: Todas as tentativas de encontrar qualquer fundamento na realidade para a Energia Escura falharam até agora.\n\nAté quase o final do século passado, os cientistas consideravam que o espaço seria preenchido com matéria comum - estrelas, planetas, asteroides, cometas e gás intergaláctico altamente rarefeito. Mas, se é assim, a expansão acelerada é contrária à lei da gravidade, que diz que os corpos são atraídos uns pelos outros. As forças gravitacionais tendem a desacelerar a expansão do Universo, mas não podem acelerá-lo.\n\nMas então os telescópios melhoraram e as medições começaram a indicar que estrelas e galáxias muito distantes estariam se afastando de nós a uma velocidade cada vez mais rápida - isto é, que a expansão do Universo estaria se acelerando.\n\n\"E então nasceu a ideia de que o Universo é preenchido na maior parte não com matéria comum, mas com uma espécie de 'Energia Escura', que possui propriedades especiais. Ninguém sabe o que ela é e como funciona, então ela foi batizada 'Energia Escura,' como algo desconhecido. E 70% do Universo consiste nessa energia,\" contextualiza o professor Artyom Astashenok, da Universidade Immanuel Kant, na Rússia.\n\nComo os resultados observacionais para fundamentar essa teoria não aparecem, Astashenok e seu colega Alexander Tepliakov foram buscar explicações para a aceleração da expansão do Universo que possam funcionar sem precisar apelar para a Energia Escura ou qualquer outra entidade desconhecida.\n\nE eles encontraram algo que faz sentido, bastando que se acrescente uma ideia que também não é totalmente estranha aos físicos: a proposta de que o Universo tem \"bordas\".\n\n#Fronteiras do Universo\n\nEm seu artigo, a dupla apresenta um modelo matematicamente sólido do Universo no qual há uma repulsão adicional capaz de explicar a aceleração da expansão, e no qual não há uma contradição entre o fato de que a expansão do Universo está acelerando e a lei da gravitação universal.\n\nQuem explica a nova teoria é o próprio professor Astashenok.\n\n\"O chamado efeito Casimir (em homenagem ao físico holandês Hendrik Casimir), que consiste no fato de que duas placas de metal colocadas no vácuo são atraídas uma pela outra, é conhecido há muito tempo. Parece que ele não pode existir, porque não há nada no vácuo, mas, de fato, de acordo com a teoria quântica, as partículas constantemente aparecem e desaparecem ali, e, como resultado de sua interação com as placas, que indicam certos limites do espaço (o que é extremamente importante), ocorre uma atração muito pequena.\n\n\"E existe uma ideia correspondente a isso, a de que aproximadamente a mesma coisa acontece no espaço. Somente isso leva, pelo contrário, a uma repulsão adicional, que acelera a expansão do Universo. Ou seja, não existe essencialmente 'energia escura', mas há uma manifestação dos limites do Universo. Isso, obviamente, não significa que ele termina em algum lugar, mas que pode haver algum tipo de topologia complexa.\n\n\"Você pode fazer uma analogia com a Terra. Afinal, ela também não tem bordas, mas é finita. A diferença entre a Terra e o Universo é que, no primeiro caso, estamos lidando com o espaço bidimensional, e, no segundo, com o espaço tridimensional,\" finalizou.\n\nEsta não é a primeira vez que se tenta criar uma forma de [dispensar a energia escura](https://web.archive.org/web/20190914155402/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=aceleracao-expansao-universo-dispensar-energia-escura&id=010130170918), e provavelmente não será a última.\n\nAfinal, toda uma geração de cientistas se formou com essa teoria, a comunidade científica deu-lhe a mais alta honraria - o [Nobel de Física](https://web.archive.org/web/20171208162125/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=nobel-fisica-aceleracao-expansao-universo&id=020175111004) - e projetos milionários estão em andamento, o que significa que nem todos estão dispostos a abandonar a ideia de encontrar indícios da tão famosa energia desconhecida.\n\n#Artigo: https://ipfs.infura.io/ipfs/QmVso2cjVUPcG38RWScouAusLNQzRgDJf1mikM9xoyFMnV\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=fisicos-propoem-teoria-se-livrar-energia-escura&id=010130200211",
				"added": 1590982327
			},
			{
				"comment_id": 33,
				"body": "#Hipótese de Riemann e física\nhttps://ipfs.infura.io/ipfs/QmVSQZFDyyaW3yoJUtibbvQJsyStAXhT3fkqFgcLZUWkZx",
				"added": 1590983061
			},
			{
				"comment_id": 36,
				"body": "#Crise cosmológica: Não sabemos se o Universo é plano ou esférico\n\n#Teoria do Universo Plano\n\nSe lhe parece difícil de acreditar que ainda existam pessoas que afirmam que a Terra é plana, talvez também possa lhe causar algum espanto o fato de que toda a teoria científica atual, expressa no famoso modelo do Big Bang, propõe que o [Universo é plano](https://web.archive.org/web/20170619063340/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=a-terra-redonda-mas-universo-plano&id=010130090722).\n\nNão se trata de algo filosófico, mas da matemática hoje disponível para descrever o que aconteceu logo após a grande explosão que teria dado origem ao Universo - e, convenhamos, modelar o início do Universo inteiro não é tarefa pequena, de forma que a matemática usada é extremamente simplificada.\n\nMas também não é só teoria: Virtualmente todos os dados cosmológicos coletados até hoje se enquadram nessa ideia de que o Universo é plano, o que significa que ele não teria curvatura, semelhante a uma folha de papel.\n\nÉ claro que existem os descontentes com a \"Teoria do Universo Plano\" - sem contar os proponentes do [Universo Holográfico](https://web.archive.org/web/20171105143444/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=teoria-universo-holografico-teoria-inflacao-cosmica&id=010130170131).\n\nE um trio deles acaba de apresentar dados observacionais que mostram um Universo esférico, ou fechado. Em outras palavras, assim como no modelo cosmológico padrão, aceito pela comunidade científica, se você sair com uma nave espacial em qualquer direção irá viajar para sempre, no modelo do universo fechado sua viagem sempre lhe trará de volta ao seu ponto de partida.\n\n#Dados das lentes gravitacionais\n\nEleonora Di Valentino e seus colegas usaram dados do telescópio espacial Planck, que operou de 2009 a 2013 mapeando o fundo cósmico de micro-ondas, um mar de luz primordial que restou do Big Bang.\n\nUm conjunto de observações mostra que há mais lentes gravitacionais - um alongamento da luz devido à forma do espaço-tempo, que pode ser distorcido pela matéria - do que o esperado. E esses dados podem ser explicados se a forma do Universo for diferente do que pensávamos.\n\nO efeito extra de lente gravitacional implica a presença de mais matéria escura do que o proposto pelo modelo atual, o que levaria o Universo a uma esfera finita, em vez de uma folha plana infinita.\n\nSegundo essas observações, o Universo tem 41 vezes mais chances de ser fechado do que plano. \"Esses são os dados cosmológicos mais precisos e estão nos dando uma imagem diferente,\" disse Alessandro Melchiorri, da Sapienza Universidade de Roma.\n\n#Crise cosmológica\n\nSe o Universo for realmente fechado, isso se torna um grande problema para a nossa compreensão do cosmos.\n\nPor exemplo, outro enigma cosmológico é que nossas imediações cósmicas parecem estar se expandindo mais rápido do que deveriam, algo que é difícil de explicar com nosso modelo padrão de cosmologia, que inclui um universo plano, e a equipe calculou que isso fica ainda mais difícil com um universo esférico, juntamente com algumas outras incompatibilidades cósmicas que ainda carecem de explicação.\n\nÉ tão ruim que o trio afirma que seus dados desencadearam uma \"crise cosmológica\".\n\n\"Em um universo fechado, essas anomalias são mais graves do que pensávamos,\" disse Melchiorri. \"Se nada estiver de acordo, temos que pensar muito sobre o nosso modelo do universo e sua formação\".\n\nA explicação usual da formação do Universo inclui um período logo após o Big Bang, chamado inflação, quando o Universo se expandiu rapidamente. Nossos modelos atuais de inflação levam a um universo plano; portanto, se o nosso Universo for realmente fechado, esses modelos terão que ser mudados.\n\n\"Nós precisamos de um novo modelo e ainda não sabemos como ele é,\" disse Melchiorri. Ninguém encontrou uma maneira de conciliar essas observações do telescópio Planck com as muitas medidas cosmológicas discordantes, algumas das quais incluem até mesmo outras observações do próprio observatório Planck.\n\nExiste a hipótese de que os novos dados sejam apenas uma flutuação estatística, mas os dados do observatório WMAP, que também mapeou a radiação cósmica de fundo, já foram igualmente interpretados de forma a mostrar um Universo esférico.\n\nAssim, vamos ter que esperar por mais dados. O Observatório Simons, atualmente em construção no Chile, poderá medir as lentes gravitacionais de maneira ainda mais precisa do que o telescópio Planck, e deverá nos dizer se realmente existe uma crise de magnitude cósmica em nossas teorias cosmológicas.\n\n#Artigo: https://gateway.pinata.cloud/ipfs/QmNuHehMAvmsBgaQPAuM1v9tWVeDWurp5DYbUPuN8PcUX9\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=crise-cosmologica-nao-sabemos-se-universo-plano-ou-esferico&id=010130191108",
				"added": 1590984426
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 30,
				"body": "\"Qual a primeira obrigação daquele que quer adquirir a sabedoria? Abandonar a presunção. Pois é impossível começar a aprender aquilo que se pensa já conhecer\" (Epictetus, Discursos, livro 2, cap. Derreter17).",
				"added": 1590979481
			},
			{
				"comment_id": 31,
				"body": "Como John Lennox citou Chomsky, o perigo hoje é que as pessoas que se dizem \"buscar por evidências\" são pessoas que não analisam as evidências a favor da concepção de outras pessoas.",
				"added": 1590979504
			}
		],
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 35,
				"body": "#O que pode tornar a inteligência artificial realmente inteligente?\n\n#Estupidez automatizada\n\nApesar das muitas [preocupações com a inteligência artificial](https://web.archive.org/web/20191116232432/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=inteligencia-artificial-precisa-inteligencia-social-nao-ferir-humanos&id=010150190903) e seu crescente papel na sociedade, o fato é que a geração atual de programas de [inteligência artificial não é nem um pouco inteligente](https://web.archive.org/web/20200224102538/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=a-inteligencia-artificial-e-mesmo-inteligente&id=010150190412).\n\nExistem basicamente dois tipos de aprendizado de máquina: as redes neurais profundas, as responsáveis pelo famoso \"aprendizado profundo\", e as redes de aprendizado por reforço. Ambos são baseados no treinamento do sistema, usando quantidades enormes de dados, para executar uma tarefa específica, por exemplo tomar uma decisão.\n\nDurante o treinamento, o resultado desejado é fornecido juntamente com a tarefa. Com o tempo, o programa aprende a resolver a tarefa com precisão cada vez mais rápida, embora ninguém entenda exatamente como o programa funciona - é a chamada [\"caixa preta\" da inteligência artificial](https://web.archive.org/web/20191116232432/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=como-inteligencia-artificial-funciona-nao-sabemos&id=010150181019).\n\n\"O problema com esses processos de aprendizado de máquina é que eles são basicamente completamente burros,\" comenta o professor Laurenz Wiskott, da Universidade Ruhr, na Alemanha. \"As técnicas subjacentes datam da década de 1980. A única razão para o sucesso atual é que hoje temos mais capacidade de computação e mais dados à nossa disposição\".\n\nMas a equipe do professor Wiskott é uma das que estão tentando eliminar a estupidez da inteligência artificial e torná-la realmente esperta.\n\n#Inteligência artificial não supervisionada\n\nHoje, a inteligência artificial pode ser superior aos humanos especificamente na única tarefa para a qual cada programa foi treinado - ela não consegue generalizar ou transferir seu conhecimento nem mesmo para tarefas similares.\n\n\"O que queremos saber é: como podemos evitar todo esse treinamento absurdo e longo? E acima de tudo: como podemos tornar o aprendizado de máquina mais flexível?\" disse Wiskott.\n\nA estratégia consiste em ajudar as máquinas a descobrir estruturas nos dados de forma autônoma. As tarefas podem incluir, por exemplo, a formação de categorias ou a detecção de alterações graduais em vídeos. A ideia é que esse aprendizado não supervisionado permita que os computadores explorem o mundo autonomamente e realizem tarefas para as quais não foram treinados em detalhes.\n\n\"Uma tarefa pode ser, por exemplo, formar agrupamentos,\" explica Wiskott. Para isso, o computador é instruído a agrupar dados semelhantes, em busca, por exemplo, de um rosto em uma foto. Transformando os píxeis em pontos em um espaço tridimensional, isso significa agrupar pontos cujas coordenadas estão próximas umas das outras. Se a distância entre as coordenadas for maior, elas serão alocadas para diferentes grupos. Isso dispensa a enormidade de fotos e suas descrições, como é usado hoje.\n\nEsse método oferece mais flexibilidade porque essa formação de aglomerados é aplicável não apenas a fotos de pessoas, mas também a carros, plantas, casas ou outros objetos.\n\n#Princípio da lentidão\n\nOutra abordagem adotada pela equipe é o princípio da lentidão. Neste caso, não são as fotos que constituem o sinal de entrada, mas imagens em movimento: Se todas as características que mudam muito lentamente são extraídas de um vídeo, surgem estruturas que ajudam a construir uma representação abstrata do ambiente. \"Aqui, também, o objetivo é pré-estruturar os dados de entrada,\" destaca Wiskott.\n\nEventualmente, os pesquisadores combinam as duas abordagens de maneira modular com os métodos de aprendizado supervisionado, a fim de criar aplicativos mais flexíveis e, no entanto, muito mais precisos.\n\n\"Maior flexibilidade naturalmente resulta em perda de desempenho,\" admite o pesquisador. \"Mas, a longo prazo, a flexibilidade é indispensável se quisermos desenvolver robôs capazes de lidar com situações novas.\"\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=tornar-inteligencia-artificial-realmente-inteligente&id=010150191114",
				"added": 1590983951
			}
		]
	},
	"comment_vote": {
		"9_166bg3kY3NQeuDm3zbQmYab6RwJGcw53Nr": 1
	}
}