{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Chat francophone",
			"body": "Salut les gens !\nPour compléter le Forum j'ai eu l'idée de cloner un chat pour les francophones.\nÇa sera plus facile et moins dérangeant que sur le chat global où chacun parle dans n'importe quelle langue ^^.\n\nVous le trouverez à cette adresse:\nhttp://127.0.0.1:43110/fr.0rc.bit\n\nHave fun !",
			"added": 1456925068
		},
		{
			"topic_id": 2,
			"title": "Astuces ZeroNet",
			"body": "Partagez ici vos trucs et astuces pour utiliser le ZeroNet.\n\n###Voir le nombre de peer connectés à un site, leur provenance, et diverses statistiques sur la taille du site\nPour cela il vous suffit de tirer le logo à droite (le rond avec le 0 dedans) vers la gauche\n\n###Cloner un site\nPour cloner un site et ouvrir votre propre forum/chat/blog, vous avez juste à aller sur la page ZeroHello (page d'accueil de ZeroNet).\nDans la liste des sites repérez:\n- ZeroChat (fonctionne avec le FR)\n- ZeroTalk (idem)\n- ZeroBlog\nPuis faites un clic droit sur les 3 points à droite de leur nom, vous y trouverez l'option \"cloner\"\n\n###Voir les enregistrements de connexion\nPour voir les enregistrements de connexion, avec votre ip, connexions entrantes et sortantes touça touça (enfin... j'en sais rien mais ça en a l'air ^^) il vous suffit d'aller sur \nhttp://127.0.0.1:43110/Stats\n\n###Trouver des sites du ZeroNet\nPour trouver des sites sur le ZeroNet, vous pouvez passer par ces pages:\nhttp://zero.pags.to:43110/1NNrpHSsucpLxE2MkRj8GPX1Rh1anJfw8h - Sous forme de panneaux\nhttp://127.0.0.1:43110/0list.bit - Sites proposés par les utilisateurs\nhttp://127.0.0.1:43110/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F - Liste de sites utilisant le namecoin (domaine en .bit)\n",
			"added": 1457028594
		},
		{
			"topic_id": 3,
			"title": "Corriger l'erreur \"Content sign failed: invalid private key\" sur le tchat",
			"body": "Salut les gens !\nAngristan a trouvé une solution pour vous débarrasser de cette erreur quand elle se présente.\nA savoir que lorsque vous l'avez, vous continuez à voir vos messages dans le tchat mais ils ne sont pas transmis.\n\nPour corriger l'erreur il vous suffit:\n1 - D'ouvrir le tchat et d'ouvrir le panneau à droite en tirant l'icône avec le 0 vers la gauche\n2 - De repérer votre identité sur le site. c'est la case juste en dessous de \"Identity address\"\n3 - Aller dans le dossier /data/1KzDGFWuVgniDVaKBdS1cY91FZBQeKbZMn/data/users de votre dossier zeronet\n4 - Supprimer le dossier qui correspond à votre identité\n\nEt voila ça fonctionne à nouveau !\nUn grand merci à angristan pour avoir trouvé cette astuce !",
			"added": 1457303819
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1_1C5FkFSP767q8TLNBLQvgCfsfWMviZ7evG": [
			{
				"comment_id": 1,
				"body": "A priori il n'y en a pas trop, ça a l'air sécurisé, les services sont \"anonymes\" (pas d'adresse email ou de nom demandé, juste un pseudo), on peut se connecter via TOR... \nAprés je sais pas trop si le fait de partager les sites des autres est totalement safe... on sait pas quelle merde on récupère avant de l'avoir installé et exécuté... même en sandbox... who knows...\nSinon c'est vrai que c'est impressionnant, le clonage de sites, la façon dont tout est disponible c'est plutôt cool\n",
				"added": 1456924880
			},
			{
				"comment_id": 3,
				"body": "> [wyfiwyg](#comment_1_1FwaYZBCRaS8pHvAsEop1E4ZoA63ko9Up6): La faille, si on peut parler de faille, mais plutôt de faiblesse, ou de talon d'achille, c'est le micro-SGBD mal distribué avec une montée en charge du volume de données... En discussion ici : https://tech.korben.info/t/play-le-site-de-torrents-quon-ne-peut-pas-bloquer/2842/4Mais bon, c'est de l'alpha.... en espérant que les sales cochons n'envahissent pas trop le modèle avant qu'il ne soit réellement exploitable à grande échelle.... enfin, c'est ce qu'il faut souhaiter.... ce genre d'architecture est dans l'air du temps, ça ne se fera pas en un jour, mais c'est cool, ça avance. :-)\n\nComme c'est dit dans la discussion, c'est pour ça qu'ils ont mis des sites de tests comme les gifs qui se DL seulement quand il y a besoin ou des trucs comme les fichiers optionnels, ça évite d'avoir à télécharger la totalité du site.\nPour ce qui est des bases de données, le souci restera, à moins de faire du nettoyage automatique de vieux contenus pour alléger ou des bdd \"partielles - partagées\" mais ça doit être chaud et long à mettre en place, sans parler des soucis d'intégrité (si tout une \"tranche\" de bdd est indisponible par manque de gens c'est chaud, même si le cas doit être rare)\n\nLes gros cochons / hackers / troll doivent venir, c'est justement eux qui permettront de sécuriser/améliorer/modérer tout le système, malheureusement... Ce qu'il faut espérer en revanche c'est que les devs de Zeronet ont les épaules, le courage et le soutien pour ne pas abandonner.",
				"added": 1456994800
			},
			{
				"comment_id": 4,
				"body": "> [alexkid](#comment_1_1DCFD2mkxjbVaQ5wKmVv9sVcUd1wNLuVJC): Salut à tous,Ce système à l'air pas mal, peut on le comparer à freenet en sois?\n\nJamais testé freenet, mais sur le papier ça a l'air a peu prés pareil en moins crypté non?\n",
				"added": 1457020549
			},
			{
				"comment_id": 7,
				"body": "> [angristan](#comment_10_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7): TOR te fait passer par 2 proxies chiffrés. Donc oui, ton IP n'est pas rendue publique.Après à toi de voir... Est-ce vraiment lent ? ^^\n\n3 proxies ^^ 2 + un noeud de sortie (c'est pour le coup du cryptage ;) )\nPar contre je le trouve moins lent que le navigateur tor \"normal\"",
				"added": 1457129181
			}
		],
		"1_15xAFv6aHXqo5xdaSoTEi5pRNokskECJXU": [
			{
				"comment_id": 2,
				"body": "Oui, mais il faut bien un début :(\nil faut rallier du monde, je pense qu'il y a moyen d'avoir une bonne communauté ici.\n",
				"added": 1456959152
			},
			{
				"comment_id": 8,
				"body": "Salut alexandre, bienvenue parmi nous ^^\n",
				"added": 1457471217
			}
		],
		"1_13BzgJmtcuzGKxYkMxgEs9Y27BacFh79Hu": [
			{
				"comment_id": 5,
				"body": "je dis surement une connerie, mais il faut pas que tu installes tor à part avant de décommenter? \n==> https://zeronet.readthedocs.org/en/latest/faq/#how-to-use-zeronet-with-tor \n==> https://www.torproject.org/docs/tor-doc-osx.html.en",
				"added": 1457020787
			}
		],
		"1_1Nz3CsGw5hkJSvjNsSbcFQru4bkau8i3Rd": [
			{
				"comment_id": 6,
				"body": "Tor est activé sur certains sites par défaut, mais sur la page d'accueil tu peux cliquer sur Tor ==> Always tor mode. Tu redémarres zeronet (via l'icone de la zone de notification, pas juste relancer ton navigateur) et il se connecte full TOR",
				"added": 1457129097
			}
		],
		"1_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": [
			{
				"comment_id": 9,
				"body": "Allez soyons foufous\n\nHe's a real nowhere man\nSitting in his nowhere land\nMaking all his nowhere plans for nobody\n( http://www.tagtele.com/videos/voir/56058/ )\n\nMosellan avec beaucoup (trop) de temps libre...\nComme les 2 autres personnes avant moi j'aime beaucoup (beaucoup beaucoup..) les jeux-vidéos, mais aussi le Fais Y Toi-même (Do It Yourself) avec Arduino et Raspberry Pi et tous les concepts de (licence) libre et de partage, autant logiciel que matériel ou dans la vie de tous les jours.\nNiveau films et séries, je suis un grand consommateur de tripailles et de ketchup sur les murs, avec une petite préférence pour les films japonais/coréens/chinois surjoués à l’excès, le soir avec une paire de brunes ou de blondes (des bières hein ^^) ça passe bien.\nPour la musique, j'ai été bercé dans le rock des années 60-70 très tôt donc ça laisse des séquelles, mais mes groupes préférés se situent plus du côté indus allemand, Rammstein, Oomph, (Knorkator même si c'est pas trop indus du tout)... sans oublier les classiques Metallica, Maiden, Manson, in flaMes... Niveau scène française c'est plus restreint, j'aime bien Ange, Thiéfaine, les Wampas, Les amis de ta femme, Matmatah, Téléphone etc... mais je serais loin d'aller par exemple payer une place de concert...",
				"added": 1457533447
			}
		],
		"1_1BD2gcuNdDkkUHmdpx8ziVbBxbyqCGbWmq": [
			{
				"comment_id": 10,
				"body": "Quand tu fais des changements tu n'as pas besoin d'utiliser de commandes.\n\nen 'local\" (si les modifs s'appliquent qu'à toi), quand tu actualises la page ça s'applique (il y a un genre de cache donc ça peut prendre du temps pour les images / JS)\nen \"distant\" (pour afficher les modifs sur un autre pc ou pour quelqu'un d'autre) tu déploies le menu de droite (le disque avec le 0) et tout en bas tu as \"sign\" et \"publish\" quand tu es le proprio de la page (actualise aprés).\n\n",
				"added": 1457601164
			}
		],
		"3_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 11,
				"body": "<b> test </b>",
				"added": 1457872458
			},
			{
				"comment_id": 12,
				"body": "> [nowhereman](#comment_11_15xAFv6aHXqo5xdaSoTEi5pRNokskECJXU): <b> test </b>\n\nah bin non le html est pas activé XD",
				"added": 1457872485
			},
			{
				"comment_id": 13,
				"body": "> [angristan](#comment_27_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7): C'est en markdown test test\ndonc...\n![imagetest](http://www.ilovegenerator.com/large/prout-love-prout-130849062831.png)",
				"added": 1457893798
			},
			{
				"comment_id": 14,
				"body": "![imagetest](http://www.ilovegenerator.com/large/prout-love-prout-130849062831.png)",
				"added": 1457893823
			},
			{
				"comment_id": 15,
				"body": "bah non...",
				"added": 1457893831
			}
		],
		"1_1KbaV4qD9rF6rXuT2aenytf2jhhD8UWqSR": [
			{
				"comment_id": 16,
				"body": "Internet c'est pas que p0rn et t0rrents hein... ;)",
				"added": 1458040385
			}
		]
	},
	"comment_vote": {}
}