{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "SunHub是官方的第一个hub",
			"body": "MoonHub是后来出的",
			"added": 1569151499,
			"parent_topic_uri": "8_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "目前手机网络不稳定的情况下，打开网站费劲",
			"body": "却能流畅的使用ZeroNet",
			"added": 1569151618,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "善用ZeroNet首页的收藏功能",
			"body": "",
			"added": 1569204025,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "湿哥聊了不少人，发现撸管的的确确有可能造成这两种问题：",
			"body": "1、撸管时无意中养成了快速射精的习惯，男人都知道，高潮射精那一刻最爽。撸管只要自己爽就行了，没人在乎持久不持久。好几个人告诉我，平常撸管喜欢快速用力去撸，这样很快就能射精，很快就能高潮，结果无意中养成了这种速射的习惯。等到有性生活了，还是习惯性“快速用力-直接高潮”，当然也很快。这时开始怀疑自己是早泄，然后认为是撸管造成。湿哥辅导很多早泄男粉，这种习惯很普遍。\n2、还有一种情况比较常见，有的男性撸管时喜欢用力，JB也习惯了用力撸所带来的刺激强度，手的力度和女性下体大不相同，导致有人习惯了五姑娘的力度。等到真正啪啪啪的时候却发现，还没有撸管爽。所以提醒下喜欢撸管的朋友们，撸管不宜太用力。\n\n作者：湿在人为\n链接：https://www.zhihu.com/question/46601636/answer/668077959\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。",
			"added": 1569207006,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "那么我们先来说一说手淫对身体的危害",
			"body": "作者：老司机精选\n链接：https://www.zhihu.com/question/46601636/answer/368904291\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n1、性欲减退因为前列腺里有种东西叫卵磷脂小体，是蓄养精子的，前列腺充血增生或发生炎症，都会使卵磷脂小体减少，卵磷脂小体少了之后，精子也就会逐渐的减少，精子的质量和活跃度，都会下降。由于长期的手淫，频繁的刺激阴茎，使其不断的勃起，同时使射精中枢过度疲劳。长此以往，可能导致婚后啊，在正常的性刺激时阴茎勃起会感到无力，阴茎半软半硬的状态就会泄精，而且精子不是射出来而是流出来的。甚至出现阳痿、或者性交没有射精，从而导致不育。很多来找我咨询的人经检查都是这个问题。但是值得提出的是，手淫导致的阳痿，多半是属于心理因素，主要是由于长期的焦虑和犯罪感所致的。只要婚后及时改正这一不良行为，正确看待手淫，真正的丢掉精神包袱，适当的配以药物治疗，性功能是能够恢复正常的。\n2、慢性前列腺炎由于长期反复的手淫，使性器官经常处于性交兴奋的充血状态，引起前列腺及盆腔的慢性充血，久而久之，容易形成慢性前列腺炎症。并且长期手淫还会导致泌尿系统的感染，就比如说：尿道炎，包皮龟头炎等等，很多手淫的人都会有尿急，尿频，尿痛等表现！\n3、损耗血气西医里面可没有这么一说，西医只会说适当的手淫有助于身体健康。但是，中医来讲，精液是没有消耗完的血气在人体深度睡眠的时候转化为精液的，藏于肾中，封藏于骨内，以备不时之需。但是手淫导致血气消耗多，储蓄少，长此以往，入不敷出，就会有上面说的感觉身体被掏空。\n4、遗精过度的手淫会引起过度的大脑兴奋，过度的大脑兴奋又会导致大脑对射精异常敏感，在大脑控制力下降的情况下，轻微的性刺激都会导致射精。相信有长期手淫史的人一定有这种感觉，就是以前手淫很久才会射精，但是现在刚撸几下就会有射精的冲动，然后心里会非常害怕自己是不是会早泄。\n5、神经衰弱由于过度的性刺激和手淫带来的疑虑、悔恨等等，使大脑的中枢神经系统，长期处于一种性兴奋、性忧虑，以及体内疲惫的这样一个状态，因而导致兴奋与抑制的失调，大脑对机体的控制，以及对外界变化的适应能力下降。\n6、影响精神手淫对精神状态和注意力都是有很大影响的，很多人在上班或上课的时候会经常闪现出性幻想，即便是一个字一个词也会让其浮想联翩，严重影响了自己的集中力和记忆力，还会失眠多梦，损害精力，容易疲劳。经常手淫的人，记忆力会快速地衰退，以至于记性就像是80岁的老太太一样的模糊和转身既忘。理解能力和思维推理能力也会严重的衰退。现在很多年青人的记忆力真的还不如自己五六十岁的父母。\n7、青少年在发育期就开始手淫的话，就会造成身体发育的严重不良，发育的停滞和畸形。会出现身材矮小，身体瘦弱的状况。 男性朋友如果不加节制的手淫，频繁蹂躏自己的生殖器，还有可能造成阴茎静脉曲张和精索静脉曲张等，这都是有很多真实案例的。\n\n上面简单的说了一下对身体的伤害。除此之外手淫还会导致性格上的变化。长期习惯性手淫导致性格逐渐转变为内向，缺乏活力，孤僻，有社交恐惧，意志薄弱，优柔寡断，多疑恐惧，精神萎靡等等性格上的变化。　 再有就是，长期自慰的人往往自身的气场会很差， 气场是指一种潜在的魅力。打个简单比方：一个漂亮的女孩子，气场高的人即便相貌并不出众也会和姑娘轻松自如的交谈。而一个长期习惯性自慰的人，由于缺乏与漂亮姑娘接触的信心和勇气，在与别人接近时都会有一种不自然的感觉，交往过程中也会觉得尴尬。在社交场合中往往被边缘化。导致事业和爱情都不顺利，这一点只有经历过的人才会有深刻的感触。  \n\n很多人会担心自己“手淫过度”，那么究竟何为手淫过度呢?咱们大致可以从三个方面进行判断：\n一是心理状况，首先看是不是迷恋于手淫。如果经常想手淫，或每逢看到与性有关的小说、图片、视频都会引起性冲动，就会自慰，即使不每次自慰，也时时有自慰的欲念，都是手淫过度的表现; \n二是体质状况，凡是因手淫造成体质虚弱，如消瘦、乏力、精神萎靡、失眠、记忆力减退、注意力不集中，甚至容易生病等，都是手淫过度的表现。有些人虽然手淫次数不多，但心理素质不稳定。总是为手淫而恐惧、羞愧、悔恨、有犯罪感，甚至为今后的性功能和生育能力忧心忡忡，但又无法摆脱手淫快感的诱惑，这种强烈的内心矛盾，也是手淫过度的表现。\n三是，看手淫刺激的强度，如果诱发射精或性高潮的强度需要一次比一次增加，也是手淫过度的表现。另外，手淫时或手淫后生殖器局部出现隐痛、麻木、排尿不适以及女性外阴分泌物增多、下腹部隐痛等，这些都是手淫过度的表现。",
			"added": 1569207240,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"10_12hbwWu8G1L7uo3MiLnNLkU4Sj4ZtPKQU8": [
			{
				"comment_id": 1,
				"body": "我大学时有个同学，号称A片之王。不仅自己看，还在校园网设了个FTP叫“每日一毛”，也即每天发布新的毛片，一炮而红，成为校园中的红人。一般来说，毛片看到这种程度的，大多宅到不行。我同学也不例外。而且他不仅宅，至今根本没有碰过女人。照例来说，像这样虎狼年华的饥渴猥琐单身男青，按照大家的想象，应该是流着哈喇子的人中淫魔。但事实是，这位朋友外表斯斯文文，眼镜一架，一脸青年学者气息。现在的女孩子都主动得很，可这位老兄颇得柳下惠真传，老僧入定，心似枯骨。问到何以至此，他总是淡然一笑：“看多了，也就那么回事。”\n\n我在想，A片，又害了一位正常的男青年。当年没有A片可看的岁月里，男生们满脑邪念充盈，和女孩子多说两句话，大脑就自动调到成人频道。可是在这个网络色情泛滥的当今，曾经的淫男们离开了电脑，居然对生活中的女人没了想法，甚至没了性欲，这不能不成为信息时代人类异化的经典案例。\n\n何以至此？阈值使然。也就是不断地看A片，抬高了男人们欲望的触发点。在上个世纪初，女人旗袍坐下时偶尔可一瞥的白花花大腿就可以触发老夫子们的欲念；阿Q同学和小尼姑对话两句就能爽上三天。可是100年后，看着满屏的器官进出，很多人居然会叹上一句：没意思。这就是时代的变迁，使得阈值不断上升的最好例证，也是社会学家和性学家研究的极好课题。\n\n北欧和荷兰是世界上最开放的地区。你一个女孩子想露着奶满街跑没人管你，甚至都没啥人看你（很打击人吧）。阿姆斯特丹号称性都，想玩SM抽大麻统统合法。而这些地方恰恰是全世界性犯罪率最低的地区。而阿拉伯世界，女人唯一可以露出的地方是眼睛，阿拉伯男人有这世界上最强烈的性欲，甚至到了猥琐的程度，不信的话女孩子可以自己一个人到迪拜旅游一次见识一下。所谓压抑得厉害反击得更厉害。伊斯兰对性的强烈压制却意外地降低了阿拉伯男人的性阈值，北欧的开放却使得男人们曾经沧海难为水，这就是阈值理论最好的应用范例。\n\n再举个最极端的例子吧，释迦牟尼本来是个印度的王子，很早就过着锦衣玉食的生活，但是活得很厌世。其父为其选来印度最妖艳美丽的女子想以此来拴住他，但是美酒美女对他的边际效应已经小到忽略，世俗（食欲肉欲）的一切无法使他获得更高的满足，只有离开世俗创造佛教去了。这个例子之所以极端，是因为他一出生就享受物质的极大满足，导致他的阈值高到普通人难以想象的程度，最后凡是物质都无法使他快活。中国的例子是贾宝玉，从小活在女人堆里，最后也做和尚去了。好玩的是，真正自小出家的人却未必能忘却世俗。所以《水浒》里会有和尚最淫一说，潘巧云与淫僧那一段有很精妙的点评，大家可以自行学习。盖因为自幼出家的人，从未享受过世俗的快感，所以阈值很低，一点就着。能大彻大悟的慧根人士，往往反而是富家子弟，也就不奇怪了。\n\n男生如此，女人亦然。过多的韩剧，泛滥的矫情将正常的女生活生生逼成大龄剩女。有人说我们这个时代“爱无能”，归根到底也是阈值作怪。其实各个时代的男男女女，大抵都是差不多的，不会有一个时代比另一个时代特别优异或劣质的情况出现。本来少女看见年轻男子怀春，是老天爷安排的正常心理活动，为女大当嫁做好准备。现在这个自然的程序被突然打断，横插10部韩剧，部部男一号多金英俊完美，还有若干男二号三号争抢。电视机前的女人们于是看傻了，爱情阈值被活生生地抬到天上。本来挺好的邻家男子，结果和电视里一比，实在不堪一击；甚至身边不多见的优秀男人也看不上，于是一个个坐地起价，少女熬成老妇。男人也一样，每每看到有谁发个帖秀个美女的，总有一帮猥琐男在那里挑剔：腰太粗、腿太短。败给了这些人，比这个难看一半的女孩子能在你的现实生活中出现你就狠狠上香吧。都是被发达的传媒给害的，什么毛病！",
				"added": 1569207493
			}
		],
		"3_199crzJneoNxZ8c5KKenGaJPz4C2nKgvsJ": [
			{
				"comment_id": 2,
				"body": "零网搜索资料的时候不会被屏蔽关键词 ",
				"added": 1569210543
			}
		]
	},
	"comment_vote": {}
}