{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "30 PROVÉRBIOS CHINESES QUE PODEM TE DEIXAR MAIS SÁBIO",
			"body": "1 - Um pouco de perfume sempre fica nas mãos de quem oferece flores.\n2 - Não há que ser forte, há que ser flexível.\n3 - Nós não herdamos o mundo de nossos antepassados, nós o pegamos emprestado dos nossos filhos.\n4 - O passado é história; o futuro, um mistério; e o presente, uma dádiva.\n5 - Aquele que faz e promove o bem cultiva o seu próprio êxito.\n6 - Ser pedra é fácil, o difícil é ser vidraça.\n7 - Se alguém está tão cansado que não possa te dar um sorriso, deixa-lhe o teu.\n8 - O medíocre discute pessoas. O comum discute fatos. O sábio discute ideias.\n9 - A mente tem o passo ligeiro, mas o coração vai mais longe.\n10 - Se houver um general forte, não haverá soldados fracos.\n11 - Se o vento soprar de uma única direção, a árvore crescerá inclinada.\n12 - Lembre-se de que grandes realizações e grandes amores envolvem grandes riscos.\n13 - Espere o melhor, prepare-se para o pior e aceite o que vier.\n14 - Todas as flores do futuro estão contidas nas sementes de hoje.\n15 - Lembre-se de cavar o poço bem antes de sentir sede.\n16 - Se você não mudar a direção, terminará exatamente onde partiu.\n17 - A língua resiste porque é mole; os dentes cedem porque são duros...\n18 - O burro nunca aprende, o inteligente aprende com sua própria experiência e o sábio aprende com a experiência dos outros.\n19 - Sem o fogo do entusiasmo, não há o calor da vitória.\n20 - Visão sem ação é sonho. Ação sem visão é pesadelo.\n21 - O homem só envelhece quando os lamentos substituem seus sonhos.\n22 - A palavra é prata, o silêncio é ouro.\n23 - As más companhias são como um mercado de peixe; acabamos por nos acostumar ao mau cheiro.\n24 - Cem homens podem formar um acampamento, mas é preciso de uma mulher para se fazer um lar.\n25 - Jamais se desespere em meio às sombrias aflições de sua vida, pois das nuvens mais negras cai água límpida e fecunda.\n26 - O cão não ladra por valentia e sim por medo.\n27 - Quem abre o coração à ambição fecha-o à tranquilidade.\n28 - Se não queres que ninguém saiba, não o faças.\n29 - Se quiser derrubar uma árvore na metade do tempo, passe o dobro do tempo amolando o machado.\n30 - Procure acender uma vela em vez de amaldiçoar a escuridão.",
			"added": 1545018251
		}
	],
	"topic_vote": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "#Conjectura Collatz - Python\nA conjectura de Collatz é uma conjectura em matemática que diz respeito a uma sequência definida da seguinte maneira: começar com qualquer inteiro positivo n. Em seguida, cada termo é obtido do termo anterior da seguinte forma: se o termo anterior for par, o próximo termo é metade do prazo anterior. Caso contrário, o próximo termo é 3 vezes o termo anterior mais 1. A conjectura é que não importa qual valor de n, a sequência sempre chegará a 1.\n\n- https://privatebin.net/?ef83a235cd8dd74f#3lwG/ryNTziJZZ5WskjpeRYs7HvtCXwwYacUVPfOlPc=",
				"added": 1544989779
			},
			{
				"comment_id": 2,
				"body": "#Não tente resolver esses problemas - Richard K. Guy\n- https://sci-hub.tw/10.2307/2975688",
				"added": 1544990079
			},
			{
				"comment_id": 3,
				"body": "#Conjectura Collatz: Piada Cósmica?\n- https://www.youtube.com/playlist?list=PLrvbLUE7N0y-3chMnZK4byIvMvNXF-U4V",
				"added": 1544990104
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 4,
				"body": "#FÚRIA EM ALTO MAR\nDono de métodos próprios nada convencionais, o Comandante Joe Glass (Gerard Butler) é o responsável por liderar uma delicada missão pelas perigosas águas do Mar de Barents à bordo do submarino USS Arkansas. O objetivo da tarefa é monitorar a atividade militar russa na região após outro submarino americano desaparecer naqueles mares. Enquanto isso, a situação política na região se acirra ao ponto de Glass ter de tomar decisões cruciais para impedir que se deflagre um conflito de escala continental entre as duas potências.\n- https://www.ok.ru/video/1163843734229",
				"added": 1544993092
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 5,
				"body": "#Code Geass\nA maioria das histórias giram em torno do estudante Lelouch Lamperouge, um jovem príncipe que na sua infância sofreu um atentado terrorista à sua casa, no qual morreu sua mãe e deixou sua irmã impossibilitada de andar e cega. Após isso ele teve que se mudar para um lugar chamado Área 11, que corresponde ao Japão depois de dominado pelo Império de Britannia, e recomeçar a sua vida. Alguns anos depois ele encontra uma garota misteriosa chamada C.C. que lhe dá um poder chamado Geass, que lhe permite dar ordens a qualquer ser humano, sendo impossível não obedece-las. E com esse poder ele resolve destruir o mundo em que vivia para construir um novo e mais gentil como idealizara sua irmã. A história se expande em diversos pensamentos filosóficos desde a paz forçada até a definição de justiça, discutindo as formas nas quais a sociedade atual se baseia e fazendo o telespectador pensar se o mundo onde vive é o certo.\n- https://www.superanimes.site/anime/code-geass",
				"added": 1545012709
			},
			{
				"comment_id": 6,
				"body": "#Kaze No Stigma\nYagami Kazuma era originalmente parte da família Kannagi, uma família respeitada de usuários de fogo que têm uma afinidade para disparar. No entanto, depois de ter sido facilmente derrotado pelo seu primo Ayano e não ter talento algum em magia de fogo, Kazuma é banido e escalado fora de sua família. 4 anos mais tarde, Kazuma finalmente retorna ao Japão, desta vez como um usuário do vento excepcionalmente poderosa. Uma série de assassinatos em membros da família Kannagi ter ocorrido com a sua chegada. Enquanto a maioria da família, incluindo Ayano está convencido de Kazuma é o culpado, ele honestamente não é. Estes eventos começam uma guerra contra a família Kannagi, com Kazuma e Ayano bem no meio dela. Baseado no romance de Takahiro Yamato.\n- https://www.superanimes.site/anime/kaze-no-stigma",
				"added": 1545012871
			},
			{
				"comment_id": 7,
				"body": "#Maoyuu Maou Yuusha\nA série segue as aventuras de um herói humano ea rainha dos demônios que se juntam a forças para trazer paz e prosperidade para o seu mundo devastado pela guerra.\n\n- https://www.superanimes.site/anime/maoyuu-maou-yuusha",
				"added": 1545013206
			},
			{
				"comment_id": 8,
				"body": "#Mondaiji-tachi Ga Isekai Kara Kuru Sou Desu Yo?\nIzayoi Sakamaki, Asuka Kudou, e Você Kasugabe tem enormes poderes psíquicos e está entediado com o mundo regular. Um envelope chega para cada pessoa, e quando cada um abre o seu envelope, eles estão surpresos ao ver a paisagem ao seu redor mudar para um mundo que nunca tinha encontrado antes. Eles foram convocados pelo Coelho Preto para ajudar a comunidade \"No Name\" para derrubar o Rei Demônio.\n\n- https://www.superanimes.site/anime/mondaiji-tachi-ga-isekai-kara-kuru-sou-desu-yo",
				"added": 1545013332
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 9,
				"body": "#Brasileira descobre material mais efetivo do que o grafeno\n- https://sci-hub.tw/10.1038/ncomms7316",
				"added": 1545019498
			}
		]
	},
	"comment_vote": {
		"9_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1
	}
}