{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1613426915,
			"title": "Praca dla programisty Zeronet",
			"body": "Poszukuję programisty, który podejmie się modyfikacji kodu ZeroWiki http://127.0.0.1:43110/1LX2wiouHctuUXtu5WkVM9TJJ3YoL6gAfm/\n , tak by:\n1. Kodowanie wprowadzanego tekstu było zgodne z formatem Mediawiki (np. by nagłówki były oznaczane za pomocą znaków == == a nie ##)\n2. Tylko zweryfikowani użytkownicy mieli prawo edytować treść ZeroWiki.\n3. Możliwy był upload obrazków z poziomu przeglądarki.\n\nZlecenie jest płatne w wybranej przez Ciebie kryptowalucie. Cena do negocjacji.",
			"added": 1613426914
		},
		{
			"topic_id": 1615697711,
			"title": "Funkcja uploadu obrazków na na stronę w ZeroNecie",
			"body": "Cześć, \nczy ktoś z Was wie , w jaki sposób mógłbym napisać funkcje odpowiedzialną za upload obrazka na stronę w ZeroNet - BEZ ZAPISU DO BAZY DANYCH ?\n\nAnalizowałem ten kod http://127.0.0.1:43110/1NCRELKZ3zWRS6DijziYrfWi9dsUY8Fh8n/\ni tam niestety obrazki są zapisywane do bazy danych... co powoduje, że baza niemiłośiernie puchnie.",
			"added": 1615697709
		}
	],
	"topic_vote": {
		"1613426915_1JZ8pyPNPtaH5pdLNzcifFLoBppBZj3SaC": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1612400561_1GF1qUdtVSLUu5GDhvLTBtp2REPd2gSHXL": [
			{
				"comment_id": 1,
				"body": "> [3indygo](#comment_1_1GF1qUdtVSLUu5GDhvLTBtp2REPd2gSHXL): W jaki sposob okreslane sa statystyki ilosci uzytkownikow wedlug panstw? chodzi o konfiguracje jezyka aplikacji zeronet? ip czy moze co innego?\n\n\n\nTor relays and bridges collect aggregated statistics about their usage including bandwidth and connecting clients per country. Source aggregation is used to protect the privacy of connecting users—discarding IP addresses and only reporting country information from a local database mapping IP address ranges to countries. These statistics are sent periodically to the directory authorities.\n\nCollecTor downloads the latest server descriptors, extra info descriptors containing the aggregated statistics, and consensus documents from the directory authorities and archives them. This archive is public and the metrics-lib Java library can be used to parse the contents of the archive to perform analysis of the data.\n\nIn order to provide easy access to visualizations of the historical data archived, the Tor Metrics website contains a number of customizable plots to show user, traffic, relay, bridge, and application download statistics over a requested time period and filtered to a particular country.\n\nIn order to provide easy access to current information about the public Tor network, Onionoo implements a protocol to serve JSON documents over HTTP that can be consumed by applications that would like to display information about relays along with historical bandwidth, uptime, and consensus weight information.\n\nAn example of one such application is Relay Search which is used by relay operators, those monitoring the health of the network, and developers of software using the Tor network. Another example of such an application is metrics-bot which posts regular snapshots to Twitter and Mastodon including country statistics and a world map plotting known relays.\nhttps://metrics.torproject.org/about.html\n\nCzyli mostki i relay-e zbierają o Tobie metadane, ale łaskawie, przed udostępnieniem tych metadanych do https://metrics.torproject.org/collector.html kasują adresy ip. \nStąd łatwy wniosek, że wystarczy duża liczba zmodyfikowanych relay-jów i exitnodów, które raportują IP i właściciel tych relay-ów może prowadzić atak korelacyjn , nawet bez pomocy ISP.",
				"added": 1612749739
			},
			{
				"comment_id": 2,
				"body": "z linku, który zamieściłem pod tekstem ...",
				"added": 1612897638
			},
			{
				"comment_id": 3,
				"body": "> [arione](#comment_32_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Rozumiesz, że zeronet i tor to nie to samo?\n\nto pisz precyzyjnie, \nw postach użyłeś nazw : freenet , cebula, zeronet. \n\nZdecyduj się k&#@a ....",
				"added": 1612943975
			}
		],
		"1613426915_1JZ8pyPNPtaH5pdLNzcifFLoBppBZj3SaC": [
			{
				"comment_id": 4,
				"body": "> [trueerin](#comment_13_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz): zweryfikowani? przez kogo? Wiki wtedy już przestanie być Wiki....\n\nZweryfikowani przez tych co zostali już zweryfikowani. \nJest to konieczne by zabezpieczyć wiki przed spamem i wandalizmem.\n\nOferta jest jak najbardziej poważna.",
				"added": 1613512662
			},
			{
				"comment_id": 5,
				"body": "> [driud](#comment_234_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Przepraszam? A co za różnica jest? czy jest tak wywołany pewien efekt czy inaczej? Przecież my czytamy efekt końcowy. To co nam się wyświetla na ekranie?Zazwyczaj wiem z doświadczenia, że wszystkie modyfikacje nas prowadzą do / czarnej dupy /.To niema żadnego logicznego sensu zmieniać..pozdrawiam.\n\nDruid, nadużywasz soku z jemioły, bo piszesz niezrozumiale. \n\nPunkty 1, 2, 3 są dla mnie konieczne ( i dla osób , które by się dołączyły do projektu). Żeby się nie kryć dłużej z zamiarami... moja strona www to dyplom.edu.pl , projektuję również Rozproszony System Edukacj, do jego budowy przyda sie technologia jaką jest Zeronet. \n\nPosiadam budżet na ten cel. \nPozdrawiam",
				"added": 1613548034
			},
			{
				"comment_id": 6,
				"body": "> [driud](#comment_235_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Tak jak pisze kolega? Załóż sobie, sklonuj stronę; Wtedy to będzie twoja strona. Jak będzie twoja? to będziesz na niej mógł robić co tylko zechcesz. Łącznie ze zmianami wszystkiego, co tylko się tobie spodoba. Możesz mieć sklonowaną kopię Wikipedii. Wystarczy że dasz swój tytuł. Tytuł, nazwa, musi być inna. ZeroNet, nie stwarza dla nikogo ograniczeń, Ale grzebanie w tym co już jest; jest zakazane. Każda strona ma właściciela, i nikt nie może się mu wcinać. W jego pomysł i pracę. Jeszcze jedno ZeroNet, nie jest na sprzedaż.pozdrawiam.\n\nDruid, uszy mi ku$#A opadają jak czytam takie pseudomoralizatorskie, stulejarskie spuścizny. \nDziękuję Panowe za pomoc w rozwijaniu ZeroNet, walcie dalej konia , a ja w tym czasie sam postaram się zmodyfikować klona ZeroWiki lub znajdę Hindusa co to zrobi...",
				"added": 1613616054
			},
			{
				"comment_id": 7,
				"body": "> [arione](#comment_47_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Ale trolowałeś.\n\nI dopowiem, że nie trolowałem. \n\nNazwa \"cebula\" odnosi się do \"The Onion Router\" , Freenet to też był taki starodawny protokół... , \nAutor tamtego tematu używał nazw \"cebula\" i \"freenet\" jako nazw ZeroNet - co zwyczajnie wprawiło mnie w błąd.",
				"added": 1613616326
			},
			{
				"comment_id": 8,
				"body": "https://www.freelancer.com/projects/html/Introduce-changes-into-ZeroNet-wikipedia/details\n\nZobaczymy co z tego wyniknie. \n\nNo i przepraszam, za wypomnienie Wam walenia konia i pisania stulejarskich porad. Mnie też czasem się zdarza. \n\nPozdrawiam :D",
				"added": 1613618568
			},
			{
				"comment_id": 9,
				"body": "> [driud](#comment_236_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): @klempa;Ty widzisz swój czubek nosa; a ja patrzę trochę dalej. Tobie podobni , już nie jedną dystrybucję zepsuli. Ty nie chcesz pomóc w rozwoju ZeroNeta... Ty chcesz go przejąć, a to jest duża różnica. Jesteś młody i porywczy? Musisz się jeszcze dużo nauczyć od życia.A co do ZeroNeta, niech pozostanie kulawy; Ale nasz własny.Dziękujemy za ulepszanie, czegoś co jest już dobre.Pozdrawiam.\n\nDziękuję, dzięki Tobie poczułem się od razu młodziej. \nA czy Ty, wielebny Druidzie jesteś w stanie zobaczyć swojego penisa jak sikasz ?\n\nPS. Nie nie chcę go przejąć, tylko chcę by stulejarze nie zaśmiecali strony www, która ma służyć np. uczestnikom olimpiad przedmiotowych z fizyki, matmy, chemii itp.",
				"added": 1613652306
			},
			{
				"comment_id": 10,
				"body": "> [trueerin](#comment_17_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz): jest nas tu garstka a obrzucanie błotem tylko z jednej strony... to dobry wynik jak na... no właśnie.\n\nPrzepraszam. \nJestem chamem, szczerym i uczciwym chamem. Natomiast Druid jest marudą, która w każdej aktywności widzi zagrożenie .",
				"added": 1613658584
			},
			{
				"comment_id": 11,
				"body": "> [driud](#comment_237_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH):. uczestnikom olimpiad przedmiotowych z fizyki, matmy, chemii itp..Mam pytanie do Ciebie? Czy ty widzisz sens słów, które piszesz? Czy ty rozumiesz te słowa co napisałeś?Proszę ciebie; zastanów się przez chwilę?\n\nNie zrozumiałem. \nCzy są ku temu co napisałem jakieś ograniczenia techniczne, czy tylko ograniszenia natury pseudo-filozoficznej, które Ty widzisz, wielebny Druidzie ?",
				"added": 1613660111
			},
			{
				"comment_id": 12,
				"body": "> [driud](#comment_238_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Techniczne; musisz mieć klucze dostępu do strony. Te klucze ma właściciel strony.Jak założysz swoją stronę? To będziesz miał te klucze, na swój własny użytek. I to ty będziesz dysponentem tej strony./ twoje małpy, twój cyrk /. Ja od swojej strony, swoich kluczy? tobie nie dam.Dlaczego? Bo to ja za tą stronę odpowiadam, przed światem.Tak, że jak widzisz? te porady były słuszne; Załóż swoją stronę, i rób z nią co uważasz za słuszne.Pozdrawiam.\n\nDruid , to Ty jednak powinieneś się puknąć w swój pusty łeb.\n\nCAŁY CZAS PISZĘ O ZROBIENIU SWOJEJ STRONY. TY JESTEŚ JEDYNYM BEZMÓZGIEM, KTÓREMU SIĘ WYDAJE, ŻE CHCĘ ZMODYFIKOWAĆ 1LX2wiouHctuUXtu5WkVM9TJJ3YoL6gAfm/  NIE POSIADAJĄC KLUCZA PRYWATNEGO",
				"added": 1613668249
			},
			{
				"comment_id": 13,
				"body": "Moja strona to www.dyplom.edu.pl\nChcę ją przenięść do ZeroNet i udostępniać w WWW .",
				"added": 1613668706
			}
		],
		"1614797718_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 14,
				"body": "> [quickreloader](#comment_2_1JaCh1fv2Bhik1mTnzXWaNknaWvTewPAx7): Prfzyszlosc nie jest taka straszna.  [...]\nA brak prądu ? \nA awaria interneciku ? \nA rozładowany smartfonik?\n\n>[quickreloader]  i nikt nie bedzie wstanie udowdnic ze masz gdzie kolwiek jakies krypto. [...]\n Nikt , poza producentem Twojego Windowsa/Ubuntu/Androida/IOS... lub producent twojego sprzętu, lub producent procesora...",
				"added": 1614886879
			},
			{
				"comment_id": 15,
				"body": "> [fornakter](#comment_87_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): @klempa brak prądu, internetu dotyczy też aktualnego wymuszanego na siłę systemu płatności.\n\n\nTak jest. To co napiszę będzie \"szokujące\" ale dlatego powinniśmy - dla prywatnego bezpieczeństwa każdego z nas - dążyć do handlu wymiennego.\nHandel wymienny jest wspólnototwórczy. Od handlu wymiennego nie płaci się podatków ( zarabiasz więcej i wydajesz mniej za tę samą pracę) . \n\nPrzykładem towaru , który mógłby się nadawać do handlu wymiennego są : ESTRY KWASÓW TŁUSZCZOWYCH (czyli biodiesel) . Do zrobienia biodiesla potrzeba: przepracowany olej kuchenny z restauracji oraz dowolny czysty alkohol (metanol, etanol...) oraz szczyptę katalizatora np. NaOH . \n\nZa biodiesel kupisz od każdego rolnika jedzenie...",
				"added": 1614969516
			},
			{
				"comment_id": 16,
				"body": "PS. alkohol zrobisz samemu z wielu owoców i warzyw",
				"added": 1614969659
			},
			{
				"comment_id": 17,
				"body": "> [adam2](#comment_31_1QBGxPiLVbhA9dt8Yqex2EsZxoWtAhMVix): Wystarczą ziemniaki, buraki, aby zrobić alkohol. Kiedyś się robiło bimber, ale to śmierdziało. Chcecie się zapić z rozpaczy?\n\nBiodiesel.\n\nZacier destylujesz i otrzymujesz na początku śmierdzący metanol a potem dużo dużo dużo czyściutkiego etanolu. \n\nWlewasz to do oleju smażalniczego, podgrzewasz do około 50 stopni, mieszasz przez godzinę i otrzymujesz estry kwasów tłuszczowych (biodiesel) oraz gliceryne (mydło) .\n\nPS. ciekawe czy z Żydów robiono też biodiesla.",
				"added": 1615010714
			},
			{
				"comment_id": 18,
				"body": "1. Metale szlachetne - a właściwie, głównie złoto i srebro, podlegają w znacznej mierze spekulacji. Cena złota  w 2/3 wynika z zaufania do niego jako pieniądza. \n2. Ich obrót jest w znaczym stopniu zmonopolizowany. Np. głównym producentem złota i srebra w Polsce jest KGHM  - czyli totalnie upolityczniona firma państwowa. \n3. Kto z Was umiałby odróżnić pozłocony wolfram od złota ? Kto  rozpozna stop złota z miedzią ? (W pierwszym przypadku potrzebna jest waga i magnes neodymowy - złoto jest diamagnetykiem. W drugim przypadku trzeba zmierzyć gęstość) . Kto z Was rozpozna czystość srebra ? \n\nPieniądz kruszcowy jest tylko lepszą forma pieniądza fiducjarnego . Dlatego lepszą, bo posiada częściowe pokrycie wartości w kruszcu. \nPieniądzem kruszcowym się nie najesz. Za pieniądz kruszcowy nie kupisz mieszkania. \nPieniądz kruszcowy jest formą pośrednią pomiędzy handlem wymiennym a pieniądzem fiducjarnym. \n\nA teraz mam do Was pytanie:\nZakładając, że Satoshi Nakamoto to NSA, zakładając ,że w rękach NSA znajduje się kilkadziesiąt procent Bitcoinów, NSA jest panem życia i śmierci Bitcoina (decyduje o jego wartości). Czy NSA nie pełni dziś takiej roli dla Bitcoina jak Fort Knox pełnił dla wartości Dollara, gdy ten miał pokrycie w złocie ? Czy Bitcoin nie jest dzisiaj pieniądzem fiducjarnym , czyli opartym na zaufaniu, że NSA nie ubije jego ceny ?",
				"added": 1615227837
			},
			{
				"comment_id": 19,
				"body": "Kryptowaluta, która jest opensource a jej podaż jest rozproszona jest z pewnością krokiem w dobrą stronę. Na pewno może znaleźć zastosowanie wśród lokalnych społeczności, takich jak np. portale internetowe ( freelancer.com, khanacademy). Ułatwi życie wielu organizacji. \n\nJednak w globalnym układzie - w skali globalnej - najprawdopodobniej zawsze będzie zdominowana przez \"siły zła\" .\nNie da się zapewnić by kryptowaluta była akceptowana przez np. supermarkety - wystarczy jedno rozporządzenie ministra finansów i określona kryptowaluta znika z życia publicznego i pozostaje tylko niszowym wynalazkiem. Dlatego zawsze popularne będą tylko te kryptowaluty, które są kontrolowane przez \"siły zła\".\n\nKryptowaluty są dobre, tylko 95% ludzi jest głupich i tchórzliwych.",
				"added": 1615364095
			},
			{
				"comment_id": 20,
				"body": "> [fornakter](#comment_93_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): Korporacje mają większą moc niz się wydaje.Wystarczy, żeby jedna firma się wyłamała i przyjmowała w krypto i wszystko się posypie jak domek z kart.Poza tym jest dużo ludzi, ktorzy uzywają 2 walut. Nie widzę problemu w tym, żeby też używać dwóch. Albo konta takiego, gdzie trzymasz same krypto, a w momencie płacenia w biedrze za chleb i mleko jest przewalutowane. [...]\n\nNo i właśnie tu jest pies pogrzebany. Nie rozumiesz na jakich zasadach działają dzisiejsze korporacje. \nZdaje się, że akcje wszystkich firmy, które są notowane na giełdzie, są w częściowym posiadaniu spółki Vanguard https://en.wikipedia.org/wiki/The_Vanguard_Group .\n\nCzyli jak jakieś korpo miałoby się wyłamać, to dostaje wpierdol od akcjonariuszy i od innych korpo i rządów, z którymi ma kontrakty. \n\n[fornakter] Jesteś młody i głupi. Też taki byłem 10 lat temu, jak wchodził Bitcoin. Sporo na nim zarobiłem, ale wiem, że to piramida i z niej staram się uciec, zanim upadnie.",
				"added": 1615448644
			},
			{
				"comment_id": 21,
				"body": "> [fornakter](#comment_94_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): Takie komentowanie czyjejś wiedzy sobie daruj, bo tak naprawdę nie wiesz z kim rozmawiasz. I o ile do tematu kryptowalut podchodzę z dystansem, to na pewno by się znalazł temat, w którym bym Cie zaorał. Więc głupiego szukaj gdzie indziej.\n\nMasz racje, kochanie. :*",
				"added": 1615694227
			}
		],
		"1616836050_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 22,
				"body": "Covid jest w każdym kraju, który chce zwiększyć wydajność (sterowność) swojego społeczeństwa i posiada zapasy pozwalające przeprowadzić reformę (plandemię). Wydajność definiuję jako iloczyn siły politycznej-gospodarczej-militarnej i ilości zasobów zużywanych przez społeczeństwo. \n\nJednym ze sposobów zwiększania sterowności społeczeństwa jest ograniczenie jego mocy swobodnej (pisząc językiem cybernetyki - M.Mazur , Cybernetyka i charakter) .\nChińczycy są bardzo łatwo sterowalni przez rząd, ponieważ ich pkb per capita  jest niski (czyli też zarobki) , nie mogą więc sobie pozwolić na wielką swobodę. \nJeżeli chcesz z kogoś zrobić niewolnika, płać mu tylko tyle by wystarczało mu do przeżycia ale by nie mógł zgromadzić oszczędności. \n\nJednym z celów plandemii jest spowodowanie by społeczeństwa zachodnie zyskały większą sterowność. \n\nWydaje mi się, że enklawy takie jak Luksemburg, Monako, Dubaj, Singapur nie zostały \"zaatakowane przez Covid\" ponieważ ich atrakcyjność polega na tym, że są enklawami...",
				"added": 1616961472
			},
			{
				"comment_id": 23,
				"body": "> [driud](#comment_264_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH):Może trzeba się przenieść w tamte strony? Bo z tego co widzę, po miedzy Wisła a Odrą, zaczyna się robić, mało przytulnie. Ktoś to kiedyś nazwał, WOJNA-HYBRYDOWA. Pytanie? Czy jest warto zginąć? w ramach obrony republiki Bananowej???.pozdrawiam.\n\nW obozach koncentracyjnych również potrzebni byli ss-mani i kapo...\nMoże warto zostać ss-manem w republice bananowej...",
				"added": 1617043058
			}
		]
	},
	"comment_vote": {}
}