{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1562525339,
			"title": "IPV6:dynamic network part with static host part?",
			"body": "Hi,I just finally got IPV6 from my ISP.A full /64 block to be precise.After playing around with it,I managed to give myself the ::1 host on it by setting the full static IP in windows.Now here comes the problem,after a router reboot,my ISP gives dynamically another /64 block,so the previously set IPV6 won't work anymore.\nIs there a way to receive the network part dynamically,but instead of getting a random host part,set is statically?\nMy router doesn't have any configuration available for IPV6.Here's the screenshot of what I mean:\nhttps://prohardver.hu/dl/upc/2019-07/495078_ipv6-censored.png",
			"added": 1562525338
		},
		{
			"topic_id": 1562698903,
			"title": "Which is the latest version of zeronet?",
			"body": "Zeroupdate tells me I have the latest revision with 0.6.5 rev3866,but I have seen other peers in the /Stats menu with 0.7.0 versions.Is it yet out?\nIf so,how can I update?It happened once in the past that Zeroupdate told me I was running the latest version,while a newer was out.The solution for me was to reinstall completely.",
			"added": 1562698901
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "Zerome,Zerotalk,and none of the other zites' centralisation is a problem in my opinion.When something happens,anyone can still create their own.\nThe real problem is Zerohello for sure.When something happens to it,the whole Zeronet can be fckd up.Not completely destroyed,but would be much harder to use.\nThe only solution for that is to hard code it into the source,so it cannot be changed by anyone remotely.Or not even zerohello,but a simplified version of it where you can reach your downloaded zites,etc.",
				"added": 1562444358
			}
		],
		"1562414209_1CvZDPgKk2p8Uk1ZfJ3hcZb1DzuNJXndhn": [
			{
				"comment_id": 2,
				"body": "> [qspitzer](#comment_23_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): Thanos had a pretty good solution...\n\nActually,Hitler had too.",
				"added": 1562444429
			}
		],
		"1562525339_1CeQt9V6HXQjKEipGLs6RSAYD8aLEvG7KC": [
			{
				"comment_id": 3,
				"body": "There is no setting whatsoever in my router for IPV6,except for port opening.",
				"added": 1562526111
			},
			{
				"comment_id": 4,
				"body": "Yes I'm using the all in one from my isp.I don't now what other kind of routers could I use since I have gigabit optical internet.And mainly how much would such a router cost..despite this,the stock one works just fine.\nProbably a windows script would work too.I seem to have another V6 address as well(not temporary),so I have a live connection with it if the first 64 bit changes too.I could then visit a site that gives back the V6,chop down the first 4 part and give another address all from a bash script.\nWhitewolf:yeah I'm from Hungary :) I suggest you make the visit in the future,if you can afford it.It is a really nice country with thousands of sights to see,also the nature is amazing.Political situation is well,\"interesting\",but despite that with a decent job(IT,for example) it is a fairly good place to live.Ancestry wise,I don't really know how does that work,but saw other people tracing back family trees on the internet before,so it should not be much of a problem.",
				"added": 1562688311
			}
		],
		"1562661518_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 5,
				"body": "I always get that my IPV4 port is closed,tho it is certainly open and I get incoming connections as well.IPV6 port detection works great tho",
				"added": 1562688421
			}
		],
		"1562698903_1CeQt9V6HXQjKEipGLs6RSAYD8aLEvG7KC": [
			{
				"comment_id": 6,
				"body": "> [qspitzer] I just have the windows \"executable\" one,did not mess around with python on this machine.",
				"added": 1562699147
			},
			{
				"comment_id": 7,
				"body": "Downloaded the fresh py3 exe from zeronet,but I keep getting errors with this dll(and probably 165 more after this one would work):\nThe program can't start because api-ms-win-crt-runtime-l1-1-0.dll is missing from your computer. Try reinstalling the program to fix this problem. \nTried 3 different ones,none of them worked.What else should be installed?Or maybe someone has a zip with all the additional .net dll's that are needed to run zeronet?",
				"added": 1562764350
			},
			{
				"comment_id": 8,
				"body": "On the main page on zeronet.io",
				"added": 1562768100
			}
		]
	},
	"comment_vote": {}
}