{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "SmartHoldem — Технология Игры. Математика удачи!",
			"body": "Игра — это удивительнейший феномен нашей с Вами жизни.\nИгра — это то, что делает жизнь интереснее, насыщеннее, увлекательнее, ярче.\n\nПлатформа SmartHoldem направлена на продвижение новых Blockchain технологий в сегменте гемблинг индустрии.\n\nПерспективность проекта SmartHoldem очевидна не только для нас, для разработчиков, вкладывающих все силы и всю душу, не только для игроков и холдеров, но и для, так называемых, регуляторов.\n\nМировой рынок азартных онлайн игр является самым быстрорастущим и перспективным. С развитием Интернет растет количеством устройств, вместе с тем увеличивается количество пользователей, предпочитающих играть в онлайн-покер.\n\nНесмотря на такую популярность игры, покер-румы, представленные на рынке и использующие простую логику игровых автоматов с генератором случайных чисел, не могут предоставить пользователю стопроцентную гарантию и предложить полную прозрачность в вопросах формирования раздачи карт и распределения призового фонда.\n\nBlockChain - многофункциональная и многоуровневая информационная технология, предназначенная для надежного учета различных активов, позволила разработать платформу с уникальной Blockchain архитектурой, гарантирующую честность любой проводимой игры.\n\nSmartHoldem - предназначена для качественно новых и гарантированно честных игр между игроками в Poker без вмешательства третьей стороны.\n\nSmartHoldem — это первая в мире децентрализованная игровая платформа и Poker Room на BlockChain, независимая масштабируемая платформа с набором протоколов, гарантирующая честность и надежность хранения данных, где всем участникам сети нет необходимости доверять друг другу или кому-либо, защищенная надежным распределенным реестром, новейшими технологиями шифрования и верификации данных без раскрытия личности.\n\nссылка на сайт платформы http://127.0.0.1:43110/1Le4nMx5gfv46DmG6vXNwegdbTvbU1E7KQ/",
			"added": 1522429290
		}
	],
	"topic_vote": {
		"1_1BFQ7DxzahfiVbbxyJpeHXuPR8FAmVkrEy": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}