{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1590860180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": ">Who is the developer?\n\nMillchan Engine developer is the Millchan developer, silly.\n\n>I want to also inform them that the below text in content.json would optimize the site for mobile devices.\n\nThey've been informed. Unfortunately, Millchan Engine is not currently under development nor maintenance.\nHowever, this modification has been applied to the main Millchan zite. Thanks.",
				"added": 1590867387
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_2291_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): @McDev: , correct?\n\nCorrect.",
				"added": 1590874668
			}
		],
		"1599706697_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 3,
				"body": "Click the \"Check files\" option in Zero Hello's menu and see if anything will change.\nAlso, open the browser's console and check if there are any error messages there.",
				"added": 1599731627
			},
			{
				"comment_id": 4,
				"body": "> [merithtk](#comment_94_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): I am using brave browser with Shields down [...]\n\nIt should still work fine even if it's up. Errors 500 will generally log the stack trace in ZeroNet's terminal. Do you see anything there?",
				"added": 1599769965
			},
			{
				"comment_id": 5,
				"body": "No idea what could be causing that other than an outdated version. I'd double check if you're using the latest revision (rev4496) and update ZeroNet in the case you aren't.",
				"added": 1599860478
			}
		],
		"1606646882_1Mr7C9iP1DeHKW8rRCGxVgSd5WS9yPB5Ws": [
			{
				"comment_id": 6,
				"body": "Works on my machine. Try upadting ZeroNet.",
				"added": 1606763335
			}
		],
		"1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 7,
				"body": "It's good to see some interest in this but I'm afraid this might not be the best solution.\n[Millchan merger](https://gitgud.io/millchan/merger) (or \"Millchan engine\" for lack of a better name) should fix most of the problems you mentioned since allowed file types and sizes limitations are decoupled from the engine and defined instead by the hubs owners.\n\nUnfortunately, its development has stopped and there is no sign of that changing anytime soon.\nHopefully @mcdev will return to its development some day or someone else will fork it / create another imageboard using a similar scheme with the merger plugin.\n\nP.S. the Millchan restrictions you mentioned could probably be adjusted easily if you opened an issue, or a merge request or just ask nicely on /dev/.",
				"added": 1611184566
			},
			{
				"comment_id": 8,
				"body": "> [zeroseed4](#comment_18_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): Im trying to compile this using the latest version of ffmpeg.js compiled directly from sources... The version that toke from npm install dont work for me\n\nNot sure what you mean. npm install doesn't compile the ffmpeg.js dependency.\nYou need to fetch the submodule and then run the Makefile inside its folder.\nThe build should work fine after that.",
				"added": 1611343400
			},
			{
				"comment_id": 9,
				"body": "You could update Millchan to help with the black thumbnails you've been getting. See 6ea3ea81.",
				"added": 1611488059
			},
			{
				"comment_id": 10,
				"body": "> [zeroseed4](#comment_24_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): I updated the code but the problem seems not to be solved\n\nBottom of the page still says you're using an outdated version (dfe30ba).\nAlso, it doesn't completely prevent it. It just decreases the likelihood of it happening.\nIt will use the frame at min(floor(config.video_thumbnail_position * video duration), 10s) instead of the very first frame.\nThat might be yet again another black frame if you're unlucky but it should happen significantly less often than before.",
				"added": 1611496068
			}
		],
		"1613615872_1ipaCWPxEBGaBE8f6JuA8YCztfh6LL6rR": [
			{
				"comment_id": 11,
				"body": "There is a 5MB limit to required files (data.json + content.json). You'll see that \"Include too large\" error if you exceed that limit. At this point you can either ask the site owner to increase your limit or just create a new identify.",
				"added": 1613650883
			}
		],
		"1617523821_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 12,
				"body": "> [xianc78](#comment_73_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): This is an imageboard, not a video sharing site.\n\nIt's a site where you can upload videos and share them with other people. Seems to fit the definition of \"video sharing site\" to me.",
				"added": 1617729092
			}
		],
		"1618045921_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": [
			{
				"comment_id": 13,
				"body": "> [houtje](#comment_34_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): huh weird; it didn't seem to work when I tried it earlier. Does the 'updates failed' message disappear after a while?\n\nThey will disappear eventually. You can also just modify your site.json and remove the bad files from the bad_files object.",
				"added": 1618052314
			}
		]
	},
	"comment_vote": {}
}