{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1597847864,
			"title": "Should user-level moderation be implemented in ZeroTalk engine?",
			"body": "* [Topic starter can moderate his/her topic]( https://github.com/HelloZeroNet/ZeroTalk/issues/65)\n* [Site owner appoints moderators, but they can only vote on what to do]( https://github.com/HelloZeroNet/ZeroTalk/issues/66)\n\n\nThose and many other moderation schemes can be implemented with a few tricks in the engine. A user cannot write directly to the data files of other users, but s/he can affect, how something is **displayed** by the engine. So, the user-level moderation is possible.\n\nFor example, admin may appoint moderators, and they can vote for hiding posts and comments. When multiple moderators (say, three) vote for hiding the same comment, it gets hidden from ordinary users.\nAnd when the comment owner goes online, the engine forces them to erase the comment from the data file. (Or not, depending on the forum configuration.)\n\nOther policies are also possible.\n\nThe question is do we actually need that feature in the engine or not.\n\nIf a forum looks more like a personal blog or a collection of blogs of many users, the moderation seems to be a good idea.\n\nAnd when a forum is a public place for every one, a place where people can freely discuss any topics, just like this specific ZeroTalk copy, the moderation makes little sense.\n\nWhat is your opinion?\n\nP.S.:\nThe ability for the forum admin to edit any user content from the UI is [already implemented](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/?Topic:1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/CHANGELOG+ZeroTalk+forum+engine).",
			"added": 1597847863
		},
		{
			"topic_id": 1604219688,
			"title": "In your opinion, what should I work on for ZeroNet?",
			"body": "I have too many ideas and too few time, so I decided to ask the community what may be the best option to work on during the next week or 2.\n\nPossible options:\n\n* Redesigning the core ZeroNet engine: fixing bugs and improving the code in the network subsystem and developing plugins related to trackers and network connectivity issues.\n* ZeroTalk++: fixing [the bugs](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/?Topic:1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/#Comments) and implementing new features.\n* An improved ZeroMe with new features and extended architecture that makes yet more new powerful features possible.\n* A replacement of ZeroSites, as I described [in comments here](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1604144267_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd/).\n* A fork of ZeroHello with links to many useful sites added by default and UI improvements.",
			"added": 1604219686
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1603313852_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "> An example of a class and the reason for this proposal is ZeroTalk. There are many forums on ZeroNet, and most of them have a compatible data structure, for they all inherited it from the official ZeroTalk forum.\n\nI was thinking about making a plugin allowing to override the file structure of any site on the fly. So for example, one can use the official ZeroTalk forum with ZT++ engine.",
				"added": 1603434501
			}
		],
		"1604144267_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "> [gitcenter](#comment_1467_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Some unrelated thoughts. It'd be cool if we could merge old 0list with new ZeroSites while keeping stats and stars. BTW, as for the stats -- they haven't been updated for a long time, so perhaps add ZeroSites to the list?\n\nI reported the issue several months ago. No luck.\n\nSo ZeroSites are on my to do list. The plan is:\n\n* ZeroNet trackers export the statistics as a JSON file on a zite.\n* User loads one or more such zites.\n* ZeroSites connects to those zites in the same way as ZeroMe to its hubs and uses all the statistics available.\n\nSo no centralized stats provider should be required.\n\nSince a tracker exports hashes and no plain addresses, it is possible to get stats for a zite only when you know its address, so no data leak seems to be there.",
				"added": 1604159090
			}
		],
		"1604200104_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "There should be a way for a zite to declare which subscription types it implements and how one can subscribe. As fas as I know, now subscriptions are handled by a JS code on the zite's side, so we have no general interface for subscriptions.\nI guess it's not hard to implement that idea.",
				"added": 1604214515
			},
			{
				"comment_id": 4,
				"body": "> [mg0](#comment_378_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Sounds like a next level stalking, but the word 'follow' already states so\n\nHaha, it's okay. %-) I consider ZeroNet a kind of social media. Everything is public here, and you can generally use a single ID on any site. And \"sites\" are more like \"thematic groups\". So for me it's surprizing why we do NOT have that feature implemented.",
				"added": 1604215554
			}
		]
	},
	"comment_vote": {}
}