{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1JhdguyALfj6NzqqX6WtzNVY1EQvPjY9wF": 1,
		"5_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1BmJFwSfmH9P2of7cCzh4qg5CPV5swsmr4": [
			{
				"comment_id": 1,
				"body": "Xingar no Facebook.",
				"added": 1588381525
			}
		],
		"1_1J7BZnp2xmjByBDG3z9UUtXv22pnQ7akfr": [
			{
				"comment_id": 2,
				"body": "Aposto que você não está morto. 2 vai mentir que não é brasileiro. 3 já matou teu pai, mãe, irmã, irmão... começa por eles então.",
				"added": 1588381587
			}
		],
		"1_1JhdguyALfj6NzqqX6WtzNVY1EQvPjY9wF": [
			{
				"comment_id": 3,
				"body": "Lembra muito o 11 de setembro, onde a desculpa foi a segurança e agora a desculpa é a saúde.\nDepois desse ataque EUA ganhou poder absoluto sobre todos e tudo em seu território.\nPodendo espionar todos seus cidadãos, prender quem quiser sem provas, calar quem quiser, matar, torturar, etc, tudo em nome da \"SEGURANÇA\".\nOs próprios cidadãos estão sendo tratados como criminosos.\nSão vistos como um perigo em potencial, são revistados e proibidos de portar armas.\nUma coisa muito conveniente que elimina por completo qualquer tentativa de reação do povo contra um governo totalitário que se está instaurando.\nSerá que algum governo mataria uns 3 mil cidadãos para ter controle absoluto dos outros milhões?",
				"added": 1588534581
			}
		],
		"5_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": [
			{
				"comment_id": 4,
				"body": "A cada site visitado arraste o símbolo para a esquerda, se gostou do site e aparecer a opção ajudar a manter o site, então ative, se não gostou clica no botão Remover (ele é bem escuro mal dá para enxergar), assim você não fica compartilhando lixo e com lixo no pc. Se gostou do site você também pode aumentar o espaço e assim manter mais arquivos dele.",
				"added": 1588561189
			}
		],
		"1_1LgFvYLMHaHMjCtg9FYuQp1W8C1fqsHUWG": [
			{
				"comment_id": 5,
				"body": "O telefone de casa tocava com propaganda da Dilma e os carteiros eram obrigados a entregar planfetos pró governo Dilma, tentaram fazer uma lavagem cerebral mas falharam, porém não desistiram.",
				"added": 1588561878
			}
		],
		"1_1LDX48jX1gt7dwgNFCAaeT7bSVXnuJWH9m": [
			{
				"comment_id": 6,
				"body": "Eles matam cristão na paulada. Jogam gays do alto de prédios. A palavra da mulher só vale a metade da de um homem. Só petista que quer ver a desgraça do ser humano que apoia esses desgraças.",
				"added": 1588568098
			}
		]
	},
	"comment_vote": {}
}