{
	"posts": [
		{
			"id": "3f4391d7-24ca-476b-b993-ca444623bd19",
			"directory": "users/1AtvCHH1vmbBNeoaKKzWZGZgBKY8SDHYGx",
			"uri": "pol",
			"subject": "How China Unleashed Twitter Trolls to Discredit Hong Kong’s Protesters",
			"body": "噴子和五毛黨：中國如何在推特上攻擊香港抗議者\nHow China Unleashed Twitter Trolls to Discredit Hong Kong’s Protesters\nhttps://cn.nytimes.com/china/20190919/hk-twitter/zh-hant/dual/\nmain idea:\nChina has long deployed propaganda and censorship to subject its citizens to government-approved narratives. As the nation’s place in the world grows, Beijing has increasingly turned to internet platforms that it blocks within the country — including Twitter and Facebook — to advance its agenda across the rest of the planet.\n長期以來，中國一直使用宣傳和審查措施使民眾只接受政府批准的敘事。隨著中國在世界上的地位不斷提高，北京已越來越多地求助於Twitter和Facebook等在國內被屏蔽的互聯網平台，推動它在全球其他地區的議程。\nIt has done so in part by setting up accounts on the platforms for its state-run news outlets, such as China Daily, to make a public case for its views. But that is quite different from using fake accounts to manipulate opinions surreptitiously or simply to sow confusion.\nInstead of taking the time to cultivate plausible yet fake online personalities, the campaign’s operators appear to have simply bought accounts in the shadowy global marketplace for social media influence, where followers and retweets can be had for cheap.\n這場運動的操作者沒有花時間去培養看似可信但虛假的網路人物，而似乎是簡單地在一個神秘的全球市場上購買帳號，尋求獲取社群媒體影響力。在那個市場上，粉絲和轉發都可以低價買到。\nThe accounts posted in Indonesian, Arabic, Portuguese and other languages. They promoted hookup services, posted about Korean boy bands and retweeted messages about pop-punk music.\n這些帳號用印尼語、阿拉伯語、葡萄牙語和其他語言發貼。它們推銷勾搭服務，發有關韓國男孩樂隊的帖子，轉發關於流行龐克音樂的信息。\nuring some of their tweet campaigns, the accounts posted primarily during the workweek, a sign that the accounts were run by employees working on the clock. For months, one account posted messages smearing Mr. Guo at 12 and 42 minutes past the hour, suggesting that the activity was automated.\n在這些帳號的某些推文運動期間，它們主要是在工作日發帖子，表明這些帳號由打卡上班的人員操作。一個帳號有好幾個月都在整點過後的12分種和42分鐘發詆毀郭文貴的信息，表明發帖是自動進行的。\nSome of the accounts appear to have been started by genuine users but were later hijacked.\n有些帳號似乎是由真正的用戶創建的，但後來被劫持了。\nFor years, China has used armies of pseudonymous keyboard warriors to flood domestic social platforms and news sites with pro-government comments.\n多年來，中國一直在使用匿名的鍵盤俠大軍，用支持政府的言論佔領國內社交平台和新聞網站。\nIn 2013, the head of China’s propaganda department said that in Beijing alone, there were more than 2 million people working to “strengthen guidance of online opinion,” including by posting comments on Weibo, China’s Twitter-like social media platform.\n2013年，中宣部部長表示，僅在北京，就有200多萬人在從事「加強網上輿論引導」工作，包括在中國類似Twitter的社群媒體平台微博上發表評論。\n......................",
			"time": 1568889405200,
			"files": "[]"
		},
		{
			"id": "f405189a-466a-4756-9e18-24f3d0f24874",
			"directory": "users/1AtvCHH1vmbBNeoaKKzWZGZgBKY8SDHYGx",
			"uri": "pol",
			"subject": "中国数字版“老大哥”瞄准企业界",
			"username": "China’s Big Brother Targets Business",
			"body": "https://cn.nytimes.com/business/20190923/china-social-credit-business/dual/\nBeijing is increasingly amassing information now divided among various government agencies and industry associations — including court decisions, payroll data, environmental records, copyright violations, even how many employees are members of the Communist Party — and using it to grade businesses and the people who run them, according to state media, government documents and experts.\nCompanies that get low grades can be banned from borrowing money or doing other essential tasks. Their owners or executives could have their bank accounts frozen or be forbidden from traveling.\nIt isn’t just aimed at Chinese businesses. In letters sent to the companies, officials have threatened to give United Airlines, American Airlines and Delta Air Lines black marks on their records if they don’t bend to Beijing’s wishes. FedEx could face a similar punishment.\nChina calls it the social credit system. By next year, Chinese leaders had hoped to start an ambitious nationwide program focused on punishing or rewarding individuals. It was aimed at replicating the credit scoring system common in the United States and other places, as well as taming behavior in a country where laws are inconsistently enforced.\n..........",
			"time": 1569296388000,
			"files": "[]"
		},
		{
			"id": "17d0f3d4-1733-4702-9eb8-285f4ca6d0be",
			"directory": "users/1DJEfWgdJ3rGnqCrKwLrBdQGodRaEBkAry",
			"uri": "DoS",
			"subject": "#Op_Tibet #Feb13 2020",
			"body": "These Chinese companies are the main players installing and running facial-recognition and other intrusive technology inside Tibetare and are deeply engaged with China's regime.\n \nThey are responsible for the 24/7 mass surveillance which targets Tibetans, monitoring their public movements, controlling their lives via ID/Bio-Metric cards, and monitoring all phone calls and internet use.\n \nAs such they attract legitimate attention to all Anonymous sisters and brothers in solidarity with #Op_Tibet\n \nResearch, testing on these is needed for potential actions, while any dot-gov-dot-cn site are justified targets.  \nhttps://pastebin.com/9sGWFEKc\nhttps://pastebin.com/s2ynYuXQ\nhttps://pastebin.com/qhMbxQRj",
			"time": 1581393379382,
			"files": "[]",
			"last_edited": 1581393614482,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}