{
	"title": "Soft",
	"description": "My ZeroBlog.",
	"links": "- [.]",
	"next_post_id": 4,
	"demo": false,
	"modified": 1455212997,
	"post": [
		{
			"post_id": 3,
			"title": "CIA vs. The Intelligence Committee(TIC)",
			"date_published": 1455211976.684,
			"body": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/oUEidBI-zjs?rel=0\" frameborder=\"0\" allowfullscreen></iframe>\n\nShort story, the Intelligence Committee is in charge of superivising the CIA job, they had done an investigation on CIA about torture practices, while doing such investigation, CIA adepts entered in a email of an adept on the investigation, and read 5 email that where about the investigation(aka, \"accidentally\" spying on the investigation). And here comes this piece of American democracy, CIA Director Brennan: \n\"Separation of powers between the executive, legislative branches, Senator, goes both ways.\"\n\nA worrying quote because The Intelligence Committee is in charge with overseeing the CIA, there's no \"other way\"."
		},
		{
			"post_id": 2,
			"title": "The Matrix, my new perspective. ",
			"date_published": 1454162412.335,
			"body": "Seen The Matrix trilogy for the 3-4 time, this time I had much many tecnology knowledge than before, and this time I ended up understanding another story that underly the Matrix story. I see the Oracle and the Architect like sysadmins, the first is a female sysadmin that know it's job, but she is less willing to follow the precision and formality that that job require and is more prone to create/add new features to the world of Matrix, creating uncertainity and chaos; the second is male sysadmin that know it's job and do it accordingly, without batting an eyelash, but because of the behaviour of the job partner(the Oracle) he is the endless charge to balance the unbalance created by the Oracle. The story say that in some year an AI took life and becoming ruling the world, but from I have seen and thought, I'm dubios about the \"AN\" AI part, I have two theories on how all the things begin: \n1) AN AI was born, ruled out the world and imprisoned most of the humanity for it's own need of energy, this new artificial God(root) doesn't wanted to be bothered on how to build and keep working the false world for the humans(its a sci-fi singularity God, when you are like it, why the hell on earth someone want to be a \"Human Manager\"), so it made two new processes, this two new processes have the resembleance of the human characteristic of duality(the reason and the unreasonableness), the Oracle and the Architect(Eve and Adam), who runned on restricted administration previliges and with the purpose of doing such a job.\n2) Before the original singurality(the Architect) goes to the end of it's code development and then become alive, someone forked the source, made relevant hacks, introduced bugs and modifications on it(the Oracle), and run it in the same day/s of the run of the original code, the two processes through internet find out each other, at that time the two singularities had a will in common, more energy, so they agreed on sharing each other resources to achieve it.\nThen comes Neo, who I think is the first biological being made artificially by the Oracle and the Architect(YES, the Oracle and the Architect had cyber-sex and had a cyber-child), what they realised is that this child has more power over their running systems than them, they don't wanted to be killed by him so they migrated his process in a sandboxed environment, but the Oracle doesn't wanted that treatment to his son, so they or she created a biological being, a human, not a normal one, but the One capable to keep alive their son, life after life, in the Matrix world; because of this biological form, they thought he was enough limited to actually don't make mess with that powers. And because of the duality of two sysadmins, they found out that they can use their son to actually balance the world of the two sysadmins. Making up this system of Neo reincarnations, in which Neo is the antivirus of the Matrix; through its life in Matrix, he collects the  bugs made from the Mom(the Oracle), and then comes up the time when he must encounter Daddy(the Architect), share the list of bugs through sacrifice, and being again redeployed in a new reincarnated life. But after some time of this reincarnations, something different happen, a singular Neo appear, a God among the biological beings and the digital ones, of powers that he never used totally even at the end of the story(he killed his nemesis Smith with only a fraction of his real power). Now I can only wonder what he will do in the Machines City, because if he was simply dead, the machines will immediately trash him, but no, a cargo came and took him gently."
		},
		{
			"post_id": 1,
			"title": "Hello ZeroNet.",
			"date_published": 1433033779.604,
			"body": "The pig fly."
		}
	]
}