{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "TOR não garante anonimato",
			"body": "https://gizmodo.uol.com.br/fbi-invadiu-tor/\n\nA rede TOR já possui diversos relays oficiais do FBI americano, se você acredita que está seguro e anônimo nesta  rede, está muito enganado.\n\nA rede foi quebrada em 2013, faz sete anos que os Estados Unidos ampliou suas técnicas de identificação.\n\nHoje, o país consegue obter acessos muito mais avançados até sua câmera, microfone e senhas.\n\nEm 2015, os Estados Unidos também iniciaram uma rede parecida com a rede TOR, com criptografia mais avançada e focada na comunicação governamental.\n\nA China e Rússia possuem uma rede semelhante mais de nível mais baixo, porém com mais ferramentas.\n\nOs métodos de segurança atual para anonimato utilizam redes de quebra de mapeamento de antenas e descentralização de IP sobre IP e após conexão em rede externas em países sem acordos com Estados Unidos e Europa, no Brasil não temos essa opção uma vez que toda nossa fibra vai para a Europa e depois o mundo",
			"added": 1607907828
		}
	],
	"topic_vote": {
		"1_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": 1,
		"1_19wE5uV666o5wx1fE3yFvtj37vsB4qRXsV": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1NapcyFaDgMx3T8eR7wpMmuSza3acwT9wA": [
			{
				"comment_id": 1,
				"body": "Seria muito bom mesmo",
				"added": 1607902914
			}
		],
		"3_16ZPcaFPYqvwSNDHjmyjnaHgsXZVUwDF9K": [
			{
				"comment_id": 2,
				"body": "Discordo, é evidente que a esqueça é uma farsa e ditadora sobre o pensamento e a ação",
				"added": 1607903107
			}
		],
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 3,
				"body": "Muito conteúdo, aprendi muito, valeu",
				"added": 1607906321
			}
		],
		"1_1Ew86XmYg67eqxLWsQaXBhuzpcT55MhD3t": [
			{
				"comment_id": 4,
				"body": "Já foi que quebrado a rede TOR através das redes de relay, essa informação é antiga e os Estados Unidos conseguiu esse efeito através de investigações contra pedófilos.",
				"added": 1607906902
			}
		],
		"1_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 5,
				"body": "Você deve ser muito burro, pois a rede TOR já foi que quebrada várias vezes pelos Estados Unidos, através dos relays, eles conseguem obter seu IP verdadeiro.\n\nDeixa de ser burro, logo logo será preso e aí vai virar mocinha na cadeia.\n\nBranco burro",
				"added": 1607907208
			}
		],
		"1_19wE5uV666o5wx1fE3yFvtj37vsB4qRXsV": [
			{
				"comment_id": 6,
				"body": "O TAILS também possui Backdoor para sua identificação e isso ocorre por interferência da China basicamente ou seja, quem acreditava que comprar um chip 4g, mais um PC e conectar usando o TAILS, sua localização ainda será acessível.\n\nOs métodos serão baseados nas câmeras de segurança para identificar sua localização, maioria dos aparelhos celulares possuem Backdoor de fábrica ou obtido através de apps e certificados instalados.\n\nA Rússia também tem bastante ligação com essas ferramentas.\n\nAtualmente hackers e crackers tentam desenvolver suas próprias rooms para quebrar essas ferramentas, mas, se limitam a.navesgadores,. incompatibilidade e bugs frequentes",
				"added": 1607908732
			}
		]
	},
	"comment_vote": {
		"13_1MmWLh75HG1yfzP1TtTdAwPkeBJEBxQ8me": 1,
		"2_1AKSRy2zx1rZZTcuZXT4CbXmWGFwYnvqBY": 1,
		"1_17wmVdtpypnY5p78G7DUFhmV96ch3o2iz1": 1,
		"5_19wE5uV666o5wx1fE3yFvtj37vsB4qRXsV": 1,
		"10_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1_1JszzaxuPyozejWGkm7VyEEkXNCj5ihD6F": 1
	}
}