{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Семенов Ю.А. Программирование на языке Форт",
			"body": "![](https://gateway.ipfs.io/ipfs/QmRnXp8tRREF7k86vxtZ6zwcctC4f1fwDZFNiCyCvmea8r/1748229.jpg)\n\n- http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1semenov_yu_a_programmirovanie_na_yazyke_fort.djvu",
			"added": 1525348859
		},
		{
			"topic_id": 2,
			"title": "Приложение к «Юному технику», «ЮТ для умелых рук»",
			"body": "«ЮТ для умелых рук», 1989-02, «Персональный компьютер ЮТ-88»\n\n![](https://gateway.ipfs.io/ipfs/QmRRNhdpDyf8msMzRUqjuZzZd5U6yx5e5enkbHtT8CupXD/2018-05-03_15-06-25-yut-88.png)\n\nhttp://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1525349048-1989-02.djvu",
			"added": 1525349140
		},
		{
			"topic_id": 1525497285,
			"title": "«Анафем» — Нил Стивенсон (НФ)",
			"body": "_ Нил Стивенсон, НФ, философия, альтернативная социалка _\n\n# Анафем\n\nНачало тяжеловато, продираешься через дебри альтернативной терминологии... но после первой сотни страниц начинают заворачиваться события и уже не оторваться.\n\n![](https://gateway.ipfs.io/ipfs/QmZoYTu6mh1pgpt1QPHrj5HYmnrA6DD2wU1W1upQzgM4ko/file1AD4kR.jpg)\n\nКраткая рецензия.\n\nОписывается общество с альтернативным построением отношений социум-наука. Цивилизация протянула тысяч 7 лет. Несколько раз доходила до самоуничтожения. Переживала, строилась заново. За 3.6 тыс. лет до рассматриваемых событий разделилась на обычный «внешний» мир и замкнутую изолированную систему учёных — «теоров». Что-то типа религиозных монастырей — «матиков». Не без «слепой веры в науку» и прочей мистики. Учёные в полной изоляции и со всё возрастающими самоограничениями продолжают познавать мир. За стенами матиков жизнь идёт своим чередом, цивилизация то поднимается в развитии до небывалого уровня (хотя в космосе дальше местной солнечной системы и не уходят), то рушится едва переживая применения оружия массового поражения, собственные генетические эксперименты и т.п.\n\nПовествование ведётся от первого лица молодого теора. Которого цепочка странных событий провела от десятилетней изоляции в матике до космической орбиты...\n\nСама основная сюжетная линия не блещет какими-то особыми изысками. Поражает в первую очередь адова работа переводчика. Даже не автора пожалуй — все термины мира автором «построены» на земных корнях, переводчику многое пришлось адаптировать, пытаясь понять что имел в виду автор :) Что даёт в итоге пищу и нашему уму. Ну и конечно, ряд оборотов забавляет. \n\n> — Нам угрожает инопланетный корабль, начинённый атомными бомбами, — сказал я. — У нас есть транспортир.\n\n...\n\n> — Они считают, что Блай был богопоклонник? \n>  — Да. Для них он вроде пророка. Якобы он открыл доказательство бытия Божьего, и за это его отбросили. \n> — Смешно. Если бы кто-нибудь и впрямь доказал бытие Божье, *мы бы сказали: «Отличное доказательство, фраа Блай» — и начали верить в Бога.* \n\n...\n\n> Ещё раньше самые большие установки были на грани того, что можно построить на Арбе за вообразимые деньги. \n> — Я и не знал. Мне всегда казалось, что количество денег не ограничено. \n> — Может быть, — сказал Арсибальт, — но почти все они идут на порнографию, сладкую воду и войну. На ускорители остаётся самая малость.\n\n...\n\nПравда, самый подъём уровня произведения — где-то к последней трети. Начало раскручивается вяло, конец угасает... Так что, в общем, оценил бы на 7.5/10 из-за не очень высокого чисто литературного уровня, но округлю до 8/10. Прочитать один раз интересно, можно вытащить немало мемов и цитат. Много готовых терминов, которые легко бы проникли в жизнь, будь книга более популярна, книга не столько для души, сколько для ума :)\n\n## Ссылки\n\n- [Книга в FB2 на ZeroUp](http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Stivenson_Anafem.6GMr_A.269038.fb2.zip)\n- [Топик на форумах Balancer.Ru](http://forums.balancer.ru/society/2015/01/t90854--nil-stivenson-anafem.4020.html)\n- [Wikipedia](https://ru.wikipedia.org/wiki/Анафем) [RU]\n- [Flibusta](http://flibusta.is/b/269038) (заблокировано в РФ)",
			"added": 1525497282
		},
		{
			"topic_id": 1540492857,
			"title": "«Совсем рехнулись с этими попаданцами» ©",
			"body": "Увидел [на форуме сейчас](http://www.balancer.ru/g/p6803169):\n\n«_В тело Гермионы Грейнджер попадает фронтовая летчица из 46-го гвардейского ночного бомбардировочного авиационного полка («Ночные ведьмы»). И она совершенно точно не будет в восторге от магической Британии. В том виде, в каком та существует. Волдеморту остается молиться. И всем аристократам фашистского толка — тоже. Да и не фашистского тоже. Так, на всякий случай_» — \n\n🤦\n\n![](/1bmicr2VRXvcGZ8xE4bvtuhfvQRhfquAf/data/img/post_12_302517_200x300.jpg)",
			"added": 1540492853
		}
	],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"3_1HF3NjGs1BbYbuWpjfTXyDtmQ1tvwfAXHG": [
			{
				"comment_id": 1,
				"body": "ZeroWiki я не смотрел, а вот в ZeroTalk мне не получилось навскидку добавить поддержку картинок. Может быть у Вас получится лучше :)\n\nИ я бы посоветовал поставить тёмную тему в стиле оформления книг в IPFS, тогда будет более единообразно.\n\nИ, да, нужно переименовать все эти красненькие «ZEROTALK» и «ZEROWIKI» :)",
				"added": 1501068753
			},
			{
				"comment_id": 6,
				"body": "Ещё, наверное, лучше бы на латинице названия придумать. Потому что русский шрифт в HelloZeroNet отвратительно выглядит :-/",
				"added": 1501072135
			}
		],
		"2_1HF3NjGs1BbYbuWpjfTXyDtmQ1tvwfAXHG": [
			{
				"comment_id": 4,
				"body": "А идея оформления была заимствована с https://gateway.ipfs.a0z.ru/ipfs/QmVcZCm1kDkUnkdpszhAnEWLnqSrLPQKVVkDkbWYgaGLEs/00.%20README%20%28аннотация%20и%20комментарии%29.html ? ;) (и, кстати, тогда это очередной кандидат на пополнение — только мне лениво было по каждой книге расписывать).\n\nДа и название Wiki/Talk ассоциируется прямо с http://127.0.0.1:43110/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:8:Изба-читальня.+«Досье+Дрездена»\n\nЯ смотрю, кто-то с Авиабазы пришёл? Это ж там сабжевая книжка была только что анонсирована и ссылка на неё же ведёт :D Маска, я тебя знаю?",
				"added": 1501069538
			}
		],
		"1_1HF3NjGs1BbYbuWpjfTXyDtmQ1tvwfAXHG": [
			{
				"comment_id": 5,
				"body": "Я думаю, лучше выкладывать, всё же, в формате «одна книга = одна страница». Иначе громоздко с иллюстрациями получается. Или хотя бы «одна серия = одна страница».",
				"added": 1501070403
			},
			{
				"comment_id": 7,
				"body": "Всё, заглохло? :)\n\n(на самом деле, идею поддерживаю, помогу с оформлением со своей стороны, но позже)",
				"added": 1501599977
			},
			{
				"comment_id": 8,
				"body": "> Книги выкладываются в IPFS. Желательно в виде каталогов, с описанием и ссылками на обсуждения в ZeroNet и иных источниках\n\nЯ думаю, лучше использовать для книг ZeroUp (или прямо клон ZeroUp под книги сделать).\n\nIPFS в последнее время всё хуже работает: http://127.0.0.1:43110/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:28:IPFS:+разочарование\n\n...\n\nВообще, полгода уже прошло, авторы проекта куда-то сдулись, поддержки другими участниками нет. Никому не интересно сделать, пусть не Флибусту, но хотя бы просто библиотеку в ZN? :)",
				"added": 1517457938
			},
			{
				"comment_id": 9,
				"body": "Товарищ владелец форума, обнови движок до моего патча, можно будет картинки вставлять :)\n\nhttp://127.0.0.1:43110/15zr8fG5h9FZu6dt5CC9kQ1F7PMpiGu6Tm/",
				"added": 1525348993
			},
			{
				"comment_id": 10,
				"body": "> [dows](#comment_3_1HF3NjGs1BbYbuWpjfTXyDtmQ1tvwfAXHG): Так ок?\n\nАга, нормально. Только хорошо бы пересмотреть правила в Wiki :) А то у нас теперь и картинки на форуме есть, и ZeroUp вместо IPFS… Ну и дизайн у дефолтового ZeroTalk, честно говоря, не фонтан. Можно что-то более книжное придумать.",
				"added": 1525385767
			}
		],
		"1525497285_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 11,
				"body": "Ну, попробуем себя тут в оформительстве :)",
				"added": 1525497490
			},
			{
				"comment_id": 12,
				"body": "— Пока не скажу, — ответил Самманн, морщась. — Почти вся информация на эту тему — мусор.\n\n— В каком смысле «мусор»? — резко спросил Крейд. Он весь как будто ощетинился.\nСамманн оторвал взгляд от жужулы и с минуту заинтересованно смотрел на Крейда, потом ответил спокойно:\n\n— Кто угодно может разместить информацию по какому угодно поводу. Поэтому подавляющая часть авосети \n— свалка мусора. Её надо фильтровать. Системы фильтрования очень древние. Мы совершенствуем их со времён Реконструкции. Для нас они тоже, что собор для фраа Эразмаса и его братии. Когда я что-нибудь ищу, я не вижу информации по этой теме. Я вижу метаинформацию — то, что фильтрующая система нашла, проведя поиск. Если я ввожу запрос «аналемма», фильтрующая система сообщает, что информацию по теме разместили всего несколько отправителей, почти все с высоким рейтингом надёжности — инаки. Если я введу фамилию поп-звезды, которая только что рассталась со своим бойфрендом, — Самманн кивнул на спиль, где показывали заплаканную женщину, — фильтрующая система сообщит, что на эту тему в последнее время размещено очень много информации, в основном крайне сомнительными отправителями. Когда я ищу раскопки Орифенского храма на острове Экба, фильтрующая система показывает, что очень надёжные и очень сомнительные источники размещают информацию на эту тему медленно, но постоянно, на протяжении семи веков.\n\nЕсли Самманн хотел успокоить Крейда, то ему это не удалось.\n\n— Пример надёжного отправителя? Фраа в конценте?\n\n— Да, — ответил Самманн.\n\n— А кто тогда сомнительный отправитель?\n\n— Конспиролог. Человек, который размещает много длинных бессвязных постов, читаемых только его единомышленниками.\n\n— Богопоклонник?\n\n— Смотря о чём этот богопоклонник пишет.",
				"added": 1525498454
			},
			{
				"comment_id": 13,
				"body": "— После отъезда из Пробла я запросил доступ в некоторые сети, — объяснил Самманн. — Вообще-то они для меня закрыты, но я подумал, возможно, меня туда пустят, если объяснить, в чём дело. Мой запрос рассматривали довольно долго. Видимо, те, кто их контролирует, искали в авосети подтверждения моей истории.\n\n— Как это? — спросил я.\n\nМоё любопытство не понравилось Самманну — то ли он устал объяснять мне такие вещи, то ли хотел сберечь хоть каплю уважению к канону, который мы столь грубо нарушали.\n\n— Допустим, в столовке той собачьей дыры, где мы покупали зимние шины...\n\n— Норслова.\n\n— Не важно. Допустим, там установлен спилекаптор наблюдения. Он видел, как мы подходим к кассе платить за ту дрянь, которой нас травили. Информация со спилекаптора попадает в некую сеть. Тот, кто за ней следит, видит, что я был там такого-то числа вместе с тремя людьми. Есть способ выяснить, кто они. Один оказывается фраа Эразмасом из концента светителя Эдхара. В этом мой рассказ подтверждён.\n\n— Ладно, но как...\n\n— Не важно. — Тут, словно устав от этого слова, Самманн на мгновение прикрыл глаза и сделал новый заход: — Если тебе так уж интересно, скорее всего по мне провели асамору.\n\n— Асамору?\n\n— Асинхронный, симметрично анонимизированный, модерируемый открытый репутационный аукцион. Даже не пробуй разобрать. Сокращение до-Реконструкционных времён. Настоящей асаморы не проводили три тысячи шестьсот лет. У нас есть другие процедуры для той же цели, и мы называем их старым словом. Обычно проходит несколько дней, прежде чем в репутоновой колбе... не важно... произойдёт доказуемо необратимый фазовый переход, и ещё день нужен, дабы убедиться, что тебя не ввела в заблуждение эфемерная стохастическая нуклеация. Суть в том, что доступ мне дали совсем недавно. — Он улыбнулся, и льдинка с усов упала на кнопки жужулы. — Я бы сказал, что «только сегодня», но этот дурацкий день тянется не пойми сколько.",
				"added": 1525499006
			}
		],
		"1526564167_1HF3NjGs1BbYbuWpjfTXyDtmQ1tvwfAXHG": [
			{
				"comment_id": 14,
				"body": "Клёво, спасибо. Дочке переслал :)",
				"added": 1526641898
			}
		]
	},
	"comment_vote": {}
}