{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1519459714_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "It seems to me that the ordinary ls on Linux already does that, without any extra parameters. A command \n\n    ls > /tmp/foo.txt\n\ncreates a file with a list where everything has been sorted. To limit the list, you may use the grep command with regular expressions:\n\n    # An example that displays all lines that start with \"1D\". \n    # The \"|\" after the \"ls\" is a \"pipe\" that redirects the output of the \"ls\" to the input of the \"grep\"\n    # The \"-E\" after the \"grep\" is a command line parameter that tells the grep to use regular expressions.\n    # The \"^1D\" is a regular expression.\n    # The \"^\" in the regular expression marks the start of the line. It's a general notion, not grep specific.\n    \n    ls | grep -E ^1D\n\nThe following command makes the grep match every line:\n\n    ls | grep -E ^.",
				"added": 1519463065
			},
			{
				"comment_id": 2,
				"body": "> [test20180221](#comment_1_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): ls | grep -E ^. \" <--- what is it good for?\n\nIt's good for getting a different text layout at the screen, when not redirecting ls output to a file. The difference is visible, if You compare the console outputs of \n\n    ls\n    # and\n    ls | grep -E ^.\n    # without redirecting any of them to a file.",
				"added": 1519464012
			},
			{
				"comment_id": 3,
				"body": "> [test20180221](#comment_1_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): I am a master of bash command, but a poor guy in zeronet directory structure.\n\nI'm also still learning about the ZeroNet, but I found the following documentation very useful:\n\nhttp://localhost:43110/1Docsfk5uLvuXkL4U13eYDxCm2gzi1fNQq/",
				"added": 1519464091
			},
			{
				"comment_id": 4,
				"body": "> [test20180221](#comment_3_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): Try this one: ls -1 | egrep -f <(ls -1 | sed '0~2 s/.*/\\$/')\n\nThan You for the reply and thank You for the interesting example. \nI guess, different people do have different ways to process text :-D",
				"added": 1519555818
			},
			{
				"comment_id": 5,
				"body": "> [test20180221](#comment_4_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): ls -lhtra | cat\n\nIf You place the following line \n\n    alias llls=\"ls -lhtra | cat \"\n\nto a text file witht the path of \n\n    ~/.bashrc\n\nand start a new Bash session, then on a Bash shell You can type \"llls\", without the quotation marks, and hit enter to execute the same command.",
				"added": 1519574013
			}
		],
		"1519616295_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 6,
				"body": "@test20180221\n@balancer73 \n> ... You forget that this is the West that first started from Russia to create the image of the enemy. ...\n\n\nI as an Estonian, born in 1981, DID NOT ENJOY THE SOVIET UNION, despite the fact that thanks to being born after the greatest repressions had ended, I saw the best version of it. The way I understand, there is no family of native Estonians that does not have any of its relatives deported to Siberia or just plain executed by the Soviet regime. Unlike Germany, where the mainstream political parties and most of the population have departed from the Nazi past, the Putin's Russia adopted the anthem of the Soviet Union to be the anthem of Russia and many Russians dream of communists, the very party that shed so much of Estonian blood, as something nice, smart, helpful.\n\nMy grandparents, who saw the 2. World war first hand as children, used to joke that Hitler killed only Jews, but Stalin did not bother to select its victims and sent also many ordinary Russians to the concentration camps, in addition to Estonians. Here's another example, where Russia, and I mean RUSSIAN PEOPLE, not just the political elite, has FAILED to depart from the Soviet bloody past:\n\nhttp://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/?Video=1519691399_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p\n\nYou may argue that the cited video clip can be Western propaganda, because it originates from the \nhttp://spymuseum.org/\nhttps://www.youtube.com/user/IntlSpyMuseum/videos\nbut You can not argue the fact that Putin has adopted the symbols of the bloody Soviet Union to be the symbols of Russia, withe the exception of the red flag. Nor can You argue that Estonia got occupied by the Russia. Estonians VOTED to join the European Union, but were TAKEN BY FORCE to be part of the Soviet Union. \n\nTHE THREAT OF THAT REPEATING MAKES RUSSIA/KREMLIN THE MAIN ENEMY OF ORDINARY ESTONIANS!!!\n\nNow, add the Putin's adoption of Soviet symbols and all the talk about the \"good old times of Soviet Union\" and MAY BE You'll get the picture.\n\nWhat regards to the problem that the Yeltsin's 90'ties was a mess and Putin was the man, who brought order to Russia and organized food to shops, then I agree that Putin deserves credit for doing a fine job and really did help ordinary Russians during that time period. Hence the impression of ordinary Russians that the \"democracy\" is a mess that ends up being violence and hunger, but a strong man in the Kremlin provides food and order. It's difficult to explain to those simple minded Russians that the reason, why Estonians were able to avoid most of the mess that the Russia had was due to the fact that the Estonian culture, cultural norms are very different from Russian culture, cultural norms. We also had a mess, but it was never as bad as in Russia and if You compare modern Russia, IN AVERAGE, not just the elite places like the Red Square surroundings and old town of Saint Petersburg, then clearly Estonians are richer, live a more prosperous life and it's not just due to money flowing in as foreign aid from the West, because Estonians are economically better off than many of the former Soviet Union satellite states that have been part of the European Union about as long as Estonia has been. That is to say, Russians should not blame the Kremlin for all of the troubles, nor is it true that a strong man in Kremlin is a necessity to have a relatively prosperous life. If a dictator would be a prerequisite for the wealth of ordinary people, then the Putin's Russia should be much richer (per citizen) than Finland, Sweden, Switzerland. The Swiss have DIRECT DEMOCRACY, which is even better than the Estonian democracy. Here's another video about Russian economic troubles:\n\"Problems of Modernization in Russia - Loren R. Graham\"\nhttps://www.youtube.com/watch?v=HFSDVrnAXZI\nThe Chinese are laughing at Russians, because supposedly \n\n    in 2016 the \n    RUSSIAN LABOUR IS CHEAPER THAN CHINESE LABOUR:\n\nhttps://www.youtube.com/watch?time_continue=300&v=2sBYzJTTQJA\nDuring the writing of my current comment it's year 2018 and You all read the opening posts of this thread. I hazily remember that one of the dark jokes at some video of the \n\"Center for Strategic & International Studies\"\nhttps://www.youtube.com/user/csisdc/videos\nwas that \n\n    at some point the ordinary Russians \n    have to start \"believing their refrigerator\" more \n    than the propaganda from the Kremlin propaganda channels.\n\nYou'll probably enjoy this video:\n\"Russia’s Post-Authoritarian Future: A Conversation with Ksenia Sobchak\"\nhttps://www.youtube.com/watch?v=bcZsQN2J4XU\n\nAs of 2018_02 I believe that Putin could get Russian economy somewhat in track by allowing young, patriotic, Russians to speak freely and create start-up companies and upgrade the Russian economy, but currently the trend is certainly BRAIN-DRAIN. Supposedly the most devastating issue to Russian economy is that the old oil and gas fields are depleting, but to start using new oil and gas fields, a considerable amount of investment is needed to build the new drills and infrastructure to the new oil and gas fields. If the oligarchs do not invest to Russia and the money of STUPID WESTERNERS can not flow to Russia due to the Western sanctions on Russian financial sector then at the situation, where the Russian's state reserves are also depleting and it is not possible to increase oil and gas production to make up the descend of oil and gas prices, the situation is going to get even worse in the near future. Add to that the European trend of adopting electric cars and buildings that consume almost no energy for staying warm, the demand for oil and gas at the transportation sector is ON THE DECLINE. If the demand is on the decline, but the supply is increasing due to the opening of new oil and gas fields in Canada, then the global price of oil and gas is going to decline.\n(A glimpse to the \"old good times\".)\nhttps://www.youtube.com/watch?v=EucLgHzuZaw\nThe prerequisite of the \"пока в россиа ест нефт...\" is that the oil and gas can be extracted, but Putin does not have the money to build the drills and the rest of the infrastructure to compensate for the depletion of the old oil and gas fields. With Putin's authoritarian regime related BRAIN DRAIN he can not get cheaper replacement technologies from Russian development teams/scientists either. The CSIS panelists have sometimes used the expression \"containment policy\" to describe, what the West has to do with the nasty mess that the Putin has created.\n",
				"added": 1519692378
			}
		]
	},
	"comment_vote": {}
}