{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1571697285,
			"title": "USA VS IRAN",
			"body": "it's not just a war. it's the future of mankind. if USA wins, it will be dark medieval middle ages again. let's hope we loose, cause we are the evil ones. To our soldiers i say: don't go. It's not our war. It's not a right war. It's a wrong war and we are on the wrong side of it. To President Trump i say: don't! Save us all and don't go to war with Iran. Let the Saudi die cause they are of no use to us anymore. Stop the muslim invasion in Europe.",
			"added": 1571697284
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1571500913_1KoioT6zYAXhg2NvChNtZvSU7fx5FhRW1w": [
			{
				"comment_id": 1,
				"body": "help for what?",
				"added": 1571519049
			},
			{
				"comment_id": 3,
				"body": "> [edgelordofdecent](#comment_182_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): He is a pedophile and he needs help treating his mental problem.\n\nwhy it's a problem?",
				"added": 1571524461
			},
			{
				"comment_id": 4,
				"body": "the Germany government is validating marriages of immigrants MUSLIMS who married when the spouse was a child, as if the child was CONSENTING. In Africa and in Europe, thousands of young girls gets genital mutilation (it's called infibulation) with the will and consent of their very own PARENTS. In such EASILY VERIFIABLE cases, those children are NOT taken away from the ABUSIVE family. All considered, perhaps anal soreness is not such a big issue for kids born in today western 'civilized' society. Maybe a life of pain and mutilation, a life of constant and everyday RAPE, is a bigger issue which the western 'civil' governments and super advanced technological police are NOT addressing as they REALLY SHOULD. While the police is hunting for online pedophiles, the governments are granting 'asylum' and total amnesty to millions of MONSTERS, RIGHT NOW!",
				"added": 1571605665
			},
			{
				"comment_id": 5,
				"body": "if you like kids, go fight for their freedom and for their happiness. In the meantime, i'm sorry, i don't have any child pornography to share with you.\n\nhttps://www.dw.com/en/child-marriages-in-germany-present-a-challenge-for-authorities/a-50540043",
				"added": 1571607715
			},
			{
				"comment_id": 6,
				"body": "> [anonymouslogin](#comment_52_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Speaking of genital mutilation, what about all the boys in Christian countries that are circumcised every day? Circumcision, a nice word for mutilation of the penis.\n\nyeah. that too is mutilation. it's barbaric. must be stopped.",
				"added": 1571609612
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_1144_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Mainly the elite pedophiles.\n\ni don't think so",
				"added": 1571613950
			}
		],
		"1567666768_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 2,
				"body": "a dictatorship can be better than a democracy and vice-versa. it all depends on the people.",
				"added": 1571519619
			}
		],
		"1571581867_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "there are bacteria that feeds on plastic and there are ways to neutralize the radioactivity left by nuclear waste. the world human population is growing, and THAT is the real big issue. we are too many. the world is too crowded. china has already implemented the solution. you can give birth to just so many children. after that there is sterilization.",
				"added": 1571614486
			}
		],
		"1571722926_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 9,
				"body": "bad things happen all over the world. why the sudden interest on what happens in china?",
				"added": 1571783935
			}
		]
	},
	"comment_vote": {
		"10_14TR5Msgnb1MBKGayKiDB7j3aFdGrFUqdf": 1,
		"54_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1
	}
}