{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1535195491,
			"title": "What's the purpose of `ajax_key` in `sites.json` in /zeronet/data/ ?",
			"body": "What's the purpose of `ajax_key` in `sites.json` in /zeronet/data/ ?",
			"added": 1535195490
		},
		{
			"topic_id": 1535684571,
			"title": "PGP with ECC. Any compatibility problem?",
			"body": "I'm thinking of moving from RSA to ECC for my private key. \nWill there be any problem in applications' resolving the contents signed by ECC private key or encrypted by ECC public key? Those applications could be thunderbird or old gpg, etc.\n\nI learned ECC is far better than RSA after studying about bitcoin private key generation after reading [Kaffie's comment](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1528039084_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W#comment_625_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh).",
			"added": 1535684569
		},
		{
			"topic_id": 1549332954,
			"title": "How to type japanese on Linux",
			"body": "http://127.0.0.1:43110/1GrwWFTmrKgUGQsGxrKSsRbb2dt8UJaBPN/?Post:27",
			"added": 1549332951
		}
	],
	"topic_vote": {
		"1524319795_1HxUKSYDs4WbDV49HdUTHGebweoUaZyP3G": 1,
		"1535195491_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1519759218_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1544138092_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"1533555669_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1547562197_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1548340406_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1544289028_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1545125003_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1549299553_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": 1,
		"1550135195_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1550331862_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1552755084_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1553845855_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1528386725_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1557218232_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1558431741_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1559717681_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1561847289_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 32,
	"comment": {
		"1524319795_1HxUKSYDs4WbDV49HdUTHGebweoUaZyP3G": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_13_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Here is one vote for Google, unsure how valid is that. Somehow i tend to prefer Google over duckduck as it seem to me that it returns most relevant results, though it is a subjective opinion. I do not care much if google knows what i am searching for and what sites i visit. [...]\n\nGoogle is scanning ur anatomy and gives the collected data to NSA. \nGoogle users are monitored like a wild animals in Savana like animals are monitored by scientists. \nTags u, makes report about u, and organizes those information for the private society which is never known to you.",
				"added": 1534330475
			}
		],
		"1534502068_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "what's the difference from rsync??",
				"added": 1534512507
			},
			{
				"comment_id": 3,
				"body": "> [ssdifnskdjfnsdjk](#comment_24_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): public IP in order to connect other user\n\nDo you mean that Dat: can connect to the one under smartphone's wibro network? \nFor example if I turn on my smartphone in the middle of nowhere there's no wifi so that it's placing itself under the subnetwork of the APs which the mobile company installed everywhere. In this case, you don't have a fixed IP address, so technically no one can connect to your smartphone's or smartphone tethered PC's server. \n\nDoes Dat: work even in this scenario?",
				"added": 1542684613
			}
		],
		"1534666160_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "Stop using Microsoft Windows.",
				"added": 1543880692
			}
		],
		"1544138092_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 5,
				"body": "Plz show me a simple proof-of-concept example :)",
				"added": 1544155714
			},
			{
				"comment_id": 6,
				"body": "> [daniell](#comment_1_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): Did you mean, zites working with Framework?\n\nIf possible, showing it with Zeronet will be great :)",
				"added": 1544245735
			},
			{
				"comment_id": 7,
				"body": "> [daniell](#comment_2_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe): Showing it with ZeroNet? Framework is already working on ZeroNet. What did you mean?\n\nI simply want to know what exactly Framework JS can do in practical way.",
				"added": 1544317987
			}
		],
		"1545064108_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 8,
				"body": "> [quantumworld](#comment_5_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): What tec? The USA does not make any smart phones domestically that I know of. Everything is made off shore.\n\nQualcom is providing made(or designed)-in-USA IC chips to most smartphones manufactured around the world.",
				"added": 1545096750
			},
			{
				"comment_id": 9,
				"body": "> [znnex](#comment_4_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Are people worrying about tech from the US too?\n\nU can choose between two. Made-in-China ones will protect u from NSA's surveillance, and vise versa. lol",
				"added": 1545096844
			},
			{
				"comment_id": 10,
				"body": "> [quantumworld](#comment_6_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): You know dam well they are both working together. Paper and pencil are your only option now to have any freedom from surveillance. I give it about 10 years before everyone is dead. We have some really bad people running things.\n\nu can still have z-80 to 80486 and PIC with tiny linux + wifi + zeronet.",
				"added": 1545099928
			}
		],
		"1533555669_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 11,
				"body": "With android OS, they collect more than those listed in the above post. \nYour GPS info, battery power usage, data usage such as through google DNS server, etc.\n.\nI moved to Ubuntu OS for my phone recently. [chk this](../Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm/1546570483)",
				"added": 1546733206
			}
		],
		"1550135195_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 12,
				"body": "Great article!",
				"added": 1550148473
			},
			{
				"comment_id": 13,
				"body": "What do u think of zeronet's protocol over tor? \nIs zeronet's packets are encapsulated in an extra encryption like HTTPS or SSH?",
				"added": 1550148540
			},
			{
				"comment_id": 14,
				"body": "[intercept thousands of private emails](http://archive.wired.com/politics/security/news/2007/09/embassy_hacks?currentPage=all) == [Rogue Nodes Turn Tor Anonymizer Into Eavesdropper's Paradise | WIRED - DeadSea Blog](../12XDghETTnMMsD4MxRhDZFxbnSq5yda3K3/?Post:18)",
				"added": 1550150133
			}
		],
		"1550309510_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 15,
				"body": "When I was on Windows before, I used to run Corpernic which makes index of file contents as well. \nI remember it was wonderful till I moved to linux.",
				"added": 1550310753
			}
		],
		"1550331862_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 16,
				"body": "> [robione](#comment_7_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): using USB is a bad idea. It's not meant for storage like this and it's very easy to corrupt your entire setup.get a used NAS instead to fill with HDDs.or build your own from an old computer with linux and ZFS.\n\nWhat's wrong with USB?",
				"added": 1550351165
			},
			{
				"comment_id": 17,
				"body": "IMHO raid 5 or 6 both are not good ideas.\nIt's just a HDD failure immune system not providing backup. Even though setting a backup system with raid 5 or 6, its efficiency of cost drops far worse. Even the writing speed is terrible. I'd recommend RAID 0 or compatible with backups. raid0 with 3 or more HDDs via USB 3.0 will suffice.\nWell scheduled periodic backup process will rather help better.\nWhy don't u try any cheap 4 bay HDD adapter?",
				"added": 1550353564
			},
			{
				"comment_id": 18,
				"body": "> [ssdifnskdjfnsdjk](#comment_51_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Because i found very well priced particular product in my country. My product of choice is external USB3.0 2.5\" (enclosed) HDDs (yes i want 2.5 because of lower noise mainly) and i do not want to break warranty by removing enclosures. So i was looking for USB solution. Which exist as i linked in my leading post.I also do not want to spend additional lets say 100-150 USD per HDD + additional lets say 200USD for the used NAS device.I agree that USB may not be as reliable as a NAS or as a HDDs mounted inside the computer, but i would add these drives to my backup power supply and into powered USB hub placed the way so it is unlikely i accidentaly disconnect drive/s. [...]\n\nI'd like to say that sometimes a bit delayed backups in a different physical set of HDDs help the situation especially when the data being destroyed by your mistake not by the accident.\n`Oh, what did I do??? I have to recover them again.. Huh.. ` :)",
				"added": 1550391929
			},
			{
				"comment_id": 19,
				"body": "2.5\" HDD is more stubborn against physical impact and quieter as u mentioned. And it's handy. \nBut speed and price per byte are higher than 3.5\"s.\nIf u're not a HDD carrying guy, there's no merit.",
				"added": 1550401794
			}
		],
		"1548340010_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 20,
				"body": "What is better than normal proxy server without VPN? \nRegarding IP leak matter, it seems rather dangerous, isn't it? \nIn case of proxy connection setting in browser, if the proxy server fails, the client also fails in connecting to any webpage or so. There can't be any real IP leakage.",
				"added": 1550582698
			}
		],
		"1552991484_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 21,
				"body": "I don't think it's anything to do with ISP in regard with Wifi connections.\nRather, it's something to do with maximum CPU & disk I/O resources which could be handled at once. \nYour VPS provider must have a setting which limits the both in their side. \nYou may need a kind of mirror site or something.",
				"added": 1552994436
			}
		],
		"1552755084_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 22,
				"body": "In Korea, in internet cafe, it is very common nowadays. \nNetwork storage server + 20 to 50 PCs are common and work seamlessly.\n\nBut in case of via-wifi access it doesn't work as nicely as in case of nominal cabled network connection.",
				"added": 1553034895
			}
		],
		"1555519029_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 23,
				"body": "U solved by urself. \nBut I used to install addons related to the tabs.",
				"added": 1555575854
			}
		],
		"1557218232_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 24,
				"body": "Useful when showing something to a group of people.",
				"added": 1557223431
			},
			{
				"comment_id": 25,
				"body": "Any possibility of controlling from linux PC?",
				"added": 1557225705
			}
		],
		"1558975127_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 26,
				"body": "> [robione](#comment_10_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): usually not an extension, but a tab.you can try OneTab and All Tabs Helper extensions.I have 1800+ tabs.\n\n[\"We use Google's favicon generator to retrieve favicons for each domain in your list, but only the domain name is used and the full URL is never disclosed.\"](https://addons.mozilla.org/en-US/firefox/addon/onetab/?src=search)",
				"added": 1558999257
			},
			{
				"comment_id": 27,
				"body": "> [robione](#comment_10_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): usually not an extension, but a tab.you can try OneTab and All Tabs Helper extensions.I have 1800+ tabs.\n\nLoadTabOnSelect addon is better I think. \nIf u get too many tabs on a window, open new firefox window and return the heavy window, then close the window. Once closed, push ctrl-shift-n to recover the closed window but other tabs except the focused tab not being loaded but still having their own tab titles displayed.",
				"added": 1558999425
			},
			{
				"comment_id": 28,
				"body": "> [ssdifnskdjfnsdjk](#comment_79_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): That is not exactly what i need. I think i would rather need Firefox to freeze already running tabs so it does not use CPU.\n\nThat's why you have to close a window with hundreds of tabs while leaving at least one window so that u don't need to restart firefox but you only need to ctrl-shift-n to reload the very window with such hundreds of tabs with the only focused tab reloaded while the remaining hundreds of tabs still frozen.",
				"added": 1559135397
			}
		],
		"1561466885_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 29,
				"body": "external power is required.",
				"added": 1561468801
			}
		],
		"1561738460_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 30,
				"body": "> [robione](#comment_15_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Looks like one of these maybe..https://www.tmart.com/M1-Portable-3G-4G-WiFi-Hotspot-IEEE802-11b-g-n-150Mbps-RJ45-USB-Router-Black_p364011.html\n\nWhat kind of site is tmart.com? \nWhere do they ship the goods from?",
				"added": 1561813029
			}
		],
		"1561847289_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 31,
				"body": "> [test1234](#comment_1_19ERc2S6kHyphuyhnY86ApE82G7LuFfgDy): There are plenty of web interfaces to YouTube [...]\n\nthat is a good one. \nIt provides download feature, too.",
				"added": 1561851923
			}
		]
	},
	"comment_vote": {
		"3_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": 1,
		"77_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"70_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"3_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": 1,
		"1_19ERc2S6kHyphuyhnY86ApE82G7LuFfgDy": 1,
		"8_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1
	}
}