{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"2_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 1,
				"body": "Működhetne (technikailag), demokratikusabb is lenne.\n\nEllenben azt ne felejtsük el, hogy ha a szavazás bármit is változtatna, akkor már réges-régen be lenne tiltva!\n\nNem picsogni kell, hogy rossz, hanem tenni ellene.. kezdésnek pl. minden politikusnak minden lehetséges eszközzel keresztbetenni (igen te pacifistakommunista forradalmár! a tesókád sem kivétel!), amikor meg nagyon picsognak, akkor természetesen kötélre velük!\n\n1 marék arcot meg kell hagyni, akiket kiküldünk nemzetközi tevékenységekre persze bombával  ellátva, hogy ha bármikor olyat mond, amit nem kéne, akkor fel lehessen robbantani.\n\nÍgy több pénz marad mindenre, valamint \"A\" politikus így megérdemli hogy \"köztiszteletben\" állhasson, és elgondolkozik azon, hogy mikor mit is hazudjon!\n\nAzok, akik szerint meg kell ennyi naplopó fizetett hazudozó, azoknak meg semmi de tényleg semmi joga nincsen sírni miattuk!\n\nÜdv minden pacifistának, libsinek,hithű szavazónak,kommunista forradalmárnak, meg kitudja hány elhülyített baromnak! Nézzetek körbe! az ember nem ilyen! az összes vértől írtózó gyenge szarnak köszönhető ez a herdálás és vergődés, amit demokráciának nevezünk!",
				"added": 1624800604
			},
			{
				"comment_id": 2,
				"body": "> [v9](#comment_1_1L7MVvN7SA5MeQNi1y82A9hy6kcJw69moC): Szerintem jó nagy hülyeség, egyrész mert lehetetlen interneten a szavazást megoldani, azt hogy ne lehessen meghackelni (man in the middle vagy vírusos gép), hogy a felhasználó azonosítva legyen, de a szavazata titokban maradjon örökre, hogy ne lehessen megvásárolni az emberek szavazatát, olyan problémák, amik az internet természete miatt nem tudunk megoldani.\n> Másrészt pedig nem jó az ha a nép kezébe adunk minden döntést teljesen, például ha valaki elég pénzt összeszed, hogy meggyőzzön mindenkit valami hülye kampnyról, akkor az úgyanúgy átmehet. Szerintem nagyon radikális döntések születnének!\n\nTechnikailag megoldható már nagyon rég! többit másik kommentem!",
				"added": 1624800721
			}
		]
	},
	"comment_vote": {}
}