{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "> [bigazero](#comment_4_1ArZkTMnKBVF12W16574xUi8h8eB4WtwBa): HELLO! New hand here!Reply me with interesting sites, Thank You!And I'm glad to seed your site on my laptop :)\n\n[Star Trek storylines diagram](http://127.0.0.1:43110/1NV2twiBAk1Tr1x8sRUZH9nRNvigFMZDyn/)",
				"added": 1562945766
			}
		],
		"1562989255_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 2,
				"body": "little less motivated today morning, but then I opened ZeroNet ;-)",
				"added": 1563012945
			}
		],
		"1562233720_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v": [
			{
				"comment_id": 3,
				"body": "cool. i've added my lan dns name (which resolves to all of my IPs on a multihomed lan) to trackers.conf. how do i know that they use me as a tracker?",
				"added": 1563022783
			}
		],
		"1563152650_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 4,
				"body": "i'm not entirely sure what do you propose. is your idea that a zeronet user who is able to access some Internet site, he can download content and forward it to some other zeronet user who can not access that Internet site?\nif so, it's not a bad idea by itself, but I'd make it not by an embedded feature, but by an zero app, or by a zite.",
				"added": 1563177480
			},
			{
				"comment_id": 5,
				"body": "> [filips](#comment_88_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Problem is that users can only save fronted of website.\n\nif i understand kai0's intention, that would not be a problem. it's about saving texts, news, and articles. just like WBM as you mentioned.\n\ni imagine a manual solution: 1) create a zite, 2) mirror the desidered internet sites in the zite's folder (using wget -r, httrack, or similar), 3) sign&publish, 4) let's spred :-)",
				"added": 1563181743
			},
			{
				"comment_id": 6,
				"body": "guys, i appreciate your effort. but, could not it be done in a more automatic way? eg. there is this \"follow query\" feature. you know, with which you follow forum topics, people on zerome, etc. and zerohello displays newsfeed according to it. could not it be utilized to automatically receive fetch-internet-site-for-me updates? do these \"follow queries\" run in the background? do you know maybe? or they only execute when you keep zerohello page in focus?",
				"added": 1563215822
			},
			{
				"comment_id": 7,
				"body": "as I'm getting understand the root issue (ie. geo-based restriction), I'm moving to standard web proxy solutions. why not just use Tor with exit nodes selected in the desidered country? or establish socks5/http proxy in the unrestricted country. optionally coordinated by zeronet features, but the socks5/http/web proxy solution does not require zeronet by itself. we might leverage zeronet to ease the establishment, eg. coordinate who wants proxy in which country, who able to and want to run such a proxy, etc.",
				"added": 1563356566
			}
		],
		"1563381859_1MU8er27jszWmguLydfKYxuaWQNXbQ9cyt": [
			{
				"comment_id": 8,
				"body": "afaik, and i'm pretty sure, zeronet does not support backend scripts like php, cgi, or any server-side application as most web developers learnt. all you have is client-side js and Zero APIs: ZeroFrame, UIServer, etc. Plus there is background processing module, which I have not studied yet, but certainly is not as permissive as default php runtime at random webhosting.",
				"added": 1563386936
			},
			{
				"comment_id": 9,
				"body": "an option for \"technically they can read but i still want to hide my precious intellectual property\" issue: obfuscate it! no just kidding. don't pollute the environment with obfuscated php code :)",
				"added": 1563742082
			}
		],
		"1564584559_1FvUoTBvkBv4vgfpxGLEu4ggPJje422K1y": [
			{
				"comment_id": 10,
				"body": "for 5, I vision a system for indicating trust level on zeronet objects, zites, users: it'd be like web of trust like we do it in GPG. you yourself set the trust level on users/zites, you own/fully-trust/limitedly-trust/know/dont-know/deny/etc. on a scale. But keep calm, not on every zite of course, that would be ridiculous :)\n\nMark zites which you are confident that you trust. for example your friend directly showed it to you.\nthe strength of this system would be that trust level propagate to you via people/zites you know. the more you trust a user the more weighted you \"get\" from his trustee. \n\nI try to model this system mimicing human in-real-life concept of trustness.\n\nfor example a zite's trust level (for you) is 0+10F/15K+50T/100K (for someone else it may be different), which means you don't know the zite directly (0), but 10 of your closest acquaintances fully trust (10F) and 15 other of them just simply know the zite (15K), and 50 less known people limitedly trust (50T) and 100 similarly known people just know the zite (100K).\n\nthe notation definitedly should be improved to comprehend easier. for example this distance-from-you/trust-level map can be graphically represented which people understand almost unconsciously.\n\nI very much want to develop people out of the current concept of trusting online entities. today we see green padlock and we're like \"what i read here is and was always will be _the_ _naked_ _truth_\" and when seeing gray/red padlock then \"i must immediatedly go away. i am in physical danger here\". probably you who read this lines here on zeronet, you are not people like this, and maybe i'm a little bit exaggregating, but you get the point. the 3-state \"traffic lamp\" concept of trustness is very misleading, a lie. Even for 2 people, the trustness of a certain 3rd party can be different: you trust in your brother-in-law in a certain level, but me as your coworker I trust him somewhat less. It's sensible way to describe online entities (in terms of trust) because it's the natural IRL way to do so.\n\nI admit my vision is incomplete. I call you to improve it. \n\nReturning to the trust level indicator, it may be enough to plot 3 layers (beyond you) to show trusted, known, and unknown people's trust level on a given entity, eg. on a zite. In the example above there are 2 layers plus you. In this way you straight see that how many of your closest acquaintances trust the zite how much, then how much the people they know trust the zite, and then come those people's credits who are in the 3rd grade of distance from you.\nTuning the details of the model and representing it in a good form makes the system very usable in my opinion.\n\nI hope I'm somewhat understood.\ncheers",
				"added": 1564650115
			}
		],
		"1564963792_17i73awrYG3UfPMGBeDo3J4XuadYwctRvz": [
			{
				"comment_id": 11,
				"body": "IMO it's generally more natural, more healthy, unless you step on something harmful obvoiously. I've flat foot (i dont know how it is called in English, it's goose-foot in Hungarian) and Unguis incarnatus (ingrown toenail) and it's getting heal when i'm on bare feet. walking on gravel floor I also feel more vital, I feel my blood circulating easier.\nBarefoot on streets, on public is not that viable here at my region.",
				"added": 1564992014
			}
		],
		"1565721593_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 12,
				"body": "why are there personal files in your zite directory in the first place?\nif you want to share a large portion of your directory tree without duplicate it (by copying it into the zite's dir) and there are some files you dont want to share, I recommend to make hardlinks (given that you are on linux/mac).\nhere is my script doing the same for me (you need an extension to exlude personal files) :\n\nzeronet://15YojpsjvfowC2Jixt1VT9Nvocu8wUMNAL/sitetool/hardlinkmirror.pl",
				"added": 1565728545
			}
		]
	},
	"comment_vote": {
		"92_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1
	}
}