{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1617620698,
			"title": "Are you still in pedocuomo feodaldom? ready to be jailed as health risk?",
			"body": "why didn't you leave NYC (new york) now as it's clear cuomo after killing in the nursing homes, is applying the vaxxnazi camp system?\n\nwhy?",
			"added": 1617620697
		}
	],
	"topic_vote": {},
	"next_comment_id": 42,
	"comment": {
		"1617530919_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 1,
				"body": "> [certy](#comment_5_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif): beware, we kill, dogs, cats, bats, what ever... and the children of our enemies, like you do... [...]\n\nIt won't be murder, it will be called late term abortion... fair and just. After what I read, she wants our children dead, so will hers be.",
				"added": 1617556545
			},
			{
				"comment_id": 2,
				"body": "> [madmapguy](#comment_1_1Nwe65XRmStoLy6EzyU4NKVmDUdrzkviB9): Is it possible to be an anonymous here? And how here we can fight with a spam message or so?\n\nyou can, but then come the death squad, to find the husband and children of Dr Wen, to murder then, and eventually feed them to her, until she shit them... then once she has shitted her whole children and family, she will have her last little moment of fame, for her death interview and shot like an animal.\n\nyou want war, you get it.\n\nbut not your way\n\nthe hard way\n\nthe only way\n\nthe eternal laws of war applied and executed...\n\nexpect to live through what wouldn't even be believable by hollywood...\n\npity weakness\nmercy weakness\n\nyou can't appreciate the beauty of silence wars, so be it...\n\nat least you will be.",
				"added": 1617567502
			},
			{
				"comment_id": 3,
				"body": "you know I believe most white americans are moralists trash, worthless and useless in a real battlefield...\n\nhowever my niggas and their latinos friends + the real asian american... there we talk...\n\nit's different combat style, but at the end, a Dr. Wen and specially her children are really just meat...\n\nmaybe it's the real native spirit...\n\nwhiteys are too fucked up, with morals, ethics, and are only bitch slave of wicked females...\n\nmy little people there?\n\nthey got the red game :).",
				"added": 1617567621
			},
			{
				"comment_id": 4,
				"body": "and what's make me uber laugh with dr wen are her buddies, is that they believe you make A2 illegal and it's gone? gooo... try to censor in the nigga hood... goo cnnn.... pfff... they don't dare...\n\nwhy?\n\nno lense policy.\n\nshot a will\n\nthe white bitch, the slink bitch, the what ever bitch, it's fucking clear... outsiders, die or leave.\n\nbecause they believe we don't keep their gated community they can shit on us?\n\ndon't forget, \n\nwe I say to niggas\n\nI don't be a slave\n\nsome may say, I want you to be mine\n\nbut most say nothing...",
				"added": 1617567778
			},
			{
				"comment_id": 5,
				"body": "why? because you need to talk to those you are gonna kill... ! cool we share the same objective---\n\nand if you think bitch from the cia or fbi or even dod.... ahahha never been to the hoods in travels?\n\nahahaha...\n\nyou don't understand...\n\nhip hopers are just 0.00001%...\n\nfear \n\nfear of what?\n\nto become a fucking captives like all those whiteys and bounties.",
				"added": 1617567870
			},
			{
				"comment_id": 6,
				"body": "These stories made me laugh... it's mostly in occupied irak (due to the more main core nature of the first wave of the combat operations)...\n\nso it's the story of the \"owen shroyer\" and all those little whitey from the campaigns and or white suburbs, passing by the \"black barracks\"...\n\nand they asked, like fucking muppets, what are those colors / tags outside...\n\nand the more \"veterans\" said something along :\n\nit's the gangs...\n\nwhat do you expect bitchboy? a ww2 movie?\n\ngethos ruff...\n\nbtw never seen \"blacks\" vets in the infowars propaganda...\n\nI guess the brainwashed muppet are too afraid to see killers... blacks :) or as we said, with high melanin skin content :).\n\nand after all those whiteys are real gays...\n\nthey don't understand the mind set to break free from slavery...\n\nhard.\n\nand if I gesticulate like a dead worm, is because I see the corral and I feel the collar...\n\nand those whites and others bounties are so fucking dumb....\n\ntheir faith fucked them\n\nand worst it's trough their faith the enslaved africans.... \n\nwe know, they know\n\nthey can kill malcom 10 times if they wish...\n\none. among many\n\napes\n\ntogether\n\nstrong",
				"added": 1617568481
			},
			{
				"comment_id": 7,
				"body": "i am sure I would live hapilly after spraying (with a super no recoil arm) wen and her family... I almost think it's the good blooding candidate... but too low value in a sense :).",
				"added": 1617568539
			},
			{
				"comment_id": 8,
				"body": "for me wen are her like, those vaxxnazi are like ... not even eggs to break... like paperboard box that I have to crush for it to enter the trash... you see the attitude? on one side, annoying to have to crush but on the other funny :).",
				"added": 1617568622
			},
			{
				"comment_id": 9,
				"body": "and my big love are racist blacks who fight and kill for freedom... as long as they don't want to wear chainz again, or make me wear one, more power to them ! ps not the freedom like the fedcoat understand... like we do.",
				"added": 1617568731
			},
			{
				"comment_id": 10,
				"body": "so wen is like a cardbox to me...",
				"added": 1617568762
			},
			{
				"comment_id": 11,
				"body": "> [coplanar](#comment_6_1KZdUJK67R6bzE4w2tXQTvkKNfmsqubWoD): If you actually do it make sure you tell the police about this place. We could use some media publicity.\n\nLoL ! you understand really nothing... Leana Wen will be executed under the watchfull eye of the police...\n\nhere is why\n\nthere is 2 real outcome\n\none the pedo vaxx nazi feodalists win the first battle... good for them leana will maybe have a grand children.\n\ntwo the pedo vaxx nazi feodalists lose the war, leana get murdered with her offspring.\n\nthere is no middle way\n\nunderstand one thing\n\nleana is right now farming american goyim...\n\nremember we are 1.4 billions people in PRC (china)... aka we are over 900'000'000 over the Guide stone Agenda (GSA) 500'm for the world...\n\nso leana will try later to pivot toward US.\n\nwe will kill her, and all that would dare to stand in our way.\n\nremember you are a round eye\n\nyou let your kids be raped by vip on island\n\nfor the children of china...\n\nwe go full...\n\nyou don't understand white filth what it means when the People Liberation Army of China structured in the current way engage....\n\nyou don't understand.\n\nyou come for the CoC, you will meet the walls of hell...\n\nhell...\n\nno\n\nlimit\n\nwhat so ever.\n\nbeaware of the grey and white haired chineses...\n\nthey may look old\n\nbut to die for the CoC\n\ndone.\n\nyou don't understand white filth who consider kids to be rape toys for your ruling feodal class...\n\nyou don't...\n\nand if you need to learn by dying, so be it.\n\nand that include all your front lines, all your intelligence, all your police, all your civilians, to the last one of what would be called, you.\n\ndon't fight a 5000 year continuous civilization...",
				"added": 1617612203
			},
			{
				"comment_id": 38,
				"body": "> [bortbortbort](#comment_21_16e6K52Q1xLbhxAFrLeXvDjS5q8QhQ4eQm): she should be launched into the sun for suggesting this communism, show me your papers shit.\n\nI know... However it's too costly, imho. I find execution simpler, faster and way more cost efficient. I am not against a clean kill if eventually some of her organs may have value to others :).\n\nEC, enemy combatant :).",
				"added": 1617942408
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 12,
				"body": "You are so pathetic, you are like rain a sunny day on the feather of the white pigeon :)...\n\nforget it...\n\nnow...\n\nWe hope that the injection isn't doing side effects, now or later.\n\nWe didn't saw a single word of lavrov speech, but the little extract on ZH about the white racism in the west.\n\nand I would like to add a few things...\n\nas you know I like babich... often on lavelle shows...\n\nso it's about the comment on ethnizing the western \"new\" ideology...\n\nI agree that's it's not a question of ethnicity.\n\nit's however to my mind a problem inherited from the roman church belief to be the herder of a herd... or the flock of the believer concept\n\nin the sense that western state have taken this role, and rather than to seek or prepare for salvation with out respect, tolerance and love like the roman organization shall have done...\n\nare implementing the pedo feodal colonialist eugenicist project of their rulers...\n\nin short \n\n1. UNO / charter (where I again disagree with lavelle), kill this thing or revert to a real forum of discussion, but not of rule making.\n\n2. pedo feodalist colonialist, there there is nothing to do but to defeat their front line and then plow through... I know it' s hard for those who saw their front line massacred to now face the STORM, but it's about marking... \n\nthey wanted contact, now they got it, and the next time they may learn (as the goal is to leave once smashed) that it's less costly to fight inward their leaders than to get plow through.\n\nfinally. the GSA (guide stone agenda), we know they seek to kill at least 900'000'000 chineses. we oppose and will act on this opposition in an unrestricted way...\n\nI hope it's clear to everyone, not a threat, a warning.\n\nside with the GSA > die.\n\nand with erasure.\n\npeace!",
				"added": 1617620623
			},
			{
				"comment_id": 13,
				"body": "but to revert on the ethic component...\n\nI am curious if there isn't maybe a component\n\n...\n\nlet's say that their current financial system implying the condition of the hypergamic condition for the realization of reproduction (nice way to say it , isn't it)\n\nmay lead in reality to a ethnic problem...\n\nor let's say it's a specific part of the whole ethnic who is allowed to breed, and as such, lead to a leadership ethnic problem...\n\nI know, it's maybe hard to hear...\n\nfor me hypergamie is a science, in progress, but none the less a true antropological science, even the most advanced field in the domain... but not for the white knights :).",
				"added": 1617621024
			},
			{
				"comment_id": 14,
				"body": "And I forgot my main point, if Russia Can Remain A vaxx free country (individual choice, aka my body my choice), I believe it will be important to have training camp, for the foreign corps...\n\nwe understand what the west is (now, if it makes you more comfortable).\n\nwe know one thing, against the vaxx nazis we will have to fight, and win.",
				"added": 1617625865
			},
			{
				"comment_id": 15,
				"body": "if...",
				"added": 1617625873
			},
			{
				"comment_id": 21,
				"body": "gaznief (aka murad), the \"tartar\" terrorists, and human right watch.\n\nmy move? find the top 10 families working for HRW, and murder all their children. \nthen find the top 10 donors of HRW, murder all of their children.\nthen wait for counter strike\nbuff and kill more, or may be they surrender.\nI don't exclude multi tapping in funerals.\n\nwarfare is total or none.",
				"added": 1617629392
			},
			{
				"comment_id": 22,
				"body": "too violent? noo... too lenient.\nwhat would staline have done? (lol, because, omg it's would have been violent... and violent as an understatement... because it would be really peacefull, in a sense..., aka when staline orders, it goes... where ever).",
				"added": 1617629478
			},
			{
				"comment_id": 23,
				"body": "but if staline orders, to say : may god have mercy on those on whom it will fall, is always appropriate...",
				"added": 1617629523
			},
			{
				"comment_id": 24,
				"body": "Nice tanks (I just saw the tanks on trains, and it's true, that it is very chilling...) and then :\n\nthe pedogen : https://www.zerohedge.com/geopolitical/biden-administration-alert-over-russian-saber-rattling-eastern-europe-arctic\n\ncouldn't help them selves...\n\n>The Hill is reporting that the Biden administration is \"on alert\" due to what it describes as Russia's \"saber rattling in Eastern Europe and the Arctic\" - particularly following last week's Russian troop build-up in Crimea and near Ukraine's border. \n\nAnd I won't read any further. those are PEDO COLONIALST FEODALISTS which I hope one day will be all exterminated with specially ALL THEIR OFFSPRINGS.\n\nthey protect pedos, have no words (eastern expansion) and seek to reduce us to serfs, while stealing elections, while... \n\nyou know, please cite one good thing?\n\nnothing.\n\nnothing.\n\nI was fooled... it's not fun or pleasant to have to admit it... that's it. moving on.\n\nwith their gmo franken food, their autism rate, their cancel culture, censorship, pro UNO anti bill of rights...\n\ntheir occupation of the middle east, their inability to even win wars...\n\nwhat is this shit?\n\nand the worst, no one to wake,... no one.\n\nif right now I had my space ship... I am not angry, but I would still take off... \n\nwhat those fucking fly don't get is that nothing they have or will ever have (like a million research at least) would be able to pass the spacecraft shields and what's not... \n\nwhat I know is that with them it's only power... you kill them, they obey, you can't, they rape you.\n\nand with my spaceship...\n\nthey will dance...\n\nsadly... my aliens friends.... are lost in the universe, apparently...\n\npersonally I ask myself if an indian+china+russia+islam coalition wouldn't possible to kill the american military and intelligence... \n\nthere is only that. \n\nviolence.\n\nor we are the indians (native americans), or they are.",
				"added": 1617640297
			},
			{
				"comment_id": 28,
				"body": "What I don't get, is why NATO doesn't understand that it's better for everyone to have ukraine as a neutral buffer and bridge between the eu/nato and Russia...\n\nAs they don't want to get it, and as I don't like the classical \"noble\" war approach, why isn't the whole family of nudelman dead? that's for me a tactical mistake, in the sense that by killing them all... specially the husby first, kids next and her last, it tells the washington / fake zionists a clear message.\n\nfuck with us, we fuck with you.\n\nFurthermore, as the Ukrainians seem unable to understand the wide issue, they can't join NATO, they have to be plow through...\n\nI don't believe in the ukrainian army can wide stand a full on assault of the russian forces... the goal isn't to occupy beyond the reunification of the LR and the others which name I forget... but simply storm front, sneaking around cities, to drop a russian flag of the western most part of ukraine and return, eventually to repass...\n\nThe idea is quite simple, and not that impacting for civilian population specially if done just now, move to the west of ukraine wiping all resistance in non civilian areas with massive force and return to russia while keeping D and L republics.\n\nI believe that most of the ukrainians forces will hide in civilian areas, and those who seek to fight russian main core, will experience the beauty of asymetric war.\n\nof course while constantly reminding the enemies, that they can always become \"family\" again, if they wish, but more importantly first understand that NATO is NIET.\n\nI would expect a 20% loss of life in the whole ukrainian army... at the first pass.\n\nagain, at one point what can they do, when russian main battle core storm, hoping from around cities, while wiping any military installation, and then leave?\n\nI mean it's an humiliating defeat, while sparing civilians which may lead them to be more aware of the geopolitical reality surrounding them.\n\nand more importantly make them realize that the pedo feodalists expansionist dream turned into a nightmare...\n\nOf course it's hard to move near and around armed civilian areas, however in a main core battle spirit, it's another great opportunity to train live...\n\nI wouldn't call that confrontation, but diffusion... \n\nhowever it hangs in nato troops not intervening...\n\nin this case retreat to before hot ground\n\nto prepare real war.\n\nhint to american and western forces : never experienced direct and intentional nuking on your troops? \n\nremember, you don't fix the duration of war, neither the type of weapon used, and even less the prime targets (first just ukraine to stop you, then your main cities).\n\nremember in MAD you can't make your pedobucks gig mic play... \n\na simple question : how many tanks can a satan 2 deployed take out? we speak in, maybe even, 100's of square miles... \n\nand don't forget there are heavy short range non space ballistic based wmds... remember the goal is just to reach beyond the blast horizon... \n\nwouldn't be rather more profitable to wipe the pedo feodalist internally rather than engage RF?\n\nand if pla decide to join for a live training...",
				"added": 1617697121
			},
			{
				"comment_id": 31,
				"body": "We are facing the storm ! how to win ! No, I am not speaking of the outer rings.\n\nBut this fanatik domestik insurgency... What I am talking about : those pawns who don't seek policy but individuals (aka navalny groupies).\n\nthere are many ways...\n\nbut here what I propose :\n\n1. financial referendum at the local level ! beam. why? because it is a REAL subject of debate and participation on one critical issue : the public pursue. ahahah ! It fusion the war on the corruption, it permits a democratic really valuable involvement and it's the people money. first a budget vote at the domestic level to know if the people approve it or not, and secondly a sepcific value threshold to approve or refuse (a new fire fighter center or a swimming pool). and what I love in it, is that it breaks all the \"party\" line or \"cia\" plays... what can they do, who ever they are, loot what? and that's why it's not praticized in the so called \"liberal\" west. I think it's an excellent idea. Can have an incompressible core (to not enter in defund the police trope) but for so called discretionnary items (school renovation or the police station?) it's AMAZING. think about it.\n\n2. Cannabis... at least 10 plants among a set of strands approved by the health authorities (at least 100) so that PEOPLE, specially old can enjoy self growing of healing / sleeping / analgesic etc plants safely at home... again it will add some \"spice\" in the cia opposition play, in short cut the grass under their feats.\n\nOf course there are I am sure many various ways in the KGB play book, but I really like those 2, by one it's participatory nature (maybe it will a nursing home focus first and then... blah blah), and the self reliance / ag etc. very cool indeed !\n\nof course granny the corrupt and her tax imperialism to loot more than 7 millions next time, OUT !\n\nas much as I am a core fan of defense russia, I believe too, that all don't share the war aspiration of the red army, meaning, not to fragment , but to expand :).\n\nanyway... \n\nDo I dream? don't it? who knows what the future holds...\n\nps russia has a lot of enemies, and babich wasn't at his physical best of aljazeerha, more sleep (I mean physically) :D.",
				"added": 1617821452
			},
			{
				"comment_id": 32,
				"body": "let me be clear... the last refuge must not fall !!! and I have no fear from the \"barbarians\" those beyond the outter rings... I fear the inner domestic metro sexual and other various pussies whiteknights / dreamers / utopists... they won't last a second against the professional RAID teams of the western pedofeudalists and due to their isolation by the defense forces, they have no fucking idea... specially the wannabe travellers who saw the eiffel towers, but never saw anything else, or understood anything else but what was presented to them...\n\nI see them as ultra weak, in their defiance and arrogance, they are meat for the CIA and co... meat... on legs.... brainless/brainwashable, and killeable... butter... and worst their arrogance and ubris is so total, that they won't have the iq to realize, I don't speak about honesty which they totally lack to even admit they are being cucked, and I weight my words, but american on steroids... because even the worst goyim cattle feel something is going wrong... we are far from maga...",
				"added": 1617821852
			},
			{
				"comment_id": 33,
				"body": "there is one thing I have a problem with it's the \"intelligensia\"... how to say it , babich, the iranian... not the religious, the other, I mean the one always in russia (meybe he is russian), etc... no problems, like the victims of benghazi, nice people... no problem... but the so called \"metro\" or \"brainwashed educated fools\" like the one on aljazeera... I prefer to be with the ukrainians... allergic reaction. ahhhhhh.... nnnnnnnnnnnnnoooooooooooooooooo.",
				"added": 1617822061
			},
			{
				"comment_id": 34,
				"body": "if I may they are the enemies of buffy (who fight the vampires), aka they are the vampire... I didnt watch the show with the vampire etc... I don't know how to express it... repulsive and repulsion...",
				"added": 1617822138
			},
			{
				"comment_id": 35,
				"body": "> [darkoo](#comment_31_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG): We are facing the storm ! how to win ! No, I am not speaking of the outer rings. [...]\n\npreventive \"warfare\", that's the key word...",
				"added": 1617822314
			},
			{
				"comment_id": 36,
				"body": "the suckers at the dod / cia they know it's too risky their invasion of russia... but gaining through the \"fallen\", ez...",
				"added": 1617822358
			},
			{
				"comment_id": 41,
				"body": "17/20 ^^.\nWhat is Lavrov breakfast? What is Peskov hobby?",
				"added": 1618253625
			}
		],
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 16,
				"body": "I would execute clarissa wards just before she is timed to leave. then offer her support staff, to eat pieces of her and shit then, for them to live alive.\n\nwhy I hate them?\n\nahahahha... stupid question, the question isn't if all cnn personals will be murdered (with their children) but by whom... \n\nI use the word murdered for the lulz, kill in war, mia, kia, what ever...\n\naka they live, we die\n\nthey die, we live.\n\neasy to chose.",
				"added": 1617625978
			},
			{
				"comment_id": 17,
				"body": "Why wait for this time point? because so her baiting role will have been completed... using the enemies, if \"funny\", just sad that some felt on the trap... be wiser.",
				"added": 1617626015
			},
			{
				"comment_id": 18,
				"body": "I am curious what do you think will the beasts do? eat pieces of her, and live, or perfer to die.... I don't know... science, cnn loves it so much... I hope they will love to be subjects for once, of it.",
				"added": 1617626157
			},
			{
				"comment_id": 19,
				"body": "furthermore I am curious what she or her support team carried, EW? BW? who knows... that's how I see them... the enemies.",
				"added": 1617626213
			},
			{
				"comment_id": 20,
				"body": "4 sure sw, social warfare...",
				"added": 1617626249
			},
			{
				"comment_id": 29,
				"body": "clarissa is still alive :/\n\nbut I say angor what !!! I mean the floating temple !!! omg !! very cool... floating ask the foreingers? yes, on wet sands...\n\nsplendid !\n\njust to say that I have no idea of the etnic components of myanmar... I don't even understand what Khmer means, but that according to this documentary build it... (impressive).\n\nHowever I know that the CIA and enemies of CHINA will try to rally those so called independent armed faction of myanmar against the UMM...\n\nhmmm... \n\nmy current (evolving) position is that china shouldn't enter directly the conflict.\n\nhowever, as the intention of those behind this destabilization and civil war are to target china, that thailand may become implicated...\n\nI start to believe that a participation in the aerial campaign (easy to deny) against not khmer territory, but in the border area and others ethnic rebellion start to present a great opportunity for live training...\n\nbut yeah, the western medias make it appears as it's escalating.... \n\nand that's what they seek...\n\nI didn't realize that the border between myanmar and PRC was so yuge...\n\nit's start to be annoying...\n\nthere are no refugees, to my position.\n\naka this is the chinese border... not an hotel.",
				"added": 1617697478
			}
		],
		"1617665358_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 25,
				"body": ">magnet:?xt=urn:btih:awksoovwotqfcmnhk73j6skkikc3iknk&dn=Facebook%20Leak%20%5B2019%5D%5B533M%20Records%5D%5B106%20Countries%5D&tr=udp%3A%2F%2Ftracker.pomf.se%3A80%2Fannounce\n\ncool thanks ! safe file? how big is it?",
				"added": 1617696154
			},
			{
				"comment_id": 26,
				"body": "Don't forget zerotechtalk : http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/",
				"added": 1617696199
			},
			{
				"comment_id": 30,
				"body": "> [stupidhorse](#comment_13_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH): 16.1 gigs, seems safe so far, just zips of text files.   I haven't looked inside the rars or 7zips yet though, still unpacking the full world here.\n\nnice keep us posted !",
				"added": 1617729447
			}
		],
		"1617523821_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 27,
				"body": "I would love that the videos aren't shared in pools, but that each can only seed the videos he wants...",
				"added": 1617696269
			}
		],
		"1617932358_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 37,
				"body": "A few years ago I solved this mental problem this way : I see more \"my\" digital devices, as a table in a market... In the sense, I don't expect privacy on it, even if I try my best to achieve a little. I hope it helps.\n\nthey all betray, but God.\n\n#ingodwetrust",
				"added": 1617942306
			}
		],
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 39,
				"body": "As congress shall make no law, it's clear that it's intended to be for the selected one to regulate ! Life will be so great once all is made in the DNC image... finally \"utopia\", the promised system, where all will be happy to the end of time :).",
				"added": 1617942538
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 40,
				"body": "It's funny how alexjones is in full meltdown :). He knows that the election were stolen from pedotrump, but he still believes it's the role of the usa to keep going on with the occupation of taiwan by renegade and rebel forces.\n\npoor man, he lost his \"americana\", and rather than seeking to regain it, prefer to waste his time energy and ressources on taiwan...\n\nwhite men... too low iq :).\n\nsleazy.",
				"added": 1617942702
			}
		]
	},
	"comment_vote": {}
}