{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Como a indústria dos artigos científicos trava o avanço da ciência",
			"body": "#Exigências burocráticas e uma cultura que privilegia a quantidade em vez da qualidade levam cientistas à exaustão – e à malandragem – para garantir bolsas de pesquisa.\n\nO tcheco Ján Hoch tinha 16 anos em 1940, quando perdeu a família nas câmaras de gás de Auschwitz. Sem lenço e sem documento, alistou-se em um contingente de exilados do exército inglês, mudou de nome para Robert Maxwell e combateu na 2ª Guerra Mundial. Ao final do conflito, ganhou condecorações e cidadania britânica. Acabou destacado para uma base na Berlim ocupada.\n\nO militar não sabia, mas sua temporada na capital alemã o tornaria um milionário – e mudaria a história da ciência. Lá ele conheceu a Springer, uma editora alemã fundada em 1842. Eles eram especialistas em publicar artigos científicos: os textos que todo pesquisador precisa escrever para divulgar seus experimentos, descobertas e resultados de pesquisa.\n\nInvestir nesse ramo em um continente destruído não é um jeito óbvio de ganhar dinheiro. Maxwell, porém, enxergou longe: percebeu que a ciência iria bombar no pós-guerra. Os governos, afinal, já tinham percebido que, quanto maior o avanço nos laboratórios, maior a vantagem no front (a bomba atômica, filhote da Teoria da Relatividade, que o diga). Então não faltaria dinheiro público para as pesquisas. Além disso, era óbvio que os cientistas britânicos precisariam cada vez mais de notícias sobre a ciência que estava sendo feita em outros países – a começar pela própria Alemanha, onde ele estava.\n\nMaxwell acionou sua rede de contatos e em dois tempos se tornou distribuidor oficial de artigos científicos da Springer no Reino Unido e nos EUA. A sacada foi tão lucrativa que em 1951 ele já tinha capital e contatos para fundar sua própria editora, agora em território britânico – a Pergamon Press. Maxwell prosperou, criou um império midiático e passou décadas nas listas de homens mais ricos da Inglaterra.\n\nMas o grande legado do magnata não foi exatamente a Pergamon. Foi ter criado um modelo de negócios extremamente lucrativo. E que ainda dá um belo dinheiro: a editora Elsevier – que comprou a Pergamon em 1991 e hoje é a maior editora de literatura científica do planeta – lucrou US$ 1 bilhão sobre um faturamento de US$ 2,7 bilhões, margem de lucro de 36,7%, maior que o do Google (26,5%).\n\nSó tem um detalhe: essa indústria pode ser péssima para a ciência. É o que vamos ver a seguir.\n\n#De Newton à Nature\nNa ciência, não basta descobrir, é preciso contar aos outros o que você descobriu. Copérnico, Galileu e Newton, por exemplo, escreviam livros técnicos, relatando suas experiências e resultados. Com o tempo, a divulgação passou a acontecer menos por livros e mais por artigos científicos – peças curtas, publicadas em revistas e periódicos especializados.\n\nAs primeiras revistas científicas, lá no século 18, não tinham fins lucrativos. Mas com o aumento dos investimentos públicos nos laboratórios, a partir da década de 1950, as universidades passaram a ter muito mais pesquisadores. São todos funcionários com carteira assinada, que precisam mostrar serviço – e que recebem avaliações de desempenho.\n\nPois bem. Para fazer essas avaliações, a comunidade acadêmica adotou basicamente dois critérios: a quantidade de artigos científicos publicados em revistas – um suposto sinal de produtividade e dedicação – e o número de vezes em que esses artigos são citados em outros artigos – o que, em teoria, é uma evidência de que o trabalho foi relevante e influente.\n\nOs cientistas não querem lucro, só divulgação. Então entregam o material de graça. Na outra ponta da equação, há as universidades, que não têm outra opção a não ser pagar o que as editoras pedem para ter acesso às pesquisas mais importantes (afinal, um pesquisador só consegue trabalhar se puder ler o trabalho de outros pesquisadores). Isso deu origem a um modelo de negócio sem igual: você, dono da editora de periódicos científicos, recebe conteúdo de graça e vende a um público disposto a pagar muito.\n\n“Quando os cientistas passaram a ser avaliados por produtividade, eles tiveram de publicar mais”, diz Fernando Reinach, ex-biólogo da USP. Empresários como Maxwell farejaram o bom negócio – pegar de graça do governo [que financia as pesquisas] para vender de volta para o governo [que financia as universidades] – e mais do que isso: perceberam que era fácil incentivá-lo com um empurrãozinho.\n\nO empurrãozinho, no caso, foi criar grifes da ciência: periódicos muito seletivos, que só publicam a nata das pesquisas. Sair em títulos como Cell, Nature ou Science dá visibilidade e é bom para a carreira dos cientistas. Outro estímulo para o lucro foi criar uma maré de revistas extremamente especializadas, que abarcavam todos os nichos da ciência – até os que ainda nem existiam.\n\n“Quando um periódico fica famoso, ele cria um monopólio em sua área. Se há um periódico de um determinado campo [de pesquisa], todas as bibliotecas universitárias precisam ter uma assinatura”, explica Neal S. Young, chefe do setor de Hematologia do Instituto Nacional de Saúde (NIH) dos EUA. “Com isso, as editoras podem cobrar preços muito altos.” A própria Elsevier tem 2,7 mil títulos – entre eles Revascularização Cardiovascular e o Periódico Internacional de Adesão e Adesivos.\n\nAs bibliotecas, com orçamentos na casa dos milhões de dólares, se entupiram de revistas especializadas. Em 1988, Maxwell afirmou que, com a internet e o fim dos custos de impressão, as editoras científicas lucrariam mais ainda. Acertou.\n\n“Na era digital, a figura da editora científica é ainda mais importante”, afirma Dante Cid, vice-presidente de relações acadêmicas da Elsevier no Brasil. “Ela inibe a disseminação de informações equivocadas e colabora com a distribuição da pesquisa de qualidade.”\n\nDe fato, os padrões de excelência da Elsevier e de outras editoras de peso continuam altos. Mas o sistema causa distorções. “Um Newton da vida, que passava a vida toda trabalhando e publicava pouco, não teria chance no século 21”, diz Fernando Reinach.\n\n#Masturbação acadêmica\nHoje, para um cientista brasileiro da área de Farmácia receber a classificação máxima (1A) do Conselho Nacional de Desenvolvimento Científico e Tecnológico, o CNPq, ele precisa ter publicado 70 artigos científicos nos últimos dez anos. Ou seja: ele é obrigado a tirar um avanço científico do chapéu a cada dois meses.\n\nComo a classificação de um cientista no CNPq define quanto dinheiro ele pode receber para suas pesquisas, surge a mentalidade do “quanto mais, melhor”. A quantidade bruta de artigos passa a valer mais do que a criatividade e a originalidade de cada um. Os pesquisadores, sob pressão, se preocupam mais em bater metas do que em produzir boa ciência. “É aflitivo”, resume Kenneth Camargo, professor de saúde coletiva da UERJ e editor de revistas científicas. “Para conseguir promoções na carreira e recursos de pesquisa, você é induzido a publicar o tempo todo. E isso gera expedientes eticamente discutíveis.”\n\nUm desses expedientes é o “pedágio”: você, cientista, exige ser creditado como autor em alguma pesquisa que tenha usado equipamento do seu laboratório – mesmo que você nem tenha participado do estudo. Outro é a “ciência salame”: fatiar uma pesquisa longa, que deveria ser apresentada de uma vez só, em vários pequenos artigos com conclusões parciais – o que aumenta o volume de produção e a classificação acadêmica do autor.\n\nUma consequência do salame é que o impacto científico de cada artigo diminui. E aí surge um problema: não basta publicar muito. Suas publicações também precisam servir de referência para pesquisas futuras no mesmo assunto. Se seu trabalho é fragmentado e inconclusivo, outros cientistas não terão motivo para consultá-lo.\n\nÉ fácil verificar essa infestação de artigos pouco relevantes nos números. Um estudo feito por Sidney Redner, da Universidade de Boston, revelou que, dos 353  mil estudos publicados entre 1893 e 2003 na Physical Review, apenas 2 mil (0,56%) tiveram mais de cem citações. Oitenta e quatro mil (24%) foram citados só uma vez.\n\nO número de citações, porém, também adiciona pontos de desempenho. Então não vale a pena fazer um monte de salames, certo? Não: os pesquisadores criaram artifícios para obter citações do nada. É o caso dos “clubes de citações”. Você força a barra no seu artigo para citar trabalhos dos colegas. Os colegas sabem que você faz isso por eles, e também dão um jeito de citar seus artigos pouco relevantes. Pronto, está formado o clube. Também há as autocitações: você chega e cita a si próprio. Masturbação acadêmica.\n\n#Pagou, passou\nSe nada da lista acima der certo, ainda há as revistas científicas do tipo “pagou, passou.” Esse nicho de mercado surgiu na última década, com intenções boas: as gigantes, como Nature e Science, ofereceram aos pesquisadores a opção de pagar pelos custos de publicação de seus artigos. Assim, o conteúdo fica disponível gratuitamente na internet, sem paywall ou assinatura – colaborando com a democratização da ciência.\n\nEra só uma transferência do custo de publicação: parar de cobrar do leitor e passar a cobrar do autor, sem diminuir as exigências de qualidade. Mas é claro que a fronteira entre pagar para liberar o acesso à pesquisa e pagar para conseguir publicar um artigo péssimo é tênue, para dizer o mínimo. Tanto que surgiu um mercado paralelo de revistas picaretas, que topam qualquer negócio.\n\nJeffrey Beall, bibliotecário da Universidade do Colorado, estima que entre 5% e 10% dos artigos open access tenham sido publicados por periódicos que nem leem o material enviado por pesquisadores desesperados – e cobram centenas de dólares por essa conveniente vista grossa.\n\nEm 2014, para fazer um teste bem-humorado, o cientista da informação australiano Peter Vamplew enviou a uma dessas publicações caça-níqueis um artigo falso intitulado Get Me Off Your Fucking Mailing List (em bom português, “me tire da sua p**** de lista de e-mails”). A coisa consistia, dos gráficos à conclusão, no pedido do título repetido 870 vezes.\n\nAlgumas semanas depois, recebeu a resposta da revista – que, apesar do site de aparência amadora, leva o pomposo nome de Periódico Internacional de Tecnologia Computacional Avançada: os editores pediram algumas “referências a mais”. De resto, tudo ótimo: Me tire da sua p**** de lista de e-mails foi aprovado para publicação.\n\nEsse arsenal de truques deixa claro: publicar com qualidade e em quantidade ao mesmo tempo é impossível. “A boa ciência, que é de fato inovadora, sempre foi rara”, afirma Kenneth Camargo. “Muita gente trabalha, mas as grandes contribuições são agulhas no palheiro. Com essa maré de artigos científicos, você multiplica os palheiros, mas não as agulhas.”\n\nPor outro lado, avaliar ciência sem usar números não é tarefa fácil. Mesmo o CNPq tem consciência de que quantidade não é sinônimo de qualidade. Acontece que não há uma maneira objetiva de medir criatividade e inovação. No final do dia, as bolsas ainda precisam ser distribuídas e os professores ainda precisam ser contratados de acordo com seus méritos. As universidades concordaram que citações e artigos são o melhor jeito de fazer isso – e as editoras pularam dentro. Mesmo assim, não falta quem nade contra essa corrente.\n\n#Robin Hood na pós\nEm junho deste ano, aos 28 anos de idade, a pesquisadora Alexandra Elbakyan, nascida no Cazaquistão, foi condenada pela Justiça americana a pagar US$ 15 milhões à Elsevier. A ativista começou uma carreira promissora na neurociência, mas não tinha verba para consultar as dezenas de artigos científicos que precisava para sua pós-graduação. Se uma universidade não assina um determinado periódico, o pesquisador precisa desembolsar em média US$ 30 para acessar um único artigo por apenas 48 horas. Salgado.\n\nDante Cid, da Elsevier, justificou à SUPER que os preços altos são reflexo da enorme operação da editora – que emprega 7,5 mil pessoas em 12 países e publica 16% de todas as descobertas do mundo.\n\nSeja como for, Alexandra Elbakyan estava em busca de uma solução para o bolso dos cientistas. Descobriu, então, que vários deles usavam fóruns na internet para compartilhar senhas e assinaturas de periódicos. Inspirada pelo método, em 2011 criou o Sci-Hub: um banco de artigos pirateados que contém 64,5 milhões de arquivos – tudo alimentado por senhas fornecidas anonimamente.\n\n“O Sci-Hub é para a ciência hoje o que o Napster foi nos anos 1990”, avalia Marco Mello, professor de ecologia da UFMG. “Se ele não tivesse aparecido, a indústria da música não teria se reinventado. Essas iniciativas estão forçando o sistema a se repensar.”\n\nElbakyan se exilou e está fora do alcance da Justiça americana, mas o Sci-Hub continua no ar, hospedado em domínios exóticos como o das Ilhas Cocos (.cc). De que a iniciativa é ilegal, não há dúvida. Mas sua popularidade silenciosa entre acadêmicos é um sintoma da frustração com o status quo da publicação científica. Dá para entender por quê.\n\n- Fonte: https://super.abril.com.br/ciencia/a-maquina-que-trava-a-ciencia/",
			"added": 1591145491
		}
	],
	"topic_vote": {
		"1_1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL": 1
	},
	"next_comment_id": 20,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "> [susskind](#comment_4_1HJCxrNU74oT6MCoGmQMjHYdxHBr24oBKs): Teoria das cordas\n> \n> http://superstringtheory.com/index.html\n> https://en.wikipedia.org/wiki/String_theory\n> https://web.archive.org/web/20180528175727/http://www.damtp.cam.ac.uk/user/mbg15/superstrings/superstrings.html\n> https://web.archive.org/web/20100108090009/http://omnis.if.ufrj.br/~braga/cordas.html\n\n#Teoria de Cordas (Leituras recomendadas)\n\nNível de divulgação científica:\n\n- [Brian Greene, \"O Universo elegante\".](https://ipfs.infura.io/ipfs/QmbYiQU8BeacDHysHrUywM2vQp5EuHXN3J4T42F8B5caG5)\n\n- [Stephen Hawking, \"O Universo em uma casca de noz\".](https://ipfs.infura.io/ipfs/QmfLMGUuAXfrBbgMd6rbqcXbXFuvo9YbwJKPeVEWuNunAm)\n\nNível de (final de) Graduacão:\n\n- [\"A First course in String Theory\", Barton Zwiebach, Cambridge University Press](https://ipfs.infura.io/ipfs/QmQR2NfFVfGaYK3ZBzvXzoapGcigoTCugCYFM4EzP7xCUX)\n\nNível de Pós Graduação:\n\n- [Joseph Polchinski, String Theory Vols. 1,2,  Cambridge University Press.](https://gateway.pinata.cloud/ipfs/QmSgLvDFoe6rQfqAZsm76hiai2rgD45sVsr91CV9CNY1pQ)\n\n- [Green, Schwartz and Witten, Superstring Theory, Vols 1,2, Cambridge University Press.](https://gateway.pinata.cloud/ipfs/QmbKPPkMG3xbcZCdWi2qCeoKZoTJ47r4GxckzAHEjSKPek)",
				"added": 1591129496
			},
			{
				"comment_id": 2,
				"body": "#O universo: teorias sobre sua origem e evolução - ROBERTO DE ANDRADE MARTINS\n- http://www.ghtc.usp.br/Universo/index.html\n- Arquivado em: https://web.archive.org/web/*/http://www.ghtc.usp.br/Universo/index.html",
				"added": 1591129639
			},
			{
				"comment_id": 3,
				"body": "#Fundamentos de Astronomia e Astrofísica para EAD - Maria de Fátima Oliveira Saraiva, Kepler de Souza Oliveira Filho e Alexei Machado Muller\n- http://www.if.ufrgs.br/~fatima/faad.htm\n- Arquivado em: https://web.archive.org/web/*/http://www.if.ufrgs.br/~fatima/faad.htm",
				"added": 1591129661
			},
			{
				"comment_id": 4,
				"body": "#ASTRONOMIA & ASTROFÍSICA - KEPLER DE SOUZA OLIVEIRA FILHO/ MARIA DE FÁTIMA OLIVEIRA SARAIVA\n\n- http://astro.if.ufrgs.br/index.htm\n- Arquivado em: https://web.archive.org/web/*/http://astro.if.ufrgs.br/index.htm\n\nPor que estudar Astronomia? Nosso objetivo é utilizar o Universo como laboratório, deduzindo de sua observação as leis físicas que poderão ser utilizadas em coisas muito práticas, desde prever as marés e estudar a queda de asteróides sobre nossas cabeças, até como construir reatores nucleares, analisar o aquecimento da atmosfera por efeito estufa causado pela poluição, necessários para a sobrevivência e desenvolvimento da raça humana.\nEm uma noite sem nuvens, em um local distante das luzes da cidade, o céu noturno pode ser visto em todo o seu esplendor, e é fácil entender porque desperta o interesse das pessoas. Depois do Sol, necessário à vida, a Lua é o objeto celeste mais importante, continuamente mudando de fase. As estrelas aparecem como uma miríade de pontos brilhantes no céu. Entre elas, os planetas se destacam por seu brilho e por se moverem entre as demais.\n\nNo Big Bang, que deu início ao Universo, toda a matéria estava concentrada em um único ponto, com temperaturas tão altas que os prótons e nêutrons que formam os átomos ainda não existiam. Existia um mar de energia, matéria e antimatéria. As partículas, quarks e léptons apareciam brevemente, e desapareciam neste mar de energia. Para o estudo da cosmologia, é preciso unir mecânica estatística, mecânica de fluídos, física de partículas, relatividade geral, teoria quântica de campos, com astronomia e astrofísica, passando pelo desafio da matéria escura e da energia escura.\n\nEste texto foi escrito para permitir acesso por pessoas sem qualquer conhecimento prévio de Astronomia e com pouco conhecimento de matemática. Embora alguns capítulos incluam derivações matemáticas, como Insolação, Marés e Leis de Kepler Generalizadas, a não compreensão desses cálculos não compromete a compreensão do texto geral. As sessões de Evolução Estelar e Cosmologia Matemática requerem bom conhecimento de matemática e de física. Mesmo que o leitor pule as seções mais matemáticas, deve obter uma boa visão da Astronomia e Astrofísica.",
				"added": 1591129680
			}
		],
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 5,
				"body": "#Inteligência Artificial - Peter Norvig, Stuart Russell\n- https://gateway.pinata.cloud/ipfs/QmRny1b8XGfnE93yQgq5c5Seh9exita7dw5LrJzFvLdL59\n\nLivro número um no tema, oferece a mais abrangente introdução à teoria e prática da inteligência artificial, sendo adotado por mais de 750 universidades em 85 países. Nos últimos cinquenta anos de pesquisas sobre IA e nos dois últimos milênios de trabalhos relacionados a esse campo de estudo, muitas ideias surgiram e a maneira como se pensa esta área está em constante evolução. Nesta tradução da terceira edição, foram consideradas as mais importantes aplicações de tecnologia de IA e seus marcos algoritmos, como a solução do jogo de damas, colocando a obra num patamar teórico bastante consistente. Ganchos Inclui o desenvolvimento de tecnologias para robôs para exploração interplanetária; prática de reconhecimento de fala; tradução automática; veículos autônomos; robótica de uso doméstico. Indicado para cursos de graduação e pós-graduação ou estudantes que tenham familiaridade com os conceitos básicos de ciência da computação.",
				"added": 1591130022
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 6,
				"body": "#Para Leigos\n- https://gateway.pinata.cloud/ipfs/QmQtNNiwV7LkWfVTz3ZDpyydLS2uVak5w6GbYRQqTWv43Q/Para_Leigos.zip\n\nPara Leigos ou Para Totós compreende uma extensa série de guias de referência em diferentes tamanhos em língua portuguesa, publicados para os mercados brasileiro e português, que vão desde o \"formato bolso\" ao MegaKit. Os livros desta série são recomendados para leitores inexperientes no tema no qual desejam aprofundar-se.",
				"added": 1591135399
			}
		],
		"1_1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL": [
			{
				"comment_id": 7,
				"body": "#Você pode acessar gratuitamente ~ 100% da [ciência](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Science.html) on-line nos servidores da [Library Genesis](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Library_Genesis.html) / [Sci-Hub](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Sci-Hub.html) abaixo.\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_0\n\n- Fonte: https://vertsluisants.fr/index.php?article4/where-scihub-libgen-server-down",
				"added": 1591147634
			},
			{
				"comment_id": 8,
				"body": "Library Genesis TOR Mirror: http://genotypeinczgrxr.onion/",
				"added": 1591148873
			}
		],
		"1_1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU": [
			{
				"comment_id": 9,
				"body": "#É Por Você Que Canto - Leandro & Leonardo\n- https://ipfs.infura.io/ipfs/Qmb8DB8dd5F1gKQTWTudWMckxj3aVgC845tyf3BQ9zeMFS\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_1",
				"added": 1591149219
			},
			{
				"comment_id": 10,
				"body": "#Evidências - Chitãozinho & Xororó\n- https://ipfs.infura.io/ipfs/QmdCtcq68pr1WaypcRjHBAyAotyJs5FAwynzJoDspcuMgT\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_2",
				"added": 1591149706
			},
			{
				"comment_id": 11,
				"body": "#Aqui É o Seu Lugar - Pablo\n- https://ipfs.infura.io/ipfs/QmNu3MqokuaHzSjf3zXNh8bywcgD5aCmb1vTtie9TvojUN\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_3",
				"added": 1591150222
			},
			{
				"comment_id": 12,
				"body": "#Eu Era - Marcos & Belutti\n- https://ipfs.infura.io/ipfs/QmTSwmV4SiMY6tfXGeto7hLis6owfRSiv7iAuFL5rSacun\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_4",
				"added": 1591150515
			},
			{
				"comment_id": 13,
				"body": "#Jesus Cristo - Roberto Carlos\n- https://ipfs.infura.io/ipfs/QmVSTajD7TqVfMbXFS71zZyEpZuahkX77yBs6qeQQkCgVA\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_5",
				"added": 1591150850
			},
			{
				"comment_id": 14,
				"body": "#Tocando Em Frente - Almir Sater\n- https://ipfs.infura.io/ipfs/QmR5F2fdteTVuZU7GyZrCPXJwSYAkdHsM7pTk6vp4p8SPC\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_6",
				"added": 1591151149
			},
			{
				"comment_id": 15,
				"body": "#Sinônimos - Zé Ramalho\n- https://ipfs.infura.io/ipfs/QmUSGr3SdCBhLFTQFgmDmttbN5Rrxi7fHgYpH8YWENXoqX\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_7",
				"added": 1591151502
			},
			{
				"comment_id": 16,
				"body": "#Admirável Gado Novo - Zé Ramalho\n- https://ipfs.infura.io/ipfs/QmVRXn9EFqRTRNbF7r5raNCZeegZHiN8vU1MDAwbHxjB2Q\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_8",
				"added": 1591151605
			},
			{
				"comment_id": 17,
				"body": "#Conquest Of Paradise - Vangelis\n- https://ipfs.infura.io/ipfs/QmW1HENRgwoJh7f3XoU5M9ScQgzfhPFmNmURhpfnCwtnhV\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_9",
				"added": 1591151955
			},
			{
				"comment_id": 18,
				"body": "#Sobrevivi - Sarah Farias\n- https://ipfs.infura.io/ipfs/QmNqVuvAXmyMojbsguRGRxsM33if5dDzzu7rdxfciEbCyJ\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_10",
				"added": 1591152303
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 19,
				"body": "#Projeto para uma implementação CoinSwap para melhorar enormemente a privacidade e a fungibilidade do Bitcoin\n\n- http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NQk918QGP3vPx3kMqta1nZrbK5KcBWCcL_11\n\nImagine um futuro em que uma usuária Alice tenha bitcoins e queira enviá-los com a máxima privacidade, para que ela crie um tipo especial de transação. Para quem vê a blockchain, sua transação parece completamente normal, com suas moedas aparentemente indo do endereço A para o endereço B. Mas, na realidade, suas moedas acabam no endereço Z, que está totalmente desconectado de A ou B.\n\nAgora imagine outra usuária, Carol, que não se incomoda com a privacidade e envia seu bitcoin usando uma carteira comum existente hoje. Mas como a transação de Carol é exatamente igual à de Alice, qualquer pessoa que analise o blockchain deve agora lidar com a possibilidade de a transação de Carol realmente enviar suas moedas para um endereço totalmente desconectado. Portanto, a privacidade de Carol foi aprimorada, mesmo que ela não tenha mudado seu comportamento, e talvez nunca tivesse ouvido falar desse software.\n\nEm um mundo onde anunciantes, mídias sociais e outras empresas desejam coletar todos os dados de Alice e Carol, essa melhoria de privacidade seria incrivelmente valiosa. E também a dúvida adicionada a cada transação aumentaria bastante a fungibilidade do bitcoin e, portanto, a tornaria uma melhor forma de dinheiro.\n\nEssa privacidade indetectável pode ser desenvolvida hoje com a implementação do CoinSwap, embora por si só isso não seja suficiente. Deve haver muitos blocos de construção que juntos formam um bom sistema. O software pode ser autônomo como um tipo de aplicativo de mistura de bitcoin, mas também pode ser uma biblioteca que as carteiras existentes podem implementar, permitindo que seus usuários enviem transações de Bitcoin com muito mais privacidade.\n\n- Fonte: https://gist.github.com/chris-belcher/9144bd57a91c194e332fb5ca371d0964",
				"added": 1591153085
			}
		]
	},
	"comment_vote": {}
}