{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Eric Zemmour",
			"body": "alors question, qui sont les francais les plus proches des peres fondateurs de l'ameriques au point de vue de la pensée? je ne pourrais pas en citer 1 ! c'est terrible que des chiens etatiques qui jamais pronent la liberté individuelles, telle que le droit reel de porter des armes... \n\na quoi sert de precher la liberté expression sans fusils pour la defendre?\n\na rien.\n\ndeuxiement je vois une pattern ou c'est tjrs des hommes, et jamais des institutions (pull up au grand :D)... \n\nc'est vrai en plus\n\njamais de franc masson (il me semblent avoir eut une unification, et actuellement nous somme en cease fire). jamais de jacobin c'est qui ces gars? genre gouv mondiales centralisé pour eux pour looter comme des malades? et les jesuites la dedans? elle recupere quand ses terrains la grande eglise de rome? du vol c'est du vol...\n\nalors oui... qui... l'amerique... ils sont tous partis? american dream go on et on abandonné le fransois? ca me semble le plus probable... ",
			"added": 1617989335
		}
	],
	"topic_vote": {},
	"next_comment_id": 57,
	"comment": {
		"3_1KJWwT67jevaZZMQmcspiJToGt63sxkwrj": [
			{
				"comment_id": 1,
				"body": "va te faire foutre sale pute !",
				"added": 1617980964
			},
			{
				"comment_id": 2,
				"body": "c souvan kom ca avec les mongolos, ils se rattachent à la forme, pour masquer leur absence de fond (de teint).",
				"added": 1617981007
			}
		],
		"1_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG": [
			{
				"comment_id": 3,
				"body": "(fais attention à la sténographie, dans le sens que plus tu fé des fotes, moins ils peuvent établyr une \"pattern\" d'écriture :)).",
				"added": 1617986507
			},
			{
				"comment_id": 4,
				"body": "Oui je suis d'accord c'est une caste\n\nspecialement depuis le pedo mitterand. en gros d'après ce que je comprends lui il a fait que du copinage. en gros ces potes dit socialists on pris toutes les positions administratives et relatives (associations supporté par l'état etc) pour se faire de l'argent et se reproduire... biensur sur notre dos (en pillant nos bourses).\n\nouais c'est kler qu'on comprend, le probleme c'est que les poulets ils sont cons a un point.... put1... deja arreté des gens pour des plantes... quel bande de gogoles.\n\naprès moi tous les espaces de discussion en langue francaise centralié sont censuré... tous... pas de kéké, pas de tor, pas de ip masking rien... bande de nazis.\n\nouais alors la je suis pas sur... macmac il est pas forcement avec ceux la... en gros, ceux la ils sont pas de la meme frange du zionisme... en fait pas du tout... \n\nfaut comprendre y a 3 grand agendas : l'ONU / global agenda (co2, refugié, liberté d expression, armes legeres, la weed etc) dans le but d'un gouvernement mondial (tax, passport onu etc). ensuite y a l' EU, faut detruire l'identité francaise pour créer le citoyen europeen, bientot en conflit avec l'ONU (pour creer l'homme mondiale) et enfin il y a le guide stone agenda (GSA)... oui bien sur les petits juifs essayent de survivre au mileu de la masse :).\n\nohh no no.... y a beaucoup plus de resistants que tu crois.\n\n1. l islam... alors la... snakbar ! full on djihad, move on ! \n2. eretz israel... pareil, les nazis de tout bord ils peuvent aller se faire nuker.\n3. CHINA !!! alors faut pas fumer... y a personne sur cette terre qui va rulez china mais des chinois. fin de la discussion, amene tes legions si t es pas d'accord (risque de CWO, chinese world order, mais on essaye de gerer les ambitions supranationales afin de refocus le talent et les ressources sur CHINA, puis on a notre guerre avec taiwan).\n4. INDIIIIIIIIDDDDDDDHHHHAAA... on a quasi pris le control de la silicon valley, big tech and chip tech... donc bon tranquillou, l'ensemble du systeme medical us nous apparient etc... on va rien ceder, long live krishna.\n5. Russia... du trader rebel, au premier Tsar... alors faut pas exagerer, apprend le cyrilic.\n\nrien qu'avec ca, on voit que ces fameux leaders du monde sont en fait des proies, qui ont juste l'avantage d'avoir une CIA completement depassé... un fbi contre intelligence qui protege des pedos et surtout les gays... pathetique... mais on a bonne espoir d'une resurgence en mode phoenix... s'ils etaient si solides les \"rulers\" ils auraient pas de censure... c'est la preuve de leur faiblesse... dans le sens qu'ils n'ont pas d'argument... juste piller, violer des enfants et s'enrichir encore plus en ruinant l'amerique pour remplir l'agenda de l'ONU et du GSA...\n\noui, heursement, il aura tjrs la guerre pour regler les comptes de facon ferme et definitive.\n\nmerci de ta reponse soit prudent, tor, i2p, zn, bitmessage, le tout sous tails / whonix et oublies pas d'effacer ton \"user.json\"  de temps en temps pour changer d'ID... ",
				"added": 1617989064
			},
			{
				"comment_id": 8,
				"body": "ramenez du monde sur zn les loulous...\n\n",
				"added": 1617995867
			}
		],
		"18_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 5,
				"body": "c'est clair invermectine + zinc + vit d et c.... easy\n\nle truc c'est qu'ils veulent pas de therpeutique legaux sinon leur vaccins experimentaux ne sont plus legaux, et le but c'est leur passport ONU... \n\nle truc c'est que les blancs, la pluspart des assassins de l'ONU / GSA (guide stone agenda) ou EU ne peuvent rien faire contre les niggas d'afrique du sud...\n\nils comprennent l'apartheid...\n\net apparement sont conscient d'etre assez riche sans avoir besoin de soutien exterieur...\n\nla weed est legal en afrique du sud...",
				"added": 1617995562
			},
			{
				"comment_id": 6,
				"body": "l hydrocholorixine c't bien pour pusher le zinc dans les cellules...",
				"added": 1617995592
			},
			{
				"comment_id": 7,
				"body": "ils leur faut une addresse en .onion a ce site... c'est facile www.torproject.org manual expert et regarde comment avoir un auto switch from the clear net vers le onion routing system...",
				"added": 1617995720
			}
		],
		"4_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 9,
				"body": "si on parlait salaire... un peu de transparence... combien ca rapport d'être un traitre? j'ai hate de voir vos derniers interviews avant votre execution, peut etre meme avec vos enfants morts devant vous.\n\nrappellez vous, les \"ornellas\" pour nous c'est de la merde, l'echec, l'abus, la peste... \n\non ne sera pas faible, lache et traitre comme eux... ils veulent leur royaumes des cieux, qu'ils n interferent pas sur nos champs de battailles, sinon, plus vite, ils iront, ou ils pretendent vouloir aller...\n\nl'express...",
				"added": 1618208619
			}
		],
		"3_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 10,
				"body": "lol, les petits censeurs... qui se plaisent dans le silence de leur obeissance à l'injustice.",
				"added": 1618472295
			},
			{
				"comment_id": 12,
				"body": "ahhh j'oubliais :\n\nbooohoooo booohoooo...",
				"added": 1618472649
			},
			{
				"comment_id": 13,
				"body": "booohoooo....",
				"added": 1618473352
			},
			{
				"comment_id": 14,
				"body": "et d'ailleurs si vous etes si intelligent : comment je separe de l'eau (h2o) dont l'hydrogen est en fait tu tritium (3h)?\n\ncricket? meme vos chefs savent pas? et bah... c'est un probleme.",
				"added": 1618474870
			}
		],
		"3_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 11,
				"body": "Personellement, a part la non fermeture des frontieres au debut de l'épidemie, je ne comprend pas pourquoi personne n'a meme soulevé l'idée d'un bilan nutritionnel, en particulier la supplémentation avec de la vit c, d, zinc, magnesium et iode, a , e et co. Cela coute 1000x moins cher qu'une journée en soin intensif... \n\nmais bon...\n\napres moi le vrai probleme du jour c'est le bureau i24fr de paris... a chaque fois qu'il faut supporter un pedo, ils sont la... alors que c'est pas du tout le cas au bureau meme fr de tel aviv. Il y a un probleme (auj c't une meuf pour ehud barrack, qui selon elle n'aurait pas de casserole, genre la conspiration de base). alors moi je pense qu'il est temps d'une serieuse investigation...\n\nfinalement je suis encore une fois pas d'accord avec ruffiole (je pense pas qu'il soit tres intelligent, un peu lent, tres formaté) specialement quand il dit que la gauche caviar est pedo... moi je pense qu'il faut distinguer, entre ceux qui sont incapables de satisfaires des besoins du marché par leur travail/investissement/participation et qui donc usent de la bourse etatique pour s'enrichir afin de subvenir aux imperatifs hypergamists et les pedos.\n\nd'un coté il y a les violeurs d'argent publiques et de l'autre les violeurs d'enfants.\n\nmoi je distingue bien, je n'aime pas le smearing.",
				"added": 1618472627
			},
			{
				"comment_id": 15,
				"body": "comment je separe de l'eau (h2o) dont l'hydrogen est en fait du tritium (3h)?",
				"added": 1618474877
			},
			{
				"comment_id": 16,
				"body": "la il est temps pour mac de faire une intervention aupres des chleus et autres pds de l'est... pas de conflict avec la russie, donc on laisse tomber cette folie de la oBiden team, a propos de conquerir l ukraine... \n\net meme si ca rate, car j imagine que les nazis en roses, meprisent macron et nous (les francais) au plus haut point, mais au moins on sera pas sur le targeting system des russes... et ca , ca n'a pas de prix !!!\n\n",
				"added": 1618477892
			},
			{
				"comment_id": 17,
				"body": "et insta leave de l'otan... bye bye... ",
				"added": 1618477925
			},
			{
				"comment_id": 18,
				"body": "moi je pense pas qu'on soit seul : voici ma liste de ceux qui ne veulent en aucun se retrouver dans pareille merde pour que le fils de joseph biden et le gang d'obama puisse avoir burisma et envahir l ukraine avec leur \"refugiés\" :\n\nportugal, espagne, autriche, au moins... c'est deja pas mal... peut etre la hongrie, meme le gars de goldman il peut pas etre si con, le luxembourg... la belgique... meme les pays bas, les pays du nord, l iceland... donc il reste les chleus, et les polonais... ",
				"added": 1618478094
			},
			{
				"comment_id": 19,
				"body": "peut etre les roumains... (base)... qui d'autre pourraient vouloir s'engager dans une merde pareille pour le lebensraum allemand?",
				"added": 1618478129
			},
			{
				"comment_id": 20,
				"body": "les grecques? ca m etonnes... donc la il y a moyen de finalement mettre une violente claque a la pute... physiquement, faut pas hesiter mac, ca te fera du bien de gifler merkel...",
				"added": 1618478176
			},
			{
				"comment_id": 21,
				"body": "ca elle aime pas... les putes de l humanisme des nazis en rose...",
				"added": 1618478193
			},
			{
				"comment_id": 22,
				"body": "j imagine que le trouffion nazi de leiden elle est 100% derriere le fuhrer en rose?",
				"added": 1618478232
			}
		],
		"1_1GJNLqVkyGjMCFmX7gWFauG7YLn6KdHQ9S": [
			{
				"comment_id": 23,
				"body": "(And has sent down water from the sky. With it have We produced diverse pairs of plants.) (Quran 20:53). (males and females)\n\nThen let man consider his nourishment: that We pour down the rain in showers, and We split the earth in fragments, and therein make the grain to grow, and vines and herbs, and olives and palms, and gardens of dense foliage, and fruits and fodder- provision for you and your cattle. (`Abas 80:24-32)\n\n“It is He who sends down water (rain) from the sky. With it We produce vegetation of all kinds from which (water or plants) We produce green substance (Khadir), out of which We produce grain in clusters. And out of date palms, from their spathes come forth clusters of dates hanging low and near, and (We produce) gardens of grapes, olives and pomegranates, each similar (in leaves or shape), yet different (in fruit and taste). Look at (and think over) their fruits when they begin to bear fruit, and (look at) the ripeness thereof. Behold! In these things there are Signs for people who believe.” (Quran 6: 99)\n\nHave you seen the fire you kindle? Was it you who grew its timber or did We grow it? We have made it a reminder, and a comfort for the desert- dwellers. (Al-Waqi`ah 56:71-73)\n\nla ca devient chaud pour vous les chiens de l'enfer : \n\nSurat Al-Roum: “Devote thyself single-mindedly to the faith, and thus follow the nature designed by Allah, the nature according to which He has fashioned mankind; there is no altering the creation of Allah.” [30:30] \n\nSurat Luqman: “He created the heavens without pillars as you see them, and put mountains upon the Earth lest it might convulse with you, and H e spread it with animals of all kinds; and We sent down water from the clouds, then caused to grow therein (vegetation) of every noble kind.” [31:10] \n\nSurat Qaf: “And the Earth, We spread it out, and cast therein firmly set mountains and We have made to grow therein of all beautiful kinds; to give sight and as a reminder to every servant who turns to Allah.” [50:7-8] \n\n Surat Al-Nahl: “He causes to grow for you thereby herbage, and the olives, and the palm trees, and the grapes, and of all the fruits; most surely there is a sign in this for a people who reflect.” \n\nSurat Al-Hijr: “And the Earth; we have spread it forth and made in it firm mountains and caused to grow in it every suitable thing.” [15:19] \n\npret? tjrs.",
				"added": 1618502146
			}
		],
		"7_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 24,
				"body": "they have be killed, for their crimes, previous to covid of course. they are a hellish religion called the french universalism which is just a variant of humanism, a totalitarian authoritarian planetary ambition... at least taht's what they believe in.\n\ndeath will alleviate them and solve a lot of issues.",
				"added": 1618502346
			},
			{
				"comment_id": 25,
				"body": "en fait on veux juste etre traité comme des etres humains, mais comme vous en etez incapable, je pense que la seule hypothese c'est que vous n'en soyez pas vous meme.",
				"added": 1618504783
			},
			{
				"comment_id": 55,
				"body": "le gros con de la police, tu veux continuer ta guerre contre les stupds... bon bah alors voila., sert l onu met ton casque bleu, fou des drones partout et chialent ensuite quand il restera rien...\n\nobey.",
				"added": 1618507340
			},
			{
				"comment_id": 56,
				"body": "c'est pour ca que je quitte... je delete le fr... des que j'ai fini le halimi... povre mémé.-..",
				"added": 1618507371
			}
		],
		"1_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2": [
			{
				"comment_id": 26,
				"body": "c'est mon dernier episode... j'en ai marre de ce pied... allayah eric et goldnadel...",
				"added": 1618506592
			},
			{
				"comment_id": 27,
				"body": "je trouve tres nul et petit de pas parler des \"island chains\"... tu devrais regarder matt bracken... tu apprendrais\n\nensuite me dire que les americains defendent la democratie c'est la plus grosse blague du monde...",
				"added": 1618506629
			},
			{
				"comment_id": 28,
				"body": "regardes nancy, regardes epstein, regardes le renversement de trump... alors t as gueule avec ta democratie.\n\nc'est juste les island chains... et faire chier... dans l idee de nous niquer avec une hyper armée... sauf qu'on est pas si con...\n\ntout est géré\n\npla=best.",
				"added": 1618506676
			},
			{
				"comment_id": 29,
				"body": "l' hitsoire d'un pays de plouc... (la france).",
				"added": 1618506689
			},
			{
				"comment_id": 30,
				"body": "blah blah les allemands.... le gars il connait rien a la chine... rien. ",
				"added": 1618506702
			},
			{
				"comment_id": 31,
				"body": "laisses tomber poto, l'iran c'est bagguer... fini.",
				"added": 1618506716
			},
			{
				"comment_id": 32,
				"body": "a mon avis :).",
				"added": 1618506723
			},
			{
				"comment_id": 33,
				"body": "mais taiwan c'est china... ",
				"added": 1618506733
			},
			{
				"comment_id": 34,
				"body": "le plus drole c'est l idée de l armée francaise...\n\napres t es meme pas au courant de toutes les simulations qui foirent... c'est impossible...\n\npourquoi petit con?\n\nsupply chain... mfg capacity.",
				"added": 1618506776
			},
			{
				"comment_id": 35,
				"body": "ca c'est la rules\nle reste c'est de la palabre de petit blanc.",
				"added": 1618506788
			},
			{
				"comment_id": 36,
				"body": "mainteant il nous fume avec son danzig... on est ou... le theme c t taiwan... putin ils sont cons ou quoi?",
				"added": 1618506815
			},
			{
				"comment_id": 37,
				"body": "t as gueule encore une fois t as rien compris a l entre deux guerre, petite pute de versailles... alors que t as dis le contraire hier... masi quel con.",
				"added": 1618506858
			},
			{
				"comment_id": 38,
				"body": "ca parle, ca cogite, mais ca avance pas... ",
				"added": 1618506876
			},
			{
				"comment_id": 39,
				"body": "vive l education americaine appliqué a la chinoise backé a la russe et compté a la juive de brooklyn :).",
				"added": 1618506905
			},
			{
				"comment_id": 40,
				"body": "j ai qu un mot zemmour : allayah to the yeshiva... et goldnadel a la knesset :D.",
				"added": 1618506940
			},
			{
				"comment_id": 41,
				"body": "(je sais pas comment on dit le tribunal des levis :D).",
				"added": 1618506958
			},
			{
				"comment_id": 42,
				"body": "et christinette y a pas d'independence a taiwan... c'est interdit... ligne rouge... ca... ce manque d'education.",
				"added": 1618507002
			},
			{
				"comment_id": 43,
				"body": "t as gueule monnant... Obiden c'est l onu, dommination mondiale , korée du nord... t es con...",
				"added": 1618507034
			},
			{
				"comment_id": 44,
				"body": "et voila on mentionne encore pas le grand kimi et sa famille celeste? bande de bouffon ces tele fancaises.",
				"added": 1618507062
			},
			{
				"comment_id": 45,
				"body": "la pute de kerry, fils de pute avec hitlary... weisntein etc... t as gueule.",
				"added": 1618507083
			},
			{
				"comment_id": 46,
				"body": "voila le bouffon du cac40... maintenant il veut l eu dans la frey... go go ...",
				"added": 1618507106
			},
			{
				"comment_id": 47,
				"body": "allez il est temps de nettoyer.",
				"added": 1618507117
			},
			{
				"comment_id": 48,
				"body": "pavenlko c'est que des bouffons... et maintenant il veut prendre l ukraine... mais c est quoi ces gens...",
				"added": 1618507149
			},
			{
				"comment_id": 49,
				"body": "alllez clash... zemmour pavelenko...",
				"added": 1618507162
			},
			{
				"comment_id": 50,
				"body": "alors gros con, si la crimée c'est russe alors taiwan si c'est pas chinois...",
				"added": 1618507195
			},
			{
				"comment_id": 51,
				"body": "tout le monde est d accord taiwan c'est chinois... putin merci monnant.",
				"added": 1618507216
			},
			{
				"comment_id": 52,
				"body": "o moins qui connait les bases... put1.",
				"added": 1618507229
			},
			{
				"comment_id": 53,
				"body": "c est les guinols... j attendais surtout halimi...",
				"added": 1618507260
			},
			{
				"comment_id": 54,
				"body": "c'est les bouffons qui doivent une fois pour toutes ce faire eclater en 8k.",
				"added": 1618507290
			}
		]
	},
	"comment_vote": {}
}