{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1,
			"title": "Aqui é livre da negraiada?",
			"body": "Sou ancap, imposto é roubo e estado é quadrilha.\nNão gosto de escuros. Espero me enturmar com os brancos daqui.\nCheguem mais.",
			"added": 1573174767
		},
		{
			"topic_id": 2,
			"title": "Utilizem VPN!",
			"body": "Procure uma boa VPN que não guarde logs.\n\nhttps://www.techradar.com/vpn/best-vpn",
			"added": 1573304749
		},
		{
			"topic_id": 3,
			"title": "Nada de Bom Seria Perdido se Alguém Metralhasse uma Universidade",
			"body": "Universidades são centros de congregação de negros, lésbicas, drogados, ladrões, comunistas, socialistas e viados.\n\nQuem entrar em uma e matar geral não estará fazendo mais que sua obrigação de contribuir para um país mais limpo, bonito e agradável.",
			"added": 1573553942
		},
		{
			"topic_id": 4,
			"title": "Personagens de anime, com seus traços delicados e elegantes, representam o ápice da beleza Ariana",
			"body": "Reparem que a negraiada, com seus traços grotescos, grosseiros e simiescos, não está presente nas animações japonesas.",
			"added": 1573555079
		},
		{
			"topic_id": 5,
			"title": "Luciano Hang diz que universidades públicas formam zumbis",
			"body": "Grande filha duma puta esse homem. No dia que ele começar a recrutar para uma milícia armada para matar zumbi, serei um dos primeiros a me alistar.\n\n>Hang disse que quanto mais as pessoas estudam nas universidades públicas, mais se tornam idiotas.\n\n>Luciano Hang, dono da rede de lojas Havan, teceu uma série de críticas às universidades federais do Brasil.\n\n>Em discurso durante inauguração da loja 134 da Havan, em Santa Maria, no Rio Grande do Sul, no último sábado (9), Hang declarou: \n\n>“Eu, Luciano, não colocaria meu filho em uma Universidade Pública porque você educa seu filho e ele volta um comunista, não quer trabalhar e quer atrapalhar quem faz.”\n\n>Segundo o site Metrópoles, ele acrescentou:\n\n>“As pessoas que vão às Universidades Federais são doutrinadas para serem zumbis, para trabalharem dentro do governo e atrapalharem a iniciativa privada, para ser contra o empreendedor, para ser contra quem gera riqueza neste país.”",
			"added": 1573636539
		},
		{
			"topic_id": 6,
			"title": "Eu jamais daria emprego a um comunista/socialista/fascista/nazista/democrata",
			"body": "Só de olhar eu já sei, a cor da pele não deixa enganar.",
			"added": 1574398649
		},
		{
			"topic_id": 7,
			"title": "É muito ruim ser racista no Bostil",
			"body": "Você sai na rua e se depara com uma legião de pardos, trirraciais e prectos. Se disser alguma coisa a respeito em voz alta, certamente será espancado pelos macacos e depois preso pela polícia por crime de ódio. As universidades e cargos públicos estão lotadas desses vagabundos e burros devido ao sistema de cotas para bandidos.\n\n\nSomente morando na roça em uma cidadezinha do interior de Sancta Khatarina para ficar livre da PESTE de pele preta, porque até em ambientes da classe alta esses vermes já estão se infiltrando. Maldita seja a escravidão africana, que trouxe esse chorume em forma de gente para as Américas. E maldito sejam os portugueses doentes mentais, que ao contrário dos nobres ingleses - que repudiavam a miscigenação - praticaram zoofilia adoidados com as gorilas horrorosas e deram origem ao mar de pardos que existe hoje em dia. Esse povo leva subdesenvolvimento e baixo Q.I. para onde vão, destroem e degeneram tudo a que têm acesso, além de praticar crimes como furtos, assaltos, estupros e homicídios.\n\n\nO certo seria eles terem ficado na maldita África comendo terra, praticando canibalismo e morrendo de AIDS.\n\n\nPardo nem é raça, é um híbrido de uma raça superior como uma inferior. É uma mistura, é o vira lata humano. É o resultado de uma relação doentia entre pessoas completamente perturbadas, imorais, psicopatas e inconsequentes.",
			"added": 1575340007
		},
		{
			"topic_id": 8,
			"title": "Natália Burza Gomes Dupin é Uma Heróina",
			"body": "Mulher honrada e de bem, extremamente inteligente.\nO lixo deste país pode tentar suprimi-la, mas sua honra será sempre da mais alta.",
			"added": 1575887610
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_1DCLtawUE1CMCN8PcgV1YowZ46fbFJumTn": [
			{
				"comment_id": 1,
				"body": "Sou da Bahia, então já me basta ter que aguentar a macacada na rua e na facu.\nNa internet só quero contato com brancos.",
				"added": 1573175205
			},
			{
				"comment_id": 3,
				"body": "> [tyey](#comment_1_17wmVdtpypnY5p78G7DUFhmV96ch3o2iz1):merda branca\n> [tyey](#comment_1_17wmVdtpypnY5p78G7DUFhmV96ch3o2iz1):Contradição em termos\nVocê é burro assim mesmo, fazer o quê.\nMas não se preocupe, você vai honrar seus antepassados, quando eu lhe der 100 chibatadas e lhe colocar para trabalhar na minha fazendo, negro de bosta.",
				"added": 1573637020
			}
		],
		"2_1K2GkqUrrLdofRNuwaM7vCZEsY4BC7nLEM": [
			{
				"comment_id": 2,
				"body": "Lixo a ser destruído.",
				"added": 1573547317
			}
		],
		"2_1EC7RAvqbKEigqq2cstsNuoprx6J2wumDg": [
			{
				"comment_id": 4,
				"body": "Boa para quem gosta de pizza caliente.",
				"added": 1573912235
			}
		],
		"2_16rweQ3kpW62uqTDffBcUBLhg7GHvA6Agx": [
			{
				"comment_id": 5,
				"body": "Lixo esquerdopata.",
				"added": 1574019487
			}
		]
	},
	"comment_vote": {}
}