{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1565354906,
			"title": "8Chan Refugees Blow Their Anonymity",
			"body": "*The Daily Beast captured 819 IP addresses for 08chan users connecting from 62 different countries. Most users in our sample, 437 of them, are in the U.S., with Canada (46 users), and the U.K. (37).*\n\n*Some users connected over VPNs, shielding them from our analysis, but hundreds logged in directly from cable TV broadband networks and other residential services.*",
			"added": 1565354905
		},
		{
			"topic_id": 1565420698,
			"title": "Ad Blocker for Pics with Perceptual Hashing, Does it Exist?",
			"body": "Let's say some idiot decides to raid a chan with pics of dead dogs (or whatever) and I want to blacklist all that trash.\nIs there a content blocker that uses perceptual hashing to block images (or whole html sections with these images)?",
			"added": 1565420696
		},
		{
			"topic_id": 1565915969,
			"title": "Full genome of the 1918 influenza virus was released, but no bio bomb yet",
			"body": "They said rogue nations would develop bio weapons with the influenza virus, but still nothing seems to have been done. How long until Armageddon/bio-war?",
			"added": 1565915966
		},
		{
			"topic_id": 1566671185,
			"title": "The Original Sin of Free Software",
			"body": "Someone asked me about this very recently, so I felt it was worth\nwriting out  my thoughts  in more  detail. Note  that this  isn't a\nmanifesto, or  a declaration, its  just an effort to  start putting\nsome structure on my thoughts.\n\nThe History \n-----------\n\nSince  Richard  Stallman  wrote  his  GNU  Manifesto[^GNU]  in  the\nmid-1980s, it  has come to be  regarded as the ur-text  of Free and\nOpen Software.  The principles enunciated were  later expanded upon\nand codified in  the Free Software Definition[^FSD],  and have been\nadopted,  to  varying  degrees, by  different  organisations,  like\nDebian's Free Software Guidelines[^DFSG]  and the OSI's Open Source\nDefinition[^OSD]. Before  I continue, its  probably a good  idea to\nrestate the \"Four Freedoms\" of the FSD:-\n\n0. The freedom to  run the  program  as  you wish, for any purpose \n1. The freedom  to  study how the program works,  and change it so \n   it does your  computing as you  wish. Access to the source code \n   is a precondition for this \n2. The freedom to redistribute copies so you can help your \n   neighbor. \n3. The freedom to  distribute copies  of your modified versions to \n   others. By doing this you can give the whole community a chance\n   to  benefit from  your changes.  Access to the source code is a \n   precondition for this.\n\nWhile these  are each  expressed as  _positive_ freedoms,  when the\nFour Freedoms  (I'll refer to these  as 4F from here,  and call the\nindividual Freedoms  by number,  e.g. 4F0)  were adopted  by Debian\nand  OSI, there  was a  distinct  shift from  positive freedoms  to\n_restrictive_ freedoms  - most  particularly the  requirements that\nthe software license:-\n\n_No Discrimination Against Fields of Endeavor_\n: The  license  must not  restrict anyone  from making  use of  the\n  program in a specific field of endeavor. For example, it  may not\n  restrict the programfrom being used in a business,  or from being\n  used for genetic research.\n\n_Distribution of License_ \n: The rights attached to the program  must apply to all to whom the\n  programis redistributed  without  the need  for  execution of  an\n  additional license by those parties.\n\nThe Original Sins \n-----------------\n\nThere  are two  separate, albeit  related, problems  which underlie\nthese apparently positive definitions: Individualism & Capitalism.\n\nIn each case, be it the 4F, DSG or the OSI, all positive rights are\nexpressed  purely in  _individual_ terms.  There are  no collective\nrights in these documents, just individual rights. The ideal of the\ndeveloper as an  individual is hard-coded into the DNA  of the Free\nSoftware Movement and its various children.\n\nThere are various reasons for this; Stallman's original tracts, for\nexample, idealise  his struggles with  the collapse of  the \"social\nclub\" of MIT's  AI Lab and emphasise his  private struggles against\nthe loss  of his community,  these experiences are  the cornerstone\nof  his  personal identity.  Bruce  Perens,  father of  the  Debian\nProject, holds to  the peculiar American cult  of the Individualist\nLibertarian, as  does Eric  Raymond, the  programmer/chronicler who\ndevised the  Open Source concept  with Perens  in the late  1990s -\nfree software without the freedom.\n\nIt  is  important   to  remember  that  the   American  version  of\nLibertarianism,  as  espoused  by  Ayn  Rand  and  her  ideologues,\nis   nothing  to   do   with  the   Franco-European  tradition   of\nlibertarianism, a spectrum of leftist anarchism running from Babeuf\nthrough  Déjacque to  Faure.  American  Libertarianism should  more\naccurately  be described  as  \"anarchist-capitalism\",  a strain  of\npseudo-political thought which idolises  the popular concept of the\nOld West as a high-point of western civilisation, when men were men\nand justice as dispensed from the barrel of a gun.\n\nIt is notable that the  sole non-individual right enunciated in the\nDSG and the OSD is that  of the **corporation**. Perens and Raymond\nwere certainly motivated  by the tenets of  capitalism, the primary\npurpose  of their  \"Open Source  Definition\" was  the packaging  up\nof  \"Free  Software\"  to  make it  acceptable  to  capitalists  and\nrent-seekers  of every  stripe. Their  collaborators in  this, most\nnotably  Brian Behlensdorf  and  Larry  Augustin, later  seamlessly\ntransitioned to the burgeoning Venture Capitalist industry.\n\nBe it as a  result of accident, as with Stallman,  or of design, as\nwith Perens/Raymond _et al_, these designers of the \"Holy Texts\" of\nFree  and  Open  Software  applied  no value  to  the  concepts  of\nCommunity and Commons.\n\nTo look again  at 4F3 & 4F4, the Freedoms  described are explicitly\nthe  Freedom for  the Individual  Programmer to  decide whether  to\nshare his value-added programs with  his community. More than that,\nin his  detailed expansion  on the Freedoms,  Stallman is  at pains\nto  explain  that his  Freedoms  do  not enforce  any  _obligation_\nupon the  Individual Programmer  to release  _his_ works.  In fact,\nin  his expanded  notes,  Stallman entitles  4F3  _\"The freedom  to\nredistribute, **if you wish**\"_:-\n\n> You  should also have the  freedom to make modifications  and use\nthem  privately in  your own  work or play, without even mentioning \nthat they exist. If you do  publish your changes, you should not be\nrequired to notify anyone in particular, or in any particular way.\n\nAgain, the entire  emphasis of Stallman's concept  of Freedom rests\non the  specific rights of  the Individual. Stallman,  moreover, is\nthe  \"hardcore\" of  this  movement,  the supposedly  non-commercial\nmember of the  group. The emphasis placed here on  the right to not\ndistribute if you wish may seem  trivial, however, it is central to\nthe overall failure of Free and Open Source Software.\n\nThe Resulting Problems \n----------------------\n\nToday, some  35 years after  Stallman's 4Fs,  we can see  that Free\nand  Open  Source Software  is,  in  almost all  conceivable  ways,\ntriumphant. It has  won its struggles against Microsoft,  it is the\ncore  of almost  all  smartphones,  it lies  at  the  heart of  the\nnetworked world we all inhabit.\n\nAmidst all this  glory, however, there is  something utterly broken\nabout the FOSS world. In short, it is one-sided, devoid of economic\nrights, and an active agent in the oppression of us all.\n\nAs a  result of the  underlying assumptions and conceptions  of the\nFOSS movement, there is no  methodology to _require_ the sharing of\nchanges and improvments  with the commons. The entire  focus of the\nFOSS movement is specifically geared towards individual rights, the\nfocus of the  Open-Source movement is on  ensuring that coporations\ncan freely  take the product  of individual labour and  profit from\nit.\n\nBecause of Stallman's original sin,  there is no accepted structure\nwithin the FOSS world wherein  such obligation to share changes can\nbe enforced by  the originator of a piece of  software. The DSG, in\nfact, specifically requires this  as a _precondition_ for inclusion\nin its repositories.\n\nThis    means   that    improvements   in    software,   bug-fixes,\nsecurity-patches and the like, remain  the absolute property of the\nperson  who has  made  them, despite  the fact  that  they are,  in\nNewton's words,  _\"standing on  the shoulders\"_  of those  who came\nbefore. The originator of the  software, in other words, is someone\nwho can count herself lucky to be afforded the \"exposure\" which may\ncome from the  future sale of her works by  a more powerful entity.\nThe entire function of FOSS is for developers to provide the fruits\nof  their  labour,  either  without recompense  or  for  fractional\nrecompense, to others.\n\nThe individual programmer  has the rights afforded them  by the 4Fs\nand  the  OSD,  but  those rights  are  inherently  solitary.  What\npossibility can there  be to enforce those rights,  limited as they\nmay be,  against the powerhouses  of our gilded age?  What economic\nrights  accrue to  our developers,  the people  who, in  Stallman's\nconception, are the origin point of the FOSS movement?\n\nTwo  recent  and pertinent  examples  can  be examined  to  provide\nanswers:  Heartbleed, the  security  vulnerability  in the  OpenSSL\nLibrary; and GitHub.\n\nOpenSSL, a  software library used to  secure communications against\neavesdropping,  was (until  Heartbleed)  primarily  written by  one\nperson, Stephen  Henson. The OpenSSL Foundation,  who employed him,\nhad never had more than $1m in annual funding, and this funding was\nobtained  almost  exclusively  through  third-party  contract  work\nwhich  focused  on specific  deliverable  product,  **not** on  the\n_\"fundamental maintenance and  development activities like releases\nmanagement, code review and  refactoring, performance and security,\netc.\"_[^openssl] The beneficiaries of  OpenSSL's public  nature had\ndonated, on average, some **$2,000** a year for this critical piece\nof software.[^ssl2]\n\nThe Heartbleed, vulnerability, when it became known, was a disaster\nof almost unimaginable proportions.  Entire sectors of the internet\nwere vulnerable  to this exploit  thanks to their reliance  on this\ncrucial underfunded  piece of  software. Companies like  Amazon Web\nServices (annual sales, $5.11bn), Stripe (market valuation, $245bn)\nand Cisco Systems (annual income, $50bn) were exposed.\n\nThat's not just  standing on the shoulders, that's  standing on the\nshoulders  while the  owner of  the  shoulders is  five feet  under\nwater. To a great extent, the  people who write FOSS software don't\neven see this  as a problem, they're happy to  have someone shoving\nthem under the water.\n\nTake, as  a different example, GitHub  - the repository of  much of\nthe  FOSS  world's  source  code.  Its  entire  business  model  is\npredicated on the  willingness of creators to share  the product of\ntheir labour  with the  wider world.  These creators[^1]  offer the\nproduct of  their labour to  the site,  solely in exchange  for the\nchance of exposure and discovery.  There is no contract with GitHub\nwhich can  provide payment  for this  delivery, save  the ephemeral\nback-slap  of the  \"Star\" and  the prospect  of collaboration  with\nothers.\n\nMicrosoft,  when they  acquired GitHub  in 2018  for $7.5bn[^MSGH],\nbarely   mentioned   the   creators  in   their   carefully-crafted\nlawyer-approved statement.  They placed  a value of  seven thousand\nfive hundred  million dollars on  this company, absolutely  none of\nwhich  accrued to  the  people  who offered  their  labour to  that\ncompany. Apart from a few cranks[^2], almost no-one protested this.\nThis has  become such a  feature of the  FOSS world that  it barely\nmerited attention.\n\nIt  is simply  not  sustainable for  the commons  to  be a  one-way\nsupplier  of  intellectual  property to  massive  corporations.  In\naddition, the rights of the programmer must include the right to be\n_paid_ for the work of programming  and for value derived from that\nwork.\n\nAs things are,  FOSS not only doesn't provide value  to the writers\n(by recompense for their labours),  it only delivers value to those\nwho are  best placed  to _exploit_  this labour.  These exploiters,\nthanks to  the dogmatism of the  FOSS world, are under  no positive\nobligation to provide any recompense.\n\nIf  you  are a  lone  programmer,  working  in  a field  which  you\nunderstand implicitly, then  your works will be  taken by corporate\nentities and monetised. As long as they do not sell that _software_\n(narrowly defined) then  they are under no obligation  to note your\ncontribution.  If they  utilise it  internally as  an organisation,\nthen they don't even have to share their changes (security patches,\ngeneral improvements) with anyone.\n\nIn the case  of permissive licenses (like the MIT  License) the few\nprotections afforded the software source evaporate completely. Even\nwith strong  copyleft licensing in  place, the enforcement  of that\ncopyleft  license is  of course  left entirely  to the  programmer.\nWhile there are  some examples of assistance being  provided by the\nSoftware Freedom  Conservancy and others, these  are not ordinarily\navailable to the average GitHub user.\n\nThe  SFC, for  example,  will  only act  in  the  case of  software\n\"member   projects\".   Just  to   become   a   member  project,   a\ndeveloper/organisation is required to  license their software under\na FSD/OSD License  _and_ to license all  documentation under either\nthat license  _or_ CC-BY-SA.[^SFC]  Again, we see  the institutions\nof  FOSS acting  primarily  in  the interests  of  free labour  and\nexpropriation.\n\n\nThe imbalance  of resources between  that user and, say,  Amazon or\nGoogle, renders any  chance of enforcing a  copyleft restriction so\nsmall as  to be non-existent.  Even if the evidentiary  standard is\nmet, the costs of litigation are prohibitive.\n\nFinally,  FOSS is  readily  available  for use  by  the very  worst\nelements of  our techno-dystopian  world. Again, deriving  from the\nOriginal Sin of the Free Software movement, in particular 4F0:-\n\n> The freedom to run the program as you wish, **for any purpose**.\n\nThis is  a gaping  sore at the  heart of the  FOSS world.  \"For any\npurpose\"  encompasses a  multitude -  be that  the use  of FOSS  by\nmilitary  organisations, such  as  the USAF's  \"Global Hawk\"  drone\nprogram; or by surveillance operations, like GCHQ or the NSA; or by\nface-recognition programs in public places.\n\nIt is  the stated position of  the FOSS movement that  all of these\nuses  are  _fine_,  and  all  are to  be  welcomed.  Usually,  this\ndeclaration  is  accompanied with  some  expert  deployment of  the\nconsequentialist fallacy. Like the tech-giants and hate speech, the\nreasoning proceeds that if we do  anything to stop it, then we have\nto stop everything. Better then to do **nothing**.\n\nAny attempt  to question this fallacious  reasoning usually results\nin a cavalcade of FOSS-advocates attacking the querist. It is clear\nthat  this issue  triggers such  behaviour at  a deep,  fundamental\nlevel. This is hardly surprising, after  all, anyone who is in deep\ndenial  will  instinctively lash  out  against  any impingement  of\nreality into their delusions, and so it is with FOSS.\n\nTowards an Alternative \n----------------------\n\nIn these  circumstances, what  then are the  features of  a license\nwhich I feel  would offer support to the values  I hold? I'd prefer\nto have a different set of Freedoms, which emphasise the importance\nof  community  and  collaboration,  which require  the  sharing  of\nimprovements, which  are deliberately  structured so as  to prevent\nthe  expropriation  of  labour,  and  which  have  certain  ethical\nstandards at their core.\n\nThese then are my proposals for a new set of freedoms:-\n\n1. The freedom for  any person to decide to limit  the use of their\n  software for  any purpose  or category of  purposes shall  not be\n  restricted, subject only to the requirements of the principles of\n  equality and non-discrimination.\n\n2. The  freedom for any natural  person to run the  program as they\n  wish, subject to the first freedom.\n\n3. The freedom to study how the  program works, and change it so it\n  does your computing  as you wish. Access to the  source code is a\n  requirement of this freedom.\n\n4. The  right of  the commons  to be provided  with changes  to the\n  software is essential to ensuring the sustainability and security\n  of the  commons. Provision of all  changes to the commons,  in so\n  far as can be permitted by circumstances, is required.\n\n5. The  freedom for any writer  to decide that availability  of the\n  program to persons other than provided in the first four freedoms\n  is a matter  which is outside the  scope of the license,  and i s\n  properly  subject to  a  contract of  the  writer's choice  being\n  entered into by those persons.\n\nThose are just  ideas, ones that I've been kicking  the tyres of in\nmy  own  time.  I  believe  that  these  five  freedoms  provide  a\nconceptual framework which can\n\n- Assure the viability of the commons\n- Provide for the economic rights of the programmer\n- Permit ethical design\n\nRequest for Comments\n--------------------\n\nAs of  this writing[^3], I've  identified five licenses  which meet\nsome, though by no means all, of my criteria:-\n\n-  Dmitri Kleyner's  Peer Production License [1]  describes  itself \nas copyfarleft,  forbids use by commercial entities, and is heavily  \nbased  on the Creative  Commons  \"No Commercial\"  License variants.\n\n- The  Cooperative  Software License  [2] is derived  from the PPL, \nand attempts to shift the focus yet further into software.\n\n- The Fully Open Public License [3] is not a \"copyfarleft\" license,\nbut  it  is an  attempt  to  place  source-provision in  a  license\ncontext, and is deserving of attention.\n\n- Kyle  Mitchell's LicenseZero  project has the  Prosperity License\n[4], which is a permissive license which preserves the right of the \nprogrammer to be paid.\n\n-  The same  project's Parity  License  [5] seeks  to preserve  the\nrights of the commons, but the two are not combined. These licenses\nhave the  singular virtue  of being  drafted in  a far  more modern\nlegal syntax.\n\nObviously, I'd be delighted to  learn of other licenses which start\nto meet my Five Freedoms.\n\n________References_________________________________________________\n[1]:\thttp://wiki.p2pfoundation.net/Peer_Production_License\n[2]:\thttps://coinsh.red/c/csl.txt\n[3]:\thttps://github.com/pjakma/fopl\n[4]:\thttps://licensezero.com/licenses/prosperity\n[5]:\thttps://licensezero.com/licenses/parity\n\n________Feetneet___________________________________________________\n\n[^GNU]: The GNU Operating System \"The Gnu Manifesto\"\n  <https://www.gnu.org/gnu/manifesto.html> \n  2015/06/02 12:55:15 [accessed 2019-03-28]\n\n[^FSD]: The GNU Operating System \"What is Free Software\"\n  <https://www.gnu.org/philosophy/free-sw.en.html>\n  2019/03/20 10:56:16 [accessed 2019-03-28]\n\n[^DFSG]: The Debian Project  \"The Debian Social Contract\"\n  <https://www.debian.org/social_contract#guidelines>\n  1.1 2004/04/25 [accessed 2019-03-28]\n\n[^OSD]: The Open Source Initiative \"The Open Source Definition\"\n  <https://opensource.org/docs/osd>\n  [accessed 2019-03-28]\n\n[^openssl]: Steve Marquess \"Of Money, Responsibility, and Pride\"\n  <https://veridicalsystems.com/blog/of-money-responsibility-and-pride/index.html> \n  2017 [accessed 2019-03-28]\n\n[^ssl2]: Marquess, _ibid._\n\n[^MSGH]: Microsoft \"Microsoft to acquire GitHub for $7.5 billion\" \n  <https://news.microsoft.com/2018/06/04/microsoft-to-acquire-github-for-7-5-billion/> \n  2018/06/04 [accessed 2019-03-28]\n\n[^SFC]: The Software Freedom Conservancy \"Applying to Join Conservancy as a\n  Member Project\" \n  <https://sfconservancy.org/projects/apply/> \n  2018-05-25 [accessed 2019-03-28]\n\n[^1]: disclosure: I once counted myself among them \n\n[^2]: again, I was one of them\n\n[^3]: 2019-03-28",
			"added": 1566671181
		},
		{
			"topic_id": 1567210251,
			"title": "Are shitposts more annoying than advertising?",
			"body": "Is there a type of posting you find even worse to tolerate than ads?",
			"added": 1567210246
		},
		{
			"topic_id": 1567232126,
			"title": "Anything You Post Here May End Up in a Blog Spam on the Surface",
			"body": "Scraping services that index the darknet are being used to feed keyword stuffing/blog spam/link spam on the surface.\n\nThey sell the data for law enforcement too.\n\nStay safe.",
			"added": 1567232120
		},
		{
			"topic_id": 1572747647,
			"title": "The Urgent Need For Worker-owned Media",
			"body": "https://www.currentaffairs.org/2019/10/the-urgent-need-for-worker-owned-media\n\n>When we set up Current Affairs in 2015, we were adamant that we would have no investors or advertisers. The company would be owned by its editorial board, funded entirely by subscriptions and donations, and all profit would be reinvested in the company; nobody would be able to get rich from Current Affairs. Of course, that meant building very slowly: Seed money from an investor could have “jump started” us. But it’s worth it: It means that even though we’re smaller than nearly any other magazine, we are actually very, very safe. We do not have to worry that some investor will turn on us, or that we will displease the advertisers. We have to keep our readers happy, of course. But otherwise we’re beholden to no one. (We are very, very lucky, and when we see more and more news stories of media colleagues losing their jobs, it makes us appreciate just what a rare privilege independence is.) \n\n>If, on the other hand, Current Affairs was not owned by its workers, and its benefactors could sell us out when it pleased them, I might one day find myself reporting to someone who found our slow growth frustrating. And why no ads? Everyone has ads. So we’d be forced to take on ads. And we’d be told to double our output. And to do videos. And “sponsored content.” (Like the New York Times does with the fossil fuel industry.) In other words, our ownership and management structure is absolutely critical. It means that nobody can just wake up and decide to tell all the writers that we’re “going in a different direction.” I’m the editor, but I report to the board, who ultimately decide whether I’m doing a good job. This means that we have a lot of very democratic decision-making: Everyone at Current Affairs has a chance to participate in a discussion over big changes in the company. We operate on a kind of informal consensus process, meaning that even one person’s strong objection would carry a lot of weight.\n\n>Now, look, Current Affairs is small and it’s easier for us to do this because we have four paid staff. But the point is: If we are to stand a chance of having quality independent media, we must build the worker-owned, reader-funded model. Maybe advertising is a necessary evil—though there needs to be strict ethical practices around “native advertising” and other forms of corporate brainwashing. But ownership and control must be with employees and the company must be governed democratically. Non-profit, for-profit, I’m undecided—personally I don’t like the pursuit of profit and I don’t really engage in it (to the consternation of our accountants). But what I know is that we can’t afford rich billionaire owners.",
			"added": 1572747640
		},
		{
			"topic_id": 1573839291,
			"title": "\"Science\" Tribals",
			"body": "They are the descendants of doctors/engineers/scientists, or people who came across some research institute or something.\n\nThey have all the knowledge of how things work, but not any of the underlying knowledge of why. \n\nThey've made a cargo cult out of whatever specific set of knowledge they've descended from.\n\nThey maybe can actually do feats of engineering, medicine, etc, but only because the ritual of performing those actions have been taught to them.\n\nThey may dress up like a scientist, not because they know how a head mirror works or the purpose of a lab coat, but because that costume is just that, a costume, worn because that's just what you're supposed to wear.",
			"added": 1573839283
		},
		{
			"topic_id": 1573923562,
			"title": "*If someone resurrected Compuserve, I'd Pay*",
			"body": ">Again. The signal to noise ratio was insane. Having to part with real money tends to focus the mind and the tongue.\n\n[A comment by phs318u.](https://news.ycombinator.com/item?id=21551101)",
			"added": 1573923553
		}
	],
	"topic_vote": {
		"1561879672_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1
	},
	"next_comment_id": 30,
	"comment": {
		"1561879672_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": [
			{
				"comment_id": 1,
				"body": "Both are despicable, none.",
				"added": 1561897302
			},
			{
				"comment_id": 4,
				"body": "> [atomiserxenolith](#comment_98_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): What would you suggest as an alternative to the ideology of rape, which we call 'democracy', that is worshiped throughout the world?\n\nThere are many proposals for alternatives already. The problem is to act and get there.\nBut people are waking up and speaking out about this farce. One example: https://kiwifarms.is/members/simply-outplayed.37061/#profile-post-comment-210139",
				"added": 1561975864
			}
		],
		"1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 3,
				"body": "Seems interesting, but when it comes to tagging I would prefer to see a way to use perceptual comparison/match of images and videos for automatic tagging.",
				"added": 1561919681
			}
		],
		"1561669164_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 5,
				"body": "But is it really paranoia if people around you really show all the signs of being monsters?\nFor me it is just informed decision making.",
				"added": 1562016771
			}
		],
		"1562935521_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU": [
			{
				"comment_id": 6,
				"body": "Any idea about what happened to Feedseer (pleroma client)?\n[Saw](https://medium.com/@sunilbandla/introduction-to-feedseer-5787cff7254) that they had an AI filtering option and wanted to try, but looks like the project is dead.\nKnow any other client with good filtering?",
				"added": 1562984727
			}
		],
		"1563540336_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 7,
				"body": "It is possible to decouple rendering from presentation, so that a rendering browser can run on one machine and the results are presented to the user in another machine, with a second browser. There are prototypes floating around already, I expect to see it become more common place in a few years.",
				"added": 1563577814
			},
			{
				"comment_id": 8,
				"body": "> [filips](#comment_98_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): If you need to make money with it, you can still make open source project. You can maybe use open source (probably MIT) license for personal usage and paid license for commercial usage. [...]\n\nThere is an AGPLv3 project that has its latest version sold for a small fee, with older versions openly available, yet I have seen someone write that because the latest version was behind a \"paywall\", the whole project \"went against everything free software stood for\".\n\nIf only that were the odd case, but most often than not, people are too entitled to contribute back.\n\nGoogle has a monopoly because it is willing to finance developers, much more than the free software crowd ever will. So I can't say I feel bad seeing the current state of the Internet, it is a self inflicted wound.",
				"added": 1563637169
			},
			{
				"comment_id": 11,
				"body": "> [toyata](#comment_72_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): like here, again, where is the project name, link, anything concrete missing.\n\nThere is a lot of trash on the streets, why don't you go catch some cans to sell.",
				"added": 1563714240
			},
			{
				"comment_id": 13,
				"body": "> [toyata](#comment_74_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Thats what i meant: Rather proving the point, instead of posting something useful. Qed.\n\nVery useful for me if it makes you shut up and go away. Could not care less if it is useful to you.",
				"added": 1563762250
			}
		],
		"1563401746_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 9,
				"body": "Richard Stallman said he searched by sending an email, then a daemon would gather the results and send them back. I wonder if that still works for him.",
				"added": 1563637491
			},
			{
				"comment_id": 10,
				"body": "> [xcape2net](#comment_126_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): How are you guys adding links in your comments\n\nMarkdown formatting.",
				"added": 1563658920
			}
		],
		"1563223926_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 12,
				"body": "Great, Zeronet should not be like the Feedverse and the scum commie's \"group above everything else\" mentality.",
				"added": 1563723511
			}
		],
		"1565458487_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": [
			{
				"comment_id": 14,
				"body": "Too much already, more interested in tools to handle the deluge.",
				"added": 1565460929
			}
		],
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 15,
				"body": "Everything is being logged, EVERYTHING.",
				"added": 1565550859
			}
		],
		"1565734523_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 16,
				"body": "Are you actually going to be releasing anything interesting? If yes, I am sure people will spread the word and it will find those interested.",
				"added": 1565804053
			}
		],
		"1565729654_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 17,
				"body": "Everything you wrote so far screams **DUMB**, so don't be surprised that people don't reply.",
				"added": 1565804366
			}
		],
		"1568112876_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF": [
			{
				"comment_id": 18,
				"body": "So you are either dumb, lazy or poor (probably all of these), because there is a simple fix for that.",
				"added": 1568115853
			},
			{
				"comment_id": 19,
				"body": "> [uisdhgf](#comment_1_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF): i'm literally dying to hear it\n\nJust die already, I have no use for you.",
				"added": 1568116798
			}
		],
		"1568118783_1M6Q7qRmEakfzdS5BA54WZs9Zksxo3QsvF": [
			{
				"comment_id": 20,
				"body": "What is the point of having a brain if you can't think for yourself?",
				"added": 1568119777
			}
		],
		"1568498469_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 21,
				"body": "Biggest irony is that most of the machines that spread the outrage mob were running GNU/Linux or another Free OS.",
				"added": 1568697733
			}
		],
		"1569007083_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 22,
				"body": ">If you have any questions feel free to ask me.\nWhat are the login and password of your bank account?",
				"added": 1569007623
			}
		],
		"1569089727_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 23,
				"body": "Go ahead and make them, stop complaining.",
				"added": 1569090602
			}
		],
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 24,
				"body": "Glad you think so, would not want to share a mail server with a moron like you.",
				"added": 1569889822
			}
		],
		"1570142685_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": [
			{
				"comment_id": 25,
				"body": "Like 4chan with the /r/ board being ignored and requests being posted everywhere?",
				"added": 1570145833
			}
		],
		"1571246742_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 26,
				"body": "Useless if not HTML.",
				"added": 1571269821
			}
		],
		"1572747647_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 27,
				"body": "Not that I expect the losers around here to manage not even half of that, but it is a good piece.",
				"added": 1572747788
			},
			{
				"comment_id": 28,
				"body": "> [12681754zuizuftu](#comment_6_1FfVZsqx8Bo1zvBHSen2Z2SYg8UCFPgsoE): judeo-bolshevik propaganda\n\nTheir crap sells. And yours? Not even this you can do, loser.",
				"added": 1572805202
			}
		],
		"1575419519_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 29,
				"body": "> [z3n5if](#comment_112_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): my fault\nYour fault is to expect anything good for free.\nFor free, only shit or a blade in your heart.",
				"added": 1575528800
			}
		]
	},
	"comment_vote": {
		"126_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"129_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}