{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Afinal, do que se trata a Astronomia? - Parte I",
			"body": " #Para começar, vou delimitar o que eu viso nessa sequência de textos, para que tudo fique bem claro e não hajam confusões. Aliás, um dos propósitos do texto é, justamente, o esclarecimento. A intenção não é apresentar uma nova concepção acerca do que seja Astronomia e sim, dar uma ideia do que seja. É importante entender que ao estudar o que quer que seja, devemos saber do que se trata e ter uma boa ideia de cada termo pertencente à área de estudo. A Astronomia, assim como outras áreas do conhecimento, possui sua própria terminologia. Outro ponto dessa sequência de textos será introduzir uma abordagem filosófica a respeito das ciências, indo um pouco além da Astronomia, mas não tocando na parte histórica e sociológica da ciência com o devido rigor necessário.\n\n\n #A Astronomia é, antes de tudo, uma ciência e como qualquer ciência, é uma atividade humana, mesmo que o que ela aborde sejam entes e ocorrências que se apresentem na realidade chamada de OBJETIVA, que aqui estarei entendendo como a realidade em se supõe que os elementos existem e funcionam de modo independente da existência do sujeito, mesmo que para serem conhecidos dependam das percepções sensoriais ou experiência externa dos seres. Então, se a Astronomia é uma ciência que aborda entes e ocorrências, que tipos de entes e ocorrências ela aborda? Qual é a delimitação? Como esses estudos funcionam? Os entes estudados são sistemas que estão fora da superfície e da atmosfera terrestre, como planetas, luas, estrelas, asteroides, planetoides, nuvens de gás, galáxias e outros. Mesmo um meteoro que entre em combustão ao adentrar na atmosfera terrestre, também é objeto de estudo da Astronomia, mas não porquê pode ser visto pelo telescópio e sim, porque é proveniente de lugares externos em relação à superfície e atmosfera terrestre. As ocorrências estudadas pela Astronomia são todos eventos que esses entes experimentam, como por exemplo, eclipses lunares e solares, a mudança de brilho de um planeta, a mudança da localização dos astros em geral e assim por diante. Através dos estudos dessas ocorrências, pode-se fazer várias previsões, que podem ser úteis para se construir calendários, por exemplo. A Astronomia portanto, é uma ciência puramente observacional (no que se refere à base para se realizar previsões), uma vez que os elementos de estudo se encontram fora da superfície e atmosfera terrestre. As previsões são feitas com base nos dados colhidos e das observações a respeito dos comportamentos regulares dos sistemas celestes em geral (planetas, luas, estrelas etc).\n\n\n #O cerne dos estudos feitos nessa área é, portanto, uma investigação, pesquisa e sistematização do conhecimento que se pode ter acerca do movimento e da posição dos astros, bem como das previsões disso tudo. No entanto, a Astronomia não busca formular leis a respeito das ocorrências que se dão com os astros, em termos gerais, como por exemplo, através de alguma lei que enuncie um comportamento regular de forma genérica, obtida através da indução. Muito menos diz algo a respeito do porquê os astros se comportarem de determinada maneira e não de outra maneira. Não diz nada a respeito, por exemplo, do porquê o brilho dos astros ter uma certa magnitude, ou ainda, do porquê dos astros se moverem em primeiro lugar. Também se vale das leis de uma outra ciência para realizar estudos acerca dos astros, que no caso, é a Física, que eu voltarei a falar na segunda parte do texto. Mesmo as leis não dizem nada sobre o porquê de algo ocorrer. Como disse o filósofo austríaco Ludwig Wittgenstein, na sua obra Tractatus Logico-Philosophicus, “A grande ilusão da modernidade é que as leis da natureza explicam o universo para nós. As leis da natureza descrevem o universo, elas descrevem as regularidades. Mas eles não explicam nada”. Trata-se de algo bastante patente e justificável. As leis são proposições que, poderiam estar associadas a um conteúdo descritivo, normativo ou explicativo. Nenhuma lei da natureza vai PRESCREVER algum comportamento natural (elas não determinam nenhuma ocorrência) e nem sequer vai deter informações a respeito das causas primeiras e razões últimas de algo ocorrer, de modo a EXPLICAR o que ocorre, que se trata das questões teleológicas e metafísicas a respeito. Elas podem ser verificadas na medida que podemos averiguar o que elas enunciam, ou seja, seu valor de verdade depende da experiência, ao contrário das proposições tautológicas, que são necessariamente verdadeiras. Você pode DESCREVER, por exemplo, como seu deu o processo de um projétil disparado por uma arma atingir alguma pessoa, valendo-se das leis da física, como conservação de energia e a lei da ação e reação. Mas as leis não conterão nada que diga o motivo de se ter disparado o tiro e nem sequer se o que foi feito é correto ou não, bom ou mau e outros valores. O que a lei pode descrever é que considerando a existência de um certo agente A (a pessoa que disparou o projétil com a arma) e das demais entidades que participaram da ocorrência (arma, pólvora, munição, molas e tudo o mais), a bala vai se comportar de uma maneira específica e os atributos que possui (como energia cinética e quantidade de movimento) ao serem quantificados, vão exibir determinadas variações de seus valores, havendo relações matemáticas que expressam como isso se dá, como a equação do trabalho resultante para sistemas dissipativos. Mas parte da existência desses agentes e desses mecanismos, bem como das variadas relações de causa-efeito existentes. Portanto, eliminando as possibilidades de leis serem proposições explicativas e normativas, resta a consideração de que são descritivas. Como C.S. Lewis disse: \"As leis da natureza não produzem evento algum. Elas especificam os padrões aos quais todo evento, uma vez que tenha sido induzido, deve se conformar. Do mesmo modo que as regras da aritmética especificam os padrões que qualquer transação monetária deverá obedecer, isto é, se você já tiver todo o dinheiro. Assim, em certo sentido, as leis da natureza cobrem todo o campo do espaço-tempo. Em outro sentido, excluem precisamente todo o universo real: o fluxo incessante de eventos que perfazem a verdadeira história. Isso deve provir de outro lugar. Pensar que as leis podem produzir o universo é como pensar que pode criar dinheiro real apenas fazendo contas. Pois em última instância, toda lei diz: Se você tiver A, logo mais terá B. Mas a posse de A é uma pré-condição. As leis não podem criá-lo. A contabilidade, mesmo continuada pela eternidade, jamais produzirá um centavo.\"\n\n\n #A partir dessas considerações, pode-se concluir que a Astronomia é uma ciência descritiva e se vale das leis físicas para descrever e realizar previsões das localizações e dos movimentos dos sistemas celestes. Mas o próprio conteúdo dessas ciências é amplamente restrito e sua limitação é facilmente vista, dado que elas não dão conta de responder uma ampla série de questões e muitas delas, questões fundamentais. Disso, pode-se inferir que não se pode falar de estudos astronômicos por exemplo, para resolver problemas de ordem epistemológica, lógica, teológica, teleológica, metafísica, ética e artística. Mesmo que uma pessoa admire muito a imagem de uma nebulosa, a Astronomia não dirá nada a respeito da beleza ou da feiura dessa imagem. Tampouco os estudos astronômicos servem para normalizar as ações humanas e nem para se tecer considerações a respeito das causas primeiras e razões últimas, como no caso do surgimento do universo. NÃO SERVE PARA REFUTAR E NEM PROVAR A EXISTÊNCIA DE ELEMENTOS QUE ESTÃO INSERIDOS EM OUTRAS REALIDADES, COMO ANJOS, ESPÍRITOS, DEMÔNIOS E DEUSES. Como é uma atividade humana, dependem da existência de pessoas para passar a ser uma investigação e sistematização, como dito acima, além também, de contar com a suposição de que o comportamento da natureza é compreensível por seres inteligentes e também, que existe um mundo externo em relação às percepções mentais, independentemente da razão de existir e das causas que provocam a existência das particulares ocorrências que se manifestam na natureza.\n\n\n- FONTE: https://www.amantesdaastronomia.org/2018/10/afinal-do-que-se-trata-astronomia-parte.html",
			"added": 1549653052
		},
		{
			"topic_id": 2,
			"title": "Liberland",
			"body": "Liberland ou Liberlândia, oficialmente República Livre de Liberland, é uma cidade-estado soberana localizada numa região não reclamada na região da fronteira Croácia-Sérvia, na parte ocidental do Rio Danúbio. É uma nação auto-proclamada em 15 de abril de 2015 pelo atual presidente libertário Vít Jedlička. A região ocupada pelo país não é reclamada pelos países que fazem fronteira.\n\n- Website governamental: https://liberland.org/",
			"added": 1549655065
		}
	],
	"topic_vote": {
		"1_142x9Nc3cD5zBCsNd2i8vNLTUGHipwCNo4": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_183j7y1ArHbMyMvdxH2yaMndEvZzddKpD1": 1,
		"2_142x9Nc3cD5zBCsNd2i8vNLTUGHipwCNo4": 1,
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1
	},
	"next_comment_id": 7,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Afinal, do que se trata a Astronomia? - Parte I\n\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_142x9Nc3cD5zBCsNd2i8vNLTUGHipwCNo4/Afinal+do+que+se+trata+a+Astronomia+Parte+I",
				"added": 1549653816
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "#Garantia de Morte\n O policial Louis Burke é um policial designado ao serviço de entrar em uma violenta prisão como prisioneiro para investigar uma série de assassinatos. Mas, usando suas incríveis habilidades em artes marciais, o policial é capaz de preservar sua vida e de conquistar o respeito de outros presos naquele ambiente violento. E, com a ajuda de outros dois prisioneiros, Louis vai conseguindo descobrir a verdade por trás dos crimes que ele fora investigar. \n\n- https://youtu.be/VbrJ_ZsCe9s",
				"added": 1549654528
			}
		],
		"2_142x9Nc3cD5zBCsNd2i8vNLTUGHipwCNo4": [
			{
				"comment_id": 3,
				"body": "#Liberland, uma nação construída com bitcoin\n- https://guiadobitcoin.com.br/liberland-nacao-bitcoin-construiu/",
				"added": 1549655386
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 4,
				"body": "#Homens e mulheres são ainda mais diferentes do que se imaginava: a desigualdade começa na concepção \n\nQuais são as principais diferenças entre o homem e a mulher? A resposta provavelmente não é a que você está pensando ou, ao menos, não é apenas o que você pode estar pensando. Mas, se passou por sua cabeça a distribuição dos cromossomos no núcleo celular, o funcionamento do hipocampo cerebral, a velocidade das cordas vocais e da respiração, a largura da bacia, a proporção de gordura, a mucosa do estômago e a quantidade de suor e de lágrimas derramadas, então você acertou. Pois todas estas são grandes diferenças entre o homem e a mulher. E, claro, não são as únicas. Igualdade entre os sexos, ao pé da letra, nunca existiu. Desde a concepção, homem e mulher são diferentes. No óvulo existem 23 cromossomos, todos iguais, com a forma parecida à de um X, em quanto entre os 23 cromossomos do espermatozóide pode haver um cromossomo com a forma de Y. É o homem, portanto, quem determina o sexo: a união de um cromossomo Y com o X do óvulo gera um menino; X com X faz nascer menina. Mas a diferença também é quantitativa pois a loteria desse casamento de cromossomos parece favorecer os homens: estatisticamente, para cada 100 meninas que vêm o mundo são concebidos 105 meninos. Em compensação, meninos tendem a morrer mais que meninas — o que mantém o equilíbrio entre os sexos na população.\n\nEm primeiro instante, o sexo cromossômico de uma pessoa só se manifesta no embrião entre a sétima e a décima semana de vida. Até então, menino e menina se parecem. Mas, nesse período, o cromossomo Y faz com que certos tecidos, cuja tendência seria formar ovários ou glândulas sexuais femininas, se transformem em testículos, as glândulas sexuais masculinas. “Uma pequena produção de hormônios no feto”, explica o endocrinologista Jairo Hidal, da Escola Paulista de Medicina, “de alguma maneira deixa no cérebro uma marca (ainda não localizada) que o faz trabalhar ou à maneira masculina ou feminina.” A forma de trabalhar, por sinal, é a única divergência entre o cérebro masculino e o feminino.\n\nDurante muito tempo falou-se, para alegria dos homens, na diferença de tamanho: de fato, o cérebro da mulher pesa em média 1,150 quilo e o do homem chega a 1,400 quilo. Mas hoje os cientistas sabem que o tamanho do cérebro não documenta necessariamente inteligência. “Na realidade, nem homem nem mulher usam todos os seus neurônios, de maneira que o tamanho do cérebro dá e sobra tanto para um como para outro”, pensa o neurologista José Levy, da Faculdade de Medicina da USP. “A única diferença importante ocorre na região cerebral do hipocampo, que trabalha de forma contínua nos homens e ciclicamente nas mulheres.” Ou, como prefere o endocrinologista Hidal, “o hipocampo feminino atua de modo mais sofisticado”. O hipocampo governa a hipófise – a glândula-mãe situada no cérebro, na altura das sobrancelhas que comanda as demais glândulas do organismo. Todas elas, aliás, já funcionam na criança, com exceção das gônadas, as glândulas sexuais, para as quais a hipófise acorda num belo dia – é o início da puberdade. No caso do homem, começa então a haver uma comunicação contínua entre a hipófise e os testículos. A hipófise manda dois hormônios pela circulação até que os testículos comecem a produzir testosterona, o hormônio masculino. Já na mulher, a hipófise primeiro ordena que os ovários fabriquem uma série de hormônios do grupo chamado estrógeno. No pico dessa produção, há uma queda brusca; então, a hipófise determina que os ovários produzam um segundo hormônio, a progesterona. É como se existisse um relógio no organismo feminino: ao longo do mês, a taxa hormonal do homem é sempre a mesma; na mulher, varia conforme o dia do ciclo menstrual.\n\nPois o corpo feminino está continuamente se preparando para a gravidez. A diferença na regulação dos hormônios produz efeitos onde menos se espera. “A mulher tem a necessidade de respirar ligeiramente mais depressa que o homem”, informa o pneumologista Flávio Tavares Martins, do Hospital Albert Einstein, de São Paulo. Respirar mais rápido, porém, não significa ter mais fôlego. A capacidade pulmonar do homem é que é maior (de 25 a 33 por cento). Isso lhe garante um desempenho melhor, por exemplo, em exercícios aeróbicos.\n\nA vantagem no fôlego tem lógica: o homem possui mais massa muscular, que precisa de oxigênio para trabaIhar. A massa muscular é fruto da ação, na puberdade, dos hormônios masculinos, os andrógenos. Tão essenciais são esses hormônios que até as mulheres os têm, embora em proporção consideravelmente menor— cerca de 6 por cento do total masculino. Sem eles, não haveria academia de ginástica capaz de proporcionar às damas músculos mais desenvolvidos. Aos 17 anos, pouco mais da metade do peso do rapaz corresponde aos músculos; já na moça, a massa muscular eqüivale a 40 por cento do peso. A mulher, em compensação, tem mais tecido gorduroso concentrado principalmente na região das coxas e dos quadris.\n\nUma das hipóteses para explicar o fato de a mulher ter mais gordura e o homem mais músculo é a de que em tempos primitivos a função do sexo feminino era exclusivamente a maternidade. A gordura, supõem os cientistas, seria uma fonte adicional de energia, necessária para levar uma gestação até o final. Já o homem precisava ter mais força para correr em busca de alimento e literalmente lutar pela vida da família. Com tanto músculo, é natural que um homem adulto seja mais consumista: ele deve ingerir 2 700 calorias diariamente, enquanto a mulher precisa somente de duas mil. Essa diferença eqüivale a uma xícara cheia de açúcar.\n\nO homem, portanto, sente mais fome—a não ser quando a fome feminina é apenas fruto de ansiedade. “Mas as mulheres têm mais necessidade de comer carne do que os homens”, nota a nutricionista Midore Ishii, da Faculdade de Saúde Pública da USP, “porque elas precisam mais de ferro, um mineral essencial à formação de glóbulos vermelhos, para repor as perdas da menstruação.” Engana-se, porém, quem pensa que as formas femininas são determinadas exclusivamente pela distribuição de gordura no corpo. É que os ossos também têm sexo. “A bacia da mulher é bem mais larga que a do homem, porque um bebê deve passar por ela”, explica o antropólogo Daniel Munoz, da Faculdade de Medicina da USP.\n\nA abertura infrapúbica na mulher fica em torno de 90 graus e no homem se limita a 60. No homem, o sacro— osso da parte de trás da bacia—é mais retilíneo, de forma que, ao se observar a sua bacia por cima, vê-se que o canal pélvico é quase fechado. Na mulher não existe a barreira do sacro, que se curva para trás, conferindo-lhe por tabela um bumbum mais arrebitado. “Como a distância entre os joelhos é a mesma em homens e mulheres, o fêmur também passa a acusar o sexo”, aponta Munoz. Na verdade, como a bacia da mulher é mais larga, o fêmur acaba ficando inclinado; no homem, porém, sua posição é mais reta.\n\nO crânio também difere conforme o sexo, embora não se saiba por quê. A mulher tem o osso frontal da testa mais reto, o ângulo nasal mais aberto. Já o homem tem uma protuberância na altura das sobrancelhas e arcos nasais mais fechados.\n\nO hormônio masculino, provavelmente pelo mesmo motivo que provoca o desenvolvimento de músculos, torna os ossos mais fortes nos homens. Além disso, comparando-se um homem e uma mulher da mesma altura, pode-se notar que o homem tem pernas e braços mais longos—talvez porque a mulher devesse reservar espaço no tronco para a gestação. Os ombros femininos são estreitos, o que deixa os braços da mulher naturalmente mais encostados na cintura—um trejeito usado e abusado por atores quando interpretam personagens femininas.\n\nMas o fato de o corpo do homem ter proporções maiores que o da mulher acaba resultando numa diferença que só pode ser percebida pelo ouvido: a voz. Por uma lei da Física, quanto maior for o chamado trato vocal— o tamanho da laringe, das caixas de ressonância e das articulações—mais grave será a voz. “Podemos comparar a voz do homem a um violoncelo e a da mulher a um violino”, diz a fonoaudióloga Leny Cristina Kyrillos. Até a adolescência, as vozes masculinas e femininas têm um mesmo tom. Mas depois os hormônios provocam o desenvolvimento da laringe e das cordas vocais—e aí o tom é outro.\n\nNos rapazes, o período da muda vocal, como é chamada, demora cerca de cinco meses e causa a formação do pomo-de-adão—que na verdade é o ângulo das cordas vocais—, além de alterar uma oitava a tonalidade da voz. Ou seja, após a muda, a voz masculina fica oito notas musicais mais grave. Nas mulheres, a muda dura apenas três meses. No final do processo, a voz só estará duas ou três notas mais grave. Por mais fino que um homem fale, porém, suas cordas vocais vibram, no máximo, 130 vezes por segundo. Já por mais grossa que seja a voz, as cordas vocais femininas vibram, no mínimo, 190 vezes por segundo. “O tom das vozes do homem e da mulher só torna a se encontrar na velhice, quando se aproxima ao do sexo oposto”, explica Leny.\n\nAlém da voz, o olfato também parece não ser o mesmo em homem e mulher. Uma pesquisa realizada no ano passado revelou que as mulheres não só acreditam que sentem cheiros melhor como do fato sentem. Como a sensação de sabor é parcialmente proporcionada pelo cheiro da comida, seria natural que a mulher também tivesse um paladar mais refinado. No entanto, os maiores cozinheiros do mundo são homens.\n\nOutra diferença marcante entre os sexos é a distribuição de pêlos. Os pêlos pubianos na mulher formam um triângulo e no homem um losango. E, como é notório, o homem é bem mais peludo, possuindo até barba, graças à ação de hormônios. “Conseqüentemente, sua pele tende a ser mais oleosa”, explica o dermatologista Mauro Yoshiaki Enokihara, da Escola Paulista de Medicina, “pois cada pêlo está ligado a uma glândula sebácea.” Recentemente, um estudo com atletas americanos provou que os homens também transpiram mais.\n\nParece vantajoso, mas não é: as mulheres, suando menos, conseguem manter o equilíbrio da temperatura corporal em climas quentes. Daí os cientistas concluíram que o organismo feminino deve ter controles de temperatura mais eficientes, embora não se saiba o motivo.\n\nTambém mais eficiente parece ser o sistema imunológico feminino—ao menos a julgar pelos números das reações a transplantes: em pacientes mulheres é de 55 por cento; em pacientes homens cai para 28 por cento. Em compensação, as mulheres tendem mais a sofrer de doenças auto-imunes, como a artrite, que faz cinco vezes mais vítimas femininas. De qualquer forma, a mulher vive em média de quatro a dez anos mais que o homem – um bom motivo para falar em sexo forte no feminino. Talvez haja uma predisposição genética para isso, segundo recentes hipóteses levantadas nos Estados Unidos. A cada dia, por sinal, surgem novos estudos para explicar o fato.\n\nFala-se, por exemplo, no papel desempenhado pelos hormônios. Por causa deles, o homem teria mais colesterol — uma comprovada causa de infartos. Mas as aparências podem enganar: embora os homens tenham sete vezes mais infartos que as mulheres, a razão pode estar no comportamento. “Quanto mais moderna a sociedade, mais a mulher começa a adquirir hábitos como fumar e beber, entrando na dança dos problemas cardíacos”, observa Charles Mardy, cardiologista do Incor. Uma coisa é certa: os hormônios masculinos estimulam a acidez no aparelho digestivo, deixando os homens mais sujeitos a úlceras.\n\n“Ao contrário, os hormônios femininos comprovadamente protegem a mucosa do estômago”, explica o gastrenterologista Moacir da Pádua Vilela, da Escola Paulista de Medicina. Mas as mulheres, após os 45 anos, têm uma tendência muito maior a engordar do que homens da mesma idade. “Uma mulher em cada cinco mulheres nessa faixa etária desenvolve um problema de tireóide em que o metabolismo diminui. Isso é raro em homens”, compara o endocrinologista Geraldo Medeiros. Além de afetar tanto a fisiologia quanto a anatomia de ambos os sexos, os hormônios exercem marcada influência sobre o comportamento. “Os andrógenos, atuando no cérebro, deixam os homens naturalmente mais agressivos”, diz Medeiros. “Todos sabem que um cavalo castrado é dócil, comparado a um garanhão”, observa.\n\nJá nas mulheres, parece que a progesterona pode provocar irritabilidade ou melancolia, daí a chamada tensão pré-menstrual quando esse hormônio entra em ação. Uma pesquisa do bioquímico americano William Frey revelou que a prolactina—hormônio que estimula a produção de leite—deixa as mulheres mais choronas: é que a prolactina também estimula as glândulas lacrimais (embora em matéria de risos e sorrisos homens e mulheres tenham a mesma capacidade).\n\nSendo assim tão diferentes, como homens e mulheres conseguem viver juntos? Alguém poderia sentir-se tentado a responder que não conseguem mesmo—mas não seria exato. A resposta certa está na ação dos andrógenos, horrnônios que têm a notável propriedade de provocar algo em comum em homens e mulheres: o desejo sexual. E homens e mulheres quase sempre desejam o sexo oposto — aquele que Ihes é tão diferente.\n\n#Falsas diferenças\n\nMuitas vezes, quando falam de sexo, as pessoas citam diferenças onde o que existe é igualdade ou então trocam as bolas — geralmente em prejuízo da mulher. São as falsas verdades que aparecem ao se comparar características masculinas e femininas. Alguns exemplos: Meninas adoecem mais do que meninos As estatísticas mostram o contrário: os meninos não só adoecem mais (embora não se saiba exatamente por quê) como estão mais sujeitos a acidentes (o que é fácil de entender). Mulheres têm mais tendência a engordar do que homens Antes dos 45 anos, a mulher tem tanta tendência a ganhar quilos quanto o homem. Quem come mais do que precisa e não faz exercícios engorda—sexo não tem nada com isso .A mulher tem menos sensibilidade ao calor nas mãos A quantidade de sensores de temperatura na pele do homem e da mulher é equivalente. Se o homem mexesse tanto com panelas como a mulher, também suportaria mais o contato com objetos quentes. O organismo da mulher tem mais água A mulher, na época da menstruação, retém mais água, por causa do aumento de hormônio progesterona. Ora, esse hormônio também conduz sal para o intestino. E, como se sabe, sal retém água. Mas, na verdade, o organismo masculino possui 10 por cento mais de água do que o feminino, por causa da maior massa muscular.\n\n#Onde o homem é mais homem\n\n- coração: mais sujeito a infarto, porque a taxa de colesterol é maior\n\n- pulmão: a capacidade é entre 25 e 33 por cento maior\n\n- glândula sudoríparas:produzem mais suor\n\n- pele:tende a ser mais oleosa\n\n- músculos: são mais robustos e sua massa corresponde a mais da metade do peso do corpo\n\n- pernas: são mais longas\n\n#O argumento da força\n\nNos Jogos Olímpicos de Los Angeles, em 1984, dois recordes foram quebrados na prova de 200 metros rasos: a americana Valerie Hooks cobriu o percurso em 22s03; o americano Carl Lewis, porém, marcou 19s80. Nenhuma originalidade nisso. As marcas masculinas são sempre melhores do que as femininas. Por quê? “Porque os homens são mais fortes, mais rápidos e mais resistentes”, responde o professor de Educação Física José Medalha, vice-técnico da seleção de basquete masculino que disputa as atuais Olímpiadas de Seul A resposta pode parecer sumária. É disso mesmo, porém, que se trata.\n\nEm média, a força muscular da mulher corresponde a 70 por cento da força do homem. A maior diferença está no músculo flexor do antebraço, que nos permite erguer pesos. Sua força, na mulher, eqüivale a menos da metade da força no homem. Já a menor diferença—22 por cento—está nos músculos envolvidos na mastigação, o que, infelizmente para as mulheres, não faz diferença nenhuma na vida esportiva. Que as mais fracas desculpem, mas a força é fundamental no esporte. “No basquete, por exemplo, é preciso ter força nos músculos para correr na quadra. Por isso as equipes não podem ser mistas”, comenta o professor Medalha.\n\nPara correr, aliás, o homem conta com outra vantagem: seus ossos são proporcionalmente maiores, e ossos servem de alavanca para os músculos. O fato de também a capacidade respiratória ser diferente não pode ser esquecido. Mas, embora a do homem seja maior, as mulheres atingem o auge de sua capacidade cerca de três anos antes dos homens, aos 14-16 anos. Por isso, acreditam alguns pesquisadores, as adolescentes se saem melhor em provas de natação do que os rapazes com a mesma idade. A mulher tem ainda muito mais flexibilidade e coordenação motora. “Por mais que um homem se esforce, nunca chegará a alcançá-la”, acredita Medalha. Daí porque, nas modalidades esportivas em que a força não predomina, a mulher pode sair-se melhor: por exemplo, na patinação ou na ginástica olímpica, que, ao requerer jogo de cintura, beneficia a mulher, por causa de sua bacia larga.\n\n#Onde a mulher é mais mulher\n\n- cérebro: o hipocampo funciona a intervalos regulares, por comandar a produção de hormônios diferentes\n\n- glândulas lacrimais: produzem mais lágrimas\n\n- voz:a freqüência das cordas vocais é maior\n\n- estômago: possui mucosa mais resistente\n\n- bacia:é mais larga\n\n- coxas:além de uma concentração maior de gordura nessa região, o osso fêmur é mais inclinado\n\n- Fonte: https://super.abril.com.br/",
				"added": 1549656793
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 5,
				"body": "#Cinco vias que provam a existência de Deus em Santo Tomás de Aquino \n- https://video.datsemultimedia.com/videos/watch/b4a6be85-4296-419e-aabd-30e3af0b9e3d",
				"added": 1549661514
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 6,
				"body": "#Feminino Cangaço\nO documentário propõe uma reflexão crítica sobre a entrada das mulheres no cangaço, suas motivações, as superstições em torno delas, seus papeis dentro dos bandos, seus costumes, crenças e dramas pessoais. Trata-se de melhor compreender a importância das mulheres na construção do que hoje entendemos como o fenômeno do cangaço e as destacar como sujeitos ativos desta história, mulheres que transgrediram os valores sociais de sua época e cuja força surpreende ainda nos dias atuais.\n\n- https://video.datsemultimedia.com/videos/watch/67e0a409-7dd9-4608-9bec-1374d793a9cc",
				"added": 1549661641
			}
		]
	},
	"comment_vote": {}
}