{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Manual agorista",
			"body": "Retirado do site: http://foda-seoestado.com\n\nNão adianta combater o crime institucionalizado (estado) apenas reduzindo seus ganhos. É preciso, ao mesmo tempo, deslegitimá-lo. Isso depende da vontade de cada um de se desligar do sistema. Aqui estão algumas maneiras de você hoje mesmo ser mais livre em sua própria individualidade:\n\n1. Como se hospedar com conforto pagando pouco ou nada:\n\nAirbnb (www.airbnb.com): Esse serviço permite às pessoas alugarem suas casas por alguns dias. Ele oferece preços competitivos, comparados aos de hotéis, e evita todo o aparato regulatório, controles de zoneamento, monopólios de sindicatos e outras barreiras de entrada. Obviamente, em alguns estados, os cartéis hoteleiros não estão felizes.\n\nCouchsurfing, hospedagem gratuita pelo mundo (www.couchsurfing.com): Pessoas disponibilizam suas casas para viajantes se hospedarem de graça, e sabem que, quando viajarem, também encontrarão pousada. O único sistema de controle são as opiniões dos próprios usuários publicadas no site. Qualquer um pode se cadastrar. E adivinhem: funciona muito bem.\n\nWorldpackers: já pensou em se hospedar em hostels ao redor do mundo e trabalhar neles ao invés de pagar pela estadia? O site Worldpackers é o maior site que faz o intermédio do viajante e do hostel, os criadores são brasileiros, mas o site faz sucesso no mundo inteiro (https://www.worldpackers.com/)\n\nWWOF (http://www.wwoof.net/): assim como o Worldpackers, você pagará sua estadia pela força de trabalho, mas no WWOF (World Wide Opportunities on Organic Farms), você trabalhará em meio período em fazendas orgânicas ao redor do mundo e terá o direito a ter, no mínimo, três refeições ao dia.\n\n2. Use carona compartilhada/coletiva em vez de pagar a máfia dos taxistas ou usar o busão:\nUber e La’zooz (www.uber.com e www.lazooz.org): Os táxis têm as suas licenças, as quais fazem subir as tarifas. É um cartel acolhedor e bem protegido. O Uber e La’Zooz permitem contornar esse sistema, encontrando grandes corridas em carros limpos e com melhores tarifas – tudo enquanto motoristas (surpresa! não licenciados) são avaliados por sua reputação. O La’Zooz é superior ao Uber por ser descentralizado, impossível de se proibir.\n\nCarona coletiva (https://www.tripda.com.br, http://www.caronasolidaria.com e http://www.caronetas.com.br): A melhor forma, sem dúvida de economizar sua bufunfa e ter um conforto. Procure no seu colégio, universidade ou trabalho alguém que more perto de você e combine uma contribuição para cobrir os custos (quem sabe em bitcoin?? rsrs). Existem diversos sites e aplicativos que podem te auxiliar a achar caronas.\n\n*Dica: Procure grupos no facebook, há vários de carona.\n\n3. Proteja o seu dinheiro das garras do estado:\nBitcoin (www.bitcoin.org/pt_br/): O governo arruinou o dinheiro há muito tempo. O mercado produziu cripto-moedas para usuários finais. Isso pode significar a morte do euro, do dólar e de outras moedas fiduciárias. As implicações são impressionantes e inspiradoras. Você também pode diversificar e manter uma reserva de valor de alta liquidez, exceto moeda legal.\n\n4. Não pague mais conta de energia para o estado:\nGeração privada de energia: Grandes empresas como o Google estão cansadas de lidar com empresas regulamentadas. Eles temem falhas de fornecimento e precisam de energia elétrica mais confiável. Elas estão gerando a sua própria energia elétrica. Há apenas alguns anos, mas, de novo, apenas alguns caras ricos usavam telefones celulares. É onde a inovação acontece. Então, o preço cai e a qualidade sobe. Hoje em dia muitas pessoas criaram diversas formas de microusinas residenciais e de condomínios.\n\n5. Comunique-se sem ser rastreado pelo estado:\nBleep (http://labs.bittorrent.com/bleep): Quer fugir do estado de vigilância? Bleep é a última novidade em comunicações criptografadas, ou seja, só você sabe o que recebeu. A transmissão de dados é em P2P, não possui um servidor central para armazenamento de conteúdo, esse conteúdo fica com você e o histórico pode ser apagado de vez por você mesmo na hora que você decidir. Também funciona oflline.\n\nTOX (https://tox.im/pt_BR): Tox é um programa fácil de usar que permite você se conectar com os seus amigos e parentes, sem que ninguém espie, pois o programa usa a tecnologia de criptograffia. Você envia mensagens instantâneas e encriptadas, faz chamadas de Tox para Tox de forma segura e sem custos e faz chamadas seguras de vídeo face a face. Tudo totalmente gratuito.\n\n6. Use mercado negro online para comprar o que o estado te proíbe:\nAgora (www.agoradrugs.com): Este site anônimo permite que você use moeda criptografada para comprar substâncias ilícitas (drogas ilegais), incluindo medicamentos e alimentos ainda não aprovados pelas agências reguladoras estatais. Você pode achar isso alarmante, mas considere: o site traz uma bela paz a um mercado que não para, o qual o governo tornou violento e mortal.\n\n7. Use sites como o Youtube para detonar a ideia de direitos autorais:\nRegras de direitos autorais do YouTube (http://support.google.com/youtube/answer/2797466): elas eram simples, mas como o remixe, a paródia e as cópias evoluem, as exceções aos direitos autorais estão crescendo. Agora, um vídeo de Miley Cyrus lançado ao nascer do sol é copiado 1.000 vezes antes de anoitecer. Com efeito, o cenário inicialmente imaginado de direitos autorais – o governo confere a qualidade de monopólio sobre cada obra e arte – está morrendo diante de nossos olhos.\n\n8. Impressora 3D cria e copia tudo, até arma de fogo:\nImpressão 3-D: Não só as pessoas contornarão as restrições inconstitucionais às armas (como Cody Wilson contornou), mas as pessoas poderão ignorar as patentes e regulamentos legais ao imprimir seus próprios chuveiros de alto fluxo. Quando todo mundo é um fabricante, ninguém é regulamentado. Bônus: Arma de fogo feita em impressora 3D: http://kickass.to/usearch/the%20liberator%203d%20gun/\n\n9. Não peça empréstimos aos bancos, peça para pessoas:\nEmpréstimos de Pessoas para Pessoas: Fairplace (www.fairplace.com.br/portal/engine/Home/init.hl) e o Lending Club (www.lendingclub.com) deixam as pessoas evitarem os grandes bancos e financiarem em conjunto, como tomadores e credores. Onde há comunicação, há negócios sendo fechados.\n\n10. Fuja das seguradoras de saúde reguladas pelo estado:\nCooperativas de saúde: Não são apenas as organizações cristãs que criam cooperativas para ajuda mútua. Esses grupos cobrem os custos catastróficos de saúde para os seus membros, ignorando – por enquanto – as grandes companhias de seguro e o aparato regulatório do governo.\n\n11. Use arbitragem privada em vez do sistema estatal judiciário:\nArbitragem privada (http://arbitranet.com.br/a-arbitranet): Se você tem uma disputa com alguém, o ultimo lugar em que você quer parar é no matagal do sistema judiciário do governo. As pessoas estão optando pela arbitragem privada. A arbitragem privada pode não ser nenhuma novidade, mas a sua confiabilidade é. Há zilhões de árbitros reais. De modo online, hoje o site Arbitragem Online funciona. Em todo caso, talvez nem precise buscar uma arbitragem privada, pois acordo amigável pode ser realizado.\n\n12. Veja, grave e traduza vídeos subversivos na internet:\n\nO Youtube pode ser considerado a mídia mais impactante da nova era, com certa liberdade de expressão que não ocorreria em canais de televisão, alguns canais do Youtube expressam ideias de liberdade em português. Dentre os mais famosos estão:\n\n1 – Dâniel Fraga (https://www.youtube.com/user/DanielFragaBR): O youtuber já recebeu vários processos de políticos, policiais e juízes, mas sempre desobedeceu as ordens judiciais, foi um dos principais divulgador do bitcoin e da ideologia anarcocapitalista.\n\n2 – Ideias Radicais (https://www.youtube.com/user/ideiasradicais/videos): O canal é muito bom, principalmente pela didática, vale muito a pena dar uma conferida.\n\n3 – Alexandre Porto (https://www.youtube.com/user/CanalTal/videos): Canal que trata sobre o temas relacionados ao anarcocapitalismo e à ética libertária.\n\n4 – Paulo Kogos (https://www.youtube.com/user/paulokogos/videos): Também anarcocapitalista, é um famoso debatedor da internet, se destaca por sua argumentação bem fundamentada.\n\n5 – Anarcocapitalismo (https://goo.gl/UUvKHR): Canal que traduz vídeos de autores anarcocapitalistas famosos e debates sobre estudos de livros de autores anarcocapitalistas.\n\n6 – Portal Libertarianismo (https://www.youtube.com/user/libertarianismoplus): Canal com documentários, ilustrações e manuais traduzidos para o português e originais sobre o libertarianismo, se destaca pela altíssima qualidade de vídeos e de registros históricos de pensadores liberais.\n\n7 – O Agorista (https://www.youtube.com/oagorista): Canal que trata muito sobre a ética libertária.\n\n8 – Anti-estado (https://www.youtube.com/anti-estado): Canal onde Augusto Cezar trata sobre política e ética libertária.\n\n9 – Roberto Pantoja (https://www.youtube.com/user/demoro2099): Canal onde Roberto Pantoja trata sobre política, economia e ética libertária.\n\n13. Navegue anônimo na internet:\nTOR/Deep Web (www.torproject.org): Esse navegador para a web criptografada rejeita seu endereço originário de IP por todo o planeta. Desse modo você pode surfar anonimamente longe dos olhos do governo.\n\n14. Compre remédios sem receita:\nMorte das receitas (http://jcmrx.es/): Você pode comprar seus remédios baratos de muitos países agora — de modo seguro, barato e garantido (e sem receita). Não há necessidade de pagar plano médico estatal ou a Indústria Farmacêutica. Aceitam bitcoin também.\n\n15. Expatriação, saindo do país através do trabalho:\nExpatriação (http://goo.gl/Xu9Ydr): Às vezes, se você não gosta de algum lugar, você só tem que sair. É mais fácil encontrar lugares melhores, seja em razão do clima, tributação ou cultura. A opção de ir embora está aí e mais pessoas estão se aproveitando dela do que nunca.\n\n16. O mar, um lugar para viver e fazer negócios sem regulações estatais:\nSeasteading (habitações permanentes no mar): Blueseed (http://blueseed.com/)é um dos primeiros exemplos de empreendimento que levarão as pessoas para o mar em busca de oportunidade e de um conjunto superior de regras. O Seasteading Institute (http://www.seasteading.org/) também trabalhou com sucesso com uma empresa holandesa para projetar os primeiros módulos Seasteading. Quanto mais o estado impõe impostos e regulações, mais viável é para o mar se tornar o lugar para viver e fazer negócios.\n\n17. Não deixe o estado educar seus filhos:\nEducação privada/domiciliar e homeschooling: Se você não gosta das escolas governamentais, tire suas crianças de lá. Milhões de famílias estão fazendo isso. Algumas estão formando cooperativas virtuais e obtendo conteúdo de fontes online. O grupo no facebook Home Schooling Brasil tem muita informação sobre (www.fb.com/groups/homeschoolingbrasil).\n\n18. Ensino privado online de qualidade, barato ou gratuito:\nEducação online: Você está em busca de uma verdadeira educação ou um mecanismo de sinalização? O site Portal Educação (www.portaleducacao.com.br) e outras fontes online estão reduzindo os custos da educação — longe das guildas infladas da educação superior e dos campos de doutrinação que usam dinheiro público. A Academia Khan proporciona uma educação gratuita e de alta qualidade para todos, em qualquer lugar (http://pt.khanacademy.org/).\n\n19. Empréstimos de bitcoins entre pessoas:\nBTCJam, empréstimos de Bitcoins (http://btcjam.com.br/): Empreste ou invista bitcoins usando somente a confiança em acordos voluntários entre pessoas com BTCJam. Aprenda como ter lucro investindo e baixas taxas emprestando bitcoin. Há como você ver o histórico de transações e depoimentos de pessoas que concederam ou receberam empréstimos com outros usuários, igual ao Ebay e Mercado Livre.\n\n20. Segurança privada de bairro:\nConfira novos aplicativos como o Peacekeeper (http://peacekeeper.org/). É apenas um exemplo das maneiras pelas quais as comunidades locais podem reduzir o custo de segurança e serviços de emergência – e mantê-los localmente.\n\n21. Permutas, a solução para trocar bens e serviços sem impostos e burocracia:\nMercados de Trocas (http://lista.mercadolivre.com.br/trocas e http://mercadodetroca.com/): Se você pode trocar bens ou serviços diretamente, é melhor abandonar o intermediário. O mercado de trocas tornou-se uma resposta natural ao cobrador de impostos.\n\n22. Rede social para troca de conhecimentos e serviços:\nBliive (http://bliive.com/): É um site que acredita na colaboração como forma de revolucionar a ideia de valor, aproximando pessoas através do compartilhamento de experiências. Cada minuto de troca de conhecimentos é contabilizado e revertido em moeda virtual, que pode ser usada a qualquer momento.\n\n23. Intimide policiais filmando-os:\nCâmeras de telefones: Uma arma poderosa contra o estado está provavelmente no seu bolso agora. Eles mantêm os policiais responsáveis por seus atos por meio da “eterna vigilância” proporcionada pela tecnologia. Quanto mais as pessoas se manifestarem diante da intimidação (ou simplesmente filmarem a partir das suas janelas com uma lente de zoom), melhor.\n\n24. Promova a pirataria através do P2P:\nCompartilhamento de arquivos Peer-to-Peer (http://kickass.to/ e http://thepiratebay.se/): A sobrevivência e persistência do compartilhamento de arquivo por meio dos torrents mostra que a desobediência civil em face de monopólios intelectuais está viva e bem, apesar de uma guerra de 20 anos contra a prática. Quanto mais os monopolistas lutam, mais os compartilhadores de arquivos ganham. Difunda a pirataria.\n\n25. + Financiamento coletivo - Financiamento bancário:\nCrowdfunding/financiamento conjunto via web (www.catarse.me/pt/projects , http://www.kickante.com.br/ , http://juntos.com.vc/pt/projects , http://www.vaquinhasocial.com.br/): Se você precisa de dinheiro para iniciar um negócio, pra fazer caridade social, seja o que for, você pode contornar a tigela virtual para implorar por dinheiro. Mas não pode ser apenas com qualquer coisa velha. Você tem que convencer a multidão a abrir mão dos seus recursos. Mas essa pode ser uma barreira bem menor a ser ultrapassada do que prender a atenção de investidores de risco ou pedir um financiamento no seu banco que foi resgatado pelo governo.\n\n26. Justiça social tem novo nome, se chama Empreededorismo Social:\nEmpreendedorismo social (http://artemisia.org.br/ e http://goo.gl/nFxU2V): O estado de bem-estar social tende a tornar as pessoas suplicantes dependentes. A ajuda externa também. Mas empreendedores com causas sociais estão criando melhores formas de ajudar os pobres, desde micro finanças ao retorno das sociedades de ajuda mútua. O setor de empreendedorismo social está desfrutando um renascimento permitido pela tecnologia apesar do estado.\n\n27. Offshoring e inshoring, livrando sua empresa de regulações e impostos:\nÀs vezes os impostos sobre as empresas, controles de sindicatos e o controle regulatório são simplesmente insuportáveis. As corporações levam sua produção para outros lugares (estados e ou países) longe de altos impostos e cartéis de sindicatos.\n\n28. Carros sem condutor, o fim das multas:\nA tecnologia está aí. Ela certamente muda o cálculo para motoristas distraídos ou embriagados, e corrige os problemas com vias públicas que o estado não vai resolver. Carros sem condutores nos darão viagens seguras e automatizadas e negará ao estado os recursos que recolhe ao chatear as pessoas tanto por grandes e pequenas infrações que resultam da má infraestrutura, erro humano e julgamento fraco. Bastará uma ou duas áreas do mundo para implantá-las com sucesso para desencadear a mudança.\n\n29. Não vote. Não legitime o crime:\nNão vote, você estará fortalecendo a armadilha da democracia, legitimando o estado e seus crimes.\n\n30. Use serviços de entrega privados.:\nNão utilizar serviços de entregas estatais. Enfraqueça o monopólio de correios e entregas estatais, use serviços de entrega privados (www.fedex.com/br , www.dhl.com.br/pt , www.totalexpress.com.br).\n\n31. Saiba como não servir as Forças Armadas:\nA lei Nº 8.239, DE 4 DE OUTUBRO DE 1991 que regulamenta o art. 143, §§ 1º e 2º da Constituição Federal, dispõem sobre a prestação de Serviço Alternativo ao Serviço Militar Obrigatório: § 1º Ao Estado-Maior das Forças Armadas compete, na forma da lei e em coordenação com os Ministérios Militares, atribuir Serviço Alternativo aos que, em tempo de paz, após alistados, alegarem imperativo de consciência decorrente de crença religiosa ou de convicção filosófica ou política, para se eximirem de atividades de caráter essencialmente militar.\n\nCaio Maniero DAuria, tornou-se, aos 22 anos, o primeiro brasileiro dispensado do serviço militar obrigatório por razões políticas e filosóficas. Na prática, significa que ele foi dispensado sem nem precisar jurar à bandeira. Para muitos, a formalidade é apenas um detalhe. Para ele, uma batalha de quase cinco anos de duração em defesa da liberdade. Veja o vídeo.\n\n32. Fuja das blitz policiais:\nWaze (www.waze.com/pt-br): Vigiar blitz e polícias utilizando apps e esquivar-se delas sempre que possível.\n\n33. Suborne agentes estatais:\nSuborne os guardas, fiscais e agentes governistas. Além de economizar, você não alimenta o sistema, o dinheiro voltará ao mercado através do agente estatal. Também é uma forma de provar a falha do sistema estatal/anti-natural.\n\n34. Não pague IPVA:\nA idéia é ter um automóvel isento de IPVA, e adaptá-lo às suas necessidades, geralmente carros mais antigos são isentos de impostos, pode também esse carro estar convertido à motor elétrico com baterias, que gera uma economia maior à médio e longo prazo.\n\n35. Estimule o contrabando e o mercado negro:\nProduto e serviços livres: Ofereça e compre produtos e serviços sem regulação e ou tributos. Faça compras em estabelecimentos que não emitam nota fiscal, não emita e nem exija notas fiscais.\n\n36. Salário maior é salário sem impostos e regulações:\nNegocie com seu patrão/funcionário um valor salarial sem registro legal.\n\n37. Não abasteça em postos de bandeira estatal:\nApenas isso, não alimente o sistema.\n\n38. Não se filie a partidos políticos:\nA esperança ou objetivo de “mudar por dentro” é apenas uma maneira de você apoiar a democracia, fortalecer o sistema e legitimar o crime.\n\n39. Não tenha contas em bancos estatais:\nNão contribua para o fortalecimento estatal. Melhor que isso só investindo em bitcoin.\n\n40. Empreenda com sites de e-commerce gratuitos:\nEmpreenda: Sempre! Sites de e-commerce gratuitos ajudam a você vender o seu produto e ou serviço sem precisar de nenhuma burocracia ou pagar programador para tal: www.buydise.com\n\n41. Tenha cartão de débito bitcoin e dê adeus aos bancos e ao dinheiro estatal:\nUse cartões de débito bitcoin: Você pode comprar o pão na esquina usando bitcoins. Bem vindo à formalidade da informalidade: ANX: http://anxbtc.com/?lang=pt_br| Xapo: http://xapo.com/pt/ | Bitcointoyou (brasileiro): http://goo.gl/UETTcV | Neteller: http://www.neteller.com/ | Gyft: http://www.gyft.com/ | Advcash: http://goo.gl/ylWZjX\n\n42. Aprenda sobre o futuro, autossustentabilidade residencial:\nAprenda tudo sobre autossustentabilidade residencial e de condomínios com uso de tecnologias: Placas solares fotovoltaicas, esfera solar (http://goo.gl/Y3vcdy), energia eólica (http://goo.gl/bpm9xB), microusina hidrelétrica (http://goo.gl/IS0FKF), compostagem, arquitetura que privilegia a luz natural (http://goo.gl/q2nGhf), captação e tratamento de água de chuva e da umidade do ar (http://goo.gl/wIJgV3), material de construção sustentável, hortas verticais (http://goo.gl/bv2acS), uso de remédios naturais. Quanto menos dependência estatal melhor para o seu bolso e até para a sua saúde.\n\n43. Não use serviços do estado onde há concorrência com o setor privado:\nPare de usar os serviços do estado onde há concorrência com o setor privado, onde não há concorrência tente substituí-la de forma criativa, pratique a desobediência civil.\n\n44. Fuja do IPTU:\nCada município tem sua lei sobre cobrança de IPTU, pesquisando sobre, descobri que na cidade do Rio de Janeiro, imóveis que tem um anexo funcionando como biblioteca pública, não paga IPTU, existem várias outras formas de ser isento da taxa na cidade carioca: http://goo.gl/KyF6yJ . Pesquise a lei municipal de sua cidade para saber como escapar através de elisão fiscal de mais esse tributo.\n\n45. Armazene dados na internet de forma anônima:\nStorj (http://storj.io/): Se a preocupação é segurança e confidencialidade de seu armazenamento de dados na nuvem, sem censura, não monitorizada e sem quebras, é melhor ir dizendo adeus à Dropbox e outros alojamentos na nuvem. O futuro está na tecnologia descentralizada. O projeto Storj garante segurança, confidencialidade e rapidez. Esta plataforma usa a tecnologia do blockchain, tal qual o bitcoin, como livro de transações, com chaves de encriptação públicas e privadas e funções criptográficas de segurança.\n\nO Dropbox e o Google Drive já foram criticados quanto a sua segurança por Edward Snowden e Julian Assange, por serem um livro aberto pra NSA e outras gangues estatais.\n\nAlternativas de “conhecimento zero” e criptografia E2E mais recomendadas são o Tresorit.com e o SpiderOak.com. Seus arquivos são criptografados antes mesmo de serem enviados à nuvem. Ninguém, nem mesmo a própria empresa, consegue lê-los e até o nome dos arquivos fica protegido.\n\n46. Escreva estado sempre com letra minúscula:\nO Instituto Mises Brasil pratica e a revista Veja adota a grafia “estado” desde 2007. À época, Veja argumentou que “se povo, sociedade, indivíduo, pessoa, liberdade, instituições, democracia, justiça são escritas com minúscula, não há razão para escrever estado com maiúscula”. A justificativa de que a maiúscula tem o objetivo de diferenciar a acepção em questão da acepção de “condição” ou “situação” não convence. São raros os vocábulos que somente possuem um único significado, e ainda assim o contexto permite a compreensão e diferenciação dos significados. Considere que grafar estado é uma pequena contribuição para a demolição da noção disfuncional de que o estado é uma entidade que está acima dos indivíduos.\n\n47. Faça câmbios de moedas sem declarar nada para a receita e sem pagar nada de impostos:\nTransferwise (http://transferwise.com/): Faça câmbios de moeda arbitrariamente grandes sem declarar NADA para a receita e sem pagar NADA de impostos, pois o dinheiro não passa por bancos. Resumindo: Você quer comprar euros e manda dólares para eles; daí eles encontram alguém querendo a troca no sentido oposto e fazem o pareamento. Naturalmente, eles mantém reservas para quando o pareamento não for possível e, claro está, a manutenção da reserva influi nos custos da transação. Somando-se a isso os custos da administração do app, obtemos um preço dez vezes menor que o dos bancos e sem regulação alguma.\n\n48. Não pague fatura de TV a cabo:\nAzamerica: Tenha esse aparelho em casa e não pague fatura de TV a cabo, é um receptor produzido na China capaz de descriptografar o sinal dos satélites da Claro, Oi, Vivo, Sky e entre tantos outros, inclusive estrangeiros. Custa em torno de R$ 400, normalmente técnicos cobram R$ 600,00 pela a instalação completa, mas tem modelos mais novos que já vem configurado, é só instalar os cabos e assistir. O aparelho vende no Paraguai, em camelódromos e pela internet, dizem que esse site (http://ribeiroshop.com.br/) é uma das melhores lojas da net para esse produto, segundo quem indicou o Azamerica para a postagem. (Lembrando que as empresas de TV a cabo são reguladas pelo estado e quem defende propriedade intelectual tem o bumbum guloso).\n\n49. Tenha um sistema operacional micro e móvel e use a internet de forma anônima:\nTails (http://tails.boum.org/): É um sistema operacional live, que você pode usar em quase qualquer computador a partir de um DVD, de uma memória USB ou de um cartão SD. Ele tem como objetivo preservar sua privacidade e seu anonimato, e te auxilia a usar a Internet de forma anônima e evitar censura.\n\n50. Não participe de jogos de loterias estatais:\nApenas não alimente mais o sistema.\n\n51. Você é lojista, não usa bitcoin e tem cliente querendo comprar com bitcoin? Problema resolvido:\nPagcoin (http://pagcoin.com/): Serviço que permite seus clientes pagarem seus produtos e serviços também em bitcoin e através da conversão você recebe em sua conta o pagamento em reais. Bom para lojistas, até porque o bitcoin está popularizando muito.\n\n52. Compartilhamento de vôos, o Uber dos céus:\nSkyUber (www.skyuber.com): O Uber dos aviões. Um aplicativo que partilha de voos em todo o mundo, para a aviação geral. O SkyUber liga de uma forma concertada e segura, passageiros e pilotos, ajudando a racionalizar custos entre todos os intervenientes. Os pilotos privados partilham os seus voos para os passageiros que os pesquisam. E todos os que estão registrados recebem notificações dos lugares disponíveis nos aviões. Pilotos e passageiros são pontuados no final dos voos, pelo que poderá escolher os melhores pilotos ou passageiros para o seu próximo voo. A SkyUber não facilita em matéria de segurança, aplicando critérios muito rígidos aos pilotos. Certificações, manutenção e seguros dos aviões têm de estar válidos. A SkyUber só aceita pilotos certificados por um aeroclube, uma associação ou uma escola de aviação, desde que devidamente habilitadas para tal.\n53. Menos ANCINE por favor!\nAssistir filmes e séries de graça é muito fácil, não precisa ser libertário, nem anarcocapitalista para isso. Mas talvez você não saiba que a Ancine (órgão regulador-protecionista-monopolista-estatal) quer tentar de tudo para barrar a livre iniciativa para o governo ganhar mais e mais dinheiro em cima da população. Mas há como se livrar!\n\n1 – PopCorn Time (http://popcorn-time.se/): Ótimo programa para assistir gratuitamente seus filmes e séries (GoT tá lá) em HD com legenda em português. É só baixar, tem pra Windows, Linux, Android e pra Mac.\n\n2 – Netflix (https://www.netflix.com/br/): É pago (mas muito barato) e provavelmente você vai ter tudo que tem nele no PopCorn Time, mas se você já conhece alguém com usuário, aproveita que é melhor do que alugar um filme diretamente.\n\n3 – uTorrent (http://www.utorrent.com/): Pode usar um pouco da sua net, mas ter baixado um filme no seu PC é uma mão na roda naqueles momentos que você não está conectado.\n\n4 – Filmes online grátis (www.filmesonlinegratis.net/ , http://megafilmesonline.net/ e megafilmeshd.net/): Na internet tem milhares de sites com séries e filmes grátis, ache aquele que tem o que você mais gosta e sinta-se à vontade de tirar os anúncios dos sites com programas e extensões específicas para isso.\n\n5 – The Pirate Bay (https://thepiratebay.se): Criado por uma organização sueca anticopyrights, o site tem milhares de arquivos e filmes disponíveis para download através do sistema BitTorrent.\n54. Veja vídeos que foram censurados pela justiça estatal no Youtube:\nColoque no fim do link do vídeo o código sem as aspas: “&gl=US”. Pronto, pode ver agora o vídeo censurado. Isso ocorre porque o Youtube apenas obedece as leis brasileiras caso o visitante entre pelo Youtube Brasil, com o código você passa a usar o modo Global do Youtube.\n55. Brechas nas leis (para moderados) para pagar menos Imposto de Renda:\n1) Acrescente benfeitorias ao custo de aquisição do seu imóvel: Ao vender um imóvel, o ganho de capital, que é a diferença entre o valor de compra do bem e o preço pelo qual ele foi vendido, é tributado à alíquota de 15%. Por isso, quanto menor a diferença entre o preço de compra e o preço de venda, menor é o imposto.\n\nComo a Receita não permite que o custo de aquisição dos imóveis seja ajustado a valor de mercado na declaração, justamente para arrecadar mais imposto, uma das brechas para aumentar o valor de compra do imóvel é acrescentar ao seu custo gastos com benfeitorias e reformas.\n\nPodem ser incorporados gastos com reforma, construção, ampliação e pequenas obras, como pintura, encanamento e reparos em pisos e paredes. Troca de móveis e instalação de cortinas, por exemplo, não podem ser incluídas. Todas as despesas devem ser passíveis de comprovação, por meio de recibos e notas fiscais com os devidos CPFs e CNPJs dos vendedores ou prestadores de serviço.\n\nSe você fez alguma reforma no passado, mas não a declarou, é possível fazer a declaração retificadora do IR, mudando os valores em todos os anos subsequentes. Lembrando que só podem ser retificadas as declarações dos últimos cinco anos, portanto até 2009.\n\n2) Acrescente ao custo do imóvel também os gastos com corretagem e juros de financiamento: O custo de aquisição do imóvel também pode ser modificado na declaração com o acréscimo de encargos envolvidos no financiamento, como a corretagem (quando paga pelo comprador), ou ainda gastos com um eventual laudêmio e com o Imposto de Transmissão de Bens Imóveis (ITBI). Na hora da venda, também é possível descontar do valor recebido a corretagem, caso o valor saia do bolso do vendedor.\n\n3) Diminua os rendimentos de investimentos abatendo taxas: No caso de ações, fundos de investimento com cotas negociadas em bolsa e títulos públicos, o contribuinte também pode acrescentar ao custo de aquisição dos ativos os valores gastos com as taxas de corretagem e emolumentos. Tal como no caso dos imóveis, caso exista ganho líquido ou rendimento, ao aumentar o valor da compra, o imposto devido será menor.\n\n4) Não declare em conjunto com seu cônjuge: Ao declarar em conjunto, a receita tributável de cada cônjuge é somada, aumentando suas chances de pular para uma faixa maior de tributação do IR. Já ao fazer a declaração individualmente, cada cônjuge tem uma isenção de até 20.529,36 reais por ano sobre a renda tributável.\n\nPor isso, declarar em conjunto só é vantajoso quando um dos cônjuges tem pouca ou nenhuma renda tributável, de forma que a sua inclusão na declaração não altere a alíquota de imposto a ser paga. Normalmente isso acontece quando um dos cônjuges possui renda isenta e muitas despesas dedutíveis, como no caso de um dos dois não ter emprego fixo e ter altas despesas médicas.\n\nSe as despesas dedutíveis de um dos cônjuges for inferior a 15.197,02 reais (limite de dedução do desconto simplificado), vale mais a pena entregar a declaração simplificada, que lhe dará um desconto de 20% sobre a renda tributável. O outro cônjuge poderá ganhar outros 20% de abatimento ou então pode entregar a declaração completa.\n\nO modelo completo é mais vantajoso quando os gastos dedutíveis excedem o valor de 15.197,02 reais. É o que costuma acontecer em famílias com filhos pequenos, que têm gastos com saúde e educação elevados.\n\n5) Divida a renda de aluguéis com o cônjuge: Ao declarar separadamente a renda dos aluguéis, o casal pode se livrar de pagar mensalmente o carnê-leão e diminuir o imposto incidente sobre a renda tributável de cada um.\n\nAluguéis mensais inferiores a 1.710,78 reais em 2013 estão isentos da cobrança de IR. Portanto, se o aluguel recebido for de 3 mil reais e cada cônjuge declarar 1.500 reais mensais, eles estarão livres do carnê-leão. Os aluguéis apenas deverão ser informados na Declaração de Ajuste Anual para que se somem à renda tributável.\n\nSupondo que os dois receberam 30 mil reais em salários em 2013, ao somar os aluguéis, ambos terão acumulado 48 mil reais no ano. Pela declaração simplificada, cada um ganharia o desconto de 20% (9.600 reais) sobre esse montante, resultando em uma renda tributável de 38.400 reais. Nesta faixa de renda, a alíquota de IR aplicada seria de 15% e o imposto devido seria de 5.760 reais, ou de 11.520 reais para o casal.\n\nSe o aluguel fosse declarado apenas pelo marido, por exemplo, ele somaria 30.600 reais (12 aluguéis, descontados os 15% de IR mensal) à sua renda tributável, que somaria 60.600 reais. Aplicando o desconto simplificado de 20% sobre essa renda, o valor sujeito à incidência do IR iria para 48.480 reais e seria tributado à alíquota de 22,5%, resultando em um imposto devido de 10.908 reais.\n\nSem calcular o imposto devido pela esposa, apenas esse valor já se aproxima ao que eles pagariam juntos se a renda do aluguel fosse dividida entre as duas declarações.\n\nDependendo da variação na renda tributável que a incorporação da renda do aluguel gera, o benefício pode ser maior ou menor. É preciso avaliar se a divisão do aluguel nas declarações levará a uma faixa de menor de tributação ou desobrigará o casal da entrega do carnê-leão. Se os dois tiverem uma renda tributável alta, por exemplo, a declaração separada poderá não ter efeito.\n\n6) Abata taxas relacionadas aos aluguéis: Se você recebe aluguéis e paga algum tipo de comissão à imobiliária, essa taxa pode ser abatida do rendimento. Ao descontar esse custo, é possível reduzir a base de cálculo sobre a qual o IR incide mensalmente. Se o proprietário do imóvel for responsável por pagar o IPTU e a taxa de condomínio, esses gastos também podem ser descontados.\n\n7) Ao herdar um imóvel comprado antes de 1988, transfira-o pelo valor de mercado: Quando um familiar morre e os bens deixados por ele são partilhados, é feita a declaração definitiva de espólio. Nesse momento, os herdeiros têm a opção de escolher se os bens transferidos a eles serão declarados pelo valor de mercado ou pelo custo de aquisição.\n\nSe houver diferença entre o custo de aquisição pelo qual o bem era declarado e o valor pelo qual ele foi transferido, são descontados os 15% de imposto sobre o ganho de capital (imposto que deve ser pago pelo inventariante em até 30 dias após a partilha). Mas, se o bem for transferido pelo valor constante na última declaração do falecido, não há ganho de capital a ser apurado.\n\nA brecha para pagar menos IR existe se o imóvel foi comprado e começou a ser declarado antes de 1988. Nesse caso, existe um benefício fiscal que permite ao contribuinte aplicar um percentual de redução sobre o ganho de capital. Quanto mais antigo o imóvel, maior é o percentual de redução, sendo que para imóveis comprados antes de 1969 o ganho de capital é totalmente isento (veja os precentuais de redução).\n\nOcorre que o benefício só pode ser aplicado se o valor for atualizado na declaração de espólio. A partir do momento em que o imóvel é transferido é como se ele tivesse sido comprado nessa data, portanto a redução não se aplica.\n\nPor exemplo, um imóvel comprado antes de 1969 por 50 mil reais que foi transferido no espólio por 500 mil reais não gera imposto sobre ganho de capital por causa da isenção. Se o imóvel for vendido no ano seguinte por 550 mil reais, o ganho de capital é apurado apenas sobre os 50 mil reais, resultando um imposto de 7.500 reais.\n\nMas, se a transferência fosse feita sem a atualização do valor, o herdeiro perderia o benefício de redução do ganho de capital e teria que considerar como custo de aquisição os 50 mil reais originais. Isto resultaria em um imposto a pagar de 75 mil reais.\n\n8) Lance as despesas com a educação de deficientes como gastos médicos: Despesas relacionadas a dependentes portadores de deficiência podem ser enquadradas como gastos com saúde. Com essa possibilidade, o contribuinte não fica sujeito ao limite de abatimento dos gastos com educação, que para o IR 2014 é de 3.230,46. Como as despesas com saúde não possuem limite de abatimento, todos os gastos de educação seriam dedutíveis.\n\nPara usufruir do benefício, no entanto, o contribuinte deve possuir um laudo médico que ateste o estado de deficiência do dependente, e os pagamentos referentes à educação devem ser feitos a entidades especializadas.\n\n9) Abata as despesas domésticas se você for freelancer e trabalhar em casa: Todos os gastos de profissionais autônomos que tiverem relação direta com o trabalho podem ser deduzidos do IR, se informados no livro caixa. Podem ser abatidas despesas com aluguel de escritório, telefone, luz, material de expediente e outros, desde que possam ser comprovados.\n\nAutônomos que trabalham em casa também contam com o benefício, podendo deduzir um quinto de todos os gastos com a manutenção da residência, incluindo as taxas de condomínio e IPTU. Apenas não são dedutíveis gastos com reparos, conservação e recuperação do imóvel.\n\nAs deduções só podem ser feitas no modelo completo da declaração. Para saber se vale a pena adotá-lo, basta avaliar se um quinto das despesas domésticas de 2013 corresponde a um valor maior que 20% da sua renda tributável (abatimento único da declaração simplificada).\n\nSe a declaração completa for a opção mais vantajosa, para realizar as deduções, o autônomo deve informar as despesas no livro caixa, usando o carnê-leão e posteriormente deve importá-las para a declaração. Também é possível lançar os valores diretamente na declaração, informando a soma das despesas mensais na coluna “Livro Caixa”, na ficha “Rendimentos Tributáveis Recebidos de Pessoa Física e do Exterior pelo Titular”.\n\n10) Se os filhos receberem pensão, não os inclua como dependentes: Quem paga a pensão alimentícia pode deduzir o gasto na íntegra, mas para quem recebe, o valor é tributado da mesma forma que um salário. Supondo que um homem pague 3 mil reais de pensão, sendo mil reais para sua ex-esposa e mil reais para cada um dos dois filhos do casal. Caso a mãe receba toda essa quantia em seu nome, seu ganho será de 36 mil reais em um ano, quantia sujeita à alíquota de IR de 15%.\n\nMas ao calcular a renda individualmente, cada beneficiário terá 12 mil reais ao final do ano. Como rendas tributáveis inferiores a 20.529,36 reais estão isentas de IR, os 36.000 reais extras recebidos pela família não estariam sujeitos à cobrança de imposto. Nesse caso, vale a pena para a mãe apresentar uma declaração para cada um dos filhos, em vez de declará-los como seus dependentes.\n\nSeparar as declarações quase sempre é vantajoso, seja para não pagar IR ou para desfrutar de uma alíquota mais baixa. A estratégia só não vale a pena se a pensão for muito alta: se cada um dos filhos receber 10 mil reais ao mês, por exemplo, a alíquota será de 27,5% de qualquer forma. Nesse caso, seria mais interessante para a mãe tê-los como dependentes e poder abater suas despesas dedutíveis.\n56. Comprar bitcoin sem verificar nome, RG, CPF, SMS, selfie com documento ou qualquer burocracia:\nCompre com o Dâniel Fraga no link: https://localbitcoins.com/ad/217619/compre-bitcoin-transferencia-bancaria-brazil-brazil?ch=22ra\n57. Como enviar dinheiro para o Brasil com uma cotação melhor e mais rápido que o Xoom:\nTutorial explicando como enviar dinheiro para o Brasil utilizando Bitcoins como meio de remessa: https://www.youtube.com/watch?v=jackx22YRIo\n58. E-mail criptografado, gratuito, open-source e com interface em português:\nStart-up alemã é alternativa de webmail gratuito, open-source, criptografado, com interface muito leve, amigável e toda em português. O serviço foi elogiado por especialistas em segurança. A filosofia da start-up tem ressonância com valores libertários:\n\n“Todos os dias lutamos pela liberdade e privacidade. Esforçamo-nos para trazer ao seu dispositivo o serviço de email mais seguro. Junte-se à nossa comunidade e ajude-nos a trazer a privacidade ao mundo. É mesmo fácil!”\n\nBernd, um dos fundadores: “Na Alemanha aprendemos o valor da privacidade da maneira mais difícil – lembre-se da Gestapo e Stasi. Na nossa era digital, a vigilância global tornou-se assustadoramente fácil. Programo para proteger os nossos dados das atuais ameaças Orwellianas”.\n\nE um plus: como ainda tem poucos registros, é possível que você consiga um endereço bem limpo.\n\nLink para cadastro: https://tutanota.com/\n59. Use um site de entrega colaborativa para comprar produtos importados ou ganhe dinheiro quando viajar:\nO Cabe na Mala é um site de entrega colaborativa, que conecta viajantes com um espacinho na mala a pessoas que desejam produtos de outros países ou estados. No Cabe na Mala você pode pedir um produto de qualquer lugar do mundo para que seja entregue na sua cidade. Ou então, você pode informar o seu destino e buscar pedidos específicos da cidade onde você se encontra e assim ganhar dinheiro.\n\nComo funciona?\n\n1. Primeiro você busca o pedido para saber qual o custo dele em Real. Se for vantagem, cadastre o pedido no site. Ofereça uma recompensa que seja interessante para que um viajante traga para você, não se esqueça de considerar o espaço que o produto ocupará na mala ou na cota.\n\n2. Ao finalizar o cadastro do pedido iremos sugerir viajantes que possam trazer seu pedido. A recompensa poderá ser negociada entre as duas partes.\n\n3. Quando um viajante aceitar a proposta, você automaticamente receberá a fatura. Imediatamente após o pagamento, você receberá o endereço do viajante no exterior para que você realize a compra do produto. *ATENÇÃO! Esteja atento ao tempo de entrega com o tempo de viagem. Se for preciso opte pelo frete expresso.\n\n4. Após a compra do produto é só aguardar o viajante chegar para acertarem a entrega. O Cabe na Mala enviará um email para ambos um dia após a data de volta do viajante cadastrada no site para que vocês combinem a entrega.\n\n5. O viajante tem um período de 15 dias para realizar a entrega do produto. Após 15 dias da data de volta cadastrada no site, você e o viajante receberão um email de avaliação das partes. Isso ajudará nas próximas negociações.\n\nAcesse o site e faça sua encomenda ou ganhe dinheiro trazendo um produto para alguém: www.cabenamala.com.br",
			"added": 1474999597
		}
	],
	"topic_vote": {
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"1_13f8nNpQz9u338SU9GVdAfnuFYX1emaNfv": 1,
		"5_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1,
		"4_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1,
		"2_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1,
		"1_1KHBD55kYmm1K8hTrJe1FCatzRL2kqdrbs": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_18FhdUHnAmpoL4kuTCTvDyowHAsTUJCy6R": [
			{
				"comment_id": 1,
				"body": "> [brkaka](#comment_15_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Isso não é verdade. O Telegram usa uma forma de criptografia que foi altamente criticada por experts no campo. Mesmo o app sendo open source, os servidores não são. Até o \"desafio\" deles foi criticado por ser mal projetado (link). No ano passado também li que o Telegram mantém uma cópia de todas as suas conversas, não criptografadas, a não ser que você use uma opção para encripta-las (com a criptografia ruim deles).\n> Não sou fã do WhatsApp mas eles estão usando o Protocolo Signal que, atualmente, é mais seguro que o do Telegram, e isso é um fato.\n> Um contra-argumento comúm é dizer que já que o código do WhatsApp é proprietário não dá pra confirmar se estão realmente aderindo a tal protocolo. Motivo esse pra usar o Signal que deu orígem ao Protocolo, foi feito por criptógrafos respeitados e é altamente aclamado por experts no campo.\n> Post sobre a integração do Protocolo Signal no WhatsApp: https://whispersystems.org/blog/whatsapp-complete/Signal: https://whispersystems.org\n\nAs falhas do Telegram já foram corrigidas. Isto é possível quando o software é de código aberto. O WhatsApp pode ter falhas que nunca vamos descobrir, já que o código é fechado. \n\nComo você disse não há como garantir que o WhatsApp use uma versão integra do WhisperSystems tendo o código fechado. Além disto, não dá para confiar no Facebook (Detentor do WhatsApp).\n\n ",
				"added": 1474959545
			}
		]
	},
	"comment_vote": {
		"56_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1
	}
}