{"cert_user_id": "ArKam@github", "next_topic_id": 3, "topic": [{"topic_id": 1604064752, "title": "URL Reverse and human readable.", "body": "Hi team!\nFirst of all kudos for you project! It's a great tool!\n\nNow I would like to ring a bell about the way we have to use it to browse and found existing site.\n\nI deeply think that if we want decentralized services to be adopted by most of people and not just skilled ones (We work for freedom and liberties for every internet user after all), we should implement some sort of decentralized search/discovery service and human readable URLs.\n\nSearch/Discovery service are made to ease the spread and retrieval of information \n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1421441965, "modified": 1421509720, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/22", "source_type": "github"}, {"topic_id": 1604064754, "title": "URL Reverse and human readable.", "body": "Hi team!\nFirst of all kudos for you project! It's a great tool!\n\nNow I would like to ring a bell about the way we have to use it to browse and found existing site.\n\nI deeply think that if we want decentralized services to be adopted by most of people and not just skilled ones (We work for freedom and liberties for every internet user after all), we should implement some sort of decentralized search/discovery service and human readable URLs.\n\nSearch/Discovery service are made to ease the spread and retrieval of informations online during a solo browsing.\n\nHuman readable URLs are made to ease sharing and references of a previous browsing session.\n\nTwo main features that our browsers commonly implements (Of course it perform such a thing using other system services) and that need to be implement to ease the adoption of your project.\n\nI'm not a professional of bitcoin but I know that bittorrent protocol implement resources discovery and advertising.\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1421442359, "modified": 1427749466, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/23", "source_type": "github"}], "next_comment_id": 5, "comment": {"1604064752_mirrored_ArKam_github": [{"comment_id": 1, "body": "Could you delete this entry as it was posted too soon and I can't edit it anymore.\n\nDuplicate with the #23 request.\n", "added": 1421442450, "modified": 1421442450, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/22#issuecomment-70342817", "source_type": "github"}], "1604064754_mirrored_ArKam_github": [{"comment_id": 2, "body": "Thanks a lot for your answer, here is a little more advanced explanation of my previous requests.\n\n**About the Addresses resolution topic:**\nEven if the addresses resolution feature was explain by the masses/users point of view on my previous post, I deeply think that it is (with advertising and discovery feature) a building block for decentralized services. As you said it, you're not addressing the masses adoption topic right now, but think of this feature as a building block of website articulation and/or as an compatibility feature for the already existing, working and well established internet standards.\n\nFor example:\nAs an enthusiast web developer looking for cool tools and plateform, I want to be able to use them by learning how they're working and how they address some of my issues, but I would certainly not us this cool tools if I dramatically have to change the way I'm developing my website.\n\nThe keypoint of this feature is not only masses adoption by a simplification of the user experience but rather the adoption by every targeted categories including devs by providing a great and simple learning curve.\n\nI'm not such a great example as my project are quite intricate projects but I'll take it anyway to illustrate my proposal.\n\nAs a web developer mainly focused on B2B customers, I have to build almost all of my applications using a URLs routing gateway which will be in charge of routing the requests to the correct resources.\nOn this specific topic and without URLs resolution, I'll have to generate a UID for each of the targeted resources, then modify my routing gatewat to hardlink them on it.\n\nI can assure you that because of the payload of my gateway, I'll have to change about a 100 of routing rules just to be able to test if ZeroNet is working correctly using automated tests.\n\nIn my case addresses resolution would literally save me a bunch of hours if not days depending on the way your platform/tool works and react on crash or life-cycle (Start/Stop/Restart/Reload/etc procedures).\n\n**Regarding the discovery / advertising capability:**\n\nOn some bittorrent network's clients, your client is able to discover and advertise peers about its configurations and services, as mention on this request: http://www.bittorrent.org/beps/bep_0026.html\n\nFor example, it would be cool to have a way to request for a list of nearest peers ables to provide a set of  resources (Website on your specific project) and then use Bitcoin crypto capabilities to check if it's not a MITM style attack etc.\n\nThis discovery/advertising feature could allow us to rapidly find a specific resource using the nearest/fastest path and then create sort a sort of decentralized search engine.\n\nIn the case of a unique node would be available during the discovery this node would be use IF and ONLY IF it is the original publisher of the content as we need to guaranty the user that it's not a malicious node.\n\nFor this last rule, a more complex one would be to keep in a bitcoin blockchain (or something similar) the history of the propagation of the resources and their signature to avoid any malicious modification.\n\nAnyway, I've got a loooooottt of idea regarding peer to peer and decentralized software / tools / infrastructure so don't take my example and arguments as formal request for feature but rather like reminders of what kind of cool features we (the community) and you (the core dev-team) would be able to implement.\n\nBTW: I'm sorry for my extensive answer, but I had to explain my previous ideas a little more as I'm on my PC today :D and can easily write way more detailed examples.\n", "added": 1421513886, "modified": 1421513998, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/23#issuecomment-70381874", "source_type": "github"}, {"comment_id": 3, "body": "No problems thanks a lot for your effort with ZeroProjects and to have take time to read my request.\n\nJust to add a final example about p2p website decentralized services, try to read some of the comments regarding the Bittorrent Maelstrom Browser project to avoid kinda ugly design.\n\nEspecially on the Static vs Dynamic serving systems and Security/Privacy regarding the way the software share the served pages and retrieve them to the users:\n\nhttp://blog.bittorrent.com/2014/12/10/project-maelstrom-the-internet-we-build-next/\n&&\nhttp://blog.bittorrent.com/2014/12/10/project-maelstrom-the-internet-we-build-next/#comment-1736424276\n\nI'll closely follow your updates on all the zero's projects ;-) way more interesting technology in here than everything I heard of on the Internet for now :D \n", "added": 1421598479, "modified": 1421598479, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/23#issuecomment-70421693", "source_type": "github"}, {"comment_id": 4, "body": "Yep, their implementation of the p2p web is not the right one I think.\nI deeply think that p2p is the right solution to build a bright new decentralized Internet as the global bandwidth increase every day and in the same time more and more company like Virgin / Google / Facebook etc try to build grid and outer-space networks to avoid the current ISP Controlled one.\n\nI'm working on p2p projects too so, when a friend of me linked me your work, I was really impressed by how it has been done so far and how far you are on it.\n\nKeep going on, this is a good, interesting and rewarding project.\n", "added": 1421601358, "modified": 1421601406, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/23#issuecomment-70423757", "source_type": "github"}]}}