{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1600474283_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 1,
				"body": "А сам зеронет не подходит? Клонируешь IFS, к примеру, и вперёд. Делаешь личную коллекцию на манер Internet Archive. Вот этот товарищ, например, музыку закачивает: [/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:channel+id:15f1_1oyBwMh85JeqD7GHkqeQZYFb511ER98oU](/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:channel+id:15f1_1oyBwMh85JeqD7GHkqeQZYFb511ER98oU)",
				"added": 1600504098
			},
			{
				"comment_id": 4,
				"body": "Пункт 1 всё парит, потому что \"доступна для всех\" - это нонсенс. Кто-то не шарит, что такое торренты в принципе, а способен только перетащить папочку \"куда-то там\". Всё равно придётся устанавливать доп. софт, даже среди \"вариантов, которые присматриваешь\" (типа, в пункте 1 пишешь, чтобы \"без доп. головняка типа tor\", но в третьем пункте сразу же идёт связка торрент + тор).\n\nЗаведи канал в Инстаграме и разрешай постить туда любую пользовательскую инфу в любом виде: ссылка на файлы с гуглдрайва, дропбокса, меги... Откуда угодно, к чему конечный юзер привык. Короче, организуй корзину, куда пользователи будут скидывать всё то, что по их мнению, должно быть \"в твоей коллекции\". Ну а твоя задача затем, как прохаванного юзера, \"сокрытого за завесой анонимности\" - качать с их источников и заливать на свой. Как и где хранить самому - это уже сам разбирайся. Это, имхо, лучший способ, потому что универсального решения по п.1 не найдёшь.",
				"added": 1602809186
			},
			{
				"comment_id": 11,
				"body": "> [zombibi](#comment_81_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): 1) по поводу wget - заменит обычный браузер.2) по поводу тор:Например, адрес книжной Флибусты в глубинном Интернетеhttp://flibustahezeous3.onionДописываем в конце ссылки .cabПолучается http://flibustahezeous3.onion.cabПопадаем в книжное братство Флибусты через обычный браузер. [...]\n\nhttps://notopening.com/site/flibustahezeous3.onion - не загружается в тор-браузере... Умерло?",
				"added": 1603847471
			}
		],
		"1601226893_1Fv7nPjCj4VGoNSZKWzdNcm5aYSHo93Rbu": [
			{
				"comment_id": 2,
				"body": "В оф. документации: https://zeronet.io/docs/\nИ вот тут рекомендую, чтобы понять, \"что, с чем и как\": https://github.com/imachug/The-Truth-about-ZeroNet\nЕсли внутри зеронета, то: [ZeroWiki](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/)",
				"added": 1601232733
			}
		],
		"1601631760_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY": [
			{
				"comment_id": 3,
				"body": "Очкуешь - не обновляй. Не очкуешь - читай исходный код и используй свою сборку.",
				"added": 1601653531
			}
		],
		"1602856649_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 5,
				"body": "Опыта нет, но тема интересная.\nМнения юристов по большому счёту будут совпадать с мнением системы, потому что юристы работают внутри неё и на неё. Тут не юристы нужны, а люди с другим типом мышления, которые понимают, что мир - это целостная система, и его нельзя разделить на границы (ведь мы все на одном \"космическом корабле\" Земля).",
				"added": 1602964954
			}
		],
		"1603798134_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 6,
				"body": "\"но пока мне кажется, что это более глубокая проблема.\" - же так думаю, потому что очень часто наблюдаю какие-то ошибки, связанные с Content publishing и числом трекеров, скачущих от почти полных до красных 2-3 (на главной странице в списке сверху)",
				"added": 1603803920
			},
			{
				"comment_id": 7,
				"body": "Сделайте форк с imachug и ковыряйте его. Чтобы он был где-то один. Чтобы не получилось, что \"один форк сделаю я, другой сделает ещё кто-то\" - и будет хаос)",
				"added": 1603804007
			},
			{
				"comment_id": 8,
				"body": "> [gitcenter](#comment_140_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Большое спасибо за то, что понимаете с полуслова. Вот почему всегда так? почему с человеком говоришь спокойно, а он на тебя кричит и обижается? Вроде как в ZeroNet'е люди адекватные, так что давайте не будет нагнетать и тратить силы на бесполезные ссоры. [...]\n\nУ меня, кстати, не видно этого сообщения от geekless - а ты его уже откуда-то сцитировал о_О И ничего не подгружается( Вот с чем это связано?",
				"added": 1603811726
			},
			{
				"comment_id": 9,
				"body": "> [geekless](#comment_404_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Довольно часто бывает. [...]\n\nНу, пока пиров меньше, чем десять, всё будет работать нормально xD\nА если пиров 150, то тут начинаются траблы... Хотя со временем конечно всё подтянется, я думаю, но из контекста человек уже выпадает - а это плохо, имхо...\n\nВопрос: какова роль трекера и как им стать? И можно ли вообще стать трекером? Каковы функции трекера и какими данными он оперирует? Я в этой теме плаваю... Если есть толковый ресурс (en/ru/jp), на который меня можно отправить, то можно скинуть ссылку.",
				"added": 1603812921
			},
			{
				"comment_id": 10,
				"body": "> [geekless](#comment_403_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Попутно выясняется, что дефолтная система логирования в питоне настолько бесполезная, что от её наличия вообще никакого толку. Сейчас для начала наделаю костылей для лога, а потом уж возьмусь за логику приложения.\n\nА есть возможность разработку стримить на твиче, например? Я бы посмотрел и поднабрался знаний касательно пайтона, вопросы бы позадавал. Я обычно свою работу так и работаю =) Довольно увлекательно получается, да и мотивирует \"на великие свершения\".",
				"added": 1603816724
			}
		],
		"1604363170_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 12,
				"body": "Используй что-то другое, например [KaffieID](/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/)\nZeroId - централизованный сервис, о чём говорится вот тут: https://github.com/HelloZeroNet/ZeroID/issues/3\n\nЧто не так?",
				"added": 1604363823
			},
			{
				"comment_id": 13,
				"body": "> [kmglnk](#comment_1_1DarpcdDi5Q95z5uG35MrdHo12nqRTyK6b): Если чистая установка и не использовался zero ID, а только кафи, то в блогах недоступны комменты. Даже если вставлен указатель на центр сертификации кафи\n\nИнтересно. То есть, чтобы читать комментарии, нужно быть зарегистрированным?",
				"added": 1606152297
			},
			{
				"comment_id": 14,
				"body": "> [kmglnk](#comment_5_1DarpcdDi5Q95z5uG35MrdHo12nqRTyK6b): Речь о том, что центров сертификации может быть далеко не один, а несколько\n\nНу так опять: не вижу проблемы. Клонируешь сайт и приворачиваешь столько центров сертификации, сколько посчитаешь нужным. Просто сделай форк и модифицируй... Это же легко.",
				"added": 1606700021
			},
			{
				"comment_id": 15,
				"body": "> [mokshanets2](#comment_15_1BTR1SP5uKs6nURymSE4uX74vJ8CmAXyB9): /1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/index.html:<html xmlns=\"http://www.w3.org/1999/xhtml\"> [...]\n\nNot found по ссылке. В чём соль?",
				"added": 1609007795
			}
		],
		"1608920071_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 16,
				"body": "> [ciklopit](#comment_7_1CTXZrGJQiFjTappyJ3dJpuyb7Wecw7iSp): Какую «аудиторию»? Англоязычную? Это как раз и есть «хорошенькое предложение», чтобы развивать русскоязычное сообщество в ZeroNet, и не плакать потом, что русском zero-сегменте мало качественного контента. Если «интересно», то попробуй «так и сделать».\n\nВыучи английский - и информации сразу станет на порядок больше лично для тебя :D",
				"added": 1610036944
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 17,
				"body": "Думаю, можно считать, что nofish более неактивен, и думать, что поделать с его детищем. Героически ждать ответа уже второй год - это сильно...",
				"added": 1620692176
			}
		],
		"1630943493_1Lzki6TM1dDKspyDRwNVMn4ogZr17eehbb": [
			{
				"comment_id": 18,
				"body": "А куда им ещё податься? =))\nС другой стороны, \"громких далеко слышно\" - это ошибка выжившего. Это не значит, что тут одни маргиналы и сторонники теорий. Тут их сообщения не модерируются, и для них это хоть какая-то возможность для выражения себя.\n\nНу и ещё, как вариант - это так называемая \"подрывная деятельность\". Когда несколько человек специально закидывают перспективное место вроде ZeroNet'а откровенной кучей дерьма, чтобы адекватные новоприбывшие реагировали как-то вот так, как сообщение автора темы... Увы, такая вот \"свобода слова\" - она подразумевает, что все будут слышать всех.\n\nА дальше - дело за самостоятельной фильтрацией таких пользователей.",
				"added": 1630947240
			}
		],
		"1632043057_12T9CGYv5qxzqQFTrK91jRqHrBcKDpSuME": [
			{
				"comment_id": 19,
				"body": "\"можно помочь конечному пользователю не читать те сообщения, которые он не хотел бы видеть\" - есть возможность сделать \"Mute\". Какие ещё нейросети? Весь смысл таких сетей в том, что контент модерируется только тобой лично. Хочешь цензурировать? Создай и развивай свой зайт.",
				"added": 1632089476
			}
		]
	},
	"comment_vote": {
		"380_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}