{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Quelle va être l'évolution du contenu de ce réseau?",
			"body": "Je constate avec 1 certaine curiosité que si l'on compare le contenu de ce réseau à celui de Tor, le contenu est plutôt sage selon vous quel va être l'évolution en matière de contenu de cet endroit d'échange très sympathique pour l'instant",
			"added": 1463522670
		},
		{
			"topic_id": 2,
			"title": "Les sujets qui fâchent",
			"body": "Ça pourrait être le titre d'un futur forum présent ici, en dehors du contexte d\"actualité de notre réseau commun de toutes considérations informatiques. Il serait entièrement sans censure bien entendue avec 1 tonalité polémique de bon aloi. Je prévois 1 bonne quarantaine de sujets prédéfinis avec 1 ton bien entendu très polémique et tout ceci sans le couperet de la censure omniprésente sur pratiquement tous les forums de l'Internet conventionnel et réglementé.\nJe souhaiterais connaître votre avis sur ce projet? ",
			"added": 1463663174
		},
		{
			"topic_id": 3,
			"title": "3 systèmes d'exploitation et 3 chances de ne rien comprendre en informatique",
			"body": "Commençons par le doyen Wincaca 1 000 000 000 1/2 d'utilisateurs .Utiliser 1 caca revient à remplir 1 panier d'eau en bas du village et de vous rendre compte de ce qui aurait reste à l'arrivée. Le système d'exploitation décriée si précédemment est 1 source d'emmerdements et 1 pompe à fric..Certainement 1 source d'emmerdements la plus répandue et pour s'en convaincre regarder le nombre croissant des entreprises de dépannage\n\nLe Pingouin .C'est tout simplement indigeste quand on vient de Wincaca  l'installer un Tar gz vous avez demandé la simplicité Ne quittez pas DEBIAN arrive à votre secours\n\nLe 3e système d'exploitation appartient aux riches pas grand-chose à redire sinon que le prix est inacceptable   Qu'est-ce que je fais maintenant si je suis débutant   ,,,,?  Rien tu achètes 1 paquet d'actions de chez Total et tu auras largement gagné ta journée\n\n\n\n\n\n\n\n\n\n",
			"added": 1463751145
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": [
			{
				"comment_id": 1,
				"body": "Bonjour à toutes et à tous. Quant à moi je suis favorable à l'injonction faite aux dirigeants des chaînes de télévision française d'embaucher des femmes pulpeuses pour présenter le journal télévisé par exemple. Je rêve des chaînes de télévision qui aurait le courage d'avoir dans les effectifs 1 femme ou même plusieurs particulièrement pulpeux avec des gros nichons qui représenteraient 1 plaisir abyssal de bonne facture. J'en appelle sincèrement à toutes les forces vives de notre pays d'exercer 1 pression à l'endroit de nos dirigeants politiques afin que cette situation rentre dans l'ordre et que le calme revienne également de notre beau pays.\nVous en conviendrez cette situation ne peut plus perdurer et perturbe le bon fonctionnement de notre pays",
				"added": 1463685154
			},
			{
				"comment_id": 2,
				"body": "LIRE PULPEUSE LOL",
				"added": 1463689520
			},
			{
				"comment_id": 3,
				"body": "Si justement .......",
				"added": 1463696385
			}
		],
		"3_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": [
			{
				"comment_id": 4,
				"body": "un riche up4...",
				"added": 1463755045
			}
		]
	},
	"comment_vote": {}
}