{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "+ (capdoki тоже я, соответственно, было лень перекатывать аккаунт с линюха на Windows)",
				"added": 1525258465
			}
		],
		"1_14VYTUXRHkxooT1RzmnmzrYYVixozGfH3z": [
			{
				"comment_id": 2,
				"body": "> [calmaquesse](#comment_4_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Поэтому воевать с ними смысла нет. Это как дракон: отрубил голову один раз - выросла новая. Гораздо эффективнее создать достаточно надежные и достаточно распределенные протоколы, чтобы компетентные органы не заморачивались с их взломом.\n\nА зачем создавать протоколы, если Zeronet прекрасно себя чувствует? Никто не мешает на его основе захостить базу данных, в которую грузить сообщения с симметричным 256-битным ключом шифрования. В жизни не заблокируют и не расшифруют, если, конечно, кто-нибудь ключи не сольёт.",
				"added": 1525259159
			},
			{
				"comment_id": 3,
				"body": "> [calmaquesse](#comment_21_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Ну, я и подразумевал развитие анонимных средств коммуникации. Зеронет, Даркнет - неважно. Суть была в том, что патриоты, пытающиеся как-то взаимодействовать с зомби под названием \"российское общество\", вообще не туда воюют.\n\nНе все понимают, что анонимные средства коммуникации имеют смысл. Вечная проблема \"Мне нечего скрывать\"\nНужен стимул, чтобы перейти на что-то другое. Сидел до недавнего времени в ВК, да и сидел бы дальше, не прочитай новость про Дениса Лебедева (который химик), тогда в голове щёлкнуло понимание, что следят ,а последствия могут быть плачевны.",
				"added": 1525259965
			},
			{
				"comment_id": 5,
				"body": "> [strellok](#comment_8_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg): Кстати, не факт. Сегодня смехуечки, а завтра — нарушение УК.\n\nВот по этому смысл шифровать есть для всех - писать в соцсети можно только небольшую часть того, что хочешь, иначе потом при попытке выехать из страны на тебя смогут повесить что-нибудь вроде административки с большим штрафом. И делать это каждый раз (а неоплаченный штраф делает тебя невыездным)",
				"added": 1525261500
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 4,
				"body": "> [calmaquesse](#comment_17_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): И что он засечет? Электромагнитный фон сам по себе высокий из-за массы электроприборов и того же Вай-Фая. Это прокатывало в СССР, когда радиоизлучения было на порядок меньше, чем сейчас.Вы же знаете, сколько та же микроволновка излучает на Вай-Фай частотах?\n\nФон-то высокий, только есть отличие между направленным сигналом и сигналом Wi-Fi роутера. Напряженность поля вокруг Wi-Fi роутера +- равномерная, а при проезде-пролёте мимо направленной антенны словишь пик. Беспилотники дают безграничные возможности по поиску таких антенн. Также минус сети подобной в её неустойчивой работе - работники радиоконтроля выбивают один из узлов, в итоге огромная часть сетки отключается. \nЕё ещё нужно спроектировать правильно тогда, а не каждый согласиться повесить у себя дома передающую антенну, за которую можно будет сесть в тюрьму.",
				"added": 1525260983
			},
			{
				"comment_id": 6,
				"body": "> [calmaquesse](#comment_24_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Странно. У меня, по крайней мере, Вай-Фай сбоит при её работе. Но ладно, насчёт остального поручиться не могу - точный спектр излучения я не знаю.И всё же, однозначно, чисто умозрительно возможность засечь всё и вся невелика. Это затраты времени и средств, а укрыться можно, просто выключив на время излучатель.\n\nСредств у государства очень много, да и как укрыться, если проверять наличие излучателей, допустим, будет дрон, который пролетает через квартал за 10 секунд?\n\nP.S. Если микроволновка что-то излучает во внешнюю среду, скажите спасибо инженерам, которые разрабатывали её по принципу \"И так сойдёт!\", такого не должно быть в нормальном устройстве.",
				"added": 1525265273
			},
			{
				"comment_id": 7,
				"body": "> [calmaquesse](#comment_25_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Почему вы настолько уверены в тотальном всесилии и всеохватности нашего государства?Они, вон, пробовали дронов использовать в доставке почты. Дрон этого не пережил.\n\nЯ не верю во всесилие государства, но для нашего ОПК сборка подобного дрона не будет составлять больших трудностей. В full-КНДР mode все интеллектуальные ресурсы страны будут насильно направлены на государственные нужды, доставка почты дроном - это не дело государственной важности.\n\nСейчас из страны все специалисты в области робототехники уезжают, просто потому, что у нас делать нечего ,а уехать пока представляется возможным. Если границы перекроют, единственное место, куда им можно будет податься - это ОПК.\n\nЗакрытие границ => Инженеры работают на \"благо родины\" => Дроны\n(получится противостояние подпольной инженерии и государственной, где государственная явно будет выигрывать в ресурсообеспеченности, так как им под силу обрубить поставки компонентов)",
				"added": 1525266262
			},
			{
				"comment_id": 8,
				"body": "> [calmaquesse](#comment_26_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Мда, что-то тотальная забитость чувствуется в ваших словах. Я, конечно, понимаю, что айтишники далеки от того, чтобы быть боевым авангардом чего-либо, но, похоже, сам факт неизбежности выстраивания успешной тотальной цифровой диктатуры в РФ вы даже не подвергаете сомнению.\n\nДа нет, просто сам из области робототехники сюда пришел и представляю себе что можно сделать, а что нельзя. Апогей диктатуры вот какой: кто хочет общаться свободно - тот будет, но небольшими группами, а не громадными сетями, вопрос в том, сколько усилий приложит государство к этому и достигнет ли этого апогея\n\nПро неизбежность никто, вроде, не говорил, а вот теоретическая возможность есть.",
				"added": 1525267020
			},
			{
				"comment_id": 9,
				"body": "> [balancer73](#comment_355_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Таких везде достаточно много. А для того, чтобы шла связь в том же ZeroNet достаточно единичных гейтов в «большой внешний Интернет» :)\n\nНе стоит воспринимать локалку проводную как что-то нерушимое, она всё-таки провайдерами обеспечивается, вот и получается, что либо как бурлаки провода тянуть будем, либо радиоканал (а оба варианта не дают 100% гарантий безопасности)\n\nВариант со спутниками более убедителен.",
				"added": 1525267664
			},
			{
				"comment_id": 10,
				"body": "> [calmaquesse](#comment_28_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Боюсь, при тотальном обрезании Интернета предложенный мной способ - единственный. Ну, кроме эмиграции, конечно.\n\nПри тотальном обрезании Интернета эмигрировать в виде беженцов придётся.",
				"added": 1525268017
			},
			{
				"comment_id": 11,
				"body": "Я раньше верил, что у Путина голоса фиктивные, что власть снимут раньше, чем она успеет ввернуть тотальный контроль. У меня в голове не укладывалось, что люди реально могут это поддерживать, но чем дальше в лес - тем больше дров. Это как окна Овертона - постепенно сдвигает критерии нормального в нужную сторону.\n\nЧем больше цензуры, чем плавнее её вводят - тем слабее сопротивление, то, что когда-то вызывало отвращение - сейчас норма. \n\n- Кто-то не позволяет менять свои нормы извне и строит их сам на основе длинного временного промежутка. \n- Кто-то не тратит силы на то, чтобы видеть всю картину целиком, вот и получается: \"ну, стало немножко хуже, ничего очень страшного\". \n\nКакой тип людей доминирует по численности - думаю, очевидно. Вот сейчас Телеграм напомнил людям о их правах, которые должны быть изначально - появился \"Digital resistance\", кто-то впервые увидел целостную картину.",
				"added": 1525269218
			},
			{
				"comment_id": 12,
				"body": "> [balancer73](#comment_357_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В России вся эта фигня творится все 1000 лет её истории. Последние 15 лет — далеко не худшие в её истории, а последние 10 лет — прямо лучшие. И, не смотря на перекосы, типа идиотизма с Роскомпозором, тренд в целом всё равно положительный. А когда у нас в России было без идиотизма?\n\nИдиотизм - это не норма, фигня - тоже. Вы не верите, что может быть лучше? А вот я верю)\nНе могу сказать за бытовую часть жизни, я больше по науке и обществу. И то, что твориться там меня совершенно не устраивает.\n\nНедавно президент приезжал в Политехнический университет, 30000 студентов не пустили учиться, часть заперли в корпусах и запретили выходить. Он ходил по пустому университету. По телевизору, конечно, это выглядело по другому - ему демонстрировали электромобиль, всякие манипуляторы двигались на заднем плане. Только вот манипулятором никто на самом деле пользоваться не умеет ,а электромобиль не ездит - какая незадача ;)\n\nИ я не считаю положительным тренд, когда школам, например, не выплачивают денег, совсем - школа зарабатывает на свои нужды благодаря платному дополнительному образованию. А школа - это институт, образующий будущих граждан, какие же граждане вырастут, если образование очень средьненькое?\n\nКонечно, в идиотизме и хрущёвках есть своя романтика, с этим не спорю - мне она самому нравится, но только в комплекте с не менее романтичным народом. Если из нас пытаются вырастить нацию идиотов - то о чём говорить?\n\n---------------------------------------\nНасчёт альтернатив Путину - дело не в нём, конечно, дело в принципе во власти. В том, что наша страна оказалась на задворках - виновата не страна и задворки, у страны как раз огромный ресурсный и умственный потенциал, который почему-то не реализуется. Россия вполне могла бы быть культурной и технологичной, у нас есть люди, которые способны обеспечить всё это - никто же не будет спорить, что талантливых людей у нас очень много?\n\nТолько вот эти люди уезжают из страны просто потому, что тут им оставаться либо небезопасно, либо негде работать, либо условия жизни не устраивают (зачем жить там, где плохие условия и идиотизм, если можно жить там, где тебе будет хорошо) И я уверен, что такие условия, благоприятные, вполне в силах обеспечить, только не собираются пока. А будут условия - будут и технологии, и культура (потому что культура - одно из условий)",
				"added": 1525272974
			},
			{
				"comment_id": 13,
				"body": "> [balancer73](#comment_360_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Я верю, что может быть лучше. Я знаю, что может быть хуже. И ещё я знаю, что принцессы не могут не какать. \n\nХуже всегда быть может, только надо стремиться к лучшему\n\n> Ок. А какая из имеющихся сейчас кандидатур политиков обеспечит развитие российского образование? Не на словах «за всё хорошее против всего плохого», а на практике?\n\nПо-моему отсутствие таких кандидатур вызывает определённые вопросы. Ну не верю я, что на 190млн человек нет никого, кто хотел бы продвигать образование. Пускают его к власти или он сидит где-нибудь в областях - другой вопрос.\n\n> Так почему Россия 1000 лет своей истории либо остаётся на задворках, либо движется вперёд с жёстким и/или жестоким лидером? Можешь назвать период в истории, когда Россия лидировала будучи свободной страной?\n\nЖесткий лидер - это хорошо, если с ним государство реально движется вперед. Лидер не может быть мягкотелым, не понимаю, почему \"жесткость\" поставили рядом с \"жестокостью\".\n\n> Когда проблема существует в течении всей многовековой истории страны, то дело однозначно не в лидерах.\n\nКогда было финансирование науки - была и наука. Когда на науку болт клали или только делали вид, что не кладут - науки не было. Очень простая арифметика, кстати.\n\nС образованием сложнее, там уже нужно не только финансирование, но и программы. Вопрос в том, насколько наплевательски относится правительство к будущему государства: если ему главное прожить 30 лет, хорошо и красиво прожить, набив деньги по карманам - конечно же, будут растить тупое стадо, которое позволит делать с ним всё, что угодно. Если правительство интересует не только свой срок правления, но и какие-то дальнейшие перспективы - там и культура, и образование будут соответствующими.\n\nИ наше правительство на будущее плевало с высокой колокольни.\n\n------\n\nЕсли честно - ненавижу политические споры, всегда есть две стороны, которые никого слушать не хотят, апеллируя к своей (и только своей) точке зрения. Естественно, никто свою точку зрения не поменяет, так что это не имеет смысла, слишком многое лежит в основе политических взглядов, чтобы их поменять сообщений на форуме явно не хватит. По сему удаляюсь, вернусь когда здесь цензуру и блокировки снова обсуждать начнут",
				"added": 1525283768
			}
		]
	},
	"comment_vote": {
		"64_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"14_156H4gJ5tcj9gnJXHevA3xFpdd3uWLePeg": 1,
		"14_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": 1,
		"22_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": 1
	}
}