{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 22,
	"comment": {
		"1567266468_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 1,
				"body": "Oh, look. An ideas guy. How cute.",
				"added": 1567279373
			},
			{
				"comment_id": 4,
				"body": "> [theecollector](#comment_48_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): oh look a useless bitch that has to work for someone else to put food on the table... I however make my ideas come to live and product my own food for the table... In the form of $350 per hour!! Wanna see proof?? i gots it!! [...]\n\nI'm sure you \"gots it\", sweetie.",
				"added": 1567299836
			},
			{
				"comment_id": 5,
				"body": "> [theecollector](#comment_51_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): here dick wipe suck on these numbers 💰🤑💰🤑💰🤑💰🤑 https://trello-attachments.s3.amazonaws.com/5cc33c47224b67686917f1a6/5d212ea66504d111b2c98e43/1b427ef5b06322e21dab30c43ed452eb/image.png the math for this month shows actually boils down to $383.65 PER HOUR SWEETIE...\n\nI'm surprised you're smart enough to figure out element inspector tbh.",
				"added": 1567300260
			},
			{
				"comment_id": 6,
				"body": "> [theecollector](#comment_54_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): post your gains if your think your a coder thats got what it take to actually make money without a business partner... go on... cuz i can make LOTS of money without a coder... I can move on and find what is this not like my 7th stream of income?? Im only doing this that i post cuz i wanna not cuz i need to. For me.... this is a hobby. 🎤\n\nAll those screenshots are fake or from somebody else's account. You won't post any real proof because you're obviously a scammer telling a lie.",
				"added": 1567300922
			}
		],
		"1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 2,
				"body": ">Many scriptkiddies have joined ZeroNet (because of 08chan) recently; real developers won't have trouble checking that this vulnerabilty is real.\nAnyone in particular that you consider a scriptkiddie at 08chan?",
				"added": 1567289858
			}
		],
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 3,
				"body": "A few days ago you said you were new and asked me to \"be gentle\" with you, then thought the Mute button was gone when we upgraded Millchan when all you had to do was click on the arrow next to the post numbers, and now you consider yourself qualified to determine who has or doesn't have alts and who's a glownigger or not based on your obviously genius intellect?",
				"added": 1567298138
			},
			{
				"comment_id": 8,
				"body": "> [bigbadbob](#comment_485_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Well... If one of your alts happens to be  \"nofish\"... I'm running outta data:)  thx lol\n\nAre you saying gitcenter is nofish himself trying to legitimize his power by preemptively being behind the push for ZeroNet's decentralization all along? Now that's a conspiracy theory if I ever heard one.",
				"added": 1567314569
			},
			{
				"comment_id": 14,
				"body": "> [nickwa](#comment_424_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): So, you actively support it. That's all I needed to know.\n\nTry not to be retarded for a second and think beyond \"orange fox bad\".\nFirefox is miles better compared to Chrome(ium) for privacy because you can tweak it to remove the spyware much more easily. There is a reason Tor Browser is based on Firefox and not in Chromium.",
				"added": 1567323477
			},
			{
				"comment_id": 15,
				"body": "> [nickwa](#comment_429_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): The only benefit Firefox has is privacy in my eyes. You make it seem like I don't actively use Tor.\n\nThen begin thinking from a perspective of \"what can we get done from here\" and stop calling out people for random inane reasons that are of no consequence at all.",
				"added": 1567323779
			},
			{
				"comment_id": 16,
				"body": ">Mozilla actively combating \"fake news\" is a real issue\nNo, it's fucking not. When was the last time it blocked you from seeing a site or even showed you a warning for wrongthink? Never. And besides, as I said, calling out someone for preferring one of two evils is retarded and disruptive on your part. The REAL issue is every accessed URL is sent to Google for malware detection purposes. THAT is the real issue, not some lefty PR they did or whatever.\n>and why they should not be supproted.\nI never said they should be supported (as in donations). Other kinds of \"support\" are irrelevant.\n>They also kicked out Brendan Eich for a decade old donation \"against gay marriage\" during a time where even Obama was against it.\n>All I am doing is calling you guys out for your bullshit. I cannot support companies that also bring up decades old shit against somebody.\nYou have no idea how things work, do you? The executives at Mozilla aren't going to change their policies because of some nobody calling them out on some random message board. Almost all of the money they're getting is from big tech companies donating to them. It's surprising they are making a usable browser at all. It's sad that there are people posting on here who don't have the IQ required to realize that and behave pragmatically rather than throw an autistic fit for no reason.",
				"added": 1567324741
			},
			{
				"comment_id": 20,
				"body": "> [filips](#comment_168_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY):    Isn't list of URLs stored and compared locally? Anyway, you can disable this, unlike in Chrome.\n\nNo, it's sent over the Internet. Yes, you can disable it more easily than on Chrome (although there it's possible by patching the source code).",
				"added": 1567362542
			},
			{
				"comment_id": 21,
				"body": "> [filips](#comment_175_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Are you sure? Based on this it checks local list but I haven't checked Firefox source code: [...]\n\nI stand corrected then.",
				"added": 1567364893
			}
		],
		"1567301440_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 7,
				"body": "Kill yourself, \"nigga\".",
				"added": 1567302119
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 9,
				"body": "Wait... Are you the reason Tor exit nodes have been unusable on ZeroID for the past 24 hours? You bloody kunt.",
				"added": 1567315041
			},
			{
				"comment_id": 10,
				"body": "> [gitcenter](#comment_870_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): :( Let this be a reason to increase ZeroID resistance to attacks.\n\nWonder if he's one of those 8chan skiddies you were talking about\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX:tech:17f22a9d-8c86-440d-a727-262dcc4af749#post-5f993bf4-de36-42f2-a58b-834b8c1de7fb",
				"added": 1567315351
			},
			{
				"comment_id": 11,
				"body": "Somebody should create a list with this guy's IDs to prevent him from using them to attack other zites.",
				"added": 1567317863
			},
			{
				"comment_id": 12,
				"body": "> [gitcenter](#comment_873_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Why? It's fun...\n\nSure, because he decided to keep it all contained in a single thread. But if he had decided to post new threads, or worse, post to random threads, it would be a mess.\n>I mean, I can share a list but this just shows that ZeroNet is not ready for such amount of content yet.\nHow do you have a list? Are you the one running the bot?",
				"added": 1567318106
			},
			{
				"comment_id": 13,
				"body": "> [gitcenter](#comment_876_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): uh, yeah...\n\nNevermind then. Since you're here, I'll ask you something. Do you know if the software running on ZeroID has been publicly published? The \"Try again later\" message when trying to create new users and the IP is banned doesn't seem to show up anywhere in HelloZeroNet.",
				"added": 1567318587
			},
			{
				"comment_id": 17,
				"body": "> [z0z0z0z0z0z0z0z0](#comment_7_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA): You have the point. Zeroid in today's form si (closed source) bullshit and weakness.Do you have solution?\n\nI don't know what he thinks is the solution, but to me the solution is to extend ZeroNet's authentication related functionality in the API so additional authentication methods can be built on top of ZeroNet, and to allow sites to ask the user to install plugins to extend the client's functionality. nofish has mentioned working on some kind of index system that would allow generating anonymous auth_addresses from the master seed, which would cover the first point I mentioned to some extent.",
				"added": 1567326977
			},
			{
				"comment_id": 18,
				"body": "> [gitcenter](#comment_902_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): if fake 200 users can do harm, it means that real 200 users wouldn't do the same.\nThe difference is people come here to read real people's comments, not fake user's comments. So no, 200 real users wouldn't do the same.\n>Personally, I don't see any problem in bots registering IDs.\nThey alreaady can do so, as you obvious proven here. In fact it's very easy to do, just two HTTML requests and waiting until your certificate is received.\n>From my point of view, ZeroTalk should support some kind of whitelist: you specify what users you want to read.\nOh, come on. Whitelists would be extremely impractical. Not to mention any semblance of anonymity would be lost if everyone is required to have a stable ID to have any hope of being read by other people.\n>Posts/comments from those users rise up. Non-whitelisted posts/comments are either hidden or made almost transparent.\nSee the above. We should go in the direction of more anonymity (while maintaining or improving humanness guarantees), not less.",
				"added": 1567327437
			},
			{
				"comment_id": 19,
				"body": "> [gitcenter](#comment_904_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): There are bad people too. They could be paid.\nAll threat models require an adversary with finite resources. Otherwise I could say it's hopeless since those same people could be paid to storm datacenters and ISPs with guns until they track down every ZeroNet client and cut it off from the Internet.\n>Hehe. Haha. Cough-cough. It took me several days to register accounts, and nofish counterattacked all my attempts to leave the script running at night when I'm sleeping.\nReally? What did he do, other than the regular throttling of IPs?\n>Being anonymous means that you can break everything anonymously. If you have several accounts, that's rather easy to do.\nBut it doesn't mean you can break everything anonymously forever.\nMaybe some ideas from anonymous cryptocurrencies like Monero could be borrowed, as in those systems it's possible to prove the originator of a transaction has some resources without revealing who the originator is. So people could prove they are upstanding members of the community without revealing their identity.\nBut for this to be possible at all we need a way for ZeroNet users not to always identify themselves in the first place without having to fiddle around with user.json files.",
				"added": 1567361830
			}
		]
	},
	"comment_vote": {
		"3_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": 1,
		"2_13Gu27WksygoMQzLpktTGzZTHumTN5pce1": 1
	}
}