{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1524682774_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "Доброй ночи. Да никуда я не ныкался), работал полдня, а потом продолжал тег #вещества. \nЦитата - огонь, прямо в яблочко. Отлично суммирует и мои мысли тоже.",
				"added": 1524694597
			},
			{
				"comment_id": 2,
				"body": "А насчет ЛОРа, я и не думал, что так серьезно все в РФ чекают, и даже что-то может светить. Позабыл уже.",
				"added": 1524694715
			},
			{
				"comment_id": 3,
				"body": "Учитывая количество людей, которое тут с нами обсуждает эту тему, человечество еще не скоро захочет мыслить такими категориями.",
				"added": 1524776268
			},
			{
				"comment_id": 4,
				"body": "Ну вот благодаря тебе стало на одного пользователя больше. \n\nЯ, кстати, глянул проект Asgardia. Ничего такие ребята, отличное начинание. Хотя бы чисто идеологически. И название в тему) Люди по-немногу начинают доходить до этого сами. Но мы еще не достигли критической массы.\n\nМеня всегда поражало, как фундаментальные законы и взаимодействия на уровне атомов применимы к законам жизни и общества. Только при достижении критической массы происходит переход. Эдакий барьер. Вот и наш барьер пока что - сохранять статус кво для дядек с чемоданами. Но какая-то движуха потихоньку начинается.",
				"added": 1524866253
			},
			{
				"comment_id": 5,
				"body": "Идея с рейтингом мне нравится. Тут скорее сложность возникнет в другом. Как предотвратить создание фейковых аккаунтов, накручивание счетчика голосов и спама в пулл-реквестах. Последнее можно легко решить наличием минимального уровня голосов для предложения по изменению конституции. А первое же... ничего другого, кроме как привязки акка к реальным данным гражданина ко мне в голову не приходит. Как раз таки доступ к информации перекрывать нельзя. Планета Земля должна знать своих героев. Или анти-героев. Блокчейн по-любому пригодится. Удобно будет иметь распределенный журнал со всеми изменениями и всеми именами, кто в них участвовал. \n\nСитуация напомнила диалог из фильма Ка-Пэкс:\n- А что происходит на твоей планете, когда кто-то совершает преступление, убивает кого-либо или насилует?\n- Да ничего не происходит. Мы тем и отличаемся от вас людей - у нас никто не совершает преступлений. \n\nК сожалению, нам до такого уровня среднего интеллекта еще пилить и пилить.",
				"added": 1525004206
			},
			{
				"comment_id": 6,
				"body": "Вообще, я бы блокчейн в правительство насильно внедрил уже сейчас. Чтобы сразу было видно, чьи грязные ручонки что трогали и когда. И кому из чиновников за это устраивать темную в реал-лайф. \n\nА по теме, думаю, если сантехник Вася предлагает какое-нибудь очень логичное и здравое изменение, пусть и словами, которые далеки от юридических стандартов, то пусть так и будет, я проголосую. Мы ему вместе поможем текст переписать. Но отлучать его от процесса создания государства будущего будет архипреступно, ясчитаю.\n\nЯ так понимаю, только на suckless.org программы находятся в завершенном состоянии. Конституция должна быть живой. Адаптироваться под окружающую обстановку. Ее нужно выращивать на протяжении всего времени, а не изобретать идеальную на все времена.",
				"added": 1525004801
			},
			{
				"comment_id": 7,
				"body": "Тогда возникает интересный вопрос с наличием ответственности любого индивида перед всеми остальными членами общества.",
				"added": 1525023859
			},
			{
				"comment_id": 8,
				"body": "Именно поэтому к голосованию нужно допускать абсолютно всех участников системы. Допустим после некоего минимального рейтинга, собранного на основе обсуждений в, грубо говоря, конституционном баг-трекере, который будет отражать влияние в обществе и общую адекватность индивида. Но чтобы потенциальный доступ к такой фиче был даже у сантехника дяди Васи. А то снова получится разделение на классы. \n\nМожно даже подключить свой блокчейн, который будет бюджетом. И все смогут вносить на него бабки, а-ля налоги, а взамен получать некий процент контроля за расходованием бюджета на следующий год. \n\nТо есть нам вообще не нужны куча нахлебников в гос. учреждениях. Технологии сделали их рабочие места попросту deprecated.",
				"added": 1525024774
			},
			{
				"comment_id": 9,
				"body": "> [geekless](#comment_1_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я так думаю, виртуальные личности будут иметь разве что виртуальную власть.Реальная власть, то есть контроль над физическими ресурсами, требует физических личностей, со вполне понятными последствиями для несогласных, как в той присказке, где \"бить будут по морде, а не по паспорту\". Извините, ребята, но это построение прожектов виртуальной конституции очень оторвано от жизни выглядит. Реальная власть - это контроль средств производства.\n\nВот оно! Виртуальные личности будут иметь виртуальную власть. В том и дело, что как раз такие системы нужно делать прозрачными. Чтобы в них невозможно было нарушить закон. Чтобы сразу было видно соседям, чье лицо ехать начищать в случае факапа. Хочешь рулить и брать ответственность - готовься огребать по полной программе. Так всегда было. Просто сейчас они обложили себя законами, грубо говоря - бафнулись на защиту от юридических подкатов, а мы им как раз этот баф снимем. Ибо власть будет в руках у общества. И именно общество будет теперь напрямую платить за услуги.",
				"added": 1525025140
			},
			{
				"comment_id": 10,
				"body": "> [deepstrelok](#comment_3_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Начищать лицо никому не надо) Общество может своего рода заминусовать личность за проступок и вот уже человек не имеет ничего. Но это будет работать если действительно репутация имеет реальную значимость.\n\nПредставьте себе конвертируемый ресурс - единица власти, е.в.))))))",
				"added": 1525025776
			},
			{
				"comment_id": 11,
				"body": "Что-то вроде ОАО с динамическим уставом и ротацией власти, на основе корпоративного рейтинга? \nЗвучит интересно. Только рейтинг тоже должен быть динамический в реал-тайм. Чтобы он мог рухнуть точно так же, как и подняться.",
				"added": 1525027245
			}
		]
	},
	"comment_vote": {}
}