{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1629748915,
			"title": "Cyberpandemic incoming",
			"body": "Will zeronet work if NWO try to takedown internet? Where in zeronet would be the best place to meet up..? Zerome? some board? Advice from more experienced zeronet users?",
			"added": 1629748914
		}
	],
	"topic_vote": {},
	"next_comment_id": 38,
	"comment": {
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 1,
				"body": "> [frankdank](#comment_7_18rBTXj2fkSLcnaumaafaidHTFEA6eu5kV): You people are so fucking retarded man. It is more dangerous than the flu because it kilsl literally 7 - 8x's the ammount of people per capita that the regular flu does. It floods our hospital systems and hurts even more people that way who, otherwise, would have beds and doctors to attend to them, but, now their beds are filled with covid patients. You fucking retards need to be put against a wall and shot.\n\nNo it doesn't.. fake stats, fake tests, fear, maybe 5g who knows.. Its a hoax 100%",
				"added": 1610328264
			},
			{
				"comment_id": 2,
				"body": "Corona a group of viruses, aka common cold. Covid-19 is something else. If we keep calling it corona they will start making us fear the common cold. Corona is never going away. Covid is something else.",
				"added": 1610328556
			},
			{
				"comment_id": 3,
				"body": "To stop this hoaz we need:\n1) Big fat dose of vitamin T\n2) Non waxxers must organize to widespread civil non-compliance regardless of cost\n3) Spiritual awakening\n4) Start becoming self sufficient\n5) Boycott all global companies\n6) Use cash and savings in gold or BTC\n..  what else?",
				"added": 1610329025
			},
			{
				"comment_id": 7,
				"body": "> [jager](#comment_2_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Corona is pretty real. I've had it. It wasn't bad, I think your outcomes are highly dependent on underlying health factors. Oddly nobody is talking about those. This virus targets the obese and diabetic. Otherwise, it kills old people at the same rate that every other coronavirus and flu kills old people. In Canada, the average covid death age is slightly higher than the average mortality age.  It's just been really taken advantage of by world governments to implement all kinds of controls. Trudeau himself called the pandemic an \"opportunity\".\n\nCanada seems to be in pretty bad shape.. Trudeau has to f-off asap! Watching you guys in the news. Im sorry for you :(",
				"added": 1610331533
			},
			{
				"comment_id": 8,
				"body": "> [jager](#comment_3_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Thing is, I don't really think it's all that bad. Like I said, we seem to have COVID mortality that is greater than the average age of mortality. We have a higher death rate that many countries yet have thrown more money at it than virtually any country in the OECD. Makes me think there is very little mitigation you can do here. I think prevention is key; Quercetin, Vit D, maintaining a healthy weight. People get unlucky and die from the cold or flu every year. [...]\n\nYeah, I believe vitamins etc do all the difference! I have everything from Ivermectin to Chaga. Regarding stats don't trust them at all. I think they are probably fake, tampered or misleading. The Globalists will stop at nothing to get their \"great reset\".. One thing is 100% true - Its not about the virus anymore. The people are being duped.",
				"added": 1610332610
			},
			{
				"comment_id": 13,
				"body": "> [gitman1](#comment_2_18VGb4xP2GiQf9kL1VgT2czEGFZ5dbacrs): I think if people started pricing goods in bitcoin that would freak the establishment out.  But that is what we need to do.\n\nI like it!",
				"added": 1611513202
			}
		],
		"1610253332_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 4,
				"body": "what about https://urbit.org/understanding-urbit/\nNever tried bud sounds nice..",
				"added": 1610329396
			},
			{
				"comment_id": 12,
				"body": "> [bimmyql](#comment_29_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): this is a complete VM. I guess it wouldn't be compatible with ZeroNet? [...]\n\nLet me know if you give it a try :)",
				"added": 1610490548
			}
		],
		"1610228061_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "Fuuuuuuck lockdowns. Fuuuuuck masks! Never comply! Never waxx, never test.",
				"added": 1610329573
			},
			{
				"comment_id": 6,
				"body": "> [barbados](#comment_1_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg): If people would stop spreading disease, there would be no need for more lockdowns. Get over yourselves\n\nlame.",
				"added": 1610330710
			}
		],
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": [
			{
				"comment_id": 9,
				"body": "Trump is a TITAN. MSM brainwashed fools dislike him without knowing why.. Its about globalist technocracy via \"the great reset\" (that sucks donkeys ass) vs Humanity. But sure.. if you want to live your life in a giga city, genetically altered, no social contacts, social credit scoring, surveilance, no families, children in labs and shit like that. Keep hating Trump and the globalist shitheads will provide it to you.",
				"added": 1610407574
			},
			{
				"comment_id": 11,
				"body": "> [papull](#comment_16_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): Trump will do all of that to you if he somehow gets money out of it because he bankrupted all of his business. Dude scammed innocent supporters for money in the guise of fighting the election fraud campaign.\n\nThere is a shitload of evidence showing this is EXACTLY what the globalists are trying to do to you! There is exactly 0 evidence that this is what Trump wants to do to you. Your feelings towards Trump are yours alone and as far as I am aware are not based on any actual proof.. but solely on MSM lies and disinformation.\n\nLearn about this stuff and you will change your mind. I personally think that your distrust of authority is good and healthy. But the next step has to be to start researching yourself. I was once a Trumphater.. but for some reason I found the overwhelming hate in media strange, so I looked it up myself. To my surprise I found that it's was all lies and fabrications.\n\nThen I started to ask the big question, why? To find out I did a shitload of reading, digging, watching, listening, following up on sources. I must have spent months and months of plowing information like crazy. \n\nEndgame. \nTrump = Hero or just stupid.. He dared to go against the most powerful ppl on earth. Very good for us ordinary peeps and good for humanity if he succeeds. Political correctness, woke agendas and covid + lockdowns will be gone pretty quick.\nGlobalists = Old power structure in fear of losing everything are trying to subdue humanity to save themselves. Expect a depopulation agenda, communist system, government overreach, medical tyranni. Sucks for humanity.",
				"added": 1610478589
			}
		],
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "Bill Gates is pure garbage..",
				"added": 1610477801
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 14,
				"body": "oh you dumb fuck",
				"added": 1612144035
			}
		],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 15,
				"body": "WEF evil",
				"added": 1612145163
			},
			{
				"comment_id": 17,
				"body": "Absolutely not. Thats just a BS package to make that shit sound good. The great reset is something you would NEVER agree to if you were asked. Thats why it's implemented using Covid and economic collapse as an excuse. The reset is the ultimate control society where ppl are fused with technology (fourth industrial revolution, book by Klaus schwab) and monitored. There is an elite and the \"common ppl\". There is no democracy, society is run by the elite and global corps. Fear of disease is used a control tool and most things today point to the elite trying to genetically destroy our immune system so we are dependent on bigpharma. Its a medical tyranny, but worse.\n\nThis is no conspiracy.. thats the scariest part.",
				"added": 1612176430
			},
			{
				"comment_id": 18,
				"body": "> [deuxzaron](#comment_80_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): I need you to post absolute proof\nIts everywhere.You just need to look.",
				"added": 1612271061
			},
			{
				"comment_id": 19,
				"body": "> [zeroflag](#comment_4_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu): Pretty much what everyone ever said if there was no proof.\n\nYou dont have to belive it, but its strange because its kind of obvious... It's in you face. Read it for yourself from the founder of WEF. I really dont want to try and prove anything to you because its very hard to show people that are looking. You need to open your eyes and see yourself. Proof is everywhere. In supressing medication like HCQ and Ivermectin + extreme medical cencorship. The corrupt WHO/CDC and skipping animal trials for experimental vaccine. Fake PCR tests with up to 45 cycles. The fraud in US election. The forcing of closing down business to wreck the economy. The dissapearance of \"normal flu\". The war on 5G tech. China testing the new cryptocurrency and connecting it with a social credit scoring system.\n\nWhen you see it. All of these pieces fit together perfectly. The plot is obvious and very sinister. This will not end well for us if it succeeds :(\n\nhttps://www.goodreads.com/book/show/54498122-covid-19",
				"added": 1612305820
			},
			{
				"comment_id": 27,
				"body": "> [zeroflag](#comment_8_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu): My statement didn't rule out that there is proof. But \"Its everywhere.You just need to look\" is still what everyone ever said if there was no proof. [...]\n\nLol, you seem retarded. You sound like the U.S media claiming there's no evidence of election fraud. Believe whatever you want, I don't give shizzle. The truth is obvious to everyone that wants to know it.",
				"added": 1613091247
			},
			{
				"comment_id": 28,
				"body": "> [deuxzaron](#comment_83_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): I don't feel like looking. I want you to show it to me\n\nI don't feel like showing you. I want you to look.",
				"added": 1613091295
			},
			{
				"comment_id": 31,
				"body": "> [zeroflag](#comment_10_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu): @theborg:I don't ask for hundreds of pieces of evidence and hours of work on your side. Give us just one, give us your best one. If your best one isn't sufficient then hundreds won't be anyways...\n\nMy best one is outside your own window, its called reality.. Sorry that I cant help you more. Here is a nice vid explaining a part of the root cause.\nhttps://www.georgegammon.com/imf-plan-to-replace-bitcoin-gold-dollar-with-digital-sdr-shocking-info-revealed/",
				"added": 1613865236
			}
		],
		"1612173389_1P99tURa4T43muCjSejqPrYHsi9km7g2X6": [
			{
				"comment_id": 16,
				"body": "If you are unvaxed. MMS,  Ivermectin. HCQ zelenko protocol.\nAfter you take the wax, if you do.. your body will have an autoimmunie disorder to coronavirus (all cold viruses are coronaviruses). The next time you meet a coronavirus in the wild, your body will attack itself in an immune response. Pathogenic priming. It will most likely be deadly. No meds will help.",
				"added": 1612175797
			},
			{
				"comment_id": 20,
				"body": "> [dragondant](#comment_7_1P99tURa4T43muCjSejqPrYHsi9km7g2X6): Covid: New lockdowns for England and Scotland ahead of 'hardest weeks'https://www.bbc.com/news/uk-55538937 [...]\n\nits a scam",
				"added": 1612348772
			},
			{
				"comment_id": 22,
				"body": "> [dragondant](#comment_8_1P99tURa4T43muCjSejqPrYHsi9km7g2X6): Well, you do have the right to think it is a scam. But please remember this post, in case one day you find that it is not a scam, you need it.\n\nIts a scam 110%. Not in the sense that Covid doesn't exist. But in the sense that it's a created, manufactured crisis. What it is that's making people sick. I dont know, could be anything.\nBut IT'S A SCAM 110000% There must be no doubt about this. All evidence is staring you right in the face. disconnect from the feat and media lies and you will understand. It's obvious.",
				"added": 1612356726
			}
		],
		"1612217578_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 21,
				"body": "Ask the PoS Klaus \"anal\" Schwab, he has already decided what it should mean to be a human.",
				"added": 1612349146
			}
		],
		"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 23,
				"body": "I dont even think its about sterility even if thats a possibility. I think it's about \"pathogenic priming\". They want to make the common flu deadly to us humans. That way we will be forced to live \"isolated\" form each other, in sterile environments. No social fun. Less babies born, no rebellions, no people coming together. Exactly like described in Klaus \"anal\" Schwabs book. People will live and die in their homes. The little/only social interaction will be virtual. You work remote, date remote, have fun remote.. Everything from a \"smart city\" in order to save the environment and avoid pathogens that will kill you.\n\nIn a sense this scenario is much worse then making people sterile..",
				"added": 1612358285
			},
			{
				"comment_id": 24,
				"body": "> [wotansboy](#comment_4_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW): I still don't get how one can believe that the Covid vaccine will sterilize anyone.Do you even understand the basic concept of RNA and DNA?\n\nOf course it can.. lots of tings can sterilize people.",
				"added": 1612358989
			}
		],
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 25,
				"body": "> [rnb](#comment_21_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E): ugh more of this conspiracy crap\n\nits no conspiracy its the truth",
				"added": 1612371099
			}
		],
		"1612927209_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 26,
				"body": "> [boot13](#comment_15_1PxMvud9KvbqaSZnV4piygA6dFTASwapHY): mRNA vaccines do not interact with recipient DNA. They have the same effect as all other vaccines, which is to trigger a controlled immune response. Please stop posting this fact-free garbage. You have been muted.\n\nThey DO NOT have the same effect as vaccines fool. Educate yourself.",
				"added": 1613090755
			}
		],
		"1613061986_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 29,
				"body": "> [binary1173](#comment_64_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Formatting would help, otherwise  you will get very little response.\n\nLol. 100% agree!",
				"added": 1613091431
			}
		],
		"1613799897_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 30,
				"body": "Yes, please host a new wikipedia!! Delete all political bullshit added after Covid. Scrap and replace the accounts of all left-activist editors. Open a gofundme, i will donate! Looking forward to this.",
				"added": 1613862309
			}
		],
		"1617878152_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 32,
				"body": "fuck these police state tyrant politician motherfuckers.. they can shove their vaccines up their ass",
				"added": 1617889172
			}
		],
		"1628077482_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 33,
				"body": "Man måste vara ett halvt efterblivet vaxtard för att inte se vad som verkligen pågår. Sweden is full of compliant sheep that still believe we are fighting a \"dangerous virus\".... retarded, brainwashed, mass psychosis.",
				"added": 1629756337
			}
		],
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 34,
				"body": "> [xcape2net](#comment_920_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Why can't people see that they need to be vaccinated until they are in the hospital with a tube down their throat and it's too late to be vaccinated?\n\nYou truly are clueless, retarded fuck.. You invite tyranny and social credit scoring. Dumb dumb dumb. Sorry.",
				"added": 1629756841
			},
			{
				"comment_id": 36,
				"body": "> [epistemic](#comment_13_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): What tyranny? What freedoms have you lost? Not movement. Not speech. You can freely travel as long as you wear a mask. That's science not politics.\nYou sir must be retarded or blind AF",
				"added": 1630010658
			}
		],
		"1629748915_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": [
			{
				"comment_id": 35,
				"body": "Hmm if you are going to fake a cyberattack my guess was to stage an attack on the DNS system so no domain-names work. IP numbers would work.. and thats why I though zeronet is a good way to stay connected. But maybe if they shut down EVERYTHING - like the entire grid then even zeronet wont work. But my guess was the DNS..",
				"added": 1629839915
			}
		],
		"1633231545_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 37,
				"body": "Go check your white blood cell count.",
				"added": 1633381194
			}
		]
	},
	"comment_vote": {
		"1245_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"11_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"1_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa": 1,
		"7_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu": 1,
		"71_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"13_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"1_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": 1,
		"3_1KqRW6E7xaTFMVsErAKaN48V6pq3cq8L3z": 1,
		"40_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"29_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"8_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"11_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN": 1,
		"1_1H5Hj9Q9RXFAWXaFvAAMLuQurxUmExxgci": 1,
		"110_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"3_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": 1,
		"2_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": 1,
		"114_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	}
}