{
	"next_comment_id": 8,
	"comment": [
		{
			"comment_id": 1,
			"body": "Currently the site owners can add `\"spammer@zeroid.bit\": false,` to their data/users/content.json files to, for instance, block the user spammer. \n\nBy the little that I know about nofish (by reading his comments and the catchphrase on zeronet.io), I think that he either thinks that blocking a user is censorship (the opposite of what zeronet stands for) or simply expects the spammers to go away. Or maybe a bit of both.",
			"post_id": 3,
			"date_added": 1457224581
		},
		{
			"comment_id": 2,
			"body": "Currently the best way to update a blog's source is by copying it from the folder of [ZeroBlog](http://127.0.0.1:43110/Blog.ZeroNetwork.bit).\n\nThe process is as follows:\n\nBackup your site's folder (just in case something happens), overwrite everything except content.json and the data folder with the new files from the data/1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8 directory. Sign and publish. That's it.",
			"post_id": 4,
			"date_added": 1457267797
		},
		{
			"comment_id": 3,
			"body": "> [ks](#comment_13_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): In that case, such a license should make it clear if there are different terms for the site code and the site contents.\n\nI think it's an overkill, but now I have a license for the [source code](http://127.0.0.1:43110/1QLLPpowM6BWxKYKops1WkCafuFPhFBnAx/LICENSE.txt), the [content](http://127.0.0.1:43110/1QLLPpowM6BWxKYKops1WkCafuFPhFBnAx/data/license.txt) and the content in a [\"human-readable\"](http://127.0.0.1:43110/1QLLPpowM6BWxKYKops1WkCafuFPhFBnAx/data/license-human.txt) format.",
			"post_id": 37,
			"date_added": 1458669983
		},
		{
			"comment_id": 4,
			"body": "My [blog](http://127.0.0.1:43110/1QLLPpowM6BWxKYKops1WkCafuFPhFBnAx/?Post:7:ZeroVerse+support) now accepts ZeroVerse.",
			"post_id": 15,
			"date_added": 1459012635
		},
		{
			"comment_id": 5,
			"body": "For anyone running linux, here's a quick script to show your *myhash* (aka your auth_address):\n\n```bash\n#!/bin/bash\ngrep -sA1 \"\\\"zeroid.bit\\\"\\:\" /path/to/zeronet/data/users.json\ngrep -sA1 \"\\\"zeroverse.bit\\\"\\:\" /path/to/zeronet/data/users.json\n```\n\nPlease do **not** delete *all* folders, that's completely unnecessary. If you can't get the site admin to increase your limit, delete only your folder. Or just data.json. Or even better, just some comments/posts. Don't forget to sign and publish!",
			"post_id": 24,
			"date_added": 1459658874
		},
		{
			"comment_id": 6,
			"body": "@ekaterina added a great thing to their sites that shows how much space we have left (just like we have when creating/editing comments). Would be useful to add that to your chat, @erkan.",
			"post_id": 24,
			"date_added": 1459659173
		},
		{
			"comment_id": 7,
			"body": "> [villoldo](#comment_7_16nZf7G4qaYRtFpHM9MM1A32nV5oqU9TW1): Please forgive my total ignorance, but why do we need id providers in the first place? Each node already has a kind of identity. Why can't we generate a public token/key from our secret key we use to sign our sites?\n\nThe ID is the username. ZeroID and ZeroVerse exist to make sure all usernames are unique. ZeroVerse forces the user to register using Bitmessage, while ZeroID makes that an option.\n\nIf we used a public key for our username, then it wouldn't be human-readable. If everyone created their own usernames then duplicates would be possible.\n\nThe issue with having many ID providers is that each provider is independent, so users could register on system B with the username from someone on system A. Also you are forced to trust the providers.\n\nBesides some sort of Blockchain solution I can't see a better way yet.",
			"post_id": 70,
			"date_added": 1461858837
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"13": 1,
		"24": 1,
		"47": 1,
		"50": 1,
		"53": 1,
		"69": 1
	}
}