{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1568146233,
			"title": "Proper introductions in haking.",
			"body": "Ok let's get into it.\n\nI am hacking since early 2000's.\n\nSince I get some notorious, or not, public CVEs (1 information); but get a normal job payed. I reported to famous companies but the job is still payed the same whereas it is worth many millions sometimes. Sometimes related to chips architectures; kernel modules; etc. I will not get into my motivations but I am very sick; I will die in pain (2 informations) - the money is not for me or I would have already killed myself already (set-up the context).\n\nI want to get into serious business; like selling my exploit (RCE of course) or give some advices to others (consulting). And because zerodium is what it is; I do not want them to make business of my work with multiples pairs (and cheap; while selling them to shitty governments like NATO of with paper money). Plus I am a member of many CERT/CSIRT worldwide (anonymously speaking; normally) I can see my attack signatures IRL (Made my rules) so I detect them in seconds globally (another information; I am on a global firm). Those are real one shot exploit weapons I will not report to the vendors. I will be detected saying that but dead before (3 another information).\n\nThere is more and more fast learning platforms like hackthebox where people are happy to find a solution and masturbate instead of getting laid (It is a CTF platform there is always a security hole; and always proofs to make it visible... Don't call it 'haking'). And my, call them 'private exploits'. But they would be discovered sometimes by some young talented; more than me. or lucky. Facts is there is always someone smarter.\n\nWhat I am asking for is where (Neutral with modern technologies; /Thailand?/North Korea?); When and How to get proper money (Laundered) and make a transfer.\nOtherwise I can still use a leak of an IBM Z-14 I got control into; it is like millions/sec banking operations. Connected to shitty SWIFT anyone real hacker already played with it. But there is procedures so I cannot redirect all the flow (or parts like cents) to one banking account. Need to be fully anonymous.\n\nSo who I contact; first; send my PoC; and get a serious talk ?? Is there someone serious enough to start a conversation ?\n\nLet my watchdogs full disclose while no responses under n days ? Roll up. The bets are in the lines.",
			"added": 1568146232
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1568146233_1GPkUgE87GmWs35PmsUKA9CUFW8L8SMTX5": [
			{
				"comment_id": 1,
				"body": "White turning black; nothing more. Please respect my life.",
				"added": 1568147500
			},
			{
				"comment_id": 2,
				"body": "From mind some people may want more proof;\nI do not like Posix.\n\nfor:; do (cat $ips.txt) do ; smoke cigars; done | xxd > /tmp/ex/$random \nÇa va les conneries ?",
				"added": 1568147796
			},
			{
				"comment_id": 3,
				"body": "> [spedidien](#comment_2_1GPkUgE87GmWs35PmsUKA9CUFW8L8SMTX5): From mind some people may want more proof;I do not like Posix. [...]\n\nYep Spoke French but they knew before as I am speaking. Intel... Let set any bets on the same level.",
				"added": 1568147884
			},
			{
				"comment_id": 4,
				"body": "Hmm may be fun; look at swift transferts; make a map with g3.js :P",
				"added": 1568148320
			},
			{
				"comment_id": 5,
				"body": "Boring...",
				"added": 1568148411
			},
			{
				"comment_id": 6,
				"body": "+j3.js",
				"added": 1568148464
			},
			{
				"comment_id": 7,
				"body": "Bon bah bonne mort. Le danger oui; le risque non.",
				"added": 1568148807
			},
			{
				"comment_id": 8,
				"body": "D'ou le baton de Garonne; ce qui a donné le garçonnet.\nIl a opéré car évalué le risque et le danger.\nMaintenant c'est devenu un fluide. Mais ça c'est les acides et les bases. Ne jamais mélanger le noir et le blanc. Heur je ce",
				"added": 1568158851
			},
			{
				"comment_id": 9,
				"body": "Bon chance.",
				"added": 1568158903
			},
			{
				"comment_id": 10,
				"body": "Missery non abrutis - https://archive.org/details/MoonmanNotoriousKKKHD \nLe zeronet tu te connecte avec un VPN ou TOR\nC'est un procole pair à pair tu partage du porno infantile comme la guerre au kosssovo.\nGestion du risque.",
				"added": 1568160097
			}
		]
	},
	"comment_vote": {}
}