{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1591276514,
			"title": "Why the U.S. rich are not afraid to loose their wealth?",
			"body": "A Russian oligarch knows that whatever he/she owns, can be robbed from him by the Czar any time the Czar wants. The oligarchs may stash some of the fortunes to the West, but if the West does not rob it from the oligarch by \"freezing assets\", then the Czar can just tell, \"Your money or Your life!\", no matter, where You live. Pretty much the same seems to apply to the North-Korean communist party elite, the \"rich\" there, and the Beijing China business elite. Issues with the Chinese Communist Party (CCP) and the assets stashed to the West is all that is left, provided that the entrepreneur is live enough and free enough to use the stashed fortune. That is to say, the Government, even that of the North-Korea, does have to answer to the majority of the local elite. Even the North-Korean dictator has to have sufficient amount of supporters at the top of his party to kill any single one of the party members, as does the Syrian dictator Assad, as did the Iraqi Saddam Hussein, as did even the Stalin, but if the king/dictator threatens the well-being of the majority of the elite that it depends on for running the dictatorship/kingdom, which can include generals, top clergy, in some cases even some loyal academics, then it's a coup d'état, which can happen in various ways, including with the help of a foreign military.\n\nInterestingly the U.S. billionaires are not worried about loosing their wealth in a situation, where the Trump administration is totally out of control of the business elite. The Trump impeachment failed due to the protection by the Republican Party elite. Trump will likely win the 2020 elections, because the Democrats have a worn out establishment candidate, the \"white colored\" Joe Biden, who wants to point some policewomen or a prosecutor as his vice president at the midst of a wave of protests, where the main topic is Police Brutality towards the \"black\" and other \"non-white\" people. As it turns out, the Trump can really do anything he wants, including tear-gas away totally peaceful protesters just to walk to a propaganda-photo-shoot:\nhttps://www.youtube.com/watch?v=YlR0B9KU3Uw&list=PLiZxWe0ejyv_3Osl8CLLc1M2N5CBSZFb-\n\nThe issue here is not so much the Trump, but the fact that the same scheme would work with anybody in the White House, just like it is kind of irrelevant, who is the person, who holds the title of the North-Korean dictator. It's the system that matters and the dictators and the elite that helps the dictator to run the \"country\" can nudge the system to the direction that they please. Not all the way, but a little bit, step by step. For example, part of the reason, why the Saudi-Arabia does not modernize fast enough is that the Saudi-Arabian dictator, the Sultan, relies on the Islamic Mullah as the clergy that runs the \"country\" and the Sultan can not just toss them aside. The Sultan can only try to replace individual Mullahs as long as the rest of the Mullah do not object at their private thoughts, but replacing them all at once is quite hard. \n\nEvolution is tough. In group evolution only the strongest groups survive. The more military strength and economic strength depends on smart people, the bigger the advantage of a dictatorship that can attract/tolerate the smartest people at its elite. Smart people do not need to be kind-hearted people, but they do need to be able to adhere to the rules of sharks: the moment sharks smell the blood of a shark, they disband, escape the scene. That's why the Nazi rocket engineer\nhttps://en.wikipedia.org/wiki/Wernher_von_Braun\nescaped the Nazis at the fall of the Nazi empire and that's also why he chose to escape to the U.S., not to the Russian side. The Jew Albert Einstein had even a better \"nose\" and he escaped to the U.S. before the Nazi killing machine properly started. The question with the U.S. Government, not just Trump, is, who really runs the mega-corporation, \"country\", for this dictatorship committee, Washington establishment? \n\nIf the under-paid working poor do not toil for the salary that does not really allow them tho make the ends meet, then how do the U.S. mega-corporations hope to earn anything other than super-inflated dollars that loose their value as they are being emitted/\"printed\"? Creating colonies and being a parasite might work, but the Africa was already exploited to the maximum extent possible and the Beijing China is moving out of a de facto U.S. colony status: no more cheap labor from China. May be Mexico? Latin-America? Those regions have also been already exploited nearly to their limits, specially in the form of second-class \"citizens\", the \"undocumented immigrants\", who lack the elemental work related dispute possibilities that the \"documented\" Americans have. The drug-addicted or otherwise lazy \"black communities\" aren't the salary-slaves that \"Make America Great Again!\" \n\nSelling to China and Europe seems to be the main options for the U.S. elites to stay rich and the Google and Facebook revenues do seem to support that scheme, although the Microsoft's main market still seems to be U.S. corporations, as it has always been with the Microsoft. The Climate Change neglecting U.S. car industry, apart from Tesla, is not competitive in Europe. The Beijing China might not care about the Climate Change, but its leadership sure cares about clean air, which the fossil fuel based cars do not help to keep clean, not to mention that the Beijing China hates to depend on imported oil, as it reduces its autonomy. Once upon a time the Boeing planes were one of the biggest exports of the U.S., but with the safety problems that the modern Boeing company has with its planes, the Boeing planes are not competitive any more. The major airlines buy the French Airbus, specially the gigantic Airbus 380, which directly competes with the Boeing 747. Once upon a time the U.S. CPU manufacturers, the Intel and the AMD, were the best in the world, but with the Intel Management Engine back doors\nhttps://www.cs.vu.nl/~ast/intel/\nand the increased use of the British ARM CPU-s at servers the U.S. CPU industry is also declining, with the exception of the open hardware RISC-V. \nhttps://riscv.org/\nThe Edward Snowden Revelations weren't a helpful \"marketing campaign\" for any of the U.S. CPU manufacturers, specially if the official demand of the Washington regime is that private companies must stay quiet about receiving NSA demands for back doors or client data.\n\nThe main U.S. export good group that still is absolutely top of the line is the sex toys, but even those tend to get manufactured in China. They're only designed in the U.S.  The sex industry, PornHub and alike, and the Hollywood will likely continue to be a U.S. monopoly, because that's a matter of culture, but with the rise of various Christian/Conservative sects in the U.S. even those industries might go down the tubes like the Boeing company has gone. Those tubes won't be PornTubes, but rather something shitty, specially with the loss of the Net Neutrality principle and the possibility that megachurches can buy up major U.S. internet service providers or finance the Republican Party.\n\nWhen the U.S. becomes a religious, uneducated (people can't afford university level education or their religious parents won't let them attend atheistic universities), sick (the U.S. health care system) dump, the U.S. elite will live a lot like the North-Korean elite: wealthy in their own society, but quite poor if compared to other, free-er, societies. A sign of the U.S. scientific decline is that the Russians, the Chinese, the Japanese, the Europeans have their own particle accelerators still operational, but the Fermi Lab accelerator was shut down without having a replacement U.S. accelerator available, so the U.S. nuclear scientists try to do their work in Europe, at CERN.\nhttps://home.cern/\n\nThe Elon Musk may live in his rich man's bubble for a while, but the build quality of the Tesla cars is lower than that of Japanese electric cars, the price of the Tesla cars is outrageous and his SpaceX gets majority of its money from Washington, being NASA 2.0, which will be in financial trouble the moment the Washington regime collapses, just like the Soviet space programs were in trouble after the Soviet Union officially ceased to exist. It took a while, till the successor of the Soviet Union, the Russia, was able to properly finance its space programs again.\n\nOn top of all of that mess there is the U.S. patent system. The open source movement and open hardware movement (the CPUs) have demonstrated that huge investments will be made even without using the patent system for financing the development work. The COVID19 vaccines are being frantically   developed globally without hoping to earn the development related expenses back trough any patent system, and yet, the U.S. corporations prefer to waste their money and time on patents and patent lawyers, giving the Russia and the China a clear advantage at their development programs. The Conservatives, who claim to respect private property, do not seem to understand that IDEAS ARE NOT PROPERTY and in stead of adopting new business models that allow fast reuse of ideas at product development and business, the \"conservatives\" want to limit the practical application of ideas by \"protecting property\", \"protecting\" \"intellectual property\". Islamic religion is what is keeping the Arab regions from development and it is the Christian religion that is keeping the U.S. from taking advantage of the open source movement and other open knowledge reuse schemes. \n\nThe U.S. \"0.1%\" is at sleep like the German \"0.1%\" was at the rise of the Nazi party, ultimately loosing both, their lives and their wealth, like the rich German Jews did? If so, why?\n\nThank You for reading, thinking, answering.",
			"added": 1591276513
		}
	],
	"topic_vote": {},
	"next_comment_id": 22,
	"comment": {
		"1590689346_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 1,
				"body": "Copy of the referenced article without the nonsense nag-screen:\nhttps://archive.is/3kB4R\n\nThe core of the matter from practical point of view is political censorship. I wonder, how will that go down with the Republican voters at next presidential elections? May be the Trump expects to loose anyway. \n\nFrom election campaign point of view those kind of moves aren't even the Trump's worst moves. The worst is that he has alienated the math-brains, rational thinking. If it weren't for the math-biased brains of the Robert Mercer and his daughter as the soft glue between the reality show star Trump and the rational-math-brains Robert Mercer, the Cambridge Analytica scenario would have never happened, but it was exactly that kind of cold thinking that gave the Trump the victory. His campaign was failing before the Mercer joined and it was certainly not just a matter of money. May be I'm mistaken, but it seems to me that as of 2020_05 the Trump totally lacks analytical support staff or at least nobody really talented wants to join his team, unless the Moscow Kremlin is willing to put a few math institutes behind the Trump's campaign. With the arrest and general mental degradation of the Julien Assange the WikiLeaks is also out of action, so no help for Trump from that front.",
				"added": 1590726126
			},
			{
				"comment_id": 2,
				"body": "> [zaron](#comment_105_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): what are good decentralized alternatives?\n\nSo after seeing, how the Hong-Kong fell, \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1590565377_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X/If+the+China+law+runs+in+Hong+Kong+we+still+have+zeronet+right\nwe now have to start thinking, how not to fall ourselves at The West. What an irony.  Well, we're talking on ZeroNet right now and there's the \nhttps://fediverse.party/\nhttps://en.wikipedia.org/wiki/Fediverse\nbut as far as I can tell, the implementations of all of those P2P-versions of \"social apps\" have a horrible implementation. The authors of those apps clearly think only about social interaction and are HORRIBLE at software architecture. Forget about security at those. Security is a luxury with that pile of crap-ware. However, the Fediverse has one architecturally very nice feature: they use common protocols, meaning, if one crap-ware falls out of action, people can start using something else and still enjoy the network effect. My suggestion is that You do not use any \"social app\", because the core functionality of a \"social app\" is to allow the people to live in their psychological bubble and get superficial, FAKE, feedback from other people about how great and nice and awesome they are. For more meaningful exchange of ideas the various blogs, including ZeroNet blogs, are far better, provided that they incorporate an RSS/Atom-feed that can be read with some RSS-feedreader like the\nhttps://quiterss.org/\nThe beauty of the RSS-feedreader based solution is that there is no central authority that can be coerced and the only way to censor an RSS-feedreader+blog based exchange of ideas is to start using some Western version of The \"Great\" FireWall of China. A philosophically interesting question is, if Facebook can be coerced with the excuse of censorship, then from \"legal\" point of view any blogger can be coerced with the excuse of censorship and how that changes the game in the situation, where a lot of people prefer the freedom to smoke weed to the freedom to speak publicly what is on their mind? Or is the next form of censorship in a form of more potent \"recreational\" drugs so that anybody, who is high, is so high that they are physically not capable of expressing any thoughts in any form? Slightly high or drunk people might accidentally still write/tell \"politically inappropriate\" statements.\n\nOh well, if things go really bad, then the game theoretical solution is to make the censorship imposing party to hurt itself with its own censorship. In the case of Trump, the Facebook might hit back by totally muting him by using the very same reasoning that the Trump used at his executive order: Facebook must avoid being biased and therefore has to give equal amount of public attention to all presidential candidates and by muting Trump or letting only 1% of his tweets through the Facebook is balancing the extra attention that a sitting president gets, making sure that all presidential candidates get an equal amount of attention. That argument might even hold in the Supreme Court. For example, in some European countries there is a rule that all media organizations must deliver equal amount of minutes/newspaper-characters to all political candidates, regardless of which of them is in the office. The Facebook legal team might look at Europe for precedents. If that's the game that the Trump wants to play, then, well, his on!\nBut, hey, the Trump lacks a proper analysis team this time, so he probably wants to play a game that he will likely loose :-D",
				"added": 1590727148
			},
			{
				"comment_id": 3,
				"body": "> [scotcyguy2](#comment_33_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): But it's too late, I think we should be looking for decentralised alternatives, if we've learned anything from recent times no one should have this power.\n\nSoftware developers of decentralized systems still have that power if people use auto-updates or lightheartedly click on the \"OK-to-update\" buttons. If software developers have that power, then that power can be forcingly taken from them by taking their keys by breaking into their computers. The Edward Snowden revealed that the NSA was after sysadmins. A  sysadmin only controls the computers at the LAN that the sysadmin administers, but a software developer's creations are executed at multiple LANs and the prize for any NoSuchAgency for breaking into a software developer's computer is far greater than the prize of breaking into a sysadmin's computer.\n\nOne countermeasure to that is to design communication protocols really carefully, test things out properly before publishing and design the software without any auto-update-features. The auto-update feature is a kind of new form of Microsoft Word macros. Obviously corporate business software, which is centralized and \"adheres to the law\" anyway, does not need such security measures, so they develop their \"cloud software\". The appealing thing about \"cloud software\" is the possibility to centrally upgrade it to all of its users, all of the corporate employees and clients of the corporation, specially if the software is some sort of self-service portal or e-shop. In another words, different use cases have different requirements and corporate business software or \"enterprise software\", as was the hype expression during the Java hay-days, does not have the requirement of enforcing freedom of speech and anonymity, so they can optimize by taking advantage of the fact that they do not have those requirements.",
				"added": 1590776667
			},
			{
				"comment_id": 4,
				"body": "> [zeroseed2](#comment_1_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz): but in that way the elitè can't control masses!\n> Because of this we need better schools and decentralized networks like zeronet!\n\nThe dumb masses, who do not care to make an effort to use anything other than the Facebook and Twitter DO NOT DESERVE to be free. Facebook is like a local bar: important for politicians for emotion based superficial votes, but hardly the place for news and scientific knowledge, unless one tries to measure the average level of drunkenness and the levels of announced nonsense.",
				"added": 1590785261
			}
		],
		"1590567168_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 5,
				"body": "> [anonymouslogin](#comment_202_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): On zeronet, (practically) you need to submit the new zite to some popular list (e.g. zerosites, 0list, e.t.c) and wait for some peers.\n> This is a problem if the zite creator doesn't have a public IP, which is a quite common issue in the home network.\n\nThere is the \nhttp://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/\nand a cron job with link extraction and plain wget might solve that for the ZeroNet.",
				"added": 1590785783
			}
		],
		"1590754398_1AwpDP3xGB2DobysL16pxxBJJPWPTk5mXC": [
			{
				"comment_id": 6,
				"body": "Thank You for the nice reference. At first glance it's main issue seems to be that besides the classical wireless mesh network flaws that they all have (susceptibility to jamming, low operating radius of nodes, lack of anonymity of the node owner, etc.) a serious flaw of that project is that it is just yet another \"lets-be-social-and-lets-do-something-fun-together\" project, not a properly modular, generic, data transmission infrastructure project. A lot of emphasis seems to be on project specific mobile apps in stead of making the low volume traffic available to other applications. The fact that the disaster.radio project seems to be backed by some lobbying organizations in stead of being genuinely technical project like the ZeroNet and the Beaker are, might also explain, why in stead of focusing on good technical delivery the focus is on \"blinking lights\", the disaster.radio project specific mobile apps.\n\nThey might as well just replace their whole project with solar powered cellphone chargers and some other wireless mesh network project like the \nhttp://servalproject.org/\nNo need for any specialized mass production, just buy existing old cellphones on the cheap and be green, install Serval, hook them up to some sufficiently powerful solar powered charger, \"invent\" some nice plastic bag around the cellphone and the node is complete. No specialized production needed at all and the old cellphones do not need to be scrapped either. Everything is very \"green\". The disaster.radio project clearly lacks technical vision. Just a fun project for the people, who work on it and some lobby group can have something to talk about to get more grant money. May be grant applications was the main purpose of the whole disaster.radio project? It does not hurt to have it around, but it does not offer anything technically new that hasn't been done already. A project for grants, not a project for technical advancements.",
				"added": 1590787413
			},
			{
				"comment_id": 7,
				"body": "> [xcape2net](#comment_743_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Cool, but I didn't see any performance information. What is the maximum distance between nodes? What is the power requirement? I know it's solar powered, but how many watts of power does it use?\n\nYou won't find it, because it seems to be a social project for writing grant applications, not a proper technical project that aims to optimize something or offer something technically new. If it were a proper technical project, then their emphasis were on universal data transmission, not on yet-another-set-of-social-mobile-apps. Their engineers there seem to enjoy fiddling with things, but their \"management\" is clearly non-technical, so don't expect much from that project, although they might save their project and make it technically awesome. Whether they do it, remains to be seen.",
				"added": 1590787815
			}
		],
		"1591279274_1B6Dst2LKNmG3yPZXnXc73c3qgiJzmLVNW": [
			{
				"comment_id": 8,
				"body": "I also like to have money. Just give Your money to me. Why should I worry about serving my clients or working as an employee, when I can just ask for money here. I can also be totally \"nonprofit\" when I work on things that I self find interesting and fun. As long as people (or robots, I do not care, who pays, as long as it is not me) keep on paying me, I can be non-profit till I am alive! Ain't life fun! \n\nI am far more competitive than the opening post author, because unlike the opening post author's list of hype-words, You can write my money-request's hype-word list Yourself, so that it is guaranteed to match exactly what You like :-D\n\nI forgot to add the \"I approve this (scamming) message\" compulsory line: \n\"I am not a scammer, who takes money without delivering work, even, if You never see my work and can never verify that I am even capable of writing anything better than a Nigerian-letter and script-kiddie shit-pile code. Why should I spend my time on stealing credit card numbers, if I can just ask people to willingly and legally pay me?\"\n\nOh, and the \"cool team name\", well, You can figure out, what is the coolest alias and fill in the blanks, so that my alias is cooler than the opening post's \"Cipher Dogs\" name is. Lucky for me, the \"Cipher Dogs\" have found themselves to be too cool to set up their home page, so that their \nhttps://www.cipherdogs.net/\nsays at the TorBrowser: \"We can’t connect to the server at www.cipherdogs.net.\" You know, the classics:\n\n\"Right Said Fred - I'm Too Sexy\"\nhttps://www.youtube.com/watch?v=P5mtclwloEQ\n\n",
				"added": 1591286802
			}
		],
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_1050_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It can be comforting to \"know\" that the future is not in your realm of influence and never will be. \n\nEven simulations can have a random number generator in use. Human behaviour might be partly random, like the behaviour of agents at agent oriented programming. On the other hand, it is relatively easy to figure out, whether one lives in a Matrix or not. Math holds regardless of what kind of fundamental physics laws, axioms in math sense, are used. If the human thinking is algorithmically more complex, requires more CPU-power, than the human brain cells jointly are able to deliver, then some of that thinking must be made somewhere outside of the human brain. That outside computational resource is the computer that executes the Matrix, the simulation. A counter-argument might be that may be some of the human thinking is done by using quantum computing and we are too stupid to know that our brains actually do some of the computations like that, but for that counter-argument to be true there must be actual, properly working, quantum computers available and as of 2020 the physicists have not been able to deliver any actual quantum computers, despite the lies and hype of the\nhttps://www.dwavesys.com/quantum-computing\nWhat the D-Wave fraudsters are selling is just a fancy old-school analog computer, which can be helpful in many cases, but probably not worth the price that they are asking for their product. \n\nThe word \"analog\" in the \"analog computer\" comes from the idea that the computer contains some physical process that has mathematical properties similar to the problem being calculated and then the physical process at the box called analog computer is being measured and the measurement result is the approximate calculation result. A simple example of addition: pour one scaled down variable worth of water to a measuring glass and then pour another scaled down variable worth of water on  top of it and after that the value of the water-level in the measuring glass gives the approximate value of the sum of the scaled down variables.  In stead of messing with water the analog processes can be electrical. Hence the historic name of an electronic circuit: operational amplifier, \"opamp\" for short. Some old planes had mechanical analog calculators where the input parameters were the various air properties (pressure, temperature) and cargo weight. The cargo could be bombs. A mixed version is a table with values, like the books with values of logarithms. The \"Babbage  Differential Engine\"\nhttps://www.youtube.com/watch?v=BlbQsKpq3Ak\nwas specifically designed for printing those books to avoid human errors. The Soviet Union space program used mostly analog computers as the control computers of their rockets, until they got the Buran space shuttle, a U.S. space shuttle Soviet clone, to run on logic circuits. The Buran was revolutionary in a sense that it was able to take off and land totally autonomously, something that none of the U.S. spacecraft was able to do and something that even the 2003 Iraq War era U.S. drones were still not able to do.\n",
				"added": 1591353827
			},
			{
				"comment_id": 10,
				"body": "> [randomshits](#comment_131_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): I wouldn't be surprised if when we die we wake up from a helmet and are immediately asked, \"Now do you understand the reasons we have abolished and now forbid the ideals and practices of capitalism?\"\n> If they waker answers Yes, they are allowed into their new society of community bonds while those who answer 'No' are sent right back into the \"End Days of Earth\" simulation to continuously experience mankinds' destruction due to their own greed and tribal mentality.\n\nWhen was the last time You worked for Your neighbour without getting paid even a plate full of good food? Was it just a few hours or did You do it like that for weeks? How do You like the Chinese and Cuban censorship and if the Chinese and Cuban censorships are OK for You, then what a hell are You doing here, on ZeroNet? Have You ever thought, why the Chinese and the Cubans bother to censor anything at all? They could use all that money spent on the Great FireWall of China for education, helping the poor, building housing for the poor, etc. Have You ever thought that the abusive crap-italism that is prevalent in the U.S. corporate world is very different from the capitalism of small farmers, who want a honest pay for their products? Do you think that the Government should be paying to your hair-dresser and decide, what kind of a hair-cut is cost-wise appropriate for You to have? You know, why to mess with scissors, if a robot can do a standardized haircut with a trimmer that is mounted to the opening of a vacuum cleaner hose. You think that it is fair that the communist party leadership is living much more lavishly than the \"average comrade\"? Have you ever tried to live like the average citizen of the North-Korea? Vietnam? If not, then, well, You dirty capitalist!\n\nI really liked the waking up from the helmet after dying idea of Yours. That's part of the spoiler for a really good 1999  movie titled \"The Thirteenth Floor\".\nhttps://www.imdb.com/title/tt0139809/\nBefore watching that movie, please listen carefully the words of one of the title songs of that movie:\n\"The Cardigans - Erase / Rewind\"\nhttps://www.youtube.com/watch?v=6WOYnv59Bi8\nThe reason, why You should watch that music video before watching the movie is that the meaning of the words of that song are totally different after watching the movie.",
				"added": 1591356201
			},
			{
				"comment_id": 14,
				"body": "> [xcape2net](#comment_752_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The US military used analog computers until something like the 1970's. Decades ago, I flew a T-38 flight simulator that used an analog computer. \n\nSo it turns out to be true that the U.S. Air Force is the branch of Pentagon, where the brainy part of the U.S. militarists go or at least used to go in the past. One has to be pretty bright to look up experimental solutions like the ZeroNet at an age 60+ I mean, welcome, I love Your approach :-D",
				"added": 1591547333
			},
			{
				"comment_id": 15,
				"body": "> [ransbits](#comment_62_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): Every day. Even this morning, did you? Why the wife and I just came back from lunch and gave a local African American lawn keeper a free ride to his destination. I know it's hard to conceive the reasoning behind it but I help my neighbors quite often without payment.\n\nYour example does not count, because You did not make a dedicated ride that takes most of Your day (think of day-work) for helping him. Also one might ask, why only Your neighbors, why not people from another town that You never met and probably never will after You have delivered Your services? I suspect that You actually GAIN something in return from Your neighbors, like peasant relations. It's like, shall I mow my lawn and plant flowers today or do I do other \"gardening work\" like improve my relations with people around me by helping them. That's already a GAIN. You probably won't help a bastard neighbor. Even donating money to others is not really a donation, but an action, where a person is BUYING something, buying the pleasant feeling of making the world a better place. \n\nI do not quite believe that the parents of serial murderers have love without condition towards the serial murderers. Not even their mothers, unless the parents are somehow involved in the murders or have heavy dementia.",
				"added": 1591547889
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 11,
				"body": "Could You please seed\n\n\"The Bell Curve, Intelligence and Class Structure in American Life, 1994\"\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1MoiNscMBZopwz1HdWDky1kXHAb4GrTruH_item_1+type:book\n\nThe fact that the police brutality in the U.S. has not been limited like it has been in Europe has to do with the inability of Americans to get things done. The Americans just lack the skills or the intelligence or both to fix the problem. The fundamental business model of a supermafia, generally called a State, is to exploit the tax subjects, generally called  citizens. There is no being nice to the cattle, but at some point the cattle can enforce itself, as was the case at the decades long chain of events called \"The French Revolution\".\n\nNothing got learned from the French Revolution, because the evolution wasn't brutal enough. The Nazis ended up in rubble and the French themselves used torture in its colony in ~1955\nhttps://en.wikipedia.org/wiki/Torture_during_the_Algerian_War_of_Independence\nEven the Swedes intentionally and knowingly contributed to the 2003 Iraq War era torture.\nhttps://www.hrw.org/news/2006/11/09/sweden-violated-torture-ban-cia-rendition\nThe only change will be brutal evolution, where the apes end up in zoos, behind bars, or at cages at pharmaceutical or other medical technology trials, and the smart ones will be the tourists and the experimenting biologists. Then there will be \"human rights\", for the smarter version of the homo sapiens, not the apes in the cages. The \"Black Lives Matter\" and other police brutality issues have the same structure: the blacks \"de facto\" do not have the \"human rights\", because they are too dumb to enforce themselves. Part of the reason for that is the flawed education system of the U.S. and that's \nwhere the book that I ask You to mirror comes to play. \n\nI emphasize the word \"dumb\", because the black gangs are capable of being violent, except that in stead of assassinating the white police officers that terrorize their neighborhoods, the black gangs shoot each other. This comparison is brutal, yes, but from practical point of view, would a white police officers think twice before shooting yet another unarmed black youngster, if the white police officer knew that after that murder they themselves might get assassinated by a well organized gang that is able to get away with the assassination without getting caught? I do point out that the Martin Luther King was a very educated person and he succeeded very well, despite his assassination, but  freedom fighters must accept the occupational hazards from the very start anyway. The uneducated black gang members just can't get things done, because they are too DUMB.",
				"added": 1591534646
			}
		],
		"1591276514_1MoiNscMBZopwz1HdWDky1kXHAb4GrTruH": [
			{
				"comment_id": 12,
				"body": "> [ransbits](#comment_59_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): Most American figures of wealth not only carry dual citizenship, but they also have houses in multiple countries. \n\nIt probably would have not helped during the 2. World War (WW2) era, because the whole Europe was a dump and the Spain and Sweden and Switzerland were \"neutral\", extraditing anybody, who is interesting enough to the militarily strong supermafias. Stashing some of the wealth away to some Latin-American country or China or Japan would not have helped either. The issue is that there aren't that many places to escape to that are decent during a world wide conflict like the WW2, WW3. As of 2020 there are basically the following blocks of countries: The West (U.S., Europe, Canada, Australia, Japan, South-Korea, some smaller U.S. allies like the New Zealand), Beijing China, Russia and its allies (Syria, Cuba, Kazakhstan, Belarus), Iran and its allies or cultural sphere of influence (Afghanistan, Aaudi Arabia, etc.), Latin-American countries, \"African Union\" (the black Africa, not the Arabs at Egypt), India. The rest is kind of irrelevant or somewhere in between or very remotely related to any of the big blocks like the Ukraine is kind of in between Europe and Russia, the Turkey is in between Europe, Iran and Russia, the Egypt is in between The West and the Arab region and Russia, etc. \n\nIf The West goes to WW3 with Beijing China, then Russia will probably side with Beijing China, Turkey will probably side with The West. The only extra citizenship's that might be useful are those of Africa, which is a dump, Latin-America, which is a dump, India, which is full of shit and trash and horrible corruption. That is to say, unless the rich can hide themselves at some rural Canadian area or Iceland or some Latin-American dry desert, where there are no locals, there is really no place to go on this planet Earth. I guess the Latin-American dry desert, somewhere, where the European observatory that was used at one of the James Bond movies, resides, might do, provided that the rich have planes for howling in the food. The distance protects the place from the local Latin-American gangs and small crooks and shootings, but who would be the fool to work as a servant at that place of nowhere? Probably the families of the servants would also need to be hosted and that would make the place already a small village, which requires even more food, private teachers, who also need food and have families. Such a village might start to catch the attention of locals, including robbers, gangs. A hide-away at a desert with pre-stored food and alike may work a few years, but not for decades. Wars last longer than just a few years, specially between really huge participants like the Beijing China and The West. \n\nMy point is that the rich have to become some fancy farmers, take over some other country or they do not have anywhere to escape. \nhttps://en.wikipedia.org/wiki/The_World_Is_Not_Enough\nhttps://www.youtube.com/watch?v=LzvNDR5OrqM\n\nEscaping works only with relatively small wars like the 2003 Iraq War and the war between Ukraine and Russia, the war at Libya, the Korean war, the Vietanam war, not wars like the WW2 and WW3. The moment the USA has a new civil war, Russia will invade part of the European Union, because there aren't any American troops fighting Russia and American economic sanctions towards Russia will stop working because import-export between USA and the rest of the world is low and the European banks will lift their sanctions from Russia, because if the U.S. economy is horribly low, then the European banks do not benefit from the U.S. banking system any more and therefore do not depend on the U.S. banking system that much.",
				"added": 1591542869
			}
		],
		"1591530136_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 13,
				"body": "And what would that bridge/proxy mediate? Doable for a ZeroNet forum thread or may be a set of threads, but ZeroNet is not just the forum zites. You may try to use the Telegram.org bot API. One form of it is that the telegram.org bot system calls a PHP-page, which serves the text that must be posted and that text originates from some zite, a blog, a ZeroNet forum. The same scheme would work in reverse, but what's the point? The end users, who do not care for the benefits that the ZeroNet offers, are kind of lame anyway, so why to lure them to use the ZeroNet? Useless activity and a waste of time. If they like, what the ZeroNet has to offer, then they can install themselves the ZeroNet. As it turns out, it works even on Windows10 Linux layer.\n\nhttps://sourceforge.net/projects/mmmv-repackaging-projects-t1/files/repackaging_projects/repackaged_ZeroNet/\n\nThe Mastodon is a social networking application, an application for empty blabber, an application for a bubble, where people are given an impression that others admire them and then people repeat, in various forms, \"Look at me! Look at me! Look, how great I am!\". Social networks are not a medium for any reasonable discussion. In my view social networks are truly useless applications, a total nonsense to start with, specially the Twitter with its message length based dumbing of discussion, if one could even call twitter threads a discussion, and the Facebook with its nasty censorship.",
				"added": 1591544770
			}
		],
		"1591547016_17kfQsU2wofPg9sM1smPiny9K1yzLc7Pux": [
			{
				"comment_id": 16,
				"body": "And You are hoping that people will step right into Your honeypot? Nice try. \nAlso, wouldn't it be \"nice\" to discredit the ZeroNet as some shady nonsense that some dumb crackers use? Yet another way to censor intelligent people by building bad reputation to the medium that they use for having politically incorrect discussions.",
				"added": 1591548809
			}
		],
		"1591578782_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 17,
				"body": "The \nhttps://gab.com/\nuses a domain that is centralized, so it is only a matter of time, till they either go to jail or start censoring or kick their service offline like the Lavabit did\nhttps://www.theguardian.com/technology/2013/aug/08/lavabit-email-shut-down-edward-snowden\n\nMay be the ZeroNet could be marketed to the Gab users. Here's a repackaging of it that works on Windows10 Professional Linux layer, the Windows Subsystem for Linux:\n\nhttps://sourceforge.net/projects/mmmv-repackaging-projects-t1/files/repackaging_projects/repackaged_ZeroNet/2018_11_08_ZeroNet_Rev3703_mmmv_repackaging_t2.tar.xz/download\n\nAn average granny is probably not able to install it, but may be some \"local Linux user group\" member helps to set it up for the granny. On the other hand, may be the \"right-wing\" Gab users are a bunch of idiots, who do not seek for censorship resistant communication channels and do not mind that at some point their main communication channel stops working. They might mistakenly think that they can just pick another \"Gab\" and continue, without thinking about how things technically work. If they are almost constantly high or semi-drunk, then their thinking capability is quite limited.",
				"added": 1591594643
			}
		],
		"1591510796_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 18,
				"body": "Architecturally a thing called \"backend\" does not make any sense with the ZeroNet. The ZeroNet model is copying/duplicating/redistributing composite documents like Microsoft Word files, except that in stead of a Microsoft Word file there is a folder that contains a backend-less HTML-zite with whatever files that a static home page with JavaScript browser-side GUI code might have.\n\nThe only point of a server side code in web applications is that it reads or stores something from the server or processes something on the server. If all users of a zite run their zite instance specific server side code, then the zite instances will all have a de facto separate versions and a queston arises, who's version other than the original author's version should be distributed to others. \n\nFor short: a classical \"backend\" for ZeroNet is an oxymoron.",
				"added": 1591595765
			},
			{
				"comment_id": 19,
				"body": "> [adrenochrome](#comment_13_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): Maybe you could save for example mysql files decentralized (sql scripts). It would be a static state of a database.\n\nSQLite \nhttps://www.sqlite.org/\nsaves all of the data into a database instance specific file that is determined at the initialization of a database connection. SQLite is implemented as a C library. The PHP stdlib includes that C library, meaning, SQLite is supported by PHP by default without any database drivers. SQLite is supported by many, if not all, programming languages and an SQLite database size can be multiple GiB, although the SQLite file based approach is totally unsuitable for a situation, when a lot of threads tries to access the database at once, as is the case with web sites with lots of simultaneous visitors. The SQLite supports almost all of the standard SQL. That being said, a \"back end\" is still an oxymoron in the ZeroNet world. What might be done is that the browser side JavaScript might use \nhttps://github.com/emscripten-core/emscripten/wiki\nto run a console application that is written in C and that console application might run the SQLite, which might read in the SQLite database, but that unnecessarily complicates things, because then the option might already be the use of the \nhttps://javascript.info/indexeddb\ncombined with the \nhttps://jsstore.net/\n\nBasically, stop the nonsense and admit that sometimes You actually have to learn new things in stead of hoping to get by with a single old model everywhere. The world is changing. Not all change is worth following, but some changes actually are smart and worth following. I'm glad that nobody asked, how to run Windows10 on an 80-ties electronic watch.",
				"added": 1591596674
			}
		],
		"1591579090_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 20,
				"body": "I guess a lot of it reduces to the suing party's lack of understanding that a smart client candidate will dismiss bad reviews as fake news. It is perfectly OK to have horrible ratings among idiots, whom one does not want to have as clients anyway. Having bad ratings among that kind of market segment can even be a compliment, a POSITIVE ADVERTISEMENT among a smarter market segment. It's like, being publicly denounced by bastards is a compliment, a medal of honor.\n\nThe article reads that some law firms sued people for leaving bad reviews about the law firms' services. Considering my previous paragraph here, would You really want to rely on THAT DUMB lawyers for Your legal representation? The very lawsuit is a really bad review for those law firms and that is all officially confirmed by public courts with public court materials. How dumb can You get as a lawyer. Also, going against one's own clients is a truly dumb thing to do, even if the client's are not the best that You hoped for. The smart(er) thing to do is to reject the job or better yet, try to find a replacement service provider for the client that You want to get rid of and all of that with the pretext that the new service provider is more appropriate for that client. The smartest way to get rid of an unpleasant client is to find some other service provider for the client so that the new service provider truly is better for that particular client than one self would  be able to be. Besides, if competitors are that much better than oneself is, then one should look for a niche with less competition anyway.",
				"added": 1591598609
			}
		],
		"1591512859_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 21,
				"body": "Divided States of America? (DSA)\n\nA more appropriate question might be, what the Divided States of America will look like and how it will differ from the European Union?\n(I'll now take a shower and probably continue my current answer with thoughts from the shower. My first guess is that the situation, where the young can not afford university level education or have horrible debts while salaries have been stagnant and salaries can not possibly raise sufficiently fast even if the 0.1% elite wanted to, because the work arrangement of the DSA is horribly outdated, the paper checks, the long commutes, the absolutely idiotic city planning that has time wasting written all over the city, the not just expensive, but bureaucratically horribly inefficient health insurance system, etc. just do not allow actual increase of wealth of a common American. On top of that the \"undocumented immigrants\" problem, which makes it even harder to get things optimized and it is NOT about privacy, because the Facebook and Google rip the privacy away from every American regardless of, whether the American has an American passport or not. That sort of mess is really hard to fix even if the Bill Gates wanted to burn all of its wealth quickly to fix things, pay more salaries, etc. What's the point of having a bigger salary, if a lot of it is spent on basics like transportation, healthcare, real-estate, and there really are no savings for anything better? How can any company earn more for anybody, even the 0.1%, if people waste their time commuting in stead of spending those hours resting and enjoying life so that they can do a better, more productive, job by being well rested and mentally in good shape? The time spent on paper checks related useless bureaucracy is coming at the expense of resting and enjoying life. At companies the paper-check nonsense comes at the expense of working on projects that actually earn money for the company. \n\nIt's a tough situation totally independent of the Washington and the Washington makes it even worse. At least that's my starting position for my shower-thoughts.)",
				"added": 1591599288
			}
		]
	},
	"comment_vote": {
		"551_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"465_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"75_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"59_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"123_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"753_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}