{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 193,
	"comment": {
		"3_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 66,
				"body": "Там ссылка есть на маятник Капицы, который как раз устойчивый качающийся обратный маятник. Не подойдет?",
				"added": 1525558358
			}
		],
		"1_16ViRrCEqRCH6tyZekTUzyLtYQTtNAW1RY": [
			{
				"comment_id": 67,
				"body": "> [pumba](#comment_2_1A46oGiyZMuMGGnUcNTBUD1M5JugBzxCWQ): в ZeroHello пишет что порт закрыт\n\nВозможно твой провайдер просто не предоставляет тебе внешний ip.",
				"added": 1525563554
			},
			{
				"comment_id": 73,
				"body": "> [pumba](#comment_3_1A46oGiyZMuMGGnUcNTBUD1M5JugBzxCWQ): Как решать?Если написать им в саппорт?\n\nМожно и в саппорт, только часто это дополнительная услуга и стоит дополнительных денег. Но вообще в zn есть альтернативный траспорт через tor hidden service, который не требует внешнего ip или пробросов портов.",
				"added": 1525812214
			},
			{
				"comment_id": 77,
				"body": "> [pumba](#comment_4_1A46oGiyZMuMGGnUcNTBUD1M5JugBzxCWQ): Это у всех так, или это я у мамы особенный?\n\nЭто у всех. Через какое-то время проходит обычно.",
				"added": 1526213733
			},
			{
				"comment_id": 91,
				"body": "> [alert](#comment_4_14xvWFMW9V4tC4ghQxvSvaoShAJ33YxPFb): https://github.com/PurpleI2P/i2pd скачай этот клиент и подожди интеграции\n\nПомоему через него только во что-то пошаговое играть можно.",
				"added": 1532375271
			},
			{
				"comment_id": 95,
				"body": "> [shellmask](#comment_1_18cM164fanuGGF4PTG1NvqcmfxMyDEPkLE): о, как раз тот топик, который мне нуженесли ставил зеронет, регался на зероид под одним логином, а затем удалял зеронет, то старый логин утерян безвозвратно?\n\nДа, если бекапов не осталось конечно.",
				"added": 1532979211
			}
		],
		"3_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 68,
				"body": "Я под это дело форкнул и немного допилил [ZeroUp](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/)",
				"added": 1525601547
			},
			{
				"comment_id": 69,
				"body": "> [calmaquesse](#comment_35_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): А какие именно изменения вы внесли?\n\nРазрешил аплоад всех типов файлов и любого размера, а так же добавил возможность использования KaffieID.",
				"added": 1525602788
			}
		],
		"2_14QcoQB7PsuREm2aD9RK3KtrfxPv73qx6Z": [
			{
				"comment_id": 74,
				"body": "Телеграм изначально не p2p.",
				"added": 1525976393
			},
			{
				"comment_id": 75,
				"body": "> [sangokas17](#comment_1_14QcoQB7PsuREm2aD9RK3KtrfxPv73qx6Z): Звонки как раз p2p\n\nСомневаюсь. Входящее соединение на exit-node сделать нельзя.",
				"added": 1525980542
			},
			{
				"comment_id": 76,
				"body": "> [deepstrelok](#comment_16_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Телеграм звонит напрямую к юзеру по его ip. Или через сервера телеграм. Как ты тут hidden service вклинишь. Разве, что с onioncat шаманить. \n> Для звонков лучше используй sip или mumble. Можно поднять сервак вполне, как tor hidden service и звонить при правильных настройках. Также для sip можно юзать SRTP+ZRTP и будет end-to-end шифрование.\n\nМожно просто tox использовать, там по умолчанию шифрованные e2e звонки.",
				"added": 1525985594
			}
		],
		"1_1APBG6MFYnvz3wkxoh6Z5DfQUBQQB1Z4ZN": [
			{
				"comment_id": 78,
				"body": "По идее достаточно `data/users.json` скопировать. Но тут могут быть подводные камни вроде перетерания незасинхронизированных постов.",
				"added": 1527314797
			},
			{
				"comment_id": 80,
				"body": "Тут проблема не в недостаточной синхронизации, а в том, что ее нужно дождаться перед отправкой поста, иначе перетереть что-нибудь свое же можно.",
				"added": 1527583849
			}
		],
		"1_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV": [
			{
				"comment_id": 79,
				"body": "> [volodja](#comment_1_17kweDjPaMa2tprBHxW6YNizQ44yg7nT5P): Децентрализованная система самоуправления с регистрацией по паспорту\n\nКто и как будет регестрировать и проверять паспорт на уникальность и предмет мэдскилзов в пеинте? Как быть с теми кто потерял свои ключи?",
				"added": 1527498286
			}
		],
		"1_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": [
			{
				"comment_id": 81,
				"body": "У всего есть свои пределы. Когда не остается никого, кто бы раздавал зайт, он умирает.",
				"added": 1527885878
			}
		],
		"4_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": [
			{
				"comment_id": 82,
				"body": "Собственно в интерфейсе и разница.",
				"added": 1528010712
			}
		],
		"3_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": [
			{
				"comment_id": 83,
				"body": "> [krakodeel](#comment_2_1G4w8VAewobZcBJUBdB4Xo9Thx8kdb29Te): opencomputers/lua вот это всё\n\nЗнакомая штука. Получалось написать что-нибудь полезное или интересное? Меня максимум на всякие майнилки/платформостроители хватало.",
				"added": 1528300759
			}
		],
		"1_14vpMXmnJuhoQ8qv9oDVRh313TaUModCLw": [
			{
				"comment_id": 84,
				"body": "Админ тут уже около года не появлялся. Но можно удалить самостоятельно для себя, зайдя на http://127.0.0.1:43110/zeroid.bit/ и добавив автора в черный список.",
				"added": 1528313652
			}
		],
		"1_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 85,
				"body": "http://127.0.0.1:43110/1F2grL5mK3t2Z876Apn1GA7sjv1B5ryYMu/\nhttp://127.0.0.1:43110/1oJQLFq6DYkTw6c4MbZDaFEEocSBvR8FW/",
				"added": 1529928984
			}
		],
		"2_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": [
			{
				"comment_id": 86,
				"body": "> [eliot](#comment_1_1P3JVeqokaicpcrMK9HXzpScWa2fPSLen8): Думаю валить надо\n\nКого?",
				"added": 1530265184
			}
		],
		"1_1oyaErvT1Ww6RVeJvRkp5LgenBpdfws99": [
			{
				"comment_id": 87,
				"body": "> [kukiswum4orr](#comment_2_112P12yusWzfvzAUiEbL6YUzWg33hfGxae): А тут скорость как в обычном вебе. как говорится, I want to believe...\n\nЗа счет того, что основные данные синхронизируются в фоне, тут скорость может быть выше чем в обычном вебе.",
				"added": 1530813355
			}
		],
		"1_1LC5DMsscdXDvXUFTvoUJ9yZ9J9g1NfMjT": [
			{
				"comment_id": 88,
				"body": "Не встречал.",
				"added": 1531696157
			},
			{
				"comment_id": 139,
				"body": "А зачем шифровать магазин?",
				"added": 1552064398
			},
			{
				"comment_id": 143,
				"body": "> [mistalero](#comment_61_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Это же не магазин, нет функции корзины.\n\nБывают магазины без этой функции.",
				"added": 1552580899
			}
		],
		"2_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": [
			{
				"comment_id": 89,
				"body": "https://github.com/samyk/pwnat/",
				"added": 1531772345
			},
			{
				"comment_id": 90,
				"body": "> [shaper](#comment_13_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE): Как это включить? Оно не скомпелировано.\n\n```make```",
				"added": 1532028425
			}
		],
		"1_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 92,
				"body": "Когда-то пробовал регистрировать себе домен на opennic, закончилось тем что через пару недель его удалили без предупреждения и объяснения причин.",
				"added": 1532817033
			},
			{
				"comment_id": 93,
				"body": "> [syntia](#comment_14_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Точно не знаю, но по-моему там платная система - сколько-то там 0.05 биткойна на определённый срок. Как-то так. А то, что Вам дали - может была триал версия?\n\nТам прямо на главной заявлено что они не берут денег, так же я не нашел какой-либо другой информации про цены. 0.05 биткоина за домен это очень дорого.",
				"added": 1532901027
			},
			{
				"comment_id": 94,
				"body": "Честно говоря я уже не помню на каких именно доменах я регестрировался.",
				"added": 1532946631
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 96,
				"body": "> [hugeping](#comment_8_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): Ну трафик же =)\n\nТрафика тут не так уж и много, у меня например меньше 100мб в сутки получается, конкретные объемы можно посмотреть на вкладке stats в zerohello.",
				"added": 1534283227
			}
		],
		"5_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 97,
				"body": "Не может ли быть так, что у пользователя нету прав на запись в каталог с zn?",
				"added": 1535986378
			}
		],
		"4_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 98,
				"body": "http://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz",
				"added": 1536012360
			}
		],
		"1_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 99,
				"body": "В сети подобной чему? Многопользовательских игр, где каждый игрок полностью симулирует у себя игровой мир, хватает, для таких достаточно будет просто реализовать возможность подключения к любому из играющих как к серверу и динамическое переключение в случае отключения \"сервера\".",
				"added": 1536851359
			}
		],
		"4_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 100,
				"body": "Вместо открытия порта (которое не на всех провайдерах возможно) можно запуститься через tor.",
				"added": 1537107096
			}
		],
		"4_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 101,
				"body": "У меня было что-то похожее из-за неправильно подписанных файлов.",
				"added": 1537834839
			}
		],
		"2_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 102,
				"body": "> [mistalero](#comment_17_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Internal error: DatabaseError: database disk image is malformed\n\nrebuild database не спасает?",
				"added": 1538390930
			},
			{
				"comment_id": 103,
				"body": "> [mistalero](#comment_18_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Как это сделать? Ничего не помогает. Вообще.\n\nНа нужном сайте потянуть влево нолик в правом верхнем углу, откроется панель, там в разделе database есть конпка Rebuild.",
				"added": 1538491830
			},
			{
				"comment_id": 104,
				"body": "> [mistalero](#comment_19_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): На сайте не отображается панель, потому что отображается страница ошибок.\n\nМожно попробовать удалить сайт и добавить снова.",
				"added": 1538578901
			}
		],
		"1_18iNiFsd2V5Xkzf9B1QoAgvqsnHe8EGBam": [
			{
				"comment_id": 105,
				"body": "localbitcoins.com, если продавец хочет чего-то странного, вроде паспорта, посылаем продавца и ищем следующего.",
				"added": 1539507369
			}
		],
		"6_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 106,
				"body": "> [darktrader03](#comment_4_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb): Т.е. по-сути если я создал какой-то сайт, а потом понял что у меня нет на него времени и захотел его у всех удалить, чтобы он не весел \"мертвым грузом\", то я могу запросто это сделать. Правильно?\n\nДа.\n\n> Хмм... Звучит интересно. До делать это можно только вручную, предварительно зайдя в ту папку? Или это поддерживается прямо в некоторых движках зайтов создавая такую себе мини мод-панель.\n\nДаже если это не поддерживается со стороны api то можно модифицировать свой клиент сооветствующим образом. Совместимость с остальными при этом останется.\n\n> И как насчет ограничивание доступа в правах \"записи\" или даже \"чтения\" для некоторых ID со стороных создателя зайта?\n\nМожно установить нулевой лимит доступного пространства, что сделает невозможным для пользователя опубликовать что-либо. Ограничений на чтение нету, можно разве что зашифровать сообщение.",
				"added": 1539590476
			},
			{
				"comment_id": 107,
				"body": "> [darktrader03](#comment_5_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb): А такие модификации уже существуют для движков сайта?\n\nНе интересовался вопросом.\n\n> Это можно настраивать для каждого отдельного пользователя получается?\n\nДа.\n\n> Получается если с этим поиграться, то костыльным методом можно запилить возможность как обычных банов, так и no-read банов.\n\nОбычные баны как раз и запиливаются установкой нулевого лимита. С no-read - это только если заранее определять список пользователей, которым доступно сообщение для чтения, путем шифрования его их ключами, что весьма неудобно.",
				"added": 1539594596
			}
		],
		"7_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 108,
				"body": "В случае невозможности открытия порта контент можно через tor hidden service публиковать.",
				"added": 1540327111
			}
		],
		"7_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 109,
				"body": "Зачем? Для полной анонимности достаточно просто генерить новый ID на каждый пост.",
				"added": 1540844127
			},
			{
				"comment_id": 110,
				"body": "> [darktrader03](#comment_6_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb): Но ведь в таком случае как проводить модерацию контента? Я имею ввиду мьютить пользователей.\n\nКаждое сообщение придется мьютить отдельно.",
				"added": 1540886522
			},
			{
				"comment_id": 111,
				"body": "> [darktrader03](#comment_7_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb): Алсо, а зачем тогда каждый раз генерировать новый сертификат? Не лучше ли тогда полностью от них отказаться?\n\nНасколько я понимаю они в протоколе зашиты.",
				"added": 1540935701
			}
		],
		"1_15GqdBvcxgrSodxpe5QUridX85E9hjmLAW": [
			{
				"comment_id": 112,
				"body": "> Кто что думает по этому поводу , как нам находить друг друга?\n\nДоски объявлений же. Они еще на заре интернета появились.",
				"added": 1542917120
			},
			{
				"comment_id": 113,
				"body": "> [balancer73](#comment_463_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В RetroShare \n\nЯ не про RetroShare а про интернет конца девяностых - начала нулевых.",
				"added": 1543510177
			}
		],
		"2_16nkBHuqRkit6TnaEfuJiGi6UEJJ6eCzds": [
			{
				"comment_id": 114,
				"body": "> товарища майора тут нет\n\nЯ в этом не уверен.",
				"added": 1543955911
			}
		],
		"1_16qgVeyTjMzd6NFZzT8xjWn6KT47hpXdVe": [
			{
				"comment_id": 115,
				"body": "Проблема может быть просто в низкой популярности посещаемого ресурса. Открытость/закрытость порта на скорость загрузки влияет мало. В некоторых случаях включение tor может улучшить ситуацию.",
				"added": 1544044779
			}
		],
		"2_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": [
			{
				"comment_id": 116,
				"body": "> Или есть какая-то её локальная копия?\n\nУ всех зайтов есть локальная копия. ZeroHello не исключение.",
				"added": 1544711746
			}
		],
		"1_1FSr4KP1pQCjknEWexaNy89X3YZNL9ocgr": [
			{
				"comment_id": 117,
				"body": "> [kotbezzabot](#comment_3_1JYTJbkJjERFUC2ngeEk2tYBqKBdci5g77): Не помешало бы правила русского языка подучить! (Грамматику там, орфографию)\n\nДа ну, кому она нужна?",
				"added": 1546723647
			}
		],
		"1_1DkpXcpJ5YBXnDpHFYveSsdj1aCbeEULrg": [
			{
				"comment_id": 118,
				"body": "> Этот форум модерируемый?\n\nТут каждый сам себе модератор. Заигнорить непонравившегося пользователя можно через ZeroID.\n\n> Какие в зеронете есть интересные ресурсы?\n\nИнтересность - понятие очень субъективное. Из русскоязычных форумов есть такие:\n\nhttp://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/\n\nhttp://127.0.0.1:43110/1G56gcfMzp7695tpSHJN8qRR5N2pfTe7fw/\n\nhttp://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/\n\nhttp://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/\n\nhttp://127.0.0.1:43110/15zr8fG5h9FZu6dt5CC9kQ1F7PMpiGu6Tm/\n\nhttp://127.0.0.1:43110/1QHkZVa1z3TRrerAqjExERavvodW75bA3c/\n\nhttp://127.0.0.1:43110/1DCApr9WK3oQjfgg5zs4nK2RqB4PGtwbqA/\n\nhttp://127.0.0.1:43110/1oJQLFq6DYkTw6c4MbZDaFEEocSBvR8FW/\n\nhttp://127.0.0.1:43110/1Jb5ZdmvTzVnHpa2hayjQk3H2kZgNVbmBb/",
				"added": 1546973814
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 119,
				"body": "RIP",
				"added": 1548354560
			}
		],
		"1_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 120,
				"body": "> [cederbaum](#comment_9_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): Как вариант будем покупать sim и регистрировать IMEI на бездомных за небольшую рлату им\n> Другой вариант - менять IMEI каждый месяц - косим под туристов\n\nЕсть варианты попроще. Китайцы иногда клепают целые партии аппаратов с одинаковыми IMEI, которые потом прекрасно уживаются в одной сотовой сети. Дальше, думаю, понятно.",
				"added": 1548712760
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 121,
				"body": "> Несмотря на громкое название, на первых порах это будет будет просто конференция олдов в мессенджере, занимающихся административной работой.\n\nПочему бы не сделать ее открытой и не разместить здесь же, в zn? Во первых какой-никакой, а контент. Во вторых мнение новых участников сети тоже стоит выслушать, иногда свежий взгляд очень кстати. В третьих формат форума куда больше распологает к конструктивному общению и не так требователен к часовым поясам и свободному времени. В четвертых не требуется никакой дополнительный софт и регистрации.",
				"added": 1548714430
			},
			{
				"comment_id": 122,
				"body": "> [quirrel](#comment_49_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Зайт тут спамить начали, похоже. Есть какие методы противодействия?\n\nЗайти на ZeroID, search in user database, там вбить ник спамера и заблокировать.",
				"added": 1549094275
			},
			{
				"comment_id": 123,
				"body": "> [x86128](#comment_11_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Удалит ли это с вашего компьютера материалы спамера? Или только вы их перестанете видеть?Хотелось бы ещё и не помогать хостить их контент.\n\nНет, контент не удаляется, но вроде как перестает обновляться. Можно попробовать удалить его руками и посмотреть, прилетит ли он при следующем апдейте.\n\n> [geekless](#comment_105_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Допустим, в некоторый момент времени 10 узлов поддерживают коннект только друг с другом, и ни один из них не поддерживает коннект с остальной тысячей узлов. Просто так совпало.\n\nВремя от времени так и случается. Тогда обновления запаздывают, иногда даже больше чем на день.",
				"added": 1549138910
			},
			{
				"comment_id": 133,
				"body": "> [akiiro](#comment_4_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd): 3) могу ли я использовать Wordprese в zeronet?\n> 4) или сделать его на чистом html + css и выложить в zeronet?\n\nЕсть два варианта - либо использовать движок ZeroBlog, который является аналогоь wordpress в zeronet либо же выкладывать чистый html+css как набор файлов.",
				"added": 1550773856
			}
		],
		"2_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 124,
				"body": "Но причем тут порносайты?",
				"added": 1549381474
			}
		],
		"2_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 125,
				"body": "> [promusik](#comment_46_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): По какой цене Васян будет покупать [coin_name]?\n\nПо той, цене, которую он установил, если найдутся продавцы, согласные на нее. Это же биржа.",
				"added": 1549557385
			},
			{
				"comment_id": 126,
				"body": "> [promusik](#comment_47_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Пока это всё по зеронету пройдет - пройдет уйма времени, а на бирже важны секунды.\n\nНа закате своего существования mtgox неслабо так лагал, но им все равно продолжали пользоваться. Одним HFT мир бирж не ограничен.",
				"added": 1549749853
			}
		],
		"1_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 127,
				"body": "Подойдут.",
				"added": 1549866286
			}
		],
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 128,
				"body": "> [gluckman](#comment_41_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): А можно подробности, что за зверь а то у товарища тут одного исследование целое на тему анонимных IM\n\nhttps://matrix.org/blog/home/",
				"added": 1549919062
			}
		],
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 129,
				"body": "> адекватная работа на android\n\nTox вполне себе нормально работает на android.\n\n> Пробивает NAT\n\nУ tox тоже с этим проблем нету.",
				"added": 1549997210
			}
		],
		"7_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 130,
				"body": "> книг\n\nhttp://127.0.0.1:43110/1F2grL5mK3t2Z876Apn1GA7sjv1B5ryYMu/\n\nhttp://127.0.0.1:43110/1oJQLFq6DYkTw6c4MbZDaFEEocSBvR8FW/\n\n> фильмов, сериалов\n\nhttp://127.0.0.1:43110/1JUjBANMM5MjbGrzz3faUd3gXUXmAr3ces/",
				"added": 1550088603
			}
		],
		"3_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 131,
				"body": "> [gomzik](#comment_120_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): так при входе на новый зайт у тебя непохожий на другие ключи, нужно явное подтверждение авторизованного zero id пользователем, в итоге как-то не очень получается задеанонить\n\nРазве это явное подтверждение нельзя дать, отправив запрос на 127.0.0.1?",
				"added": 1550306787
			}
		],
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 132,
				"body": "> [promusik](#comment_60_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Вариант 2: один из пользователей обладает спутниковым Инетом - так через него может весь российский сегмент синкаться, но долго.\n\nПочему же долго? Там трафика не так много, как кажется, будет вполне ок работать.",
				"added": 1550607812
			}
		],
		"1_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ": [
			{
				"comment_id": 134,
				"body": "> [akiiro](#comment_12_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd): А где это можно увидеть и покрутить самому?и где можно понять сколько всего людей пользуется zeronet в мире\n\nZeroHello -> stats, винзу",
				"added": 1551076842
			},
			{
				"comment_id": 136,
				"body": "> [akiiro](#comment_13_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd): но как я понимаю я вижу только кол-во сидеров по миру только тех сайтов, что я посещал?\n\nВвиду того что сеть ZeroNet децентрализована, точный общий учет вести сложно. Но я думаю что на крупные зайты так или иначе заходит большинство.",
				"added": 1551193457
			},
			{
				"comment_id": 137,
				"body": "> [akiiro](#comment_19_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd): Что эти цифры означают?\n\nПиров.\n\n> По какому сайту я могу получить более полное представление сколько людей установило ZeroNet\n\nZeroHello наверное. Только количество пиров не учитывает тех, кто в офлайне.",
				"added": 1551290255
			}
		],
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 135,
				"body": "> [quirrel](#comment_90_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Тут таких нету.\n\nВозможно их стоит сделать?",
				"added": 1551193107
			}
		],
		"1_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW": [
			{
				"comment_id": 138,
				"body": "Но зачем?",
				"added": 1552064289
			}
		],
		"1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 140,
				"body": "> [gsdth](#comment_4_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW): я понял что вы хотите но увы сечас  провайдеры выдают изолированные каналы чтото вроде vpn до ихнего шлюза\n\nНе все.",
				"added": 1552064529
			},
			{
				"comment_id": 141,
				"body": "> [murzazade4](#comment_26_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp): Путинские - не путинские, а размерность номера автономной системы всего 65535 вариантов на весь мир.\n\n4294967296 вообщето. Четыраехбайтные asn ввели уже очень давно.",
				"added": 1552206145
			}
		],
		"3_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 142,
				"body": "> [zxfhu](#comment_2_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): — IPV6\n> — Мобильные клиенты\n\nЭто все уже есть.",
				"added": 1552455305
			}
		],
		"1_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": [
			{
				"comment_id": 144,
				"body": "> [deliriumgoddess6](#comment_13_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): не смогли, но смогли усложнить жизнь. читал блог одного китайца\n\nИнтересно было бы узнать подробности.",
				"added": 1552580963
			}
		],
		"1_1P54cCnU2iSUdsaAv14KML9EoiLquXfRJk": [
			{
				"comment_id": 145,
				"body": "> Есть ли такой механизм в ZeroNet, даже с поправкой на приоритет всяким css,content.json и прочим файлам для главной страницы?\n\nНету. И смысла в этом тут тоже нету так-как количество личеров стемится к нулю.",
				"added": 1552675697
			}
		],
		"1_1e2mHauMGG8GgSDvaaPrNanxvaxwpGQRV": [
			{
				"comment_id": 146,
				"body": "Вроде как недавно добавили шифрование при передаче. Но смысла в нем мало.",
				"added": 1552675792
			}
		],
		"2_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW": [
			{
				"comment_id": 147,
				"body": "> [deliriumgoddess6](#comment_20_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): а как быть с серым ip?\n\nНа них разве что в .onion можно трекер держать.",
				"added": 1552939482
			}
		],
		"2_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 148,
				"body": "Можно будет продолжать пользоваться через tor.",
				"added": 1552939573
			},
			{
				"comment_id": 150,
				"body": "> [murzazade4](#comment_35_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp): Zeronet работает и без трекеров.\n\nНет.",
				"added": 1553061339
			}
		],
		"3_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 149,
				"body": "Их тоже могут отключить.",
				"added": 1553061134
			},
			{
				"comment_id": 153,
				"body": "> [iormungard](#comment_1_18rfzg99UZ36sYDxjNZ6rn2Krvdiq2QKpk): даже тот же наш ZeroNet,но зеронет,фринет,тор и так далее это оверлейные сети то есть работают поерх существующего интернета\n\nZN в отличии от остальных может работать и поверх локальной сети.",
				"added": 1556301699
			}
		],
		"1_1BRQVZ4JEHjbNx3vyA5FyFjvM3GYSw7c7U": [
			{
				"comment_id": 151,
				"body": "Есть шареные блеклисты, например http://127.0.0.1:43110/1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/",
				"added": 1554042979
			}
		],
		"3_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": [
			{
				"comment_id": 152,
				"body": "> [syntia](#comment_64_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Где мне посмотреть на Android, какая у меня система 86 или 64?\n\nuname -a в терминале",
				"added": 1556132633
			}
		],
		"2_1AefSRYaJKZg4XhSbQJs2GtNA4cur8h1Qp": [
			{
				"comment_id": 154,
				"body": "Лучше одноразовых шифроблокнотов пока ничего не придумали.",
				"added": 1557086008
			}
		],
		"1_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 155,
				"body": "> Не понимаю: ради чего разрабочики решили помещать на каждую, даже явно статическую страницу, меню в виде значка в правом верхнем углу.\n\nСо всем этим страничка может взаимодействовать посредством js.",
				"added": 1557387289
			}
		],
		"3_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 156,
				"body": "Зайти на ZeroID, вбить там ник пользователя и нажать заблокировать.",
				"added": 1557691276
			}
		],
		"2_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 157,
				"body": "> [if0](#comment_20_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Хотя странно, что имеется всего лишь один единственный трекер\n\nНу как бы никто не запрещает поднять еще один .onion трекер у себя и раздавать его через протокол обмена трекерами. Для него даже внешний ip не нужен.",
				"added": 1558461370
			},
			{
				"comment_id": 158,
				"body": "> [if0](#comment_23_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Я попытался по наитию поднять трекер используя opentracker, но он не желал подхватываться ZeroNet. Возможно, протокол другой или еще что. А мануалы, как правильно поднять трекер в Tor не обнаружилось.\n\nДля onion поддерживался вроде только zero:// протокол. Трекер под него можно скачать тут: https://github.com/ZeroNetJS/zeronet-tracker дальше по идее нужно поднять под него hidden serice и забить в свой клиент.",
				"added": 1558463790
			},
			{
				"comment_id": 159,
				"body": "> [if0](#comment_24_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Для трекера требуется нода с npm... \"Какой неожиданный поворот!\"\n\nЗато не на питоне (:\n\n> Робко поинтересуюсь: а без ноды никак нельзя?\n\nЭто единственная реализация трекера с zero-протоколом, которую я нашел. Можно еще поискать потщательней или же написать свою реализацию на своем любимом яп.",
				"added": 1558466447
			}
		],
		"1_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": [
			{
				"comment_id": 160,
				"body": "Потому что без игр они мало кому будут нужны.",
				"added": 1559648913
			}
		],
		"3_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": [
			{
				"comment_id": 161,
				"body": "> [qpchangoku](#comment_4_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3): Сайты открывает медленно\n\nЭто нормально для i2p.",
				"added": 1559648981
			}
		],
		"1_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": [
			{
				"comment_id": 162,
				"body": "Последний коммит 31 мая.",
				"added": 1559649732
			}
		],
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 163,
				"body": "> [geekless](#comment_163_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В ZeroNet технически неосуществимо.\n\nРазве в zn пользователь может полностью удалить свой content.json? На мой взгляд можно сделать технический зайт, наличие на котором content.json пользователя с любым содержимым или без него будет означать отзыв ключа.",
				"added": 1561567317
			}
		],
		"9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 164,
				"body": "> [geekless](#comment_207_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Протокол требует \"слишком много\" пропускной способности сети.\n\nНо ведь DHT действительно весьма жирный по трафику. У того же ipfs dht трафик составляет порядка мегабита в обе стороны, 24/7 и пользователи с ограничением по трафику могут не оценить лишние 20Гб в сутки.",
				"added": 1562400059
			},
			{
				"comment_id": 165,
				"body": "> [geekless](#comment_211_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Фактически он предложил сеть разбить на два слабосвязанных сегмента, \n\nНо с другой стороны для zn сильная связность и не нужна особо.\n\n> Для узлов на слабом канале можно рассмотреть вариант делегирования запросов к узлам (сидящим на жирном канале), объявившим себя DHT-агрегаторами или шлюзами.\n\nЧто-то вроде аналога --routing=dhtclient у ipfs?\n\n> [geekless](#comment_212_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): IPFS вообще жрёт ресурсы как не в себя, но я не разбирался, с чем это связано.\n\nОтключение dht как раз и снижает потребление ресурсов радикально.",
				"added": 1562445538
			},
			{
				"comment_id": 166,
				"body": "> [if0](#comment_99_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Будет прикольно, когда одна часть пользователей форума, не будет видеть  сообщения и топики другой части пользователей одного форума.\n\nТолько новые и только временно.\n\n> [geekless](#comment_215_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Такое возможно - представь, что сайт, созданный на Земле, засидирован на Марсе, а связь между планетами нестабильная. Но живя на одной планете, хотелось бы такого избежать.\n\nДаже на разных планетах данные рано или поздно переедут.",
				"added": 1562705824
			}
		],
		"1_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": [
			{
				"comment_id": 167,
				"body": "> [zerolespero](#comment_30_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): Криптография на JS весьма ненаднжна........\n\nПочему это?",
				"added": 1563169439
			}
		],
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 168,
				"body": "> [fant](#comment_15_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Наверное только закладка с конвертом с мелкими старыми купюрами...\n\nА как же крипта?",
				"added": 1563467513
			}
		],
		"1_1BkKy5cCZuUqCCeUQgGG74HM6U6ArJpfnt": [
			{
				"comment_id": 169,
				"body": "> [wrewolf](#comment_179_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): А как мьютить таких?\n\nПойти на zeroid, вбить ник и нажать mute.",
				"added": 1564065637
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 170,
				"body": "> [if0](#comment_152_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Для начала, что бы потратить крипту, ее надо от куда то взять -  купить или получить за некую услугу. Не думаю, что даже самое либеральное государство будет позволять официально обналичивать активы анонимного происхождения, не проявляя интереса к источнику их происхождения.\n\nДля многих государств демонстрация магазинчика в zn за крипту будет вполне себе легальным обоснованием ее происхождения.",
				"added": 1564769396
			},
			{
				"comment_id": 171,
				"body": "> [if0](#comment_155_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): По закону такое предприятие называется: \"организация схемы отмыва нелегальных доходов\".\n\nС чего бы?\n\n> Или вы лично будете ручаться, за каждую транзакцию перед налоговой инспекцией, что анонимные (!!!) \"покупатели\" в вашем магазинчике все до одного законопослушные граждане, тратящие честно зарабатанную крипту, а не торговцы веществами или писатели вирусов-шифровщиков?\n\nС точки зрения нормальной налоговой это проблема анонимных покупателей а не магазина.",
				"added": 1564829256
			},
			{
				"comment_id": 172,
				"body": "> [if0](#comment_161_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): В силу анонимности операций с криптой. Совершение сделки с активами неизвестного происхождения. \n\nАктивы произошли от совершения сделки. Где их достал контрагент - его проблемы и его ответственность.\n\n> Если жулик переведет на вашу банковскую карту украденые деньги у вас не будет никаких проблем?\n\nВ худшем случае разговор с  правоохранительными органами на предмет возможной идентификации этого жулика.",
				"added": 1564838980
			},
			{
				"comment_id": 173,
				"body": "> [if0](#comment_165_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Тоже самое можно сказать про скупку краденного. \n\nПо такой логике если в ашане купить что-то по краденой кредитке то ашан закроют за отмывание денег.",
				"added": 1564848294
			}
		],
		"5_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 174,
				"body": "> [ultraviolet](#comment_121_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Для запуска броузера например\n\nБраузер можно и локально запустить, пробросив только порт или socks прокси.",
				"added": 1565772754
			}
		],
		"1_16iGKuwiVs9no6N8gTnn8y12TGMzvxDxEL": [
			{
				"comment_id": 175,
				"body": "> [if0](#comment_221_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): В IPFS отсутствует механизм анонса факта измененией, произошедших в директории или файле, что бы узлы, загрузившие некий контент могли автоматически его обновлять.\n\nipns разве не претендует на эту роль?",
				"added": 1567788821
			}
		],
		"2_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 176,
				"body": "> [swashbuckler](#comment_16_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Это я понимаю. Но как сделать так, чтобы был хотя бы один peer, который раздавал бы файл даже если оригинальный аплоадер уже даже не пользует ZN?\n\nОчевидно, что стать этим пиром самому.",
				"added": 1572169050
			}
		],
		"1_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 177,
				"body": "> [if0](#comment_253_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Во-первых, его могут запретить перепрошивать - отключать от сети на уровне оператора при обнаружении перепрошивки. \n\nЧем больше людей будет с перепрошитыми смартфонами на руках, тем сложней это будет сделать.",
				"added": 1573494792
			}
		],
		"4_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": [
			{
				"comment_id": 178,
				"body": "* Result:\n - Total: 31 tests\n - Success: 0 tests\n - Failed: 0 tests\n - Average speed factor: 2.32x (Fast)\n - Total time: 9.204s\n\n> [dude](#comment_82_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Почему то у всех -  Success: 0 tests :)\n\nНо Failed тоже 0.",
				"added": 1581104208
			}
		],
		"6_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 179,
				"body": "> [katelinlis1](#comment_4_1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp): ??, что тут не так?\n\nКто-то не умеет пользоваться nmap.",
				"added": 1582214095
			},
			{
				"comment_id": 181,
				"body": "> [topnet](#comment_33_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): умею  я пользыватся nmap иногда нужно проверять со сторонних адресов чтоб проверить блокировку диапазонов в фаерволе\n\nВ чем проблема запустить nmap на стороннем адресе?",
				"added": 1582485220
			},
			{
				"comment_id": 182,
				"body": "> [topnet](#comment_35_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): где его взять хостинг из за этого арендовать нах надо\n\nМожно попросить у кого-нибудь. Впрочем аренда дешевой впски стоит меньше цента в час.",
				"added": 1583004600
			}
		],
		"8_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 180,
				"body": "> [jk7](#comment_44_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): Лучше - напишите инструкцию, как это выпиливать.\n\nПерепрошивкой на OpenWrt, очевидно же.",
				"added": 1582485106
			}
		],
		"2_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY": [
			{
				"comment_id": 183,
				"body": "Документы не скачиваются.",
				"added": 1583785527
			},
			{
				"comment_id": 184,
				"body": "> [xandanyesm](#comment_16_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): ссылки поправил\n\nТеперь работает, спасибо.",
				"added": 1583861490
			}
		],
		"1584457808_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 185,
				"body": "> [geekless](#comment_284_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А нет желающих встроить в зеронет транспорт поверх UDP и приделать NAT Traversal?)\n\nУ меня, например, он даже в условиях тестового стенда работать отказывается. Возможно конечно я что-то делаю не так.\n\n> [geekless](#comment_286_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Например, мой провайдер не поддерживает IPv6 вообще никак.\n\nЕго кстати можно завести и без поддержки со стороны провайдера. Если есть внешний ipv4 то через 6to4, если нету, то teredo или через какой-либо другой туннель. У teredo правда есть один недостаток - два teredo-адреса не могут ощатся друг с другом, если оба за натом. С брокерами или впн такой проблемы нет, но там могут быть проблемы со скоростью.",
				"added": 1585739441
			}
		],
		"1586675181_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 186,
				"body": "Это они не осилили внедрить ipv6 и теперь изобретают свой велосипед?",
				"added": 1586881322
			}
		],
		"1585772185_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 187,
				"body": "> [zombibi](#comment_1_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): во всей этой хрени отсуствует простая ф-ция - записать и отправить голосовое/видео сообщение\n\nПомоему это прекрасно.",
				"added": 1586881369
			}
		],
		"1591016723_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 188,
				"body": "И чем это поделие лучше оф клиента?",
				"added": 1591129464
			},
			{
				"comment_id": 190,
				"body": "> [topnet](#comment_73_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): работает нормально\n\nОф клиент тоже нормально работает.",
				"added": 1591613662
			}
		],
		"1588557585_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 189,
				"body": "> [jk7](#comment_75_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): где сеть держиться на дружбе и взаимопомощи\n\nГде бы найти друга или взаимопомошника, согласного подержать у себя десяток-другой терабайт зашифрованных архивов?",
				"added": 1591130217
			}
		],
		"1591036220_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 191,
				"body": "> [zombibi](#comment_20_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): дело rtp over tcp еще хуже, по качеству чем токс.\n\nНу по качеству аудио токс очень сложно переплюнуть, оно там на голову выше всего остального, что мне доводилось пробовать.",
				"added": 1592169185
			}
		],
		"1594971941_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 192,
				"body": "Так как именно tp-link нарушает rfc?",
				"added": 1595243849
			}
		]
	}
}