{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 1,
				"body": "Hello there faggots. Thanks for not hating me so much.\nThe antifa shit was kinda just a LARP, I don't really care about nazi autists, I just wanted to have some fun shitting things up because that's what I do. Breaking things is fun.\nThe spam will probably stop when I get too bored, or my script breaks, or someone implements a security measure, or my computer gets too slow from multiple instances eating up the RAM.\nEither way, decentralized shit almost never works, I will be really impressed if this network survives without using any centralized service like the ID providers.\nbtw, the ID provider idea is pretty good, I don't think I can generate IDs fast enough to do any real harm, but using them is kinda against the decentralization thing right? :^)",
				"added": 1565325102
			},
			{
				"comment_id": 2,
				"body": "> [ratsmack](#comment_1_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): I guess somebody had to do it. it may as well have been you.\n\nYeah, it's kinda inevitable if no one implements any anti-flooding measure.\nThe thing about decentralization and allowing everyone to host shit is that you can't prevent me from just deleting my identification and telling everyone I'm a new user. That's what I'm doing, I delete my identification after every single post.\n\n> [h3bhkj5gqz4n3pjm](#comment_682_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): great just tell us when 'you are bored', for us to 'get back to a normal life'.and please go fuck 'some real people out there',just to see if you're a man.\n\nlmao what the fuck are you talking about\n\n\n> [zeronetanon4](#comment_33_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): Nah, you're doing us a favor even if it isn't your intention.  Its better seriously disruptive stuff such as this is confronted and fixed now than later down the road.  Decentralized technology is without a doubt the way of the future, and to make it work while still holding onto our ideas of information being freely transmitted is a great engineering challenge.  I don't know what the later iterations of this technology will become, but it will require some ingenious ways of functioning.  Thanks man, I'm enjoying solving this problem.\n\nI'm betting real hard against decentralization.\nIf it somehow works, though, it'll be pretty awesome.",
				"added": 1565325676
			},
			{
				"comment_id": 3,
				"body": "> [removeboomer](#comment_12_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): Exactly, things like diffie hellmann would never have existed without the need for secure key sharing. Or even just onion routing which is simple in theory, but pretty hard to get right.\n\nSo hard to get it right that it's still pretty broken. The feds are there to prove it.\nIt's still the best we have right now, though.\nbtw, your username inspired me to keep spamming QResearch even if I stop spamming the other boards, Q is some fucking retarded shit",
				"added": 1565325901
			},
			{
				"comment_id": 4,
				"body": "> [28eb9](#comment_7_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7): there's basically no difference between that and posting as an anon, except here there's no site to shutdown or IP to track\n\nThe difference is that on a normal board, the identification is my IP, and cycling those through proxies is fucking terrible, it breaks ReCaptcha, it breaks the board, and normally you have to pay unless you want to do it with shit proxy lists.\nCycling IDs, tho, is as easy as deleting a file.\n\n> [zeronetanon4](#comment_36_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): That's the crazy dude I was talking about lol.  As for your remarks on decentralization, all I can say on that is we probably can't rely on the decades old client-server model for system design.  My intuition tells me it can and will definitely work.  It will just need some fundamental changes to its approach vs traditional design.  Sometime this year I think I'm going to drop acid and think about this.\n\nPlease do. Maybe I'm too old fashioned on networking... or too sober to invent new protocols.",
				"added": 1565326220
			},
			{
				"comment_id": 5,
				"body": "I believe the admin of 08chan is implementing ZeroID certs, please check it out.\nI don't know if my bots are still being able to spam, they are still giving me green lights, but I don't know if it's actually going through.",
				"added": 1565326421
			},
			{
				"comment_id": 6,
				"body": "> [removeboomer](#comment_13_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): It's not like decentralization itself is a bad idea and it's probably going to be in high demand very soon, it's just really immature and up until a few years ago it was really obscure technology. There is a lot of room for improvement for zeronet (ahem browser python turbo bloat), but that doesn't mean a robust solution can't exist.We're currently on the first iteration of this technology, and with how crazy internet censorship is getting there is an increasing demand for censorship resistance.\n\nThe idea is great, but I don't know if it's actually doable.\nWell, like you said, we are on the first iteration, and like the internet itself was at the start, it's pretty fucking broken and everyone can shit everything up.\nLet's see where the future leads us, I will be there on every update to try to break everything and burn it to the ground lmao",
				"added": 1565326588
			},
			{
				"comment_id": 7,
				"body": "> [zeronetanon4](#comment_39_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): Its pretty impressive you were able to make something like that relatively quickly.  I started programming ~18 months ago with Python, I have a rough idea how you made some of it work.\n\nIt's a shitty quickly hacked together Python script that uses Selenium WebDriver to interact with the ZeroNet WebUI.\nIt opens up a slave Firefox browser, deletes the user identification files, runs a new ZeroNet instance, connects to 08chan, posts a thread, closes ZeroNet and does everything all over again on a loop.\nNow you open this shit 7 times on different WebUI ports and you have seven Firefox windows spamming ZeroNet with useless shit.\nEasy as fuck, anyone can do it.\nI tried to \"reverse engineer\" the chan's engine first to create new posts, but using Selenium was easier.",
				"added": 1565327130
			},
			{
				"comment_id": 8,
				"body": "> [btfo](#comment_3_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX): [...]\n\nOf course you can break captcha and use proxies... if you pay for it.\nHave you tried using free proxies for anything on 4chan? Captcha breaks because the proxy can't reach Google's servers, 4chan bans you instantly and it's slow as fuck.\nLike I said in 08chan, it's not just a macro because the script also does filesystem operations and controls multiple ZeroNet instances running, opening and closing in the background.\nAnd about the reverse engineering thing, that's why I put quotation marks in it, reverse engineering is not actual RE, it's just reading the code to see how it works, I was just too lazy to not do it so I used Selenium. If I had read it, though, I could just edit the user data and content JSON files and use ZeroNet to do a sitePublish on everything, it would be a lot faster and wouldn't need open Firefox instances.",
				"added": 1565352844
			},
			{
				"comment_id": 16,
				"body": "> [qf2ss4t5y3365](#comment_12_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B):  [...]\n\nIDs limit the flexibility of shills, but it also limits legit users who want to stay as anonymous as possible.\nSecurity is almost always a double edged sword, you just have to balance the consequences.",
				"added": 1565359350
			},
			{
				"comment_id": 17,
				"body": "> [btfo](#comment_5_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX):  [...]\n\nYeah, that's what I was saying, you have to pay for it, then it's doable.\nPeople don't seem to want to pay for it that often, though, else we would have spam every day on 4chan.\nAnd the macro thing is just nomenclature autism. If you don't want to use Firefox you can write your own Millchan content and data JSON generator and use ZeroNet-cli's sitePublish to manually publish it. It will still be kinda slow, since you have to wait for ZeroChan to generate a new certificate and push your changes to 5 peers (maybe 1 is enough? I don't know), but you can do what I did with Selenium and just open multiple instances or use multiprocessing to parallelize the script.",
				"added": 1565368345
			}
		],
		"1565346520_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 9,
				"body": "It's probably possible and would be a nice experiment for large websites.\nI don't think people would be willing to contribute 15-60 GB of space to it, though.",
				"added": 1565353597
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 10,
				"body": "Yeah, they captured IPs, so what? What will they do?\nIf anyone posts illegal shit on a normal imageboard, they can just use the government to force the admins to leak your IP.\nThey probably just fucking downloaded ZeroNet and opened up the statistics page to the right which shows location and number of peers.\nDon't panic for nothing.",
				"added": 1565356988
			},
			{
				"comment_id": 11,
				"body": "> [aim64c](#comment_12_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h):  [...]\nI don't know if you tried to explain NAT there, but yeah, people normally have dynamic IPs and to track those you would need a subpoena, and they won't do that just for accessing a ZeroNet website.\nI was the one spamming 08 btw, sorry for the trouble, I was just having some fun",
				"added": 1565357695
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_914_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The article pretty much stands behind ZeroNet on its privacy potential via tunneling. [...]\n\nThat's actually a problem. JavaScript can be used for some serious tracking shit, that's why Tor has a built-in feature to block everything JS related.",
				"added": 1565357764
			},
			{
				"comment_id": 13,
				"body": "> [aspidochelone](#comment_29_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I don't think it was Javascript.  NoScript only reports the one 127.0.0.1 script in Firefox, i.e. ZeroNet's own software.  I would assume that the reporters used a firewall or the like to monitor what real connections occur peer-to-peer (in Firefox developer tools it doesn't say, it's all 127.0.0.1). [...]\n\nNah, it wasn't JavaScript, you can track peers just using ZeroNet, it's a feature.\nPeople will just start using Tor for ZeroNet and hidden services if they start doing that kind of bullshit.\nIf you are going to post potentially illegal content, you should be using Tor anyways.",
				"added": 1565358793
			},
			{
				"comment_id": 18,
				"body": "> [btfo](#comment_7_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX): And it feels like the board has just 50 people posting max.Good job at catching the IPs of other fellow (((journalists))).And welcome to P2P, whats next? Copying the list of connected IPs when torrenting a movie and writing an article about it?\n\nOh they already do that, just search for any BT piracy related article lmao\nThe boomer journalists are fucking retarded",
				"added": 1565368548
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 14,
				"body": "Get the fuck out of ZeroNet, schizo.\nStop posting your retarded shit everywhere.",
				"added": 1565358854
			},
			{
				"comment_id": 15,
				"body": "> [trevorlaneray](#comment_6_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): I'm... not certain what exactly you're trying to say here... Could you clarify a bit?Being completely honest here: this post sounds like it was made by an AI.\n\nHe has been posting this retarded crap nonstop on the this website's 08ch thread.\nJust mute him.",
				"added": 1565359112
			},
			{
				"comment_id": 19,
				"body": "> [aim64c](#comment_20_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): True, a Zite would.  There again, as I said, this is getting a ton of attention it wasn't, before - especially among decentralized enthusiasts who like such things. [...]\nYeah, this is one of the best things about the 8chan ZeroNet \"raid\", it's popularizing new censorship-resistant tech.\nZeroNet feels like a young new internet right now, it's pretty comfy. I hope we can get some new features in the future to make this even better.",
				"added": 1565368784
			}
		]
	},
	"comment_vote": {}
}