{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1525574676,
			"title": "Организация хранения видео",
			"body": "KopyKate и прочее…\n\nЯ бы посоветовал как-то отделиться от KopyKate по темам. Типа, отдельно сериалы на русском, отдельно фильмы, отдельно прон всякий. А то уже сейчас на KopyKate каша и куча ненужного человеку мусора. А что завтра будет?",
			"added": 1525574675
		},
		{
			"topic_id": 1526954864,
			"title": "Timeless",
			"body": "Второй сезон Timeless в целом средненький, но последняя серия хорошая. Я не знал, что 10-я серия — последняя, так жена рвала и метала, требуя скачать продолжение :D\n\n![](/Me.ZeroNetwork.bit/merged-ZeroMe/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/data/users/1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ/1532262397.jpg)\n\nПо выходу третьего сезона новостей достоверных не нашёл, только огромный переполох фанатов в середине марта, когда решался вопрос быть продолжению или нет, но, кажется, третий сезон, таки, будет :)",
			"added": 1526954862
		},
		{
			"topic_id": 1532285327,
			"title": "Человек с Земли (The Man from Earth, 2007)",
			"body": "_фантастика, драма (США)_\n\nИмпровизированная прощальная вечеринка профессора стала загадкой после того, как учёный рассказывает своим коллегам, что он бессмертный, который ходит по земле уже 14000 лет...\n\n[![](https://gateway.ipfs.io/ipfs/QmW8zg9U9fuQS94wNcsWzD8vYqEweHur1d1CJcHwmBjkqe/Человек с Земли [The Man from Earth, 2007]-800x.jpg)](https://gateway.ipfs.io/ipfs/QmcVUCdsJRDSP8h3qzaptBFVGasgdJfGedFstnTWV2KK6H/Человек с Земли [The Man from Earth, 2007].jpg)\n\n- Рейтинг КиноПоиска: **7.75**\n- [Смотреть в ZeroNet онлайн](/1kino8s8jT8TfbW1kSMoNL4sqqu6kut28/?Video=1532284537_1PDgHdqhvPyVZrhVAumHcWp5pr4wPckcc6)",
			"added": 1532285324
		},
		{
			"topic_id": 1532340498,
			"title": "Архив YouTube",
			"body": "В клон KopyKate выложил весь свой YouTube-архив (плейлисты и лайки): \n\nhttp://127.0.0.1:43110/1videomkrGfLUNe2RaQJqbumb4nTgbp2J/\n\n460 видео на 23Гб\n\n![](https://gateway.ipfs.io/ipfs/QmaZ9MvEHXcdchCqBxXhNAFBCcaWBpwhGe71u5zmyj4fkB/2018-07-23_12-48-51.png)",
			"added": 1532340494
		},
		{
			"topic_id": 1535557951,
			"title": "Экспансия/Пространство (The Expanse, 2015—…)",
			"body": "Почему на форуме только то, что скачать можно? :) Хотя, может, кто-то и зальёт ещё в ZN и сабж. Вообще, обсуждение и анонсы я много писал в клирнете, но тут для поддержания продублирую свежую запись оттуда же.\n\n---\n\nПеречитал повторно «[Пожар Сиболы](/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1535557878-%20%20%204%20%20%20.fb2.zip)» (4-я книга серии Пространство/Экспансия). Беру свои слова назад, сериал по ней может выйти отличный. Там очень сериальный ритм. Только придумают, как спастись от ж..ы, как за ней приходит п..ц :) И так по нарастающей...",
			"added": 1535557946
		},
		{
			"topic_id": 1542116336,
			"title": "Мир Дикого Запада (Westworld, 2016)",
			"body": "> В футуристическом парке развлечений «Мир Дикого Запада» специально сконструированные андроиды выполняют любые прихоти посетителей, чтобы те чувствовали безнаказанность и полную свободу действий. Если робота убили — не беда, техники его починят, сотрут память и снова поставят в строй, навстречу новому дню и новым людским прихотям. Но оказывается, что далеко не все роботы теряют воспоминания.\n\nПока только начал смотреть (и продолжу пока не скоро по внешним обстоятельствам), но по первым двум сериям, сериал весьма достойный. Яркий, эмоциональный, философский. Роботам сочувствуешь куда больше, чем людям… Полноценнее отзыв напишу позже, когда досмотрю хотя бы первый сезон.",
			"added": 1542116330
		}
	],
	"topic_vote": {
		"1532278449_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1525165137_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ": [
			{
				"comment_id": 1,
				"body": "Что-то ничего не качается и не открывается :-/\n\nИ в ссылках ошибка порта по умолчанию — `43110` должно быть :)",
				"added": 1525419077
			}
		],
		"1526954864_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 2,
				"body": "О! Солидная работа :) Вручную или скриптом? Хранишь дублированием или по симлинкам?\n\n**Update**: я на пробу картинку из твоего ZeroMe в топикстарт вставил. Вроде, работает нормально :)",
				"added": 1532263029
			},
			{
				"comment_id": 4,
				"body": "> [rohn](#comment_4_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ): Скриптом (поделюсь позже, когда сделаю и создание нормальных названий/описаний)\n\nСкинь мне, я тоже чего-нибудь выложу :) Только надо на всякий случай с твинка…",
				"added": 1532264663
			}
		],
		"1532264071_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ": [
			{
				"comment_id": 3,
				"body": "Не знаю, что выкладывать («Игру престолов?» :D) — я всё, что мне интересно, итак смотрел.\n\nА вот на самом сайте с видео нужно ссылки сделать на обсуждения сериалов. Например, сюда, на форум.",
				"added": 1532264271
			},
			{
				"comment_id": 6,
				"body": "> [rohn](#comment_3_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ): У меня первый сезон в avi. Тогда mp4 ещё не был популярен. Надо перекачать в mp4.\n\nА на ЛостФильме, кстати, `mp4` для первых двух сезонов и нет :) Только `avi` в низком разрешении и `mkv` в FullHD. Так что надо пережимать будет.",
				"added": 1532267055
			},
			{
				"comment_id": 7,
				"body": "Я тоже попробовал выложить сериальчик. Но фигня какая-то. ZN никак не хочет файлы как опциональные цеплять. Почему-то все пытается прицепить как постоянные и обламывается на лимите размера сайта o_O",
				"added": 1532280462
			},
			{
				"comment_id": 11,
				"body": "> [iinhosin](#comment_2_1Gu5J44G3ur1Xnw2iZhZzHrgXUqrnHYbM3): у меня например не получается посмотреть тот же \"Пассажиры\"\n\nНе грузится или не играет? У меня ок. было всё. Из замеченных багов — ролик про РКН vs Телеграм не играется в сегодняшней ютубовской выгрузке. И я выложил «Человека с Земли» с ac3-звуком, а он не во всех браузерах играет. Надо будет перезалить (кстати, в плюс ZeroNet'у — можно подменять уже выложенное ранее с ошибкой и все ссылки всё равно живы будут :) )",
				"added": 1532355244
			},
			{
				"comment_id": 12,
				"body": "> [rohn](#comment_8_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ): А в клирнете есть …\n\nКак по мне, так всё просто. Видео у меня валяется дома. Зачем хомячить, когда его можно раздавать в ZN? :) Мне не жалко, кому-то полезно. И, главное, можно использовать для пропаганды ZN :)\n\nХочешь знакомому про новый фильм рассказать? С одной стороны — оставить его решать проблемы самому. Пусть ищет на куче вирусованных сайтов или разбирается с торрентами… С другой — даёшь ссылку на готовое кино в ZN. И только один, первый раз, расскажешь ему, что надо предварительно распаковать и запустить https://github.com/HelloZeroNet/ZeroNet-win/archive/dist/ZeroNet-win.zip :)",
				"added": 1532369735
			},
			{
				"comment_id": 17,
				"body": "http://127.0.0.1:43110/1tvshuFLkoockzDmvmgmoDoXYe7G6GWxL/ не работает. При чём по прямым ссылкам контент грузится, а главная страница — пустая. Что-то сломалось в коде.",
				"added": 1537316874
			},
			{
				"comment_id": 18,
				"body": "> [trooper](#comment_2_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe): тогда почему бы не выдкладывать торент файлы?\n\nТоррент — это много лишней возни. Скачивать торрент, скачивать фильм… Например, чтобы только оценить, будешь ты вообще его смотреть или нет? А в ZN можно сразу ткнуться и решить, будешь ты это смотреть или нет. И ничего качать не надо. Понятно, что под капотом оно имеет почти то же самое устройство, но юзабилити намного выше.",
				"added": 1537317097
			},
			{
				"comment_id": 19,
				"body": "> [dude](#comment_1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): А вот такого типа каталог http://127.0.0.1:43110/19QfvcAZQkS1rL6ycrFJaLMtmS3hqjULwF/ чтоб с картинками и прочим НО при этом играло в зеронете - возможно замутить?\n\nНу так, вот, Rohn со товарищи как раз что-то подобное и задумал:\n\nhttp://127.0.0.1:43110/1kino8s8jT8TfbW1kSMoNL4sqqu6kut28/\n\nИли предыдущая ссылка (сломавшаяся) на сериалы. Хотя я не уверен, что в нынешней реализации KopiKate удобно всё в кучу кидать в случае сериалов, ИМХО, лучше делать клоны, один сериал = один сайт. А сводить сайты в кучу на один форум или Wiki с каталогом сериалов.\n\nТолько пока народа мало и код KopiKate кривоват, но лиха беда начало.",
				"added": 1537317283
			}
		],
		"1532265682_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ": [
			{
				"comment_id": 5,
				"body": "Ты монстр :D\n\nТолько картинку лучше после текста — тогда сниппет топика будет с текстом, а не с кодом картинки.",
				"added": 1532265833
			}
		],
		"1532285327_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 8,
				"body": "Ну, вот, и я в деле :)",
				"added": 1532285389
			},
			{
				"comment_id": 9,
				"body": "Бюджет фильма всего $200k :) Практически всё действие — в одной комнате. Тем не менее, оторваться от фильма почти невозможно. Профессор готовится к переезду на новое место жительства. Его пришли проводить немногочисленные коллеги и знакомые. И, вот, в праздном разговоре и шутках, начинает вскрываться история длиной 14 тысяч лет...\n\nОчень интеллектуальное, психологическое кино. Один из лучших фильмов последнего десятилетия.",
				"added": 1532285617
			},
			{
				"comment_id": 14,
				"body": "Звук исправлен. Хотя там две звуковых дорожки (RU+EN) и непонятно, как в браузере их выбирать. Но играет по умолчанию первая, русская.",
				"added": 1536754670
			}
		],
		"1532278449_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ": [
			{
				"comment_id": 10,
				"body": "> [iinhosin](#comment_1_1Gu5J44G3ur1Xnw2iZhZzHrgXUqrnHYbM3): Отличный фильм кстати\n\nДа, плюсую. Не без косяков, но смотреть интересно и идея хорошая :)",
				"added": 1532341998
			}
		],
		"1535557951_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 13,
				"body": "*«Си́бола — деревня Шумского сельского поселения Кировского района Ленинградской области. Расположена у железнодорожной станции Войбокало. Впервые упоминается в Переписной окладной книге 1500 года»* :)",
				"added": 1535557965
			}
		],
		"1536950008_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ": [
			{
				"comment_id": 15,
				"body": "Спасибо за выкладывание, я не знал, что фильм уже появился в нормальном виде :) Посмотрел.\n\nИМХО, низкие оценки — типичное разочарование от не оправдавшихся ожиданий после книги. В какой-то мере мне проще, потому что я с какого-то момента не только научился абстрагироваться от книг, но и находить определённое удовольствие в неожиданностях. Ну, в самом деле, если фильм сделан в точности по книге, то ты наперёд знаешь всё и смотреть уже не так интересно. Отход же от исходного варианта делает ситуацию непредсказуемой и может порождать сюрпризы. Хорошие или нет — другой разговор. Но скучно уже не будет :D\n\nС «Черновиком» было ещё проще. Изначально было озвучено, что с книгой будет мало общего, так что я ожидал ещё худшего. Оказалось к варианту Лукьяненко фильм, всё же, ближе, чем заявлялось. Да, конечно, атмосфера поменялась целиком, основную идею перекроили (интересно, как будут выкручиваться во втором фильме). Но основные сюжетные повороты остались теми же.\n\nЕсли заранее выключить книжные ожидания и не страдать антикоммунофобией (что с «Васей» сделали — это песец!), то фильм смотреть можно. Где-то на грань четвёрки натянуть можно :) Пересматривать в одиночку не потянет, но пересмотреть, показывая друзьям — можно.",
				"added": 1536956585
			},
			{
				"comment_id": 16,
				"body": "> [rohn](#comment_9_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ): Говно какое-то сделали. От книги ничего не осталось.\n\nСпёр у тебя афишу :) Не уверен, что хорошая идея грузить её через прокси — прокси может сдохнуть.",
				"added": 1536957601
			}
		]
	},
	"comment_vote": {}
}