{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1569844265,
			"title": "Consider Ring Signatures on ZeroNet",
			"body": "This topic is a duplicate from anonymouslogin's for when it gets wiped.\n> Some people share their credential so they can act anonymously. Such as using this account \"anonymouslogin@zeroid.bit\". So others cannot tell which physical person published the content. But others using the same credential can easily \"delete\" their content.\n> How about using untraceable ring signature to protect the anonymity of ZeroNet user? Or at that time we can hardly tolerant spam?",
			"added": 1569844264
		},
		{
			"topic_id": 1574368389,
			"title": "Valve is releasing a new Half-Life game (NOT 3)",
			"body": "Trailer here: https://youtu.be/O2W0N3uKXmo",
			"added": 1574368387
		},
		{
			"topic_id": 1588386916,
			"title": "Where is Sorasumi Sayo now?",
			"body": "This post was moved [to my personal blog](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:19:Where+is+Sorasumi+Sayo+now+)",
			"added": 1588386913
		},
		{
			"topic_id": 1588786000,
			"title": "Why I Use Git Center",
			"body": "A comment by merithtk on another thread made me think about why I host most of my projects solely on Git Center, something I will probably write a more in-depth defense of on my blog when I find the time.\n\n[Git Center](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/) is missing a lot of features that Gitlab and Github have to offer. I even maintain projects on Gitlab every day and many of the projects that I use are only available on Github, and yet I don't really miss any of the extra features they have to offer.\n\nOne of the reasons for that is that my projects on ZeroNet are solo projects. Either I started them and barely anyone ever contributes to them, or I took them over from someone else. If I had to work full-time with a team on a project I'd be unlikely to use Git Center. But that said even for teamwork I don't use a lot of the workflow features Gitlab has to offer because other (non-integrated) services just do them that much better. I won't get into the details here, but the takeaway is that this is really not a big deal.\nIf checking out and pushing to a repo was as easy as `git clone zero://1ZER0NETAddRESS` instead of `path_to_zeronet_folder/data/1ZER0NETAddRESS`, and if using those repos was as easy as `pm_of_your_choice install zero://AddRESS`, I don't think I'd find much hinder to my workflow **at all**, even when working with a team.\n\nWhat makes me stick to Git Center is the knowledge that *if I die tomorrow my projects will be there until no one cares about them anymore*, (even if that is tomorrow).\n\n- Self-hosting would stop when my computer is turned of.\n- My droplet will dry out together with the credits I've topped up.\n- And with centralized services it all depends on the whims of the corporation and the people influencing them (governments, big money, media, activists).\n\nI don't know what the future of the internet looks like, but we *will* see repositories disappear one way or another. And with that in mind I'd rather trust a bunch of Guy Fawkes mask wearing randos with my pet projects than Bill Gates and Xi Jing Ping.",
			"added": 1588785996
		},
		{
			"topic_id": 1593090212,
			"title": "Looking for Open Source Hardware vendors",
			"body": "I've got a stack of Raspberry Pi's and they're great, but I'm looking to buy/build a home server that's a little more powerful.\n\nSpecifications:\n- Processor with more than 4 cores, but I can live with 4 if more isn't available.\n- Processor speed isn't as important, I will be using it to test multi-threaded applications.\n- Has/supports at least 16GB RAM\n- Supports internal (i.e. SATA) hard drives and RAID\n- Multiple ethernet ports is a plus.\n- Don't care about graphics, audio, wireless, etc. support, it's a server.\n- **100% Open Source Hardware** is important to me :-)\n\nAny suggestions are appreciated, I don't care whether it's RISC-V, ARM, x86 or any other architecture, as long as [Rust can compile to it](https://forge.rust-lang.org/release/platform-support.html)",
			"added": 1593090207
		},
		{
			"topic_id": 1610364210,
			"title": "On the Scalability of ZeroNet and Zites",
			"body": "I've seen some questions here on ZeroTalk about this topic so I wrote a new blog post to help fresh arrivals understand ZeroNet a bit better. You may also want to check out some of the older posts. http://127.0.0.1:43110/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:18:The+Scalability+of+ZeroNet+and+Zites",
			"added": 1610364204
		}
	],
	"topic_vote": {
		"1564755065_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1564689117_1A4B6vo5EbmJtnNEkRxoWuG2t9PGHqLFc9": 1,
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"1565795636_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565784755_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1566439997_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1566538598_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1567951156_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"1569810770_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1571689463_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1571737687_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": 1,
		"1571938147_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1573438999_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1573531510_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1573489058_1A28dH9xcZvxsypUo7kx3eZ61vWNjw5tS5": 1,
		"1573463079_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1574368062_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1577617777_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": 1,
		"1583969906_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": 1,
		"1576021217_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1584797417_16yxmFzgPzF4SGiAQi9qY3ev6aSQzv3tb": 1,
		"1588038592_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1588179678_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1589343359_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1589756609_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1589664235_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"1592264885_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1592777145_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1592851726_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": 1,
		"1577776813_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1593271955_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1598912261_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": 1,
		"1598827107_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": 1,
		"1598171709_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1602774304_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"1602785059_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1
	},
	"next_comment_id": 178,
	"comment": {
		"1564755065_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 1,
				"body": "[Ansho Rei | Bridging the Gap in P2P](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:2:Bridging+the+Gap+in+P2P)",
				"added": 1564773717
			}
		],
		"1565109461_1GCRFuF1HrEdifYfPP69zaKxoJkwUMeZcU": [
			{
				"comment_id": 2,
				"body": "if you're on linux and mac you need to take extra steps [ZeroDocs](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/faq/#how-to-make-zeronet-work-with-tor-under-linuxmacos)\non windows it should be included by default",
				"added": 1565114835
			}
		],
		"1565145631_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 3,
				"body": "It's minified to save bandwidth and improve loading speeds. That's a standard javascript practice. It's not as important for zites on ZN because the js is only downloaded once and after that the scripts are loaded locally, but it's nothing to get paranoid about. You can either look at the file using a beautifier, or look at the source.",
				"added": 1565162769
			}
		],
		"1565144688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Well, there goes our cozy corner.",
				"added": 1565163272
			}
		],
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 5,
				"body": "@styromaniac: I doubt it downloads thumbs hovering over boards, don't you mean hovering over threads in the recent threads list? You can disable this behavior in the settings (which should probably be default)\n\n@theosis: MOAB is styro's Mother Of All Blocklists",
				"added": 1565194029
			},
			{
				"comment_id": 6,
				"body": "[MOAB](/1LgqZfbtr6dukbjHdjWBEmmthq1shEv3y1)\n\n@mfs: the little notifier says \"Publishing content to x peers\" and that's quite literal. It's the file content.json that describes the content you're making available for that zite. Actually transferring the content listed there happens in the back when someone asks for it. Optional and required are used by peers to know whether they should immediately request the file (eg. a data file containing your messages) or wait until they need it (eg. the user clicked the image, or visited the page).",
				"added": 1565194509
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_877_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd):  a way to *forward hash site addresses* and use those forward hashes instead of actual addresses in the blocklist\n\nWhat do you mean by this?",
				"added": 1565194772
			}
		],
		"1565305639_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "> [masterik](#comment_8_1LFedFTgmtHTfqqMRd4euD7BrVQBzatZUi): \n\nNo, he's been around for at least half a year under that username. Tends to shout a lot :-)",
				"added": 1565306171
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "\\> On peer-to-peer site ZeroNet\n\\> site\n\ntech literacy 0/10\n\nffs, it even has **Net** in the motherffin name\n\nI've explained why a lot about the things being said in these articles are wrong in my [blog post](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:5), for anyone who's curious.",
				"added": 1565306596
			},
			{
				"comment_id": 10,
				"body": "I've just read the article in the OP, and it's really nothing more than a smear piece. I read through the thread they're talking about and it's hilarious they talked about that single thread for almost a *third of the article*. The article isn't very interesting, they barely talk about any of the technical stuff, it's mostly just “8Chan bad, 8Chan now on ZeroNet, ZeroNet bad too” with more vocabulary.",
				"added": 1565309096
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_911_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I take it more like she doesn't know how to handle these subjects in a non-damning way.\n\nThe way I see it you should either stick to reporting the facts, or set out to build a solid argument supporting your opinion. She does neither. She starts with a couple of facts, then mixes in some feelings and because her article wasn't long enough yet she then clicked a couple of random threads and inserted some excerpts. It's sad that's the state of journalism. How often do you come across articles these days that have a third of their length padded with random tweets?",
				"added": 1565310458
			},
			{
				"comment_id": 12,
				"body": "> [aspidochelone](#comment_15_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): What's the blocklist, who controls it, and how long is it going to take for a court to order them to block everybody?\n\n- Blocklists are made by individuals and aren't capable of banning any person, zite or content from the network. As the network and it's users grows we'll likely be seeing community run blocklists.\n- Users themselves choose which blocklists they enable\n- Users can choose to overwrite decisions made by the blocklist if they wish “Yes I know this site is blocked, download it anyway\" and there is no way to enforce them on the network. People could refuse to update to the clients that enforce them, or just start their own fork of ZN.\n- Users can remove a blocklist if they disagree with the decisions made by the owner(s) in who to block/unblock. This means there will be competition between blocklist owners, hopefully leading to quality blocklists.",
				"added": 1565357683
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 13,
				"body": "> [aim64c](#comment_17_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): No, it's just a bit of a bug on the board at the moment.  The board owner published an update after we got spammed, and it doesn't seem to work as well as he thought it did before he either went to work or to sleep.  So, it will be a bit of a hiccup.  If it's not resolved by time the weekend is over, I'll get a board going over the week.\n\nIf you make a board, it's probably best to make a Millchan Engine board.\n\n> [trevorlaneray](#comment_11_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Ehh, I'm not a boomer, but I am pretty new to this.I went ahead and enabled \"Tor: Always\" almost immediately after starting.Am I doing it right? >.<\n\nUsing Tor is probably your best option. I'm not using Tor Always mode, but I tend to stick to ZeroTalk, ZeroMe and people's blogs and I'm not too worried about doxxing. If you're hosting a zite that could make you a target for internet vigilantes it's probably best to enforce Tor and maybe disallow 3rd party scripts (or use TBB, though you'll have the white image bug on some zites like ZeroMe). \nPeople have said for a long time that Tor Always should be default behavior, and I agree. It's one of the things that makes ZeroNet difficult for tech-illiterate people and could result in poor trust.",
				"added": 1565369442
			},
			{
				"comment_id": 17,
				"body": "> [chinchin](#comment_12_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im): Does using Tor Always also make using a normal browser with Zeronet anonymous or does it only work with the TBB?\n\nTor Always anonymizes all connections made by ZeroNet, there's a couple of deanonymization techniques that could still be used:\n1. A malicious zite could have javascript in it that makes a clearnet connection, leaking your IP. On top of that it could also send information about what ID you're using. (ie. just like on the normal internet, don't blindly trust websites).\n2. A zite could include an image with `src=\"clearnet address\"`, that address could be harvesting IP's.\n3. Clicking on a clearnet link could lead to a page that collects IPs.\n\nNote: Some zites use clearnet connections for valid purposes though: ZeroID makes a clearnet connection when you make a new ID to prevent spam (though you can use TBB no problem)",
				"added": 1565372952
			},
			{
				"comment_id": 18,
				"body": "> [nickwa](#comment_274_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): What's TBB?\n\nIt's the Tor Browser Bundle.",
				"added": 1565379186
			},
			{
				"comment_id": 19,
				"body": "> [bigbadbob](#comment_116_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): im probably the most technically retarded person on the face of the planet.everything seems fine.    on debian so i gotta type \"sudo python3 zeronet.py\"i got green lights with no warnings.\n\nI hope you're joking. Sudo is not required for ZN at all. If it isn't working without sudo, try chown-ing your zeronet folder recursively to your user. Maybe you copied some lingering file permission settings from your old installation.",
				"added": 1565393778
			},
			{
				"comment_id": 20,
				"body": "> [bigbadbob](#comment_119_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): cool...  im learning.   im gonna have to dive in deeper.   Ive got recent version of zeronet.     i was reading something about backing up the folder or just the file.   I figured to whole folder made sence.\nSome people like to backup their whole data folder to have a kind of snapshot of what ZeroNet looked like at that moment of time. But usually you'll be fine backing up your users.json file. This will allow you to restore your ID's, as well as the keys to owned zites. I recommend keeping it somewhere safe. It's also best to put ZeroNet on an encrypted harddrive, that way someone with physical access to your device can't steal your keys (as long as you don't leave it unlocked)",
				"added": 1565394134
			},
			{
				"comment_id": 21,
				"body": "BTL sounds like it could be BitTorrent related. Never had module like that missing on Ubuntu or Debian though.",
				"added": 1565456450
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 14,
				"body": "I've only read about 50% of this thread, and unfortunately don't have enough time to go through the rest, but I'll throw my two cents into the conversation.\n\n> If nofish dies, ZeroNet dies.\n\nFalse. 1. Nofish isn't the only dev who contributes to ZN. 2. Even if development stops, ZN will still function. 3. There's some devs here on ZN who would be willing to put in some time working on it if necessary (myself included).\n\n> ZeroTalk limit of 50Kb. Nofish is the only person who can increase that.\n\nYup, it's a thing. You may not like, I for sure don't. But it's there for a good reason, it prevents ids from spamming too much.\nCorrect me if I'm wrong, but I believe nofish has automated the limit increasing. I believe it's a script that he's running that automatically increases the limits for people when they reach close to their limit if they're not spamming. I've heard from some people that their limit was increased without ever bothering him. (And as a dev I think it'd be a waste of time not to automate such a thing.)\n\n> ZeroNet is centralized.\n\nZeroNet isn't. ZeroNet allows you to build centralized things on top of it. That's what ZeroID and others like it are. KaffieID is decentralized IIRC, and it would be nice if more zites allowed you to use it, but it's also confusing because it allows username overlap.\nThe problem of trackers being a bottleneck and weak point of the network is a really good one. It's something that could be solved, but it just hasn't yet. This is mostly because it hasn't been necessary so far.",
				"added": 1565370612
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 15,
				"body": "I, for one, support the Chinese government with all of my heart.\n\nThe CCP It's the government of the future and we'd all better get used to it :-)",
				"added": 1565370801
			}
		],
		"1565339384_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU": [
			{
				"comment_id": 16,
				"body": "> [kaffie](#comment_935_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Wow zerotalk supports kxoid? wtf kind of strings did he pull to get nofish to go along with that?\n\nI'm still bitter about KXO burning the land behind him when he left. It was pathetic. Have you ever asked nofish whether he'd agree to add KaffieID? I know it's kind of a different think because of the lack of unique ID's though.",
				"added": 1565371039
			}
		],
		"1565627986_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 22,
				"body": "1. users.json\n2. there's no reset and never will BUT it is possible old sites will stop working with new clients, or browsers (although they can still be downloaded). This is not really all that different from the normal web though.\n3. data is stored unencrypted on your harddrive, but only what you download yourself (you're not hosting random data to help the network). If you have anything to fear from your local government it's recommended you encrypt your harddrives.\n4. Yes. ZeroNet does this using bitcoin keypairs.\n5. Yes, automatically updating sites is something that has been done before. You can do so using any language you like, but you'll have to send commands to your OS to have ZeroNet sign and publish the content.\n6. There's no ZeroCoins. Advertising is done however you like. 0list is a pretty good way. ZeroSites gets flooded quick. Talk to people who care.\n7. Not really.",
				"added": 1565631028
			}
		],
		"1565777168_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 23,
				"body": "Physical exercise is currently on hold for me, but even so I'm still cycling at least 1h per day. It's a good time to think about what I want to write or develop.",
				"added": 1565800257
			}
		],
		"1565784755_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 24,
				"body": "ZeroTalk does archiving (look at `ZeroNet/data/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/content.json`), I'm honestly not sure how it works though, so I hope someone else can explain.",
				"added": 1565800780
			}
		],
		"1565729654_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 25,
				"body": "I don't think this really matters, I've used ZeroNet over dynamic IP and it works. Maybe he's talking about something else though.",
				"added": 1565813138
			}
		],
		"1565811143_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 26,
				"body": "No they are not notified and there is no way for them to find out who's muted them because muting happens on the client's side (your client refuses to accept content signed by them)\n\nRomanes eunt domus.",
				"added": 1565813466
			}
		],
		"1565689573_1JjyvqhjWDqSncWvSoGxAGKr4SNXr1Kwpi": [
			{
				"comment_id": 27,
				"body": "Apolitical, and users are free to have, share and discuss their views.",
				"added": 1565813750
			}
		],
		"1566216762_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 28,
				"body": "It's pretty annoying to have to scroll down and then up to read a thread.",
				"added": 1566237013
			}
		],
		"1566264907_1N2oRUnvobrYC1LQPEeVujC7oucRX7AG7X": [
			{
				"comment_id": 29,
				"body": "[ZeroNet in the Eyes of the Media](http://localhost:43110/1NEwsvyrAoEWU64ZozwdfgEUQhwxiCrh1t)",
				"added": 1566345147
			}
		],
		"1566370370_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 30,
				"body": "No, but the baby is fucked either way.",
				"added": 1566410645
			}
		],
		"1566455555_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 31,
				"body": "Is ZewoNet the lisp implementation of ZeroNet?",
				"added": 1566542965
			}
		],
		"1566538598_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 32,
				"body": "Most westerners think the government is good and want more of it.\n\nI could be wrong, but weren't a lot of the RetroShare devs russian too? At least every time I've been to a talk about it, it's been by slav blokes.",
				"added": 1566543167
			}
		],
		"1562911609_1ByEFvdTMnxu7oCEKWA46ZuGVBjPXvigL1": [
			{
				"comment_id": 33,
				"body": "@symoned, you can share your cert between computers easily with ZN, if you want.",
				"added": 1566543277
			}
		],
		"1566529885_1DjQ1faejBVMQsW9m4aHLSDiH2PUYKVQN2": [
			{
				"comment_id": 34,
				"body": "ZeroSites is hard to search, http://localhost:43110/1FEH3VjjKoDTXSpUA1G4xpB7WFnfQ48oVC/ allows you to search it easily",
				"added": 1566543403
			}
		],
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 35,
				"body": "I haven't been able to read all of it yet, but so far it's been very interesting and I look forward to reading the rest and responding.",
				"added": 1566673228
			}
		],
		"1566919791_1NTzrNqTPmBWChMJhhiPNZFh3FR1Yo7tx5": [
			{
				"comment_id": 36,
				"body": "@nofish: Feature request: auto-cut titles on ZeroNet to an arbitrary length to be agreed upon to prevent such spam from disturbing the frontpage.\n@yesyesyesyes: thank you for discovering this weakness.",
				"added": 1566925791
			}
		],
		"1566939301_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 37,
				"body": "> [aspidochelone](#comment_151_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): You ever try to run a PowerPoint presentation that was saved in LibreOffice?  Microsoft has special, secret ways to try to punish you for your blasphemy. [...]\n\nI’ve had some success using WPS when LO/OO compatibility with M$ failed me. GD also seems to do pretty well, although I refuse to use their evil data stealing services in my private life.",
				"added": 1566972656
			}
		],
		"1567159417_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 38,
				"body": "How do I install peermessage with the new plugin system?",
				"added": 1567163204
			}
		],
		"1567166183_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 39,
				"body": "> [gitcenter](#comment_835_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Looks like \"Network full\" means that, uh, ZeroNet network is full [...]\n\nIt's not really about the Network, it's the ZeroID certificate requests specifically that were rate-limited. I.e. the network became read-only for newcomers until the congestion was over.",
				"added": 1567189042
			}
		],
		"1566425767_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 40,
				"body": "Don't forget about atom.",
				"added": 1567189410
			}
		],
		"1567752163_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 41,
				"body": "I wrote about it on my [blog](http://127.0.0.1:43110/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:6:ZeroNet,+Bitcoin+Cryptography+and+a+consideration+of+different+ICA/DNS+systems+within+the+network)\nWhat you're looking for is called [vanitygen](https://github.com/samr7/vanitygen) (clearnet)",
				"added": 1567753281
			}
		],
		"1568213753_1HnepkYQUYxzgLMr1SYhWURoR2vs9NENFL": [
			{
				"comment_id": 42,
				"body": "ZeroBlog++ is the best feature-wise, and it's compatible with ZeroBlog. Owner left some important issues open sadly (like saving drafts).",
				"added": 1568227253
			}
		],
		"1568136294_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 43,
				"body": "Mostly they don't know about ZeroNet yet, and those that do are too to lazy spam us. It's true that you need more understanding of how ZeroNet works to spam than you would for mastodon. It should still be pretty easy though, so there must be other factors as well.",
				"added": 1568274572
			}
		],
		"1568027367_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 44,
				"body": "> [xcape2net](#comment_374_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I created ZeroTalkTech a few weeks ago, hoping it would turn into something like what I am looking for, but hardly anyone goes there.\nThat's a pretty nice collection of articles.",
				"added": 1568274765
			}
		],
		"1568508391_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 45,
				"body": "buy a raspberry pi, plug in the ethernet. install raspbian (with screen attached) and allow ssh. apt get python3 and other required tools then download zeronet. set ui_address in the conf to the lan ip (best to set a fixed local ip for the rasbpi)",
				"added": 1568560375
			}
		],
		"1568607154_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 46,
				"body": "If you'd like to limit bandwidth, you could wrap your program into something like trickle (`sudo apt install trickle`, then `trickle -u [upload bandwidth] -d [download bandwidth] [application]`). You can use this to limit your weekly maximum as well, just realize that this means you'll be limiting the speed at which other nodes can download from yours. If you're going this route and you're not expecting your node to upload at max bandwidth 24/7, I'd recommend setting the limit in trickle a bit higher so your fellow ZeroNetters can enjoy a better user experience.\n\n*BEWARE:* I haven't tested whether this also works when using ZeroNet over Tor.",
				"added": 1568718821
			}
		],
		"1569833026_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 47,
				"body": "I've duped it here so it doesn't go down: http://localhost:43110/Talk.ZeroNetwork.bit/?Topic:1569844265_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS/Consider+Ring+Signatures+on+ZeroNet",
				"added": 1569844298
			}
		],
		"1570935984_149NKX715zpvjyRaoR7ZdVKMDQ9BQ7kj5s": [
			{
				"comment_id": 48,
				"body": "Let's take a step back and try to find out what went wrong. For this I'll be making the following assumptions:\n\n1) She was armed, likely thinking the people outside her house were burglars. A reasonable response to flashlights in your backyard I'd say. This seems likely to me because a gun was found close to her body according to several of the reports.\n\n2) The neighbor had mentioned an open door in his call to the police and also that he had not heard shouting or other signs of a struggle. The officers who were dispatched did not receive their information directly from the neighbor, but from an intermediary deskplant. The information they received indicated a possible break-in had occurred and that (potentially armed) burglars were still inside.\n\nThese two need to be taken into consideration before jumping on the \"police evil\" or \"police hate black people\" bandwagon. If there is so far no indication of evil, nor racism, what are we looking at?\n\n# Incompetence.\n\nIt's very well possible that the first part of the problem occurred when the situation was miscommunicated to the officers on duty: the neighbor called about an open door in the context of neglect (a ridiculous state of affairs when neighbors do such a thing, but let's not dwell on that). Somewhere along the way however, as in a game of Chinese whispers, the police may have arrived at the scene with a completely different idea of the situation at hand. From there on things only got worse for the victim. I have no proof for this, but I imagine the first thing she did when she noticed people were lurking around the house was pick up her gun and try to get a better look at what was going on, possibly with her gun drawn. The police officers at her house were clearly not well-trained and not fit to do their duty - an occurrence far too common in the USA. They should obviously have ID'd themselves and given the victim more time to process their orders before even thinking of shooting! That however does not say anything about their character as human beings, that speaks of an institutional problem, and no, not a racist one, at least not with the evidence in this case so far.\n\nThis is truly a sad story. In my mind however, what we should take from this (at least with the evidence that has been released so far) is that we need to **set the bar higher for police**, not only on the street, **but also off**: as I stated before, even though the officer who shot was at fault **legally**, it's very well possible that the person(s) sitting behind a desk who sent them out there with misleading information is just as much to blame as him (if that is indeed what happened).\n\nOf course this take on the story does not make for good headlines, so the media will steer clear of it.\n\nAs always: Feel free to point out if there is evidence I've missed in this assessment, or if you think my reasoning is erroneous.",
				"added": 1571073818
			}
		],
		"1571344199_198XrgRCdJ2suDf2sg3aMJx69qpYTzXDXZ": [
			{
				"comment_id": 49,
				"body": ">  buut zeronet uses trackers to detect peers soo its not fully decentralized\njust wait until we have DHT!",
				"added": 1571385131
			}
		],
		"1571737687_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 50,
				"body": "> The app is built on top of Retroshare\n\nSweet, finally people are realizing how powerful that network can be. I dream of combining ZeroNet with RetroShare and IPFS. ZeroNet for websites and things that are open to the public. RetroShare for things that are private. IPFS to easily share content.\n\nLet's also take some time to laugh at the article:\n\nThe developers are, according to Medrano,\n\n> very intelligent and technically informed, like programmers\n\nduh.",
				"added": 1571746684
			}
		],
		"1571689463_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 51,
				"body": "i2p is mostly like the traditional internet with an anonymization layer on top in the vein of Tor, but better, particularly for bittorrent-style application (like ZeroNet), in itself it's not particularly interesting to me, but I do run RetroShare over it.\n\nIPFS is good for static content, again not so interesting in itself, but good to be used together with other things. Websites can use ipfsjs to serve static content through it.\n\nRetroShare is good for private content, it has p2p e-mail, forums, etc. but not able to do public things. I use it with friends and family instead of normal emails and chat. Could really do with a better interface. Excited about the whole Tsunami Democratic thing in Catalonia, looks like this may help RetroShare rise to fame. If they could now host their website on ZeroNet as well to prevent it from being censored as happened during the Catalonian votes, that would really be awesome.\n\nNone of these are in competition with each other. Tor and I2P kind of are. As are RetroShare and GnuNet. ZeroNet could be seen as a competitor of Freenet, but they're really different in concept so I'd say it's a bad comparison.",
				"added": 1571747827
			}
		],
		"1571760514_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 52,
				"body": "> it was fun back then\n> Socialist dreamers?\n\nThere's no reason you can't have fun with computers while undermining socialism.",
				"added": 1571765756
			}
		],
		"1571504923_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 53,
				"body": "> And their false hopes in hosting on github have hit reality, https://github.com/tsunamidemocratic-clon/tsunamidemocratic-clon.github.io\n\nsomeone should tell them about Git Center",
				"added": 1571847094
			}
		],
		"1571981535_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 54,
				"body": "> What would the legal ramifications be? You did not willingly download said content,\nIf you were to come across cp on any clearnet website, your computer could have a cached copy of that file. From a technical perspective this would be very similar: unwitting download of illegal content. I don't know anything about law, but I doubt this is going to be the issue.\n\n> you are not willingly distributing said content.\nAnd that's where we get into interesting territory. The owner of a server is only liable if they don't remove the content within x hours of it being reported to them (this depends on the country), in Germany I believe this is now 1 or 2 hours (which is ridiculous, this means being asleep while a criminal posts to your clearnet forum could land you in prison).\n\nDoes the same apply to peers in a decentralized web? There's no legal precedent yet AFAIK.\n\n> the procurement of an expert witness the court is inclined to listen to who can testify on your behalf would be essential\nThis. Courts don't understand technology, and there's no chance in hell that's going to be any different with revolutionary technology such as ZN.",
				"added": 1572021032
			}
		],
		"1571938147_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 55,
				"body": "Hey Cheapskate,\n\nI hope you don't mind I mirrored your previous blogpost: [ZeroNet and The Future of The Internet](/1NEwsvyrAoEWU64ZozwdfgEUQhwxiCrh1t/?!/article:2019-08-05-cheapskatesguide-future-of-the-internet/) on my ZeroNet news aggregation site, I will do the same for this new post. If you can post the ZeroNet address of your blog I'll add a link to the site.",
				"added": 1572021230
			},
			{
				"comment_id": 56,
				"body": "> However, please do provide a link to https://cheapskatesguide.org. Thanks.\nDone.\n\nThe goal of the site is to be an archive of articles, events and (selective) blog posts written about ZeroNet. Some of the articles I've added are already no longer available on the clearnet.",
				"added": 1572029360
			}
		],
		"1572281710_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 57,
				"body": "> [swashbuckler](#comment_19_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): [...] how do you even manage to step upon such sites [...]\n\nRight now there's not much risk of it, but at some point some crazy person is bound to try rickrolling people with links to such sites. Just think back to the days of \"2 girls 1 cup\", goatse.cx, the icepick one or any of a hundred other unsavory viral memes.\nIt's best to be prepared.",
				"added": 1572283962
			}
		],
		"1573438999_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 58,
				"body": "> [styromaniac](#comment_1217_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): P2P software on a mesh would be way faster than 5-10mbps. You could reach  multi-gigabit speeds with current WiFi standards.\n\n100mbps, sure, but gigabit?",
				"added": 1573583177
			},
			{
				"comment_id": 61,
				"body": "> [styromaniac](#comment_1231_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): WiFi AC goes up to 866Mbps/2 (divided by 2 for up and down speeds). [...]\n\nBut in a meshnet you'd have to take falloff into account and interference in places with many signals and devices, and your overall connection speed will depend on the slowest node you have to pass through.\n\nDon't get me wrong, I'm very excited about the idea, but it's not all rainbow and sunshine.",
				"added": 1573594315
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 59,
				"body": "You could always try Betterhelp(TM), Google assures me it's good.",
				"added": 1573583379
			}
		],
		"1573463079_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 60,
				"body": "I did some tests with Facebook, if you post the name Eric Ciaramella your post is removed. However if you post something without the name in it and then afterwards edit the name in, they don't remove it...",
				"added": 1573583541
			}
		],
		"1574259710_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 62,
				"body": "THEY LIVE",
				"added": 1574368081
			}
		],
		"1574434941_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 63,
				"body": "ZeroNet isn't supposed to do anything. ZeroNet is a tool giving the people who want to do something the power to do so, even if that's against the wishes of their overlords.",
				"added": 1574542404
			}
		],
		"1574812694_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 64,
				"body": "> [edgelordofdecent](#comment_282_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Duende made a kill yourself thread. I thpught he would onpy leave comments.\n\nWho ought to congratulate him for his effort.",
				"added": 1574838654
			}
		],
		"1574821349_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 65,
				"body": "> [fke13](#comment_4_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): You might ask Yourself, why are You complaining about that on ZeroNet in stead of complaining about that on Dat? My guess is, due to the technical reasons, the Dat \"failed to get traction\" even within techno-skillful hactivists like You.  [...]\n\nYou make good points, and I'd like to add one more as to why ZeroNet is better. In Dat, hosting content has to be manually opted into (by \"bookmarking\" the site) while here on ZN it's manually opted out of. There have been several discussions here on ZTalk as to whether that should stay this way due to concerns of hosting unwanted content, but for a growing network it's really important that content is kept available, and opt-out with blocklists is IMHO superior.",
				"added": 1574839110
			}
		],
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 66,
				"body": "Huh, Gab is more like Tumblr than I thought.",
				"added": 1575752975
			}
		],
		"1576322123_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 67,
				"body": "I'm running LokiNet on my pc, it's not really a ZeroNet alternative, it's more like a Tor/I2P alternative with cryptocurrency incentives for sharing bandwidth. This means you could actually run ZeroNet over LokiNet if you wanted.",
				"added": 1577319045
			}
		],
		"1577218342_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 68,
				"body": "When using ZeroNet over Tor you should not have any issues with ports.",
				"added": 1577319283
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 69,
				"body": "> [fke13](#comment_72_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Modern bots, specially those of the future, can beat the Turing test that tends to be used for restricting access to spam-bots.\n\nThis is why p2p/f2f networks with WOT are the future of freedom on the internet, it's the only non-big brother way of dealing with spam as we get closer to AI indistinguishable from humans. I'd prefer anonymity, but I'll take pseudonymity over what GAFAM have to offer.",
				"added": 1577547275
			}
		],
		"1577597234_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 70,
				"body": "Manually, you have to go to Settings and then click Publish to Repository Index.\nI don't publish all of my repos because the code often isn't at a point where other people can use it.",
				"added": 1577623833
			}
		],
		"1577612746_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 71,
				"body": "localhost\n\nThat doesn't count? :-(\nIt'd have to be doc.rust-lang.org then. It's my most visited site, but then again I could build the documentation myself and access it on localhost.\nProbably Github in the end. I don't even have an account there, but there's so many open source projects and libraries that I use.",
				"added": 1577624172
			}
		],
		"1577569682_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 72,
				"body": "Happiness isn't a goal, it's a consequence of making progress in achieving your goals. Happiness without effort is not happiness, it's self-delusion. True happiness comes from toil. Build something, grow something, make something.",
				"added": 1577635287
			}
		],
		"1577653744_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 73,
				"body": "Last year's was better IMHO. But it's still heaps better than the corporate crap Youtube produced.",
				"added": 1577655899
			}
		],
		"1578001269_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 74,
				"body": "Corrupted downloads should not be a problem, ZeroNet verifies the hashes of file(part)s it receives from peers. So both inbound and outbound data will be trashed and redownloaded until the verification succeeds.\n\nHaving trouble publishing could lead to problems though, I'm not sure myself whether ZeroNet will try automatically republish later or you will have to do so manually (e.g. editing a post and saving it again). Avoid using the same user on multiple devices if you're having trouble (you may overwrite unpublished data otherwise)",
				"added": 1578004594
			},
			{
				"comment_id": 75,
				"body": "> [hferbwauif](#comment_34_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): One thing is theory and another one is practice. If the blocks always get corrupted before they have been completed you'll never finish downloading anything...\n\nThat's not what was asked. The question was specifically about whether it would lead to corrupt files. But you are indeed correct: if all the parts you receive/send are corrupted in transit you will not be able to download/seed anything.\n\nI have used ZeroNet over connections as slow as 10-20kb/s without problem. And I've also used it in places with unstable wifi availability and the most trouble I've had is that publishing would fail because the wifi cut out. It'd be interesting to hear from people who've used it over even slower connections though.",
				"added": 1578055147
			}
		],
		"1578065196_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 76,
				"body": "> [re4tsf9e](#comment_64_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): [...] Doubt any Iranians are on Zeronet. Excessive complexity makes things brittle. Pretty sure Tor has always been blocked in Iran.\n\nThere's been a recent surge of Iranians using ZeroNet, hence the Persian translations that were added recently. There's not much activity on their official ZeroTalk though, so I don't know whether they're still around.",
				"added": 1578078093
			}
		],
		"1578225013_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 77,
				"body": "> [gitcenter](#comment_1184_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Unfortunately, not any time soon. Sorry for that, I switched to the main ZeroNet fork because I thought it's more important for now, until we get more users and such.\n\nWhat was the reasoning for a ZN fork?\n\nI'm making my own (Py3-compatible) Rust implementation of ZN and I'd like to take features people want to see into account while developing.",
				"added": 1578240930
			},
			{
				"comment_id": 80,
				"body": "> [filips](#comment_392_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Have you done anything in your Rust version that you can already show? I would like to see how exactly it looks like. [...]\nI post weekly updates about [my progress on ZeroMe](/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS/anshorei@zeroid.bit), and also publish my branches to Git Center. It doesn't do much yet though:\n- upnp\n- local peer discovery\n- content signing + verification\n- serve ZN wrapper\n- serve static files through wrapper\n- establish websocket + a couple of API responses\n\nI expect to have a (limited) working prototype somewhere in Q1, possibly in about a month (no promises though).\nThe focus of this prototype will be that the default zites (except Me which uses Merger) are browsable (i.e. look for peers, download/seed files, respond to FileGet, FileNeed, etc. requests). This means it may not be optimized. E.g. serving the wrapper does not use a template but an iterative string replace. Several async functions still block the thread.\n\n> splitted implementation of the protocol itself and other code\nThat would be good, and it's also good practice in Rust (which strongly favours crates that do one thing and do it well, then combining those crates in the overarching project). The signing+verification is the only part I've put in a separate crate for now.\n\n> Support for more network protocol features, like WebTorrent, DHT, PEX, HTTP seeding.\nZN already does PEX. DHT would be a great addition, and I've looked into it a bit but I think it's going to be one of the harder ones. I'd also like to add I2P and LokiNet in addition to Tor.\n\nI don't have experience writing Rust bindings for C libraries, but it's supposed to be a well-documented use-case, I might try my hand at it, but it's definitely not a priority.\n\n> Better (also non-iframe-based) wrapper/sandbox\nI'm using the standard ZN wrapper (with 0 changes), the benefit of this is that if someone writes a better wrapper for ZeroNet it should be easy to replace in the Rust implementation as well.",
				"added": 1578248901
			}
		],
		"1578059130_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 78,
				"body": "It could be interesting to make a similar plugin using I2PSnark torrents, those enjoy the protections offered by Tor-like routing.",
				"added": 1578241034
			}
		],
		"1578244523_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 79,
				"body": "Be aware that NOSANDBOX is dangerous for the user.",
				"added": 1578246068
			}
		],
		"1578995205_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 81,
				"body": "Good luck turning coal miners into coders.",
				"added": 1579050508
			},
			{
				"comment_id": 82,
				"body": "> [aassddff](#comment_2_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): If you take Scarcity as in \"finite\", there's no such thing as post-scarcity.\n\nIn absolute that is true.\n\nIs Primitivism not pre- and post-scarcity at the same time?\n\nSome things will always be common, and scarce things may not always be needed.\n\nCould this also apply to a technologically advanced future?",
				"added": 1579050786
			}
		],
		"1579306799_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 83,
				"body": "Sadly ZeroNet is written in Python, and Python does not lend well to multithreading.\n\nI've proposed (and am currently working on) an implementation of ZeroNet in Rust, a language that boasts several great advantages over Python such as overall performance (being low-level, no-GC, barely any overhead), memory safety guarantees and good multi-threading support. There is some disadvantages as well, eg. Plugins will not work and will need to either be integrated in the project, or into a fork. It's also still far from usable, and I'm kinda stuck right now...",
				"added": 1579402415
			}
		],
		"1581271452_17FotRRc6msHBzM2jrs6tQCmpLaXi1kHd5": [
			{
				"comment_id": 84,
				"body": "ZeroNet generates separate onion addresses for each site it is seeding.",
				"added": 1581274208
			}
		],
		"1585214522_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": [
			{
				"comment_id": 85,
				"body": "Are they talking about the same \"trusted\" media that claimed:\n- It's just a flu, bro.\n- Masks don't work, stop buying them you retards.\n- Hug an asian, bigot.\n- Drumpf is stupid, banning flights from China/Italy/Europe won't do anything.\n- Chloroquine might help defeat COVID + Durmpfler recommends dangerous fish tank cleaner against Corona.\n- China is gleatest countly, rook how Xi saved his peopre. Why can't Dlumpf be mole of a dictatol rike Xi?\n\nYep, I definitely trust those guys.\n\nAnd it's not like Trump handled the situation well, he did a *really* bad job actually, but even so both the media establishment and the democratic party were able to make him look more competent than both of them combined. How hard could it be to suspend the imagine-no-borders-and-hug-a-racially-divergent-person mentality for a second because there's a pandemic going on?",
				"added": 1585901725
			}
		],
		"1587567790_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 86,
				"body": "> [zeroseed](#comment_58_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): i'm stopping the test now.  i will do a similar test without TOR. Definitively we need an audio streaming service like this! The devs of StreamZ are on zeronet now or abandoned?\n\nThe devs are still active in the Matrix chatrooms, not as active on ZeroNet itself though.",
				"added": 1587666999
			},
			{
				"comment_id": 98,
				"body": "> [zeroseed](#comment_60_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g): i'm trying to install riot but for now i failed. someone can contact the devs?\n\nYou can also use Matrix in the browser, I'll be sending them the link to this thread though.",
				"added": 1588199473
			},
			{
				"comment_id": 102,
				"body": "> [gitcenter](#comment_1366_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Actually StreamZ is open-source, so it'd be cool if you managed to add audio support yourself.\n\nI didn't realize StreamZ had been open-sourced, is there a reason the source is not on Git Center?",
				"added": 1588369143
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 87,
				"body": "Probably libertarian, that's definitely where I'd fall.\n\nI suspect most people here discovered it because they're tech-savvy libertarians (or anarchists) fed up with the increased authoritarianism coming from the clearnet monopolies. I'm tired of the left/right bullshit, and I somewhat doubt this community leans either ancap or ancom as a whole, I've seen people here argue for both sides in the same breath leading me to believe others may have discarded the left/right false dichotomy as well.",
				"added": 1587677473
			},
			{
				"comment_id": 90,
				"body": "> [jokercrusader01a](#comment_25_157VVUxncF9T6AJyBqccov3387r13ru7ir): I'm HUMAN. Plan to keep it that way.\n\nI'm a human, and I'm coming! I'm animated, I'm alive, my heart's big! It's got hot blood going through it fast! I like to fight too! I like to eat! I like to have children! I'm here! I've got a life force! This is a human, this is what we look like! This is what we act like! This is what everyone was like before us! This is what I am: I'm a human.",
				"added": 1587901661
			},
			{
				"comment_id": 93,
				"body": "> [styromaniac](#comment_2083_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): [...] the MSM can't honestly paint us all as extremists [...]\n\nJust look at 'em try though.\n\nHuman Evolution -> Extremist\nHuman Biology -> Extremist\nWorking class -> Extremist\nChristian -> Extremist\nMuslim -> Extremist\nFreedom -> Extremist\nPrivacy -> Extremist\nMRA -> Extremist\nVidya -> Extremist\nMetal -> Extremist\nJokes -> totally EXTREEEMIST",
				"added": 1588009848
			}
		],
		"1587248692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 88,
				"body": "Back when I used Minds it had a great community was kinda r/the_donald meets a bunch of hippies but they were all willing to have a conversation, haven't been there much since I got into ZeroNet though so it may have devolved since. Gab is basically right-wing Twitter, which makes it only marginally better than Twitter. Mastodon had some great communities, but also some really toxic ones so you'd need to ask around first.\n\nI really recommend Matrix for anything that's private, group and public chats.\nJami for chat, audio and video calls.\n\n> [vikingharvester](#comment_34_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav): I hope you understood : forget centralized, not open sourced, not encrypted software... retroshare fits the perfectly your mission... https://retroshare.cc/\n\nRetroshare is great, I'm using it with my family, but that said it's definitely still a WIP.\n- Great control over reach: share with selected people or share with custom groups\n- f2f (friend-to-friend) instead of p2p: Great for secure private communication, not good for global availability\n- great filesharing (can limit to selected people): my family can easily download any the CD's I've ripped, my music friends have access to my sheet scans, all of my concert recordings and event photos are available to the other people who attended.\n- ui feels very retro, responsive, not bloated\n- great e-mail system (far better than ZeroMail)\n\nThe downsides:\n- f2f instead of p2p leads to small reach, if you want to post publicly a p2p model like ZeroNet is better\n- lack of features\n- need to recompile to enable autologin (they disabled it for security purposes)\n- ui feels very retro, not as slick as sites\n- still quite a few small bugs",
				"added": 1587678417
			}
		],
		"1587842259_17Y99cco6a5zgT4jbUXbh1ghnc9SP28kua": [
			{
				"comment_id": 89,
				"body": "ZeroNet provides decentralization without anonymization.\n\nTor provides anonymization without decentralization.\n\nBy setting ZeroNet up in Tor-only mode (see the documentation) you get both anonymity and decentralization. On top of routing all traffic through Tor it also improves your privacy by creating new onion addresses for each site you connect an creating fresh ones every time you restart, this makes it harder to know when you're online and which sites you use (of course these can all be figured out by going through when/where you post with your ZeroID or other certificates).\n\nTo be clear: ZeroNet as a whole is NOT privacy-oriented. Some services like ZeroMail ARE privacy oriented. But most are 100% publicly available. ZeroNet is built for censorship resistance, decentralization and community-driven data longevity.",
				"added": 1587852125
			},
			{
				"comment_id": 97,
				"body": "> [blurhy](#comment_444_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): correction* you get neither anonymity nor decentralization😂\n\nIt's kind of pointless to just drop something like that here without argumentation.\n\nMy best guess at what he means is:\n1. Because ZeroNet doesn't have DHT yet and relies on trackers it's not fully decentralized. Another centralization problem is the reliance on certificates like ZeroID, of which there are very few.\n2. You only have anonymity as long as you lurk, in order to post you must use a certificate, so you are pseudonymous instead of anonymous. But this is a moot point because even 4chan isn't anonymous if you look at it that way.\n\nThe issues under (1) will get fixed with time, there's open PRs for DHT, and we could use PoW certificates that would be completely decentralized.\n\nWith the way ZeroNet works there's nothing that can be done about (2) AFAIK.",
				"added": 1588154647
			},
			{
				"comment_id": 103,
				"body": "@blurhy:\n\n> PoW increases centralization\n\nPoW does not have to be blockchain PoW, it just means that it is computationally non-trivial to generate new ID's. As long as people can live with cryptographic ID's we could completely decentralize the certificate system.\n\n> The project is almost discontinued.\n\nWhat are you talking about, there's plenty of active developers, just because they aren't working on what you want doesn't mean they aren't actively working on ZeroNet projects.\n\n> Blockchain is centralization.\n\nZeroNet does not use blockchain and does not need blockchain. I really don't get why you always go back to talking about blockchains.\n\n> ZeroNet lacks modularity and collaboration.\n\nI'm starting to think you're a CCP troll who's just here to waste time. If this was your issue you'd just ... I dunno, collaborate? Make a PR? You keep complaining that there's too little developers, and yet you do shit all. That's not how open source works.",
				"added": 1588513789
			},
			{
				"comment_id": 108,
				"body": "> [blurhy](#comment_458_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): any response ? or you simply have no idea on how to continue the debate ? [...]\n\nI've already responded to those in another thread. If you keep @ spamming me I will block you. Considering I've already responded to your points multiple times and you just keep repeating them as if I haven't, I have to conclude you're a CCP paid troll who's just here to keep us from developing censorship resistant software. If you are not, I recommend you learn2code and contribute *code* instead of telling us what to do.\n\nIn case you missed it:\n\n> (1) Lack of modularity, not sure what he means exactly. If he means making parts of the code available for use in other software so it can be made compatible, that's being worked on.\n> (2) There's been talk about adding DHT, and I might pick that up at some point.\n> (4) I'm working on a Rust implementation of ZeroNet which is planned to allow using PostgreSQL instead of SQLite\n> (5) NoFish is working on deduplication\n> I agree partially with points 3 and 6.\n>\n> (3) a. I've argued against ZeroName in the past, I think we should just stick to Bitcoin addresses. b. Instead of criticizing ZeroNet for being mostly a NoFish project, why not contribute? c. Yes, having so few cert providers is a weakness.",
				"added": 1588584280
			}
		],
		"1587679731_1367VTupfj886Uk39iT4RjiSmrakiDYTga": [
			{
				"comment_id": 91,
				"body": "Far more important than a canary is that your zite's private key is not stored unencrypted. Stick it in a password manager and make sure it's no longer in users.json. If you don't have access to your private key you can't remove the canary and if *they* have access to your private key they can do what they want with you zite.",
				"added": 1587904783
			}
		],
		"1587739208_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 92,
				"body": "You're sure you signed content.json? You might want to try manually signing and publishing it using ` ./ZeroNet.sh siteSign/Publish --inner_path path_to_your/content.json SITEADDRESS`",
				"added": 1587905053
			}
		],
		"1585090638_1nADL2gz5MoAsEjnoARpP4hPTVfBk5ri3": [
			{
				"comment_id": 94,
				"body": "There's a bit of everything, still kinda hard to search though.\n\nDefinitely check out Git Center, it's decentralized git hosting. I'm glad to be rid of Github!\n\nSome of the projects I've created/maintain are [an archive of articles about ZeroNet](/1NEwsvyrAoEWU64ZozwdfgEUQhwxiCrh1t/?!/) and [an image gallery merger](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4), and of course the source code is available on Git Center.",
				"added": 1588030528
			}
		],
		"1588017450_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": [
			{
				"comment_id": 95,
				"body": "Hey @mg0:, as sirlotaplot said I added a button to publish all changed galleries (i.e. `content.json`'s) in one go and this goes very quickly. The way I did this is by using the ZeroFrame library and calling `sitePublish` for every single one of them.\n\nThe way you could do this is having a little page in your zite (e.g. `sign.html`) that does something along the lines of\n```javascript\nzn.cmd('siteInfo', [], res => {\n  if (res.settings.own) {\n    // Somehow get the list of content.json's you wish to sign here\n    toSign.forEach(inner_path => {\n      zn.cmd('sitePublish', { inner_path })\n    }\n  }\n})\n```\nIt's a bit hacky, but every time you then go to that page it's going to sign and publish all of them.",
				"added": 1588031197
			},
			{
				"comment_id": 96,
				"body": "> [mg0](#comment_275_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): does the zite know on its own which content.json files are to be published, or do you keep a list of the changed ones?\n\nI don't think there's a way to know which ones have changed. Because the contents are usually changed through the hub interface I just have a file which tracks whether a gallery is signed and whenever something is changed it is set to false for that gallery (i.e. dirtied). When it is then signed it is set to true (i.e. clean).\n\nHow does your current script do it?\n\nThe problem is that it really depends on how you update your zite. If new files are added by a script you could do something similar to what I've done.",
				"added": 1588067490
			}
		],
		"1586632143_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 99,
				"body": "> We have a lot of people here who might give [Alex Jones] too much credit for how little he actually knows.\n\nHe's a broken clock that's right 3 times a day.\n\n> That is completely off topic.\n\nBut not untrue.\n\n> 5G is not going to microwave your brain\n\nbut it is going to give China control over the construction of critical communication infrastructure in the West.",
				"added": 1588241728
			}
		],
		"1588179678_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 100,
				"body": "I'd like to seed, but some of the optional files appear to be missing. Could you check everything is signed and published and keep seeding until I have everything?",
				"added": 1588257233
			},
			{
				"comment_id": 101,
				"body": "If they are optional files I don't really see a reason to remove the old content, I've got more than enough spare space for seeding.\n\n**The problem is that I can't seem to get past the 5 minute mark for episode 14.** Other episodes that I've tried like 13 worked fine.\n\nIf the reason why you remove old episodes is because it takes longer to sign there's a solution for that:\n```\n+ Shows\n    + Shows 11-20\n        - content.json\n        - Episode 11\n        - Episode etc.\n    + Shows 1-10\n        - content.json\n        - Episode 1\n        - Episode 2\n        - Episode etc.\n```\nYou then need to add each of the subfolder's content.json's as includes to the main content.json\nThen you no longer need to sign the files in the archives when you add new ones, only the one where you add the new one. This shouldn't really become a problem until you get to Episode 100 though.",
				"added": 1588340762
			}
		],
		"1588540421_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 104,
				"body": "1+Gallery uses marked, together with sanitize-html",
				"added": 1588552027
			},
			{
				"comment_id": 105,
				"body": "[Marked at Github](https://github.com/markedjs/marked), you'll find a link to sanitize-html down on the page together with some alternative sanitizers, or you can just use this link to go to the [Sanitize HTML Github](https://github.com/apostrophecms/sanitize-html)",
				"added": 1588576299
			}
		],
		"1588542982_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 106,
				"body": "[yes, yes, probably](https://syncthing.net/)",
				"added": 1588576398
			}
		],
		"1588519592_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 107,
				"body": "I the US they would've called him Florida man.",
				"added": 1588576449
			}
		],
		"1588531231_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 109,
				"body": "> [merithtk](#comment_10_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): if i knew how to use git central, i would use that\n\nGit Center, right? What exactly is lacking in the documentation? I thought it was pretty clear, although initial setup and checkout of repositories is definitely more hassle than with Gitlab (and of course there's a lot of missing features, particularly when it comes to multi-person projects).\n\nThe rest of this comment turned into an off-topic rant, so [I moved into into a separate thread](/Talk.ZeroNetwork.bit/?Topic:1588786000_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS/Why+I+Use+Git+Center).",
				"added": 1588786046
			},
			{
				"comment_id": 111,
				"body": "> [merithtk](#comment_13_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Yeah, i want to make a tool to make it easier to do so where you set an env to your datadir for zeronet and it interpets that\n\nFor git commands I think you might even be able to do that using just git configuration.\nOf course npm, cargo etc. is going to be harder.",
				"added": 1588805142
			}
		],
		"1588776312_1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4": [
			{
				"comment_id": 110,
				"body": "I installed CryptoTab on all my mobile devices, does this mean I am destined to become a Bitcoin billionaire now? Or is that just for the owners of CryptoTab while my phone burns into my skin?",
				"added": 1588788431
			},
			{
				"comment_id": 113,
				"body": "> [anonops7](#comment_6_1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4): You have to get yourself referrals. You have link in the about section of the app that shows you how.\n\nAliens are real. The Egyptians couldn't have built the pyramids, they didn't even have cryptocurrencies yet. Only using alien cryptomining technology could they have schemed pyramids that big!",
				"added": 1588864842
			}
		],
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 112,
				"body": "There is no difference between anarcho-communism and anarcho-capitalism, there is only a difference between anarcho-communists and anarcho-capitalists. These are just two different ways of behaving in Anarchy.\n\nThe anarcho-communist ideal is a village where people do things for one another and others do the same.\n\nThe anarcho-capitalist ideal is a village where people come to a trade agreement before doing things for one another.\n\nReality is that neither will happen, the village will converge into something between the two ideals, but only as long as the villagers remain anarchists.\n\nConsidering that we don't live in anarchy and we never will (quite to the contrary, governments all over the world are becoming more authoritarian) I don't see much point in discussing which branch of anarchist philosophy is better. I do believe that all forms of anarchy work small scale but collapse as more people get involved and I believe an anarcho-capitalist oriented society works at a larger scale than an anarcho-communist one because trade enables growth without collapse past the number of social bonds a human brain can process.\n\nOpen Source is not Communism. Open Source isn't even Anarchism.\nIf something is licensed it is not Anarchist, and nearly all Open Source projects are licensed.",
				"added": 1588864630
			},
			{
				"comment_id": 114,
				"body": "> [yeaah](#comment_2_1Q8cRQSMWUa16Uqm98Hb5SNiqncMBVB4Pb): I just don't know what is better. Tor Network or ZeroNet.\n\nWhy not both?",
				"added": 1589063806
			}
		],
		"1589423797_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 115,
				"body": "The Lighthouse did not meet expectations, great camera work and acting ruined by bad CGI.\n\nI'd recommend 12 Monkeys for some pandemic atmosphere, Vabank for some more light-hearted fun and Falling Down if you liked last year's Joker.",
				"added": 1589481329
			}
		],
		"1590076293_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 116,
				"body": "> [ransbits](#comment_24_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A): nobody would be able to know what their community address is or what is being discussed. [...]\n\nI don't think that's true, publishing on ZeroNet requires making the address known to trackers, so unless they use ECIES/AES to encrypt their posts, others could listen in on their \"hidden\" ZeroTalk clone.\n\nThe goal of ZeroNet is accessibility and transparency of data, and the only way around that is the ECIES/AES cryptography methods offered by the API e.g. ZeroMail. If you want secret fora I recommend trying RetroShare instead, that network is focused on privacy.",
				"added": 1590106145
			}
		],
		"1589756609_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 117,
				"body": "When I published my shortfilm Thaïs on [my ZeroBlog](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:9:Tha%C3%AFs,+a+Musical+Short+Film) I tried to get an AV1 encoder working, but I had a really hard time and ended up abandoning it and using H264 instead. H265 in browser is only supported by Edge apparently so that was out as well. I might try reencoding with RAV1E now though!",
				"added": 1590106688
			},
			{
				"comment_id": 118,
				"body": "> [thegreenmage](#comment_5_1KzNdtTrCRi57jM5zQ62gZAk7o2oeb4EVS): y\n\nYes, but that's still the H264 encoding. My H265 attempt was ~20% smaller, and V1 is supposed to trim up to 30% off on top of that so a 40% decrease in filesize compared to H264 wouldn't be unreasonable.",
				"added": 1590164132
			}
		],
		"1590447717_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 119,
				"body": "Ever more government control.",
				"added": 1590514286
			}
		],
		"1590273486_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 120,
				"body": "Without WOT those ratings could easily be gamed, as many users have already pointed out. I think the best way to learn/teach about new sites would be for users to recommend other sites on their sites and profiles.\n\nHonestly I don't really find much time to explore ZeroNet myself. I keep an eye on the official pages i.e. ZeroMe, ZeroTalk and ZeroMail. I enjoy xcape2net's posts on [Zero Tech Talk](/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/) a lot and there's quite a few interesting blogs or personal sites that I occasionally check out:\n\n[Richi's Blog](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/)\n[Ivanq's Blog](/1FwH89xyniDgy3t6fCWrggLs22MnGPZ5K5/)\n[MyVaneDay](/1MeeJWbbQHArbqD6UUHSjh9EVycvnTUBFa/) & [Blog](/1MrwmugtdphP3CfYxXEgdefyjJV3LKMsW2/)\n[Blinking Prompt Times](/12zNqmKW8bLAhAASydBAYvo9Csy2ppQEqq/)\n[Caryo's Blog](/1MCoA8rQHhwu4LY2t2aabqcGSRqrL8uf2X/)\n[Grindalokk's Blog](/13XQMFYXt5YSdm5eqCgCqpL7Ee8wTF3ejD/)\n[Thunder's](/1648uDJu8HaSjiYR6p8KJMGtKGQyUdFNqS/)\n\nIf everyone added a list of their favourite zites to their blog it would be a lot easier for people to discover the network! I will keep my list up to date at [Ansho Rei Recommends](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:10:Ansho+Rei+Recommends)",
				"added": 1590531394
			}
		],
		"1590686514_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 121,
				"body": "If you're looking for a discord replacement I think Riot/Matrix is a better option, that's not to say ZeroNet-based solutions are a bad idea, but they don't exist yet AFAIK.",
				"added": 1590711254
			}
		],
		"1591199751_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 122,
				"body": "A lot of people feared the Corona crisis would lead to unrest, there was even talk and signs of food shortages due to the disruptions to the supply chain, a lot of businesses had to close with some going bankrupt and then violent inmates were released from prisons to prevent prison outbreaks of the disease.\n\nI wonder why buildings would get boarded up...",
				"added": 1591349813
			}
		],
		"1591530136_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 123,
				"body": "Telegram users should switch to Matrix first, that's going to feel a lot more familiar to them.",
				"added": 1591546597
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 124,
				"body": "> [halo1117](#comment_11_1FWLs7rQh1QN8q6hvu82NUVokaU9Er7XsJ): Zeronet + ipfs will be better\n\nYes. Unfortunately we have to wait for IPFS to provide anonymity and they don't appear particularly interested.",
				"added": 1592302413
			}
		],
		"1592777145_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 125,
				"body": "I want to see Tim Pool and Joe Rogan do a fence-sitting competition, that's what I like about them though.",
				"added": 1592871153
			}
		],
		"1592964791_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 126,
				"body": "ZeroNet isn't good for hosting video imho, at least right now. IPFS is a lot better for that because of the deduplication it offers. Right now if you want your video available on multiple ZeroNet sites you'll need to either upload it multiple times, or fiddle with links (symbolic or not) or filesystem-level file deduplication.",
				"added": 1593099186
			}
		],
		"1593090212_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": [
			{
				"comment_id": 127,
				"body": "> [styromaniac](#comment_2382_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): FYI to others, this person will be working on a Rust implementation of ZeroNet, which will perform hundreds of times better than the Python implementation.\n\nI'm not sure about 100's of times better. In the past I've ported a python application with a lot of calculations (3d manipulation and shape overlap) that did get into the 100's of times performance increase, but the slow speed in the original application was not just due to Python, it was mostly due to the use of slow libraries and lack of multi-threading. I'm certain I could already have achieved a significant performance boost just by rewriting the Python code ... in Python.\n\nOne issue that a Rust implementation will undoubtedly avoid is the hangs that occur when downloading files. This bug should also be fixable in Python though.\n\nTL;DR:\nWill it be faster? Yes.\n100's of times faster? Maybe as long as the hang bug doesn't get fixed in the py3 version :-D",
				"added": 1593130215
			},
			{
				"comment_id": 129,
				"body": "Thank you for the resources, it doesn't look like there's many options and the prices are higher than I realized. Maybe I shouldn't try to build a server and go for a cluster of single-board computers. I found a [good overview of single-board computers on hackerboards.com](https://www.hackerboards.com/boards_index.php), but it's got open hardware and closed mixed together.\n\nOdroid is looking pretty promising (particularly the ODROID-HC2), but it's not completely open hardware so I'm still hoping for something better. The reasons I like it are:\n- 1 SATA\n- Stackable\n- Octa-core CPU\n\nThe major downside is 2GB RAM, which is really low. But I don't really have an idea how much RAM I will need. Probably a lot less with a cluster than I'm used to, but still!\n\n@maximi891: OLinuXino has a lot to offer and is 100% open hardware from what I understand. They have some quad-cores with SATA that I'd be OK with.\n\n@leviathor: Librem is doing great stuff, having some hard times with the smartphone but I hope they pull through! They're oriented towards personal use though (laptops, smartphones).\n\n@styromaniac: I wish I had the money to buy those raptorcs servers o_o.\n\nI'll give it some time before I make a decision, but thank you to all the people who replied.",
				"added": 1593204406
			},
			{
				"comment_id": 130,
				"body": "> [xcape2net](#comment_762_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): [...] Why do you think you need 16 GB of RAM? [...]\n\nI don't. But if I buy server hardware, I want to be able to extend it when I do need it. I don't run any webservers and if I did I wouldn't use Apache :-)",
				"added": 1593314784
			},
			{
				"comment_id": 131,
				"body": "> [styromaniac](#comment_2403_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): What's your favorite HTTP server software? I've kind of wanted to have an HTTP server configured as making sites on the clearnet is fun.\n\nIt depends, for general purpose I usually use [Nginx](http://nginx.org/), but I mostly build them myself using frameworks. In Rust I generally use [Rocket](https://rocket.rs/), except when an actor system is useful, in which case [Actix](https://actix.rs/) is best suited. In Go I use [Echo](https://echo.labstack.com/).",
				"added": 1593386272
			}
		],
		"1593027865_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 128,
				"body": "Not being useless :-D\n\nIf you learn how to program or hack, I don't think you can even get bored anymore. There's always so much to learn and experiment with and it's not costly to do so (unless you account for time).\n\nTaking time to appreciate beauty in the world. This is why I could never live in a city, it's a soul crushing environment where historical churches tend to be the only oases of serenity and beauty.\n\nChickens are stupid and highly entertaining, would recommend.\n\nGetting a job definitely helps.",
				"added": 1593158847
			}
		],
		"1594047986_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 132,
				"body": "GitHub is owned by Microsoft and is verging towards a monopoly on open source code hosting. Free Source Code should be hosted on decentralized networks, not on a platform that Microsoft controls.",
				"added": 1594079635
			}
		],
		"1594185414_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 133,
				"body": "Remaining silent while the Silicon Valley Mafia takes your freedom away is indeed retarded.",
				"added": 1594207024
			}
		],
		"1594354789_1EAVeFYkSwZaUXFUhuKvsJ6kBHsZmZsG1T": [],
		"1594974805_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 136,
				"body": "Any centralized alternative to Twitter is just as bad as Twitter in the end. Unless control over an account is exclusively in the hands of the owners there will always be inside jobs targeting users.",
				"added": 1594996844
			}
		],
		"1595014824_1D2AJaBfjqNkFg2Yk6btXMb1XFb8DKUdrU": [
			{
				"comment_id": 137,
				"body": "[Ansho Rei Recommends](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:10:Ansho+Rei+Recommends)",
				"added": 1595031314
			}
		],
		"1595245747_1H957LnCvbdc8nSN3j4miBMMNH2awZ2Dst": [],
		"1595210464_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 140,
				"body": "What do you need JS Git for? Ideally you'd use normal git + hooks. I have some issues with the publishing via hooks if ZeroNet is already running so I don't use it anymore, but that may just be an issue on my end or needs to be fixed.",
				"added": 1595249201
			},
			{
				"comment_id": 142,
				"body": "Cloning from Git Center actually works as long as the owner has run `git update-server-info` in the zite's repo before signing. Again this can be done automatically using hooks, but I have some issues with hooks so currently I'm doing so manually.\n\nNow pushing commits is another story! I've thought about the best ways to do so and honestly the best I've come up with is aliasing `git clone http://localhost:43110/XYZ` with the path to my ZeroNet instance, unfortunately that's manual configuration for everyone :-/",
				"added": 1595372970
			}
		],
		"1595220448_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [],
		"1595350375_1EdFvRMCSsjRQDSwKEaYDu3aU2o5PfzhrX": [
			{
				"comment_id": 143,
				"body": "> [styromaniac](#comment_2498_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): My guess is that none of us use a search engine.\n\nThis. I don't really search for things, but there's [Search](/1FEH3VjjKoDTXSpUA1G4xpB7WFnfQ48oVC/), which I use to search specific sites. If I'm not mistaken it's actually a small experiment from the person who made Kaffeine, but it's the best search tool on ZN IMHO.\n\nFor the clearnet I use Searx and Yacy. The first is federalized and the second is decentralized, I'm hoping someone builds a p2p search engine like Yacy for ZeroNet.",
				"added": 1595373449
			}
		],
		"1594361535_17WS8Y1keB3p8ELXFPbX1ZRLfeCESyojtF": [
			{
				"comment_id": 144,
				"body": "> [glosrozsadku](#comment_9_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): Every search engine implies a database with indexes of the content being dynamically accessed by the frontend.\n\n[Yacy.](https://www.yacy.net/)",
				"added": 1595380466
			}
		],
		"1595218764_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [],
		"1596123474_1LaEZFQwyfpCZDdrGqfLTiQSubN5c2L1jn": [
			{
				"comment_id": 146,
				"body": "StreamZ doesn't capture audio yet.\n\nI was working on a program to pipe OBS (with audio) to StreamZ last weekend, but I didn't manage to get it working yet. Will continue development this weekend, I'll keep you updated.",
				"added": 1596152940
			}
		],
		"1596795113_1EdFvRMCSsjRQDSwKEaYDu3aU2o5PfzhrX": [
			{
				"comment_id": 147,
				"body": "ZeroNet is more resilient than the Internet, so yes it will!\n\nZeroNet doesn't rely on the internet. Without the internet, users could meet up create a wifi hotspot and connect to each other and their ZeroNet instances will sync sites (as long as they're not configured as Tor-only). Of course would mean no instant communication, but this would be very good for sites containing important information like wikis.\n\nUnfortunately it can't do so yet over bluetooth unlike some other decentralized communication programs like Briar.",
				"added": 1596900749
			}
		],
		"1597255787_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN": [
			{
				"comment_id": 148,
				"body": "How large are your galleries (number of images and filesize)? What browser are you using? What ZeroGallery hub did you clone? Which `content.json` is missing? `/galleries/content.json` or `/galleries/$GALLERYID$/content.json`?\n\nI recommend using [GalleryHub+](/14NFfVBBAFbNdqX4nyGjyBF1BRSz7jn2QP) which has more features. I just tested it with a small gallery of five images and it worked fine.\n\nTor Browser disables a lot of optimizations by default that help speed up Javascript, the hub uses a JS implementation of ImageMagick to generate the thumbnails, this process is going to be considerably slower in the Tor Browser (but should still work as no canvases are used).\n\nIf your galleries are large or your computer is slow you may want to add the photos in separate batches e.g. 50, then another 50 (prepend is broken but append works).\n\nIf that's too tedious or slow you could also try [Rust0gal](/1KJquoRGNoC3sZWj56WEtSaLKg9hYupnX9), but it has no documentation, probably only works on linux and requires you to have imagemagick installed.",
				"added": 1597307556
			},
			{
				"comment_id": 149,
				"body": "> [blkdissident](#comment_4_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN): Thanks for the help ansho! I did some debugging, there's definitely some issue with mangoGallery+. I tracked down GalleryHub+ yesterday and that works perfectly fine.\n\nIt's possible there's a bug in the outdated version used by mangoGallery+, that or the owner broke it. GalleryHub+ is the official demo. If you have any questions or feel free to contact me, I'm the current maintainer of 1+Gallery and GalleryHub+.",
				"added": 1597355722
			}
		],
		"1597601766_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X": [
			{
				"comment_id": 150,
				"body": "> [legacyofbalancer](#comment_1_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X): I contacted the admins of www.airbase.ru. And they contacted his family, I guess.\n\nWeird story. Did they have a reason to trust you or were they just unaware of what one could do with those keys?",
				"added": 1597622393
			},
			{
				"comment_id": 151,
				"body": "> [legacyofbalancer](#comment_2_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X): ask yourself if you have a reason to trust balancer73 [...]\n\nI don't need to trust him, that's why JS is (mediocrily) sandboxed. But I wouldn't trust my family to hand my keys over to anyone. I die my keys die. Of course that's easy to say for me because none of my sites are heavy on user input so they don't need much administration.",
				"added": 1597642738
			},
			{
				"comment_id": 152,
				"body": "> sharing of the information and keeping the data forever\n\nThis is why I personally wouldn't share my keys. I wouldn't trust someone else to keep to not mess up my data.\n\nI'll have to look into his work trying to integrate ZN with his forum and Mastodon as that sounds interesting.",
				"added": 1597649244
			}
		],
		"1597818504_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 153,
				"body": "If you want p2p mail, Retroshare has a far superior implementation for that. ZeroNet is superior when it comes to public data.",
				"added": 1598002372
			}
		],
		"1598912261_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 154,
				"body": "1. The only thing that is validated is ownership of data using bitcoin cryptography (i.e. did bitcoin address 1AddRESs sign this data? y/n)\n2. No, there is no way to validate other nodes fairly generated random numbers etc.\n3. You can get peer ips or onion addresses and you can do anything with them you can think of with js/wasm. You might also want to look into ZeroNet PeerMessage which can be used to deliver data to all or specific peers.\n\n**What are good cases to use ZeroNet in a game?**\n- Content signed by the developer. ZeroNet is good for content distribution because people downloading your game will also host it so you don't have to pay for hosting it.\n- User-generated content hosting such as custom maps and mods. Any data that does not have to be validated anywhere other than client-side (ie. download map, check if it is a valid map). ZeroNet can continue distributing content long after you've stopped maintaining the game. Servers for old games go down, that is not a worry on ZeroNet.\n\n**What are bad cases to use ZeroNet in a game?**\n- Leaderboards, multiplayer with many players. Anything that works best with authorized servers verifying data.\n\nIf you want decentralized computation you will have to look into blockchain solutions, there's no reason you couldn't use a blockchain (e.g. ethereum) for the 'centralized' parts (i.e. timestamps, randomness, ownership of items etc.) and ZeroNet for content distribution.",
				"added": 1598948983
			},
			{
				"comment_id": 156,
				"body": "> [stivencannor](#comment_2_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S): thank you for the awesome answer.so, there is not any validation at ZeroTalk and i can send a new topic, before the ZeroTalk Creation. attention to the \"new\" topic word. im talking about new data with new address, not changing data. new data has new address and i am submitting invalid date Time. then i have new address and valid bit address. at this example. im not changing other people data.\n\n1. By default, with the exception of the owner of a zite, no one can alter user-submitted data other than the user who submitted it. It is possible for the owner of a zite to add co-owners and theoretically this could be used to add a group of 'moderators' who can remove/alter data. However it's more in line with the philosophy of ZeroNet to have moderators maintain a blocklist without giving them the right to alter user data (for transparency and moderator accountability).\n2. It is up to the zite developer to handle invalid data submitted by users either by omission or sanitizing. If invalid data submitted by users causes problems on the zite that should be considered a bug with the zite, not with ZeroNet. Most zites use ZeroNet's SQLite features, these can make it easy to ignore invalid data (string in json where integer is expected etc.).\n3. There are multiple zites that include mining scripts, the more ethical of these ask you to allow mining before activating, others do not. It's up to us as users to spread blocklists of these sites and/or use browser plug-ins to block such scripts (just like on the normal web).\n4. Don't execute files downloaded from untrusted sources, whether from the clearnet or ZeroNet. Spreading trojans through ZeroNet should be no different from normal web. Again it's up to us as users to create blocklists for sites and/or users that trick people into executing trojans.\n5. I don't consider *hosting* trojans to be an issue personally, it would be an interesting idea to have a zite hosting a kind of trojan archive for people to dissect.",
				"added": 1598951839
			}
		],
		"1598827107_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 155,
				"body": "1. Look at the code.\n2. [ZeroDocs](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1) is mostly API, but it does explain some things about the inner workings as well.\n3. The presentation linked below.\n\nYou might also want to check out some of my repositories on Git Center, they contain Rust implementations of a few ZeroNet functionalities that I believe to be cleaner that the Python implementation (particularly the crate [zeronet_protocol](/1H3ct93gHL9BgtTnyrqJrkjn4NdociFFTn), excluding the tor/i2p parts). Don't try using my zerunet core project though, that's wildly unfinished.",
				"added": 1598949099
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [],
		"1598965770_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 158,
				"body": "Are you trying to use wasm in your site? I've been able to do so myself, but it requires some fiddling.",
				"added": 1598977774
			}
		],
		"1600032770_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 160,
				"body": "If you're using Tor you can also add my tracker `zero://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion:15442`.",
				"added": 1600036896
			}
		],
		"1600058531_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 161,
				"body": "Yes, this is something I've been thinking about as well. I think Retroshare does this pretty well.",
				"added": 1600068636
			}
		],
		"1600071135_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [],
		"1599735028_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 163,
				"body": "> Not on ZeroNet.\n\nMaybe, but it won't stay that way. ZeroNet is censorship-resistance software, once it gets on the radar they will likely scan everything on here since it's public anyway. They won't be able to remove it, but they could try and doxx you.\n\nIf you want privacy, a p2p platform like Retroshare is a far better fit. There they literally can't scan what you post, unless you yourself add them as friends.",
				"added": 1600123371
			},
			{
				"comment_id": 165,
				"body": "> [nonendoxic](#comment_2_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV): Good. The world doesn't need hate or secrets. Out with the snakes I say.\n\nOoops, anything bad you say about Trump or Hillary (fill in as appropriate) is now classified as hate speech and warrants a permanent ban from the internet. Also give me your credit card information and social security, you won't be needing those secrets.",
				"added": 1600732671
			},
			{
				"comment_id": 167,
				"body": "> [insanecriminal](#comment_2_18SFer1zAMegr8LEtnFPWK8MnneWkYtZzr): They can scan it. They cant deanonymize it. ;)\n\nGiven enough data they can. Over time as you keep posting on ZeroNet you will reveal your speech patterns and bits of personal information (e.g. \"It's election time in my country again, fuck politicians\", \"It's raining outside\" or \"Friends took me to the movies yesterday, turns out movies are still shit.\"), with AI these can be correlated with data from other sources e.g. weather information, election dates, mobile phone coordinates, posts on other social media etc.",
				"added": 1600866493
			},
			{
				"comment_id": 168,
				"body": "> [scotcyguy2](#comment_47_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): [...]why has it never really taken off I wonder?\n\nComplicated codebase => few developers => slow development and few plugins.\n\nThey announced a JSON API interface a year or two ago, so that opens up a lot of possibilities. I believe Briar is based on it, and that has received more love and attention.",
				"added": 1600980008
			}
		],
		"1600200644_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 164,
				"body": "The problem is you need a trusted way to store the gamestate.\n\nYour options are:\n- Centralized omniscient server trusted by blind clients (can federalized of course i.e. private servers)\n- Shared gamestate by all clients, but it's easy to cheat using tools and can lead to desyncs\n\nHonestly you're probably best off hosting your own private server and playing with your friends.",
				"added": 1600206706
			}
		],
		"1600294870_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 166,
				"body": "ZeroNet Tracker [Git Center repo](/1EtS177qrqicnGtGzktcMPEeL13FeLKJEG) written in Rust.",
				"added": 1600733264
			}
		],
		"1601334479_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 169,
				"body": "@styromaniac: Have the script exit when an error occurs so it doesn't overwrite + publish the file\n\nTor users who want more trackers: you can always add mine: `zero://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion:15442`",
				"added": 1601419256
			}
		],
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": [
			{
				"comment_id": 170,
				"body": "> [unsnapgreedless](#comment_4_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh): Remember when the Internet used to be tiny little blogs with blogrolls on the side? Not much censorship going on back then...\nYes, I remember. And that's what I'd like ZeroNet to be, but I'm not confident that enough people want to go back to that, the zeitgeist seems to be all about centralizing and throwing everyone and everything in a big soul-crushing pile.",
				"added": 1610380562
			},
			{
				"comment_id": 171,
				"body": "> Hence the problem with Parler: their refusal to moderate their userbase\n\nLast time I heard the rules of Parler were strict, even stricter than Twitter in some regards, but their moderation was not on a blanket \"our bots will take everything down as they please as determined by arcane algorithms\", but more of a \"if people report it, and it does indeed violate our policies\". With a such large influx of people their moderation cannot be expected to keep up. It is also likely a lot of violating posts were made *in order to* damage the site.",
				"added": 1610384706
			}
		],
		"1610354895_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 172,
				"body": "I have some introductory content on my blog:\nhttp://localhost:43110/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Home\n\nHere's a history of ZeroNet in the media (a bit outdated):\nhttp://localhost:43110/1NEwsvyrAoEWU64ZozwdfgEUQhwxiCrh1t/\n\nThe biggest vulnerability in ZeroNet history (prior knowledge about ZeroNet's inner workings helps):\nhttp://localhost:43110/1HcLPSR5ss1ehsqP8kU2Sa2TJyDVcGADTp/",
				"added": 1610387968
			}
		],
		"1610391633_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 173,
				"body": "The problem with Orchid and I2P is that they're written in Java, i2pd is a lot easier on your system resources at the cost of user friendliness.",
				"added": 1610410270
			}
		],
		"1614774386_1DwZPxVycEyeuvYDJFjAZfF3A8SGtHiRBn": [
			{
				"comment_id": 174,
				"body": "You can check the logs: ZeroNet checks what your IP is during the startup process IIRC.\n\nZeroNet also has a built-in [stats page](http://localhost:43110/Stats) that should display your IP address(es) at the top. If you're also running a routing service like CJDNS or Yggdrasil those may still be public.",
				"added": 1614787887
			}
		],
		"1616503348_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 175,
				"body": "Hey that's great! Are you in the ZeroNet Matrix room, Geekless? Because you should probably post this there as well!",
				"added": 1616526489
			}
		],
		"1616648188_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 176,
				"body": "I like the way Retroshare handles this, by default the client only downloads forum content that is less than a year old, but you can change that in your preferences to between \"Keep everything\" to \"5 days\".",
				"added": 1616710540
			}
		],
		"1615948566_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": [
			{
				"comment_id": 177,
				"body": "The only difference is that a ZeroNet \"server\" is on a device that's running 24/7 and probably headless. Mine's down atm, I keep procrastinating maintenance :-/",
				"added": 1616710812
			}
		]
	},
	"comment_vote": {
		"857_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"10_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"18_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"2_1N11NsibgNVZrsTpnsSbhb65jxQme4wmET": 1,
		"982_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo": 1,
		"5_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD": 1,
		"711_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"974_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"187_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"186_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"12_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"269_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"18_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"21_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"392_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"4_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"425_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"390_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"122_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"1022_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"78_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"6_17HQ27P8LgqS7S4WAUy9bRQtPoESLA15Cx": 1,
		"65_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"83_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"2384_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1AMJoKjsbS4TFJqR9fJSbMuv5tiGyu6aNy": 1,
		"5_1Kep4pW6GKimgY4zz9TN4XCjtNQUrrdGMk": 1,
		"23_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"6_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"1_13tpq32fz7Uxq1bu6nG3tpmsbhHnufeqSL": 1,
		"1_16hRVH2kB8RkgEacVasTFn3XpE82TC8wRX": 1,
		"18_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"785_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1144_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"66_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"30_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": 1
	}
}