{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1603108180,
			"title": "ZeroWiki zgodne z kodowaniem Mediawiki",
			"body": "Witam. \nSzukam szablonu Zeronetowej \"wikipedii\" , która akceptuje kodowanie w stylu Mediawiki , czyli np. \nw mediawiki tytuły pisze się tak: ==TYTUŁ H2==\nnatomiast na zeronetowych wikipediach piszę się tak ##TYTUŁ H2 . \nZeronetowe wiki są zgodne w kodowaniu z githubem, ale nie są zgodne z mediawiki.",
			"added": 1603108179
		},
		{
			"topic_id": 1605934228,
			"title": "Użycie Zerotalk Polska jako forum na stronie www",
			"body": "Chciałem umieścić ZeroTalk Polska jako podstrona mojej strony www - http .\nCzy jest to wykonalne ?\nZauważyłem, że jest problem z generowaniem nowych certyfikatów. Panie Druid i spółka, czy moglibyście dać mi jakieś podpowiedzi?\nZ góry dziękuję, odwdzięczę się.",
			"added": 1605934226
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1603108180_1Amyu1Po4qug9Y1qdbCk4saNYCSKzBszvd": [
			{
				"comment_id": 1,
				"body": "Czy możecie coś polecić ?",
				"added": 1603108217
			},
			{
				"comment_id": 2,
				"body": "Robię projekt związany z 0net i potrzebuję takiego szablonu wiki.\n\nNo nic, będę musiał sam go zakodować. \n\n(Nie) Dzięki za rady moralizatorskie.",
				"added": 1603245125
			}
		],
		"1605934228_1Amyu1Po4qug9Y1qdbCk4saNYCSKzBszvd": [
			{
				"comment_id": 3,
				"body": "Dziękuję Panowie. Tak jestem świadomy , że będzie to miało na celu głównie promocję ZeroNetu oraz zmuszenie użytkowników do korzystania z oprogramowania ZeroNet do pisania postów. Podam więcej szczegółów jak zacznę działać.\n\nTo co mnie głównie martwi to to, czy  można generować nowe certyfikaty  (np. ZEROID), ponieważ ostatnio napotkałem z tym problem. Wiecie coś o tym ?",
				"added": 1606075585
			}
		],
		"1606679881_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 4,
				"body": "Szkoda niewinnych dzieci, \nale niestety naiwni ludzie zasługują na to co ich spotka... \nTyle razy tłumaczyłem komuś, że szczepionka na cv-19 nie jest sprawdzona pod kątem powodowania nowotworów, ale on wierzy w to co telewizja gada...\n\nPo prostu durni spotka zasłużony los :(",
				"added": 1607412783
			},
			{
				"comment_id": 5,
				"body": "w szczegolnosci, że w Polin już prawie mamy odporność stadną ... około 50% testów pcr daje wynik pozytywny, co oznacza, że już 50% albo przeszło albo ma \"to co mierzą testy\"\nZaszczepią ludzi i powiedzą , że ich to uodporniło, a tak naprawde uodpornili się sami. \n\nMam nadzieję, że to tylko jest sposób na zebranie miliardów dolarów, uzaleznienie ludzi od przemysłu amerykańskiego, a nie będzie to obowiązkowy zabieg i nie będą gnoić ludzi , którzy tego gówna nie przyjmą. \n\nW każdym razie , nadzieja jest matką głupców i jedynym sposobem na obronę przed \"rzadami pieniądza\" jest tworzenie lokalnych grup , skoncentrowanych wokół zapewnienia dzieciom (i sobie) wartościowej, głębokiej edukacji i staranie się o rozwój handlu wymiennego... to brzmi abstrakcyjnie, ale handel wymienny pozwala zaoszczedzić z 40% pieniędzy , rozwija przedsiębiorczości i jednoczy ludzi. Wymaga jednak posiadania \"twardych i porządanych\" umiejętności.",
				"added": 1607496717
			}
		],
		"1607453657_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 6,
				"body": "Nie zablokuja Rosji, bo lody północy topnieją i niedługo przejście północne będzie otwarte przez cały rok. \nBtw. ruscy uczeni prorokują w 2030 roku ochłodzenie klimatu... więc różnie z tym może być ... :P",
				"added": 1607497033
			}
		],
		"1629535835_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 7,
				"body": "Tlenek grafenu = dwutlenek węgla . Idioci pouczcie się trochę chemii. Grafen i diament są jedynie alotropowymi formami węgla. Ich tlenki to dwutlenek węgla i tlenek węgla. Piliście kiedyś wodę gazowaną ? To już napiliście się tlenku grafenu.",
				"added": 1632598725
			},
			{
				"comment_id": 8,
				"body": "Poza tym, grafen posiada właściwości nadprzewodnika wtedy gdy jego płaty są dość duże - wtedy mogą się w nim wytworzyć znaczace prądy wirowe pod wpływem oddziaływania elektromagentycznego. \n\nPouczcie sie fizyki ...\n\nKsiążki z tych dziedzin znajdziecie na tej stronie w dziale literatura: Dyplom.edu.pl",
				"added": 1632598946
			}
		]
	},
	"comment_vote": {}
}