{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroSites - a catalogue for ZeroNet Sites",
			"body": "http://127.0.0.1:43110/1SiTEs2D3rCBxeMoLHXei2UYqFcxctdwB/",
			"added": 1497131425
		},
		{
			"topic_id": 2,
			"title": "The Erotica Archive (TEA) -- WIP collection of rare/endangered fetish literature",
			"body": "http://127.0.0.1:43110/1ErosKFQQG3R2Ljd9MFXtsQiwVZ7gxxEop",
			"added": 1511858758
		},
		{
			"topic_id": 1545094367,
			"title": "ZeroVoat (the Reddit of ZeroNet)",
			"body": "http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html",
			"added": 1545094364
		},
		{
			"topic_id": 1573922561,
			"title": "HK VOD",
			"body": "A place for Hong Kong people and ally to post links, video, photo, and articles about content that you care.\nhttp://127.0.0.1:43110/1HKvodf1BsGATe7RQkpk61b8XEVkvVDDtB",
			"added": 1573922557
		},
		{
			"topic_id": 1574159478,
			"title": "In Another World with My Smartphone",
			"body": "In Another World with My Smartphone\n異世界はスマートフォンとともに\nIsekai wa Sumātofon to Tomo ni \n\nhttp://127.0.0.1:43110/12BWbKDvY4PRSpFr7ucWd4PPSEXAmmVLMV/",
			"added": 1574159473
		},
		{
			"topic_id": 1576134897,
			"title": "|><||> zerome alternative frontend",
			"body": "http://127.0.0.1:43110/sakana.bit/",
			"added": 1576134891
		},
		{
			"topic_id": 1578611102,
			"title": "The Cheapskate's Guide to Computers and the Internet",
			"body": "http://127.0.0.1:43110/1CpqvBQWSzZSmnSZ58eVRA9Gjem6GdQkfw/",
			"added": 1578611095
		}
	],
	"topic_vote": {
		"1_18zH6Av8AX7XdEW9PNFeb8QCs4QdMTVaYB": 1,
		"3_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1,
		"2_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1_1ErztKQMS3NnMxo5fsQoWQTrUPf3c68XXo": 1,
		"1545094367_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1576130497_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": 1
	},
	"next_comment_id": 21,
	"comment": {
		"3_19o28kY46qs4yztgepknRtS6HULZpQhiT7": [
			{
				"comment_id": 1,
				"body": "Have you heard of [Antilibrary.bit](http://127.0.0.1:43110/Antilibrary.bit)? It's doing much the same thing, but integrating IPFS on their backend.",
				"added": 1488929325
			}
		],
		"2_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 3,
				"body": "site's pretty well seeded now, and has over 450KB of content. more coming on a psuedo-regular basis.",
				"added": 1512456142
			}
		],
		"1545094367_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [],
		"1541263546_1QCMg6ZqmUAFd1MGyc2g2j6NDep2GANfAC": [
			{
				"comment_id": 5,
				"body": "So where are the christian patriots?",
				"added": 1557019653
			},
			{
				"comment_id": 7,
				"body": "What reason do you have for believing in a deity? Do you have any evidence?",
				"added": 1557069750
			},
			{
				"comment_id": 8,
				"body": "> [quantumworld](#comment_30_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Mark Zukaberg\n\nlol. That is funny......",
				"added": 1557072306
			},
			{
				"comment_id": 9,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_6_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): of course, get on all four legs, observe the insects and plants, and you will see that this whole little world is intelligent:(that it acts according to what it knows and 'have experimented'). Moreover, instinctively, let us take a colony of ants, the queen knows WHAT SHE NEEDS TO PRODUCE 'IN ADVANCE' OTHERWISE THE COLONY IS DEAD.INSTINCTIVELY IS THE KEYWORD, BELIEVERS CAN'T UNDERSTAND. [...]\n\nI don't HAVE four legs lol. I see much evidence for evolution when I observe nature though.",
				"added": 1557072412
			},
			{
				"comment_id": 10,
				"body": "I'd like to believe that after death there is some wonderful utopia that we all go to where suffering and awfulness doesn't exist. The idea has no evidence to support it aside from being pleasant from a human perspective to believe. I really like to hear from someone who has a specific experience that supports the existence of a deity with clear evidence to support the experience.",
				"added": 1557072653
			},
			{
				"comment_id": 11,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_7_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): evolution;a funny one theory:an evolution that would evolve according to needs, but would not take into account; mistakes. [...]\n\nEvolution is based on the increased or decreased fitness of mutation in genetic code. Otherwise known as mistakes. It's not a forgiving world for mutant organisms with a fitness decreasing mutation. They either don't survive, or they don't procreate and pass their alleles on to future generations.",
				"added": 1557206119
			},
			{
				"comment_id": 12,
				"body": "Really? Unregulated cell growth commonly known as cancer isn't a mistake? Always caused by the lack of apoptosis or programmed cell death.....you're out of your league here. Go sing a hymn in a church somewhere.",
				"added": 1557243450
			},
			{
				"comment_id": 13,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_10_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Nature don't do mistakes. Breeders (of plants, of animals) cross species to give a new species: NO EVOLUTION NEEDED.\n\nInterspecies crosses don't work. Give me one example where breeding is possible and the outcome isn't sterile or unfit for survival. Hybridization of phenotypes within a species works, and I believe that is what you are referring to. The result however is not a new species.",
				"added": 1557243619
			},
			{
				"comment_id": 14,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_12_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're really stupid, according to you, how many dog species there are; thousands, how many cat species; thousands, how many rose species; thousands.the pollenization rose grower creates a new rose:for your culture, which doesn't seem 'to be very big':https://invidio.us/watch?v=gAwiF7il00k [...]\n\nSpecific examples of two different species of dog? Let's zoom in and examine some facts up close. If you're theories hold up to scrutiny I'll be happy to accept them.",
				"added": 1557265166
			},
			{
				"comment_id": 15,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_12_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're really stupid, according to you, how many dog species there are; thousands, how many cat species; thousands, how many rose species; thousands.the pollenization rose grower creates a new rose:for your culture, which doesn't seem 'to be very big':https://invidio.us/watch?v=gAwiF7il00k [...]\n\nTo assess different skin color as different species of humans is ridiculous. Prove to me that you're capable of comprehension and I'll be happy to explain it in great detail to you.",
				"added": 1557267125
			},
			{
				"comment_id": 16,
				"body": "> [quantumworld](#comment_42_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): It would be nice to see some New content on this site. People posting new content is what drives new traffic to your site. And if you lost your pw start a new one. And back up your Zeronet folder. Hard drives are cheap now days make one for just Zeronet if you want this platform to grow. And keep it running to build a better Zeronet.\n\nEncrypt it too, you may not agree with censorship, but it is likely your government does.",
				"added": 1557275798
			},
			{
				"comment_id": 17,
				"body": "> [quantumworld](#comment_43_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Encryption is a good idea. Just remember that on every storage device there is a bypass. If you want further information go look at the vault 7 leaks. If you know about computer science you will figure it out. The data spying is  BAD! Very Very BAD!\n\nI'll take a look. Data spying is power. Pure power, and access to nearly everyone on the planet. Likely people won't resist until they don't have enough food. By then it will be far too late to apply any remedy.",
				"added": 1557276525
			},
			{
				"comment_id": 18,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_14_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I'm not talking about the colour of the skin, but the shape of the skull, for example. Of the specific average height of a population. Of the length of a knee or forearm that is different from one group to another. [...]\n\nTypically species are differentiated by a variety of thresholds to breeding. Morphological, geographical, temporal etc. Homo sapiens sapiens has no barriers to copulation or fertilization. I suppose it depends on the nuances in the definition of species you choose to cleave to but generally  a species is a population evolutionarily independent of one another usually as a result of reproductive isolation.",
				"added": 1557359079
			},
			{
				"comment_id": 19,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_15_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"reproductive isolation\", precisely, is what makes endogeneity. [...]\n\nI'm not positive I understand where you are going with this, are you equating evolutionists with pedophiles? If you want to talk about the natural world, there are certainly justifications for older males who have demonstrated the ability to survive to breed young females even before the age of sexual maturity to ensure that their alleles are passed forward. There are numerous examples of this behavior in the natural world, and the gravitation of the unregulated internet towards depictions of youthful sexually available girls should adequately illustrate that humans are fundamentally just animals, sufficiently exposed to culture to mitigate the impulses of their reptile brain....in most cases.",
				"added": 1557371608
			},
			{
				"comment_id": 20,
				"body": "No. Nature does not strive to make differences between groups. The group as a whole strives to increase fitness through evolution....a process defined as increased fitness. You're just trying to draw hate lines based on observable differences. Pathetic.",
				"added": 1557436797
			}
		],
		"1_1NnLEbZgqNo9QfGuopF2Co7Dy152rp3Pim": [
			{
				"comment_id": 6,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lolAmericans who think they're nationalists,while their country has been one of the most infiltrated by Freemasonry historically.even their version of nationalism (patriotism) makes absolutely no sense, but they don't know that, little ignorant puppets that they are. [...]\n\nHitler and his generals bad strategists? WHAT? They ran out of fuel. Simple. I have ethical objections to that leader's philosophies, but of all the things Hitler was, a bad strategist is not one of them.",
				"added": 1557019860
			}
		]
	},
	"comment_vote": {
		"42_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1
	}
}