{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1615515631,
			"title": "Why not a single black of the NFL or NBA or so called entertainment said a single word about pedogate",
			"body": "Chainz or Happyness? One option they ain't free and still slaves (aka don't care about justice etc, specially when it concerns white kids, keep their wealth etc) or they enjoyed it, as long as it's white kids (hate etc).\n\nWhat is your explication?\n\n",
			"added": 1615515630
		},
		{
			"topic_id": 1615516977,
			"title": "How many industries has the GMO/DNA/RNA industry wounded with the covid release?",
			"body": "Wouldn't it be time to maybe calculate that the costs aren't worth it? ahh, nothing will be too much for the transhumanist agenda. The goal being to treat life itself as a windows OS, you pay for the \"patches\" or you die... a clever way to corner life itself. I guess we resisted too much with frankenfood already to their tastes. Or it's an alien taken over :).",
			"added": 1615516975
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 1,
				"body": "Priviet Komrades !",
				"added": 1615484108
			}
		],
		"1615440077_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 2,
				"body": "At least, I am sure she and her prince don't care at all about Assange or all the rapes victims in the UK ! They laughed, feasted and drank tea but of course they aren't RAYCISTS... they are just \"nobles\".\n\nfrom https://www.gatestoneinstitute.org/3068/muslim-child-rape-gangs-britain\n\n>The Liverpool Crown Court heard horrific testimony from five victims -- the youngest was 13 when the abuse began -- who were plied with alcohol, drugs and gifts so they could be \"passed around\" among a group of men aged between 24 and 59 for sex in apartments, houses, cars, taxis and kebab shops.\n>... \n\n>According to experts interviewed by The Telegraph, while white pedophiles generally operate in isolation, the Muslim-led grooming is being done mostly by large numbers of men acting as a group. Several of the men on trial in Liverpool apparently told their victims that it was all right for them to be passed around for sex with dozens of men \"because it's what we do in our country.\"\n>... \n\n>Although five girls testified at the trial in Liverpool, British police are pursuing leads that the Rochdale gang exploited at least 50 other girls.\n>... \n\n>The victims came from 13 towns and cities and in each case two or more men were convicted of offenses.\n>...\n\nSo when you see those royals on tv, don't forget which side they have chosen.\n\nhttps://en.wikipedia.org/wiki/Rotherham_child_sexual_exploitation_scandal\n\n>Cases highlighted by Norfolk included that of a 15-year-old having a broken bottle inserted into her; a 14-year-old being held in a flat and forced to have sex with five men; and a 13-year-old girl, \"with disrupted clothing\", found by police in a house at 3 am with a group of men who had given her vodka. A neighbour had called the police after hearing the girl scream. The girl was arrested for being drunk and disorderly, but the men were not questioned.[13][148]\n\n",
				"added": 1615487290
			}
		],
		"1615468688_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 3,
				"body": "> [ihaphleas](#comment_38_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A): China is a tyranny ... the west is only slightly better.\n\nIt's much \"worse\" than you could even imagine :\n\n> The people's democratic dictatorship led by the working class and based on the alliance of workers and peasants, which is in essence the dictatorship of the proletariat, has been consolidated and developed.\n\nhttp://en.people.cn/constitution/constitution.html\n\nSlightly better? excuse me please : weinstein? 2 arrests or :\n\nfrom https://www.gatestoneinstitute.org/3068/muslim-child-rape-gangs-britain\n\n>The Liverpool Crown Court heard horrific testimony from five victims -- the youngest was 13 when the abuse began -- who were plied with alcohol, drugs and gifts so they could be \"passed around\" among a group of men aged between 24 and 59 for sex in apartments, houses, cars, taxis and kebab shops.\n>... \n\n>According to experts interviewed by The Telegraph, while white pedophiles generally operate in isolation, the Muslim-led grooming is being done mostly by large numbers of men acting as a group. Several of the men on trial in Liverpool apparently told their victims that it was all right for them to be passed around for sex with dozens of men \"because it's what we do in our country.\"\n>... \n\n>Although five girls testified at the trial in Liverpool, British police are pursuing leads that the Rochdale gang exploited at least 50 other girls.\n>... \n\n>The victims came from 13 towns and cities and in each case two or more men were convicted of offenses.\n>...\n\nor from https://en.wikipedia.org/wiki/Rotherham_child_sexual_exploitation_scandal\n\n>Cases highlighted by Norfolk included that of a 15-year-old having a broken bottle inserted into her; a 14-year-old being held in a flat and forced to have sex with five men; and a 13-year-old girl, \"with disrupted clothing\", found by police in a house at 3 am with a group of men who had given her vodka. A neighbour had called the police after hearing the girl scream. The girl was arrested for being drunk and disorderly, but the men were not questioned.\n\nSo what are you talking about fool?\n\n\n> [captain404](#comment_12_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): that's false, during hk protest they had story of police abusinf every right possible. And other shit way way more darcker, u should investigate\n\nyou mean \"vanning\" cia and mi6 assets? poor them. Remember 2 systems ONE country aka cia/mi6 only faced the MSS/PLA... \n\n>The Chinese people and the Chinese People's Liberation Army have thwarted aggression, sabotage and armed provocations by imperialists and hegemonists, safeguarded China's national independence and security and strengthened its national defense.\n\nhow is Julie going? how many kids already?",
				"added": 1615487963
			},
			{
				"comment_id": 4,
				"body": "I guess not a single black of the NFL or NBA or so called entertainment said a single word about pedogate, right? They have been well trained, it seems.",
				"added": 1615491469
			},
			{
				"comment_id": 6,
				"body": "You try to use too easy words, or catch phrase, to describe something too complex for your intellectual capacities and current understanding of the world. \n\nremember what you know about china, you know it because of western medias. Haven't they lied to you enough? Which north korean media do you know?",
				"added": 1615514830
			}
		],
		"1615458168_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 5,
				"body": "Dilma Rousseff was like bidet admin, a third term of Lula. At least Bolsonaro believes in God, Family, Guns... I can't ask for more, and contrary to those leftist UNO / global agenda seems to be a real patriot. But again time will tell. when the western left supports someone, you know it's a bad person.",
				"added": 1615514664
			}
		],
		"1615237176_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": [
			{
				"comment_id": 7,
				"body": "As long as they live, America will be under occupation.",
				"added": 1615515024
			}
		],
		"1578088043_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 8,
				"body": "Thanks !",
				"added": 1615515090
			}
		],
		"1615442560_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 9,
				"body": "would be nice to see a silencer appears slowly in the frame and the end of this traitor, live ! Ideally I would put a \"plate\" near the camera lense to have a more interesting angle to this execution. At least america is still occupied tonight. easy marker.",
				"added": 1615516158
			}
		]
	},
	"comment_vote": {}
}