{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1614539923,
			"title": "best internet browser",
			"body": "i use vivaldi cause is degoogled and had good privacy feature and fonctionality\nopera is now detained by a chineese corporation so no more\nchrome is google so what s more to say\nbrave work great have no idea on privacy respect or other stuff\nwhat do u use for wich reasons ?",
			"added": 1614539922
		},
		{
			"topic_id": 1615534190,
			"title": "Ban users",
			"body": "How u ban users to be sure to not host nor never viewing their content ?",
			"added": 1615534188
		},
		{
			"topic_id": 1616048962,
			"title": "internet archive for zeronet",
			"body": "i think it could be realy great since we have blockachin and decentralized",
			"added": 1616048959
		}
	],
	"topic_vote": {
		"1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": 1,
		"1614298638_1M77v8LSvJyW7ThTD1Z46CVBYfi8y1SpaW": 1,
		"1617682154_1JWZXEvbBFR9yXCndM4R9FdV9ZJPVXniT7": 1,
		"1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1621568781_1PSeiYvqdseW3aoqEV5gddDRr7gCHSJPHB": 1
	},
	"next_comment_id": 43,
	"comment": {
		"1614298638_1M77v8LSvJyW7ThTD1Z46CVBYfi8y1SpaW": [
			{
				"comment_id": 1,
				"body": "hiii",
				"added": 1614459936
			}
		],
		"1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 2,
				"body": "> [jeff](#comment_94_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Open Vivaldi's settings and click the Privacy tab. There are a dozen or more Google (dis)services enabled by default.\n\ni have seen, and i have uncheck most of them. On chrome im not sure u can desactivate those",
				"added": 1614792222
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_2989_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): GNOME Web is a good one. [...]\n\nfirefox is not anymre what it use to be",
				"added": 1614792328
			},
			{
				"comment_id": 4,
				"body": "> [boot13](#comment_20_1PxMvud9KvbqaSZnV4piygA6dFTASwapHY): I'm not sure what you meant by 'degoogled', but are you aware that Vivaldi uses the Chromium browser engine? Chromium is maintained by Google. On the other hand, there's this official statement from Vivaldi: \"In short, as it’s unable to get any data from Vivaldi users, Google does not benefit from Vivaldi being based on Chromium.\"\n\ni know all of that. i just wanted a browser withoutending freedata to google about things they shouldnt be aware just if i go on wikipédia",
				"added": 1614792419
			},
			{
				"comment_id": 5,
				"body": "> [transcoder](#comment_24_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): i like librewolf because it gives all the features of firefox, most importantly the addon support, while being insanely hardened right out of the box.\n\nthanks i wansnt even aware firefox has fork",
				"added": 1614792513
			},
			{
				"comment_id": 6,
				"body": "> [atdandotnet](#comment_6_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu): luakitnyxtw3m\n\ngoing to have issue for youtube with mw3, still funny to see someone build it",
				"added": 1614792551
			},
			{
				"comment_id": 7,
				"body": "> [royalabyss](#comment_1_1HwjLB3LDWdDwoLKkUpYZg3ZzyjqW1pxK6): I usually use brave, what do you mean by privacy respect? would love to know if it's something concerning.\n\nI  just know modern browse have way to many flaw regardding security. Like with webrtc u can patch nearly all of this but it s hard after to make some website work. i dont know if it s concerning i just know privacy is a right and god thank foss it will be hard without them",
				"added": 1614793111
			},
			{
				"comment_id": 8,
				"body": "> [calmdownholden](#comment_19_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): I don't trust any browser that is \"privately\" owned and doesn't have an opensource counterpart.The larger the company, the more whistleblowing eyes there are.Yes, large companies are often corrupt as well, but I the numbers game over \"good faith\" claims any day.Statistics are always more reliable than faith and intuition.\n\nwhen i use vivaldi i compile it from open source but it s a good point. I nowbasc of programing but i have no clue if vivaldi respect my orivacy but i think i trust people on internet before the internet or the social media dollars",
				"added": 1614891552
			},
			{
				"comment_id": 9,
				"body": "> [calmdownholden](#comment_21_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Asking people what kind of browsers they use?Do you expect anyone to fall for th... just kidding. [...]\n\ni fall on the first joke,\nbut it s mainly the history of hicar i wan perfection but perfection willl fail me, the same i will never go on youtube on torr icar fly to the sun",
				"added": 1614891652
			}
		],
		"1614952464_15PBP7E1m1G82N5r5AoXUFMinSuqD3KnBT": [
			{
				"comment_id": 10,
				"body": "well personaly i love the idea of an \"responsable-web\" where u have to host what u share. Zeronet have big software flaw and it s not tottaly the best it can be, one time on a zite for musicc i have upload 2000 song in 3 sec and nobody can acess them because m no google, they have to download th db with my zic an an forgotten account, also the software havent any significant update since long time But i love the idea and i will suport it. I have join several time and it s always quite the same activty overall i say. Also it s mainly depends on your regions or connection so maybe u haventall seen ? But i do think the base idea is quite genious, if u base all software and hardware interaction with this sytem u could have your smartwatch only syncing to your phone and u should authorizate for wifi, or other stuff like that but i think the idea is quite genius",
				"added": 1615327998
			},
			{
				"comment_id": 11,
				"body": "> [captain404](#comment_10_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): well personaly i love the idea of an \"responsable-web\" where u have to host what u share. Zeronet have big software flaw and it s not tottaly the best it can be, one time on a zite for musicc i have upload 2000 song in 3 sec and nobody can acess them because m no google, they have to download th db with my zic an an forgotten account, also the software havent any significant update since long time But i love the idea and i will suport it. I have join several time and it s always quite the same activty overall i say. Also it s mainly depends on your regions or connection so maybe u haventall seen ? But i do think the base idea is quite genious, if u base all software and hardware interaction with this sytem u could have your smartwatch only syncing to your phone and u should authorizate for wifi, or other stuff like that but i think the idea is quite genius, it should have been a comunication protocol and today internet will be much better",
				"added": 1615328259
			}
		],
		"1615468688_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 12,
				"body": "that's false, during hk protest they had story of police abusinf every right possible. And other shit way way more darcker, u should investigate",
				"added": 1615483674
			},
			{
				"comment_id": 13,
				"body": "> [akmluser1](#comment_3_19482XG7NpQFrmCoWBcW4LypTKXhoh4qZc): It's much \"worse\" than you could even imagine : [...]\n\nJust look at how much rich have been delete in 2 second on the trial where they said traitor and bam delete without any  proof or anything. Their constitution might be great the true is i dont believe i have the right to defend my  right. \n\nhttps://en.wikipedia.org/wiki/Causeway_Bay_Books\n\nWeinstein isnt a governement like everything you link, also on what u link nothing new to me. A great argument for you could have been spaking about time where us done shits worst or comparable, like mkultra and other shits like that. If china is so  great why the have issue with winie the pooh ? It s totaly not arbitrary censorship. Also i love how chineese media have this feelings of north korea media\nhttps://i.redd.it/lmemksw8jem61.jpg\n",
				"added": 1615497339
			},
			{
				"comment_id": 15,
				"body": "> [akmluser1](#comment_6_19482XG7NpQFrmCoWBcW4LypTKXhoh4qZc): You try to use too easy words, or catch phrase, to describe something too complex for your intellectual capacities and current understanding of the world.  [...]\n\nyea i can agree freedom in china is way to more complicate for my intellect. No what i know about china isnt just western media. North korean media i know.... i have forget the name but it s not hard they have only one tv chanel iwht this old lady presenting the tv during 40year. My question is why u defend them ? u work for them ? Or its by generosity ? i mean if you'r in china just ask your alexa, siri ( vocal assistant ) to telling u the true about Tian'anmen. Do it for me u will ?",
				"added": 1615533988
			},
			{
				"comment_id": 16,
				"body": "> [wallsofwar](#comment_9_1BtouoUYE8PPURnHctAdfCjzmNzrwJhWnm): why? I prefer to be a minority in NK or China, knowing that I always be a foreigners and adapt rather than to have to adapt to suckers who seek to white genocide me, replace me with foreigners and rape kids... anything else? constant bail out... [...]\n\nu realy want to be a minority in china ? Ask Ouïghours how they are doing. About suckers who seek white genocide well dont die i guess. but im sure if u go full lgbtqia+ even whiite u can bonus point give it a try",
				"added": 1615541086
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 14,
				"body": "> [baduser](#comment_27_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): he hates and fears the Internet because he can't control it fully.\nWhat i do knwo is russia in one push on a button loose connection to the exterior, and this work too for internet. I dont think he fear it, internet is more a bonus for people in power. They have their own facebook that is open to the kremlin.",
				"added": 1615499282
			}
		],
		"1615534190_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 17,
				"body": "> [wallsofwar](#comment_8_1BtouoUYE8PPURnHctAdfCjzmNzrwJhWnm): you can't sucker ! go back to twitter, you will be safe for your take over :D.\n\ni dont think u understand how it s work cause i totally can. And it s  necesary cause otherwize u could host unwanted illegal content. u just click on the 3 dot and u click mute users. but i search at the lowest lvl posssible. So i have checked and yea just like that u can comunicate with me on the entire network",
				"added": 1615541286
			},
			{
				"comment_id": 18,
				"body": "> [cvs77user1](#comment_3_13PRLtXnYDj2ovZW1NeDJpE9ZnCpW51tPg): the problem is that captain404 can't cope with encensored speech... he is going all crazy inside the code to find a way to censor nodes to remove user forever  :) hehehehe  a classical demoncrat :). [...]\n\nu have issue distinguish censored speech and just not agree with ccp propaganda",
				"added": 1615733738
			}
		],
		"1616048962_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 19,
				"body": "> [spacehorizon](#comment_5_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f): zerotechtalk : http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/\n\nthanks pal",
				"added": 1616049254
			}
		],
		"1615798999_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 20,
				"body": "> [reflektion](#comment_10_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8): isn't this an option on pretty much every single online platform?\n\nyes but here it make much more sens, cause u also block upload of that id so so much better than just mute someone on fb or twitter",
				"added": 1616364776
			},
			{
				"comment_id": 21,
				"body": "> [gungraber](#comment_1_1K8bF1myH44sV7RTyriZqX6TCtbcRmTAym): Your plan isn't to mute users for your convenience, but to censor them by not relaying their data? What are you doing here captain404?\n\ni came for the plurality of opinion but that doesnt mean i must endorses those, also because thei are some fucking illegal content and i dont want share it and some opinion are just bad as a point i dont think anybody need them. the concept of freedom is dont owne anything to anybody, do wahtever u want just dont be shocked if people disagree with u and dont want host or be responsible for your shit",
				"added": 1616493448
			},
			{
				"comment_id": 22,
				"body": "> [gungraber](#comment_2_1K8bF1myH44sV7RTyriZqX6TCtbcRmTAym): On zerotalk it's only text. Do you oppose the 1stA of the bill of rights?\n\nyes i have my own idea about right and freedom and stil u call me censor, but i dont owne u any hosting stop ignoring that",
				"added": 1616493762
			},
			{
				"comment_id": 23,
				"body": "> [gungraber](#comment_4_1K8bF1myH44sV7RTyriZqX6TCtbcRmTAym): Could you maybe expand on your own ideas about the 1stA ? Your problem is that you would have to rewrite the ZN code, integrate a seed ban linked to an interchangeable crypto address... In short you are better muting users whose text is unbearable to your mind.\n\nabout the 1stA my idea on it are none cause im not american and dont live under those law, and generaly when u take  decision based on morale it s compliant with law. Also to be legally precise u cant even bring the 1stA cause it doesnt complywith zeronet. Im your punlisher and as publisher i do what i want. It s not the same that fb or yt who impeach some narative. In any way i impeach you to say what u want want i just dont publish it. My point is just i dont want crap i dont endorse on my hardware.",
				"added": 1616495412
			},
			{
				"comment_id": 24,
				"body": "> [c17h21no4](#comment_22_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31): you should read more about decentralized p2p sharing system, like dlt, torrent, btc... go prune yourself, you are muted soon...\n\nfair it s called freedom and u seem to have issue with the understanding of this, cause i have never seen any chinees app who defend your freedom. Just try winie the pooh in 10 sec u could test your freedom. Also how many different account you create ? about  p2p just try to learn me something i dont know i just want to see how funny u can go ( dont embarass youserlf ;) Also u dont have to wait for china cause u know they are already a lot of solution maybe do your research, i mean if your are in china im no suprised was u r not aware of this\nhttps://www.privacytools.io",
				"added": 1616497029
			},
			{
				"comment_id": 31,
				"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1515834496_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2",
				"added": 1617668469
			},
			{
				"comment_id": 34,
				"body": "> [certy](#comment_9_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif): you still haven't been unable to explain how you understand freedom of speech, and what restrictions you find appropriate.\n\nSay whatever the fuck u want unless u want me to host it. My host my rules. Stop being so pitty about freedom of speech the issue is not u r cancel and cant say whatver u want the issue is it s supid af and nobody want to bother with u. \nHowever I fully support CCP choices in regards to how they handle anything\nare we agree ccp is chineese comunist party ? cause i dont know in which world u think u have more freedom in china ? yes i know in on place this is true we call this place the great propaganda departement of the ccp. Just tell me what happen in Tiananmen Square in 89 ? that will proove your believe in free speech.",
				"added": 1617740015
			},
			{
				"comment_id": 35,
				"body": "> [kazimir](#comment_4_1HLrjtGEat9GB6HSJRmm2ivRbvSnQy6F37): I do too believe to have way more free speech in china than anywhere in the west. [...]\n\ni see your pov but it s really stupid. why believe you have free speech in a countr ywho ban winie the pooh cause xi wasnt finding it funny. u never adress any of my take on whyu dont have freedom of speech. Stil u just write your nonsense. Just go in china with winie the pooh material and some stuff like tianemen square and i can promize u can t even enter or never can t left will depend of your  nationality",
				"added": 1617783612
			}
		],
		"1616553738_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 25,
				"body": "that's cool, cause before they use their nuclear waste to do missille, and after irak strangely they start to have a lot more baby with malformation in the regions",
				"added": 1616622630
			},
			{
				"comment_id": 26,
				"body": "> [xcape2net](#comment_838_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Sounds doubtful.  No useful information is given in the article.\n\nfind another one with more information. the plan is to have nuclear contain in a diamond. It s not cheap and not secure, maybe theyr will never be any civil application. Also from what from many source i think they are still in devlopement phase so if something goes wrong or can t be done we will never see that technologie live.\nthey have recive money one year ago at some competition and they claim to have raise more than 300M in total. \nThey have an internet website and from what i see i dont think they can devlop what they claim.",
				"added": 1616629396
			}
		],
		"1616777685_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 27,
				"body": "> [sabretooth](#comment_4_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU): I find this hard to believe, a source would be nice.\n\nhttps://en.wikipedia.org/wiki/Intel_Management_Engine.\n\nU can find a lot about the subject if u search. It s well known since a long time, where everybody has doubt about it is it was several time a vector to attack, even had this story where asus has his key to sing update stolent and they use it to infiltrate laptop. And nsa/cia ask intel to give them cpu without intel me",
				"added": 1617001901
			},
			{
				"comment_id": 28,
				"body": "> [sabretooth](#comment_5_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU): I'm not referring to the Intel variant, I'm referring to the AMD variant.\n\nhttps://www.phoronix.com/scan.php?page=news_item&px=AMD-PSP-Disable-Option\nIf u r lucky and have the right mobo u can  go out, for everybody else it s excatly like intel me.",
				"added": 1617005351
			},
			{
				"comment_id": 29,
				"body": "> [aplayer](#comment_5_14JFttTvjwR9PitBWPMU8FEqRCwACAeekM): I just know amd is baddest company at architecture design. I have 2 amd expensive graphics that are not usable.\n\nunlucky cause rn amd destroy everything on rasterisation power on their gpu for less consomption than the competition. But who can buy a gpu those days ?",
				"added": 1617570292
			},
			{
				"comment_id": 30,
				"body": "> [coplanar](#comment_4_1KZdUJK67R6bzE4w2tXQTvkKNfmsqubWoD): You sound like a fucking schizo. If you want, put your computer in a Faraday cage.\n\nthat doesnt even fix the issue.",
				"added": 1617627794
			},
			{
				"comment_id": 33,
				"body": "> [oscarwilde](#comment_5_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG): ARM is no good also, as my Raspberry Pi and Google Pixel have shown (besides every iPhone and Android from family). [...]\n\nwtf mate, u know every arm soc dont come with 4G/gps or those kind of connection",
				"added": 1617739455
			}
		],
		"1617682154_1JWZXEvbBFR9yXCndM4R9FdV9ZJPVXniT7": [
			{
				"comment_id": 32,
				"body": "thanks sir, love the big irons. U should have maybe put less song if u cant host them. I explain if u put one song the chance for it to be dl and seed is higher than if u put 1000 songs. That s great to share put u have to be online or nothing will be share. im going help u host those one pm me when you are online so i can dl them. ( i dont know for u but i try to have flac song if u interested i culd send u the flac one)",
				"added": 1617739302
			},
			{
				"comment_id": 36,
				"body": "> [soundtracks](#comment_2_1JWZXEvbBFR9yXCndM4R9FdV9ZJPVXniT7): i can play also your music, great work! if you want you can try to publish flac files, but i dubt can be seeded easily\n\nflac dont work, but it s kind of overkill some good old mp3 always work and everywhere",
				"added": 1617924255
			}
		],
		"1617932358_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 37,
				"body": "lol, u should try to understand what u read. Mob are on xml blockchain. xml is kinda unsellable everywhere cause of the privacy feature like monero but in worse. xml have all ben issued at their creation u can t mine xml. What they are doing is simillar to what telegram has donne (or try to do). u should rename your news signal test crypto payment solution causer the stuff is not even in the ap rn. It s a new crypto u can t even buy rn. Yes you should question why this crypto has value and what make valuable but your stuff is just a child who cry cause he dont want crypto without even understanding what that does implie. like he say at the end of the arctivle\n\"As for cryptocurrency, a topic we effectively do not cover on OSNews – I’m not saying cryptocurrency is by definition shady, but let’s just say I don’t read many stories about cryptocurrency that instill me with any confidence in its trustworthiness and stability in any way, shape, or form. The technology in and of itself is cool, but what people are doing with it is, well, not.\"\nhe just dont like crypto. and the ragument of lack of privacy cause of this feature are laughble where it comme from ?",
				"added": 1617978669
			}
		],
		"1618137037_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg": [
			{
				"comment_id": 38,
				"body": "+1",
				"added": 1618142166
			},
			{
				"comment_id": 39,
				"body": "> [drcarl](#comment_9_1AjYqBvptvn6szy3VytC28obDFqsBM27jp): zeronet is the best p2p opensource platform I ever tried, because of the mute function, so a state operator like captain404 can be muted to never read his filthy propaganda ever again, if I wish so, not if a higher than me authority (how possible, lol) decides...\n\nu dont have finish to make 10 account a day ? u still dont understand u dont need more account just writting better stuff on another subject that the shit trending in your qanon feed. It was funny 10 min. At least you will certainly finish in a blacklist for spamm. What shock me is how i know wich account are yours cause u write the same shit and without any contact in t heir existence they still do you 3yo game no i defend freedom meanwhile u bad nazi. Are u an adult ? if u are challenge maybe we can make a special zone for u ",
				"added": 1618240583
			}
		],
		"1618547645_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [],
		"1618547913_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 41,
				"body": "if u dont boycott tv you ' r a mistake. u zaping make literral no change. Except if u can be 5% or 10% of all audience who zap u will do nothing except loosing your time and sanity",
				"added": 1618601551
			}
		],
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 42,
				"body": "without giving them an argument cause i dont thinkk they can formulate one, this vaccine we should be more caucious about it. Science is not every time perfect wwith no consequence sometime we find it year latter. Look at all product that has to be destroy cause we just discover some product in it are toxic. I certainly remember the time of pain and chineese plastic toys. And before discover u could use all of your argument and stilll u will be wrong one day",
				"added": 1621748666
			}
		]
	},
	"comment_vote": {
		"6_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": 1,
		"6_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"14_1Mn2C722jSxg6Fj7bf6oDYGZMnYdJy31tZ": 1,
		"1_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": 1,
		"13_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8": 1,
		"89_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1
	}
}