{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Forero se cruza con la gorda +DEP en RIP",
			"body": "https://www.forocoches.com/foro/showthread.php?t=6433471\n\nSe trasca",
			"added": 1526000219
		}
	],
	"topic_vote": {
		"2_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 1,
				"body": "Arguiñano.jpg",
				"added": 1525650320
			}
		],
		"2_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz": [
			{
				"comment_id": 2,
				"body": "A ver si es verdad y lo publican de una puta vez. Va siendo hora de callar bocas",
				"added": 1525729341
			}
		],
		"1_16EJxMVkL1bSt42y3KwjCGFXMWRZ44mQr5": [
			{
				"comment_id": 3,
				"body": "Acaba de resucitar el hilo. No es coña",
				"added": 1525737919
			}
		],
		"1_1Hv3dsJRh9qXXAPmt3i3BPFStncYMRVA3E": [
			{
				"comment_id": 4,
				"body": "Saludos a la GC.\n\nAh, no, aquí no XD",
				"added": 1525790898
			}
		],
		"1_1DiV63jkL4C9uqTAJ7kfuk465ifcrvBbeR": [
			{
				"comment_id": 5,
				"body": "Mientras no te llames heyplaya en otros lados y pongas algo con lo que puedan atar cabos para saber que eres tú está difícil que te identifiquen. Para consultar puedes hacerlo por la zeronet normal, para colgar algo siempre hay que usar tor, no tener nada más abierto con lo que te puedan rastrear y crear un usuario, a ser posible aleatorio, que no puedan relacionar contigo. Una vez subido el material, borrar la carpeta data de zeronet, en la que estarán los datos creados para el usuario aleatorio. También es aconsejable que la carpeta Zeronet esté en un ssd o una tarjeta de memoria o usb. Todo lo que sea memoria volátil va bien.\n\nSi sigues estos preceptos, sos inimputable hermano.\n\nSi tienes dudas, lo mejor que puedes hacer es buscar info de cómo cazaron a los responsables de Silk Road. Hay que evitar los descuidos que tuvieron.\n\nSaludos y buen forro",
				"added": 1525803906
			}
		],
		"7_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 6,
				"body": "Esa gráfica no quiere decir nada. Cada vez que la liamos en el floro pasa lo mismo. En poco tiempo todo vuelve a la normalidad.",
				"added": 1525980332
			}
		]
	},
	"comment_vote": {}
}