{
	"posts": [
		{
			"id": "142a0a99-fcb0-4369-b21c-68ee15dfa9ae",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "5ffd66ab-3933-4d44-b4d8-df009f55e531",
			"body": "Everything is going to be ok. I have a good feeling about this. Last time Q said for us to go wherever we thought best, and he would follow. He is probably busy, but, watching, and will show up wherever we end up congregating.",
			"time": 1565151686277,
			"files": "[]"
		},
		{
			"id": "a07b582f-5acd-44cb-8c10-db12ebd85532",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "a428da1d-76f7-4b22-9cfb-8321f46873a0",
			"body": ">>35a63705-fcf1-4397-861a-13d3205f245e\n>genious... The shills will end up being the seeds for the site ..\n\nI had not thought of this!\nI HAD been chuckling to myself as I struggled to figure out how to get here, that if \"I\" could do it, anyone could. And THAT would mean that they stepped on QResearch to squash it, but instead, a bunch of QResearch baby spiders are hatching on every computer comes here.... spiders that will now cover  their precious controlled internet with news, and no way to control it.\nEven if they re-establish the normie friendly QResearch up top for easy visits, this place here will give them hell every time they try to censor normiville.",
			"time": 1565155150056,
			"files": "[]"
		},
		{
			"id": "4ba980ec-e688-4c61-b2a5-cdd4f545f345",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "a428da1d-76f7-4b22-9cfb-8321f46873a0",
			"body": ">>2eab3046-cca1-46d5-b060-f4b82d9043f5\nWelcome Patriot XD",
			"time": 1565219520765,
			"files": "[]"
		},
		{
			"id": "aedeaf94-ac30-41ca-8443-8fbaeb109386",
			"directory": "users/17rEeDwJ1UrHPHSrqspzTQJVPAFFxK8xtS",
			"uri": "QResearch",
			"thread": "e5407dbb-f7d3-48ec-b4e4-afa542c56a2c",
			"body": ">>c3e34720-3f80-4040-9420-007eaedf7d6a\nThis is how I feel about it. The NSA spies on everyone anyway. So does everyone else. But research is not against the law, and we need to find a way to help our white/hats. Q is really a white hat, or he is a larp. If a larp, we are in for a war anyway. If a white hat working to help us help ourselves, we owe it to our ourselves and our military operators who risk their lives every day for our country, to do the best we can to keep \"being the news\". What we risk here is nothing in comparison. ",
			"time": 1565224631332,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}