{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "+1 и Привет всем!)",
				"added": 1483901948
			},
			{
				"comment_id": 2,
				"body": "> [3f3f](#comment_2_1yvSQH5Z7aJra4y9s6KG2kjLeGXYhNgn7): Кто посчитал ? :)\n\nМне кажется достаточно глянуть на количество сидов для Ru-ZeroTalk, я вижу 108, значит минимум столько русскоговорящих людей пользуется этой сетью)",
				"added": 1483912585
			},
			{
				"comment_id": 3,
				"body": "> [antignu](#comment_1_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Вовсе не обязательно. Думаю что этот форум китайцы сидируют, собственно и по GeoIP так.\n\nЗачем китайцам поддерживать русскоязычный форум? У них же есть свой, китайский)",
				"added": 1483919704
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 4,
				"body": "Не хватает общей бд для картинок. \"Было бы\" неплохо :) если все добавленные картинки на различные сайты в сети можно было найти через один ресурс(Или наоборот чтобы картинки загружались на один сайт а на другие уже с него вставлялись). Вышла бы неплохая галерейка(если конечно не учитывает всякое откровенное говн...) + еще музыку с видео прикрутить все было бы супер. Ведь что нужно людям? Общения и зрелищ).   Или может уже есть?",
				"added": 1484084757
			}
		],
		"1_1yvSQH5Z7aJra4y9s6KG2kjLeGXYhNgn7": [],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 6,
				"body": "Маловато народу что то здесь( Глухо как в могиле.",
				"added": 1484156342
			},
			{
				"comment_id": 7,
				"body": "> [shift](#comment_346_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): хех, рискнуть что ли в следующий раз?\n\nТочно, а то денег завались некуда девать.",
				"added": 1484222275
			},
			{
				"comment_id": 8,
				"body": "> [zalex](#comment_59_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): А кто-нибудь здесь работал с BTC-E PAMM?\nЧем тебя обычный форекс не устраивает? Еще и % с прибыли со своих же денег кому то дарить. Или мне лень я дам вам денег в надежде на прибыль? \nЧто то сомнительное. Зарегистрируйтесь, внесите деньги, а мы вам поставим плюсик. И чем больше денег внесете тем больше плюсиков получите! Потратьте плюсики на стратегию увеличения плюсиков. А потом вы сможете вывести плюсики обратно в деньги. Возможно)",
				"added": 1484224359
			},
			{
				"comment_id": 9,
				"body": "> [shift](#comment_348_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Ну некоторые биткоины покупали давно и по хорошему курсу...\n\nДа многие покупали. Многие и сейчас покупают. А некоторые весь свой бизнес строят на биткоине создавая так называемые шахты) \nРаньше во время становления биткоина для его покупки не нужно было потратить целую зарплату как сейчас а то и три(или 6сть в особо запущенных случаях) на одну целую единицу валюты. Сейчас мало людей готовы на такие траты.",
				"added": 1484407563
			},
			{
				"comment_id": 10,
				"body": "Но с учетом того что творится в одной далекой стране... когда дом могут отнять сказав что твое право собственности преступно купленная бумажка, а бизнес отжать или просто ночью разрушить(уже много подобных случаев произошло и наверное еще не мало их будет в будущем). \nВ такой ситуации иметь сбережения в крипто-валюте превращается из авантюры в необходимость, даже если ее курс будет скакать туда-сюда, ведь эти деньги никто не сможет отнять или заморозить счет.",
				"added": 1484409674
			},
			{
				"comment_id": 11,
				"body": "> [zalex](#comment_59_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): А кто-нибудь здесь работал с BTC-E PAMM?\n\nНа счет пама отличный ролик есть, хоть и не про тот сайт но в целом дельные замечания https://www.youtube.com/watch?v=OEXnKP3all8\n\nИ еще один ролик про биткоин от того же автора. +Можно много дельного почерпнуть из комментариев.\nhttps://www.youtube.com/watch?v=F-vXs59_Ceo",
				"added": 1484410601
			}
		],
		"1_19nB39bXLXo8trU1gs1XZPzPq58NGiNLKX": [
			{
				"comment_id": 12,
				"body": "Лучше посоветуйте платные и не в рф для постоянного пользования.",
				"added": 1484587648
			}
		],
		"1_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM": [
			{
				"comment_id": 13,
				"body": "> [get33](#comment_3_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM): И хотим тут запасной аэродром, чтобы не доверять вконтакту полностью. Если будет небольшой набег, просим прощения у коренных обитателей. Но у нас народ мирный, пока его физически не трогают.\n\nДля связи лучше использовать TOX или Signal(он же redphone с шифрованием телефонной связи при звонке через приложение). Twister для новостного оповещения.",
				"added": 1484671387
			}
		],
		"15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 14,
				"body": "Все тяжесть сайтов в картинках, музыке и видео. Текст же весит мало. Нужна общая бд для мультимедийных файлов, запрет на загрузку несжатого контента: только jpg, mp3(хотя flac лучше оставить) и webm c mkv. Также необходим механизм категоризации и именования загруженных в сеть файлов, чтобы по этой общей бд можно было искать... ну например кисок) добавляя их на диск для дальнейшего пользования и поддержки файла в сети. И все это должно храниться в папках с понятными названиями, в которые можно легко зайти не через браузер и добавить музыку в тот же Aimp, а папку с картинками добавить к библиотеке \"изображения\" в windows или любой другой системе.",
				"added": 1484760294
			},
			{
				"comment_id": 15,
				"body": "Это необходимо для рационального использования дискового пространства. Каждый хранит только то что ему нравится и имеет прямой доступ к файлам, а не ищет в папках пользователей в папках различных сайтов(иначе когда сеть вырастет это будет помойкой невероятных масштабов от хранения которой пользователям не будет никакого толку, для этого есть frenet хранишь кучу гигов не пойми чего...). Без этого находя музыку или картинку в сети приходится ее дублировать загружая в отдельную папку, при этом дубль ее где то среди папок юзеров зеронета, это бред имхо.",
				"added": 1484760709
			}
		]
	},
	"comment_vote": {}
}