{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1593289936,
			"title": "Presidential election in Poland",
			"body": "So tomorrow there is a presidential election in Poland and we are officially prohibited from publishing any polls, endorsements or even comments during the whole weekend. So fuck that, Duda 33%, Trzaskowski 28%, Hołownia 11%, Bosak 10%.\n\nNow who is who? Duda is the guy from memes who has just recently visited Trump to boost his chances with the confederate party, but more importantly, he's the one with PiSs party, the ones who tried to rig the election recently, those ultra-catholic, ultra-redneck and ultra-nationalistic party lead by this angry little guy who killed his own twin brother in a plane accident so he could now be the boss. You've seen this one for sure, as Duda has been endorsed by public television every fucking day.\n\nTrzaskowski is just some random guy the democrats sent last-minute to replace the establishment's \"Hillary\". His party was also holding majority of parliament once and obviously they are just as well corrupted, decayed and clueless about how to lead a country as PiSs. They advertise themselves as a little more democratic, as a little more open to western countries, but economically they are just as well socialists as our current leaders. The fun is that Poles are divided as hell, ones hate PiSs for their looks and impairment, others hate the opposition for embezzlement and lies. They just shift at the steering wheel every few years.\n\nHołownia is just a TV personality, nothing more. I don't even know if he has any political program. Compared to Reagan before he was elected, there is not a single economical, ideological or intellectual argument this guy would made that would make him a feasible presidential candidate.\n\nBosak is something new here. There is a strong anti-communism new ideological right-wing movement that emerged from the new generation of citizens. We may simply say that communists are being removed biologically from Polish politics by their old age. Bosak is simply representing \"the other thing\", he's not particularly smart or strong-looking, but he made some good progress on showmanship and making arguments. The confederate party which is endorsing him is strongly about liberating the market, lowering taxes, splitting the religion from the government, making the country independent from Russia and also from the US. If you vote on him, there will be less Pollacks in your country as they'll come home finally.",
			"added": 1593289935
		},
		{
			"topic_id": 1597799191,
			"title": "Is ZeroNet development dead?",
			"body": "Okay, so looking at this: https://github.com/HelloZeroNet/ZeroNet/graphs/commit-activity\nThe development seems dead. No releases since September. Not really much commits since 2019. Bug reports saying \"FUCK YOU\", nobody deletes them. Tens of pull requests undecided. No code reviews, no interesting feature discussions either. Am I looking at the wrong repository? Maybe I'm using the wrong fork of ZeroNet client? This project seems like it's going down, either it requires more cash, or more skilled programmers, or maybe there is some other challenge I don't know of. Tell me!",
			"added": 1597799189
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 1,
				"body": "What would really do your country some justice is to send all stupid niggers like yourself back to Africa. The truth is that your ancestors were already slaves back in Nigeria few ages ago and the tribes sold them for beads to their new white masters. Now you are all privileged, wearing cotton clothes, riding cars, your grandmothers got inseminated by white rapist masters and you got IQ boosted this way just enough so you could learn to spell and count drug money. Meanwhile your fellow Africans are starving and beg you to come back and use your white ancestry to help build new African economy. Donald Trump is the greatest president, made actually more good to niggers than Abe Lincoln, you should be ashamed of yourself.",
				"added": 1592213073
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 2,
				"body": "Come on, The Freenet Project gives you both anonymity and distribution. It's like Zeronet+IPFS written in Java. A little old, a little slow, a little complicated to run at the first time, but also mature, stable and field-tested. And it's perfect for storing large volumes of data. https://freenetproject.org/",
				"added": 1592304652
			}
		],
		"1592236427_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 3,
				"body": "Try asking on the official CHAZ forum... oh wait.",
				"added": 1592304716
			}
		],
		"1593289936_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 4,
				"body": "Nie wiem czy wiesz, ale nasz polaczków to za granico nie wszyscy kochajo. W takiej na przykład anglji to łatwiej wyjebać w pierdol za bycie polaczkiem niż za bycie murzynem. Dlatego tak jak my byśmy najchętniej wyjebali ukrów do siebie i zaprzęgli bezrobotnych do pracy zamiast dawać im siedzieć na zasiłkach, tak samo brytole chętnie by się pozbyli polaksów. No i tylko krzysiu bosak robi coś, żeby tak się stało, przecież jak kaczyński wygra to kolejny milion wyjedzie.",
				"added": 1593351767
			}
		],
		"1593220425_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 5,
				"body": "If you are too lazy or too dumb to find information on creating torrents then you are most likely also too lazy or too dumb to avoid detection and conviction for sharing content illegally.",
				"added": 1593352045
			}
		],
		"1593195001_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 6,
				"body": "Just find out how their embargo on cryptographic technology worked in the 1980s, ultimately leading to creation of PGP, bittorrent and bitcoin.\nhttps://en.wikipedia.org/wiki/Export_of_cryptography_from_the_United_States",
				"added": 1593608843
			}
		],
		"1593359750_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 7,
				"body": "Windows 10 is embarassing. Fuck you, willie.",
				"added": 1593608919
			}
		],
		"1593039165_14LPVXnk22dMWhxm27AvKFuD2u679rNkCq": [
			{
				"comment_id": 8,
				"body": "Wtf, the moment you post something actually controversial, all those DNS names will stop working.",
				"added": 1594155422
			}
		],
		"1594361535_17WS8Y1keB3p8ELXFPbX1ZRLfeCESyojtF": [
			{
				"comment_id": 9,
				"body": "There is no point in creating such thing. Every search engine implies a database with indexes of the content being dynamically accessed by the frontend. The only way this would work is by downloading whole database to your machine first. Thus, it's simpler and more practical to just provide indexes aka link lists.",
				"added": 1595378549
			}
		],
		"1598171709_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 10,
				"body": "Edward Snowden: \"Arguing that you don't care about the right to privacy because you have nothing to hide is no different than saying you don't care about free speech because you have nothing to say.\"",
				"added": 1598194024
			}
		],
		"1597799191_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 11,
				"body": "> [kapec](#comment_23_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Just a crazy idea of mine but.Have you tried donating?\nMaybe I already donated a few Gs or maybe I'm just a leech, you will not know that, officer.\n\n> [geekless](#comment_212_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): The centralized parts of ZeroNet\nWell, I suppose the developmnent team is another centralized part, concentrating all the know-how, planning, etc. I'm thinking this project should become a DAO with coders being directly rewarded by resolving tickets, just as it happens at Bisq. The platform is already here, we have zeronet git repository, wallets, just need the middleware.",
				"added": 1598194777
			}
		],
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 12,
				"body": "I was going to say \"well, why don't you just fork and see...\" but I saw you just did this. So, now I would say that whatever the feature you consider, it should just be an option and transparency is your friend. Just add the feature configuration setting for the admin but also add a big fancy icon somewhere on the left panel saying what are the current zite's settings, just as creative commons icons appear sometimes on blogs. This way, if anyone likes any forum but wants to have a censored/uncensored version of it, they'll easily see if the existing ones meet their demand. Oh, and a fork history would be nice to track, as well as pulling the new features from your master zite.",
				"added": 1598195533
			}
		],
		"1597641256_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 13,
				"body": "It's all about information bubbles and your reaction to the knowledge from outside yours. Censorship is basically enforcing an information bubble by removing everything that may break it. Sorting comments is promoting the \"good\" stuff and putting the \"bad\" stuff in garbage below. To my knowledge, the zeronet world is not a place the zite owner should decide instead of the user what his bubble is and how to protect it. Instead, the user should have a trust score against all other users and either sort or censor their posts based on his user settings. This is how it's done in Freenet Messaging System and similar projects. It's also more difficult to implement but hey, since you are asking, I take it you don't like the other solutions all that much.",
				"added": 1598195879
			}
		],
		"1597577135_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 14,
				"body": "So the new iPhone will be split into the two modules: an actual iPhone and the mandatory software activation coupon, each for 999,99.",
				"added": 1598196099
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 15,
				"body": "Please share the content you tried to post. Must have been really good if they banned you for it.",
				"added": 1598196245
			}
		],
		"1597908401_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 16,
				"body": "As mentioned in another thread, both ideas are bad as they depend on zite->user scores. What should be implemented, is user->user (P2P) score, with user himself deciding which content to fetch/display. And yes, you might end up with subgroups of users, e.g. boys and girls, liking what they post within a subgroup (e.g. boys will like fast car pictures) but hating everything else (boys can hate doggy pictures). Zeronet as a whole should not discriminate between boys or girls in this example.",
				"added": 1598197212
			}
		],
		"1594775906_1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL": [
			{
				"comment_id": 17,
				"body": "Seems like integrator's nightmare, you will end up with constantly merging features from upstream and not really adding the value. Instead, the main ZN app should rather enable a feature we may call \"scenarios\", in which you just send your grandma a QR code or customization token that will simply go to ZeroID page for her and after she registers it will then directly forward her to your ZeroMe profile. Also this way you can probably save yourself from having an app deleted from app store by making it generic enough to avoid suspicions that you created it specifically for a few malicious users that will gain notoriety eventually.",
				"added": 1598197554
			}
		]
	},
	"comment_vote": {
		"1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": 1
	}
}