{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1618207796,
			"title": "Difference between the North Korean Combat Matrix and the iranian structure...",
			"body": "flagrant...",
			"added": 1618207795
		},
		{
			"topic_id": 1618502614,
			"title": "Forclosing your country of origin, the real story of the real american immigrant...",
			"body": "I guess it's something I live :), it's funny... in the sense that I am a living experiment of what your forebearer experienced... in a sense there is a moment, it's impossible to not say fuck it to the stupidity of europeans... I mean they are sooo dumb, that could pass, but so entrenched in their dumbness that honnestly apart killing them, in droves, there is really no hope.\n\na little reminder :).\n\nsadly, I guess the \"europeanization\" reached the shores of the \"new world\" too... happilly both china and russia are not even worlds, but whole universes ! ahhhh soooo cool !",
			"added": 1618502612
		}
	],
	"topic_vote": {},
	"next_comment_id": 77,
	"comment": {
		"1617932358_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 1,
				"body": "> [captain404](#comment_37_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc):  xml is kinda unsellable everywhere cause of the privacy feature like monero but in worse. \n\nagainst free speech\nagainst privacy\n\nwhat's next?\n\npro pedophilia?",
				"added": 1617980932
			},
			{
				"comment_id": 4,
				"body": "> [g0dless](#comment_4_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM): Relying on anything that needs a server to work is a grave mistake. Use something like Jami: https://jami.net/Or the upcoming Berty: https://berty.tech/\n\nit's even gay !",
				"added": 1617986411
			}
		],
		"1617978597_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "idk, most BLM riots were directed by the pedo feodalists ruling america to divert attention from pedogate/epstein...",
				"added": 1617981613
			},
			{
				"comment_id": 3,
				"body": "> [houtje](#comment_24_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): Floyd is a piece of shit. And his piece of shit mason father too.\n\nSo true about him, his father I don't know.\n\nWhat made me laugh as tag, is no border, one world some shit like this with 10's (not to say 100) of invaders sitting below :).\n\nthose peons, are so dumb...\n\n\n\n> [jeff](#comment_110_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Let 'em riot. Meet them with a show of force that leaves no doubt that this sort of thing will no longer be tolerated.\n\nIt's highly probable that the biden regime will be very violent... or not, I don't know how much they still command their ground forces (those who terrorized us all along trump regime (tried to wear a maga hat in public?).\n\nWill see soon !",
				"added": 1617986396
			},
			{
				"comment_id": 10,
				"body": "black? masson? no... fake... or some kind of gang tatoo controlled by a cell of masson, maybe...",
				"added": 1617995203
			},
			{
				"comment_id": 15,
				"body": "> [bortbortbort](#comment_22_16e6K52Q1xLbhxAFrLeXvDjS5q8QhQ4eQm): it's easy to make the argument that if he had been left alone he wouldn't have died. so chauvin's actions caused his death. Especially with the video evidence.\n\nlol he would have got shot sooner or later... he was doomed... fent + crack... I mean... what did he do with the woman and the shot gun already?",
				"added": 1617999609
			},
			{
				"comment_id": 16,
				"body": "the problem is that men on fent feel nothing... you can shoot them, and they really feel nothing...\n\nbut yes the cops did a mistake... should have simply set up the hand tie and let the man chill...\n\nbut you know... who is perfect?",
				"added": 1617999679
			},
			{
				"comment_id": 17,
				"body": "the real problem is the war on drugs... and it creates victims :\n\nfor floyd... because he had to spend way too much income on his pleasure\n\nand cops\n\nbecause they face those who have nothing to lose...\n\nimagine in texas when it's your second strike...\n\nfire at will...",
				"added": 1617999767
			},
			{
				"comment_id": 18,
				"body": "and so everyone live in this mindset\n\nexactly what the pedo feodalists wished... poor fucks fighting each others (cops and so called gangsters)\n\nmeanwhile the vip raped kids on little st james...",
				"added": 1617999814
			},
			{
				"comment_id": 19,
				"body": "but you need to be out of the american thought matrix to see that as it is self evident...\n\nremove your ideologies, past trauma and experience and simply looks who is on yachts / mcmansion...\n\nnot cops, nor floyd.",
				"added": 1617999862
			},
			{
				"comment_id": 20,
				"body": "because if floyd and all like him could pay real market price for their dopes, they wouldn't need to work for it... it's almost free fentanyl... if it's legal...",
				"added": 1617999912
			},
			{
				"comment_id": 21,
				"body": "but why does he takes fentanyl? because it's hard to grow poppy with sattelites... so when the \"heroes\" go burn a field of popy in afghanistan or in bolivia it means that the users will transfer to syntetics...",
				"added": 1617999963
			},
			{
				"comment_id": 22,
				"body": "again, I can write this here , imagine on twitter? a fucking nazi would insta censor me...\n\nand when a fucking pastors / priests who the fuck ever comes to me with his moral about addictive substance, I prefer to be with the Cartels...\n\nwe are not interested move on\n\n(and it means if you don't you fucking die, spice first, talks later...).",
				"added": 1618000029
			},
			{
				"comment_id": 23,
				"body": "of course gays of the fbi, it's real financial darwinism... pure trade darwinism... the best cartels are better than the cia... in term of organization, agility, versatility, lethatity... why? because no bail out... and all the weaks are already burried.",
				"added": 1618000096
			}
		],
		"1617909117_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif": [
			{
				"comment_id": 5,
				"body": "1. adverse vaccine reaction.\n2. not writting this idea would have been associating the royals to the war\n\nSo it's really the perfect move to support the ultra violent insurectionists in ireland, of all sides, including those just for the sake of violence, with the great hope that there will be a spill over to london.\n\nfundamentally we could have nothing against the uk (#eaton #oxford servants of bill browder) sadly, it ain't like that anymore... first there was the loot and rape of Russia.... ohhh we angry. but then, the cherry on top of the cake, an attack against CHINA !!! first in HK, and now browder, slow like a snail, think he can stoke flames in xinjang?\n\nwe are deeply unhappy...\n\nsupporting the insurrection means, modern weapons and gears of war (comm, nv, tacticals, etc, advisory jobs)\n\nwith the goal of pulling all the mi6 child rapists protectors inside this turmoil, with scaling and even martyr creation (remember the sniping in maidan?, we do) until the uk is out of the game, burning...\n\nagainst Russia alone... maybe... With China?\n\nthere is a point, the technocratic highly paid, fucked and housed little commoners elites will learn, and if it means to kill all their kids, I will warn the royals, once, flee... and if they betray, we will see the patterns of movement, they won't a second time...\n\nyes, london can burn if we wish...\n\nthat's to teach you humility, back to your island suckers.\n\nyou crossed the line\n\nand we want our relics from chinese dynasties... we will be relentless...",
				"added": 1617986987
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 6,
				"body": "What the fuck, now they want to sink their boats inside the almost closed sea? then they will try the inner seas :)\n\nso... let's burn london \n\nrepost :\n\n\"So it's really the perfect move to support the ultra violent insurectionists in ireland, of all sides, including those just for the sake of violence, with the great hope that there will be a spill over to london.\n\nfundamentally we could have nothing against the uk (#eaton #oxford servants of bill browder) sadly, it ain't like that anymore... first there was the loot and rape of Russia.... ohhh we angry. but then, the cherry on top of the cake, an attack against CHINA !!! first in HK, and now browder, slow like a snail, think he can stoke flames in xinjang?\n\nwe are deeply unhappy...\n\nsupporting the insurrection means, modern weapons and gears of war (comm, nv, tacticals, etc, advisory jobs)\n\nwith the goal of pulling all the mi6 child rapists protectors inside this turmoil, with scaling and even martyr creation (remember the sniping in maidan?, we do) until the uk is out of the game, burning...\n\nagainst Russia alone... maybe... With China?\n\nthere is a point, the technocratic highly paid, fucked and housed little commoners elites will learn, and if it means to kill all their kids, I will warn the royals, once, flee... and if they betray, we will see the patterns of movement, they won't a second time...\n\nyes, london can burn if we wish...\n\nthat's to teach you humility, back to your island suckers.\n\nyou crossed the line\"\n\nof me !\n\nit's a good plan ! it has to be...  I believe in beating the enemies so hard, until they stop wanting to fuck with russia\n\nwhy?\n\nbecause we are strong\n\nwho knows, tomorrow?\n\nlet's move !",
				"added": 1617987088
			},
			{
				"comment_id": 7,
				"body": "fundamentally don't forget their is a yuge racist component ! in the sense that they want to whitegenocide us (and population replace us) while tax raping us... if we have a russian exist, they are fucked, so they must fuck russia...\n\nas such to fuck them first is the best move now...\n\nit's war\n\nand lavelle... be aware little filth of the uno... i understand finally what is my problem with this foreigner... uno... that's the line he tries to walk in.... I SAY: RUSSIA SOVEREIGN FULLY.",
				"added": 1617987421
			},
			{
				"comment_id": 8,
				"body": "Personally, I am for sinking those ships... in the sense that the \"troops\" have betrayed their oath, did nothing against the pedos... so they can die to me.\n\nthe thing is to do in a covert way... \n\nand what can they do? launch full nuke war? \n\nat one point...\n\nahhh and finding targets in syria...\n\nthe goal is to bring 1 million body to america... they need it to wake up.",
				"added": 1617988206
			},
			{
				"comment_id": 9,
				"body": "aegis vs s400... it's gonna be hot... did they move too attack subs? maybe taking an old one non nuclear and ram those ship from below? otherwise constant buzing... everything with a jet engine turns around... they won't sleep...",
				"added": 1617989622
			},
			{
				"comment_id": 11,
				"body": "So so so... the evac from the west... I know it may sound overwhelming... send us to the poorest oblast, gave us fiber optics to moskow, and we will make it the new CBD of the WORLD !!!!! go vlad !!!\n\nthere is a way to become the MOST POWERFULL NATION OF THE WORLD !!!!!!!!!!",
				"added": 1617995269
			},
			{
				"comment_id": 12,
				"body": "ideally we would need to a heavy train line to our future imperial captial (you can't imagine the amount of stuff we will need) and then very quickly an airport with many lanes (to go faster to moskow or for yours to visit the center of the world :D)... energy... you can't imagine :D.\n\nthink about it...\n\ndo you want the future to belongs to russia?\n\nyou could a \"Nazi\" coup, mandatory russian speaking...everything in cyrilic... \n\nin a sense we wish it, because we leave, to never return... (unless they are defeated and or we conquer it :D).\n\ngo go go !",
				"added": 1617996202
			},
			{
				"comment_id": 13,
				"body": "how do you write buy or sell in cyrilic? who cares, it's easy to see :)",
				"added": 1617996867
			},
			{
				"comment_id": 14,
				"body": "you have to understand that with us you will leave the mechanical age, to enter the real electronic one...",
				"added": 1617996918
			},
			{
				"comment_id": 25,
				"body": "another interesting plan is a pipeline to india...",
				"added": 1618011145
			},
			{
				"comment_id": 37,
				"body": "Why is annegrette going completely crazy pre ww1 alliance system by saying : \":\" Annegret Kramp-Karrenbauer told public broadcaster ARD television on April 14.\n\n\"Together with Ukraine, we won't be drawn into this game,\"\n\nand now with understand the together :\n\n\"The Cabinet of Ministers has supported the ratification of the Agreement on Financial Cooperation between the Government of Ukraine and the Government of the Federal Republic of Germany, according to the Finance Ministry's press service.\"\nhttps://www.ukrinform.net/rubric-economy/3227658-government-approves-ratification-of-ukrainegermany-financial-agreement.html\n\nI would like to remind the german industrialists and others nazi from aldi/lidl that wanting to expand the german lebensraum to ukrainia will have serious consequences on your life expectancy and may result in the total termination of your families...\n\nare you ready to gamble it all for OUR LAND?\n\nyou, the german industrialists, have supported to jail us for words, let countless german girls and children be raped and terrorized, you have made the whole public transit system a nightmare for those not on individual transport modes... while you live in your palaces with chauffeurs and cooks and co?\n\nHow long do you think it will last until the play \"mama merkel, or mutti\" will be uncovered.\n\nWe ain't your stupid, metrosexualized pussy brainwashed dead sheep...\n\nyou like dark teams? you like to burry your kids? who is to gainz the most from ukrainian take over by german industries... I have question how will you burry your kids?\n\nwe don't play.\n\nand a little warning, if you dare to mess with us in China, the memory of your people will be gone. Am I clear enough?",
				"added": 1618475418
			},
			{
				"comment_id": 38,
				"body": "tactical nuke or biological short life / chemical release : hamburg, munich or frankfurt? of course in a private school in the richest part of town... maybe some kind of high caffee/shop/restaurant...\n\nthey want war...\n\nI love it\n\nspecially the battlefield inversions...\n\nand then say it's a rapefugees... ez.",
				"added": 1618475708
			},
			{
				"comment_id": 39,
				"body": "I guess we are fighting soon the descendants of the german aristocracy who made money in ww2 as nazis...",
				"added": 1618475930
			},
			{
				"comment_id": 40,
				"body": "and I am curious how this is all allied with turkey...",
				"added": 1618475963
			},
			{
				"comment_id": 41,
				"body": "the new axis : german feodal aristocrats with the turks using the corrupt ukrainians with the aim to get russia to then attack us in China?",
				"added": 1618476011
			},
			{
				"comment_id": 42,
				"body": "how much time with full priority to move 1 millions chinese soldiers in full on war set... hmmm... why waste time... offensive nuking... trajectory... so we just need a no wind week? how many days for the ashes to fall back?",
				"added": 1618476084
			},
			{
				"comment_id": 43,
				"body": "the thing that freightened me the most, is that the \"merkel and co\" aka pinknazis have successfully entranced the german people... at least the whole media apparatus, because I have no idea who in germany want to go to war against russia to expand german lebensraum to ukraine... however, it already happened...\n\none sure thing, no one in france wants to invade russia or ukraine... (maybe some in the \"thinking\" class), but we the people have MANY others problem, and russia isn't one of them, \n\n(and for me the refuge, lifeboat etc).",
				"added": 1618476254
			},
			{
				"comment_id": 44,
				"body": "so the question is simple who is the german family who to win the most by the annexion of ukraine? maybe first a message... in short there is a \"browder\" gang raiding ukraine... maybe a gift... like a bottle of vodka to the kids... to explain kindly.. we are here for peace, but have the \"fuel\" for war... do you?",
				"added": 1618476372
			},
			{
				"comment_id": 45,
				"body": "for me, I am convinced that against the humanists there is only violence (crucification, force feeding them their children etc), I hate those people... they are things to me.",
				"added": 1618476414
			},
			{
				"comment_id": 46,
				"body": "most of them believe to be \"Intouchable\", they have dumbed down police forces protecting them and beyond that a full control of the medias, in their ivory tower they forget that the sewer, they don't even remember it's odor :).",
				"added": 1618476487
			},
			{
				"comment_id": 47,
				"body": "first step top 100 germans to profits from the annexion of ukraine : a small box of caviar... just to remind them...",
				"added": 1618476678
			},
			{
				"comment_id": 48,
				"body": "it's kind and clear, when it could implies : maybe your last.",
				"added": 1618476717
			},
			{
				"comment_id": 49,
				"body": "but maybe only for their children and grand children, so they get the message clear :\n\n\"grand dady, why did I get a mini box of caviar from russia?\"",
				"added": 1618476772
			},
			{
				"comment_id": 50,
				"body": "I would add some high value targets in poland...",
				"added": 1618478306
			},
			{
				"comment_id": 54,
				"body": "the first cyrylyk keyboard :)... ahahhaha... about those russian chips... I mean how did all those automatic spacecraft went to the moon and beyond? the great mystery of the russian chip architecture :).",
				"added": 1618502711
			},
			{
				"comment_id": 55,
				"body": "cypylyk?",
				"added": 1618502759
			},
			{
				"comment_id": 56,
				"body": "ahahahah gnark gnark sooroolook?",
				"added": 1618502794
			},
			{
				"comment_id": 57,
				"body": "who knows ?!?",
				"added": 1618502807
			},
			{
				"comment_id": 58,
				"body": "me I believe that at one point the break must be total... new keyboard etc... a new universe... :)... roccya",
				"added": 1618502853
			}
		],
		"1618002997_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": [
			{
				"comment_id": 24,
				"body": "I guess freenet encrypts even your data ? (unknown is always encrypted)\n\nthat would be a nice idea to have the whole encrypted even activated\n\nbut like the other say it's simpler in clear but encrypt the whole around (os, files when not used etc).",
				"added": 1618008744
			}
		],
		"1618183859_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 26,
				"body": "retroshare (open source / private/darknet networking system) : http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1570989643_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1\n\nit's good !",
				"added": 1618206961
			}
		],
		"1618161310_1AjYqBvptvn6szy3VytC28obDFqsBM27jp": [
			{
				"comment_id": 27,
				"body": "> [drcarl](#comment_8_1AjYqBvptvn6szy3VytC28obDFqsBM27jp): Apparently, you have bought an unapproved by our benevolent FDA tinfoil hat; certainly made of russian aluminium, which has been proven by our scientific test to be of inferior quality, compared with the certified tinfoil hats. \n\nyou are fucking sick in your mind, all aluminium are the same... duh !",
				"added": 1618207018
			},
			{
				"comment_id": 28,
				"body": "Go back to bloomberg !",
				"added": 1618207035
			},
			{
				"comment_id": 31,
				"body": "> [drcarl](#comment_3_1AjYqBvptvn6szy3VytC28obDFqsBM27jp): Illness anxiety disorder (IAD), \n\nyou are on to somthing here... Aren't doctors in the medical profession ( the ruling class love to have title before their name, like highest supreme priest of the egyptian delta area), all suffering from IAD ?",
				"added": 1618207213
			}
		],
		"1618203663_1AjYqBvptvn6szy3VytC28obDFqsBM27jp": [
			{
				"comment_id": 29,
				"body": "Bloomberg and Sorros will hate that...",
				"added": 1618207056
			}
		],
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 30,
				"body": "Love the corpse harvesting... they have to see... honor to dead once burried. they at least fought for something, even wrong, they believed in, and lost.",
				"added": 1618207114
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 32,
				"body": "To the girl who just retired, it's way too late... you are still and forever on this list. Those who worked for cnn...",
				"added": 1618207269
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 33,
				"body": "> [deuxzaron](#comment_132_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Alex Jones entire game is just to sell his merchandise.\n\nabsolutely not ! It's because he refuse to quote his share of infowars that he has to promote health product (among others, have you ever been to https://www.infowarsstore.com/ ? There are a lot of products that I find super great !\n\nFor example : https://www.infowarsstore.com/winter-sun-vitamin-d could help reduce covid and others illness fatality rate and severity.\n\nor the end game dvd https://www.infowarsstore.com/endgame-dvd which exposed since a while the nwo and co\n\nor this beautiful t-shirt : https://www.infowarsstore.com/alex-recommends/support-chris-pratt-dont-tread\n\nor this great book : https://www.infowarsstore.com/alex-recommends/strategic-relocation-north-american-guide-to-safe-places-book\n\nhow not to mention survival food : https://www.infowarsstore.com/preparedness/emergency-survival-foods \n(those who had during the texas blackout had food...)\n\nor https://www.infowarsstore.com/preparedness/emergency-survival-foods/alexapure-breeze to remove dust !!!\n\nso you see... however if alexjones finally decided to float just 10% of his shares...",
				"added": 1618471849
			}
		],
		"1618427843_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 34,
				"body": "I am still nostalgic that the great military airports of afghanistan don't serve as centers for large trading hubs.\n\nFor that project to really bloom, it would have required two things.\n\n1. ending the plant war in the usa... \n2. ending the reign of the pedos.\n\nbut as it isn't possible... currently... \n\nbut on the other hand, I don't really understand how big and permanant those basis are? I mean are there giant underground complexes there? or is it still all temporary in nature?\n\nI like the idea in the departure to give all the military medical supply to the talibans, without creating dependencies on them about those, in the sense if they could wage wars for decades without, they should be able to keep going with out those.\n\nwhat really happened on 911? the talibans weren't involved...",
				"added": 1618472123
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 35,
				"body": "I have a real problem with i24 fr... again this morning one said : that ehud barack was clean, aka had no bagages... that's such an utter lie.\n\nHowever, I was surprised that he is a political adversary of nethanyahoo... why? \n\nin short it leads me to believe that ehud barrack is part, and not only as a client/blackmailed of the epstein gang... \n\nthe question is simple who is ehud barrack?",
				"added": 1618472242
			},
			{
				"comment_id": 51,
				"body": "ahh you little IDF, at least I have no problem with you, and I specially love the other side leaders assassination programs... :) why waste time with their troops when their leaders are sitting ducks :).",
				"added": 1618478377
			},
			{
				"comment_id": 52,
				"body": "question about the right of return... I am against it for high officials of other states... for example zelinksy (the ukrainian guy, I don't even know if he is jewish) couldn't have a right of return. because rather than do is allyah he serves another state (even if badly). and more importantly, remember the taliban experience... it's your call afterall, but I wouldn't do that.\n\nI would simply be clear, you want a high political or job in a state, and you are jewish, welcome to israel, however if you chose to abandon us, you won't have an automatic right to return, of course the little people in your state will, don't try to sneak in, we will find you, and return you to those who seek to execute you :).\n\notherwise, they, those who won, may need to win againt, just to capture a few fugitives...",
				"added": 1618480940
			}
		],
		"1618323031_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 36,
				"body": "I am not a doctor, even less informed nor smart... however... I ask myself how to splitt this tritium from water?\n\n\"Tritium (/ˈtrɪtiəm/ or /ˈtrɪʃiəm/) or hydrogen-3 (symbol T or 3H) is a rare and radioactive isotope of hydrogen\"\n\nso if I understand well the goal would be to split the H of h2o because it was replaced with 3h? that's right?\n\n\"Industrial production is mainly from steam reforming natural gas, and less often from more energy-intensive methods such as the electrolysis of water.[\"\n\nso wouldn't it be possible to electrolyse the radioactive water from the tank? o2 would be clean and only concentrated radioactive hydrogen would remain?\n\nI D K... I am not a doctor, maybe doctor carl or judith knows?\n\nfinally, wouldn't it be possible to use plants and or alguaes or mushroom, for them to absorb the contaminated H, and then be able to burn the plants to have a radioactive ash?\n\non the other hand if there was a solution, I guess, it would already have been found...\n\nso how to absorb and concentrate this 3H into something solid and compact?\n\nI am deeply convinced that if rather than going full bore on the basic block of life (CO2), it would have been put forward 10 years ago, today, maybe an Heisenberg or Opennheimer could have solved it...\n\nit's not that complicated, at least we know what we want, isolate 3H... from h2o... which is ^3H2O (right)?\n\nall the time I am bullshited with trust the science (like stupid religion dogma) while when I really need it, crickets...\n\nahh maybe crickets could be feed on tritium to absorb it? IDK...\n\nscience should study humility...",
				"added": 1618473253
			},
			{
				"comment_id": 53,
				"body": "> [markinformer](#comment_25_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4): the pollution has already been happening all these years. Tepco captures all they can, but much of it already flows into the caverns of the earth to inflict its untold and unknown damage. The poison is already diluted and continues to flow into the earth - and Japan, despite herculean efforts, has had little effect because they cannot control the contamination. The idea that they can control the contaminants both flowing and dripping into nature is marketing or even propaganda, not reality.\n\nI know energynews was clear all along... the physics questions remains how to splitt tritium from water? I ask, why electrolysys doesn't work? do you know?",
				"added": 1618502236
			}
		],
		"1618389476_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 59,
				"body": "trash those buffons : https://www.zerohedge.com/geopolitical/iran-teases-90-enrichment-while-threatening-cut-vienna-talks-if-not-constructive\n\nfrankly they are useless, hopeless and a dent of thieves and traitors...\n\nhowever seriously recognize the right of the little people with the hats small and big to live in the place Titus the great razed to the ground, so they are happy and safe, able to manage their own problems, and without your constant aggressions and threats, it would be so great... the whole mena would BOOOOMMM !!! or bloooommmm like you have never seen before.\n\nin short with your constant nikbah and co, you make the game of the feodalist kuffarists pedophiliac west...",
				"added": 1618507548
			},
			{
				"comment_id": 60,
				"body": "please, it is so useless this \"west \" fascination... and too their hijrah, invasion, eurabia... forget it... it will end badly...\n\nteheran = persian = shia = mullah = your life... and those who seek to steal it are in for trouble\n\nand so? the yahoodis of the book? there teheran is called jerusalem, it was too small to settle so they build tel aviv and many others cities... and so rulez...\n\nyou have an ideology that fucks you too...\n\nfocus domestic, economic and market expansion EAST !!! there is everyone\n\nwaht's the point to pimp in some eurotrash setting build by serfs and lived by domesticated fools?\n\nseriously... what a waste of time\n\nthey, the yahoodis call them rightly so, now, goyim...",
				"added": 1618507796
			},
			{
				"comment_id": 61,
				"body": "they let their fucking kids raped... what can I tell you more? and you want to deal with such shit? what makes you so shitty?",
				"added": 1618507824
			},
			{
				"comment_id": 62,
				"body": "they will never leave, if they are thrown at the sea like some believe they will achieve, they will return... again and again and again until the end of time.",
				"added": 1618507861
			},
			{
				"comment_id": 63,
				"body": "completly useless to waste time ressource and thing like that when even if they had NOTHING they would plan their return, and chant it and dream it...\n\nto the promised land !",
				"added": 1618507916
			},
			{
				"comment_id": 64,
				"body": "since the time of phiraos...",
				"added": 1618507924
			},
			{
				"comment_id": 65,
				"body": "focus domestic, focus expansion economic markets EAST !!! find a way to live with the Sunnah...",
				"added": 1618507960
			},
			{
				"comment_id": 66,
				"body": "I don't say to agree... but no one in ksa wants to rule teheran... keep your montains...",
				"added": 1618507977
			},
			{
				"comment_id": 67,
				"body": "ksa is the most beautiful land in the world.",
				"added": 1618507986
			},
			{
				"comment_id": 68,
				"body": "remove the turban, put some cooling...",
				"added": 1618508012
			},
			{
				"comment_id": 69,
				"body": "too much tea? coffee? aahhhh... most problem are nutrional in nature...",
				"added": 1618508033
			},
			{
				"comment_id": 70,
				"body": "in short you seem attracted by the feodalism aristocratic systems of the west... hmmm...",
				"added": 1618508088
			},
			{
				"comment_id": 71,
				"body": "again live like you want, but stop to fuck around... and specially forget your lareconquista of israel... forget it, you will get nuked...",
				"added": 1618508111
			},
			{
				"comment_id": 72,
				"body": "if you want to see teheran in ashes... go for it...\n\nas said, in china we paid our plots, they are ours, move out.",
				"added": 1618508132
			},
			{
				"comment_id": 73,
				"body": "teheran or not.",
				"added": 1618508141
			},
			{
				"comment_id": 74,
				"body": "your super generaal was sashimied... cut in piece by a missile !!! the arrow... well named.",
				"added": 1618508173
			},
			{
				"comment_id": 75,
				"body": "how do you say wake up in farsi?",
				"added": 1618508196
			},
			{
				"comment_id": 76,
				"body": "doing the lapdog of the west... for what a pile of cash? a gratification and welcome in the \"international community\" where KIDS ARE RAPED ON ISLANDS? where the fuck are you?",
				"added": 1618508236
			}
		]
	},
	"comment_vote": {}
}