{
	"next_post_id": 66,
	"next_comment_id": 18,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Gloriousleader",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1591085911,
			"body": "之前有的专家对于病毒毒性会慢慢降低的说法是过于乐观，那种情况只对80%这种极高致死率的病毒有明显效果。\n\n病毒毒性降低是因为两个因素：1，自然变异，2，宿主容易死亡，并且在宿主死亡后传播性降低。\n\nCOVID-19这种病毒致死率不高也不低，致死率大约在1%至10%不等（具体还和医疗条件有关），有的案例中潜伏期不短，而且尸体会污染水源并且造成其他物种感染。因此，总体而言不太符合第2个条件。如果要靠它自然降低的话，可能要传播个千万年，死了一代又一代的人后，病毒的毒性才会慢慢降低。\n\n",
			"date_added": 1591085909
		},
		{
			"post_id": 1591092007,
			"body": "ZeroMe果然还是以程序员的习惯设计的。一般论坛谁会用MarkDown，都是用的BBcode，一般只有程序员才用MarkDown，尤其是Github的程序员。",
			"date_added": 1591092004
		},
		{
			"post_id": 1591094919,
			"body": "看到台湾四个党团（民进党、国民党、民众党、时代力量）同时声明协助香港难民，本来觉得有些不正常。在道义上这个动作和相关法案（指移民法、难民法、港澳条例、两岸条例）的修正去年7月就应该通过的，结果去年台湾所有党派都在互相推诿不肯推动（怕影响选票），国民党甚至拖到11月、12月才开始研究香港难民问题。今年台湾政党突然集体大发慈悲，肯定不正常。\n\n然后，今天看到了美国也要欢迎香港难民的新闻，觉得一下子正常多了，原来是美国和盟友秘密商量过，集体接受香港难民。最后，台湾必定是在美国施压下，才对香港人民开放避难的大门。",
			"date_added": 1591094915,
			"meta": "{\"img\":\"525,700,ddcdcccccbbbbaaccbcbbaaaaa9a99999,0121134302552521116256202143535065336651322225663555633333363443336344476547889A\"}"
		},
		{
			"post_id": 1591111052,
			"body": "英国也对香港难民问题有所行动。香港将来会产生的难民总数大概在100万至400万之间，飞机航班肯定不够用，一些人可以先去周边国家，最后再去目的地国避难。\n英美货运的船只，可以招募香港难民当船员，船上的条件可以简陋一些，每个难民发一些职业培训的手册、小说等读物好了。不过货运船只一次顶多招几十人做船员，但是没有更好的办法，如果专门运难民的话，不仅伙食费太贵，而且一次只能运数千人左右，总共要往返数百次。\n",
			"date_added": 1591111047
		},
		{
			"post_id": 1591175164,
			"body": "中华民国宪法经历7次修宪，其中有5次是李登辉搞的渐进台独，目的是培养台湾民族主义意识，阻挡大陆民主化后和台湾统一；\n有1次是国大为了自肥，后被宣布违宪失效；\n最后1次是阿扁在美国的意思下，为了防止国土、国号变更而提升修宪门槛，最后阿扁依然被送进监狱。\n\n其中，修宪内容中最为重要的是总统职权的变更。李登辉把中华民国的内阁制修成了双首长制，中华民国总统的权利比美国总统还要大。\n其次，大法官也由终身制修为8年任期，新总统一个任期就可以提名半数总统，两个任期就可以把大法官全数换成总统的人。\n在最后一次修宪中，除了增加修宪门槛之外，还引入了和日本选举制度相似的并立制。并立制有利于大党，不利于小党。\n\n1992年的《两岸人民关系条例》其实就是以“名为一国，实为两国”的方式处理两岸公民的权利，导致沦陷区居民在权利上实质上如同外国公民。值得一提的是，现在的国民党也是一个越来越靠近台独的政党，只是名义上愿意称“一中各表”而已，国民党并没有废除两岸条例的意思，将来也不会有。\n\n原版中华民国宪法本身就是一部接近三权分立的民主宪法，虽然被戒严令和堪乱条款冻结，但宪法原文其实并无重大需要修正之处，顶多只需小修小补，不需要李登辉大幅改动。\n\n但是，随着时间的流逝，原版宪法离台湾人民越来越远，台湾版的现行民国宪法也越来越背离大陆沦陷区人民的需求。可以说，原版宪法最为重大的漏洞就是国大，中华民国自由区选的国大代表，居然代表了沦陷区的民意，最后把整个宪法葬送在台独运动者手中。如果说习近平修宪如同换衣服，那么李登辉在台湾修宪就如同过家家。",
			"date_added": 1591175158
		},
		{
			"post_id": 1591187276,
			"body": "蔡英文的修宪委员会，就是要推动第8次修宪。至于具体目的是什么，暂无明确表态，所以引发大量猜疑，有人猜蔡总统是要修宪变更国名和领土。\n\n不过，李登辉当初就是看了蔡英文的两国论后，才差点造成法理台独，引发1996年海峡导弹危机。后来李登辉放弃了一步到位的台独做法，改为缓独，必定也和蔡英文等幕僚商量过。\n\n蔡英文之所以不表态，可能是至少做了两手准备，可以在需要表态时再表态。笔者认为其中一手准备就是直接公投修宪/制宪独立，另一手准备是放宽修宪的门槛，以便观察大陆何时陷入某种危机，然后趁这个危机爆发之时大陆措手不及，台方趁机一举达成法理台独，造成既成事实。至于有没有第三手准备，这种可能性是有的。",
			"date_added": 1591187269
		},
		{
			"post_id": 1591192250,
			"body": "中华民国就快要寿终正寝了。即便现在，中华民国也只是台湾人的中华民国，早就不再是大陆人的中华民国，所以才会有不少台湾人认为“中华民国不是中国”，“台湾是一个独立的国家，名字是中华民国”等等。\n\n在笔者看来，大陆人如果仍有意愿复兴中华民国这个国号，顶多只能尝试把台湾排除在领土外。美国对台独的支持力度正在不断加强，同时美国人的反中情绪高涨，即便中共垮台，如果给美国人两个选项，其一是中华民国收复大陆，另一是让中国变成难民输出国。笔者更看好美国人会选择第二个选项，而且这条路不走到底是不会回头的。",
			"date_added": 1591192242
		},
		{
			"post_id": 1591203561,
			"body": "美国及欧洲发生大规模示威后，能否形成稳定的群体免疫，这是一个值得观察的问题。",
			"date_added": 1591203552
		},
		{
			"post_id": 1591204309,
			"body": "六四血案是中国制度变革不彻底造成的后果。\n\n当年美国需要联中抗苏，邓小平对中国制度进行改革，但并未交出实质的政治权力，结果就仅仅是将中国从共产主义国家转型成了法西斯纳粹国家，顺便造成了中国经济增长。最终，经历40多年，中国成长为给周边地区造成高度紧张的国家，也成长为世界第二经济体。\n\n美国人当时太轻信中共，甚至差点就把台湾卖给中共了，所以才有美国和中华民国断交的事件，美国和世界甚至差点把中华民国踢出联合国。\n\n中国北边的苏联解体后，所有的苏联加盟国都放弃了共产主义，不过大部分解体后的国家仍然是独裁国家。其中最大的一块俄罗斯也同样转型成了法西斯纳粹国家，其独裁程度和中国差不多，普京大帝有修改任何一条法律的权力，也可以想连任就连任。\n\n可以说，美国在冷战中仅仅是用资本主义战胜了共产主义，但并未战胜独裁。只有东欧在转型中受益最多，两德顺便统一。如果美国要对付这些新兴的独裁国家，绝对不可以直接照搬过去冷战对付共产主义的办法：资本主义阵营除了搞好自身经济外什么都不用做，甚至连越战都不用打，让共产主义自行解体就行了。",
			"date_added": 1591204299
		},
		{
			"post_id": 1591243651,
			"body": "为了解决种族问题，卢旺达采用的办法是从小洗脑教育的方式灌输：胡图族和图西族是一家人。再加上社会的反思，结果大家都认为是一家人，卢旺达大屠杀这种事不会再发生了。",
			"date_added": 1591243640
		},
		{
			"post_id": 1591243904,
			"body": "不一定非要用简单粗暴的办法解决种族问题，但是政府一定要强力干预，否则种族主义问题不会自然消失。\n\n这个问题就如同环保、反垄断一样，如果没有政府介入，全球变暖问题无法自然解决，如果政府不干预垄断性的企业，市场无法自行防止垄断。\n\n德国就要立法禁止纳粹礼等等，这种“政治正确”并不符合言论自由，但是当时确实没办法，只能这么做以防纳粹势力再度兴起。",
			"date_added": 1591243892
		},
		{
			"post_id": 1591276205,
			"body": "社会变革需要大量的为他人牺牲者，而不能全都是自私自利者。就好像这次美国示威，有的黄种人居然也要为黑人发声。如果不发声，下次种族歧视这种事就会找上黄种人。此时，帮助别人就是帮助自己。\n\n如果社会上全都是自私自利者，大家都觉得“人不为己，天诛地灭；人人为己，寿与天齐”，别人的苦难那都是别人的事，和自己无关。那此时最佳的选择就是不要去推动社会变革，应该把生活重心放在自保上，能做到尽量不做坏事也能生存，就算人生的成功。",
			"date_added": 1591276192
		},
		{
			"post_id": 1591278080,
			"body": "中国突然放松对摆地摊的限制，可能和房地产问题有关。很多商家赚的钱有很大一部分用于交房租，自己只赚一小部分，甚至根本就是不赚不亏。“地摊经济”这个词肯定是某某重要领导人发表的某某重要讲话，搞得下面的官员都纷纷要学习贯彻甚至实地考察。虽然各地的文件中没有明确说具体是谁的点子，但是这个点子中共领导人没那么容易想出来，除了李克强。\n\n",
			"date_added": 1591278065,
			"meta": "{\"img\":\"514,700,fffeddfeedddeeefddebaede,0000000011111200000000003400034000000056600043320044444004024100222472\"}"
		},
		{
			"post_id": 1591278395,
			"body": "李克强过去几年搞过的点子至少包括：克强指数，P2P金融，电信虚拟运营商等等。其中官方在强推电信虚拟运营商的时候，曾有大量水军在网上发帖说这个办法有利于打破电信的垄断。",
			"date_added": 1591278379
		},
		{
			"post_id": 1591280629,
			"body": "美帝的示威活动已有超过10000人被抓。香港差不多抓了9000多。",
			"date_added": 1591280612
		},
		{
			"post_id": 1591289309,
			"body": "塑料会对环境造成污染，其中一个原因是塑料难以降解。自然界中原本不存在塑料这种物质，也缺少能够有效分解它的化学、物理反应和细菌。有可能再过个几千万年，自然界就能进化出专门吃塑料的细菌，但是，那个时候塑料就不再是塑料了，而会是像落叶一样，过个几天就会变烂，甚至发臭。\n不少笔记本的外壳是用塑料做的，如果塑料变质腐败，就不能用了，那个时候的笔记本就必须得换成不锈钢等其他材料。",
			"date_added": 1591289291
		},
		{
			"post_id": 1591298274,
			"body": "社会撕裂是怎么回事，拿种族主义问题为例，美国爆发反种族主义示威后，\n反纳粹的人变得更加反纳粹，\n原本就歧视黑人的人反而更加愤怒激进，并且更加支持纳粹。\n两拨人越来越对立，而不是两边互相妥协折中。\n\n社会撕裂的后果：按照这个事态发展，如果民主党上台后不能有效对付种族主义的问题，美国人下次迟早会选一个比川普更加“白人至上”的总统。",
			"date_added": 1591298255
		},
		{
			"post_id": 1591300557,
			"body": "有美军单膝下跪，说明美军也站在示威者一边。示威者的确有打砸抢行为没错，但是这不是运动的原因，也不是运动的目的，这些美军更加关心局面闹成这样的真实原因：种族歧视。所以，他们大概不会参与镇压。\n另一个问题是，美军效忠的是国家和宪法，而不是效忠于某某总统。\n这和中共的军队有所不同，中共官僚体系之腐败，严重到了要被抓到把柄才能升官，上级捏着你的把柄，所以官僚们只能效忠上级，而不是效忠宪法。\n\n蒋介石刚来台湾时，军队也是靠私人关系维持的，不过后期有所转型，军人改为效忠国家，军中十分重视爱国主义教育，不然这支军队就无法长期维持。后来民进党上台，大量安插绿营的人，估计到蔡英文再执政几年就可能会有所变化。",
			"date_added": 1591300537
		},
		{
			"post_id": 1591329752,
			"body": "美军单膝下跪",
			"date_added": 1591329731,
			"meta": "{\"img\":\"406,700,4559acbcd89b764a9a543777988876654432111a86b87887,01111201113245223267877594669AB4AA6C94DD9B4A6B4A77969EFFA860\"}"
		},
		{
			"post_id": 1591330739,
			"body": "川普是我所见过的美国总统中，干坏事干得最多的。",
			"date_added": 1591330717
		},
		{
			"post_id": 1591331918,
			"body": "美国历史上最好的总统是林肯，罗斯福。",
			"date_added": 1591331895
		},
		{
			"post_id": 1591345186,
			"body": "古代历史上，人类的跨国迁徙是自由的，国王使用法律限制平民入境或者出境的情况极为罕见。\n直至近代史上，人类第一次发明出入境限制，是以《1914年英国国籍和外国人身份法案》（British Nationality and Status of Aliens Act 1914）为标志。从此各个国家纷纷效仿，人类去大部分国家都需要目的地主权国颁发的签证。\n\n这是世界上最流氓的法律之一。\n20世纪，各种怪胎思想纷纷兴起，并且给世界造成深远的影响，比方说民族主义，法西斯主义，共产主义。其中的出入境限制、强调本国人相对于外国人的特权等等都属于民族主义。",
			"date_added": 1591345162
		},
		{
			"post_id": 1591427396,
			"body": "站在人类道德立场上，我希望朝鲜去核，哪怕动手的人不是美国，是中国也行。如果不能尽早解决，那也应该赶快考虑斩首、直接摧毁核弹发射设施等手段，以免朝鲜搞出能发射核弹的潜艇，到时候解决问题的成本就高了。事后我希望南韩直接统一北韩。\n\n川普这么久都没有解决朝鲜去核问题，是因为川普的心思主要在打高尔夫球和选举上，和朝鲜的谈判没有实质进展。他顶多只是和金正恩拍了一张照片，用来假装有谈判的成就而已。\n\n如果朝鲜不去核，就会刺激其他国家秘密发展核武，造成核扩散；同时刺激日本修改和平宪法；并且刺激周边国家更愿意接受美军部署反导武器的安排，造成东亚地区紧张甚至搞军备竞赛，这些紧张可能会间接影响经济。",
			"date_added": 1591427371
		},
		{
			"post_id": 1591434635,
			"body": "高雄长期以来都是绿营的票仓，2018年823大雨后，韩国瑜迅速借助各种网络声量走红，这是其中一个Youtube影片[王世堅大戰韓國瑜 竟讓柯文哲笑到翻過去](https://www.youtube.com/watch?v=0TWwAHGHNNs)。\n有大量平时不投票的人和中间选民投了韩国瑜，最后才使韩国瑜小赢当选市长一职。\n\n今天是罢免韩国瑜的投票日，韩国瑜要度过此关非常艰难，主要原因是高雄选民本来就有根深蒂固的绿营基本盘，这些人对绿营败选怀恨在心，一定会纷纷出来愤怒地投票，不给韩国瑜继续执政的机会。而曾经投过韩国瑜的中间选民，可能有不少人对市长更换后的生活仍未较大改善感到不满，他们本次不大可能出门。",
			"date_added": 1591434609
		},
		{
			"post_id": 1591447620,
			"body": "加拿大也宣布欢迎香港人前往加拿大申请难民。可能还会有其他西方国家陆续跟进。",
			"date_added": 1591447592
		},
		{
			"post_id": 1591449928,
			"body": "川粉能把黑人示威游行说成是中共和白左民主党的阴谋，真是服了。",
			"date_added": 1591449899
		},
		{
			"post_id": 1591501616,
			"body": "有人认为美国可以联合俄国对抗中国，或者至少大幅离间中国和俄国的关系，让美国搞中国的时候，俄国不帮忙。\n俄国如果这么做的话，这是一个不明智的决定。\n\n不妨想想以下几点：\n1.俄国自苏联解体后，就和中国恢复了正常的关系，甚至一度和中国联合对抗美国。\n2.俄国和中国一样，独裁程度差不多，而且在世界上没几个朋友。如果俄国不出手帮忙中国，不出手平衡世界局势，那么下次美国对付俄国的时候，还有谁会帮他？\n\n接下来的数十年，直到在普京死前，俄国一直都会由反美的幕僚做出决策，这是民主国家不具备的条件，民主国家因领导人经常更换，对外外交政策也会变动。如果发生俄国联合美国的情况，只有一种情况下比较有可能，那就是中国国力已经大幅超过美俄，这是不可能的，而美国实力大幅下降是小概率事件，美国全球霸权（包括盟友）也至少还能维持20年，普京说不定也还能再活20年。",
			"date_added": 1591501584
		},
		{
			"post_id": 1591544213,
			"body": "本人极少评论郭文贵之事，不过这次我还是要提醒一下，郭文贵建的这个新中国联邦（New Federal State of China），这个英文即便加上s还是非常不靠谱。肯定没和足够的专业的人商量，搞不好是少数人拍脑袋决定的。\n[新中国联邦宣告成立](https://gnews.org/zh-hans/224894/)\n\n就算是少数人的决定，我也只会追随有理智的，有较高的决策能力的精英做出的决定。郭文贵的这一堆幕僚显然不符合精英的特点。如果郭文贵真心想要建国，我建议不妨先从改良幕僚人才的产生方法、培养和竞争制度做起。",
			"date_added": 1591544176,
			"meta": "{\"img\":\"871,700,dddccbeeeaa9fffbbb999654766333222443777555111888,01102101120032200244567358614439ABC99544DAAAAEED446FFFFFF32422222222240000000022\"}"
		},
		{
			"post_id": 1591595732,
			"body": "不可低估川普连任的可能性。2018年中期选举，众院虽然被民主党收复，但是成果比往年的要小，这说明前两年川普和共和党的支持者仍占优势。在选举人制度下，关键是少数几个州的选票能否搞定，其他州反川再猛烈也没用。大选在11月，你不知道接下来几个月会发生什么事。",
			"date_added": 1591595694
		},
		{
			"post_id": 1591597605,
			"body": "川普被选上台，和中美洲移民问题有关。有些美国选民有纳粹倾向，他们平时在看新闻的时候，每件事都会拿来在心里推敲一番，看这件事能不能用移民来解释，然后最后很多事移民都成了罪魁祸首，什么抢劫啦，杀人啦，抢走本地人工作啦，都是移民干得。\n\n欧洲某地发生强奸案时，连嫌犯的身份都没公布，很多华人都在传这事是欧洲难民危机后的穆斯林移民干的。结果最后嫌犯身份公布的时候，这事已经冷却下来不再是焦点了，而且即便有川粉得知嫌犯真实身份后，他们本来就不愿意承认错误，所以也不会转发澄清错误。\n\n这和中国大陆内地的一些居民看新闻时的态度是一样的，一有啥重大新闻，就要把马列主义拿出来推敲一番，最后的结论就是资本主义的脆弱性，美帝等资本主义国家崩盘是必然的。\n\n所有宗教教徒也是如此，狂热的基督徒会把大部分事情的问题都解释为信仰不够虔诚，只有信仰足够虔诚，问题才会解决。",
			"date_added": 1591597566
		},
		{
			"post_id": 1591600193,
			"body": "被歧视者，对付种族主义，最好的办法是，不要惹事。直到别人出来帮自己发声。\n\n2018年台湾大选，蓝营大胜的原因之一，除了韩国瑜的因素外，还和2016年至2018年之间，中国大陆网民的形象有所改善有关。中国大陆网民在2016年干的最刺激台湾人的一件事就是周子瑜事件，这件事导致绿营支持率大涨，蔡英文上台。\n\n不知从何开始，台湾网民对大陆网民仇恨加深，有人看到台湾什么地方出个什么事就说是中国游客干得，台湾人工作不好找就说是因为台湾和中国往来过于密切，被中国人抢了工作。\n\n然而，这种类似的事情在台湾累积到一定程度的时候，台湾本土的反种族主义势力逐渐开始发威，直到2018年，台湾也有很多人对绿营上台后所干的事情不满，这些情绪一下子爆发出来，很多人把希望寄托于对绿营狠的韩国瑜身上，最终就形成了2018年蓝营大胜。\n\n世事难料，2019年香港爆发反送中事件，台湾本土的种族主义势力又开始逐渐占上风，这和小粉红翻墙出来骂香港人“废青”密切相关。最终就导致2020韩国瑜落选，台湾社会的仇中情绪又恢复了。\n\n这就是为什么，我建议大陆人最好不要前往台湾，除非是重要事务且非在台湾办不可。实在必须得前往的时候，要保护好自己，不要惹事，少凑热闹，少聊政治，以免刺激到台湾人。",
			"date_added": 1591600153
		},
		{
			"post_id": 1591602309,
			"body": "以我个人的经验判断，台湾网民大概有80%以上对简体字的网民保持警惕心，只是不同的人程度不一而已。在这种警惕心之下，你很难问到他们的真实想法，也很难交到真朋友。\n\n如果切换成繁体字，并且模仿他们的语言风格，比方说使用“網路”而不是“網絡”，保证自己身份不明显暴露，这种情况下才稍微好交谈一些。不过台湾内部撕裂问题也很严重，对任何可能的骂声要有心理准备。\n\n我在youtube很少看到台湾网友和大陆网友不骂架的地方，不过还真有一处，就是李永乐的教学视频下的留言区。许多网友也有类似[感叹](https://www.youtube.com/watch?v=V6am3hae-Z0)。 \n\n",
			"date_added": 1591602268,
			"meta": "{\"img\":\"900,424,dddeeefffdeedde,00111222221131111112104411222230010111122131112222\"}"
		},
		{
			"post_id": 1591623690,
			"body": "这位被推倒的雕像是1636-1721年的英国商人爱德华·科尔斯顿 （Edward Colston），此人是奴隶贩子。不过1721年那个时候美国还没有建国，南北战争也没有发生，英国也没有1833年废奴法案（The Slavery Abolition Act of 1833）。我支持“不溯及既往原則”（There is to be no penalty without previous law），即不能用南北战争/废奴法案后的法律去审判先人。但是，现在美国这么乱，搞掉一些和奴隶有关的象征物有利于平权运动，虽然这个做法和德国禁止纳粹标志差不多，但是也没办法。\n\n我建议的做法是不妨把这些雕像藏起来保护好，直到美国对黑人的系统性种族歧视被真正解决的时候，再把这些雕像拿出来，作为历史纪念用途。\n\n据说是当地政府不作为，人们多年前早就要求拆除这座雕像，所有才有今天的局面。",
			"date_added": 1591623648,
			"meta": "{\"img\":\"900,674,987ccccdcbba664452443554655563331231111342a98776,01221123456788947AABBC6CD88BAACAB667755DA60E0B6555640047F0F48F0F77E000\"}"
		},
		{
			"post_id": 1591625057,
			"body": "如果有人在我城市申请“Black lives matter”的游行，我会去参加。只是中国政府不敢让这种隔三差五申请游行的社会团体真实存在于社会。要搞这种运动，难啊。所以，我也只能在键盘上表示对黑人的支持了。",
			"date_added": 1591625014
		},
		{
			"post_id": 1591633750,
			"body": "巴西若干城市游行示威，抗议种族主义和法西斯主义，以及巴西总统Bolsonaro 对瘟疫的不作为。",
			"date_added": 1591633706,
			"meta": "{\"img\":\"900,600,333456667789abbccbcccddd434aaabaa999777544556111,0112345567812964A44582347AA94482B95C93390DCCDCCED30DD8FD8800088FF08DFF\"}"
		},
		{
			"post_id": 1591680309,
			"body": "[北韩宣布切断所有与南韩的通信频道](https://www.politico.com/news/2020/06/08/north-korea-communication-channels-308209) 希望南韩不要重蹈覆辙，统一北韩的事情不能一代一代拖下去。",
			"date_added": 1591680264
		},
		{
			"post_id": 1591733252,
			"body": "刚才Mute掉一个抹黑林肯的纳粹。\n\n林肯是历史学家公认的英雄人物，有些人不知从哪看来的小道消息随意评价如此重要的历史人物，这种人见一个mute一个",
			"date_added": 1591733206
		},
		{
			"post_id": 1591855139,
			"body": "百度百科不重视以下几点\n1.中立性。无法做到去商业化，到处都是植入广告。\n2.文献材料出处的权威性。阿猫阿狗的观点都可以放进去。到处都是学术界根本没有证实，甚至已经证伪过的结论和数据。轻则误人子弟，重则谋财害命。",
			"date_added": 1591855092
		},
		{
			"post_id": 1591948465,
			"body": "墙外网站主动屏蔽中国ip这种事情并不常见，最近恰好让我发现一个：www.paulsquiz.com\n\n该网站遇到中国ip便会显示：\n403: Access Forbidden\nYour location (CN) has been blacklisted. \n\n该网站似乎不像什么政治色情网站，难道是版权问题？",
			"date_added": 1591948417
		},
		{
			"post_id": 1591959986,
			"body": "前提1：某城堡内，有个贵族家族和一些奴隶居住在内。\n前提2：城堡外的王国基本已经废除奴隶制度。\n前提3：生活在王国的人，大都觉得这个城堡要不要废除奴隶制度，那是该城堡自己的事情，和别人无关。\n前提4：该城堡的主人有大量财产，保存在城堡外的王国。这些财产随时可以被其他贵族制裁。\n前提5：王国的其他贵族领主们，纷纷选择和该城堡打贸易战，科技战，但他们就是不选择没收这些财产。\n\n问题：如果你是该城堡的一员奴隶，你面临多种选择，到底是要推翻奴隶制度呢，还是选择逃跑呢，还是维持现状呢？\n",
			"date_added": 1591959937
		},
		{
			"post_id": 1591980126,
			"body": "像美国这种发达的工业国家，擅长的是高附加值的产品，如芯片等。越南做的是低附加值的产品，比如衣服、鞋子。\n如果低附加值的产品销量下滑，厂家明智的做法是减产，而不是降价。\n血汗工厂这种劳动密集型产业本来就容易搞出劳务纠纷，厂方如果让工人哪怕多赚1块钱，就意味着厂方面临更大的亏损风险，所以工人想要提升待遇，难于上青天。",
			"date_added": 1591980076
		},
		{
			"post_id": 1592133972,
			"body": "我想起一件事，附近某烤肉店，见该处挂的牌子写的是“牛肉风味肉串”，这种招数高明多了。",
			"date_added": 1592133921,
			"meta": "{\"img\":\"700,700,dddccceeebbbaaa999888777,0000010222003303310000113311101143051222365647033013004022220354064330001110000201002222222200222222\"}"
		},
		{
			"post_id": 1592195498,
			"body": "看到某川粉给川普洗地，居然造谣说金三认怂，不敢试射了，似乎想以此证明川金会有多大的谈判成就似的。这里特别澄清一下。\n朝鲜的导弹测试一直就没停过，最近一次测试是在2020年3月2日，只是媒体不会天天把这种新闻放头版，你没看到这个新闻并不代表他没测试，维基有记载，自己去搜。\n川普就是这种牛逼的人，川普都敢要求在纾困支票备注栏签上自己的大名，好让别人认为支票是川普给的，其实真相相差甚远。朝鲜核问题也是一样，川普只是去拍了个照片，好让你认为美朝关系或者朝鲜去核问题有多么好的进展。2019年某天，川普还故意摆出一副拒接金三的电话的姿态，好像美国在谈判中占优势一样。\n川普连伊朗核协议都能随便退，怎么可能解决朝鲜核问题。",
			"date_added": 1592195446
		},
		{
			"post_id": 1592291223,
			"body": "三文鱼事件不仅仅触发了中国防疫的神经，也间接引发了另一件事：\n对于2012年的反日游行示威事件和抵制日货运动，有些日本人仍记恨在心。这些日本人并不知道中国人不再去日式料理店是那么单纯的怕瘟疫，他们觉得三文鱼根本没有病毒，中国人只是找了个借口抵制日货发泄民族主义情绪，所以不去料理店罢了。这些日本人中，有些人甚至试图给政客施压，试图禁止中国人入境日本，阻碍两国交流正常化。\n\n中国政府应该警惕，自己多年前纵容的游行，给后代的政策造成多么不可逆转的影响。",
			"date_added": 1592291170
		},
		{
			"post_id": 1592385322,
			"body": "美国国债收益率倒挂，全球只有一个买家有能力做得到，美联储。其他买家不太可能花费101元去买到期只给100元的国债，除非这个买家是慈善家。\n\n在收益率倒挂之后，如果需要继续回购国债，就极有可能需要印钞，这个在金本位制度下是不可能完成的任务。\n\n推低收益率有什么好处？只要美联储推低收益率，就会有更多的国债持有人提前卖出国债变现（比如中国最近就在抛售美国国债）。当收益率倒挂时，更是卖国债的好时机。当这些国债变现后，原债主可能会拿这些钱去投资或者消费，从而起到释放货币流动性，刺激经济的作用。如果不拿去投资会怎样？在通货膨胀期间，钱放着会自然贬值，这个条件对于主动投资的人来说，比放着钱不用的人更有利。\n\n有人提出中国应该用主动抛售美债的办法，提升美债收益率，让美方的经济刺激策略失效，这一招绝对是馊主意。第一，即便美方什么都不做，这个办法也不可持续，只要抛完，收益率就会回归正常。第二，这个办法对自己的收益有损害，举例本来90元买的到期100元国债，你80元把它卖了，把10元的收益白白让给市场，任何一个投资者都不会轻易这么做。第三，美联储还有其他办法反制，毕竟人家就是印美元的，你又不能印美元，你拿这点小聪明和人家比，人家会拿你没办法？",
			"date_added": 1592385268
		},
		{
			"post_id": 1592458103,
			"body": "中国下次如果有示威，必须要蔓延到全国数百城市同时发生游行示威的时候，才有可能蔓延到国外，然后国外各大城市的老外会纷纷帮我们中国人在中国驻外大使馆前抗议发声。这样中国发生变革的成功率会高一点。\n\nBlack Lives Matter之所以能蔓延这么多个国家，是因为黑人移民广泛存在，而且种族歧视问题也是公共问题。香港示威为什么没能蔓延到大陆，其中一个原因就是香港本土主义者把标语设定成“光复香港”而不是“光复中国”，毕竟香港究竟是否实行“一国两制”或者“一国一制”的问题对大多数中国人来说不是公共问题，和自己的直接关系不大。如果实在要和香港本土派妥协，也应该把标语设定成“守护法治，保护言论自由”等等和大陆相通的问题，这样大陆人就会知道香港书商被习近平的爪牙抓走的事情，不然大陆人毫不知情。",
			"date_added": 1592458048
		},
		{
			"post_id": 1592467077,
			"body": "美国对付中国共产党的最佳机会一个是在1948年，那个时候中国没有核弹，但马上就有了。\n\n另一个机会是在1960年代毛贼把中国搞得一穷二白的时候。那个时候，美国人分明可以直接把发射核武的设施摧毁，但是美国人并没有这么做，反而对中共做出了极大的妥协让步，还把中华民国给断交了，差点把台湾直接当成赠品送给中共，台湾的下场差一点就和南越一样。即便美国人自己不直接动手，当时蒋介石猜测老美有这种意图，愿意帮美国人动手，当时蒋介石一直在关心中共的核弹设施能否被直接摧毁，他得出的结论是可以放心摧毁。\n\n当时尼克松访华，本意应该是通过改善中美关系，然后让中国和苏联同归于尽，这样美国人就可以从中获渔翁之利，他没有想到后来中美关系有那么紧密。后来甚至在64发生才没几年的时候，美国不但没能维持制裁，居然还让中国变成了最惠国待遇，还放进了WTO，所以美国人今天才会有难以收拾的麻烦局面。64发生后之所以要继续维持中美关系，是因为美国佬不知道苏联会垮台，也没有料到苏联垮台后中国会和俄罗斯结盟。亏得某些人把这个吹捧成美国对付苏联的大战略，发明该策略的人被吹捧成了大战略家。\n\n今后的发展趋势也是可以参考的，万一中国在和美国的竞争中，中方惨败，那么美国对华的政策依然会强硬一段时间，就像当初苏联刚刚垮台后无论如何也不能让64影响到实质的中美关系一样。",
			"date_added": 1592467021
		},
		{
			"post_id": 1592469722,
			"body": "在美国这种总统制国家，因为下一届政府团队对上一届的政策无法彻底了解，即便了解政策内容也无法了解该政策的全部目的。比如川普政府只知道有白宫请愿这回事，但川普的团队不知道奥巴马政府设置请愿网站的目的，也不知道回复联署的作用有多大。其他事情也是类似的，川普不知道奥巴马设置那么多机构是干嘛用的，就通通先砍了再说，毕竟川普是“小政府”的信徒嘛。但是川普恐怕不知道，他砍掉美国疾控中心（CDC）的预算，极有可能是美国对本次瘟疫反应速度慢的原因，因为CDC无法在第一时间做出合格的检测试剂。\n\n所以，美国在制定重大政策上，其可延续性是一个挑战。如果要保证可延续性，就必须由智库和政治精英之间互相协商来保证，前者智库还好搞，因为学者之间往往不愿意直接吵架，除非有令人信服的论据，不过后者在撕裂的美国社会是一个难以完成的，所以美国两党才会互相不信任：共和党认为民主党亲共，民主党则认为共和党会拿香港问题和中共做贸易战谈判的筹码。台湾也是一样，国民党认为民进党是想”以独促统“，即不断的用台独行为来刺激大陆，让大陆有武统的借口，另一波人则认为民进党搞假台独，其实是在骗取选票；反过来民进党也一样，民进党认为国民党是在偷偷和中共商量”一国两制“，尤其以韩国瑜访问香港中联办为标志性事件，认为国民党”亲中卖台“。\n\n在独裁国家，制定政策的人完全知道这个政策的全部目的，如果加上时间的检验，如果执行中发现政策的错误，也会对政策进行修改，除非领导人智商严重不足，否则其政策的可延续性是受到保障的。像伊朗在守约的情况下，美国突然无端退出伊朗核协议这种事，不会发生在中俄。\n\n在内阁制民主国家，制定政策者需要考虑各方的利益，每一方都牺牲一点，最终做一个权衡。因为社会民意的折中点不会发生剧烈变更，所以其制定出的政策的可延续性也有很不错的保证。欧洲大部分国家都是内阁制，所以他们在气候变暖、伊朗核协议的问题上比美国更有动力。",
			"date_added": 1592469665
		},
		{
			"post_id": 1592470924,
			"body": "CDC负责的是公共利益，这种事业本身就是不赚钱的，所以不太可能有企业家会主动去做这一行业的事。如果实在要砍CDC预算，就一定要慎重，要考虑各种风险及后果，确定承担得了，再下手。川普的特点是特别偏好小政府，川粉对小政府也是到了极端狂热的程度。川普不经过大脑砍CDC预算是一个错误的决策，还幸亏被国会挡住一部分。\n\n另一个环境保护的问题也是一样，我排放污染是我的事，和别人无关；别人污染那也是别人自己的事，和我无关；我排污赚的钱很多，排放到大气中对我自己伤害几乎忽略不计，这样最终的结果就是大家慢性同归于尽（小政府）。如果不想同归于尽，那就一定要有一个政府干预环保问题，制定能约束大家的标准。哪怕你排放的污染对你自己伤害很小，一点医药费不过几分几毛，你赚的钱比这点医药费高几个数量级，政府的责任就是把排污对别人造成的伤害总和全部算在获益人身上，人为干预提升排污的成本，这样排污的事情就得到控制了。",
			"date_added": 1592470866
		},
		{
			"post_id": 1592479157,
			"body": "如果有的选择的话，我还是选择两岸统一。我不喜欢分离主义。\n\n问题是，共产党是来当奴隶主的，民进党是来挖中国祖坟的，国民党是来做生意的，这三条路最终都会导致象征中华正统的中华民国灭亡。现在有美国撑腰，民进党和反中路线占了上风。\n\n站在反共者的立场而言，让民进党这个流氓和中共那个流氓互斗，的确更有利于共匪垮台，即便人家是来挖祖坟的。人家民进党也何尝不想让反共者和政府互斗，然后趁机台独，顺便洗白日军侵华的黑历史。\n\n只可惜那些民逗智商又不够用，人家反中民逗也跟着反中，那我就没得选择了。所以我最终只能离开中国，肉身翻墙，去其他民主并且统一的国家找工作，争取早日入籍，融入当地社会，不再问中国之事，日本、加拿大和欧洲国家似乎都是不错的选择。\n\n有人拿二战时美国的日裔集中营的例子，认为日裔美国人帮美军作战，华人也可以以此为鉴摆脱华人被歧视的困境。我想说的是，犹太人即便加入纳粹党帮纳粹作战，犹太人的待遇也不会有本质改善。尤其是当你美国人放弃道德，变成一个彻头彻尾的流氓的时候，你还指望受害者去帮你收拾另一个流氓，这种好事怎么可能？真发生这种事，就应该让流氓斗流氓，受害者绝对跑得比上次躲避流氓还远。如果我要留在墙内反共，条件只有一个，就是美国变成二战时的罗斯福那样的美国，或者南北战争中的北军，这两种美国都是理想主义的典范，而不是冷战时尼克松基辛格这样的救毛贼一命的现实主义美国。",
			"date_added": 1592479098
		},
		{
			"post_id": 1592588082,
			"body": "理想中的java：一次编写，处处运行（Write once, run anywhere）\n真相：一次编写，处处调试。（[Write Once, Debug Everywhere](https://en.wikipedia.org/wiki/Write_once,_run_anywhere)）\n\n学java前的美好愿景：只学一门编程语言，可以干任何事。\n真相：java在蓝光光盘播放机等的跨平台应用已经过时。对现在这个时代而言，java只擅长搞服务端。真要搞服务端，一大堆别的语言也可以搞。",
			"date_added": 1592588022
		},
		{
			"post_id": 1592655086,
			"body": "有人居然认为除了翻墙的问题外，共产党就没其他问题（或者说责任）了。此处仅举一例，咱伟大的无产阶级祖国居然没有足够的法律执行力来约束996工作制，不但维权的声音“被消失”，而且马云这货居然还说996是福利。“被消失”这事是谁干的，还能有谁？\n\n我之所以要离开伟大的祖国，就是因为我要得到“可以有不满意的权利”。有人帮共产党推卸责任，无需意外，因为共产党责任和担当都是远远低于欧洲民主国家的底线的。",
			"date_added": 1592655025
		},
		{
			"post_id": 1592659641,
			"body": "刚才尝试发文失败，原来一个用户累计发言不能超过50kB。 ",
			"date_added": 1592659577
		},
		{
			"post_id": 1592659789,
			"body": "我一个账户只剩几百字可以发，算了，休息。 ",
			"date_added": 1592659724
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "中方应该搞个黑人人权法案，如果美国警察对黑人暴力执法，就制裁美国企业，禁止美国官员访华。",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1591021526",
			"date_added": 1591089356
		},
		{
			"comment_id": 2,
			"body": "@oAo: 还是建议小心驶得万年船呐，为什么没必要？您要么心理素质好，要么运气好。现在两岸年轻人连玩网游都在对骂，又不可能真正用“留岛不留人”的办法解决问题，还是把这个锅留给两岸政客的好，老百姓远离这些麻烦比较好。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1591602309",
			"date_added": 1591640727
		},
		{
			"comment_id": 3,
			"body": "@Halo1117: 林肯是宪法的守护者，南方州才违宪。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1591331918",
			"date_added": 1591731913
		},
		{
			"comment_id": 4,
			"body": "@Alienbees: 多谢",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1592479157",
			"date_added": 1592481223
		},
		{
			"comment_id": 5,
			"body": "@Alienbees: 南美打游击是怎么回事？是不是在说治安问题？",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1592479157",
			"date_added": 1592482280
		},
		{
			"comment_id": 6,
			"body": "@Alienbees: 想不到真是军事问题。我这等小老百姓和平日子过久了，自认没有军事才能，看来还是在欧洲更有利于实现个人成就。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1592479157",
			"date_added": 1592483111
		},
		{
			"comment_id": 7,
			"body": "@Ryzen1600x: 不是为了过好日子，是为了过自由日子，哪怕穷一点也是可以的。为了查google的时候不会被翻墙软件卡死，时间白白浪费掉了。或者说能极速查google的日子对我来说就是好日子。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1592479157",
			"date_added": 1592588175
		},
		{
			"comment_id": 8,
			"body": "@Mteam: 笔者做此判断，并不是不知道《公投法》阻挡。民进党在立法院有大多数席位，到时候再修回来并不难。《公投法》本来就在2017年修过一次，然后2019年又修过一次，这次修是因为2018年公投结果对民进党不利，民进党为了不让公投影响到2020大选而修的。一院制的立法院，民进党如果硬要闪电式修法，国民党这点席位根本挡不住。就连美国国会都有“冗长发言”让少数党更易阻挡法案，台湾没相关制度，所以台湾立法院经常打架。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1591187276",
			"date_added": 1592643317
		},
		{
			"comment_id": 9,
			"body": "@Mteam: 原话漏打两个字，应为“这些美军站在示威者一边”，你看我后面都提到“这些美军”，不过就是第一句不小心漏掉罢了。兄弟这么纠结语病问题，是来找事的吧？",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1591300557",
			"date_added": 1592643624
		},
		{
			"comment_id": 10,
			"body": "@Mteam: 我支持所有国家的肤色为黑的人种，不单支持美国已经入籍的人。而且英文对黑人的中性称呼就是Black，这个称呼用于替代有歧视性的Negro，要改也是英文先改。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1591625057",
			"date_added": 1592643784
		},
		{
			"comment_id": 11,
			"body": "@Mteam: 墙的问题只是冰山一角，共产党当然还有其他流氓事情。要观察中国社会问题，建议多看看月光博客。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1592479157",
			"date_added": 1592644238
		},
		{
			"comment_id": 12,
			"body": "@Mteam: 在资本主义社会，商人可以自由选择客户。私人机构想拒绝谁不必说明理由，这是他们的传统。只有公立机关不能公然歧视谁谁。这不一定是种族歧视，很可能只是因为在中国客户上不赚钱，或者来自中国的流量太大。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1591948465",
			"date_added": 1592644657
		},
		{
			"comment_id": 13,
			"body": "@Mteam: 如果你还想知道你自己提出的这几个问题的答案，建议你可以去看看编程随想的老旧博文，其中有些关于共产党为什么会造成社会问题的论证。以及垮台后的转型都有写到。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1592479157",
			"date_added": 1592644922
		},
		{
			"comment_id": 14,
			"body": "@Mteam: 我看老兄你才幼稚，您自己先出言不逊，然后才引来别人反击，这不是自证了自己才幼稚嘛。你要继续嘛？",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1591300557",
			"date_added": 1592645107
		},
		{
			"comment_id": 15,
			"body": "@Mteam: 能不能举例说哪篇博文的哪个论点是臆想而非实情？编程随想的文章我也并不是100%认同，你要是举个例子，说不定能看一看有啥漏洞，然后这个话题才有讨论价值。不然我直接说：你所说过的话，不说都是胡扯吧，基本都是有漏洞的，是可以被权威资料反驳的，也就是您自个儿的臆想。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1592479157",
			"date_added": 1592653930
		},
		{
			"comment_id": 16,
			"body": "@Mteam: 种族歧视当然是由学者定义的，你自个儿定义一个种族歧视，别人可未必买账。买卖自由原则是资本主义契约精神决定的，不能说你不卖就是你歧视我。要不然中国搞改革开放干嘛？不就是把买卖自由的权利还给老百姓嘛。有个逻辑您要搞清，种族歧视当然可以导致我不卖给你，但是反之，我不卖就是我种族歧视这个逻辑并不成立。这就好像假如我去杀人，这当然是犯罪，但是反过来，有地方发生了凶案，那是不是一定就是我杀的呢？显然不成立嘛",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1591948465",
			"date_added": 1592654247
		},
		{
			"comment_id": 17,
			"body": "@Mteam: 您的梯子推广费不少赚哪，您的推广id还是837，说明您极有可能是第837位注册用户。我刚注册才到拿到的才是841而已。不知老兄您的支付宝有没有留下个人痕迹呀？这种不安全的梯子，建议嘛您还是早点弃用的好。",
			"post_uri": "17LFKPBhCu1ukhQ744MMW2pfXqxNqgRzvQ_1592479157",
			"date_added": 1592657168
		}
	],
	"follow": []
}