{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 1,
				"body": "#As Revoluções Africanas: Angola, Moçambique e Etiópia \n Paulo Fagundes Visentini \n\n- https://gateway.pinata.cloud/ipfs/QmRdXAaD7Hc1J7F8y5FQWrTrAYkJ6QohzQPUYFCJKB433E\n\n\n Diversas revoluções ocorreram nos anos 1970 no Terceiro Mundo. A descolonização tardia dos territórios portugueses no continente africano permitiu que movimentos de libertação abrissem caminho para revoluções nacionais democráticas e até socializantes, de forte impacto internacional. A esses eventos somou-se a derrubada do milenar império etíope, o que ocasionou a implantação de um regime socialista que provocou profundas mudanças sociais naquele país. Diversas outras ex-colônias também viveram experiências semelhantes no mesmo período.\nEste livro analisa as revoluções africanas mais marcantes dessa época – angolana, moçambicana e etíope –, que, do ponto de vista histórico, fazem parte de uma conjuntura única e possuem características políticas comuns, e examina as árduas lutas decorrentes desses processos revolucionários, os quais tiveram de enfrentar poderosas forças conservadoras, nacionais e estrangeiras, para se manter.",
				"added": 1588252609
			},
			{
				"comment_id": 2,
				"body": "#A Revolução Vietnamita: Da libertação nacional ao socialismo \n Paulo Fagundes Visentini \n\n- https://gateway.pinata.cloud/ipfs/QmbQrg7ebBmy9xVd9n36SVimyQJ1k8VbjrK5UTJNoPjoY1\n\n\n \"O pequeno país heroico que derrotou a maior das potências militares\" – este título transformou-se em lugar comum e, embora honroso, tende a reduzir o Vietnã a mero coadjuvante em uma peça em que os verdadeiros protagonistas são os titãs da Guerra Fria. A trajetória vietnamita, entretanto, é muito mais ampla, seja em sua extensão temporal, seja em seus significados político e histórico. A revolução vivida no Sudeste asiático espelha as tensões e anseios de uma nação que desde sua origem milenar adquiriu com sangue o direito de existir e ainda busca um futuro justo para seus filhos.",
				"added": 1588252716
			},
			{
				"comment_id": 3,
				"body": "#A Revolução Coreana: o Desconhecido Socialismo Zuche\n Paulo Fagundes Visentini , Analúcia Danilevicz Pereira , Helena Hoppen Melchionna \n\n- https://gateway.pinata.cloud/ipfs/QmTLHfdSqXzdiUZrcZ67tY9A3rjZ7ekX6SzHEiJTS7Sk4P\n\n\n A Coreia do Norte é comumente retratada no Ocidente de forma caricatural. Difunde-se a imagem de um regime fechado, à beira do colapso, irracional, que oprime um povo faminto enquanto investe fortunas em um projeto nuclear megalomaníaco. Perdem-se, nessas representações caricatas e eivadas de objetivos políticos, tanto o contato com a real configuração do regime norte-coreano, de impressionantes conquistas socioeconômicas, quanto as complexidades que caracterizaram todo o processo revolucionário e continuam a tensionar o sudeste asiático.",
				"added": 1588252836
			}
		]
	},
	"comment_vote": {}
}