{
  "modified": 1542189687,
  "links": "# [militant-blog](http://www.militant-blog.org/)\n---\n# Aggregatori:\n- [Fluss0](/1Lvn7oyTATpCxjtJRcCKACWvbDqAiGkfGX/)\n- [N0blogs](/1MyrB3bQfCr67H6GTxdcFbqdfUN1sFNPwT/)\n- [SinistraInRete](/1EWVMPkHtJewEwFnH5BRxQJKGNey4k2cXZ/)\n- [Militant](/13nHHar3fGHsyALFjUndrYVKMG4QtVDtZ1/)\n- [Giap](/1NuwNnijdhp9tyxa8MQ7W2LJN6sYZg3TWu/)\n- [Comuneinfo](/1DQBZfpWueeWXiN5fyFzkogqsDTsC2GgJH/)\n---",
  "demo": false,
  "description": "Get up stand up,\nstand up for your rights",
  "next_post_id": 146,
  "post": [
    {
      "post_id": 101,
      "title": "New blog post",
      "date_published": 1542189687.651,
      "body": "Blog post body"
    },
    {
      "post_id": 1,
      "date_published": 1433033779.604,
      "title": "Congratulations!",
      "body": "Your zeronet blog has been successfully created!"
    },
    {
      "post_id": 32,
      "title": "L’epocale eccezione del populismo Cinque stelle",
      "body": "La straordinaria e ininterrotta sequela di abbagli, errori, madornali gaffe, pastrocchi politici, sbandamenti ora a destra ora a destra, incapacità di governo, incapacità d’opposizione, che vede protagonista il M5S, è qualcosa di raro visto in politica. Per di più, il fuoco di sbarramento a media unificati – da Repubblica al Manifesto, dal Fatto [...]\n\n\n\nhttp://www.militant-blog.org/?p=15017\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 09 Jan 2018 09:12:47 +0000",
      "date_published": 1515496193
    },
    {
      "post_id": 33,
      "title": "Meno lavoro, più occupati: l’orizzonte della nuova “crescita economica”",
      "body": "All’inizio, più o meno un anno fa, la “crescita” era derisa dai più: “non c’è crescita, sono solo oscillazioni statistiche senza ricadute nella realtà”. Col passare dei mesi, la narrazione si faceva più performante: “c’è una crescita, ma è senza lavoro”. Oggi siamo allo step successivo: “mai così tanti occupati dal 1977”. Il [...]\n\n\n\nhttp://www.militant-blog.org/?p=15030\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 11 Jan 2018 11:05:11 +0000",
      "date_published": 1515668905
    },
    {
      "post_id": 34,
      "title": "Visioni Militant(i): Tre manifesti a Ebbing, Missouri, di Martin McDonagh",
      "body": "Il Missouri non è ancora Midwest, dove solitamente trova luogo l’immaginario dell’America profonda. Non è neanche il sud nostalgico e xenofobo che fa da sfondo al cinema antirazzista. Distante dal New England, ripudiò a suo tempo i vicini confederati scegliendo l’Unione nordista, pur mantenendo la schiavitù fino al termine della guerra, nel 1865. [...]\n\n\n\nhttp://www.militant-blog.org/?p=15036\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 15 Jan 2018 08:49:03 +0000",
      "date_published": 1516007326
    },
    {
      "post_id": 35,
      "title": "La “grande coalizione” come unico governo possibile",
      "body": "Come noto, anche la Germania proseguirà nel solco della “grande coalizione” (congresso Spd permettendo) . Nonostante i proclami socialdemocratici (“mai più un governo con la Cdu!”) , la realtà ha ricondotto la “sinistra” tedesca a ben più miti consigli. Ma la “grande coalizione” è l’unica possibilità di governo nell’Unione europea, al di là della convenienza [...]\n\n\n\nhttp://www.militant-blog.org/?p=15046\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 18 Jan 2018 08:47:05 +0000",
      "date_published": 1516266512
    },
    {
      "post_id": 36,
      "title": "Sperimentazioni popolari",
      "body": "La continua e ansiosa ricerca di modelli originali per ricostruire legami sociali nei territori della periferia procede per sperimentazione. A lungo andare è probabilmente un limite, ma oggi è l’unica alternativa al già visto e al già fallito. E’ attraverso questo estremo pragmatismo che si è arrivati all’iniziativa di sabato, la riapertura – [...]\n\n\n\nhttp://www.militant-blog.org/?p=15051\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 22 Jan 2018 08:42:47 +0000",
      "date_published": 1516612088
    },
    {
      "post_id": 37,
      "title": "L’inevitabilità della Ue nelle fusioni industriali",
      "body": "Col passare del tempo l’Unione europea diviene sempre più un processo inevitabile. E’ bene rendersene conto: uscita intatta dalla crisi economica, difficilmente entrerà in crisi politica di qui a breve. Passi falsi, incomprensioni e competizioni nazionali rimarranno all’ordine del giorno, ma nessuno di questi rallentamenti avrà la forza di interrompere il consolidamento della [...]\n\n\n\nhttp://www.militant-blog.org/?p=15059\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 25 Jan 2018 08:24:12 +0000",
      "date_published": 1516871295
    },
    {
      "post_id": 38,
      "title": "Dopo dieci anni tolti i jersey a Settecamini: la battaglia per la Tiburtina strappa le prime vittorie",
      "body": "La lotta per la riqualificazione della periferia industriale romana è solo all’inizio. Sempre a San Basilio, da decenni giace morente uno dei principali ecomostri cittadini, l’ex fabbrica della penicillina, sconfinata costruzione abbandonata, piena d’amianto, dove nel frattempo hanno trovato rifugio un centinaio di senza casa italiani e migranti. Uno scenario letteralmente post-atomico nel [...]\n\n\n\nhttp://www.militant-blog.org/?p=15065\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 27 Jan 2018 11:31:50 +0000",
      "date_published": 1517055001
    },
    {
      "post_id": 39,
      "title": "La sinistra immaginaria e la realtà sociale",
      "body": "Un interessante sondaggio sulla composizione sociale degli elettori italiani (Corriere della Sera di sabato 27 gennaio)  certifica il gran canyon che separa la realtà dai desiderata della sinistra. Secondo tale rilevazione (che, ricordiamo, non fa altro che comprovare una dinamica in corso da diversi anni)  l’ex bacino elettorale storicamente comunista – operai, impiegati [...]\n\n\n\nhttp://www.militant-blog.org/?p=15070\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 29 Jan 2018 08:51:55 +0000",
      "date_published": 1517217146
    },
    {
      "post_id": 40,
      "title": "Perle elettorali",
      "body": "Il mese della campagna elettorale: cosa chiedere di meglio alla politica? Confessiamo un malcelato appagamento nel leggere tutte le mattine le ultime dai partiti, dai candidatipremier, e poi i trombati, gli esclusi dell’ultimo minuto, le giravolte dei ripescati, alla ricerca dell’ultimo sondaggio, della dichiarazione più roboante. Una droga, bisogna ammetterlo. «Mi hanno chiesto [...]\n\n\n\nhttp://www.militant-blog.org/?p=15084\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 30 Jan 2018 15:53:39 +0000",
      "date_published": 1517328514
    },
    {
      "post_id": 41,
      "title": "L’a-politica irrompe nella politica: il caso Retake",
      "body": "Come volevasi dannatamente dimostrare, il volontarismo a-politico, a-partitico, cittadinista e chi più ne ha più ne metta, si è trasformato in strumento politico di prima qualità, sfruttando proprio quelle retoriche trasversali su cui ha fondato la propria “originalità”, spesa poi nelle molteplici attività di lobbying politico. Stiamo parlando di Retake ovviamente, l’associazione volontaristica [...]\n\n\n\nhttp://www.militant-blog.org/?p=15073\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 01 Feb 2018 09:02:54 +0000",
      "date_published": 1517501323
    },
    {
      "post_id": 42,
      "title": "La conseguenza logica della legittimazione neofascista",
      "body": "Tante cose sono state scritte sulla tentata strage neofascista di ieri a Macerata. Molte di queste assolutamente condivisibili. Inutile ripetere un ragionamento che da anni cerchiamo di portare avanti e che, però, rimane confinato al sempre più ristretto ambito dell’antifascismo militante. La legittimazione del neofascismo, la sua normalizzazione politica, mediatica, culturale, sociale, porta [...]\n\n\n\nhttp://www.militant-blog.org/?p=15096\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sun, 04 Feb 2018 15:03:42 +0000",
      "date_published": 1517756897
    },
    {
      "post_id": 43,
      "title": "L’ideologia del decoro contro la città pubblica",
      "body": "Negli ultimi anni il binomio degrado/decoro è entrato prepotentemente nel lessico pubblico conquistando una centralità nel dibattito politico e nelle agende di governo delle città e del Paese. Si tratta di concetti labili e apparentemente “neutri”, che possono cioè essere stiracchiati in ogni direzione, ma che sempre più spesso, però, finiscono col sovrapporsi [...]\n\n\n\nhttp://www.militant-blog.org/?p=15099\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 06 Feb 2018 10:04:16 +0000",
      "date_published": 1517915323
    },
    {
      "post_id": 44,
      "title": "Dal “mai più” alla collaborazione, nel giro di tre giorni",
      "body": "[Nella foto, la carica congiunta di guardie e fascisti contro i compagni. Per chiarire chi sta con chi]\n\nProviamo a sostituire la parola islamico a quella neofascista. La manifestazione in solidarietà delle vittime dell’attentato islamico dello scorso sabato, che ha sconvolto la cittadina di Macerata, è stata vietata dal Partito democratico, [...]\n\n\n\nhttp://www.militant-blog.org/?p=15104\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 08 Feb 2018 07:59:59 +0000",
      "date_published": 1518084652
    },
    {
      "post_id": 45,
      "title": "Nessuna legittimazione mediatica del neofascismo. Neanche in nome della campagna elettorale",
      "body": "La tentata strage di Macerata è solo l’ultimo episodio di violenza neofascista nel nostro paese. Una violenza possibile unicamente grazie alla progressiva legittimazione politica dello squadrismo, più o meno mascherato. Una legittimazione che è passata dalla sovraesposizione mediatica di cui godono tutte le sigle dell’estrema destra, soprattutto romana, a fronte di una presenza [...]\n\n\n\nhttp://www.militant-blog.org/?p=15111\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 08 Feb 2018 12:08:50 +0000",
      "date_published": 1518095337
    },
    {
      "post_id": 46,
      "title": "Donne di serie B per uomini di serie A",
      "body": "Triste destino per Jessica Valentina Faoro. Prima abusata, poi aggredita, infine uccisa a coltellate, ma da un italiano. Nessun linciaggio di autisti Atm, nessuna vendetta contro manovratori di tram, neanche una piccola rappresaglia verso i residenti bianchi di Milano. Tutto ciò è vergognoso, in primo luogo verso la memoria della giovane vittima, colpevole [...]\n\n\n\nhttp://www.militant-blog.org/?p=15114\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 09 Feb 2018 10:37:45 +0000",
      "date_published": 1518174513
    },
    {
      "post_id": 47,
      "title": "Di ritorno da Macerata, passando per Piacenza",
      "body": "L’enorme corteo di Macerata ha, per ora, impedito lo smarcamento della sinistra liberale dalla questione antifascista. Minniti, Renzi, il Pd e la Cgil hanno dovuto prendere atto di un sentimento popolare tutt’oggi presente, magari non forte come in passato, ma capace di reagire all’a-fascismo istituzionale. In questi giorni Macerata si è trasformata in [...]\n\n\n\nhttp://www.militant-blog.org/?p=15117\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 12 Feb 2018 08:31:57 +0000",
      "date_published": 1518430109
    },
    {
      "post_id": 48,
      "title": "Fascismo mediatico e antifascismo elettorale: domani al Cinema Palazzo, San Lorenzo",
      "body": "Nei giorni che ci hanno accompagnato da Genova a Macerata l’Italia sembra essersi accorta dei suoi viscerali rigurgiti neofascisti, o quantomeno sembra aver avuto la prova concreta che la continua e martellante propaganda razzista (che ha trovato asilo bipartisan sui media nostrani)  può effettivamente produrre degenerazioni materiali nella realtà quotidiana. Domani pomeriggio al [...]\n\n\n\nhttp://www.militant-blog.org/?p=15121\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 13 Feb 2018 12:51:33 +0000",
      "date_published": 1518527323
    },
    {
      "post_id": 49,
      "title": "La crociata contro il contante",
      "body": "A intervalli più o meno regolari, e soprattutto in concomitanza delle elezioni, torna la crociata contro il denaro contante. Una campagna che in genere associa ogni utilizzatore di contante in evasore, quindi in peccatore e artefice primo del declino del paese, del malaffare, della corruzione strisciante. Insomma, chi usa il contante è un [...]\n\n\n\nhttp://www.militant-blog.org/?p=15091\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 15 Feb 2018 09:45:56 +0000",
      "date_published": 1518689361
    },
    {
      "post_id": 50,
      "title": "I numeri (reali) del neofascismo a Roma e Bologna",
      "body": "Se, per l’ennesima volta, torniamo sul baratro che separa la percezione mediatica dalla realtà materiale riguardo al neofascismo, non è per l’ultima trovata elettorale di Casapound: organizzare una marcia per la sicurezza delle donne che picchia alcune donne presenti in piazza Vittorio. Vorremmo invece ragionare sui numeri e sulla composizione della manifestazione di [...]\n\n\n\nhttp://www.militant-blog.org/?p=15125\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 17 Feb 2018 09:05:09 +0000",
      "date_published": 1518862149
    },
    {
      "post_id": 51,
      "title": "Visioni Militant(i): Fabrizio De André – Principe libero, di Luca Facchini",
      "body": "Una fiction Rai nientemeno che su Fabrizio De André non poteva non generare reazioni manichee, e così puntualmente è stato. Chi l’ha trovata orribile, noiosa, falsa; a chi invece è piaciuta, estasiato dall’interpretazione di Marinelli o dal realismo tabagista. Inevitabilmente affrontare di petto la vita e l’opera di De André, negli anni divenuto [...]\n\n\n\nhttp://www.militant-blog.org/?p=15135\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 19 Feb 2018 10:14:46 +0000",
      "date_published": 1519038521
    },
    {
      "post_id": 52,
      "title": "Consigli (o sconsigli) per gli acquisti: Italian Job, di Maurizio Di Fazio",
      "body": "Da pochi giorni è in libreria questo veloce pamphlet sugli orrori del mercato del lavoro italiano. Un testo agevole, giornalistico, polemico, senza dati né riferimenti, solo testimonianze dirette dei nuovi schiavi della moderazione salariale, della precarietà contrattuale, del produttivismo e della competizione liberistica. Senza occorrenze né sintesi statistiche è difficile dare a un [...]\n\n\n\nhttp://www.militant-blog.org/?p=15139\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 21 Feb 2018 09:34:14 +0000",
      "date_published": 1519229321
    },
    {
      "post_id": 53,
      "title": "Il fascismo dell’antifascismo dei fascisti antifascisti",
      "body": "A sentire Mauro Biani, e con lui il resto delle anime belle della sinistra liberale, il fascismo si affronterebbe con “la cultura”, “la pace”, “la solidarietà”, ma forse anche con la musica, la poesia, i fiori, gli elzeviri, i proverbi e le cene in compagnia. Tutto purché non lo si combatta coi mezzi [...]\n\n\n\nhttp://www.militant-blog.org/?p=15145\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 22 Feb 2018 11:05:12 +0000",
      "date_published": 1519297724
    },
    {
      "post_id": 54,
      "title": "Visioni Militant(i): Il filo nascosto, di Paul Thomas Anderson",
      "body": "Nella Londra degli anni Cinquanta assistiamo alla vita, normale e morbosa al tempo, del geniale stilista Reynolds Woodcock. Un artista dedito ossessivamente al suo lavoro, alla sua arte, coltivando questa eccezionalità con patologica scientificità. Le relazioni umane e sentimentali trovano senso solo all’interno di questo mondo chiuso in se stesso. La conoscenza di [...]\n\n\n\nhttp://www.militant-blog.org/?p=15149\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 26 Feb 2018 09:51:28 +0000",
      "date_published": 1519643316
    },
    {
      "post_id": 55,
      "title": "Inutili elezioni",
      "body": "Tra una settimana, qualsiasi sarà il risultato elettorale, tornerà in carica l’attuale governo. Non per le anomalie del sistema politico italiano però. Nell’ambito dell’Unione europea, attualmente, sono 17 i governi di “grande coalizione”, che godono cioè dell’appoggio più o meno formalizzato, più o meno mascherato, di “centrosinistra” e “centrodestra” (rigorosamente virgolettati: non esiste [...]\n\n\n\nhttp://www.militant-blog.org/?p=15153\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 01 Mar 2018 08:25:07 +0000",
      "date_published": 1519898976
    },
    {
      "post_id": 56,
      "title": "Fotografie segnanti",
      "body": "Nonostante l’offerta mediatico-elettorale coprisse sostanzialmente tutto l’arco della politica, dal neofascismo all’estrema sinistra passando per l’euro-liberismo, il protezionismo e tutte le gradazioni del populismo, quelle di ieri sono state le elezioni politiche con la più alta astensione di sempre. Un dato, come sappiamo, ambivalente e sfaccettato, ma che conferma una tendenza storica: senza [...]\n\n\n\nhttp://www.militant-blog.org/?p=15157\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 05 Mar 2018 08:32:59 +0000",
      "date_published": 1520240897
    },
    {
      "post_id": 57,
      "title": "Lezioni elettorali: la valanga populista",
      "body": "Poteva andare molto peggio di così. Potevamo svegliarci con un Pd al 25%, Forza Italia al 20 e passa, +Europa in Parlamento e Liberi e Uguali sopra il 5. Il fronte euro-liberista, detto altrimenti, avrebbe potuto dare le carte anche stavolta, blandire l’Europa e rassicurare i mercati. E invece il blocco politico della [...]\n\n\n\nhttp://www.militant-blog.org/?p=15160\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 07 Mar 2018 08:55:10 +0000",
      "date_published": 1520413638
    },
    {
      "post_id": 58,
      "title": "Lezioni elettorali: la scomparsa della sinistra",
      "body": "Esistono nel nostro malandato paese due presidi sociali di eccezionale importanza, da tempo abbandonati dalla sinistra d’ogni colore: i bar e le edicole. Nei primi si apprende empiricamente la vox populi; nelle seconde si scorge la straordinaria complessità del quotidiano. Né i primi né le seconde bastano per capire la realtà. Ma senza [...]\n\n\n\nhttp://www.militant-blog.org/?p=15169\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 08 Mar 2018 09:31:25 +0000",
      "date_published": 1520503758
    },
    {
      "post_id": 59,
      "title": "Lezioni elettorali: fascismo, neofascismo e reazione",
      "body": "Nel 2013 le due principali forze neofasciste, Casapound e Forza Nuova, presero insieme 137.687 voti, lo 0,4% elettorale. A questo dato va però aggiunto il risultato de La Destra di Storace, dentro la coalizione di centrodestra ma alternativa a Fratelli D’Italia della Meloni: altri 219.769 voti, lo 0,6%. Sommati, i tre partiti neofascisti [...]\n\n\n\nhttp://www.militant-blog.org/?p=15176\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 10 Mar 2018 08:51:34 +0000",
      "date_published": 1520705252
    },
    {
      "post_id": 60,
      "title": "Consigli (o sconsigli) per gli acquisti",
      "body": "E’ in libreria, ormai da qualche giorno, l’ultima fatica di Domenico Moro, “La gabbia dell’euro, perché uscirne è internazionalista e di sinistra”, un pamphlet di cui consigliamo caldamente la lettura. Il volume arriva infatti sugli scaffali con straordinario tempismo, a ridosso dell’esito elettorale che ha certificato la scomparsa dai radar della rappresentanza della cosiddetta [...]\n\n\n\nhttp://www.militant-blog.org/?p=15186\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 12 Mar 2018 12:50:29 +0000",
      "date_published": 1520860035
    },
    {
      "post_id": 61,
      "title": "Ripresa, crescita, benessere",
      "body": "Sabato scorso è apparso sul Corriere un fondamentale articolo per cogliere la direzione del futuro prossimo. Ancora vittime della retorica della crisi, rischiamo di arrivare in ritardo alla comprensione di questa ripresa economica che è sempre più strutturale. Secondo i dati della produzione industriale di Veneto, Lombardia e Emilia-Romagna, nonché secondo i commenti [...]\n\n\n\nhttp://www.militant-blog.org/?p=15180\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 14 Mar 2018 09:59:00 +0000",
      "date_published": 1521022049
    },
    {
      "post_id": 62,
      "title": "Appunti postelettorali. Un tentativo di analisi gramsciana",
      "body": "Pubblichiamo un articolo di Angelo D'Orsi sulla disfatta elettorale delle sinistre, uscito ieri su Micromega. Proprio perchè D'Orsi non può dirsi vicino alle nostre posizioni, la riflessione proposta è ancora più importante, capace di centrare tutte le questioni determinanti della sconfitta elettorale delle \"sinistre radicali\", che rimanda a un fallimento politico che viene [...]\n\n\n\nhttp://www.militant-blog.org/?p=15201\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 15 Mar 2018 11:32:32 +0000",
      "date_published": 1521115651
    },
    {
      "post_id": 63,
      "title": "Grande la confusione sotto il cielo: perchè usciamo da Eurostop",
      "body": "Raramente utilizziamo questo spazio per comunicazioni ufficiali, il più delle volte inutili per un collettivo come il nostro. Se questa volta deroghiamo alla regola che vuole questo un luogo di confronto, e non pietrificato dalle formalità, è perché è ormai inevitabile informare della nostra fuoriuscita dalla piattaforma politica Eurostop. Prendiamo atto della scelta [...]\n\n\n\nhttp://www.militant-blog.org/?p=15192\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 16 Mar 2018 08:55:35 +0000",
      "date_published": 1521198444
    },
    {
      "post_id": 64,
      "title": "Monopoli privati e diritti sociali: il conflitto inevitabile",
      "body": "Tra i diritti fondamentali sanciti in Costituzione c’è quello alla mobilità: «Ogni cittadino può circolare e soggiornare liberamente in qualsiasi parte del territorio nazionale». E’ una delle tipiche formulazioni di compromesso presenti nella nostra Costituzione. Dal punto di vista liberale, il diritto consente la semplice libertà formale di potersi spostare per il paese [...]\n\n\n\nhttp://www.militant-blog.org/?p=15209\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 17 Mar 2018 08:57:19 +0000",
      "date_published": 1521317239
    },
    {
      "post_id": 65,
      "title": "Aldo Moro e il decennio dimenticato",
      "body": "Del sequestro di Aldo Moro conosciamo nel dettaglio la sceneggiatura, ma mai come in questo anniversario non ne riconosciamo più la verità. E’ scomparsa, obliterata da spirito di vendetta o forse, più semplicemente, da ignoranza politica, la storia. Venuto meno il contesto, non rimane che la fiction: targhe e auto, svolte e toponomastica, [...]\n\n\n\nhttp://www.militant-blog.org/?p=15213\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 19 Mar 2018 08:44:54 +0000",
      "date_published": 1521450442
    },
    {
      "post_id": 66,
      "title": "Balzerani, D’Antona, Voltaire",
      "body": "Non torniamo sull’ormai notissima vicenda di Barbara Balzerani, indagata (!)  dalla procura di Firenze per aver parlato in pubblico in un centro sociale, il Cpa-Firenze Sud, luogo di compagni tra i più cari che ci è capitato di conoscere in questi anni. Tutto l’episodio descrive egregiamente i tempi correnti, in cui si usa [...]\n\n\n\nhttp://www.militant-blog.org/?p=15218\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 21 Mar 2018 08:53:44 +0000",
      "date_published": 1521623247
    },
    {
      "post_id": 67,
      "title": "Da Putin a Facebook, il populismo spiegato attraverso l’ideologia fake news",
      "body": "Per due anni ci hanno spiegato che la Brexit, così come la vittoria elettorale di Trump o il No al referendum italiano, erano il frutto di una sapiente operazione di propaganda mediatica manovrata dal Cremlino. Più in generale, qualsiasi fenomeno politico non allineato con l’european consensus era sicuramente il frutto di manipolazioni psicologiche [...]\n\n\n\nhttp://www.militant-blog.org/?p=15223\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 23 Mar 2018 09:07:13 +0000",
      "date_published": 1521817643
    },
    {
      "post_id": 68,
      "title": "Da Putin a Facebook, il populismo spiegato attraverso l’ideologia fake news",
      "body": "Per due anni ci hanno spiegato che la Brexit, così come la vittoria elettorale di Trump o il No al referendum italiano, erano il frutto di una sapiente operazione di propaganda mediatica manovrata dal Cremlino. Più in generale, qualsiasi fenomeno politico non allineato con l’european consensus era sicuramente il frutto di manipolazioni psicologiche [...]\n\n\n\nhttp://www.militant-blog.org/?p=15223\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 23 Mar 2018 09:07:13 +0000",
      "date_published": 1522055365
    },
    {
      "post_id": 69,
      "title": "Dal partito della nazione al partito della reazione",
      "body": "Si profila all’orizzonte un governo Lega-M5S. Difficile, ma non impossibile, e soprattutto non inimmaginabile. Guardando alla composizione sociale del bacino elettorale dei due partiti, si scoprirebbero molte più corrispondenze di quanto a prima vista potrebbe intendersi. Ambedue gli elettorati – quello leghista più omogeneo, quello pentastellato maggiormente frastagliato – condividono lo stesso bisogno [...]\n\n\n\nhttp://www.militant-blog.org/?p=15227\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 26 Mar 2018 07:54:58 +0000",
      "date_published": 1522055365
    },
    {
      "post_id": 70,
      "title": "L’autobus di Fico e la sinistra aristocratica",
      "body": "Al tempo della museificazione del socialismo, era la quantità di stellette e onorificenze appuntate sul petto a distinguere i dirigenti dal popolo. La feticizzazione del riconoscimento aveva una sua logica: veniamo dalla merda – era il ragionamento implicito – abbiamo lottato e sofferto, siamo stati torturati e uccisi, ci avete fucilato, imbavagliato, bombardato, [...]\n\n\n\nhttp://www.militant-blog.org/?p=15233\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 28 Mar 2018 07:39:51 +0000",
      "date_published": 1522253576
    },
    {
      "post_id": 71,
      "title": "Syrizazione del M5S?",
      "body": "Ciascuno degli interessati alla politica in queste settimane sta dando la propria interpretazione del voto. E’ inevitabile che sia così. Smarriti nei labirinti astrali della psicologia delle masse, a volte è utile affidarsi alla classe dirigente europea, libera quantomeno del bisogno represso di legittimarsi. Ieri ha parlato tale Shahin Vallée, consigliere economico di [...]\n\n\n\nhttp://www.militant-blog.org/?p=15238\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 30 Mar 2018 08:06:59 +0000",
      "date_published": 1522411741
    },
    {
      "post_id": 72,
      "title": "Sovranismo contro europeismo, la nuova frattura della politica europea",
      "body": "Scrive Sergio Fabbrini sul Sole 24 Ore di domenica 1 aprile: «l’esito delle elezioni del 4 marzo ha portato a compimento una crisi politica iniziata il 16 novembre 2011 (quando si insediò il governo Monti) . La nascita del governo Monti non fu dovuta ad un colpo di Stato contro il precedente governo Berlusconi, [...]\n\n\n\nhttp://www.militant-blog.org/?p=15242\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 03 Apr 2018 08:18:09 +0000",
      "date_published": 1522775346
    },
    {
      "post_id": 73,
      "title": "Gli scioperi, quelli veri",
      "body": "Tra aprile e giugno – tre mesi – i sindacati francesi hanno proclamato 36 – trentasei – giornate di sciopero in tutto il settore ferroviario nazionale. Una ogni tre giorni. Il tutto, «in un clima crescente di tensione sociale, [dove sciopereranno] anche il personale di Air France, i netturbini e alcuni lavoratori del [...]\n\n\n\nhttp://www.militant-blog.org/?p=15246\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 05 Apr 2018 09:04:07 +0000",
      "date_published": 1522922953
    },
    {
      "post_id": 74,
      "title": "Democrazia senza potere",
      "body": "L’eroica difesa della propria terra da parte dei curdi merita rispetto. Purtroppo, nella sinistra occidentale, questa esperienza travalica l’episodio concreto per divenire modello politico. Molti anni fa, ingenui, credevamo nell’errore di prospettiva, ad esempio quando si tentava di replicare modelli assai peculiari, vedasi la resistenza Maya in Chiapas, nella metropoli capitalista. Da qualche [...]\n\n\n\nhttp://www.militant-blog.org/?p=15250\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 09 Apr 2018 07:58:40 +0000",
      "date_published": 1523264940
    },
    {
      "post_id": 75,
      "title": "Le “gas news” sulla guerra che non deve finire",
      "body": "Sulla Siria e la colossale campagna di fake news costruita contro quel popolo ci siamo espressi decine di volte. Questa volta ci limitiamo a ripubblicare l'articolo uscito ieri sul Manifesto di Tommaso Di Francesco, di cui condividiamo ogni singola virgola e, in particolare, la tesi di fondo: la guerra in Siria non deve [...]\n\n\n\nhttp://www.militant-blog.org/?p=15260\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 11 Apr 2018 08:04:56 +0000",
      "date_published": 1523437658
    },
    {
      "post_id": 76,
      "title": "Fake wars",
      "body": "Proprio stamane sul Corriere un “anonimo” ufficiale militare italiano smentiva definitivamente la fake news sulle armi chimiche: «Dire che siamo preoccupati non rende bene l’idea. In verità siamo sconcertati da quello che sta succedendo in Siria. […] Prima di proseguire vorrei sottolineare una cosa: l’attacco dovrebbe essere una rappresaglia per l’uso di armi [...]\n\n\n\nhttp://www.militant-blog.org/?p=15265\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 14 Apr 2018 12:39:17 +0000",
      "date_published": 1523714912
    },
    {
      "post_id": 77,
      "title": "Il paradosso fiscale che strangola le città",
      "body": "La perfida combinazione tra taglio dei trasferimenti statali e federalismo fiscale è alla radice del declino delle città, anzi, della città intesa come organismo sociale. Lo spiegano bene alcuni dati pubblicati ieri sul Sole 24 Ore: «La Capitale ha messo in programma per quest’anno una spesa da 467,5 milioni di euro, che significano [...]\n\n\n\nhttp://www.militant-blog.org/?p=15268\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 16 Apr 2018 08:54:22 +0000",
      "date_published": 1523873350
    },
    {
      "post_id": 78,
      "title": "L’inverno atlantista della «opposizione siriana»",
      "body": "Le guerre hanno questo di positivo: costringono a una scelta di parte. Difficile continuare a sguazzare nell’ingegneria dei né né, nell’indolenza di chi si arrampica sui «sebbene» e gli «anche se» pur di non dichiarare il proprio appoggio esplicito al regime change atlantista. Certo in Europa, più che altro in Italia, continueranno le [...]\n\n\n\nhttp://www.militant-blog.org/?p=15273\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 19 Apr 2018 07:55:00 +0000",
      "date_published": 1524128957
    },
    {
      "post_id": 79,
      "title": "Bullismo e contestazione: il labile confine tra protesta e viltà",
      "body": "La scena del professore di Lucca bullizzato da un suo studente tra gli sghignazzi del resto della classe deve aver mandato in visibilio le truppe agli ordini della biopolitica: quale miglior esempio di destituzione del potere costituito? L’attacco al cuore del dispositivo repressivo incarnato nella figura del professore è il primo beffardo segno [...]\n\n\n\nhttp://www.militant-blog.org/?p=15277\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 23 Apr 2018 07:55:43 +0000",
      "date_published": 1524474458
    },
    {
      "post_id": 80,
      "title": "Convulsioni elettorali",
      "body": "Nella competizione tra partiti è opportuno concentrarsi sulle percentuali elettorali. In tal senso, le elezioni regionali del Friuli Venezia Giulia dicono molto anche a livello nazionale: chi in questa fase si presenta come opposizione ha tutto da guadagnarci. Viceversa, per una comprensione maggiore del quadro politico nel suo insieme, bisogna guardare ai dati [...]\n\n\n\nhttp://www.militant-blog.org/?p=15281\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 02 May 2018 08:19:53 +0000",
      "date_published": 1525255666
    },
    {
      "post_id": 81,
      "title": "Dalle stelle alla stallo… al governo “neutrale”?",
      "body": "E' da un po' di tempo che non partecipiamo più al circo elettorale e con ogni probabilità non torneremo a farlo nemmeno se, come al momento sembrerebbe plausibile, nei prossimi mesi si dovessero riaprire le urne. Eppure ci pare di poter dire che di fronte all'ipotesi di un governo \"neutrale\" paventata ieri da Mattarella [...]\n\n\n\nhttp://www.militant-blog.org/?p=15285\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 08 May 2018 08:46:10 +0000",
      "date_published": 1525772907
    },
    {
      "post_id": 82,
      "title": "Immigrati, sfruttati, periferie: per un antirazzismo non ideologico",
      "body": "Negli ultimi tempi uno dei temi al centro del dibattito politico, nazionale ed internazionale, è quello legato alla questione migranti. Il razzismo, la richiesta di più sicurezza, l'opposizione alle ondate migratorie, sono diventati veri e propri assi portanti non solo della costruzione di consenso di alcuni dei maggiori partiti politici, ma anche della [...]\n\n\n\nhttp://www.militant-blog.org/?p=15289\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 09 May 2018 08:46:54 +0000",
      "date_published": 1525860664
    },
    {
      "post_id": 83,
      "title": "Nuvole parlanti/3… consigli per gli acquisti.",
      "body": "Torniano dopo diversi mesi a scrivere di fumetti e lo facciamo per suggerire la lettura di “Renato Jones. l’Uno %”, un volume della Panini Comics che raccoglie il primo arco narrativo dell’omonima serie scritta, diretta e disegnata dal canadese Kaare Kyle Andrews e pubblicata negli Stati Uniti dai tipi della Image Comics. Leggendo il [...]\n\n\n\nhttp://www.militant-blog.org/?p=15294\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 11 May 2018 07:45:01 +0000",
      "date_published": 1526152140
    },
    {
      "post_id": 84,
      "title": "Come si pensa una rivoluzione?",
      "body": "E' in edicola, in verità da qualche settimana, la pubblicazione degli atti del convegno che abbiamo organizzato lo scorso autunno al Csoa Intifada. Nel centenario della Rivoluzione tentare la strada del ricordo originale non era certo cosa semplice. Crediamo, nonostante ciò, che i contributi ospitati in questo breve volume colgano l'essenza della [...]\n\n\n\nhttp://www.militant-blog.org/?p=15300\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 14 May 2018 08:04:27 +0000",
      "date_published": 1526288937
    },
    {
      "post_id": 85,
      "title": "La strage di Gaza e l’impunità sionista",
      "body": "(Foto di Yasser Qudih, fotografo palestinese) \n\nLa strage di donne e uomini palestinesi di due giorni fa rappresenta l’ennesimo punto di non ritorno di una situazione in cui la prevaricazione terrorista di Israele viene taciuta e tollerata, in ossequio al nuovo piano per il [...]\n\n\n\nhttp://www.militant-blog.org/?p=15307\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 16 May 2018 08:30:00 +0000",
      "date_published": 1526465308
    },
    {
      "post_id": 86,
      "title": "Populismo di governo non significa europeismo d’opposizione",
      "body": "Potremmo avere davvero un governo “populista”. Non ci crediamo, troppi i vincoli che gravano sul presunto accordo legastellato: Berlusconi, l’Europa, i “mercati”, nonché prospettive strategiche differenti tra i due partiti contraenti. Eppure la crisi della rappresentanza liberale potrebbe portare addirittura al governo “dei barbari”, come li ha definiti il Financial Times. Tutto è [...]\n\n\n\nhttp://www.militant-blog.org/?p=15304\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 17 May 2018 09:06:37 +0000",
      "date_published": 1526551742
    },
    {
      "post_id": 87,
      "title": "Dicono i muri",
      "body": "Mentre tutti i giornali borghesi dicono una cosa, i muri di Roma ne dicono un'altra. Al fianco del Venezuela che resiste, contro l'imperialismo e ogni forma di ingerenza, il 20 maggio Vota Maduro. Perchè alcune elezioni sono importanti, davvero.\n\n\n\nhttp://www.militant-blog.org/?p=15314\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 18 May 2018 07:10:13 +0000",
      "date_published": 1526634520
    },
    {
      "post_id": 88,
      "title": "Il cor(ro)sivo della Militant",
      "body": "Nell’Italia della gig economy, in cui l’unica occupazione che cresce è quella precaria e a tempo determinato, chi ha fatto questo volantino ha giustamente sentito il dovere di specificare che il lavoro che offre sarà “con retribuzione”, un benefit mica da niente di questi tempi. Alla fine i padroni la riforma costituzionale, quella vera, [...]\n\n\n\nhttp://www.militant-blog.org/?p=15327\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 19 May 2018 07:27:29 +0000",
      "date_published": 1526742531
    },
    {
      "post_id": 89,
      "title": "Tutta la periferia in uno svincolo…",
      "body": "Si dice in giro, si mormora, che il primo giugno dovrebbero finalmente riprendere i lavori per l'allargamento della Tiburtina. Il Comune di Roma e l'amministratore strardinario della Tecnis, l'azienda vincitrice dell'appalto, avrebbero finalmente trovato il modo per evitare che i fondi pubblici stanziati per i cantieri venissero poi stornati per saldare i debiti dell'azienda [...]\n\n\n\nhttp://www.militant-blog.org/?p=15331\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 21 May 2018 10:00:54 +0000",
      "date_published": 1526900945
    },
    {
      "post_id": 90,
      "title": "Behind enemy lines",
      "body": "Per cancellare i \"murales dello scandalo\" a Tor Bella Monaca ci sono voluti 120 vigili urbani e oltre 60 tra poliziotti e carabinieri (leggi)  che hanno operato fino alle tre del mattino sotto l'occhio vigile della Sindaca. Siamo abituati a pensare che lo Stato agisca di giorno, alla luce del sole, mentre chi viola [...]\n\n\n\nhttp://www.militant-blog.org/?p=15342\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 22 May 2018 07:26:12 +0000",
      "date_published": 1527008939
    },
    {
      "post_id": 91,
      "title": "La lunga attesa della sinistra elettorale",
      "body": "Dal 4 marzo, non appena ha iniziato a prendere forma l’abbraccio populista fra i 5 stelle e la Lega, buona parte della sinistra elettorale si è seduta sulla riva del fiume convinta di veder passare da li a breve il cadavere di quanti, pur convinti progressisti, avevano votato per il movimento di Di Maio. [...]\n\n\n\nhttp://www.militant-blog.org/?p=15347\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 23 May 2018 09:51:42 +0000",
      "date_published": 1527106039
    },
    {
      "post_id": 92,
      "title": "Visioni Militant(i): Dogman, di Matteo Garrone",
      "body": "In una periferia sospesa e irriconoscibile, ma proprio per questo immagine di ogni periferia di ogni latitudine, si trascina la vita di una comunità umana che di comune non ha più niente. C’è il prepotente, il bottegaro, il fancazzista, l’arricchito e il disperato; e poi c’è Marcello, tolettatore di cani, attratto da questa [...]\n\n\n\nhttp://www.militant-blog.org/?p=15349\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 25 May 2018 08:33:45 +0000",
      "date_published": 1527271639
    },
    {
      "post_id": 93,
      "title": "Tanto tuonò che piovve",
      "body": "Nel tentativo di salvaguardare il rispetto dei vincoli europei da parte dell’Italia ieri sera Mattarella ha fatto un favore enorme tanto a Salvini quanto a Di Maio, traendoli d'impaccio e regalando loro un capitale politico che, se non sono stupidi (e, ahinoi, non lo sono) , potranno agevolmente incassare di qui a qualche mese, quando [...]\n\n\n\nhttp://www.militant-blog.org/?p=15355\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 28 May 2018 09:33:04 +0000",
      "date_published": 1527505783
    },
    {
      "post_id": 94,
      "title": "Il governo e il gioco dell’Oca",
      "body": "E così, alla fine, si ritorna al punto di partenza, con la giostra della politique politicienne che in poche ore ha fatto l’intero giro per tornare dov’era partita, impossibilitata a trovare una via d’uscita da quel “bipopulismo imperfetto” fotografato dalle elezioni del 4 marzo. Ogni attore in commedia potrà finalmente ricominciare a recitare la [...]\n\n\n\nhttp://www.militant-blog.org/?p=15360\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 01 Jun 2018 11:13:17 +0000",
      "date_published": 1527858567
    },
    {
      "post_id": 95,
      "title": "La strana hit parade dei governi reazionari…",
      "body": "Non avevamo fatto in tempo ad anticiparla che, puntualmente, è arrivata la dichiarazione del segretario del Prc che definisce il neonato governo pentaleghista come quello più a destra della storia. Se quello presieduto da Conte è il peggiore di sempre, ci chiediamo allora dove vadano collocati, in questa speciale hit parade, i governi anticomunisti [...]\n\n\n\nhttp://www.militant-blog.org/?p=15369\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 02 Jun 2018 07:47:03 +0000",
      "date_published": 1527952120
    },
    {
      "post_id": 96,
      "title": "Dicono i muri",
      "body": "Hanno scritto che si era trattato di una sparatoria, ma quando qualcuno spara alle spalle ad un uomo disarmato non è una sparatoria: è un'esecuzione. Hanno scritto che c'era stato un tentativo di furto, ma cercare lamiere in una fabbrica abbandonata per costruirsi una baracca non è rubare: è tentare di sopravvivere in un [...]\n\n\n\nhttp://www.militant-blog.org/?p=15373\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 05 Jun 2018 07:34:09 +0000",
      "date_published": 1528315640
    },
    {
      "post_id": 97,
      "title": "Soumaila e la coscienza (ri)pulita del buon borghese.",
      "body": "Questa mattina, in un lungo articolo sul Corriere della Sera, Giovanni Bianconi ricostruisce le ore che hanno portato all'arresto del quarantatrenne accusato dell'omicidio di Soumaila Sacko. Secondo una delle firme più prestigiose (e per di più \"progressista\")  del quotidiano, tutta la vicenda sarebbe dunque da derubricare nella cronaca nera di provincia. Un \"fattaccio\" legato [...]\n\n\n\nhttp://www.militant-blog.org/?p=15376\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 08 Jun 2018 07:57:02 +0000",
      "date_published": 1528488446
    },
    {
      "post_id": 98,
      "title": "L’opposizione possibile al populismo",
      "body": "Ci fosse stato Cottarelli, sarebbe stato tutto molto più facile. La sinistra sarebbe comunque scomparsa, divorata dal populismo a quel punto straripante, ma avremmo potuto inserire il pilota automatico della lotta “al governo delle banche” o qualcosa del genere. Il governo populista complica notevolmente le cose. Non è solo il consenso popolare di [...]\n\n\n\nhttp://www.militant-blog.org/?p=15380\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 11 Jun 2018 07:40:56 +0000",
      "date_published": 1528794449
    },
    {
      "post_id": 99,
      "title": "Lo stadio della Roma e l’aroma dello stadio.",
      "body": "A Roma, in Procura, devono essere davvero dei gran burloni. La Raggi non ha fatto nemmeno in tempo a postare urbi et orbi il suo messaggio di giubilo per l'imminente inizio dei lavori dello Stadio che questa mattina i carabinieri hanno eseguito nove arresti \"per associazione a delinquere finalizzata alla corruzione nell'ambito del progetto [...]\n\n\n\nhttp://www.militant-blog.org/?p=15384\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 13 Jun 2018 08:16:03 +0000",
      "date_published": 1528884677
    },
    {
      "post_id": 100,
      "title": "L’osceno al centro della scena",
      "body": "Dovremmo fare tutti un po' di sana autocritica, noi per primi. Per anni abbiamo sottovalutato Matteo Salvini tratteggiandolo come un razzista meschino e imbecille intento a giocare con le ruspe, complice forse quell'espressione non proprio sveglia che si porta dietro. In realtà, però, il leader leghista, pur confermando in pieno di essere un razzista [...]\n\n\n\nhttp://www.militant-blog.org/?p=15388\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 18 Jun 2018 09:20:28 +0000",
      "date_published": 1529330844
    },
    {
      "post_id": 101,
      "title": "La piazza e la Politica (and more)",
      "body": "La bella e partecipata manifestazione di sabato scorso a Roma ha dimostrato che esiste un’opposizione alle politiche populiste del governo Lega-Cinquestelle. Eppure non sarà la sinistra a capitalizzare le spinte sociali che pure resistono all’imbarbarimento dei rapporti politici. Il modo e il tono ...\n\nhttp://www.militant-blog.org/?p=15599\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 14 Nov 2018 10:51:24 +0000",
      "date_published": 1545058336
    },
    {
      "post_id": 102,
      "title": "Lotte di popolo, tra Vandea e anti-europeismo",
      "body": "E’ inutile stare a sofisticare nel mentre di una mobilitazione popolare contro un governo liberista. Ciò che sta avvenendo in Francia non è altro che il portato di uno scontro più generale tra euro-liberismo e pezzi di popolo impoverito e incattivito. E’ una protesta carsica e ormai strutturale, che...\n\nhttp://www.militant-blog.org/?p=15604\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 19 Nov 2018 09:03:38 +0000",
      "date_published": 1545058336
    },
    {
      "post_id": 103,
      "title": "Visioni Militant(i): In Guerra, di Stéphane Brizé",
      "body": "Le fortune dei film spesso sono la risultante di più fattori, molti dei quali variabili indipendenti che riescono a mettere in moto un meccanismo di accelerazione improvvisa capace di portare una pellicola alla ribalta. Un aneddoto che riguarda uno dei protagonisti, una dichiarazione azzeccata del r...\n\nhttp://www.militant-blog.org/?p=15610\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 05 Dec 2018 09:00:38 +0000",
      "date_published": 1545058336
    },
    {
      "post_id": 104,
      "title": "Gilet gialli, rossi e Negri",
      "body": "Dopo un mese di mobilitazione, è ormai luogo comune entusiasmarsi per le vicende francesi. Se invece del sostegno politico ci spostassimo sulla riflessione cosciente, la cosa meno improbabile è stata scritta da Toni Negri (L'insurrezione francese) . Dal punto di vista politico, però, occorre sgombera...\n\nhttp://www.militant-blog.org/?p=15615\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 10 Dec 2018 08:47:22 +0000",
      "date_published": 1545058336
    },
    {
      "post_id": 105,
      "title": "Ex Penicillina: la lotta comincia adesso.",
      "body": "Era stato preparato in pompa magna, con decine e decine di comparse in tuta e casco blu ad arricchire la scena e con i giornalisti convocati ad immortalarla, eppure ieri lo showdown salviniano sullo sgombero della ex Penicillina non dev'essere andato proprio come se l'era immaginato il titolare del ...\n\nhttp://www.militant-blog.org/?p=15619\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 11 Dec 2018 09:39:07 +0000",
      "date_published": 1545058336
    },
    {
      "post_id": 106,
      "title": "Il governo del cedimento",
      "body": "Avrebbe dovuto essere la manovra del cambiamento e invece quello a cui abbiamo assistito è stato il cambiamento della manovra, per giunta sotto dettatura dell’Unione Europea che, almeno fino a febbraio, continuerà comunque a vigilare sui nostri conti non fidandosi affatto delle rassicurazioni del go...\n\nhttp://www.militant-blog.org/?p=15623\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 20 Dec 2018 09:18:21 +0000",
      "date_published": 1545310894
    },
    {
      "post_id": 107,
      "title": "Visioni Militant(i): Santiago, Italia, di Nanni Moretti",
      "body": "Il golpe contro Allende è notoriamente una delle mitologie degli anni Settanta, vicenda entro cui trovano spazio tutte le narrazioni edificanti della sinistra popolare dell’epoca. Dopo essersi allontanato dalle dispute politiche – ritagliandosi e poi rifiutando il ruolo di grillo parlante dell’incon...\n\nhttp://www.militant-blog.org/?p=15636\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 29 Dec 2018 10:04:12 +0000",
      "date_published": 1546520576
    },
    {
      "post_id": 108,
      "title": "1999-2019… Vent’anni di Euro, ma niente da festeggiare.",
      "body": "Questo inizio di 2019 porta con se anniversari belli, come i 60 anni della rivoluzione cubana, ed altri decisamente più infausti. Il primo gennaio del 1999, infatti, nasceva l'Euro, inizialmente solo come valuta e poi, dal 2002, anche come moneta e banconota fisica. Vent'anni rappresentano un lasso ...\n\nhttp://www.militant-blog.org/?p=15640\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 02 Jan 2019 12:13:43 +0000",
      "date_published": 1546520576
    },
    {
      "post_id": 109,
      "title": "Il sovranismo populista di Marcos",
      "body": "[Più di vent'anni dopo, un testo che sembra scritto oggi. Che però verrebbe scambiato per il report dell'ultimo consiglio dei ministri giallo-blu, o forse per la lezione inaugurale del think tank di Steve Bannon. Cambiano i tempi, non le mitologie che si costruiscono attorno alle diverse posizioni p...\n\nhttp://www.militant-blog.org/?p=15646\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 04 Jan 2019 08:45:39 +0000",
      "date_published": 1546606928
    },
    {
      "post_id": 110,
      "title": "Fabrizio De André vent’anni dopo",
      "body": "De André fa parte della grande cultura italiana, nonostante le contraddizioni lancinanti che la sua opera porta con sé. Da decenni è un monumento, per ciò stesso impossibile da affrontare di petto. Cosa si può dire di qualcuno su cui è già stato scritto e detto di tutto, nel bene come nel male? [......\n\nhttp://www.militant-blog.org/?p=15650\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 11 Jan 2019 10:04:01 +0000",
      "date_published": 1547211677
    },
    {
      "post_id": 111,
      "title": "Battisti libero. Liberiamo gli anni Settanta.",
      "body": "Da ieri notte, purtroppo, Cesare Battisti è di nuovo prigioniero. C'è qualcosa di estremamente significativo nell'accanimento con cui lo Stato italiano gli ha dato la caccia in questi anni, qualcosa che travalica la sua figura, il suo caso specifico, e affonda le proprie radici nella paura che quel ...\n\nhttp://www.militant-blog.org/?p=15655\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sun, 13 Jan 2019 16:09:18 +0000",
      "date_published": 1547470866
    },
    {
      "post_id": 112,
      "title": "Battisti e la cattiva coscienza di certi “sinistri”.",
      "body": "Se c’è qualcosa che rende più cupe queste ore, sono le reazioni di certa “sinistra” di fronte all’arresto di Battisti, e più in generale rispetto all’uso strumentale che viene fatto di questa vicenda per sciorinare giudizi sommari sull’intero ciclo di lotte degli anni Settanta.\n\nSi va dagli strategh...\n\nhttp://www.militant-blog.org/?p=15658\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 14 Jan 2019 18:13:23 +0000",
      "date_published": 1547557284
    },
    {
      "post_id": 113,
      "title": "Pietà l’è morta",
      "body": "«Nemici e traditori un altro compagno è morto ma un altro partigiano oggi è risorto. Ma prima di morire tre volte ha pregato che Dio maledica il nemico alleato. Che Dio stramaledica chi ci ha tradito»\n\nLa fiera dell’infamità, miserabile natura di questa borghesia stracciona, rancorosa, vigliacca, se...\n\nhttp://www.militant-blog.org/?p=15663\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 15 Jan 2019 17:18:55 +0000",
      "date_published": 1547645098
    },
    {
      "post_id": 114,
      "title": "Il cor(ro)sivo della Militant",
      "body": "Il razzista olandese Geert Wilders ha abbandonato la cosiddetta Nexit. Il populista Salvini ha chiarito che la sua intenzione non è rompere la Ue, ma \"riformare i trattati\". La nazionalista Marine Le Pen ha dichiarato che non vuole uscire dall'euro, ma costruire \"un'altra europa\". Ci verrebbe da chi...\n\nhttp://www.militant-blog.org/?p=15668\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 19 Jan 2019 08:49:41 +0000",
      "date_published": 1547904534
    },
    {
      "post_id": 115,
      "title": "Battisti libero. Liberiamo gli anni Settanta. (and more)",
      "body": "Da ieri notte, purtroppo, Cesare Battisti è di nuovo prigioniero. C'è qualcosa di estremamente significativo nell'accanimento con cui lo Stato italiano gli ha dato la caccia in questi anni, qualcosa che travalica la sua figura, il suo caso specifico, e affonda le proprie radici nella paura che quel ...\n\nhttp://www.militant-blog.org/?p=15655\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sun, 13 Jan 2019 16:09:18 +0000",
      "date_published": 1549042611
    },
    {
      "post_id": 116,
      "title": "Battisti e la cattiva coscienza di certi “sinistri”.",
      "body": "Se c’è qualcosa che rende più cupe queste ore, sono le reazioni di certa “sinistra” di fronte all’arresto di Battisti, e più in generale rispetto all’uso strumentale che viene fatto di questa vicenda per sciorinare giudizi sommari sull’intero ciclo di lotte degli anni Settanta.\n\nSi va dagli strategh...\n\nhttp://www.militant-blog.org/?p=15658\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 14 Jan 2019 18:13:23 +0000",
      "date_published": 1549042611
    },
    {
      "post_id": 117,
      "title": "Pietà l’è morta",
      "body": "«Nemici e traditori un altro compagno è morto ma un altro partigiano oggi è risorto. Ma prima di morire tre volte ha pregato che Dio maledica il nemico alleato. Che Dio stramaledica chi ci ha tradito»\n\nLa fiera dell’infamità, miserabile natura di questa borghesia stracciona, rancorosa, vigliacca, se...\n\nhttp://www.militant-blog.org/?p=15663\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 15 Jan 2019 17:18:55 +0000",
      "date_published": 1549042611
    },
    {
      "post_id": 118,
      "title": "Il cor(ro)sivo della Militant",
      "body": "Il razzista olandese Geert Wilders ha abbandonato la cosiddetta Nexit. Il populista Salvini ha chiarito che la sua intenzione non è rompere la Ue, ma \"riformare i trattati\". La nazionalista Marine Le Pen ha dichiarato che non vuole uscire dall'euro, ma costruire \"un'altra europa\". Ci verrebbe da chi...\n\nhttp://www.militant-blog.org/?p=15668\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 19 Jan 2019 08:49:41 +0000",
      "date_published": 1549042611
    },
    {
      "post_id": 119,
      "title": "Il Venezuela e i sinistri “critici-critici”",
      "body": "L’autoproclamazione di Guaidò rappresenta a tutti gli effetti un tentativo di colpo di Stato, ed è davvero difficile, se non impossibile, provare a descrivere diversamente quello che sta avvenendo in questi giorni in Venezuela. Un tentativo che fortunatamente, almeno per ora, non ha avuto gli svilup...\n\nhttp://www.militant-blog.org/?p=15671\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 29 Jan 2019 12:46:03 +0000",
      "date_published": 1549042611
    },
    {
      "post_id": 120,
      "title": "Visioni Militant(i): Il primo Re, di Matteo Rovere",
      "body": "E’ da tempo che al cinema l’incontro tra uomo e natura delude. Non staremo a ricordare la sequela hollywoodiana di promesse mancate: da un ventennio abbondante ogni qual volta si è provato a raccontare del rapporto tragico tra l’uomo e l’ambiente ostile, ci si è affacciati sulla soglia e ci si è rit...\n\nhttp://www.militant-blog.org/?p=15675\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sun, 03 Feb 2019 10:18:06 +0000",
      "date_published": 1549458080
    },
    {
      "post_id": 121,
      "title": "Presentazione del libro “Sovranismi” (gli audio)",
      "body": "Sabato scorso, di fronte a più di 50 persone, abbiamo presentato “Sovranismi”, il libro di Alessandro Somma edito de DeriveApprodi. Come ha ricordato Giacchè nel suo intervento il termine “sovranista” era per lo più sconosciuto ed inutilizzato nel dibattito pubblico fino a soli pochi mesi fa, oggi i...\n\nhttp://www.militant-blog.org/?p=15682\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 14 Feb 2019 09:05:36 +0000",
      "date_published": 1550149251
    },
    {
      "post_id": 122,
      "title": "Vertenza Penicillina: non si molla un centimetro.",
      "body": "L'ex fabbrica di penicillina romana, la LEO, era balzata recentemente agli onori della cronaca, ghiotta di occasioni di questo tipo, per via della presenza, al suo interno, di diverse centinaia di disperati che la occupavano (privi di qualsivoglia alternativa abitativa)  nonchè per lo sgombero in gra...\n\nhttp://www.militant-blog.org/?p=15692\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 07 Mar 2019 08:45:04 +0000",
      "date_published": 1552159349
    },
    {
      "post_id": 123,
      "title": "La voce del padrone",
      "body": "Mr tamburino non ho voglia di scherzare\n\nRimettiamoci la maglia i tempi stanno per cambiare\n\nA forza di concentrare tutta la critica politica su Renzi e il presunto “renzismo”, in perfetta continuità con Berlusconi e il “berlusconismo”, Craxi e il “craxismo” e via scivolando, eccoci servita la riesu...\n\nhttp://www.militant-blog.org/?p=15696\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 11 Mar 2019 08:32:01 +0000",
      "date_published": 1552309262
    },
    {
      "post_id": 124,
      "title": "Il Blocco Stradale NON può essere un reato. Stralciamo le multe!",
      "body": "In questi giorni 15 persone nella città di Roma sono state raggiunte da una sanzione amministrativa che le condanna a pagare un'ammenda di 2.600 euro a testa. Il motivo è aver partecipato ad una manifestazione nell’ agosto del 2015, svoltasi lungo le strade di San Lorenzo a seguito dello sgombero di...\n\nhttp://www.militant-blog.org/?p=15702\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 12 Mar 2019 13:33:14 +0000",
      "date_published": 1552397636
    },
    {
      "post_id": 125,
      "title": "Il Blocco Stradale NON può essere un reato. Stralciamo le multe! (and more)",
      "body": "In questi giorni 15 persone nella città di Roma sono state raggiunte da una sanzione amministrativa che le condanna a pagare un'ammenda di 2.600 euro a testa. Il motivo è aver partecipato ad una manifestazione nell’ agosto del 2015, svoltasi lungo le strade di San Lorenzo a seguito dello sgombero di...\n\nhttp://www.militant-blog.org/?p=15702\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 12 Mar 2019 13:33:14 +0000",
      "date_published": 1559044878
    },
    {
      "post_id": 126,
      "title": "Consigli (o sconsigli) per gli acquisti. Storia dell’immigrazione straniera in Italia.",
      "body": "Un libro da masticare con attenzione, rispettandone la complessità e l’articolazione. Riassunto in poche suggestioni, che non ne rendono merito del carattere esaustivo che offre e forse neanche della sua angolazione originale (rispetto all’approccio umanitario che solitamente ammanta la letteratura ...\n\nhttp://www.militant-blog.org/?p=15712\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 24 Apr 2019 08:31:45 +0000",
      "date_published": 1559044878
    },
    {
      "post_id": 127,
      "title": "L’egemonia irrazionale",
      "body": "Seguendo il filo dei ragionamenti che le destre esprimono nelle recenti vicende legate al trasferimento di famiglie rom nella periferia romana, si scopre una trama di contraddizioni da cui è davvero difficile tirarne fuori una logica. Perché una logica, in politica, è sempre rinvenibile, anche quand...\n\nhttp://www.militant-blog.org/?p=15716\n\n-- [](http://www.militant-blog.org/?feed=rss2) Sat, 11 May 2019 09:16:36 +0000",
      "date_published": 1559044878
    },
    {
      "post_id": 128,
      "title": "Passeggiate primaverili",
      "body": "Se escludiamo l'aver reinventato creativamente la forma corteo tramutandola in una passeggiata primaverile sui marciapiedi della stazione Termini e aver fatto respirare un po' di aria fresca - al posto della quotidiana puzza delle caserme - ad un consistente numero di caschi blu anche ieri, l'impres...\n\nhttp://www.militant-blog.org/?p=15720\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 14 May 2019 12:33:32 +0000",
      "date_published": 1559044878
    },
    {
      "post_id": 129,
      "title": "Le dure repliche della realtà",
      "body": "Si ribaltano i rapporti di forza, ma il quadro rimane pressoché identico allo scorso 4 marzo: il populismo viaggia attorno al 50% dei voti, mentre l’unica alternativa politico-elettorale ad esso continua ad essere rappresentata dalle forze liberali, Partito democratico in primis, minoritarie ma non ...\n\nhttp://www.militant-blog.org/?p=15726\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 27 May 2019 10:42:03 +0000",
      "date_published": 1559044878
    },
    {
      "post_id": 130,
      "title": "Di decoro urbano e controllo sociale",
      "body": "Pochi giorni fa l’assemblea capitolina ha approvato a larga maggioranza il nuovo regolamento di polizia urbana, norma fortemente richiesta e resasi necessaria dopo circa 70 anni dall’approvazione dell’ultimo regolamento di questo tipo nella Capitale. Un nuovo regolamento che interrompe la lunga stag...\n\nhttp://www.militant-blog.org/?p=15729\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 11 Jun 2019 11:23:31 +0000",
      "date_published": 1560255868
    },
    {
      "post_id": 131,
      "title": "Roma non si sgombera",
      "body": "La lista dei 24 spazi occupati considerati da questo governo come obiettivi da colpire è solo l’ultimo atto di una lunga serie di provvedimenti volti a dare un chiaro segnale di intolleranza nei confronti di una città che non si vuole piegare alla nuova china reazionaria, e che ha sempre rivendicato...\n\nhttp://www.militant-blog.org/?p=15736\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 21 Jun 2019 11:22:46 +0000",
      "date_published": 1561377678
    },
    {
      "post_id": 132,
      "title": "Consigli per gli acquisti. Attraverso questo mare di cemento. Immaginario, rudimenti pop e casi di forza maggiore",
      "body": "“Da più di tre lustri, lo Jacob agisce a casaccio. Seguendo un rigido piano quinquennale”\n\nL’abbiamo letto e riletto questo libro. E’ un testo che si presenta al limite dell’ambiguo, pericoloso, pieno di stonature. Ci sono forzature, approssimazioni, letture di pancia e istintive, ma più si legge e ...\n\nhttp://www.militant-blog.org/?p=15743\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 26 Jun 2019 09:28:43 +0000",
      "date_published": 1561551527
    },
    {
      "post_id": 133,
      "title": "Sgomberare Casapound? Anche no (and more)",
      "body": "Sono alcune settimane che una delle principali testate quotidiane di questo paese dedica una costante attenzione a un eventuale sgombero della sede nazionale di Casapound in via Napoleone III. E lo fa mostrando un evidente interessamento che è dettato certamente dagli ultimi fatti di cronaca romana ...\n\nhttp://www.militant-blog.org/?p=15751\n\n-- [](http://www.militant-blog.org/?feed=rss2) Wed, 03 Jul 2019 10:44:49 +0000",
      "date_published": 1568116875
    },
    {
      "post_id": 134,
      "title": "ZingAter. Fenomenologia di una presa per il culo",
      "body": "Non sono poi così lontani i tempi in cui il segretario del PD elargiva promesse tra le mani degli abitanti di Casal Bruciato, accorsi incuriositi dall'apertura in zona della sezione di un partito di cui prima lì si era solo sentito parlare attraverso i media o i racconti di coloro che si erano spint...\n\nhttp://www.militant-blog.org/?p=15758\n\n-- [](http://www.militant-blog.org/?feed=rss2) Fri, 05 Jul 2019 09:25:03 +0000",
      "date_published": 1568116875
    },
    {
      "post_id": 135,
      "title": "Nomen omen",
      "body": "Se disgraziatamente non è possibile riassumere le decisioni strategiche di un complesso sistema di alleanze come quello Nato nella figura del suo portavoce Jens Stoltemberg, la tentazione di rilevare il “valore augurale” del suo nome rimane certamente forte quando si apprendono notizie del calibro d...\n\nhttp://www.militant-blog.org/?p=15769\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 05 Aug 2019 08:01:34 +0000",
      "date_published": 1568116875
    },
    {
      "post_id": 136,
      "title": "Tra Salvini e Open society: il futuro dell’anticapitalismo nell’inverno della sinistra",
      "body": "Unione europea, questione nazionale e migranti hanno scavato l’ennesimo solco nella sinistra radicale. Eppure questo decennio di contrapposizione (esclusivamente)  intellettuale lascia dietro di sé macerie su cui costruire ben poco. Non saremo forse di fronte a false flags su cui ci accaniamo in asse...\n\nhttp://www.militant-blog.org/?p=15783\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 02 Sep 2019 07:36:32 +0000",
      "date_published": 1568116875
    },
    {
      "post_id": 137,
      "title": "Le privatizzazioni in Italia. Il buio oltre la siepe",
      "body": "Quotidiano “la Repubblica”, inserto Affari&Finanza, 5 agosto 2019, un lunedì. L’approfondimento firmato da Luca Pagni spiega come tra le prima quaranta aziende quotate presso la Borsa di Milano (listino Ftse Mib, quello più rilevante)  un buon 40%, a livello di valore della capitalizzazione, apparten...\n\nhttp://www.militant-blog.org/?p=15787\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 09 Sep 2019 11:05:37 +0000",
      "date_published": 1568116875
    },
    {
      "post_id": 138,
      "title": "La “generazione Greta” e l’antropocene: alcune riflessioni",
      "body": "Come molti già sapranno il prossimo 23 settembre nel palazzo di vetro dell’ONU si celebrerà il Climate Action Summit. Il vertice, convocato dal segretario generale Antònio Guterres, chiude idealmente un anno che ha visto ritornare prepotentemente la questione del cambiamento climatico al centro del ...\n\nhttp://www.militant-blog.org/?p=15796\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 16 Sep 2019 12:27:58 +0000",
      "date_published": 1568721676
    },
    {
      "post_id": 139,
      "title": "L’impossibile cambiamento",
      "body": "Quando nel giugno 2016 Il Movimento Grillino riuscì a conquistare il Campidoglio con Virginia Raggi, grazie al massiccio consenso registrato nelle periferie della città, si pensò, con molti se, che la debacle del Pd e di quel sistema di potere pervasivo che aveva governato per alcuni decenni, si fos...\n\nhttp://www.militant-blog.org/?p=15806\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 24 Sep 2019 09:17:59 +0000",
      "date_published": 1569326486
    },
    {
      "post_id": 140,
      "title": "Quante opposizioni può reggere un quadro politico?",
      "body": "Con l’avvio del governo giallo-merda il monopolio dell’opposizione è passato de facto all’ex compare di governo Salvini. Più in generale, il “sovranismo” si è imposto quale unica opposizione possibile, dopo essere stato per quattordici mesi il collante valoriale del contratto giallo-verde. En passan...\n\nhttp://www.militant-blog.org/?p=15802\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 30 Sep 2019 08:16:14 +0000",
      "date_published": 1570194273
    },
    {
      "post_id": 141,
      "title": "Lezioni venezuelane",
      "body": "«Vi abbiamo messo in guardia contro la retorica umanitaria degli stati capitalisti che si dichiarano pronti a venire in soccorso della Russia sovietica affamata». Così si avviava il primo numero della “Correspondance Internationale” nel lontano 1921, quando gli immediati tentativi messi in atto dall...\n\nhttp://www.militant-blog.org/?p=15816\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 07 Oct 2019 11:31:48 +0000",
      "date_published": 1570536054
    },
    {
      "post_id": 142,
      "title": "Mrs. Brexit, I suppose",
      "body": "Salviamo il compagno Boris! Massima solidarietà, nonostante le evidenti differenze politiche, al bizzarro Johnson, che si trova impossibilitato a dar seguito al preciso mandato popolare: l’uscita del Regno Unito dall’Unione Europea. È difficile rintracciare, volgendo gli occhi al passato, una simile...\n\nhttp://www.militant-blog.org/?p=15820\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 14 Oct 2019 10:11:18 +0000",
      "date_published": 1571054453
    },
    {
      "post_id": 143,
      "title": "Gramsci oggi",
      "body": "Ci apprestiamo ad iniziare un ciclo di seminari sul pensiero di Gramsci, ad indagare sul suo contributo dato al movimento comunista nel lungo secolo breve.\n\nPerché Gramsci oggi?\n\nDi incontri seminariali in questi anni ne sono stati fatti tanti, esiste anche una vasta comunità di studiosi e militanti...\n\nhttp://www.militant-blog.org/?p=15827\n\n-- [](http://www.militant-blog.org/?feed=rss2) Thu, 24 Oct 2019 08:17:53 +0000",
      "date_published": 1571918454
    },
    {
      "post_id": 144,
      "title": "Oltre l’illusione della green economy. Alcune riflessioni.",
      "body": "“E’ più facile immaginare la fine del mondo che la fine del capitalismo” (Fredric Jameson) \n\nPrima (ovvia)  premessa Interrogato su quali leggi scientifiche avrebbero superato indenni il test del tempo senza essere rigettate o radicalmente riformulate dalle future generazioni di scienziati, Albert Ein...\n\nhttp://www.militant-blog.org/?p=15834\n\n-- [](http://www.militant-blog.org/?feed=rss2) Tue, 29 Oct 2019 12:17:47 +0000",
      "date_published": 1572354065
    },
    {
      "post_id": 145,
      "title": "La sinistra dello zero percento",
      "body": "Le elezioni umbre costituiscono certamente un fatto locale: irrilevante il numero di elettori coinvolti (700mila, di cui votanti circa 400mila: poco più degli abitanti di Cinecittà)  per trarne indicazioni generali. Si conferma Salvini, e da una settimana è tutto un dire che “lo sapevamo”, “era scont...\n\nhttp://www.militant-blog.org/?p=15844\n\n-- [](http://www.militant-blog.org/?feed=rss2) Mon, 04 Nov 2019 08:47:24 +0000",
      "date_published": 1572872542
    }
  ],
  "title": "Militant"
}