{
	"next_comment_id": 21,
	"comment": [
		{
			"comment_id": 1,
			"body": "I think it's important to mention tor in such instructions. Specifically, it seems that to spread the content over both \"0net-clear\" and \"0net-tor\" you need at least one \"bridging\" node that will serve your content to both networks unless you're bridging it yourself by other means (such as ssh onto VPS or even copying physically onto another computer).\nAlso, the one thing i still couldn't find answer to is how hard is it to configure public proxies to seed over tor.",
			"post_id": 70,
			"date_added": 1519465004
		},
		{
			"comment_id": 2,
			"body": ">I guess that is not necessary, I don't use tor but from the \"0\" config panel and /path/to/zeronet/data/content.db I still have a lot connection with tor and onion addresses.\n\nHmm, maybe if you have port open tor users can connect to you?.. That would mean that in theory it's enough for one user to have port open? But they'd still need to get it via tor or something.\n\nI wonder if there's a way to force a connection from tor user to open-port user. That might help. Also would be nice to be able to prioritize low peer site seeding.",
			"post_id": 70,
			"date_added": 1519475913
		},
		{
			"comment_id": 3,
			"body": ">For tor it may be a different question: If I'm using tor and my port is closed, can I still easily publish zite to other tor peer, just like my port is still opened in the tor network?\n\nAs far as i understand it, in tor-only mode port doesn't matter/is closed. Anyway, i'm able to publish zites to some other users, though i don't know whether the connection is possible because they use tor or have open port or it depends on more random things.\n\n>As mentioned in my article, using ssh works in this way.\n\nSsh would work when remote is configured for it. My idea was to force connection to a peer via 0net. This would help iff connection can only be established in one direction, but otherwise works fine.",
			"post_id": 70,
			"date_added": 1519484130
		},
		{
			"comment_id": 4,
			"body": "Many \"display\" commands can be easily implemented and wouldn't require running 0net instance or using extra api as they would consist of some formatting of sql requests. I'll probably get to implementing some of that if nobody makes it first, since sometimes running browser just to check updates isn't the best option.\n\nAlso, though not exactly an one-off shell script, there's https://github.com/imachug/ThunderProxy for ThunderWave <-> irc bridge (haven't tried it though).",
			"post_id": 77,
			"date_added": 1519984634
		},
		{
			"comment_id": 5,
			"body": ">Yes as ZeroNet server is also on your computer, so you just send your Canvas fingerprint to yourself\n\nMalicious zites can write that information into user space in a non-obvious way, so it's not entirely safe if you care about privacy and don't check source code and user data of all zites you use.",
			"post_id": 56,
			"date_added": 1520511763
		},
		{
			"comment_id": 6,
			"body": "While i was setting this up (on [my engine test page](/18JXMUqeg6u1nZXi1rYTsiUpBuzTnyi9yc/)), at some point i got everything working, except actual message displaying (posting worked). For some reason they turned on (immediately!) after i clicked on \"save site settings\" in right panel (even though reload/build db and signing didn't help). Thought this might be useful for somebody.",
			"post_id": 35,
			"date_added": 1522775241
		},
		{
			"comment_id": 8,
			"body": "> [binchan2](#comment_61_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): Oops.. Looks like there is a bug in ZeroBlog that will secretly auto-sign the blog and publish it..\n\nThat's why i generally don't trust web sites and copy-paste from text editor for any considerable text input ;)\n\n>Now my messy ZeroNotes looks a bit less boring, if you agree X)\n\nWell, the design certainly looks more *interesting*, but i'm not sure it's overally better. Even ignoring the unmatching chatbox, it looks as if it misses something now. Perhaps non-solid background implies some kind of borders? Although i suppose it might look just fine on small screens.",
			"post_id": 83,
			"date_added": 1524437062
		},
		{
			"comment_id": 9,
			"body": "> [binchan2](#comment_62_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h):\n> Thx for your opinion! Likely a background image won't help reader focus on the content, too, I change the background of right panel to a simple color. Does it look better esp. for large screen now?\n\nYeah. However, i think i liked the middle version better (it looked especially cool with the menu fade feature). Although i'm getting used to the latest one as well.\n\nMinor nitpick: the border between solid color and bg image can look a bit annoying depending on resolution & screen width. The neighbouring line of pseudo-pixels is perceived as a border and its irregular pattern makes it look messy.",
			"post_id": 83,
			"date_added": 1524440878
		},
		{
			"comment_id": 10,
			"body": "> [binchan2](#comment_64_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): I forgot to change the background of comment region to a contiguous color, now the border between the solid color and bg image is almost indistinguible :3\n\nThat might be the reason why it makes me frown on it. There is a common principle that it might be unnerving when two things are extremely similar, but still different. No idea how it's called in design, but in visual art it is sometimes referred to as \"uncanny valley\". It's also the reason why very close tones can be unpleasant. And there's a similar principle in evolution, i think, even though there's no perceiving agent.\n\n> Hmm, maybe removing the border between pseudo-pixels will be better, will try it later because it needs to change the base64 code. For me irregular pattern is ok, imo that's why it looks interesting\n\nIrregular pattern is ok as long as it's not too prominent. When i perceive it as 2D pattern, it's ok. Maybe just a bit too noticeable on fast scrolling. But when i perceive a line of it as an isolated 1D pattern, it is somewhat (degree depends on which pattern line happens to be neighbouring) unpleasant. If textual description is not good enough, i can make simplistic illustration tomorrow.",
			"post_id": 83,
			"date_added": 1524443846
		},
		{
			"comment_id": 11,
			"body": "> [binchan2](#comment_66_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): Nope, Firefox is definitely open-source, but Stylish add-on (>2) is not opensource.\n\nWow. It's kinda weird and actually sounds like GPL violation.",
			"post_id": 3,
			"date_added": 1524500640
		},
		{
			"comment_id": 12,
			"body": "> [binchan2](#comment_65_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): Hey! I've created my own base64 image, using a perfect single pentagon tiling pattern and transparent background, and it has optical illusion effect as the background color is mono but left panel and right panel look like in different color! How is it for you? :D\n\nInteresting. Well, it's the basis of color mixing in action ;) Or did you mean that the rightest (not the middle one with text content) panel looks like it has different color?\n\nCurrent pentagon tiling still has a bit of that \"rough lines\" effect, due to moire pattern effect (about the same reason why fonts are usually antialiased). I'm not sure it's actually completely fixable in a way that wouldn't break on some setups, though.\n\n> \"uncanny valley\" is a pretty interesting effect, but I guess it's more about humanoid vs human, AI vs human intelligence, and can't fit the situation you're viewing my previous UI design. Tone as comparison (analogy) doesn't fit this situation, too, imo. As sound and image are totally two different things.\n\nWell, \"uncanny valley\" is perhaps a too specific term. Sadly i can't recall any more generic term that would encompass all kinds of perception. Perhaps i should make a more detailed article about it to explain how such a stretched comparison can make sense..\n\n> For me fast scrolling is ok, because it's square and the color between different pixel is very similar. I think the effect should be similar to rotating fan, the color will mix together and looks the same, but it may differ between individuals.\n\nFan effect would work with appropriate speed if scrolling would have the same step as rectangle size, i guess. Although i'm not sure common screen update delay would be small enough for complete melting.\n\nPS: woah, i'm already running out of 10K for comments here :D",
			"post_id": 83,
			"date_added": 1524501808
		},
		{
			"comment_id": 13,
			"body": "> [binchan2](#comment_67_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): The new version is a total rewrite and the code probably has nothing to do with the old version, so maybe there is not GPL violation. They just happen to have the same name, and the new author also becomes the maintainer of userstyles.org..\n\nHmm, i'm not sure a licence line on firefox addons page counts as proper licence statement.. but it still makes them petty liars.",
			"post_id": 3,
			"date_added": 1524568020
		},
		{
			"comment_id": 14,
			"body": "Sorry for the late reply. I finally got to carefully inspecting the pattern on zoom and without. It actually betrayed some of my expectations..\n\n>Yep, even a reader don't scroll the screen, s/he may feel the left panel is in different color, even every small cell in left panel looks a bit darker that the right panel bg color~\n\nInteresting, i have the opposite impression that the panel on the right is a bit darker than the left (and of course both are darker than the center, but that's not an \"illusion\" per se).\n\n>So from you computer the lines look rough? Do you use a 4K screen? The ppi of a screen may be the cause.. I only have a 1920x1080 monitor and the lines look fine for me.\n\nWell, if it's a monitor problem, it's my matte (non-glossy) 1366x768 screen that's to blame i guess ;)\n\n***\n\nAnyhow, what i noticed on zooming in closely is that the pattern repetition size is in fact quite small (it can be seen easily by applying flood fill on the center panel of site screenshot..). Then i removed all the text from the page and tried scrolling so that i won't see anything but (possibly) background pattern change and.. it didn't really change!\n\nIn the end, no matter how hard i tried, i couldn't notice any significant difference on the vertical \"separator\" line when there were no other content to scroll with it. But as soon as i was allowing the content back, the perceived \"roughness\" was reliably getting back (even though i have to stress it that it is not something easily noticed).\n\nAt the end of the day my hypothesis would be that my screen has some kind of \"horizontal lines\" (might even be due to the humdrum fact that i view bottom of the screen at the different angle than the top) that are mostly invisible when observing solid colour with trained eye and aren't really visible even on non-solid images until i start scrolling or looking *very careful* (and since looking careful applies to a small portion of the screen, it misses the overall effect). Then, if my brain considers it feasible that the distortions are due to the pattern scrolling, it blames that, and if it can't (either because there's no content or no pattern to scroll), it has to accept the failing of the display/view angle/etc.",
			"post_id": 83,
			"date_added": 1524958015
		},
		{
			"comment_id": 15,
			"body": "> [binchan2](#comment_70_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h):\n> About the center, do you mean the panel of content, or the border?\n\nContent panel.\n\n> Afterimage\n\nHeh, the video there is kinda \"hilarious\".\n\n> Anyway, it's bad for eyes to watch the LED screen for too long time ;)\n\nYeah, i'm always wondering at how can people work on their overly-bright screens. Although i myself spend way too much time staring at screen. Adopting some kind of sound interface might be a good idea. E-ink also sounds good, but last time i checked (few years ago, heh) it could usually be found in devices with severe hardware or software limitations.",
			"post_id": 83,
			"date_added": 1525215147
		},
		{
			"comment_id": 16,
			"body": "> [binchan2](#comment_71_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): Hmm, imo ZeroBlog has only two panels, so \"right panel\" == \"content panel\" when I was saying \"s/he may feel the left panel is in different color, even every small cell in left panel looks a bit darker that the right panel bg color~\".\n\nHmm, not sure if it looks darker for me. More like it feels like having a slightly different hue, i guess.\n",
			"post_id": 83,
			"date_added": 1525786218
		},
		{
			"comment_id": 17,
			"body": "I mostly half-lie/half-sit with my laptop these days. I'm getting tired of just sitting pretty quick and can't commit to a proper posture anyway..\n\nAs for the title, i should add that coding is also harmful for your mental health ;)",
			"post_id": 91,
			"date_added": 1534701305
		},
		{
			"comment_id": 18,
			"body": "> \"Learn You a Haskell for Great Good\" :3\n\nThat's what i did, but then ended up being frustrated with Haskell. I'm learning category and homotopy type theories right now. And even not considering Haskell's shortcomings, learning it still can make you frustrated that most people didn't and continue to code awfully.",
			"post_id": 91,
			"date_added": 1534785909
		},
		{
			"comment_id": 19,
			"body": "By the way, in the newer firefox you don't have to use workaround with popup as you can straight away set \"extract canvas data\" permission in \"More Information\" window.",
			"post_id": 56,
			"date_added": 1541026305
		},
		{
			"comment_id": 20,
			"body": "> [leftside](#comment_3_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Issue: I cloned ur blog, and found out that the attached image files don't go away even though its parent post is deleted. Missing image files are floating around in ./data/img/ directory. Do u have any plan to deal with this issue??\n\nYou can just remove the images and re-sign site, i suppose.",
			"post_id": 91,
			"date_added": 1543946308
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"zm_message": [
		{
			"body": "well, displaying timestamps on mouse hover would be a reasonable compromise i think",
			"date_added": 1516758690500
		},
		{
			"body": "unless you don't want to store it at all (if that's even possible)",
			"date_added": 1516758710100
		},
		{
			"body": "leftside: it's on mouse hover ;)",
			"date_added": 1543946230100
		}
	],
	"post_vote": {
		"35": 1,
		"56": 1,
		"59": 1,
		"70": 1,
		"77": 1,
		"80": 1,
		"83": 1,
		"93": 1,
		"101": 1
	}
}