{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r": [
			{
				"comment_id": 1,
				"body": "Нашел сайт, где отображается ip пользователя - http://127.0.0.1:43110/1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHe\nОн показывает мой реальный ip, хотя статус TOR пишет OK. Как это понимать? \nИли это просто мой браузер мне показывает через javascript, а владельцу он не доступен? Не очень в этом разбираюсь.\nКогда нажимаешь на статус TOR есть еще вариант \"Enable tor for every connection (slower)\", но когда пытаюсь на него нажать - выдает \"This function is disabled on this proxy\". Что эта функция должна делать?",
				"added": 1457256924
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 2,
				"body": "> [kostanew](#comment_1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Запустил первый раз, не могу понять, а почему ни на одном форуме или сайте нет нормальных разделов?\n\nНасколько я понял пока нельзя создавать сайтов типа reddit, чтобы можно было выбирать разделы, на которые подписываешься, но это в приоритете у разработчиков.",
				"added": 1457258701
			},
			{
				"comment_id": 3,
				"body": "> [vlad20012](#comment_4_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): \nТы меня опередил, уже начал писать ответ про совместимость) \nДа, если бы разработчик(и?) zeronet добавили встроенную поддержку торрентов - было бы идеально. Это можно как-то сделать через плагины?",
				"added": 1457273965
			},
			{
				"comment_id": 4,
				"body": "> [splitfire](#comment_31_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f):\n> плагины в браузеры - зло по многим причинам\n\nИмелся в виду плагин для Zeronet, который можно сделать не дожидаясь разработчика и не форкая Zeronet.",
				"added": 1457277167
			},
			{
				"comment_id": 6,
				"body": "Как-то странно, что создатель сайта может удалить кеш у всех посетителей. Это точно? Предлагаю провести эксперимент.",
				"added": 1457283421
			},
			{
				"comment_id": 9,
				"body": "> [killenstein](#comment_3_1NMerKYwUayNpEZ35FxkzZch6kgoeFTWk): я оттуда уже, что ещё можете посоветовать, создать сайт с котиками?\n\nНам повезло присутствовать при зарождении сети. Всплеск популярности произошел буквально на днях. Пока тут не так много всего, люди обживаются. Так же ждем обещанной разработчиками возможности делать многопользовательские сайты - аналоги соцсетей/реддитов и т.д. Котиков и в интернете полно, предлагаю подумать о том, чтобы принести сюда какой-то более эксклюзивный контент (я не имею в виду радикально противозаконный), которым можно привлечь еще больше людей. У меня например уже появилась идея. Вы тоже можете что нибудь придумать. Не ждите, пока вам принесут контент, лучше присоединяйтесь к строительству сети.",
				"added": 1457288441
			},
			{
				"comment_id": 10,
				"body": "> [leinariys](#comment_21_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Что с поиском не могу добавить свой сайт?\n\nZerosearch.bit ? Там написано, что они вручную добавляют, в течение нескольких часов.",
				"added": 1457293353
			},
			{
				"comment_id": 11,
				"body": "> [leinariys](#comment_23_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): оу, тоесть мне выдаёт ошибку не верный приватный ключь, всё норм?\n\nЯ сам не добавлял пока, не знаю. Но вообще не похоже. Почему вообще у вас просят приватный ключ, он же на то и приватный, чтобы его никто не знал кроме вас?",
				"added": 1457294647
			},
			{
				"comment_id": 12,
				"body": "> [nippletwister](#comment_273_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): \nС деньгами - имхо утопия. Не знаю ни одного сайта в обычном интернете, где платят за сообщения.\nХотя не, на tjournal вроде нельзя писать и читать комменты без платного доступа, но в любом случае - надо сначала иметь очень популярный сайт, чтобы потом что-то вводить. Да и вообще, по моему это противоречит самой идее свободного интернета.",
				"added": 1457295003
			}
		],
		"6_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 5,
				"body": "Нашел такую информацию про режим multiuser (тут - http://127.0.0.1:43110/1NQSaE4rV83oeDVzDVryMNFSCqwz2gAaB4):\nIMPORTANT: You must change Multiuser back to disabled-Multiuser or you will encounter errors regarding cloning and deleting sites. You will get the following error: This function is disabled on this proxy\n\nДействительно, у меня выводит такую ошибку при удалении (правда вроде все равно удаляет) и при попытке установить TOR в режим \"enable tor for every connection (slower)\".\nНеплохо бы упомянуть об этом в FAQ, а лучше - еще и в bugtracker (я пока еще не разобрался, не знаю где он).",
				"added": 1457282528
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 7,
				"body": "> [zoar](#comment_3_1MxTzBwz6piYDJHHG2TkUZTGqiy2ZUrwNo): Может, перескажешь, что там было? Рутракер опять лежит.\n\nА я думал, что тред удалили, а потом вспомнил, что это заглушка провайдера выдает ошибку.",
				"added": 1457287484
			},
			{
				"comment_id": 8,
				"body": "Если что, копипасчу оттуда: \nВ связи с новым антипиратским законом озаботился я созданием нового проекта \"Схоронил!\".\nПо сути это мультитреккер:\n\nhttp://sbztjqu4pziqaayilol2j77cpgrs63k7cs4cg5vejo5pfrhwvxsa.b32.i2p/ (пока не работает)\nhttp://jtm5j25w7fq5tubs.onion/ (работает)\n\nКонцепция проекта - \"сохраним магнет-ссылки до того как их успеют заблокировать правообладатели\". Единственное правило - никакого CP. Проект полностью некоммерческий, никакой рекламы/монетизации не планируется.\n\nРаз в 15 минут с нескольких известных треккеров cливаются новые раздачи (описания и магнеты). Все это складывается в базу, к ней прикручен поиск.\n\nСвои раздачи добавлять нельзя (а смысл если можно раздачи с торрентов автоматом брать, к тому-же есть проблема с необходимостью модерирования для предотвращения фейков). Комментировать раздачи тоже пока низя (посмотрим, мож добавлю). Поиск по названию раздач вроде как работает нормально.\nзаблокировать не могут\nпо IP выйти на датацентр и прислать абузу хостеру не могут\nпо домену вычислить владельца и подать в суд не могут\nСтавим Tor или (для ленивых) - Пиратский Браузер и открываем http://jtm5j25w7fq5tubs.onion/\nОбратите внимание - можно перейти на описание раздачи прямо по хэшу: http://jtm5j25w7fq5tubs.onion/t.php?h=3d7b862d3ca91...6cf84ef87b9eb1b9 или зная ее \"исторический\" ID http://jtm5j25w7fq5tubs.onion/a.php?key=bigfangroup:281501",
				"added": 1457287577
			}
		]
	},
	"comment_vote": {
		"4_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1
	}
}