{
	"next_comment_id": 54,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [nippletwister](#comment_1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Тут есть блог некой Екатерины http://127.0.0.1:43110/1Kp5xdjQyrPth5mEJsn6NDBKZxcaeYz86Nона тоже свой сайт пилила - ZeroQuotes: http://127.0.0.1:43110/1NJyPoPpL8At17T6G7A1qHVQdqZDBmXcLTМожет, быть она даже по-русски понимает, имя вроде намекает.\n\nПолезненько, спасибо",
			"post_id": 2,
			"date_added": 1455265594
		},
		{
			"comment_id": 2,
			"body": "> [shift](#comment_1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Полезно, на хабр бы вытащить это, не хочешь?\n\nПока рано, будет небольшой цикл статей тут, потом соберу в кучку и можно наверное и на хабр идти.",
			"post_id": 3,
			"date_added": 1455270607
		},
		{
			"comment_id": 3,
			"body": "Чего-то честно говоря, я запарился сегодня статью писать :)",
			"post_id": 4,
			"date_added": 1455281839
		},
		{
			"comment_id": 4,
			"body": "> [nippletwister](#comment_2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Кстати, уже запилиkb зеркало ZeroNet Docs: http://127.0.0.1:43110/17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe/\n> Можно ссылаться сразу туда.\n\nДа, я в целом видел, почему не сослался - не знаю :)",
			"post_id": 4,
			"date_added": 1455283017
		},
		{
			"comment_id": 5,
			"body": "Ссылка на поиграться работает?",
			"post_id": 4,
			"date_added": 1455283046
		},
		{
			"comment_id": 6,
			"body": "> [shift](#comment_6_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): \n\nбеда :( Может потому что я не могу открыть порт? У нас в Беларуси суровый нат без поддержки upnp",
			"post_id": 4,
			"date_added": 1455283139
		},
		{
			"comment_id": 7,
			"body": "> [shift](#comment_7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): вполне вероятно, а внешних IP у вас нет?\n\nНа работе мне точно его не увидеть, дома за отдельную плату.\n\nЗ.Ы. Всем мегабайт текста на моем блоге!",
			"post_id": 4,
			"date_added": 1455283333
		},
		{
			"comment_id": 8,
			"body": "Если вдруг откроется, скажите, просит ли оно больше квот? А то у меня просило, но у меня сначала вся внутрянка попала, которая не должна раздаваться.",
			"post_id": 4,
			"date_added": 1455283472
		},
		{
			"comment_id": 9,
			"body": "> [shift](#comment_10_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А теперь:\n> СONTENT.JSON DOWNLOAD FAILED\n> PEERS FOUND: 1\n> Так, что копай в сторону кривой подписи\n\nеще раз",
			"post_id": 4,
			"date_added": 1455283851
		},
		{
			"comment_id": 10,
			"body": "И еще раз?",
			"post_id": 4,
			"date_added": 1455284048
		},
		{
			"comment_id": 11,
			"body": "Напомните сайт прокси то",
			"post_id": 4,
			"date_added": 1455284120
		},
		{
			"comment_id": 12,
			"body": "хм... Действительно что-то беда с вытягиванием",
			"post_id": 4,
			"date_added": 1455284249
		},
		{
			"comment_id": 13,
			"body": "> [shift](#comment_12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Ну я бы тебе рекомендовал взять себе сервер (например с digital ocean) сможешь сайты как человек разливать ну и VPN который полезен и у вас и у нас\n\nЗаймусь этим в ближайшем будущем.",
			"post_id": 4,
			"date_added": 1455284758
		},
		{
			"comment_id": 14,
			"body": "Заработало!",
			"post_id": 4,
			"date_added": 1455284904
		},
		{
			"comment_id": 15,
			"body": "> [shift](#comment_13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): если будешь на DO делать (сервак с SSD от 5$) то черкани в местную почту - дам реферальную ссылку там и тебе и мне что-то около 10$ приедет\n\nУ меня уже есть сервак на DO",
			"post_id": 4,
			"date_added": 1455284912
		},
		{
			"comment_id": 16,
			"body": "> [sthetz](#comment_2_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9): Отличная статья. Как раз только что дописал свой движок борды с нуля на ES6 по твоему совету, использовал Babel.\n\nКак же я рад, что кому-то это пригодилось. :)",
			"post_id": 5,
			"date_added": 1455516101
		},
		{
			"comment_id": 25,
			"body": "> [nippletwister](#comment_7_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Работает?\n\nда",
			"post_id": 7,
			"date_added": 1455615077
		},
		{
			"comment_id": 26,
			"body": "> [wrewolf](#comment_2_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Мне как человеку увидевшему такой js в первый раз, не хватает мануала по сборке проекта сразу в продакшен папку, что бы руками все не копировать (ну или даже написать необходимое скриптом, все равно криво)\n\nZeroNet специфику опишу в следующей статье. На текущий момент вас интересует только index.html и директория js. В целом zeronet позволяет добавлять исключения, какие файлы не должны участвовать в раздаче. Можно и банальным скриптом решить проблему, который запустит\n\n```bash\n./node_modules/.bin/webpack -p\ncp index.html js <path to zeronet site> -R\n```",
			"post_id": 7,
			"date_added": 1455622768
		},
		{
			"comment_id": 27,
			"body": "> [wrewolf](#comment_2_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Мне как человеку увидевшему такой js в первый раз, не хватает мануала по сборке проекта сразу в продакшен папку, что бы руками все не копировать (ну или даже написать необходимое скриптом, все равно криво)\n\nВ целом тут ситуация такая, как и с компилированными языками. У вас есть сорцы и либы, которые потом превращаются в ~~бинарники~~ обфусцированный код, который у нужно доставить клиенту.",
			"post_id": 7,
			"date_added": 1455622965
		},
		{
			"comment_id": 28,
			"body": "> [wrewolf](#comment_3_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): ну в случае со сборкой обычно это делается в соседнем каталоге и получается разделение бинарников и исходников\n\nОбычно это делается автоматически по коммиту :)",
			"post_id": 7,
			"date_added": 1455623216
		},
		{
			"comment_id": 29,
			"body": "> [wrewolf](#comment_3_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): ну в случае со сборкой обычно это делается в соседнем каталоге и получается разделение бинарников и исходников\n\nВебпак полностью настраивается. Там можно указать, откуда брать и куда ложить. Прочитай первую часть еще раз, попробуй сделать как тебе удобнее, расскажи мне, может мне так больше понравится",
			"post_id": 7,
			"date_added": 1455623313
		},
		{
			"comment_id": 30,
			"body": "> [wrewolf](#comment_3_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): ну в случае со сборкой обычно это делается в соседнем каталоге и получается разделение бинарников и исходников\n\nНу и конечно же спрашивай, я помогу",
			"post_id": 7,
			"date_added": 1455623514
		},
		{
			"comment_id": 31,
			"body": "> [wrewolf](#comment_4_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): то есть можно собирать в \"соседний\" каталог\n\nНу да. Видится мне это как-то так\n```text\n+-src\n|---index.js\n|---App.vue\n|---+components\n|---|---Button.vue\n+-build\n|---index.html\n|-webpack.config.json\n```\n\nНу или что-то в этом духе. Не знаю, как тебе удобнее будет",
			"post_id": 7,
			"date_added": 1455624939
		},
		{
			"comment_id": 32,
			"body": "Надеюсь достаточно наглядно",
			"post_id": 7,
			"date_added": 1455625119
		},
		{
			"comment_id": 33,
			"body": "Только учти, что index.html никак никем не обрабатывается, т.е. он должен быть сразу на нужном месте или какой-то отдельный скрипт, который его туда скопирует. Еще можно посмотреть в сторону таких сборщиков как gulp, но это уже как по мне как-то перебор, иметь две билд системы в одном проекте. Вероятно для этого также придумали какой-то специальный лоадер для вебпака или еще чего...",
			"post_id": 7,
			"date_added": 1455625198
		},
		{
			"comment_id": 34,
			"body": "> [wrewolf](#comment_5_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): типа того, а еще вариант с гит, папка то исключена и в продакшене просто не делать npm install, а js css уже собранны\n\nНу опять же, это этап сборки, а не работы в продакшене. Типа сначала происходит процесс сборки, где и будет `npm install; webpack -p` пакуется это все в какой-то пакет (да хоть зип) и этот пакет уже выливается в продакшен и раскладывается в те места, где их ждет тот же nginx",
			"post_id": 7,
			"date_added": 1455625325
		},
		{
			"comment_id": 35,
			"body": "В общем случае как-то так",
			"post_id": 7,
			"date_added": 1455625341
		},
		{
			"comment_id": 36,
			"body": "> [wrewolf](#comment_7_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): ну вот как раз я и имею в виду упрощение выкладки. т.е. грубо webpack -wd отладка. а git pre-commit script webpack -p, тогда преобразует и положит в коммит продакшен версию\n\nМожно конечно и так, я просто считаю, что держать автоматически с генерированные файлы в VCS несколько не правильно и все. Мои личные предрассудки. Но вижу, что мысль ты уловил.",
			"post_id": 7,
			"date_added": 1455625793
		},
		{
			"comment_id": 37,
			"body": "> [wrewolf](#comment_7_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): ну вот как раз я и имею в виду упрощение выкладки. т.е. грубо webpack -wd отладка. а git pre-commit script webpack -p, тогда преобразует и положит в коммит продакшен версию\n\nИз опыта говорю. Когда работает много людей над проектом, тебе просто надоедает резолвить эти файлы как конфликты. Да, там всего то достаточно сгенерить по новой и добавить их в коммит, но даже это надоедает после n-го раза",
			"post_id": 7,
			"date_added": 1455625880
		},
		{
			"comment_id": 38,
			"body": "> [wrewolf](#comment_8_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): да, ты прав. это скорее в after pull скрипт класть, генерацию верных ассетов.до этого я только с самописными движками на пхп работал, там все ассерты были в виде отдельных файлов, максимум минификатор стоял, который сам при запросе определял есть ли собранная копия и если нужно собирал ее.\n\nНу вот и разобрались. Замечательно как.\n\nВ целом хочу сказать, что сейчас все тулы для фронтенда \"находятся\" в node.js, его чураться в современном девелопменте - значит быть слепым. Так что вот.",
			"post_id": 7,
			"date_added": 1455628299
		},
		{
			"comment_id": 39,
			"body": "> [zimm](#comment_1_17egpCNfmkMnmauEdTVXo4DfMFpdpHqt5B): Тоже на днях вот открыл для себя сие чудо и тут же наткнулся на твой блог, будем изучать :)\n\nЯ тут как-то в последнее время публикаций не делаю, ибо занялся переписыванием ZeroTalk под нужды русского сообщества :) Но как закончу, обязательно наверстаю упущенное. Да и к разработке можно присоедениться, хотя у меня там только немного интерфейса есть.",
			"post_id": 3,
			"date_added": 1457289551
		},
		{
			"comment_id": 40,
			"body": "> [leinariys](#comment_1_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Норм статья)\n\nПожалуйста :)",
			"post_id": 5,
			"date_added": 1457290953
		},
		{
			"comment_id": 41,
			"body": "> [nippletwister](#comment_8_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Советую обратить внимание на соц.сеть Steemit.com. Вот бы их сайтик сюда перенести. Точнее не их сайтик, а сделать свой сайтик, который бы новости черпал сразу из блокчейна без всякой цензуры)\n\nНо тут же такое, нужно какое-то ПО писать, которое автоматом что-то ищет в интернете\\блокчейне\\что-угодно и потом собирает статический сайт, подписывает и публикует",
			"post_id": 9,
			"date_added": 1469889848
		},
		{
			"comment_id": 42,
			"body": "Давайте, ребятушки, подтягивайтесь назад. ZeroNet (ИМХО) очень крутой, по сравнению со многими другими (хотя и вероятно таит в себе больше уязвимостей). Не хочу, чтобы вот это вот все потерялось в анналах вебкеша.",
			"post_id": 9,
			"date_added": 1469890078
		},
		{
			"comment_id": 43,
			"body": "> [greasp](#comment_2_1KoUjTwdpBbxLtMMDoTgVu6DEmd87BENy6): уникальность этого пространства в том, что я тут чувствую себя как впервые в интернете, чистота.. свобода и всё такое. на этом этапе желательно не превратить это всё опять в помойку, поэтому спешить не стоит, imho.\n\nя не агитирую народ звать. Я тех зову, кто тут был уже и вносил лепту. Полезных людей так сказать. Потребители потом, да",
			"post_id": 9,
			"date_added": 1470066259
		},
		{
			"comment_id": 44,
			"body": "> [shift](#comment_15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Давай мануал по me а ?)\n\nтут еще разбираться надо :)",
			"post_id": 9,
			"date_added": 1471210729
		},
		{
			"comment_id": 45,
			"body": "> [shift](#comment_16_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Я в тебя верю))\n\nЯ в себя из-за ограничений по времени не верю, а ты веришь, ну",
			"post_id": 9,
			"date_added": 1471381826
		},
		{
			"comment_id": 46,
			"body": "> [tiwirp](#comment_1_17Dh8TKNm8ZUtQ4Qfad9cFyfJSo3mi8MDt): Вот, к стати и реализация, доступная для пощупать простым смертным, правда только Sequence Diagram: https://www.websequencediagrams.com\n\nСинтаксис вроде тот же. Это просто другое визуальное оформление для PlantUML?",
			"post_id": 11,
			"date_added": 1471983615
		},
		{
			"comment_id": 47,
			"body": "> [zalex](#comment_2_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Вот бы ещё ссылку на демку этого чуда :DЕсли пропустил ссылку - ткните меня, пожалуйста,\n\nНе пропустил, я не давал, потому что код уже вперед ушел, ну да ладно, вот оно [http://127.0.0.1:43110/1JMNrd9FD19AhWVukYJ2gdxAiK2ohczwk5/](http://127.0.0.1:43110/1JMNrd9FD19AhWVukYJ2gdxAiK2ohczwk5/)\n\nНе уверен правда, что мой нат позволит забрать его, надо будет на сервачок перекинуть",
			"post_id": 16,
			"date_added": 1496047691
		},
		{
			"comment_id": 48,
			"body": "> [slashnight](#comment_1_1315nYdk6uEJSitV3HWKSTAspXqDfZhRnB): Плеер не очень интересен, интереснее было бы про вещи связанные с ZeroNet.\n\nСпасибо, тогда пока не пишу, буду дальше работать над приложением, напишу как сделаю еще что-либо связанное с ZeroNet",
			"post_id": 17,
			"date_added": 1497276908
		},
		{
			"comment_id": 49,
			"body": "> [alexum](#comment_4_1NemTkZH4oqX2TvCt2y4XrF71fF56pqwZm): Продолжения не будет?\n\nБоюсь уже и нет, времени стало гораздо меньше, да и интерес именно к javascript пропал, после знакомства с Elm. Теперь я уже работаю как раз над возможностью создания зайтов на Elm [elm-zeronet](http://127.0.0.1:43110/19ZNbKNRKFfL5nQHRs6h5L1zsoic87u55A)",
			"post_id": 19,
			"date_added": 1575552400
		},
		{
			"comment_id": 50,
			"body": "> Конкретно elm'ом не особо интересуюсь, но использовать хаскелеподобный язык вместо js очень даже заманчиво\n\nТогда буду рад открытым ишью, а там явно еще есть что делать)",
			"post_id": 20,
			"date_added": 1576166838
		},
		{
			"comment_id": 51,
			"body": "> [wrewolf](#comment_9_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): welcome back )\n\nБлагодарю :)",
			"post_id": 20,
			"date_added": 1576166851
		},
		{
			"comment_id": 52,
			"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Зависимые типы и программы correct by construction в общем-то уже давно придумали, так что не само собой\n\nЯ скорее имел ввиду бизнес-логику, а не булеву :)\n",
			"post_id": 20,
			"date_added": 1576167817
		},
		{
			"comment_id": 53,
			"body": "> [koloved](#comment_1_1Nfdg8N5XXZQaK8jxopdUHcb8fZNBqfVzA): не хватает отдельного пункта для дебилов - зачем это вообще XD\n\nДелать зайты не только на js'e",
			"post_id": 20,
			"date_added": 1576738138
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {}
}