{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1614130163,
			"title": "Syntetizér/Groovebox do začátku",
			"body": "Jaký bys mi doporučil syntetizér jako začátečníkovi v hudební tvorbě?\n\nZatím jsem si hrál jenom Pocket Operatorem (Rick and Morty). Pomrkávám po Volca Drum, Circuit Tracks a OP-Z. Někde jsem viděl doporučení na Alesis S16 (S18 se mi asi libí víc), ale přijde mi že tam nejdou dělat žádným způsobem melodie.\n\nOP-Z už je fakt celkem dost strop. Možno je to dokonce i strop toho patra nademnou ;)",
			"added": 1614130162
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1614130163_1BsALUkhotDeqP9x5KLNLAn7Hepw3KRa3Z": [
			{
				"comment_id": 1,
				"body": "> [irishcoffee](#comment_2_1Mn2C722jSxg6Fj7bf6oDYGZMnYdJy31tZ): a co si myslis o nanostido / https://youtu.be/Stcf_8H_qVMpro iOS pro WIndows a sposta dalsich systemu\n\nNanoStudio 2 vypada kul, zkusim. Radsi bych asi ale neco fyzickyho. \n\nVcera jsem koukal na nejaky videa s Launchpad Pro a zacinam premyslet, jestli nemit ten synth jako software a nekoupit si jenom ovladac. Ta volnost jakou tam vidim u SW stoji u HW desetitisice a u SW je naprosto prirozena.",
				"added": 1614340154
			},
			{
				"comment_id": 2,
				"body": "> [irishcoffee](#comment_3_1Mn2C722jSxg6Fj7bf6oDYGZMnYdJy31tZ): dalehttps://vcvrack.com/https://de.wikipedia.org/wiki/VCV_Rackhttps://cdm.link/2020/04/free-modular-mutable-instruments-vcv-rack/Your first minutes in VCV Rack https://youtu.be/y0V8DAimr7I [...]\n\nA ty teda umi fyzicke kontrolery?",
				"added": 1614454362
			},
			{
				"comment_id": 3,
				"body": "Tak jsem nakonec skoncil s MC-101.",
				"added": 1616169984
			}
		],
		"1599491498_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "Jestli jsi na macOS, tak můžeš otevřít v QuickTime Playeru první video a ten zbytek pridat na konec tim, že je pretáhneš z Finderu na timeline videa.\n\nAť jsi na jakémkoliv stroji, či systému, tak můžeš nahrávky spojit ffmpegem -- https://trac.ffmpeg.org/wiki/Concatenate\n\nPokud víš, že budeš chtít výsledné video sdílet, tak to taky můžeš udělat přímo na YouTube, který už dneska spojování videí také umí.",
				"added": 1616596813
			}
		]
	},
	"comment_vote": {}
}